[
  {
    "title": "What does wording of Gaza ceasefire agreement tell us?",
    "url": "https://www.bbc.com/news/articles/ckgyr8e0gl2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3fad/live/2ef94db0-a5fb-11f0-92db-77261a15b9d2.jpg",
    "tag": "Trending",
    "date": "2025-10-10T17:25:41.000Z",
    "description": "16 hours agoHugo BachegaMiddle East correspondent, Jerusalem andBBC Visual Journalism teamGetty ImagesA ceasefire has come into effect for the war in Gaza, after the Israeli government approved a US-brokered...",
    "body": "16 hours agoHugo BachegaMiddle East correspondent, Jerusalem andBBC Visual Journalism teamGetty ImagesA ceasefire has come into effect for the war in Gaza, after the Israeli government approved a US-brokered deal with Hamas in negotiations that had the personal involvement of US President Donald Trump.The full text of the agreement has not been made public - but part of it has been published by Israeli media.It appears to lack details and in some cases is vague and ambiguous - perhaps on purpose.Even its title, \"Implementation steps for President Trump's proposal for a comprehensive end of Gaza War\", leaves room for different interpretations.The full title suggests these are steps for the implementation of the 20-point plan that President Trump announced at the White House last week. The document was agreed after negotiations in Egypt over the first phase of the plan, related to a ceasefire, a hostage and prisoner exchange, and a surge in humanitarian aid.However, by highlighting \"Comprehensive end of Gaza war\", the document appears to be announcing the end of the two-year-old war.This paragraph explicitly says the war is over, which sets the scene for future discussions on later stages of the president's plan for Gaza. It appears to suggest that, even if the negotiations reach an impasse, hostilities will not resume.This is crucial as key sticking points remain, including the Israeli demand for Hamas to disarm, the scale of the Israeli withdrawal, and a plan for who will govern the territory. The document does not mention guarantees that could have been given that the conflict will not restart, or what could happen if either side returns to fighting.Speaking after the deal was reached, Hamas's exiled Gaza leader, Khalil Al-Hayya, said he had received assurances from the US and other mediators that the war had ended.Meanwhile, the Israeli Prime Minister Benjamin Netanyahu has not publicly said that the conflict is over. Following the approval of the deal by the Israeli government, Netanyahu released a video in which he appeared to threaten to use force if Israel's demands, including Hamas's disarmament, were not met. \"If this is achieved in the easy way, it's all for the better. And if not, it'll be achieved the hard way,\" he said.The document does not mention the next steps for the full implementation of Trump's plan.This appears to leave room for a return of Israeli troops to areas they had withdrawn from if Hamas is seen as not being fully compliant with the deal. It provides no details about what could constitute a violation.And the text does not explicitly rule out air strikes. Prior to the deal, Hamas officials were concerned that there would be a situation like the one in Lebanon, where a ceasefire deal has not prevented near-daily air strikes on people and targets Israel says are linked to Hezbollah, the Shia militia and political movement. The Lebanese government says Israel's actions are violations of the deal, which was also brokered with US help.Despite the demand that all hostages, alive and dead, should be freed within 72 hours of the partial Israeli withdrawal, the text concedes, although not explicitly, that Hamas is unlikely to be able to retrieve all bodies from deceased hostages within that timeframe, allowing the group to share the information it had gathered about those that could not be located.The text does not say what could happen in case of delays in freeing the 20 captives believed to be alive.This suggests the creation of a mechanism to monitor the deal and report any violations.US officials said separately that the US was moving up to 200 troops already based in the Middle East to co-ordinate the multination force. Assuming the hostage and prisoner exchange is completed, the officials said the intention was for a so-called International Stabilisation Force to be built, although this was yet to be agreed between the sides.Next phase of deal unclearThis deal is a significant diplomatic breakthrough led by Trump, who wants to be remembered as the one who brought the conflict to an end. The president employed American leverage to force Netanyahu, who has been accused of sabotaging earlier efforts for a deal, to engage with the negotiations. Hamas came under pressure from Egypt, Qatar and Turkey, and from a population in desperate need of help.Israel launched the war in response to the Hamas attacks on 7 October 2023, when around 1,200 people were killed, mostly civilians, and 251 were taken hostage.Israel's military campaign has killed more than 67,000 Palestinians, mostly civilians and including more than 18,000 children, according to the Hamas-run health ministry, and led to a catastrophic humanitarian crisis.The first phase of the president's plan was, perhaps, the easiest one. Netanyahu was also facing growing domestic pressure, with polls consistently suggesting that the vast majority of Israelis wanted a deal with Hamas and the end of the war. Hamas, meanwhile, was apparently convinced that keeping the hostages had become a burden, giving Israel a reason to continue fighting.What happens next, however, is not clear. Progress will only happen if the Trump administration remains engaged, as both Israel and Hamas have reasons to stall the process. There is momentum, but major obstacles remain."
  },
  {
    "title": "A facelift at 28? Why young people are turning to cosmetic surgery",
    "url": "https://www.bbc.com/news/articles/czxwvr57424o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/05fb/live/f899dc60-a5fc-11f0-928c-71dbb8619e94.jpg",
    "tag": "Trending",
    "date": "2025-10-11T01:05:48.000Z",
    "description": "9 hours agoRuth CleggHealth and wellbeing reporterEmilyThe facelift is moving into new territory.A quick search on socials and my feed is inundated with posts from people in their late 20s, 30s, discussing...",
    "body": "9 hours agoRuth CleggHealth and wellbeing reporterEmilyThe facelift is moving into new territory.A quick search on socials and my feed is inundated with posts from people in their late 20s, 30s, discussing different types of facelift - the mini, the ponytail, the deep plane.Gone are the days when facelifts were reserved for the ageing wealthy - now an increasing number of younger people are opting to go under the knife.Some happily share pictures of their face before, after and the very bruised bit in between - their often very painful recovery.It's no longer a procedure that's spoken about in secret, celebrities like Kris Jenner, Catt Sadler and Marc Jacobs have spoken openly about their treatment. Many more are rumoured to have had one.The facelift is often seen as the last resort, the most major of cosmetic surgeries.Are people becoming so insecure in an often fake online world that they will pay thousands of pounds for the operation?Or have we had so many non-surgical treatments, such as Botox and fillers, that having our skin peeled from our cheekbones and our facial tissues and fat rearranged feels like a logical - and longer lasting - next step?EmilyEmily, pictured here in recovery and post-surgery, says she does not regret her operationFor Emily, who had a facelift at 28, it was about getting a \"snatched look\" - a sculpted, sharp jaw, high cheekbones and fox eyes. She says having surgery in Turkey was \"life-changing\" and she does not regret it.\"In total I had six surgeries rolled into one,\" she explains. \"Among them I had a mid- face lift, a lip lift and a rhinoplasty [nose job].\"Describing the process, the businesswoman from Toronto, Canada, says the surgeon played her favourite song as she went under general anaesthetic and then: \"I fell asleep and I woke up, threw up, and I had a new face and a new nose.\"The recovery process was long - the pain and bruising began to subside over the first few weeks, but it took six months for Emily to regain feeling in parts of her cheeks.Would she do it again? She hesitates. \"Since my surgery, I've changed my life. I'm healthier, I drink a lot less, I look after my skin, I sleep. I think if I knew what I know now I might not have gone through with it.\"My mum didn't even know until I told her a couple of days after surgery.\"But then she stops and reflects. \"But I just wanted to be the best version of myself,\" Emily says, \"and now I think I am.\"Figures from the British Association of Aesthetic Plastic Surgeons (BAAPS) show an 8% increase in facelifts over the past 12 months in the UK - they don't break down the figures by age, but many members report that the demographic is shifting.This is reflected in other parts of the world, with the American Society of Plastic Surgeons seeing a rise in Gen X (ages 45 to 60) opting for a facelift.Nora Nugent, president of BAAPS, believes there are a host of reasons for the change - including the rise of weight-loss medications.\"Losing weight so quickly on these drugs can leave a lot of excess skin. A facelift can help with that,\" she says. \"Techniques have developed massively - a facelift no longer means risking that 'wind tunnel' [an overly stretched face as a result of the skin being pulled back] effect on the face we saw many years ago.\" BAAPSDuring a facelift cuts are made on both sides of the face by the ear, extending up along the hairline. An incision is then made in the muscle that controls facial expressions, so that tissues and muscle can be repositionedHowever, a facelift is still a significant operation that should only be undertaken by a specialist, registered plastic surgeon in a registered facility with proper equipment, she says.At his clinic in Bristol, consultant plastic surgeon Simon Lee has carried out hundreds of facelifts - and shows me a video of one.For the duration of the procedure the client is wide awake, having had low levels of local anaesthetic injected into the skin and the deeper tissue beneath.He makes a series of small incisions in her face, before going under the skin, the fat and the superficial fascia (SMAS) - the part of the face which controls our expressions - then reaching the deep plane where he repositions tissue and muscles to reshape the face.As he finishes, the client, who has been under the knife for four hours, smiles in relief.One of the reasons it's become more appealing, Mr Lee says, is the ease with which face and neck lifts can now be carried out. Once reserved for a hospital theatre and requiring a general anaesthetic, he now carries the face and neck lift without sedation in his clinic.It's an \"exciting time\" in the industry, he says, with developments happening at speed. While the classic facelift - which focuses on the lower jaw and neck is still popular, there are newer treatments which target the upper two thirds of the face - where he says, the ageing process begins and is noticeable at a younger age.The surgeon caveats this saying a facelift is suitable for those over 40, but it would be very unusual to carry out such a complex procedure on someone in their 20s and 30s.There are risks and complications involved in these kind of procedures, such as developing a hematoma - a collection of blood under the skin which, if not treated, could lead to necrosis (death of surrounding tissues), infections, nerve injury and alopecia.A facelift costs, on average, £15,000-£45,000 in the UK, but there are clinics offering these procedures for as little as £5,000.Experts say it is important to do your research and choose a plastic surgeon who specialises in facelifts.Julia GilandoJulia Gilando went to Turkey for her surgeryJulia Gilando, 34, decided she needed a facelift to fix asymmetry in her face after having issues with the jaw alignment earlier in her life.Although many of her friends said they couldn't see a problem with her face, she felt it, \"trusted her gut\", and flew to Turkey for her procedure, which cost $8,000 (£6,000).Despite warnings about the risks associated with having cosmetic surgery in Turkey it has become increasingly popular to do so, mainly due to lower prices.\"At first I thought this whole idea was crazy, but I did my research and I decided to go for it,\" Ms Gilando, a healthcare professional, says. \"I was scared, I was in a foreign country, I was alone, and I didn't speak the language.\"After my surgery I spent two days in hospital and then had to fend for myself. I was so swollen I couldn't see.\"There were some dark times, it was a whole mental rollercoaster of emotions, you go through these highs and lows.\"There are concerns from researchers about whether such cosmetic surgery procedures give the self-esteem and confidence the industry advertises.\"I think there's an unprecedented pressure,\" Dr Kirsty Garbett, a body image expert from the Centre of Appearance Research at the University of West England, explains. \"Especially when it comes to the face - we see ourselves on video calls, social media platforms, we compare ourselves to others so easily.\"And she says, what we see isn't necessarily a true reflection of reality.\"AI, filters - all play a part in creating a fake online world. And, at the same time, we are seeing a rise in the normalisation of cosmetic procedures.\"Celebrities being more outspoken about having these operations is, in some ways, a good thing, she says, but it also normalises them - making them appear \"just a part of life and that is really worrying\".Caroline StanburyCaroline Stanbury describes her facelift as the \"best thing\" she's had doneCaroline Stanbury, TV presenter and one of the Real Housewives of Dubai, had a facelift two years ago aged 47, despite everyone telling her not to do it because she was too young.\"It was the best thing I have ever had done,\" Caroline says. \"Why do I want to wait until I am in my 60s, desperate and need it? I want to look and feel amazing now.\"Having spent 20 years getting regular Botox and fillers, she felt like she was \"beginning to look weird\". She paid $45,000 (£34,000) for a deep plane facelift in the US.\"I still look like me, and this procedure has given me another 20 years of feeling great,\" she says.Alexis Verpaele, a plastic surgeon based in Belgium, with clients from all over the world including the UK, says he's worried about the increasing number of younger people coming for the treatment.He often talks to these clients at length about ways certain looks can be achieved without something as major as surgery.\"If they have a facelift in their 20s, and we know it can last 10, 15 years say.\"So by the time they are 60, they might have had three facelifts,\" De Verpaele says.\"That's a lot of trauma for one face to endure - and that's the best case scenario without any complications.\"More weekend picks"
  },
  {
    "title": "Isak, Gyokeres, Woltemade, Sesko - how have big-name striker signings fared?",
    "url": "https://www.bbc.com/sport/football/articles/cx2xzxgw1qgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/84f4/live/f1938710-a3de-11f0-92db-77261a15b9d2.png",
    "tag": "Trending",
    "date": "2025-10-10T23:55:36.000Z",
    "description": "'It's going to be really bad': Fears over AI bubble bursting grow in Silicon Valley7 hours agoLily JamaliTechnology correspondent, San FranciscoGetty ImagesSilicon Valley is home to many major tech firms,...",
    "body": "'It's going to be really bad': Fears over AI bubble bursting grow in Silicon Valley7 hours agoLily JamaliTechnology correspondent, San FranciscoGetty ImagesSilicon Valley is home to many major tech firms, including Apple's circular headquartersAt OpenAI's DevDay this week, OpenAI boss Sam Altman did what American tech bosses rarely do these days: he actually answered questions from reporters.\"I know it's tempting to write the bubble story,\" Mr Altman told me as he sat flanked by his top lieutenants. \"In fact, there are many parts of AI that I think are kind of bubbly right now.\"In Silicon Valley, the debate over whether AI companies are overvalued has taken on a new urgency. Sceptics are privately - and some now publicly - asking whether the rapid rise in the value of AI tech companies may be, at least in part, the result of what they call \"financial engineering\".In other words - there are fears these companies are overvalued.Mr Altman said he expected investors would make some bad calls and silly start-ups would walk away with crazy money.But with OpenAI, he told me, \"there's something real happening here\".Not everyone is convinced.In recent days, warnings of an AI bubble have come from the Bank of England, the International Monetary Fund, as well as JP Morgan boss Jamie Dimon who told the BBC \"the level of uncertainty should be higher in most people's minds\".And here, in what is often considered the tech capital of the world, concerns are growing.At a panel discussion at Silicon Valley's Computer History Museum this week, early AI entrepreneur Jerry Kaplan told a packed audience he has lived through four bubbles.Getty ImagesJerry Kaplan founded Go Corporation, which developed early tablet computersHe's especially concerned now given the magnitude of money on the table as compared to the dot-com boom. There's so much more to lose.\"When [the bubble] breaks, it's going to be really bad, and not just for people in AI,\" he said. \"It's going to drag down the rest of the economy.\"However, at the Stanford Graduate School of Business, which has minted its fair share of tech entrepreneurs, Prof Anat Admati says while there have been many attempts to model when we're in the bubble, it can be a futile exercise.\"It is very hard to time a bubble,\" Prof Admati told me. \"And you can't say with certainty you were in one until after the bubble has burst.\"But the data is concerning to many.AI-related enterprises have accounted for 80% of the stunning gains in the American stock market this year - and Gartner estimates global spending on AI will likely reach a whopping $1.5tn (£1.1tn) before 2025 is out.OpenAI, which brought AI into the consumer mainstream with ChatGPT in 2022, is at the centre of the tangled web of deals drawing scrutiny.For example - last month, it entered into a $100bn deal with chipmaker Nvidia, which is itself the most valuable publicly traded company in the world.It expands an existing investment Nvidia already had in Mr Altman's company - with  expectations that OpenAI will build data centres powered with Nvidia's advanced chips.Then on Monday, OpenAI announced plans to purchase billions of dollars worth of equipment for developing AI from Nvidia rival AMD, in a deal that could make it one of AMD's largest shareholders.Remember this is a private company, albeit one recently valued at a half-trillion dollars.Then there's tech giant Microsoft, which is heavily invested, and cloud computing behemoth Oracle has a $300bn deal with OpenAI, too.OpenAI's Stargate project in Abilene, Texas, funded with the help of Oracle and Japanese conglomerate SoftBank and announced at the White House during President Donald Trump's first week in office, grows ever larger every few months. And as for Nvidia, it has a stake in AI startup CoreWeave - which supplies OpenAI with some of its massive infrastructure needs.Getty ImagesOpenAI boss Sam Altman And as these increasingly complex financing arrangements get more and more common, the experts here in Silicon Valley say they may be clouding perceptions on AI demand.Some people aren't mincing their words about it either, calling the deals \"circular financing\" or even \"vendor financing\" - where a company invests in or lends to its own customers so they can continue making purchases.\"Yes, the investment loans are unprecedented,\" Mr Altman told me on Monday. But, he added, \"it's also unprecedented for companies to be growing revenue this fast.\"OpenAI's revenue is growing quickly, but it has never turned a profit.And it is hardly a good sign that the people I've spoken to keep bringing up Nortel - the Canadian telecom equipment-maker that borrowed prolifically to help finance deals for their customers (and thereby artificially boost demand for their wares). For his part, Nvidia's Jensen Huang defended his deal with OpenAI on CNBC Monday, saying the firm isn't required to buy his company's tech with the money he invests.\"They can use it to do anything they like,\" Huang said. \"There's no exclusivities. Our primary goal is just really to support them and help them grow – and grow the ecosystem.\"Telltale signsMr Kaplan says he sees a couple of telltale signs the AI sector - and therefore the wider economy - could be in trouble.In frothy times, he says, companies announce major initiatives and product plans that they don't yet have the capital for.Meanwhile, retail investors clamour to get in on the start-up action.The surge in AMD stock this week could indicate investors are trying to get a piece of the ChatGPT wealth machine - and while all this is playing out, real physical infrastructure aimed at satisfying the seemingly insatiable hunger for more AI development is being built.\"We're creating a new man-made ecological disaster: enormous data centres in remote places like deserts, that will be rusting away and leaching bad things into the environment, with no one left to hold accountable because the builders and investors will be long gone,\" Mr Kaplan said.Getty ImagesOpenAI wants to secure $500bn to build a 10-gigawatt complex, under construction in Texas, by the end of this year.But even if we are in a bubble, the hope from Silicon Valley is investments being made now won't necessary go to waste.\"The thing that comforts me is that the internet was built on the ashes of the over-investment into the telecom infrastructure of yesterday,\" said Jeff Boudier, who builds products at the AI community hub Hugging Face.\"If there is overinvestment into infrastructure for AI workloads, there may be financial risks tied to it,\" he said. \"But it's going to enable lots of great new products and experiences including ones we're not thinking about today.\"There are plenty of believers in AI's potential to transform society.The question is whether the money to fund the ambitions of the foremost companies in the sector may be drying up.\"Nvidia looks like the last lender or investor,\" said Rihard Jarc, who founded the UncoverAlpha newsletter. \"Who else has the capacity right now to invest $100 billion in another company?\""
  },
  {
    "title": "Plaid promises free childcare if it wins Senedd election",
    "url": "https://www.bbc.com/news/articles/cewnv2xprzko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6900/live/0eb52e40-a5f9-11f0-928c-71dbb8619e94.jpg",
    "tag": "Trending",
    "date": "2025-10-10T16:38:28.000Z",
    "description": "15 hours agoDavid DeansWales political reporterRhun ap Iorwerth said that youngsters would get free childcare if his party wins power from LabourFamilies who have children aged nine months to four years old...",
    "body": "15 hours agoDavid DeansWales political reporterRhun ap Iorwerth said that youngsters would get free childcare if his party wins power from LabourFamilies who have children aged nine months to four years old will get free childcare if Plaid Cymru wins the next Welsh Parliament election, its leader has said. Rhun ap Iorwerth made the pledge as he told conference delegates he was ready to lead the country \"right now\", replacing Labour as the party of government.Labour has led Wales since the start of devolution in 1999, and has dominated Welsh politics for a century. The next Senedd election takes place in May.He said the \"transformative\" policy, offering at least 20 hours for 48 weeks a year by 2031, would be a \"helping hand with the things that matter the most\".He told the conference in Swansea that \"Labour's time is up\" and that Reform wanted to treat the Senedd as a \"plaything\" to gain an \"electoral foothold\".Ap Iorwerth called on voters who wanted to stop Reform to back his party, accusing Nigel Farage of spurring a summer of \"simmering hatred\".On Friday he said the 2026 vote will not be an independence election - but said it would \"kick-start\" the debate about whether Wales should go it alone.Currently help with childcare costs is only available to families whose parents are in work, education or training, or to very young children who live in a Flying Start area.Families whose parents are in work, training or education who has less than £100,000 a year in income would still get 30 hours a week for three to four-year-olds, as they do now.Some eligible two-year-olds qualify for 12.5 hours of care a week under Flying Start, but it is not available nationally.Plaid's plan would also allow ineligible families to claim 20 hours a week for three to four-year-olds for 48 weeks of the year, and all families 20 hours for nine-month-olds to two years.The party says the policy would be worth £32,500 to families for the first four years of their child's life.Matthew Horwood/Plaid CymruRhun ap Iorwerth was met with a standing ovation as he closed his speech in Braygwyn HallAp Iorwerth told BBC Wales: \"This can make a huge difference. It's a very, very important step in terms of helping families with the cost of living.\"This is universal, which marks it out from the system in England.\"The Welsh government has been under pressure to match childcare provision in England, where children between nine months and two years of working parents receive free child care.The Bevan Foundation has said that high costs were pushing more families into poverty and out of work.Plaid's plan would be in three stages. It is proposing to keep the existing 30 hour offer for three to four-year-olds, while extending the roll out of 12.5 hours a week for two-year-olds.The next step would be to give 20 hours to parents of three and four-year-olds who are not currently eligible for any help.The party would then try each year to increase the number of hours offered to children under the age of two.It would be rolled out over the life of the next Welsh Parliament, with the policy fully implemented in the 2030/31 financial year.The party says that by the end of the five-year roll out it will spend roughly an extra £500m a year on childcare - bringing the total cost to £800m. It says it can find the cash from the Welsh government's budget, with about £400m thought to be available in the next budget if other services increase by inflation.Ap Iorwerth said it was \"money that we know we can afford\".Getty ImagesPlaid Cymru says the policy would be worth £32,500 to families for the first four years of their child's lifeParty sources, asked why parents whose incomes are above £100,000 should get free childcare, said services that are delivered universally are better, and that households across demographics are struggling.Plaid says it would be the most generous childcare care offer in the UK.'Plaything'Ap Iorwerth, a former BBC Wales broadcaster, announced the policy in a speech where he set his party stall as a government-in-waiting.He called on his party to seize the \"historic opportunity ahead\" and turn it into \"reality\".Plaid Cymru has played a key role during the life of devolution, being an occasional supporter of Labour governments since 1999.It has been unable to beat Labour in an election - but recent opinion polling has suggested Plaid is vying with the party to win, as is Reform.The Member of the Senedd for Ynys Môn told the conference hall that Labour had forgotten \"where it came from who it was there to serve\".He said the UK had faced a summer of \"simmering hatred\", spurred on, he said, by Nigel Farage.\"Farage and his followers drive the deliberate fragmentation of society, giving life to the bogeyman without whom they are nothing.\"He said Reform UK wanted to treat the Senedd as a \"plaything\" to gain \"an electoral foothold\".'New leadership'Ap Iorwerth said Plaid was ready to govern \"right now\", promising to \"usher in an age of new leadership that will set Wales on a different path.\"\"We are not here as Labour's conscious, we are not here to repair Labour, we are here to replace them,\" he said.The party leader promised an \"immediate cash injection\" into the NHS to prioritise the longest waits.He warned that Reform threatened the health service with \"US-style bills\", and vowed to keep the NHS free at point of need.Matthew Horwood/Plaid CymruAp Iorwerth was elected the new leader of Plaid Cymru in 2023Ap Iorwerth was greeted with cheers and applause throughout the speech, and was given a standing ovation after he called on those who have \"never voted for Plaid Cymru before, the time is now\".\"The time is now to stop Reform and elect a government more radical, more ambitious, more impatient to bring about positive change.\"He said his government would be on the side of \"young and old, urban and rural, north and south, Welsh speaker, non Welsh-speaker\".The party has traditionally been stronger in its Welsh-speaking heartlands of north and west Wales.Plaid Cymru promised a referendum on independence at the last election in 2021 - but is not now.Earlier Ap Iorwerth told Radio Wales Breakfast the 2026 election would not be about independence for Plaid.\"There's no referendum... in the next few years,\" he said.But in his speech he said the party \"will kick start the national debate on independence\", building on the work of the previous commission on Wales' constitutional future by setting up a permanent commission.\"It's not just about aspiration, it's about creating the best chance to build a modern nation of good health, opportunity, prosperity, and fairness,\" he said.AnalysisRhun ap Iorwerth is hoping to be Wales' first non-Labour first minister - judging by the reaction in the hall, his members think he can.Plaid Cymru conferences can be business like affairs but there was a definite change in the atmosphere in Swansea - not a city in the party's usual heartland of north and west Wales - with a speech that was well received in Brangwyn Hall.It is not proposing wholescale shake up of public services - the party leader thinks that's too risky in the current climate - but says it offers \"radical\" plans such as a payment to tackle child poverty.Labour's woes have given the party the best chance it has ever had to lead Wales but Plaid faces some challenges.If Plaid came first it is possible they would have to work with Labour or other parties in some form, with no party having ever won a majority in the Senedd.It is also hoping to bring people who have never voted for Plaid into the fold, in the hope they are motivated by wanting to stop Reform.The party has to convince voters they are the best option to do that, while the Greens, the Lib Dems and Labour say similar things.They also face a Reform party that has Wales set in its sights - a party with greater resources, something Plaid has struggled with in the past."
  },
  {
    "title": "Trump administration issues layoff notices to more than 4,000 workers during government shutdown",
    "url": "https://www.bbc.com/news/articles/c1mxd1g71vxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3fda/live/7c459810-a5fd-11f0-9de9-634bcd03313f.jpg",
    "tag": "Trending",
    "date": "2025-10-11T01:04:24.000Z",
    "description": "Trump administration starts laying off thousands of workers 6 hours agoKayla Epstein andNardine SaadGetty ImagesDonald Trump's budget chief Russell Vought The Trump administration has begun laying off...",
    "body": "Trump administration starts laying off thousands of workers 6 hours agoKayla Epstein andNardine SaadGetty ImagesDonald Trump's budget chief Russell Vought The Trump administration has begun laying off thousands of federal workers in an effort to pressure Democrats amid the ongoing government shutdown.  \"The RIFs have begun,\" White House Office of Management Director Russell Vought announced in a post on X on Friday morning, referring to an acronym for \"reductions in force\". A spokesman for his office confirmed the cuts had started and were \"substantial\". Their size and scope began coming into focus later on Friday, when the administration disclosed seven agencies had started laying off more than 4,000 workers.President Donald Trump has repeatedly threatened to use the shutdown to further his long-held goal of reducing the federal workforce. By law, the federal government must give its workers at least 30-days notice that it is laying them off.After Vought's tweet, major departments such as Treasury and Health and Human Services (HHS) confirmed they were issuing notices to employees, and Homeland Security, where many of its employees are considered essential, said it would lay off workers at its Cybersecurity and Infrastructure Security Agency. But exact details were scarce.Two major unions, the American Federation of Government Employees and AFL-CIO, had filed a lawsuit challenging the legality of Vought's announced plans to carry out layoffs during the shutdown. On Friday, once he said the process had begun, they asked a federal court in Northern California to temporarily block the move.\"It is disgraceful that the Trump administration has used the government shutdown as an excuse to illegally fire thousands of workers who provide critical services to communities across the country,\" AFGE president Everett Kelley said.What makes this US shutdown different (and more difficult)In its opposition to the temporary restraining order, lawyers for the OMB revealed which agencies and how many of their employees would be affected first, indicating an estimated 4,600 employees would receive RIF notices starting on Friday. \"The President, through OMB, has determined that agencies should operate more efficiently and has directed them to consider steps to optimize their workforces in light of the ongoing lapse in appropriations,\" the justice department attorneys argued in the filing.More than a quarter of the cuts would be made at the Treasury Department, where notices were being sent to approximately 1,446 employees.HHS was notifying between 1,100 and 1,200 employees, the filing said.The Department of Education and Department of Housing and Urban Development intended to lay off at least 400 employees apiece, while the Departments of Commerce, Energy, Housing and Urban Development and Homeland Security each planned cuts ranging between 176 to 315 employees, according to the filing.There was no indication about how many notices the agencies issued on Friday.The filing also said that 20 to 30 at the Environmental Protection Agency were issued \"intent to RIF\" notice on Friday, notifying them that they may be affected in the future. Other federal agencies might also make cuts.The government lawyers said the labour unions had failed to establish that their members would be irreparably harmed by the layoffs, which is needed for the judge to grant the restraining order. But they said a restraining order would \"irreparably harm the government\".A temporary restraining order would prevent agencies \"determining how best to organize their workforces\", they argued, noting that the government has traditionally been granted the widest latitude in the \"dispatch of its own internal affairs\".Getty ImagesThe layoffs are unprecedented. In past shutdowns, furloughed employees returned to work when the government reopened and were paid retroactively for their time away. Both furloughed and \"essential\" workers who must still carry out their job duties are not paid when government funding is temporarily cut off.The current shutdown began 10 days ago, after lawmakers failed to reach a deal on a funding measure to keep the government open.\"They held off for 10 days,\" Republican Senator John Thune told reporters, referring to the White House. \"At some point they were going to have to make some of these decisions and prioritise where they're going to spend money when the government is shut down.\"Senate Minority Leader Chuck Schumer, a Democrat, accused Trump and Vought of causing \"deliberate chaos\".Democrats have refused to vote for a Republican spending plan that would reopen the government, saying any resolution must preserve expiring tax credits that reduce health insurance costs for millions of Americans and reverse Trump's cuts to Medicaid, the healthcare program for elderly and low-income people.Republicans accuse Democrats of unnecessarily bringing the government to a halt, and blame them for the knock-on effects caused by the federal work stoppage.A shutdown meant that \"non-essential\" federal workers would be placed on unpaid leave. It is currently affecting about 40% of the federal workforce - about 750,000 people. Furloughed employees are legally supposed to receive back-pay after a shutdown ends and they return to work, but the Trump administration has insinuated this might not happen.Significantly culling the federal workforce has been a long-term priority for Vought. The president and his budget chief have greeted the shutdown as a unique opportunity to make further firings on top of the thousands of cuts they have made since Trump returned to office in January through a combination of firings, buyouts, administrative leave and resignations.The Partnership for Public Service, a bipartisan group studying the government, estimated the federal workforce had been reduced by about 200,000 employees as of 23 September. Career services firm Challenger, Gray & Christmas, reported last month that the government sector had announced 299,755 planned job cuts this year, of which 289,363 were federal workers impacted by the Department of Government Efficiency (Doge), the White House cost-cutting effort initially led by billionaire Elon Musk.Before the shutdown, Vought's office instructed federal agencies to prepare reduction-in-force plans aimed at cutting employees or programmes whose funding might lapse or were \"not consistent with the President's priorities\",  Politico reported.One day after the shutdown began, Trump posted on Truth Social that he had met with Vought \"to determine which of the many Democrat Agencies, most of which are a political SCAM, he recommends to be cut, and whether or not those cuts will be temporary or permanent.\""
  },
  {
    "title": "Banned in the 80s: Moments That Shook Music",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002k85n?at_mid=XZLfF6kcDM&at_campaign=Banned_in_the_80s_Moments_That_Shook_Music&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002k85n&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Banned_in_the_80s_Moments_That_Shook_Music&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0m3w047.jpg",
    "tag": "Trending",
    "date": "2025-09-27T21:22:31.000Z",
    "description": "Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer           ...",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistBanned in the 80s: Moments That Shook MusicContains very strong language.Contains discriminatory languageDocumentary revealing the untold stories behind the most controversial music of the 1980s, featuring Frankie Goes to Hollywood, Queen, George Michael, N.W.A, Madonna and others. Duration55 minsFirst shown27 Sep 2025Available for 11 monthsWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesWhen Bruce Springsteen Came to BritainBorn in the USA, made in the UK. The Boss explains why Britain is so special to him59 minsSimple Minds: Everything Is PossibleDaring to dream. The inspirational story of Scotland's biggest band1h 27mSimon & Garfunkel: The Harmony GameInspiration – and separation. The stormy relationship that created beautiful music1h 11mWham!: Last Christmas Unwrapped40 years a festive favourite. Andrew, Pepsi and Shirlie revisit Wham!’s winter wonderland59 minsWhen Tina Turner Came to BritainLet’s stay together. From 60s starlet to 80s comeback queen, a career built in Britain59 minsDionne Warwick: Don't Make Me OverWhat the world needs now... How a sublime voice found a second life as a call for change1h 32mBryan Ferry and Roxy Music: A Musical HistoryDocumentary exploring the music of rock band Roxy Music and its frontman Bryan Ferry.58 minsCarole King and James Taylor: Just Call Out My NameLong ago and far away. Two sensational solo artists created the perfect partnership1h 33mLive Aid at 40: When Rock ’n’ Roll Took on the WorldNot just for one day. The creation and legacy of a concert that changed everythingSharon & Ozzy Osbourne: Coming HomeRock legend Ozzy's final chapter as Birmingham’s favourite son - and family - return home59 minsMr Blue Sky: The Story of Jeff Lynne and ELOThe pioneer of progressive pop – from the Brum beat scene to huge hits all over the world57 minsSince Yesterday: The Untold Story of Scotland's Girl BandsPopstars, punks and pioneers. Defiant trailblazers who rocked a mostly male music world1h 30m"
  },
  {
    "title": "Trump threatens to impose additional 100% tariff on China",
    "url": "https://www.bbc.com/news/articles/cn4wkd7729po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d52b/live/d6a268a0-a5ef-11f0-af09-bf7f0464c1dc.jpg",
    "tag": "Trending",
    "date": "2025-10-10T22:38:14.000Z",
    "description": "9 hours agoNatalie ShermanBusiness reporterWatch: 'It was shocking', Trump says of China's tightened export rules for rare earthsUS President Donald Trump has said he would impose an additional 100% tariff on...",
    "body": "9 hours agoNatalie ShermanBusiness reporterWatch: 'It was shocking', Trump says of China's tightened export rules for rare earthsUS President Donald Trump has said he would impose an additional 100% tariff on imports from China from next month. In a post on social media, Trump said the US would also put export controls on critical software. In an earlier post on Friday, he hit back at Beijing's move this week to tighten its rules for exports of rare earths, accusing China of \"becoming very hostile\" and trying to hold the world \"captive\".He threatened to pull out of a meeting with China's President Xi Jinping. He later said he had not cancelled it, but that he did not know \"that we're going to have it\". \"I'm going to be there regardless,\" he told reporters at the White House.Financial markets dropped in the wake of Trump's remarks, with the S&P 500 closing down 2.7%, its steepest fall since April.  China dominates production of rare earths and certain other key materials, which are key components in cars, smartphones and many other items.The last time Beijing tightened export controls - after Trump raised tariffs on Chinese goods early this year - there was an outcry from many US firms reliant on the materials. Carmaker Ford even had to temporarily pause production.In addition to tightening rules for rare earth exports, China has opened a monopoly investigation into the US tech firm Qualcomm that could stall its acquisition of another chipmaker. Getty ImagesTrump visited China in his first termAlthough Qualcomm is based in the US, a significant portion of its business is concentrated in China.Beijing has also said it will charge new port fees to ships with ties to the US, including those owned or operated by US firms.\"Some very strange things are happening in China!\" Trump wrote in a post on social media on Friday. \"They are becoming very hostile.\"The US and China have been in a fragile trade détente since May, when the two sides agreed to drop triple-digit tariffs on each others' goods that had nearly stopped trade between the two countries. The move left US tariffs on Chinese goods facing an added 30% levy compared with the start of the year, while US goods entering China face a new 10% tariff.Officials have held a series of talks since then on matters including TikTok, agricultural purchases, and the trade of rare earths and advanced technology like semiconductors.The two sides were expected to meet again this month at a summit in South Korea.China expert Jonathan Czin, a fellow at the Brookings Institution, said Xi's recent actions were a bid to shape the upcoming talks, noting that the recent rare earths directive does not go into effect immediately.\"He's looking for ways to seize the initiative,\" he said. \"The Trump administration is having to play a game of whack-a-mole and deal with these issues as they come up.\"He added that he did not think China was worried about US retaliation in response.\"What China took away from the Liberation Day tariffs and the cycle of escalation followed by de-escalation is that the Chinese side had a higher pain threshold,\" he said. \"From their perspective, the Trump administration blinked.\" In prior rounds of trade talks, China has pushed for looser US restrictions on semiconductors. It is also interested in securing more stable tariff policies that would make it easier for its businesses to sell into the US. Xi had previously used as leverage his country's dominance of rare earths production. But the export rules unveiled this week target overseas defence manufacturers, making them particularly serious, said Gracelin Baskaran, director of the critical minerals security program at Washington-based Center for Strategic and International Studies. \"Nothing makes America move like targeting our defence industry,\" she said. \"The US is going to have to negotiate because we have limited options, and in an era of rising geopolitical tension and potential conflict, we need to build our industrial defence base.\"While a Trump-Xi meeting now looks unlikely, she said it was not necessarily completely off the table. Ms Baskaran said there's still time and room for talks. China's new rules don't take effect until December. \"Negotiations are likely imminent,\" she said. \"Who does them and where they happen will be determined with time.\""
  },
  {
    "title": "Bardsey Island off Welsh coast looks for new tenants ",
    "url": "https://www.bbc.com/news/articles/cnvr076y68lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/df15/live/5e61e480-a453-11f0-8a21-ff96e44d1cc2.jpg",
    "tag": "Trending",
    "date": "2025-10-08T19:42:30.000Z",
    "description": "A tiny island with more sheep than people needs a new tenant - could you live here?2 days agoNathan BevanBBC WalesBBCDespite its remoteness, the island is described as being \"very much a living community\"A...",
    "body": "A tiny island with more sheep than people needs a new tenant - could you live here?2 days agoNathan BevanBBC WalesBBCDespite its remoteness, the island is described as being \"very much a living community\"A tiny island off Gwynedd's Llŷn Peninsula, with more sheep than humans, is looking for new nature-loving inhabitants to live and work there. Ynys Enlli, also known as Bardsey Island, is wind-whipped, sea-sprayed and most definitely off-grid, boasting - as it does - a current year-round population of just three people. In 2023, it also became the first International Dark Sky Sanctuary in Europe, meaning its unspoiled view of the night sky is protected for current and future generations.And now, for the first time in almost 20 years, the trust which owns and runs the island, is welcoming one adventurous family or couple to its craggy shoreline - and the \"opportunity of a lifetime\". Bardsey Island Trust is asking anyone who might be interested in moving there to come forward, with the successful applicant settling on the island in September 2026.Once comfortably installed, the newest residents will be in charge of managing its 200 sheep and 25 Welsh Black cattle, alongside current tenant famer Gareth Roberts, from Aberdaron.\"Gareth and his family have been there since 2007, and he knows the island intimately - and the challenges and benefits of living on Enlli,\" said the trust's chief officer, Sian Stacey, adding Mr Roberts will mentor the new arrivals.Measuring just 440 acres (0.69 square miles), the island is a national nature reserve and a site of special scientific interest (SSSI).International Dark Sky Sanctuary certification saw the island join 16 other sites worldwide, each of them recognised as the most remote and dark places on Earth. However, with a handful of seasonal residents living there temporarily, as wardens, for some of the year, Sian described it as being \"very much a living community\".\"I lived there for three years myself - it's an amazing place to be,\" she said.  What is Bardsey Island famous for?No wifi or electricity in the houses, and the water flows straight from a wellIt's a mile and a half at its longest and a half mile at its widestThe \"Burial Place of 20,000 Saints\" hails from the early Middle Ages, when it was believed three pilgrimages to Enlli were as spiritually significant as one to RomePilgrims, pirates, fishermen, and farmers have been visiting the island since the 2nd Century BC200 sheepThe 1821 lighthouse still stands at the southern end of the islandEurope's first Dark Sky SanctuaryHome to 30,000 breeding pairs of Manx shearwaterAmanda RuggeriThe island's sheep vastly outnumber its human residentsHailed as one of the holiest places in Britain during the Middle Ages, Ynys Enlli has been dubbed the Island of 20,000 Saints. Legend also casts it as the final resting place of pilgrims from across the world seeking salvation. An excavation in the 1990s unearthed dozens of medieval graves.More stories like this Related internet links"
  },
  {
    "title": "Super League Grand Final: Wigan Warriors face Hull KR once again",
    "url": "https://www.bbc.com/sport/rugby-league/articles/cj4y7y0j48ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/95e3/live/739329b0-a43d-11f0-b5e5-3d5590257ca4.jpg",
    "tag": "Trending",
    "date": "2025-10-10T11:24:07.000Z",
    "description": "Hull KR & Wigan set for repeat of 2024 Grand FinalImage source, SWPixImage caption, Wigan Warriors narrowly beat Hull KR in last year's Super League Grand Final to seal a historic quadrupleByJay...",
    "body": "Hull KR & Wigan set for repeat of 2024 Grand FinalImage source, SWPixImage caption, Wigan Warriors narrowly beat Hull KR in last year's Super League Grand Final to seal a historic quadrupleByJay FreemanBBC Sport EnglandTwo familiar foes will contest the showpiece event of the Super League season, but this year it could be a very different tale.Wigan Warriors, the 2024 victors, face Hull KR in Saturday's Grand Final for the second time in as many years.Just 12 months ago, the Cherry and Whites sealed victory in a nervy final under the lights at Old Trafford, capping off a historic quadruple.In 2025 it is the Robins who stand on the precipice of sporting greatness as they target a trio of trophies of their own.With so much at stake, BBC Sport takes a look at how both are shaping up before one of the biggest fixtures the sport has seen in the modern era.Media caption, We can make a difference to so many people's lives - MinchellaSuper League Grand Final: Hull KR v WiganSaturday, 11 OctoberListen to the Super League Grand Final on BBC Radio 5 Live on Saturday, 11 October with build up throughout from 12:00 BST, and watch highlights on BBC Two on Sunday, 12 October at 13:00 BSTHull KR 'have to get job done'It is a story that has been told time and again over the past couple of years, if for no other reason than to highlight just how much of an achievement it is for Hull KR to be tussling at the top.Just nine years ago, they lost their Super League spot in agonising fashion having initially led Salford Red Devils in the 2016 Million Pound Game before losing on golden point and dropping into the Championship as a result.Less than a decade later, they look set to complete one of the most impressive comebacks in sport, let alone rugby league, has ever seen and talismanic half-back Mikey Lewis summed it up best in his pre-match media commitments.\"We've built something at the club so we've got to believe each other and get this job done,\" he told BBC Radio Humberside.\"That's something that will fuel us on Saturday.\"Their record this season makes for remarkable reading having won the Challenge Cup and League Leaders' Shield - not bad for a club which finished bottom of the pile in Super League just five years ago.What makes this all the more impressive is the fact that Hull KR have been so undeterred by Wigan's quadruple last season that they've now threatened to win a treble themselves.\"When I first came to the club we were in a relegation battle and there wasn't much in it, either,\" forward Dean Hadley, who joined in 2019, added.\"To say five or six years on you've played in back-to-back Grand Finals, you've won a Challenge Cup and League Leaders, it's a totally different place.\"It's been a process, it's taken time. It's year on year making improvements. Not just on the field but off the field as well. You can feel it when you're at the club. It's a really good club and environment to be at. Players like myself and others have thrived in that.\"Hull KR set up their place in Saturday's final off the back of beating St Helens in the semi-final and Saturday will see some departures for the east Hull club.With the youthful but formidable Lewis, accompanied by the wisdom and stewardship of senior figures like Jared Waerea-Hargreaves and Micky McIlorum, Hull KR have assembled one of the most forbidding sides of the modern era.Yet the club, and sport, will wave goodbye to the veteran pair after Saturday's game as they retire.For Lewis, Saturday's Grand Final is not just an opportunity to win silverware, write themselves into the record books and tick another box - it is a chance to pay respect to two of the sport's greats in style.\"To put them into retirement having won all three trophies in the first year of being at the club would be a massive achievement for them,\" he added.\"It's something we'd be really proud of. The leadership and the accountability and the honesty they've brought to this team this year has been massive.\"To get the job done for each other, for the east side of Hull, the board, the chairman, Neil, for our families, we all sacrifice so much and to lift that trophy would be huge for everybody.\"Media caption, Highlights: Wigan complete clean sweep with Grand Final victoryWigan's chance to win three in a rowFor Wigan Warriors, they can regain some glory having missed out on silverware so far in 2025, not least because of how impressive Saturday's opponents have been.The Cherry and Whites have their own record to chase. Having reached a 14th Grand Final, they are 80 minutes away from winning three in a row for the first time in their history.In Luke Thompson, they have the perfect man to guide them to glory at Old Trafford, with the front rower never losing in a Grand Final in four appearances - twice with St Helens and twice with Wigan.\"I see a lot of similarities. I see a lot of commitment and professionalism. The hunger,\" Thompson told BBC Radio Manchester about the current Wigan set up compared to his time with Saints.\"They're slightly different teams. I think we play a bit differently but I think the quality that underpins both teams, you can definitely see some similarities.\"One man who could be in the mix for the Cherry and Whites is Brad O'Neill, who has his own motivation to take to the field on Saturday.The Wigan hooker missed out last year with a serious knee injury and had conflicting emotions having been unable to play his part in their quadruple glory.\"It was definitely a proud moment for myself watching on and seeing the team do something special that year,\" he said.\"It was a bittersweet feeling. It would have meant so much last year to play in it but the fact that we've got here now, I'm so grateful, and I definitely won't be taking it for granted come Saturday night.\"Media caption, 'We get to make a lot of people proud, and that's what drives us' - PeetWigan captain Liam Farrell is no stranger to a Super League Grand Final and knows what it takes to win on the big occasion.Whereas some players would be unnerved by the big occasion Farrell, in contrast, thrives off his nerves.\"If I played one game for Wigan, never mind the Grand Final, I'd have been very happy. But to be in the position I'm in now, leading my team out for a third year in a row, it's a very special feeling,\" Farrell told BBC Radio Manchester.\"I can't really put into words how special it is, but it's one I'm excited about and to create some more memories with the special group we've got.\"It calms me down, the fact that I do still get nervous. It makes me realise that I still care about what I do. I want us to win, I don't want to lose.\"The club wants success and the town wants success. I think that's where the nerves come from and I like the fact that I do get them.\"Farrell, a Wigan veteran, might well be in the twilight of his career at 35 but he still believes he has the fight in him to continue and will not hang up his boots regardless of the result on Saturday.\"If you're able to win one and go out like that, it'd be a nice way to go out, but I still think I've got a little bit more to give and the club wanted me to still stay on so I'm very happy about that,\" he added.\"I'd say psychologically I'm still enjoying it as well, that's probably the main thing for me, which is a big aspect and I think as long as I'm doing that and happy about what I'm doing then I'll still go around.\""
  },
  {
    "title": "Rescue teams search for missing German walker on Skye",
    "url": "https://www.bbc.com/news/articles/c3060411ddyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ea7/live/d8953370-a759-11f0-a302-6bcd0f505684.jpg",
    "tag": "Trending",
    "date": "2025-10-12T14:03:46.000Z",
    "description": "7 hours agoPolice ScotlandMatthias Beutin was last seen on Thursday morning before climbing Blà Bheinn on the Isle of SkyePolice and mountain rescue t",
    "body": "7 hours agoPolice ScotlandMatthias Beutin was last seen on Thursday morning before climbing Blà Bheinn on the Isle of SkyePolice and mountain rescue teams are searching for a German walker missing on the Isle of Skye.Matthias Beutin was last seen at Blaven car park, near Loch Slapin, at about 11:30 on Thursday before setting out to climb Blà Bheinn.Officers said the 57-year-old had not been in contact with his family since and concerns were growing for his wellbeing.The Skye Mountain Rescue Team carried out two full day searches on Friday and Saturday without success.Police Scotland urged anyone who may have seen Mr Beutin to come forward.He is described as about 5ft 9in, of average build with short, dark hair.Mr Beutin was last seen wearing a blue waterproof jacket, brown waterproof trousers and dark brown Meindl trekking shoes. He was carrying a small black and orange backpack.Skye Mountain Rescue TeamSeveral search and rescue teams have been involved in the search for Mr BeutinSgt David Mockett said it was \"out of character\" for Mr Beutin not to be in contact with his loved ones.Skye Mountain Rescue said teams faced \"challenging terrain\" and \"poor visibility\" during a search for Mr Beutin on Saturday.The Search and Rescue Dog Association, Kintail Mountain Rescue and the Royal Air Force Mountain Rescue Service also took part in the search.Blà Bheinn, also known as Blaven, is a popular Munro for walkers and climbers in an isolated part of Skye, on the outskirts of the Cullin Ridge.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rescue teams search for missing German walker on Skye",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6ea7/live/d8953370-a759-11f0-a302-6bcd0f505684.jpg"
      ],
      "datePublished": "2025-10-12T14:03:46.000Z",
      "dateModified": "2025-10-12T14:03:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What does wording of Gaza ceasefire agreement tell us?",
    "url": "https://www.bbc.com/news/articles/ckgyr8e0gl2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3fad/live/2ef94db0-a5fb-11f0-92db-77261a15b9d2.jpg",
    "tag": "Trending",
    "date": "2025-10-10T17:25:41.000Z",
    "description": "14 hours agoHugo BachegaMiddle East correspondent, Jerusalem andBBC Visual Journalism teamGetty ImagesA ceasefire has come into effect for the war in Gaza, after the Israeli government approved a US-brokered...",
    "body": "14 hours agoHugo BachegaMiddle East correspondent, Jerusalem andBBC Visual Journalism teamGetty ImagesA ceasefire has come into effect for the war in Gaza, after the Israeli government approved a US-brokered deal with Hamas in negotiations that had the personal involvement of US President Donald Trump.The full text of the agreement has not been made public - but part of it has been published by Israeli media.It appears to lack details and in some cases is vague and ambiguous - perhaps on purpose.Even its title, \"Implementation steps for President Trump's proposal for a comprehensive end of Gaza War\", leaves room for different interpretations.The full title suggests these are steps for the implementation of the 20-point plan that President Trump announced at the White House last week. The document was agreed after negotiations in Egypt over the first phase of the plan, related to a ceasefire, a hostage and prisoner exchange, and a surge in humanitarian aid.However, by highlighting \"Comprehensive end of Gaza war\", the document appears to be announcing the end of the two-year-old war.This paragraph explicitly says the war is over, which sets the scene for future discussions on later stages of the president's plan for Gaza. It appears to suggest that, even if the negotiations reach an impasse, hostilities will not resume.This is crucial as key sticking points remain, including the Israeli demand for Hamas to disarm, the scale of the Israeli withdrawal, and a plan for who will govern the territory. The document does not mention guarantees that could have been given that the conflict will not restart, or what could happen if either side returns to fighting.Speaking after the deal was reached, Hamas's exiled Gaza leader, Khalil Al-Hayya, said he had received assurances from the US and other mediators that the war had ended.Meanwhile, the Israeli Prime Minister Benjamin Netanyahu has not publicly said that the conflict is over. Following the approval of the deal by the Israeli government, Netanyahu released a video in which he appeared to threaten to use force if Israel's demands, including Hamas's disarmament, were not met. \"If this is achieved in the easy way, it's all for the better. And if not, it'll be achieved the hard way,\" he said.The document does not mention the next steps for the full implementation of Trump's plan.This appears to leave room for a return of Israeli troops to areas they had withdrawn from if Hamas is seen as not being fully compliant with the deal. It provides no details about what could constitute a violation.And the text does not explicitly rule out air strikes. Prior to the deal, Hamas officials were concerned that there would be a situation like the one in Lebanon, where a ceasefire deal has not prevented near-daily air strikes on people and targets Israel says are linked to Hezbollah, the Shia militia and political movement. The Lebanese government says Israel's actions are violations of the deal, which was also brokered with US help.Despite the demand that all hostages, alive and dead, should be freed within 72 hours of the partial Israeli withdrawal, the text concedes, although not explicitly, that Hamas is unlikely to be able to retrieve all bodies from deceased hostages within that timeframe, allowing the group to share the information it had gathered about those that could not be located.The text does not say what could happen in case of delays in freeing the 20 captives believed to be alive.This suggests the creation of a mechanism to monitor the deal and report any violations.US officials said separately that the US was moving up to 200 troops already based in the Middle East to co-ordinate the multination force. Assuming the hostage and prisoner exchange is completed, the officials said the intention was for a so-called International Stabilisation Force to be built, although this was yet to be agreed between the sides.Next phase of deal unclearThis deal is a significant diplomatic breakthrough led by Trump, who wants to be remembered as the one who brought the conflict to an end. The president employed American leverage to force Netanyahu, who has been accused of sabotaging earlier efforts for a deal, to engage with the negotiations. Hamas came under pressure from Egypt, Qatar and Turkey, and from a population in desperate need of help.Israel launched the war in response to the Hamas attacks on 7 October 2023, when around 1,200 people were killed, mostly civilians, and 251 were taken hostage.Israel's military campaign has killed more than 67,000 Palestinians, mostly civilians and including more than 18,000 children, according to the Hamas-run health ministry, and led to a catastrophic humanitarian crisis.The first phase of the president's plan was, perhaps, the easiest one. Netanyahu was also facing growing domestic pressure, with polls consistently suggesting that the vast majority of Israelis wanted a deal with Hamas and the end of the war. Hamas, meanwhile, was apparently convinced that keeping the hostages had become a burden, giving Israel a reason to continue fighting.What happens next, however, is not clear. Progress will only happen if the Trump administration remains engaged, as both Israel and Hamas have reasons to stall the process. There is momentum, but major obstacles remain."
  },
  {
    "title": "Tony Blair met Jeffrey Epstein while prime minister",
    "url": "https://www.bbc.com/news/articles/c5yk16gpxj0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f203/live/e5fc5b10-a60a-11f0-a188-efa4885b3354.jpg",
    "tag": "Trending",
    "date": "2025-10-10T19:24:26.000Z",
    "description": "12 hours agoJennifer McKiernanPolitical reporter,Joe PikePolitics investigations correspondent andSam FrancisPolitical reporterGetty ImagesSir Tony Blair met with Jeffrey Epstein in Downing Street while still...",
    "body": "12 hours agoJennifer McKiernanPolitical reporter,Joe PikePolitics investigations correspondent andSam FrancisPolitical reporterGetty ImagesSir Tony Blair met with Jeffrey Epstein in Downing Street while still prime minister, following lobbying by Lord Peter Mandelson, the BBC has confirmed.A memo written by senior civil servant Matthew Rycroft, dated 14 May 2002, briefs Sir Tony about \"super-rich\" financial adviser Epstein ahead of a meeting scheduled at 17.00 GMT that day.The meeting was six years before Epstein pleaded guilty to soliciting prostitution from a minor in June 2008.A spokesperson for Sir Tony said: \"As far as he can remember, Mr Blair met with him for less than 30 minutes in Downing Street in 2002, and discussed US and UK politics. He never met or engaged with him subsequently.\"He added: \"This was, of course, long before his crimes were known of and his subsequent conviction.\"Emails seen by BBC News show Lord Mandelson pushed for the meeting, telling Sir Tony's chief of staff Jonathan Powell that Epstein was \"a friend of mine\" who ex-US President Bill Clinton hoped to introduce to the PM.The release of this and several related documents had previously been blocked by government officials due to concerns about the impact on UK-US relations.The document has now been released by the National Archives under a Freedom of Information request, following the sacking of Lord Mandelson as US ambassador after fresh revelations about his friendship with the disgraced financier.In the email to Powell - the current UK government's national security adviser - Lord Mandelson refers to Epstein as \"safe\".The email on 7 May 2002 states: \"Do you remember when Clinton saw TB [Tony Blair] he said he wanted to introduce his travelling friend, Jeffrey Epstein, to TB?\"This was frustrated - TB said at the time - in the office for reasons (he says) he was unclear about. I think TB would be interested in meeting Jeffrey, who is also a friend of mine, because Jeffrey is an active scientific catalyst/entrepreneur as well as someone who has his finger on the pulse of many worldwide markets and currencies.\"He is young and vibrant. He is safe (whatever that means) and Clinton is now doing a lot of travelling with him.\"The email continues: \"I mentioned to TB that Jeffrey is in London next week and he said he would like to meet him.\"I have ascertained from Jeffrey that he is flexible - he could be here any time from Tuesday onwards to fit round the diary - but would obviously need to know reasonably quickly so as to re-schedule accordingly. Can you let me know?\"There are three separate handwritten notes on the print-out of the email, some of which are illegible, but one appears to read \"do you want to do this... Because you wanted to see Clinton by yourself... I know very little more about him\".At the time, Lord Mandelson was a backbench MP, having twice resigned from the cabinet, but still a force in Labour. Clinton has acknowledged being a former associate of Epstein but said had no knowledge of his crimes.Epstein was convicted in Florida for soliciting prostitution from a person under the age of 18 in 2008. He died in 2019 while awaiting trial on sex trafficking charges.The National Archive has also released a schedule headed Trade and Industry Meetings with Industry, which includes a memo published on 14 May 2002, briefing Sir Tony about Epstein ahead of a meeting schedule for 17.00 GMT that day. The briefing, written by senior civil servant Matthew Rycroft is marked R, understood to mean restricted.In the memo, Rycroft, who until March 2025 was the permanent secretary at the Home Office, wrote to Blair: \"Jeffrey Epstein is seeing you at 5pm today. \"He is a financial adviser to the super-rich and a property developer. He is a friend of Bill Clinton and Peter Mandelson.\"Rycroft states: \"The background on Epstein is that he is very rich and close to the Duke of York\".He adds: \"Peter says that Epstein now travels with Clinton and Clinton wants you to meet him.\"He thinks you would find worthwhile a conversation with him about a) science and b) international economic and monetary trends.\"The memo was also sent to Powell and Geoffrey Norris, one of Sir Tony's special advisers."
  },
  {
    "title": "Josh Padley: Doncaster boxer was able to quit day job after Shakur Stevenson loss ",
    "url": "https://www.bbc.com/sport/boxing/articles/c8rvn2y3xepo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8f77/live/173c5ce0-a1e5-11f0-ab23-d127b1d8dfad.jpg",
    "tag": "Trending",
    "date": "2025-10-11T06:39:31.000Z",
    "description": "'It worked perfectly' - how a loss secured Padley's careerImage source, Getty ImagesImage caption, Josh Padley will fight in front of his home support at Sheffield Arena on SaturdayByCharlotte CoatesBBC Sport...",
    "body": "'It worked perfectly' - how a loss secured Padley's careerImage source, Getty ImagesImage caption, Josh Padley will fight in front of his home support at Sheffield Arena on SaturdayByCharlotte CoatesBBC Sport journalist\"I don't have to go back to work.\" Josh Padley, the Doncaster electrician who took a fight with WBC lightweight world champion Shakur Stevenson at only four days' notice,, became one of the stories of 2025 - and changed his life despite suffering defeat for the first time. Had the unsigned fighter not answered his phone when the call came that Tuesday evening in February, he believes he would still be stuck in his day job.Instead, the 29-year-old travelled to Riyadh to earn the most significant pay cheque of his career, signed a multi-fight deal with Eddie Hearn's Matchroom promoters - and turned his hobby into a full-time job.\"That was my opportunity to fully announce myself to the world and better my career. I'd say it worked perfectly,\" he said.On Saturday he will face Reece Bellotti in Sheffield in a bout that marks the start of a new adventure for the now full-time fighter as he attempts to crack the super-featherweight division. \"Boxing was always a hobby - I got into it at 14, 15 years old. I always had it in my head that these guys that are professional have been in the gym since seven years old,\" Padley told BBC Sport.\"Now I'm able to do something I did as a hobby as a full-time job. It's amazing. I get to do what I love day in, day out - twice a day, three times a day.\"'I've got fans from America now'Image source, Getty ImagesImage caption, Padley was stopped in the ninth round against StevensonLate-notice fights do not always pay off as it has for Padley, and a loss can knock an in-form fighter off their stride.British light-middleweight Ishmael Davis took two successive late replacement fights in 2024, one at Wembley Stadium and one in Riyadh, and has now lost three in a row.\"There are always doubts over preparation,\" said Padley. \"I had four days to prepare [for the Stevenson fight] and you normally have eight to 12 weeks.\"As a fighter, undefeated at the time, my mindset going into that fight was 'if I pull this off, it'll go down in history'.\"Unfortunately, that didn't go our way, but I've got fans from America now that message me to this day saying they're looking out for me on my next fight. \"It did have a good effect even though I did lose.\"'I've had a taste and that's where I want to be'Padley was not signed to a major promotion when he accepted the Stevenson fight, but his dedication to the sport meant he was ready when the call eventually came \"You have to stay ready and around that weight category in case opportunities like that do come,\" he said.\"If I'd have ballooned up in weight and I'd not been in the gym just ticking over, then I wouldn't have been able to take the fight and I wouldn't be in this position today.\"After fighting the majority of his career at lightweight, Padley is set to embark on a new journey at super-featherweight when taking on Bellotti in Sheffield, 20 miles from his home of Doncaster. \"Now I'm able to be a full-time athlete, so I'm able to make more sacrifices regarding weight and discipline with my meals,\" Padley added.\"It's given me the opportunity to move down and have a good first fight against someone like Reece, who's been tried and tested.Bellotti, 34, has 20 wins and six losses on his record, but has been in the ring with top contenders Ryan Garner, Raymond Ford and Jordan Gill.Padley knows the route back to world title contention is a long one, but he intends to continue backing himself.\"Any boxer starting out should have high aspirations because that's the pinnacle of the sport,\" he said.\"I would love to get back on to those big Riyadh season cards - I've had a taste and that's where I want to be. \"Keep pushing on and aim as high as I can.\""
  },
  {
    "title": "Keely Hodgkinson: Athlos 800m win in New York for British runner",
    "url": "https://www.bbc.com/sport/athletics/articles/cy858nqqxwqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a6e9/live/8ab2b280-a665-11f0-b8e0-73867f5c92bd.jpg",
    "tag": "Trending",
    "date": "2025-10-11T06:01:45.000Z",
    "description": "Hodgkinson ends season with Athlos win in New YorkImage source, Getty ImagesImage caption, Hodgkinson ran her personal best time of 1:54.61 in London last yearByTom RostanceBBC Sport journalistKeely...",
    "body": "Hodgkinson ends season with Athlos win in New YorkImage source, Getty ImagesImage caption, Hodgkinson ran her personal best time of 1:54.61 in London last yearByTom RostanceBBC Sport journalistKeely Hodgkinson ended her 800m season with victory at the all-female Athlos meet in New York on Friday evening.The Olympic champion, who won bronze at the World Championships last month, cruised to an impressive win in one minute 56.53 seconds in what was only her sixth race in a season blighted by a hamstring injury.Fellow Briton and world silver medallist Georgia Hunter Bell was second again in 1:58.33, while St Vincent's Shafiqua Maloney (1:58.57) was third.\"I've barely raced this season so it was probably less of a struggle for me to go out there and want to give it something,\" said Hodgkinson, 23.\"The atmosphere out there is crazy so it was really, really fun.\"The women-only meet packed Icahn Stadium in its second year, bringing a party atmosphere to traditional track, with live music and Tiffany & Co. crowns replacing traditional winners' medals.The 23-times tennis major winner Serena Williams, who is married to Athlos founder Alexis Ohanian, was on hand to present the winners with their crowns.Last year's winners took home $60,000 (£44,603) - one of the largest prize purses in athletics.The event also attracted some of the sport's biggest names, as Kenya's three-time Olympic gold medallist and world record holder Faith Kipyegon won the mile, crossing the finish line in four hours 17.78 minutes.American Brittany Brown, the 200m bronze medallist from last year's Paris Olympics, won the 100m and 200m double."
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-10-11T04:34:42.000Z",
    "description": "Updated 2 hours agoBritain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your...",
    "body": "Updated 2 hours agoBritain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ."
  },
  {
    "title": "'They've destroyed everything': Palestinians return to devastation in Gaza City",
    "url": "https://www.bbc.com/news/articles/czew72350ngo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bde1/live/2229dd10-a5e8-11f0-920e-cb66ee1d5eb0.jpg",
    "tag": "Trending",
    "date": "2025-10-10T15:03:02.000Z",
    "description": "16 hours agoRushdi AbualoufGaza correspondent, reporting from Istanbul andRachel HaganBBC NewsEPAParts of Gaza City have been largely destroyedThousands of Palestinians have begun returning from southern Gaza...",
    "body": "16 hours agoRushdi AbualoufGaza correspondent, reporting from Istanbul andRachel HaganBBC NewsEPAParts of Gaza City have been largely destroyedThousands of Palestinians have begun returning from southern Gaza to Gaza City, weeks after fleeing the Israeli offensive that turned much of the city into rubble.Footage showed large numbers walking north up damaged narrow coastal roads towards the collapsed towers and ruined buildings of the territory's biggest city.The returnees, many travelling on foot for more than 20km, carried what remained of their belongings on their backs. Those who could afford it paid high prices to hire donkey carts or small trucks to make the arduous journey north.Some waved Palestinian flags and flashed victory signs. But the prevailing mood was one of exhaustion. Many appeared weak and malnourished after months of displacement, hunger and fear.\"The road is long and difficult, there's no food or water,\" says Alaa Saleh, a schoolteacher who fled Gaza City with his wife and six children to Khan Younis.\"I left my family behind and started walking north. Thousands around me are struggling. Hiring a car costs around 4,000 shekels (£924; $1,227), far beyond what most people can afford.\"Those returning say they are driven by desperation rather than confidence that it is safe. Many have already been told that their homes no longer exist.Around 700,000 people from Gaza City and the north were displaced by the Israeli offensive, which saw intense aerial bombardment and the entry of troops into some neighbourhoods. The Israeli military described Gaza City as Hamas's \"last stronghold\".ReutersAfter they pulled back under the terms of the ceasefire and hostage release deal agreed between Israel and Hamas and approved by the Israeli government, residents in northern and western Gaza City were left stunned at the unprecedented devastation left behind.For the first time in weeks, people entered the Sheikh Radwan, Karama and Beach Camp areas and found entire residential blocks flattened, hundreds of homes destroyed and much of the areas' infrastructure wiped out.Dozens of videos on social media show residents walking through the rubble, filming what remains of their neighbourhoods. In one clip, a man says: \"This is the last area we can reach. The Israeli army is still nearby. Look at the scale of destruction, they've destroyed everything.\"Other videos show circulating show similar destruction in the Sabra and Zeitoun neighbourhoods to the south and east, where entire apartment blocks have been levelled.As some filmed the ruins, others rushed to help Hamas's Gaza Civil Defense teams recover bodies from beneath the debris. Spokesman Mahmoud Basal told the BBC that eight bodies were pulled out from northern Gaza on Friday morning, as rescue teams continue searching \"with very limited means\" in other areas.ReutersFor the first time in weeks, people have entered areas only to find entire residential blocks flattenedAfter two years, the scale of contamination from unexploded ordnance (UXO) has yet to be fully determined, the Mines Advisory Group (MAG) said. UXO will be present in the rubble of destroyed buildings many people are returning to.Despite the withdrawal of Israeli forces from several districts, access to many parts of Gaza City is still restricted.Meanwhile the city's once-bustling seafront, where families gathered on summer evenings, has become a corridor of tents and broken concrete, the site of a mass migration through the ruins. Fears persist that the fragile calm could be temporary, yet for Alaa Saleh, the schoolteacher, returning north felt like the only option.\"My house was destroyed a year ago. I was living in a tent on the ruins, and I will go back and pitch my tent again. We just want to rebuild. We're tired of living in tents that protect us from neither the heat of summer nor the cold of winter.\"Wael Al-Najjar, who was returning to his home in Jabalia in the north, said he had been displaced three times since the war began.As soon as news of the ceasefire deal broke, he got ready to return home.\"We are waiting, sitting by the crossing. My son and I slept here last night, on the pavement, in the cold, waiting to go back home,\" he told a BBC freelancer.\"Even if the house is destroyed, even if it's just rubble, we'll go back, put up a tent, and return to our people.\"Additional reporting by Alice Cuddy"
  },
  {
    "title": "A facelift at 28? Why young people are turning to cosmetic surgery",
    "url": "https://www.bbc.com/news/articles/czxwvr57424o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/05fb/live/f899dc60-a5fc-11f0-928c-71dbb8619e94.jpg",
    "tag": "Trending",
    "date": "2025-10-11T01:05:48.000Z",
    "description": "6 hours agoRuth CleggHealth and wellbeing reporterEmilyThe facelift is moving into new territory.A quick search on socials and my feed is inundated with posts from people in their late 20s, 30s, discussing...",
    "body": "6 hours agoRuth CleggHealth and wellbeing reporterEmilyThe facelift is moving into new territory.A quick search on socials and my feed is inundated with posts from people in their late 20s, 30s, discussing different types of facelift - the mini, the ponytail, the deep plane.Gone are the days when facelifts were reserved for the ageing wealthy - now an increasing number of younger people are opting to go under the knife.Some happily share pictures of their face before, after and the very bruised bit in between - their often very painful recovery.It's no longer a procedure that's spoken about in secret, celebrities like Kris Jenner, Catt Sadler and Marc Jacobs have spoken openly about their treatment. Many more are rumoured to have had one.The facelift is often seen as the last resort, the most major of cosmetic surgeries.Are people becoming so insecure in an often fake online world that they will pay thousands of pounds for the operation?Or have we had so many non-surgical treatments, such as Botox and fillers, that having our skin peeled from our cheekbones and our facial tissues and fat rearranged feels like a logical - and longer lasting - next step?EmilyEmily, pictured here in recovery and post-surgery, says she does not regret her operationFor Emily, who had a facelift at 28, it was about getting a \"snatched look\" - a sculpted, sharp jaw, high cheekbones and fox eyes. She says having surgery in Turkey was \"life-changing\" and she does not regret it.\"In total I had six surgeries rolled into one,\" she explains. \"Among them I had a mid- face lift, a lip lift and a rhinoplasty [nose job].\"Describing the process, the businesswoman from Toronto, Canada, says the surgeon played her favourite song as she went under general anaesthetic and then: \"I fell asleep and I woke up, threw up, and I had a new face and a new nose.\"The recovery process was long - the pain and bruising began to subside over the first few weeks, but it took six months for Emily to regain feeling in parts of her cheeks.Would she do it again? She hesitates. \"Since my surgery, I've changed my life. I'm healthier, I drink a lot less, I look after my skin, I sleep. I think if I knew what I know now I might not have gone through with it.\"My mum didn't even know until I told her a couple of days after surgery.\"But then she stops and reflects. \"But I just wanted to be the best version of myself,\" Emily says, \"and now I think I am.\"Figures from the British Association of Aesthetic Plastic Surgeons (BAAPS) show an 8% increase in facelifts over the past 12 months in the UK - they don't break down the figures by age, but many members report that the demographic is shifting.This is reflected in other parts of the world, with the American Society of Plastic Surgeons seeing a rise in Gen X (ages 45 to 60) opting for a facelift.Nora Nugent, president of BAAPS, believes there are a host of reasons for the change - including the rise of weight-loss medications.\"Losing weight so quickly on these drugs can leave a lot of excess skin. A facelift can help with that,\" she says. \"Techniques have developed massively - a facelift no longer means risking that 'wind tunnel' [an overly stretched face as a result of the skin being pulled back] effect on the face we saw many years ago.\" BAAPSDuring a facelift cuts are made on both sides of the face by the ear, extending up along the hairline. An incision is then made in the muscle that controls facial expressions, so that tissues and muscle can be repositionedHowever, a facelift is still a significant operation that should only be undertaken by a specialist, registered plastic surgeon in a registered facility with proper equipment, she says.At his clinic in Bristol, consultant plastic surgeon Simon Lee has carried out hundreds of facelifts - and shows me a video of one.For the duration of the procedure the client is wide awake, having had low levels of local anaesthetic injected into the skin and the deeper tissue beneath.He makes a series of small incisions in her face, before going under the skin, the fat and the superficial fascia (SMAS) - the part of the face which controls our expressions - then reaching the deep plane where he repositions tissue and muscles to reshape the face.As he finishes, the client, who has been under the knife for four hours, smiles in relief.One of the reasons it's become more appealing, Mr Lee says, is the ease with which face and neck lifts can now be carried out. Once reserved for a hospital theatre and requiring a general anaesthetic, he now carries the face and neck lift without sedation in his clinic.It's an \"exciting time\" in the industry, he says, with developments happening at speed. While the classic facelift - which focuses on the lower jaw and neck is still popular, there are newer treatments which target the upper two thirds of the face - where he says, the ageing process begins and is noticeable at a younger age.The surgeon caveats this saying a facelift is suitable for those over 40, but it would be very unusual to carry out such a complex procedure on someone in their 20s and 30s.There are risks and complications involved in these kind of procedures, such as developing a hematoma - a collection of blood under the skin which, if not treated, could lead to necrosis (death of surrounding tissues), infections, nerve injury and alopecia.A facelift costs, on average, £15,000-£45,000 in the UK, but there are clinics offering these procedures for as little as £5,000.Experts say it is important to do your research and choose a plastic surgeon who specialises in facelifts.Julia GilandoJulia Gilando went to Turkey for her surgeryJulia Gilando, 34, decided she needed a facelift to fix asymmetry in her face after having issues with the jaw alignment earlier in her life.Although many of her friends said they couldn't see a problem with her face, she felt it, \"trusted her gut\", and flew to Turkey for her procedure, which cost $8,000 (£6,000).Despite warnings about the risks associated with having cosmetic surgery in Turkey it has become increasingly popular to do so, mainly due to lower prices.\"At first I thought this whole idea was crazy, but I did my research and I decided to go for it,\" Ms Gilando, a healthcare professional, says. \"I was scared, I was in a foreign country, I was alone, and I didn't speak the language.\"After my surgery I spent two days in hospital and then had to fend for myself. I was so swollen I couldn't see.\"There were some dark times, it was a whole mental rollercoaster of emotions, you go through these highs and lows.\"There are concerns from researchers about whether such cosmetic surgery procedures give the self-esteem and confidence the industry advertises.\"I think there's an unprecedented pressure,\" Dr Kirsty Garbett, a body image expert from the Centre of Appearance Research at the University of West England, explains. \"Especially when it comes to the face - we see ourselves on video calls, social media platforms, we compare ourselves to others so easily.\"And she says, what we see isn't necessarily a true reflection of reality.\"AI, filters - all play a part in creating a fake online world. And, at the same time, we are seeing a rise in the normalisation of cosmetic procedures.\"Celebrities being more outspoken about having these operations is, in some ways, a good thing, she says, but it also normalises them - making them appear \"just a part of life and that is really worrying\".Caroline StanburyCaroline Stanbury describes her facelift as the \"best thing\" she's had doneCaroline Stanbury, TV presenter and one of the Real Housewives of Dubai, had a facelift two years ago aged 47, despite everyone telling her not to do it because she was too young.\"It was the best thing I have ever had done,\" Caroline says. \"Why do I want to wait until I am in my 60s, desperate and need it? I want to look and feel amazing now.\"Having spent 20 years getting regular Botox and fillers, she felt like she was \"beginning to look weird\". She paid $45,000 (£34,000) for a deep plane facelift in the US.\"I still look like me, and this procedure has given me another 20 years of feeling great,\" she says.Alexis Verpaele, a plastic surgeon based in Belgium, with clients from all over the world including the UK, says he's worried about the increasing number of younger people coming for the treatment.He often talks to these clients at length about ways certain looks can be achieved without something as major as surgery.\"If they have a facelift in their 20s, and we know it can last 10, 15 years say.\"So by the time they are 60, they might have had three facelifts,\" De Verpaele says.\"That's a lot of trauma for one face to endure - and that's the best case scenario without any complications.\"More weekend picks"
  }
]