[
  {
    "title": "2026 Winter Olympics Closing Ceremony: Milan-Cortina concludes in Verona",
    "url": "https://www.bbc.com/sport/articles/cgl5z5xg303o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ec67/live/c7d69a30-1034-11f1-801d-ed3cff6bf876.jpg",
    "tag": "Trending",
    "date": "2026-02-22T22:08:15.000Z",
    "description": "The Milan-Cortina 2026 Winter Olympics have officially ended following the closing ceremony in northern Italy.It took place at Verona Olympic Arena, d",
    "body": "The Milan-Cortina 2026 Winter Olympics have officially ended following the closing ceremony in northern Italy.It took place at Verona Olympic Arena, despite none of the sporting events happening in the city, which is 75 miles from Milan.After beginning with a tribute to classic Italian opera, flagbearers representing the 92 competing nations entered the stadium through large props from Aida and accompanied by a tribute to Italian film music.The 'Drop of Fire' – the Olympic flame carried in a small glass vessel – was brought into the ancient arena to light up the rings before the parade of athletes.While athletes are supposed to come in all mixed together, here they were still largely in national groups.The final medals from Milan-Cortina 2026 were awarded in the women's and men's 50km mass start cross-country skiing events, before a tribute to the Games volunteers.The ceremony finished with performances from popular Italian musicians Major Lazer and singer-songwriter Achille Lauro.In her speech to close the Games, International Olympic Committee (IOC) president Kirsty Coventry said: \"You have been incredible – every one of you. Brave. Fearless. Full of heart and passion. You left it all on the snow and ice.\"Two unforgettable weeks, living every moment to the fullest. You gave everything – and you shared it with all of us.\"This is the true Olympic spirit: competing, embracing, lifting each other up, whatever the result. You showed us what excellence, respect, and friendship look like in a world that sometimes forgets these values.\"You showed us that the Olympic Games are a place for everyone. A place where sport brings us together.\"It ended a Games which saw 116 medal events, and historic sporting success for several of the competing nations – including Great Britain.Team GB won five medals, including three golds, to finish 15th in the table. Britain has never previously won more than one gold at a Games before.Matt Weston, the male flagbearer, won two golds in skeleton – the men's event and the team competition with Tabby Stoeker.The female GB flagbearer was Charlotte Bankes, who won gold in the team snowboard cross with Huw Nightingale; it was the first Olympic event on snow won by British athletes.Team GB also won silver in the men's curling, while Zoe Atkin claimed bronze in women's ski halfpipe on the final day.Brazil's Lucas Pinheiro Braathen took the men's giant slalom title to register a first Winter Olympic gold won by a South American nation.Georgia earned their first Winter Olympic medal with silver in pairs figure skating, while Spain collected their first gold medal for 54 years in the men's ski mountaineering. Benin, Guinea-Bissau and United Arab Emirates competed in their first Winter Games.For hosts Italy, Milan-Cortina marked their best Winter Games with 10 golds among 30 medals to put them fourth in the table.Norway topped the medals table for the fourth successive Games. They collected 18 medals, including six for Johannes Hoesflot Klaebo, the king of cross-country skiing.Had Klaebo, who set a record for the most golds won by an individual athlete at a single Games, competed as a nation on his own, he would have been ninth in the medal table. Fittingly, his sixth gold - in the men's 50km cross-country skiing - was presented at the closing ceremony as the final medal awarded at the Games.The oldest individual medallist was Elana Meyers Taylor of the United States, who broke the Games record by winning monobob gold, aged 41.Skiing great Lindsey Vonn saw her Olympic career end with a broken leg.The Games also had controversial moments.Ukraine's Vladyslav Heraskevych wished to compete in the men's skeleton while wearing a remembrance helmet featuring artwork depicting athletes killed during the Russian invasion of his country.But the IOC said this contravened Games rules and, after Heraskevych refused to back down, disqualified him from competing.There was also a silver medal, in men's ski mountaineering, for Russian athlete Nikita Filippov. He competed as an Individual Neutral Athlete (AIN) because Russia were banned from the Games because of their aggression in Ukraine.Filippov, along with other AIN competitors, was allowed to take part in the closing ceremony having been banned from the opening event.Men's curling gold medallists Canada had their campaign dogged by allegations of cheating.The ceremony included the handover of the Olympic flag to the delegation representing the French Alps, which will host the next Winter Games in 2030.The presidents of the two French regions to host the Games, Renaud Muselier and Fabrice Pannekoucke, enthusiastically accepted the flag from Coventry.There was a performance of the sixth verse of La Marseillaise, the French national anthem, as it was deemed to be more universal and less patriotic. The arrangement changed throughout into a more contemporary style with an electronic base.As well as a video showcasing the Alps, there was also a performance by 25 musicians and 24 athletes – the first time Olympians have featured in the artistic elements of the closing ceremony.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Winter Olympics Closing Ceremony: Milan-Cortina concludes in Verona",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ec67/live/c7d69a30-1034-11f1-801d-ed3cff6bf876.jpg"
      ],
      "datePublished": "2026-02-22T22:08:15.000Z",
      "dateModified": "2026-02-22T22:08:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Six Nations talking points: Finn Russell, George Ford, Antoine Dupont and Robert Baloucoune",
    "url": "https://www.bbc.com/sport/rugby-union/articles/cjrqlq0w01no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/863d/live/3b36e010-1031-11f1-801d-ed3cff6bf876.jpg",
    "tag": "Trending",
    "date": "2026-02-23T06:18:08.000Z",
    "description": "Five talking points from round three of Six NationsMedia caption, Graham scores try for Scotland straight from restartByTom RostanceBBC Sport journali",
    "body": "Five talking points from round three of Six NationsMedia caption, Graham scores try for Scotland straight from restartByTom RostanceBBC Sport journalistEngland went from bad to disastrous, France didn't fire on all cylinders but had enough to maintain their Grand Slam challenge, Scotland dug deep for a big win and Ireland were just tremendous.Here are five players who provided talking points in the third round of the Six Nations, with a two-week break to come before round four...'Russell rocked up when it matters'Media caption, 'It was pretty easy' - Humble Russell analyses own tryThe opportunity and ability for teams to rewrite their own narratives in the space of just a few weeks is part of what makes the Six Nations so compelling.Lacklustre and outgunned in Rome in week one, Scotland are now France's biggest challengers after following up the Calcutta Cup demolition of England with a nailbiting, nerve-wrenching win in Wales.The hosts were 23-12 up with just over 20 minutes to go but Scotland roared back to win 26-23 after some brilliant quick thinking from fly-half Finn Russell.He switched the momentum of the match with a kick that caught Wales out and allowed Darcy Graham to score in the corner. Yet again, the Bath number 10 was the difference-maker.\"Big-game players turn up when it matters and Russell had moments when he bailed Scotland out,\" former Wales captain Sam Warburton told BBC Rugby Special.\"He was exceptional at managing the team when they were down in the game. He waits for the perfect moment to get involved.\"He plays what he sees, he has that licence and his clutch kicking was immense. The big-game player rocked up in the last 30 minutes, he was immaculate and a big part of the comeback.\"\"Scotland found a way to win ugly,\" added their former flanker John Barclay.\"They found solutions and ground their way in. In some ways that was the most important win they have had in a while. It has given them a strong position in the table.\"Up next? France at Murrayfield on Saturday,  7 March, and the chance to end Les Bleus' Grand Slam dreams after three successive wins.Dupont ' a huge influence' for FranceMedia caption, France ease to bonus-point win over ItalyFrance remain in the driving seat for a 20th title - third in five years - and can seal it with a bonus-point win in Edinburgh.They were made to graft by ever-improving Italy in Lille, but eventually streaked away to win 33-8, aided by another classy display from star scrum-half and captain Antoine Dupont.A brilliant kick set up the opening score for Louis Bielle-Biarrey, before Dupont then showed his defensive strengths during a dominant second-half spell from the visitors.\"It's perhaps unfair that we expect him to do outrageous things every week,\" said Barclay.\"He is coming back from a knee injury and was maybe a bit quiet in the first two games, but he really stepped up.\"You have to admire his ability to scan the play under pressure, see space and deliver the skill for France to score that first try. His physical side of the game is impressive, he makes tackles and does so much good stuff.\"He had a huge influence on the game which is what we have come to expect. \"France will be heavy favourites in Scotland but that is an exciting game. Perhaps only South Africa can match them for power at the moment.\"Meanwhile, Bielle-Biarrey became the first player in Six Nations history to score in eight successive matches. He has scored 13 tries in 12 Six Nations games and 24 in 25 overall. Quite the strike-rate.Should time be up for Ford?Media caption, England couldn't match Ireland intensity - analysisWhile Scotland's campaign has been revitalised by back-to-back victories, England's has been utterly derailed by two losses.They were blown away by Ireland at Twickenham as the men in green ran in five tries to embarrass Steve Borthwick's side 42-21.England entered the tournament with a settled-looking side, but now look a muddle with Matt Dawson calling for Fin Smith to replace George Ford at number 10.Warburton was confused by Ford's kicking - or lack of - against Ireland.He said: \"England are normally patient in their kick battle but Ford missed some kicks that were a real momentum killer.\"England are a kicking team and when they do it well they look really good. He won so much territory against Wales and in the last two games it's been the other end of the spectrum.\"Ford is an exceptional tactical kicker but he has not been kicking in the last two games and they have struggled as a result of it.\"\"I am surprised by England,\" added Barclay.\"We thought it was a shootout between them and France for a Grand Slam before the tournament. The most concerning thing is the nature of the defeats. Where are England now? We don't really know.\"The last two performances have thrown up a lot of question marks about selection. What's the best back three, who should play at centre, is George Ford the man at 10?\"Rewind a few weeks and you could name the team. It seems to have fallen apart a bit.\"Next up for England is a trip on Saturday, 7 March, to Rome that looks anything but inviting.Ireland's forgotten man becomes undroppableMedia caption, Ireland reignite title bid with record away win over EnglandIreland's resurgence was personified by Robert Baloucoune.The 28-year-old had not featured for Ireland since November 2022 because of injury, but he started and scored against Italy before scoring again in an all-action performance against England.The wing thought his international career was over but instead played a huge part in a famous win, troubling England speedster Henry Arundell with his work-rate.\"He was unbelievable,\" said Barclay. \"His willingness to work off the ball is how you win games.\"He put in dominant tackles, won turnovers. The mindset and energy he bought to the game away from home set the tempo.\"\"Ireland's desire and work-rate off the ball won them the game,\" added Warburton.\"Paul O'Connell's quote when I was on Lions duty with him was, 'Be the best at everything that requires no talent' -  and Ireland were that.\"Their attack looks like the one of old. They were super-organised and their aerial dominance was a launchpad. They were so efficient in the red zone and their speed of ball was too good, England couldn't recover from it.\"Ireland face Wales next in a Friday night feast in Dublin on 6 March.Wales hurt by individual errors againMedia caption, Should Scotland's winning try against Wales have stood?Wales' dismal run continued with a painful defeat that was summed up by Tomos Williams giving away a costly penalty for a croc roll.Wales have lost 24 of 26 internationals since October 2023 and the latest defeat was a 14th successive Six Nations loss in a record stretching back three years.Barclay added: \"Wales will be gutted. They had that game.\"In Test Match rugby the margins are tiny and in the last 15 minutes they gave away five penalties and a huge one was the croc roll.\"You might think that has to be grabbing someone around the head and neck and twisting them, but it's also about lateral movement. It's something they are trying to get out of the game.\"The penalty was costly and Scotland and Russell took full advantage, with their misery being compounded by the nature of George Turner's match-winning try.Scotland number eight Matt Fagerson was offside and obstructing Wales replacement prop Archie Griffin in the build-up to the score from a driving maul.Small margins - but can Wales now build on an improved display across the Irish Sea?",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Six Nations talking points: Finn Russell, George Ford, Antoine Dupont and Robert Baloucoune",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/863d/live/3b36e010-1031-11f1-801d-ed3cff6bf876.jpg"
      ],
      "datePublished": "2026-02-23T06:18:08.000Z",
      "dateModified": "2026-02-23T06:18:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Gordon Brown turns detective over Andrew - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n2m9m5?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-02-22T15:03:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·22 Feb 2026,·33 minsGordon Brown turns detective over AndrewNewscastAvailable for over a yearToday, we discuss a report in the Sunday Telegraph that Gordon Brown has demanded a police investigation into whether Andrew Mountbatten-Windsor used taxpayer-funded jets and RAF bases to meet the paedophile Jeffrey Epstein.\nThe former PM says he’s sent a five-page memorandum to the Metropolitan, Surrey, Sussex Thames Valley and other UK police constabularies.\nLaura and Paddy are joined by Henry Zeffman to discuss why he’s turned investigator, what it means for the Royal Family, and whether rules around the line of succession should be changed.\nAhead of the Government’s Schools White Paper on Monday, we also discuss some of Labour’s proposed changes to special educational needs and disabilities (SEND) support, as well as Kemi Badenoch’s vow to lower interest on some student loans which she says feel \"increasingly feel like a scam\".\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers.\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC.\nThe presenters were Laura Kuenssberg and Paddy O’Connell. It was made by Chris Flynn with Kris Jalowiecki. The social producer was Grace Braddock. The technical producer was Hannah Montgomery. The weekend series producer is Chris Flynn. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Gordon Brown turns detective over Andrew - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-02-22T15:03:00.000Z",
      "dateModified": "2026-02-22T15:03:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential ch",
    "body": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Trump's Tariffs... Trump attacks the Supreme Court over tariff ban - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n2d11v?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-02-20T20:08:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·20 Feb 2026,·21 minsTrump's Tariffs... Trump attacks the Supreme Court over tariff banAmericastAvailable for over a yearDonald Trump has called the Supreme Court’s ruling blocking many of his sweeping tariffs ‘deeply disappointing’ and has announced a new 10 per cent tariff on global imports.\nJustin, Sarah and Anthony jumped into action following the President’s press conference to unpack the day’s drama: starting with the US Supreme Court decision to block global tariffs and ending with the President’s withering attack on some of the justices for their decision. \nThe president spoke a few hours after the US Supreme court struck down the legal justification for a large portion of Trump's sweeping global tariffs in a major blow to the president's economic agenda.\nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Anthony Zurcher, North America Correspondent\nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray, Miranda Slade, Grace Reeve and Kris Jalowiecki. The technical producer was Mike Regaard. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Trump's Tariffs... Trump attacks the Supreme Court over tariff ban - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-02-20T20:08:00.000Z",
      "dateModified": "2026-02-20T20:08:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Saltburn",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002f1vy?at_mid=5dhF4rgAGg&at_campaign=Saltburn&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002f1vy&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Saltburn&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0lkj2gp.jpg",
    "tag": "Trending",
    "date": "2026-02-02T00:03:27.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeSaltburnSaltburnContains very strong language, explicit sexual content and some upsetting scenes.Deals with suicideBlack comedy thriller. A student at University finds himself drawn into the world of a charming, aristocratic classmate. Duration2h 2mFirst shown2023Available for 8 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesThe Souvenir Part IIHonor Swinton Byrne stars in a film about life and the return of old friends and lovers1h 40mThe Night ManagerStylish. Devilish. Deadly. John le Carré's twisted spy thriller with Tom HiddlestonLord of the FliesWhen the rules vanish, the beast within awakens. A bold retelling of a dystopian classicThe NotebookYou never forget first love. A sweeping love story with Ryan Gosling and Rachel McAdams1h 55mBirdBarry Keoghan stars in Andrea Arnold's empathetic tale of life on the fringes of society1h 54mIndustryProve your worth. Colleagues, turned lovers, turned enemies...AfireSelf-centred Leon is driven to distraction by some unwelcome housemates on holiday1h 37mCrossingIs Lia on the path to inner peace? A tender tale of a connection that transcends borders1h 38mRetreatNo neighbours. No help. No escape. Tense thriller with Cillian Murphy and Thandie Newton1h 25mSilent WitnessThe forensics team who will stop at nothing to get answers for the deadThe Last Letter from Your LoverFelicity Jones stars in a romance for the ages. Some love stories deserve a second chance1h 41mWould I Lie to You?Tall tales, faithless fibs with Kate Garraway, Jonathan Ross, JB Gill and Michelle Wolf29 mins",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Saltburn",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0lkj2gp.jpg"
      ],
      "datePublished": "2026-02-02T00:03:27.000Z",
      "dateModified": "2026-02-02T00:03:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cheryl Grimmer: Prosecutors consider reopening cold case disappearance",
    "url": "https://www.bbc.com/news/articles/cd6zg91l75qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9212/live/fc3e91f0-9939-11f0-869a-3fa4ad43e8ee.png",
    "tag": "Trending",
    "date": "2026-02-23T05:07:47.000Z",
    "description": "Australian prosecutors consider reopening British girl's cold case disappearance3 hours agoKaty WatsonAustralia correspondentFamily handoutCheryl Grim",
    "body": "Australian prosecutors consider reopening British girl's cold case disappearance3 hours agoKaty WatsonAustralia correspondentFamily handoutCheryl Grimmer was three when she disappeared from Fairy Meadow beach in January 1970The family of a British girl who disappeared in Australia more than 55 years ago has welcomed a decision by prosecutors to consider reopening her case.Three-year-old Cheryl Grimmer disappeared from Fairy Meadow beach in Wollongong in January 1970. Despite extensive searches, there were no leads.A suspect was charged with her abduction and murder in 2017, but his trial collapsed after his teenage confession was ruled inadmissible. He denies any wrongdoing and prosecutors dropped the case.After public pressure - including from the girl's family - the New South Wales (NSW) director of public prosecutions now says her office is willing to conduct a special review of that decision.Sally Dowling said in a letter to Grimmer's family that the normal time limit for families to request a review had expired, but that she had agreed to look at the case anyway.She said she could review the case now, based on evidence police handed over in 2019, or the family could wait until detectives had considered the \"fresh\" information they say they have found.\"It's taken way too many years but finally we're really happy that they see our fight for some justice for Cheryl,\" Ricki Nash, Cheryl's older brother, told the BBC.Nash said the family had written to NSW Police to request it reopen an investigation, taking into account new evidence that had come to light since 2019.\"We are not asking for anything extraordinary,\" he said. \"When transparency leads the process, evil can no longer hide behind process failures or bureaucratic division.\"The British toddler and her family had only recently migrated to Australia from Bristol as so-called Ten Pound Poms before she vanished.On the day Cheryl disappeared, Nash had been put in charge of his younger siblings as the family got ready to leave the beach. He was told to go to the bathroom block and Cheryl ran giggling into the ladies' changing rooms, refusing to come out.Too embarrassed to enter himself, Nash went back to the beach to tell his mother to help. When they returned 90 seconds later, the toddler was gone.Cheryl's family has been pushing for a fresh investigation ever since the trial collapsed seven years ago. They argue that lots of missteps were made by NSW authorities in their search for Cheryl.Last October, Jeremy Buckingham, a member of the NSW Legislative Council, the state's upper house, used parliamentary privilege to name the suspect. He had been known only as Mercury, as his real name is legally protected because he was a minor at the time of the alleged crime.In May, there will also be a NSW parliamentary inquiry looking into cases of unsolved murders and long-term missing people – with Grimmer's case forming part of the inquiry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cheryl Grimmer: Prosecutors consider reopening cold case disappearance",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9212/live/fc3e91f0-9939-11f0-869a-3fa4ad43e8ee.png"
      ],
      "datePublished": "2026-02-23T05:07:47.000Z",
      "dateModified": "2026-02-23T05:07:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Streeting says families deserve 'truth' as maternity inquiry delayed",
    "url": "https://www.bbc.com/news/articles/cvgj9yznzg7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1d1c/live/11a47f80-1074-11f1-b048-c9424b2cf5fd.jpg",
    "tag": "Trending",
    "date": "2026-02-23T05:44:45.000Z",
    "description": "Streeting says he takes Leeds maternity care inquiry concerns 'extremely seriously'3 hours agoDivya Talwar,BBC News InvestigationsandHarry Sekulich,BB",
    "body": "Streeting says he takes Leeds maternity care inquiry concerns 'extremely seriously'3 hours agoDivya Talwar,BBC News InvestigationsandHarry Sekulich,BBC News digitalPA MediaWes Streeting is expected to meet some of families affected by the deaths on Monday afternoonHealth Secretary Wes Streeting said he takes the concerns of bereaved families \"extremely seriously\" after acknowledging trust had been \"damaged\" around a promised Leeds maternity care inquiry.He announced the investigation into Leeds Teaching Hospitals NHS Trust in October, after a BBC investigation revealed that the deaths of at least 56 babies over the past five years may have been prevented.  But nobody has been appointed to chair the inquiry, leading to some families urging Prime Minister Sir Keir Starmer to intervene.Streeting is expected to meet some of families affected by the deaths on Monday afternoon.Ahead of the meeting on Monday, Streeting vowed to work with the families to rebuild confidence and ensure the inquiry would deliver \"the truth they deserved\".\"Losing a baby is devastating beyond words, and you deserve not just answers, but a process you can trust,\" he said. \"The strength and dignity these families have shown, while carrying unimaginable grief shows extraordinary courage. I am personally committed to ensuring this inquiry is thorough, independent, and puts families at its heart.\"Earlier this month, five MPs penned a letter, seen by the BBC, to Downing Street, stating: \"Leeds families have lost faith and confidence in the Secretary of State for Health's handling of this inquiry\".Bereaved families were concerned about the delay and the possibility of appointing a chair who used an \"untested and unrefined methodology\", the letter said.It urged Sir Keir to appoint senior midwife Donna Ockenden to chair the Leeds NHS Trust investigation. She is currently leading an inquiry into Nottingham maternity services, which is examining about 2,500 cases of failings.Ockenden has said she is \"ready to chair the review into Leeds maternity services and can begin work immediately if asked.\"A copy of the letter was hand-delivered to Downing Street  on 11 February by families affected by the deaths. Among them were Fiona Winser-Ramm and Dan Ramm, whose daughter Aliona died in January 2020 at Leeds General Infirmary. An inquest found \"a number of gross failures\" that \"directly contributed\" to her death.\"When we've met with the secretary of state, he is often saying the right things to us,\" Winser-Ramm said. \"But it isn't translating into what is proposed for the inquiry by the Department of Health.\"Related stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Streeting says families deserve 'truth' as maternity inquiry delayed",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1d1c/live/11a47f80-1074-11f1-b048-c9424b2cf5fd.jpg"
      ],
      "datePublished": "2026-02-23T05:44:45.000Z",
      "dateModified": "2026-02-23T05:44:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Genesis Invitational: Rory McIlroy finishes one shot behind Genesis winner Jacob Bridgeman",
    "url": "https://www.bbc.com/sport/golf/articles/cvg18zgz7dyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9476/live/f6fe7200-104e-11f1-9120-a910fc22c6ac.png",
    "tag": "Trending",
    "date": "2026-02-23T08:22:03.000Z",
    "description": "Rory McIlroy shot a four-under-par 67 but it was not enough to overhaul winner Jacob Bridgeman, who won by one shot at the Genesis Invitational in Los",
    "body": "Rory McIlroy shot a four-under-par 67 but it was not enough to overhaul winner Jacob Bridgeman, who won by one shot at the Genesis Invitational in Los Angeles.Northern Ireland's McIlroy started the day six shots off the lead but despite making five birdies he could not catch American Bridgeman, who got over the line with a one-over-par 72 to finish on 18 under.Bridgeman, who held a seven-shot lead early in the day, held back tears on the 18th green before sinking a three-foot putt for his first PGA Tour title.He is also the first man to win the prestigious event in his tournament debut since 1975.Bridgeman's victory continues his good start to the year having had two top-10 finishes in his opening four events, including last week's eighth place at Pebble Beach.The 26-year-old's three bogies on the final day at the Riviera Country Club gave the chasing players hope, including countryman Kurt Kitayama, who finished tied for second with McIlroy on 17 under after carding a seven-under-par 64.World number two McIlroy was even par after the first nine holes, but made four birdies on the back nine, including a brilliant hole-out from the greenside bunker on the 12th, to put pressure on Bridgeman.A nervy closing three holes saw Bridgeman bogey 16 then leave his putt on 18 over three feet short, after McIlroy had drained a 30 footer to get within a shot, to ensure a tense final stroke in front of tournament host Tiger Woods.Bridgeman held his nerve though to claim a first PGA Tour title in style, with victory at one of the Signature Events moving him inside the top 25 of the world rankings for the first time.England's Tommy Fleetwood shot a four-under-par 67 to finish joint-seventh on 12-under, which included a slam dunk eagle with his approach shot on 15 from 173 yards out.World number one Scottie Scheffler made a flying finish with his 65 seeing him recover from his bad start on Thursday to finish in joint 12th.That meant an end to Scheffler's brilliant run of 18 consecutive top-10 finishes on the PGA Tour. England's Marco Penge, who was the joint-leader alongside Bridgeman after the second round, ended in tied for 16th place on 10 under.Max Greyserman provided another big highlight of the day as he made a hole-in-one at the 14th, which illuminated an otherwise difficult day for him as he made four bogeys and a double bogey in his 73.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Genesis Invitational: Rory McIlroy finishes one shot behind Genesis winner Jacob Bridgeman",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9476/live/f6fe7200-104e-11f1-9120-a910fc22c6ac.png"
      ],
      "datePublished": "2026-02-23T08:22:03.000Z",
      "dateModified": "2026-02-23T08:22:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brown urges police probe into whether Andrew used RAF bases to meet Epstein",
    "url": "https://www.bbc.com/news/articles/cj0dme87l84o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0969/live/6ccccf20-0ff2-11f1-bf92-afe9c11d7573.jpg",
    "tag": "Trending",
    "date": "2026-02-22T15:15:42.000Z",
    "description": "17 hours agoEd CampbellBBC News InvestigationsGetty ImagesGordon Brown has demanded a police investigation into whether Andrew Mountbatten-Windsor use",
    "body": "17 hours agoEd CampbellBBC News InvestigationsGetty ImagesGordon Brown has demanded a police investigation into whether Andrew Mountbatten-Windsor used taxpayer-funded jets and RAF bases to meet the paedophile Jeffrey Epstein, according to reports.The former prime minister wrote letters to six police forces suggesting that civil servants be questioned about Andrew's time as UK trade envoy, the Sunday Telegraph says.Andrew was an envoy from 2001 to 2011, including almost three years when Brown was in No 10.The paper also reports that Brown has demanded a full investigation into the trade envoy role, its cost to taxpayers and any evidence that links the former prince's government work to late financier Epstein.Andrew has previously denied any wrongdoing in relation to Epstein, who died in a New York prison cell in 2019 as he awaited trial on sex trafficking charges.Brown told the BBC last week that he had \"submitted a five-page memorandum to the Metropolitan, Surrey, Sussex, Thames Valley and other relevant UK police constabularies\".He said: \"This memorandum provides new and additional information to that which I submitted last week to the Met, Essex and Thames Valley police forces where I expressed my concern that we secure justice for trafficked girls and women.\"When asked about these flights by the BBC in October 2025, the Ministry of Defence said \"it is standard practice for spare capacity at RAF airfields in the UK to be used for private or commercial aircraft, subject to fees which cover all costs\".It added that such use \"is not automatic and will only be approved when there is no adverse impact to military aircraft and where approval would not interfere with the security or smooth running of the airfield\". The MoD repeated this response when asked by the BBC again on Sunday.In an email message, Jon Swain asks if Andrew had secured permission for Epstein to use military bases. The question is forwarded to Epstein by Ghislaine Maxwell - who in 2021 was convicted in the US for her role in luring underage girls for him.Epstein responds to say, \"just spoke to Larry… it's true\". The man named Larry was Epstein's chief pilot, who arranged many of his landings and logistics. Maxwell then responds using an expletive.The Sunday Telegraph says Brown is requesting that police examine whether Epstein was given access to RAF bases after his conviction for soliciting child prostitution in Florida in 2008.Andrew was arrested by Thames Valley Police on Thursday, on suspicion of misconduct in public office, and released under investigation 11 hours later.He has not responded to the BBC's requests for comment on specific allegations that have emerged after the US release of files connected to the late financier's case - including claims he shared information with Epstein while trade envoy.Searches are continuing this weekend at his former Windsor mansion Royal Lodge, where he lived for many years.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brown urges police probe into whether Andrew used RAF bases to meet Epstein",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0969/live/6ccccf20-0ff2-11f1-bf92-afe9c11d7573.jpg"
      ],
      "datePublished": "2026-02-22T15:15:42.000Z",
      "dateModified": "2026-02-22T15:15:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: William 'not calm, buy carrying on' amid Andrew arrest",
    "url": "https://www.bbc.com/news/articles/cy8lg27wvn1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/79f1/live/461fbcc0-104c-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-23T00:52:07.000Z",
    "description": "William 'not calm, but carrying on' after Andrew arrest and a Bafta for Buckley8 hours agoThe fallout from Andrew Mountbatten-Windsor's arrest continu",
    "body": "William 'not calm, but carrying on' after Andrew arrest and a Bafta for Buckley8 hours agoThe fallout from Andrew Mountbatten-Windsor's arrest continues to dominate Monday's papers. The Daily Mail leads with the Prince of Wales' comments as he attended the Bafta awards on Sunday, where he was asked whether he had seen the film Hamnet: \"I need to be in quite a calm state and I am not at the moment - I will save it.\" The paper says Prince William's appearance at the ceremony with Catherine, the Princess of Wales \"signalled a determination to put the Royal Family's difficulties to one side\".\"William: I need to calm down\" the Daily Mirror echoes as it fills its front page with Prince William and Catherine arriving at the Baftas. The event marks the Royal couple's first public appearance since Andrew's arrest. The paper adds that Prince William is understood to be \"making plans to restore public trust in the monarchy\" amid the scandal. The Sun follows with the same picture of Prince William and Catherine with the caption: \"Not calm, but he's carrying on.\"The Daily Star says the Royal Family is facing a \"crisis\" as the investigation continues and police try to gain access to files kept at Buckingham Palace. The King has reportedly told his staff to give police access to his own files as they investigate Andrew's ties to late sex offender Jeffrey Epstein, according to the Metro. \"Access all areas\" is the headline. Andrew has consistently denied any wrongdoing.Staying with Jeffrey Epstein, the Daily Telegraph reports that the late sex offender hid computers and photographs from US authorities in secret storage lockers across America. The paper cites documents that show Epstein paid private detectives to remove equipment from his Florida home in an \"apparent attempt to prevent investigators from finding it\".According to the Times, the Metropolitan Police started re-examining trafficking allegations related to Jeffrey Epstein, but investigators have been told that some of the evidence has been destroyed. Moving to news closer to home, the Guardian says ministers will reveal a \"generational\" overhaul of special educational needs support on Monday, pledging a £4bn package. Elsewhere, the top picture spot is taken by Bafta best actress winner Jesse Buckley, who called the award \"an incredible honour\".Jesse Buckley's \"triumph\" at the Baftas also leads the Independent's front page. Alongside, the paper reveals Apple AirTags and small tracking devices are being \"weaponised\" by stalkers, forcing some victims to flee their homes and change jobs.The i Paper shifts its focus to Peter Mandelson, reporting that the government \"fast-tracked\" security vetting for the former ambassador to the US despite knowing about his links to Epstein. However, the government says it was normal to prioritise vetting and any suggestion that part of the process was missed is \"false\".The Daily Express says it has seen documents from Sir Keir Starmer's time as top prosecutor that show he oversaw the use of \"paedophile Asbos\" that let suspects off with warnings.Finally, the Financial Times reports that Iran agreed to a secret €500m arms deal with Russia to acquire thousands of advanced missiles in an attempt to rebuild is air defences in its war with Israel last year.The Daily Telegraph says it has seen documents that show Jeffrey Epstein rented six storage units across the US as part of what the paper calls \"an apparent attempt\" to hide computers and other documents from investigators. It says the units were never raided \"raising the possibility that they may contain unseen evidence\" relating to the sex offender and his associates, including Andrew Mountbatten-Windsor.The front pages of the Sun and the Daily Mirror feature images of the Prince and Princess of Wales at the Bafta film awards, making their first public appearance since Andrew's arrest. Both papers highlight a comment by Prince William after he revealed he was not feeling \"calm\" at the moment.The Daily Mail says MPs will push for greater scrutiny of the Royal Family when they return to Westminster today with some demanding answers over how Andrew was able to represent the UK as a trade envoy for a decade \"with seemingly minimal oversight\". The former prince has previously denied any wrongdoing in relation to his friendship with Jeffrey Epstein.The Times reports that the Metropolitan Police began re-examining allegations that victims of Epstein were trafficked into the UK via RAF bases and commercial airports three months ago, but detectives have been told that some of the evidence has been destroyed. It says some of the flights date back two decades but the RAF retains passenger manifests for only three months while commercial airlines generally keep them for six to seven years.Sir Keir Starmer has told the Times that his late brother's learning difficulties are the inspiration behind the government's reform of special educational needs.  Writing in the paper, the prime minister says Nick Starmer struggled to be \"seen\" in the classroom, and was written off by the system.The front page of the Guardian includes a photo of the British actor, Robert Aramayo, holding the two Baftas he won last night.  The paper's film critic, Peter Bradshaw, says his triumph over Hollywood A-listers in the best actor category was the \"biggest upset\" of the ceremony and \"the thoroughly well-deserved feel-good moment of the night\".Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: William 'not calm, buy carrying on' amid Andrew arrest",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/79f1/live/461fbcc0-104c-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-23T00:52:07.000Z",
      "dateModified": "2026-02-23T00:52:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Violence erupts in Mexico after drug lord El Mencho killed",
    "url": "https://www.bbc.com/news/articles/c795qgejzpxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7840/live/29774360-1086-11f1-b048-c9424b2cf5fd.jpg",
    "tag": "Trending",
    "date": "2026-02-23T05:30:58.000Z",
    "description": "3 hours agoOttilie MitchellWatch: Vehicles set ablaze across Mexico amid violenceA wave of violence has broken out in Mexico after the country's most ",
    "body": "3 hours agoOttilie MitchellWatch: Vehicles set ablaze across Mexico amid violenceA wave of violence has broken out in Mexico after the country's most wanted drug baron was killed in an operation seeking his arrest.Nemesio Oseguera Cervantes, known as \"El Mencho\", was the leader of the feared Jalisco New Generation (CJNG) drug cartel and died after being seriously injured in clashes between his supporters and the army on Sunday.Four CJNG members were killed during the operation in the town of Tapalpa, in the central-western Jalisco state, and three army personnel were also injured, the Mexican defence ministry said.Retaliation for the drug lord's death has seen violence spread to at least a dozen states, with CJNG blocking roads with burning vehicles.Throughout Sunday there were reports of gunmen on the streets in Jalisco and elsewhere. Eyewitnesses filmed plumes of smoke rising over several cities including Guadalajara - one of the host cities of the forthcoming Fifa World Cup.Jalisco's Governor Pablo Lemus Navarro declared a code red in the state, pausing all public transport and cancelling mass events and in-person classes.Tourists who spoke to news agency Reuters described the resort town of Puerto Vallarta as a \"war zone\".Some 250 roadblocks were in place across the country during the unrest, with 65 in Jalisco, the BBC's US news partner CBS reported. In its latest update, the Mexican security cabinet said four blockades remained active in Jalisco.The cabinet says 25 people have been arrested, 11 for their alleged participation in violent acts and 14 more for alleged looting and pillaging.Shops were on fire and about 20 bank branches were attacked in the violence, it added.ShutterstockPlumes of smoke rose along the waterfront in Puerto VallartaMexican President Claudia Sheinbaum said there was \"absolute co-ordination\" between state and federal officials in response to the violence, urging people to stay \"calm and informed\". She added that \"in most parts of the country, activities are proceeding normally\".Several airlines have cancelled flights to Jalisco, including Air Canada, United Airlines and American Airlines.The US has warned its citizens to shelter in place in five states: Jalisco, Tamaulipas, areas of Michoacán, Guerrero and Nuevo Leon.The UK government said \"serious security incidents\" had been reported in Jalisco, adding that visitors \"should exercise extreme caution\" and follow the advice of local authorities.The US had provided Mexico with intelligence that assisted its operation to apprehend El Mencho.US Press Secretary Karoline Leavitt said late on Sunday night that El Mencho was a \"top target for the Mexican and United States government as one of the top traffickers of fentanyl into our homeland\".She said three cartel members had been killed, another three wounded and two arrested in the operation.ReutersThe US had offered a $15m (£11.1m) bounty for information on El Mencho's whereaboutsEl Mencho, a 59-year-old former police officer, ran a vast criminal organisation responsible for trafficking huge quantities of cocaine, methamphetamine and fentanyl into the US.The US State Department had offered a $15m (£11.1m) reward for information leading to his capture.The Mexican defence ministry said in a statement that the operation was \"planned and executed\" by the country's special forces.Mike Vigil, former chief of international operations for the US Drug Enforcement Administration, described the operation as \"one of the most significant actions undertaken in the history of drug trafficking\" to CBS, the BBC's US news partner.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Violence erupts in Mexico after drug lord El Mencho killed",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7840/live/29774360-1086-11f1-b048-c9424b2cf5fd.jpg"
      ],
      "datePublished": "2026-02-23T05:30:58.000Z",
      "dateModified": "2026-02-23T05:30:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man killed after entering secure perimeter of Trump's Mar-a-Lago residence, Secret Service says",
    "url": "https://www.bbc.com/news/articles/cp32l9w9pgyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a550/live/c7902e10-1002-11f1-909d-47e99fcb7a58.jpg",
    "tag": "Trending",
    "date": "2026-02-23T07:16:16.000Z",
    "description": "1 hour agoGeorge WrightGetty ImagesAn armed man has been shot dead after entering the secure perimeter of US President Donald Trump's Mar-a-Lago resid",
    "body": "1 hour agoGeorge WrightGetty ImagesAn armed man has been shot dead after entering the secure perimeter of US President Donald Trump's Mar-a-Lago residence in Florida, the Secret Service has said.The man was carrying a shotgun and fuel can when he was stopped and shot by Secret Service agents and a Sheriff's deputy, authorities said.The incident happened around 01:30 ET (06:30 GMT) on Sunday morning, when the president was in Washington DC. The suspect has been named as 21-year-old Austin T Martin of Cameron, North Carolina, according to the BBC's US partner CBS.His family in North Carolina had reported him missing in the early hours of Sunday morning, the Moore County Sheriff's Office said in a statement to the BBC. The missing persons information has since been turned over to federal authorities, the sheriff's office said.They added that the department had no record of prior history concerning Martin and that it was not involved in the Florida investigation.Officials are looking into whether he bought the gun along the driving route he took from North Carolina to Florida, according to CBS.US Secret Service agents fired at him after they saw him \"unlawfully entering the secure perimeter at Mar-a-Lago early this morning\", agency spokesman Anthony Guglielmi posted on X on Sunday.The suspect \"was observed by the north gate of the Mar-a-Lago property carrying what appeared to be a shotgun and a fuel can\", the agency said in a statement.The man was then shot after refusing orders, Palm Beach County Sheriff Ric Bradshaw said.\"The only words that we said to him was 'drop the items', which means the gas can and the shotgun,\" Bradshaw told a news conference. \"At which time he put down the gas can, raised the shotgun to a shooting position,\" he said. At that point, agents fired their weapons to \"neutralise the threat\", Bradshaw added.FacebookThe suspect had been reported missing by relatives, according to CBSThe officers were wearing body cameras and no law enforcement officers were injured, he said.Bradshaw said that he did not know whether the suspect's gun was loaded, saying that will form part of an investigation the FBI will be assisting with.US Secret Service Director Sean Curran travelled to Florida on Sunday for \"after-actions\" and had \"reinvigorated operational communication and agency response to critical incidents\", the agency said in a post on X. Security at Mar-a-Lago is extremely tight, with an outer cordon of local Palm Beach sheriffs and an inner one maintained by the Secret Service. Visitors are searched, and cars and bags are swept by dogs and metal detectors.Trump has been the target of several assassination plots or attempts.In July 2024, Trump was shot in the ear as he stood in front of crowds in Butler, Pennsylvania. One bystander was killed and two were injured in the shooting. The shooter, 20-year-old Matthew Crooks, was immediately shot and killed by security forces and his motive remains unknown.Months later, a Secret Service agent spotted a rifle sticking out of bushes at Trump International Golf Club in West Palm Beach. The man, later identified as Ryan Routh, fled but was caught. The 59-year-old was sentenced to life in prison earlier this month for attempting to assassinate the president.During an appearance on Fox Business after the fatal incident, Treasury Secretary Scott Bessent blamed the the political left for \"normalising\" political violence,  citing the two attempts on Trump's life in 2024,\"Two would-be assassins dead, one in jail for life, and this venom coming from the other side,\" Bessent said, adding: \"They are normalising this violence. It's got to stop.\"Follow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weekly US Politics Unspun newsletter. Readers in the UK can sign up here. Those outside the UK can sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man killed after entering secure perimeter of Trump's Mar-a-Lago residence, Secret Service says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a550/live/c7902e10-1002-11f1-909d-47e99fcb7a58.jpg"
      ],
      "datePublished": "2026-02-23T07:16:16.000Z",
      "dateModified": "2026-02-23T07:16:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who was El Mencho, Mexico's most wanted man?",
    "url": "https://www.bbc.com/news/articles/c1jkw18e19jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8bb9/live/72807460-105d-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-23T03:17:03.000Z",
    "description": "5 hours agoWill GrantMexico correspondentBBC on what the killing of drug lord 'El Mencho' means for MexicoThere are only a handful of names that have ",
    "body": "5 hours agoWill GrantMexico correspondentBBC on what the killing of drug lord 'El Mencho' means for MexicoThere are only a handful of names that have had a lasting impact in the history of Mexican organised crime.Nemesio Oseguera Cervantes – more commonly known as \"El Mencho\" – is one of them. Hailing from humble rural roots in the western state of Michoacán, his rise to the top of one of the most feared and dangerous cartels in modern Mexico, the Jalisco New Generation Cartel (CJNG), was meteoric. And it was achieved through aggression, ambition, brutality and ruthlessness.His killing has been heralded as a victory in both Mexico and the United States.The Mexican authorities and the US reported that US intelligence was involved in bringing down the kingpin, lending the operation a sense of cross-border co-operation that could benefit both governments. For the Mexican military, a cartel leader has been removed from the equation, thereby weakens – at least in theory, and maybe for a time – the criminal group he ran.The response from El Mencho's men has been swift.Roadblocks have been erected and violence has spilt over into the streets in as many as eight different states, from Guerrero on the Pacific coast to Tamaulipas in the north-east. Even the capital, Mexico City, and the surrounding Mexico State have seen incidents.Some of the worst violence has been in Jalisco itself, with masked gunmen setting fire to stores in the state capital, Guadalajara – one of the venues for this summer's Fifa World Cup. In the beach resort of Puerto Vallarta, tourists and locals alike are sheltering in place until the wave of violence passes.It's a show of loyalty from El Mencho's foot-soldiers and a show of fury at the authorities for eliminating their leader. But whether the roadblocks and burning cars are for anything more than just show – that is, whether the violence de-escalates or ramps up – will only become clear over next few days. The reaction by law enforcement will be critical in that regard.It is a long-held truth about such transnational criminal groups that, even with a cartel head as influential as Cervantes, there are inevitably three or four well-placed lieutenants on hand to replace him.Undoubtedly, though, El Mencho was key to the group's ascendancy.When he moved to the US as an undocumented immigrant in the 1980s, he had already had his first brushes with criminality in cultivating the marijuana fields of his native state. Various arrests in the US followed as he dug deeper into narcotics crime in California, before eventually being sentenced to several years in prison in the US.ReutersCars burn in Zapopan, near Guadalajara, after El Mencho's death on SundayCervantes was deported back to Mexico aged 30 and began to fully immerse himself in cartel activity. He worked for the Milenio Cartel, based out of his native Michoacán, and grew in stature and reputation as a calculating and cruel boss.He was ideally placed when the cartel fractured and, from its remnants, the CJNG sprang up with El Mencho at its head.Through a combination of territorial expansion and the nimbleness to pivot the cartel's activity into new and lucrative illegal activities, he turned the group into what it has become today – arguably the predominant criminal force in Mexico.His leadership and his cartel benefitted from the collapse of the Sinaloa Cartel after the extradition of its leader, Joaquín \"El Chapo\" Guzmán, to the US. Subsequent battles between warring factions in Sinaloa have ultimately torn the group apart.The New Generation Cartel was on hand to hoover up an important portion of the fentanyl trade after the fall of El Chapo's sons. One of them, Joaquín Guzmán López, handed himself in to the US authorities and brought down his group's biggest rival, Ismael \"El Mayo\" Zambada, with him.El Mencho was a clear beneficiary of the vacuum and the dramatic sequence of events in Sinaloa. But, as is so often the case in Mexican drug crime, it was not a crown he wore for long.The government of Mexico's President Claudia Sheinbaum will portray the removal of one of the country's most wanted men as a victory and this will be echoed in Washington. It shows progress on the main issue from which US President Donald Trump has demanded action from Mexico after immigration: fentanyl trafficking.Given the element of US intelligence apparently involved, it also underlines the Sheinbaum administration's willingness to work together with Washington in pursuit of the same goals. She would hope it will be enough to stave off any further talk of the need for unilateral US military action on Mexican soil in the form of drone strikes or boots on the ground – something which some in the Republican Party and in the Trump administration have openly called for.Such discussions are still to come. For the time being, Mexicans are still processing that El Mencho is dead, and in his absence watching cartel members set fires in the streets in cities across the nation.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who was El Mencho, Mexico's most wanted man?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8bb9/live/72807460-105d-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-23T03:17:03.000Z",
      "dateModified": "2026-02-23T03:17:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wunmi Mosaku shows 'ancestral power' with Bafta win",
    "url": "https://www.bbc.com/news/articles/cy7jnj028lko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/081c/live/d96e0670-1084-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-22T20:19:04.000Z",
    "description": "12 hours agoRumeana JahangirNorth WestPA MediaWunmi Mosaku said she was \"really shocked\" after winning a Bafta for her role in SinnersBafta-winning ac",
    "body": "12 hours agoRumeana JahangirNorth WestPA MediaWunmi Mosaku said she was \"really shocked\" after winning a Bafta for her role in SinnersBafta-winning actress Wunmi Mosaku says she found parts of herself \"I thought I had lost or tried to dim as an immigrant trying to fit in\" as she took the best supporting actress prize for her role in the film Sinners.The 39-year-old, who was born in Nigeria and grew up in Manchester, has drawn widespread acclaim for her role as Hoodoo priestess Annie in the musical horror film.She is the first black British winner of the supporting actress category at the Bafta film awards.Mosaku said: \"I found a part of myself in Annie, a part of my hopes, my ancestral power and connection, parts I thought I had lost or tried to dim as an immigrant trying to fit in.\"She moved with her family from the historic Nigerian city of Zaria to Manchester when she was a one-year-old baby.Speaking at the winners' press conference, she said: \"It always feels good when you feel like your story and your experience is being represented with integrity and creativity.She said she had been pleased to see \"the response of black women feeling seen, loved, valued, treasured, and the power of our ancestry and the spirituality\".\"For me, seeing that response made me realise how lonely I felt and all of a sudden these women were in my life who I'd never met, I felt a kinship to.\"Warner Bros. PicturesMosaku has also been tipped for an Oscar for her portrayal of Annie in SinnersMosaku's award comes nine years after she won the same category at the TV Baftas for her role in the BBC drama Damilola, Our Loved Boy - about the death of 10-year-old Damilola Taylor, which drew national attention when he was stabbed while walking home from a library in London.When the programme aired in 2016, she said: \"I grew up on an estate in Manchester and people I've known from school have died in gang trouble and I always thought, 'If I'd been on a different estate at a different time, it could have been me'.\"Speaking about her victory on Sunday, Mosaku, who is pregnant, said: \"I was like, 'That can't be right'. I was really shocked and I lost my breath and couldn't quite believe it.\"The actress, who has also appeared in TV dramas Luther and Black Mirror as well as Marvel movies, also thanked her daughter, adding \"you are my greatest teacher\".PA MediaWunmi Mosaku and Jack O'Connell have won praise for their roles in the musical horror film Sinners, which also won a Bafta for best original screenplayMosaku was inspired to become an actress after watching the 1980s musical film Annie \"every single day after school\", she recently told The Graham Norton Show.When she shared her hopes with family, they asked her how she was going to achieve the ambition, prompting her to do an online search on the movie cast.She then became aware about drama schools after finding out Salford-born actor Albert Finney, who played Daddy Warbucks in the film, had trained at the prestigious Royal Academy of Dramatic Art (Rada) in London.Mosaku later followed his footsteps by taking a £3.50 journey on the Megabus for a successful audition there.She was also a member of the Manchester Girls Choir for 11 years, describing her time there as \"one of my most precious memories\".More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wunmi Mosaku shows 'ancestral power' with Bafta win",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/081c/live/d96e0670-1084-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-22T20:19:04.000Z",
      "dateModified": "2026-02-22T20:19:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]