[
  {
    "title": "Radical with Amol Rajan - Digital Dominance: How to Limit the Power of Big Tech (Sir Nick Clegg) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/m002m0fz?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg",
    "tag": "Trending",
    "date": "2025-11-13T06:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·13 Nov 2025,·71 minsAvailable for over a yearHow should we balance innovation, power and accountability in the digital age? This week, Amol speaks to Sir Nick Clegg — former UK deputy prime minister and former president of global affairs at Meta — about the power and responsibility of big tech companies. Sir Nick argues that breaking them up won’t solve the problem of their digital dominance, calling instead for greater regulation and user control. \nHe discusses how technology shapes young people’s lives, warning against moral panic whilst calling for stronger age-appropriate safeguards and phone-free schools. And with rare candour, Sir Nick offers an insider’s perspective on how Silicon Valley really works — and why governments, not tech CEOs like Mark Zuckerberg, must ultimately set the rules. \nHe also talks about politics and philosophy, arguing that true liberalism — rooted in reason, openness, and the belief in evidence over emotion — remains vital in an increasingly polarised world. \n(00:03:20) Concerns about the impact of AI \n(00:07:00) The power paradox and network effects \n(00:06:11) Children and smartphones \n(00:22:17) Social media and political polarisation \n(00:34:00) What’s Mark Zuckerberg really like? \n(00:37:56) Why tech bosses are not moral leaders \n(00:41:36) Why he left Meta \n(00:44:10) The future of technology and power \n(00:49:26) The race for AI ‘supremacy’ between the US and China \n(00:52:00) Preparing for this new digital world \n(00:53:11) Why has politics changed so much since he was deputy prime minister? \n(00:57:55) Is liberalism weak? \n(01:01:20) What’s next for Sir Nick Clegg? \n(01:05:16) Amol’s reflections \nGET IN TOUCH \n* WhatsApp: 0330 123 9480 \n* Email: radical@bbc.co.uk \nEpisodes of Radical with Amol Rajan are released every Thursday and you can also watch them on BBC iPlayer: https://www.bbc.co.uk/iplayer/episodes/m002f1d0/radical-with-amol-rajan \nAmol Rajan is a presenter of the Today programme on BBC Radio 4. He is also the host of University Challenge on BBC One. Before that, Amol was media editor at the BBC and editor at The Independent. \nRadical with Amol Rajan is a Today Podcast. It was made by Lewis Vickers with Anna Budd. Digital production was by Gabriel Purcell-Davis. Technical production was by Jonny Hall and Ben Andrews. The editor is Sam Bonham. The executive producer is Owenna Griffiths.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radical with Amol Rajan - Digital Dominance: How to Limit the Power of Big Tech (Sir Nick Clegg) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg"
      ],
      "datePublished": "2025-11-13T06:00:00.000Z",
      "dateModified": "2025-11-13T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Trump vs the BBC…what happens next? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mg9x04?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-11-12T22:30:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·12 Nov 2025,·29 minsAvailable for over a yearIn a Fox News interview released on Tuesday, Donald Trump says he has an ‘obligation’ to sue the BBC for the way it edited a section of a speech he made on January 6th 2021 - the day of the US Capitol riots - as part of a Panorama documentary.  The Chair of the BBC, Samir Shah said “the BBC would like to apologise for that error of judgement”.\nThe BBC has been given a Friday deadline by Trump to respond or face possible legal action, with the US president threatening to sue the corporation for a billion dollars.   \nAnthony and Marianna speak to Elie Honig, CNN’s Senior Legal Analyst who assesses the likelihood of the case ending up in court, and how any damages could be calculated. We also look at whether any of Trump’s previous legal actions against other media outlets can predict how this dispute may play out.\nPlus, newly released emails between Ghislaine Maxwell and Jeffrey Epstein from 2011 allege that Donald Trump 'spent hours' with one of Epstein’s victims. The documents have been published by House Democrats and refer to the president as the \"dog that hasn't barked.” Donald Trump has consistently denied any wrongdoing and has accused Democrats of “trying to bring up the Jeffrey Epstein Hoax again because they’ll do anything at all to deflect on how badly they’ve done on the Shutdown, and so many other subjects.”\nAnthony and Marianna unpack what this means for the administration and whether it could affect the president’s approval ratings.\nHOSTS:\n* Marianna Spring, Social Media Investigations correspondent\n* Anthony Zurcher, North America correspondent\nGUEST:\n* Elie Honig, Senior Legal Analyst at CNN\nGET IN TOUCH:\n* Join our online community: https://discord.gg/qSrxqNcmRB\n* Send us a message or voice note via WhatsApp to +44 330 123 9480\n* Email Americast@bbc.co.uk\n* Or use #Americast\nThis episode was made by George Dabby and Grace Reeve. The technical producer was Ben Andrews. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app.\nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155\nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Trump vs the BBC…what happens next? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-11-12T22:30:00.000Z",
      "dateModified": "2025-11-12T22:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC News quiz of the week: Who did Alan Carr give his Celebrity Traitors prize to?",
    "url": "https://www.bbc.com/news/articles/cn4jn8zmdrdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1a66/live/f8c91bd0-c0ad-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-13T18:30:38.000Z",
    "description": "3 hrs agoBBC apologises to Trump over Panorama edit but refuses to pay compensationLawyers for the US president have threatened to sue the corporation",
    "body": "3 hrs agoBBC apologises to Trump over Panorama edit but refuses to pay compensationLawyers for the US president have threatened to sue the corporation for $1bn (£759m).3 hrs ago4 hrs agoPat Butcher to return to EastEnders in dementia episodeThe beloved character, played by Pam St Clement, returns next month in Nigel's  memories from the 90s.4 hrs ago14 hrs agoThe TV hit that sparked the Korean drama boomA decade ago, Reply 1988 launched. An emotional and nostalgic show about life in 1980s Seoul, it paved the way for other Korean global hits like Squid Game.14 hrs ago15 hrs ago'Not an easy job' - why would anyone want to be the new BBC director general?As the BBC searches for a new chief, who are the potential candidates and is it a poisoned chalice?15 hrs ago1 day ago'There's a bit of anxiety': Stranger Things cast and creators on the show's endAfter five seasons the show is coming to an end, but a spin-off is already in development.1 day ago",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC News quiz of the week: Who did Alan Carr give his Celebrity Traitors prize to?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1a66/live/f8c91bd0-c0ad-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-13T18:30:38.000Z",
      "dateModified": "2025-11-13T18:30:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Morgan McSweeney: Who is Starmer's chief of staff?",
    "url": "https://www.bbc.com/news/articles/cy0l9z7qv0lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b900/live/de61c530-c0ad-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-13T17:18:51.000Z",
    "description": "8 hours agoSam FrancisPolitical reporter Morgan McSweeney, a man instrumental to the rise of Sir Keir Starmer, is at the centre of a political row aft",
    "body": "8 hours agoSam FrancisPolitical reporter Morgan McSweeney, a man instrumental to the rise of Sir Keir Starmer, is at the centre of a political row after a wave of anonymous briefings exposed tensions at the heart of government.Senior ministers have called for Sir Keir to impose order on the Downing Street operation run by McSweeney, his chief of staff, after media outlets were given reports cabinet colleagues were plotting leadership challenges.Some in government have blamed the 48-year-old adviser for being behind the briefings - and of importing a culture of off-the-record chats with journalists from opposition into Downing Street.But Sir Keir has said he is satisfied that the briefings about cabinet ministers plotting to challenge him did not come from Number 10.McSweeney has not commented directly on the criticism - like most people in behind-the-scenes roles in government he doesn't appear before the TV cameras to defend himself.And he has always sought to keep a low profile in any case. Until recently, there were few pictures of him in circulation.Friends of McSweeney have told the BBC he would not be leaving his position as he has \"done absolutely nothing wrong\".McSweeney derives his power and influence from his track record as a political strategist - he masterminded Labour's landslide 2024 general election victory and Sir Keir's 2020 Labour leadership bid.Like previous powerful, but unelected, advisers in Downing Street, such as Dominic Cummings or Alastair Campbell, he has been the target of negative stories.His closeness to Sir Keir - as a seasoned political operator to a relatively inexperienced prime minister - means he can be seen as \"proxy\" for the PM. One ally of the prime minister told the BBC: \"They are coming for Morgan because they want to get Keir. \"This isn't a parliamentary party battle, it's a Labour elite battle.\"McSweeney emerged victorious from an internal power struggle to become Sir Keir's chief of staff last year after the dramatic resignation of Sue Gray.Quiet, unassuming, even shy, particularly in public, McSweeney is known for being obsessed by winning, constantly fearful of complacency and ever aware of Labour’s track record of losing far more elections than it wins.Born in Macroom, County Cork, he had a comfortable upbringing as the son of an accountant and a retired office worker, according to a profile by The Times newspaper's Patrick Maguire and Gabriel Pogrund.He moved to London as a teenager, initially working on building sites before winning a place at the London School of Economics.According to the book Get In, authored by Maguire and Pogrund, he dropped out and went to live in an Israeli kibbutz for six months, before returning to London to study at Middlesex University - leaving with a degree in politics and marketing.McSweeney then joined Labour under Tony Blair, working in a junior role at the party's headquarters. He later started working for Steve Reed, who is now housing secretary, but at the time was a councillor in Lambeth, south London, where he was trying to regain control of the party from the hard left. In 2006, McSweeney helped run the party's successful campaign to take control of the council, with Reed becoming leader. His reputation as a skilled campaign strategist was further cemented in Barking and Dagenham, where the far-right, anti-immigrant British National Party was gaining support and hoping to win its first parliamentary seat 2010. McSweeney played a key role in the fight to defeat the BNP in the area, with a campaign which focused on local issues.However, his campaigns were not always a success - in 2015 he ran Blairite Liz Kendall's bid to become Labour leader, where she secured only 4.5% of votes in the contest won by Jeremy Corbyn.In 2017, McSweeney became a director of the think tank Labour Together, which opposed the direction of the party under Corbyn and went on to back Sir Keir.The Electoral Commission later fined Labour Together £14,250 for late and inaccurate reporting of donations during the period when McSweeney was a director. The fine later fuelled calls from Conservative MPs for a deeper investigation into Labour's campaign finances - though the Electoral Commission decided not to reopen an investigation.At the time of the fine, McSweeney had left Labour Together to run Sir Keir's 2020 leadership bid, later becoming his chief of staff in opposition, where he played a key role in removing Corbyn supporters from positions of power. The Times reported it was here that he masterminded what became Starmer's three-year plan: detoxifying the party, becoming an effective opposition then outflanking the Conservatives on crime, defence and the economy in order to win power.As Labour's campaign director, McSweeney was tasked with devising the party's strategy for last July's general election, including Labour's selection process for parliamentary candidates, which saw left-wing figures sidelined and caused fierce rows with the trade union movement.Among the new Labour MPs to be elected was his wife, Imogen Walker, a former councillor in Lambeth who now represents Hamilton and Clyde Valley. McSweeney was credited with keeping Labour HQ focussed on winning back so called \"hero voters\", the Leave-backing constituents who supported Boris Johnson in 2019 but were willing to swing back behind Labour.He also oversaw the deployment of money and teams into marginal constituencies, often to the detriment of senior Labour figures in safe seats.The result was a historic landslide, with Labour gaining over 200 seats despite increasing their vote share by less than two percentage points.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Morgan McSweeney: Who is Starmer's chief of staff?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b900/live/de61c530-c0ad-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-13T17:18:51.000Z",
      "dateModified": "2025-11-13T17:18:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pam St Clement to return to EastEnders as Pat Butcher in dementia episode",
    "url": "https://www.bbc.com/news/articles/cvgvwx7qwnvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9e6c/live/1367e810-c0ac-11f0-a18a-95a39ab23d99.jpg",
    "tag": "Trending",
    "date": "2025-11-13T21:00:05.000Z",
    "description": "4 hours agoIan YoungsCulture reporterBBCPat will return when Nigel's \"memories and altered reality take him back to the 1990s\"EastEnders favourite Pat",
    "body": "4 hours agoIan YoungsCulture reporterBBCPat will return when Nigel's \"memories and altered reality take him back to the 1990s\"EastEnders favourite Pat Evans, formerly Pat Butcher, is to return to the BBC soap for a one-off comeback episode over the Christmas period.The character, played by Pam St Clement, was beloved by viewers for more than 25 years for her no-nonsense personality and memorable taste in earrings.Pat died in 2012, but was later seen on-screen again with Dame Barbara Windsor, when she returned as a figment of the dying Peggy's imagination in 2016.She will now similarly come back, acting alongside Paul Bradley as Nigel, whose memories take him back to the 90s, as part of a storyline about his dementia next month. 'Coming home'\"I was both surprised and excited to be asked back to tread the streets of Walford once again and to be involved in Nigel's touching dementia storyline,\" St Clement, 83, said.\"It was lovely to be welcomed back by those with whom I had worked for so long. It was just like coming home.\"Pat returns to help Nigel when his dementia symptoms intensify, following an emotional evening at his festive film screening.St Clement first appeared in EastEnders in 1986 and was at the heart of the drama in Albert Square until her character's death.EastEnders executive producer Ben Wadey said: \"It's an honour and a privilege to welcome Pam St Clement back to EastEnders for a special episode in Nigel's ongoing dementia storyline.\"Pat Evans is one of the most cherished and iconic characters to have graced the streets of Walford, and I know I speak on behalf of everyone when I say what a delight it was to see Pat and Pam back in The Queen Vic, as she helps Nigel in his time of need.\"Pat is one of a number of classic characters who have made a return to Walford.Anita Dobson's Queen Vic landlady Angie Watts made a surprise return to visit her daughter Sharon, as she drifted in and out of consciousness in the show's 40th anniversary episode in February.Cindy Beale (Michelle Collins) and Zoe Slater (Michelle Ryan) are back in the Square, while Grant Mitchell (Ross Kemp) and Chrissie Watts (Tracy-Ann Oberman) made recent short-term comebacks.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pam St Clement to return to EastEnders as Pat Butcher in dementia episode",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9e6c/live/1367e810-c0ac-11f0-a18a-95a39ab23d99.jpg"
      ],
      "datePublished": "2025-11-13T21:00:05.000Z",
      "dateModified": "2025-11-13T21:00:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Two-thirds of military women experienced sexual harassment, survey says",
    "url": "https://www.bbc.com/news/articles/cvgkx1nenlpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c5cd/live/340f0ae0-c0b5-11f0-8a6c-bdcd4bb2f081.jpg",
    "tag": "Trending",
    "date": "2025-11-13T19:57:34.000Z",
    "description": "5 hours agoJake Lapham and Jonathan Beale,Defence correspondentTwo-thirds of women serving full-time in the UK's armed forces reported experiencing se",
    "body": "5 hours agoJake Lapham and Jonathan Beale,Defence correspondentTwo-thirds of women serving full-time in the UK's armed forces reported experiencing sexualised behaviour over the past year, according to a survey.This included comments about their appearance, harassment, leering and groping. Women were twice as likely to experience the behaviours as men, the survey said.The Ministry of Defence (MoD), which commissioned the report, called the findings \"wholly unacceptable\" and said it had launched a prevention programme to address unacceptable behaviour.The survey was part of an effort to get to grips with the deeply troubling experiences of many women in the armed forces – who make up about 12% of the force. In 2021, 19-year-old gunner Jaysley Beck took her own life after being sexually harassed and assaulted.  Warrant Officer Michael Webber, 43, had pinned down Beck and tried to kiss her. He was jailed for sexual assault last month.The survey of more than 90,000 military personnel - including full-time personnel referred to as regulars, and part-time reservists - highlights a wide spectrum of harassment – from verbal to physical. Sixty-seven percent of female full-time personnel had encountered some kind of sexualised behaviour in the last year – such as inappropriate jokes, pornography, or comments about their appearance. Among male regulars it was 34%. Of these women, 93% said they believed the behaviour amounted to sexual harassment. Some 42% of female regulars said they had been stared or leered at. A third said they had been touched in a way that made them feel uncomfortable. Sexualised behaviour was most common in an open workplace at the military home or training unit. The MoD said it was addressing what it called inappropriate behaviours by educating recruits about consent, misogyny and harmful online influences.Minister for Veterans and People, Louise Sandher-Jones, said the survey results were \"wholly unacceptable\", describing it as a \"no holds barred baseline, to fully confront and address the root causes of this issue\".\"New standards in transparency and accountability are being set across our Armed Forces,\" she added.The survey comes a year after a separate Royal Navy investigation found women in the Submarine Service had suffered misogyny, bullying and other unacceptable behaviours.The behaviour was seen \"amongst all ranks\" but was \"not pervasive\" across the service, the report said, after a two-year long investigation.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two-thirds of military women experienced sexual harassment, survey says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c5cd/live/340f0ae0-c0b5-11f0-8a6c-bdcd4bb2f081.jpg"
      ],
      "datePublished": "2025-11-13T19:57:34.000Z",
      "dateModified": "2025-11-13T19:57:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Starmer's chief of staff McSweeney not leaving role over briefing war, BBC told",
    "url": "https://www.bbc.com/news/articles/cn8vn4vv87xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d19e/live/9ac8f050-c0bc-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-13T17:20:59.000Z",
    "description": "8 hours agoChris Mason,Political editor and Harry Farley,Political correspondentShutterstockThe prime minister's chief of staff Morgan McSweeney was n",
    "body": "8 hours agoChris Mason,Political editor and Harry Farley,Political correspondentShutterstockThe prime minister's chief of staff Morgan McSweeney was not involved \"directly or indirectly\" in briefings against cabinet ministers and will not be leaving his job, sources have told the BBC.Sir Keir Starmer has faced calls to sack those who briefed journalists that ministers including Health Secretary Wes Streeting were plotting to challenge the PM.Some in government have blamed McSweeney for being the source of the briefings, which have knocked the government off course.McSweeney has not responded to calls for comment but people who have spoken to him have told the BBC: \"He's done absolutely nothing wrong. He's not going anywhere.\"They added: \"I can categorically say he was not involved indirectly or directly.\"Journalists were briefed on Tuesday by allies of the PM that he would take on any challenge to his leadership, in an attempt to shore up his position.There were also briefings that he faced a threat from named ministers, particularly Streeting.Government sources have sought to draw a distinction between the two.Sir Keir earlier said he had been assured by his team in Downing Street that the briefings about cabinet ministers did not come from Number 10.Speaking during a visit to North Wales, the prime minister said: \"I have been talking to my team today. I have been assured that no briefing against ministers was done from No 10 but I have made it clear that I find it absolutely unacceptable.\"He added: \"I have been assured it didn't come from Downing Street but I have been equally clear that whether it is this case or any other, I intend to deal with it.\"Asked if he would sack those responsible, Sir Keir replied: \"I will absolutely deal with anybody responsible for briefing against ministers, cabinet ministers or any other ministers. \"I have always said that is the standard that I expect, and that is the standard that I will enforce.\"Asked whether he still has confidence in McSweeney, the Labour leader said: \"Of course I do. I work closely with my whole team. Our focus is on working for the country.\"One Labour MP and McSweeney ally told the BBC they were \"really worried\" about the chief of staff's welfare amid the torrent of public criticism.Briefings are often part of reporting on politics in Westminster, when people speak to journalists \"off the record\" on condition that they are not named.This means they say things that they are not prepared to say on camera, which the BBC reports in order to give the full story.Both Streeting and Energy Secretary Ed Miliband have said the person behind the briefings should be sacked.On Thursday, Streeting brushed off questions about the row saying it was \"silly Westminster soap opera stuff\" and \"yesterday's news\". Sir Keir apologised to Streeting in a brief phone call on Wednesday evening.Speaking to the BBC, Miliband said it had been a \"bad couple of days\", adding: \"We've got to learn the lessons of this episode and say this is not where the focus should be.\"He said he was confident the prime minister would want to find who the anonymous briefer was and \"get rid of them if he can find out\".\"He hates it when things get leaked, he hates it when cabinet colleagues get briefed against.\"People might think 'if he hates it, why can't he stop it'.\"The truth is, sometimes these things do happen. There are noises off and you can never quite know where they are coming from.\"Miliband's name has been discussed by some Labour MPs as another possible challenger to the prime minister.Asked if he would rule out returning as Labour leader, he replied: \"Yes.\"He added: \"I had the best inoculation technique against wanting to be leader of the Labour Party which is that I was leader of the Labour Party, between 2010 and 2015. \"I've got the T-shirt - that chapter's closed.\"Conservative leader Kemi Badenoch accused Downing Street of \"a cover up\".\"They're trying to sweep this under the rug because they have allowed people to see just how much chaos and disunity there is in government,\" she said \"They need to get back to work.\"Former Conservative Chancellor Jeremy Hunt told Matt Chorley on BBC Radio 5 Live that he thought Streeting had \"played a blinder\" and \"enhanced his reputation\" with how he responded to the briefings.Sir Jeremy added that the incident demonstrated No 10 knew it was in \"deep trouble\" and \"doesn't appear to know what the hell it wants to do\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Starmer's chief of staff McSweeney not leaving role over briefing war, BBC told",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d19e/live/9ac8f050-c0bc-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-13T17:20:59.000Z",
      "dateModified": "2025-11-13T17:20:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "High Court hears challenge over single sex toilet guidance",
    "url": "https://www.bbc.com/news/articles/cddrjq9764yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5a45/live/ff1d7710-c0da-11f0-9cdd-cd78459d79fa.jpg",
    "tag": "Trending",
    "date": "2025-11-13T22:10:19.000Z",
    "description": "3 hours agoAlison Holt,Social affairs editor and James Melley,Senior social affairs producerGetty ImagesThe High Court has been hearing a legal challe",
    "body": "3 hours agoAlison Holt,Social affairs editor and James Melley,Senior social affairs producerGetty ImagesThe High Court has been hearing a legal challenge to the equality watchdog's guidelines on what public or workplace toilets transgender people should use.The Equalities and Human Rights Commission (EHRC) issued since-withdrawn interim guidance in April stating that in places like hospitals, shops and restaurants, single sex toilets should only be used by people of the same biological sex. Lawyers for those challenging the guidance described it as \"legally flawed\" and \"overly simplistic\".The EHRC denies that the advice given breached the rights of transgender people and says the case should be dismissed.According to the guidance, a trans woman, a biological male who identifies as a woman, would be expected to use a gender-neutral toilet or the men's toilets, not those for women.It was issued in April this year, just days after the UK's highest court, the Supreme Court, unanimously ruled that a woman is defined by biological sex under equalities law.The court said that under the 2010 Equalities Act the words \"woman\" and \"sex\" referred to a biological woman and biological sex.The EHRC advice was withdrawn from its website last month.The High Court case has been brought by the campaign group, the Good Law Project (GLP) and three anonymous people.Daniel Stilitz KC, for the GLP, said that the EHRC had given \"categorical and clear advice\" that transgender people should not be allowed to use toilets \"which were appropriate to their lived gender\".He told the court the guidance had created \"a climate of fear\" for transgender people.Mr Stiltz said one of the claimants was a trans man, a biological female who identifies as a man. The court was told previously when at work the person had used the men's toilets, because they looked like \"any other man.\" Once the interim guidance was published, they were told by their manager to stop using the men's toilets and to use either the women's or the disabled toilet instead, the court heard. The claimant said this was inappropriate and it made them uncomfortable.In addition, Mr Stiltz said the Commission had yet to explain how checks could be made on who was using which toilet, without disclosing information about whether or not employees or service-users were transgender.'Carefully considered'In response to the arguments, the barrister for the EHRC, Tom Cross KC, said there was no evidence that the guidance had caused a breach of the rights of a trans person, that the guidance had already been withdrawn, and the case should be dismissed.He said the temporary guidance was carefully considered and proportionate but was withdrawn by the EHRC in October in a bid to prevent any delay in the government approving a new updated code of practice.The updated code sets out how gyms, clubs and hospitals must judge certain spaces in the wake of the Supreme Court ruling.Zoe Leventhal KC, representing the minister for women and equalities, argued that the guidance may have been too simplistic in suggesting that, for example, a trans woman should not use a women's toilet in a public space. She suggested that it could be judged on a case-by-case basis.A lawyer for advocacy group Sex Matters told the court that single sex spaces were vital for bodily privacy, personal dignity and safety.The organisation, which campaigns for sex based rights, said that women's toilets can be a refuge for women and girls to escape uncomfortable situations, or may be required by religious people.The judgment in the case will be delivered in writing at a later date.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "High Court hears challenge over single sex toilet guidance",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5a45/live/ff1d7710-c0da-11f0-9cdd-cd78459d79fa.jpg"
      ],
      "datePublished": "2025-11-13T22:10:19.000Z",
      "dateModified": "2025-11-13T22:10:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Aberdeen to trial alcohol sales at Scottish Premiership match",
    "url": "https://www.bbc.com/news/articles/cjekj4gn7zeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/aec5/live/9382d280-c0c5-11f0-9de8-edd64aee3552.jpg",
    "tag": "Trending",
    "date": "2025-11-13T22:10:55.000Z",
    "description": "3 hours agoGetty ImagesAberdeen will trial alcohol sales at Pittodrie Stadium before a match against Kilmarnock next monthAberdeen Football Club has b",
    "body": "3 hours agoGetty ImagesAberdeen will trial alcohol sales at Pittodrie Stadium before a match against Kilmarnock next monthAberdeen Football Club has been granted a licence to sell alcohol to fans inside Pittodrie at a Scottish Premiership match next month.Home supporters will be able to buy alcoholic drinks in the lower concourse of the Richard Donald Stand before kick-off in the game against Kilmarnock on 14 December.Fans will not be able to drink within sight of the pitch and sales will be stopped before the match gets under way. It is part of a pilot scheme to see how alcohol sales could be safely incorporated into the matchday experience.Alcohol has been prohibited in Scottish football stadiums since 1981.Aberdeen are the first club from Scotland's top division to take part in the scheme.Championship side St Johnstone will also trial alcohol sales during matches against Queen's Park on Saturday and Greenock Morton on 20 December.In a statement, Aberdeen said the initiative had been approved by Aberdeen City Council.The club said the pilot was designed to \"gather insight into how a carefully managed approach to alcohol sales can support a positive and safe matchday experience for supporters\".They added: \"Sales will be managed in full accordance with licensing laws, with appropriate security and stewarding in place.\"Supporters are reminded that alcohol may only be consumed within clearly designated areas and not in sight of the pitch, and all sales will take place in clearly defined, monitored areas of the stadium. Matchday operations, stewarding and safety planning will remain consistent with our usual high standards.\"Getty ImagesAlcohol has been banned at Scottish football games for 44 yearsAt McDiarmid Park, home and away fans will be able to purchase alcohol from a pop-up gazebo at the rear of the East Stand prior to the 15:00 kick offs. Sales will be open between 14:00 and 14:45 and during half time of the matches.As at Aberdeen, drinks cannot be consumed within view of the pitch.It follows similar trials during Premier Sports Cup matches at Arbroath, Ayr United, Queen of the South and Stirling Albion prior to the start of the league season.Alcohol has been prohibited in Scottish football stadiums for 44 years.The ban was initially imposed following a riot during the 1980 Scottish Cup final between Rangers and Celtic at Hampden.The ban does not cover hospitality sections within stadia.The Scottish government and Police Scotland previously said they would consider lifting the alcohol ban in March.Fans have previously called for football supporters to be under the same rules as their rugby equivalents, who are able to drink during matches.A Scottish government spokesperson said: \"Our position on alcohol sales at Scottish football grounds has not changed.\"It is for local licencing authorities and Police Scotland to satisfy themselves that the pilot projects are permissible within the current legislative framework when granting licences.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Aberdeen to trial alcohol sales at Scottish Premiership match",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/aec5/live/9382d280-c0c5-11f0-9de8-edd64aee3552.jpg"
      ],
      "datePublished": "2025-11-13T22:10:55.000Z",
      "dateModified": "2025-11-13T22:10:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Met Police investigating 'tens of grooming gang cases'",
    "url": "https://www.bbc.com/news/articles/c4gpj4ld5yqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6b0e/live/a9982890-c0cf-11f0-a532-d129af550177.jpg",
    "tag": "Trending",
    "date": "2025-11-13T21:51:07.000Z",
    "description": "3 hours agoJames W KellyLondonLondon AssemblySir Mark told the assembly said recorded abuse falls into various categories beyond just \"grooming gangs\"",
    "body": "3 hours agoJames W KellyLondonLondon AssemblySir Mark told the assembly said recorded abuse falls into various categories beyond just \"grooming gangs\"The Metropolitan Police is investigating \"tens\" of group-based child sexual abuse cases involving what could be described as grooming gangs, the force's commissioner has said.An initial data search identified around 9,000 historic cases that might fall under the broad national criteria, but after reviewing 2,200 of them only about 1,200 remained in scope, Sir Mark Rowley told the London Assembly.The commissioner warned against using \"grooming gangs\" as a catch-all term because offending includes abuse within families, in institutions, between peers and online. He said the ethnicities of suspects varied and are \"reflective of the diversity we see in the city\".During Thursday's meeting, the police commissioner set out details of a national review of child exploitation cases, which has prompted recent political debate.Sir Mark said a data search had initially identified about 9,000 historic cases in London that might fall under a national definition of group-based sexual offending, which includes any case with two or more suspects and at least one victim.He also said that figure had been widely misinterpreted as 9,000 grooming gang cases and had led to \"unbalanced reporting\".He said the definition used by the national audit was far broader than the public understanding of grooming gangs and covered intra-familial offending, institutional abuse, peer-on-peer cases and online exploitation.'Simplistic analysis'He told the assembly that after reviewing 2,200 of the 9,000 cases, around 1,200 remained in scope and that the number would continue to fall as the work progressed.The commissioner said that once the initial assessment was complete, the Met expected \"maybe 2,000 or 3,000 cases\" to be considered for possible reinvestigation, but stressed this would still cover a wide mix of offending types, not solely grooming gangs.\"We do not see the typology reported elsewhere where there have been cases of offending committed by groups of Pakistani men on white British children being the sole or majority case,\" added Sir Mark.He also said the Met recorded around 2,000 sexual offences a month, about half of which involved child sexual abuse, and warned that managing current cases alongside historic ones would require extra funding and specialist officers.\"It is important for us to use precise language and consider its impact on victims and public understanding. There is too much ready reach to simplistic analysis which risks misleading communities,\" he said.Getty ImagesSir Sadiq Khan defended his record on supporting victims and survivors of abuseSir Mark's comments came during a meeting in which London Mayor Sir Sadiq Khan was accused of \"taking the mickey\" out of victims after previously saying there was \"no indication of grooming gangs\" operating in the capital.Susan Hall, Conservative group leader, said: \"In January, I asked if we had grooming gangs in London. You dismissed my question by pretending you didn't know what I meant.\" London AssemblySusan Hall accused the mayor of previously dismissing victims of grooming gangsSir Sadiq responded by clarifying \"what is meant by grooming gangs\", according to the national inquiry announced by Prime Minister Sir Keir Starmer in June, and outlined the support provided to victims.The mayor told the assembly that London had \"issues in relation to child sexual exploitation\" and \"child sexual abuse\", but that these cases were different to those seen elsewhere in England. \"I've led efforts to strengthen the protection of children and those exploited by abuse and exploitation,\" he said. More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Met Police investigating 'tens of grooming gang cases'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6b0e/live/a9982890-c0cf-11f0-a532-d129af550177.jpg"
      ],
      "datePublished": "2025-11-13T21:51:07.000Z",
      "dateModified": "2025-11-13T21:51:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Slow growth raises stakes even higher for the Budget",
    "url": "https://www.bbc.com/news/articles/c93x5xw22n6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/aee1/live/8b11c180-c087-11f0-ad34-0189a3f2a4c8.jpg",
    "tag": "Trending",
    "date": "2025-11-13T12:47:59.000Z",
    "description": "12 hours agoFaisal IslamEconomics editorToday's disappointing growth figures reflect that the UK has returned to the slower lanes of growth, having ou",
    "body": "12 hours agoFaisal IslamEconomics editorToday's disappointing growth figures reflect that the UK has returned to the slower lanes of growth, having outperformed earlier in the year.The 0.1% growth seen in the July-to-September quarter was below forecasts, and the economy shrank in the month of September.A breakdown in car production following the cyber-attack on Jaguar Land Rover does explain September's contraction, and why the overall growth figures were worse than expected. The ONS told me that if vehicle production had been flat rather than the worst monthly fall on record outside of the pandemic, GDP in September would have gone up. That is not the full story, though. Momentum in the economy has clearly flagged.In particular, slowdowns in consumer-facing services and business investment are a key concern.Higher costs of employment and the constantly rolling uncertainty are not helping. Consumers remain cautious, with high savings rates, and businesses have not yet turned on the investment taps.A key objective for the Budget is to end the constant doom loop of speculation about tax changes. There will be a bigger buffer against fiscal shocks, and potential changes to how often the chancellor's borrowing rules are assessed.Certainty has a price, however, in terms of tax rises. The Budget will try to target the rise in tax away from worker pay packets and investors, but the sums involved make this a tricky task.The silver lining for some to the cloudy figures is that a further Bank of England rate cut next month now seems very likely, with perhaps more to come next year.It is reflected in the declining cost of government borrowing on markets, with key two- and five-year rates now below what Labour inherited when entering office. The cost of fixed mortgage rates is also starting to come down. The chancellor will see this as vindication for a tough stance on her \"non-negotiable\" rules, and will use these figures to demand discipline over tricky Budget decisions from her backbenches. The property market has also, however, been impacted by speculation about tax changes.The feel-good factor is missing. UK consumers, unlike US consumers, have kept savings levels high, and are not spending as much. Years of rolling crises, followed by ongoing uncertainty about policy, has left scars.The UK economy has not managed to break the trend of slow growth, despite a strong-ish first half of the year. There was no growth when adjusting for the size of the population. While the economy has defied the recessionary vibes, and could still end up the second fastest G7 economy this year, the Budget somehow has to provide certainty, try to boost consumer and business confidence, and at the same time fill a large fiscal gap.It's quite the ask, and the latest growth figures have raised the stakes for the Budget even higher.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Slow growth raises stakes even higher for the Budget",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/aee1/live/8b11c180-c087-11f0-ad34-0189a3f2a4c8.jpg"
      ],
      "datePublished": "2025-11-13T12:47:59.000Z",
      "dateModified": "2025-11-13T12:47:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Peers suggest over 900 changes to assisted dying bill",
    "url": "https://www.bbc.com/news/articles/c2drk17p942o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/345e/live/a4721120-c0c3-11f0-9de8-edd64aee3552.png",
    "tag": "Trending",
    "date": "2025-11-13T19:05:44.000Z",
    "description": "6 hours agoJennifer McKiernan,Political reporter and Harry Farley,Political correspondentMembers of the House of Lords have put forward more than 900 ",
    "body": "6 hours agoJennifer McKiernan,Political reporter and Harry Farley,Political correspondentMembers of the House of Lords have put forward more than 900 proposed changes to the law to deliver assisted dying, ahead of a debate on Friday.Experts believe the number of amendments, which is understood to be 942, is  unprecedented, but opponents say significant alterations are needed to ensure any scheme can operate safely.The volume of amendments has sparked a letter from 65 supportive peers to their colleagues in the Lords, raising concern about possible delaying tactics.Those opposing the bill have been urged not to \"frustrate\" the passage of the legislation, which has already gained the approval of MPs. The House of Commons passed the Terminally Ill Adults (End of Life) Bill in June, and it passed its first stage in the Lords in September.The required line-by-line examination of the bill that follows was delayed, following an amendment by Labour's Baroness Berger to allow a committee of peers to scrutinise the legislation further.Parliament heard officials worked into the early hours of Thursday morning to compile the suggested changes to the bill that flooded in ahead of the next scrutiny stage, known as committee stage, which begins on Friday. There appear to be seven opponents to the bill who have submitted 579 amendments between them.According to the parliamentary authorities, while some bills have had more amendments tabled in total at committee stage, it sets a possible record for the number submitted in the first full list of suggested changes.They say it is almost certainly unprecedented for the committee stage of this type of bill, known as a private member's bill, which has been put forward by backbench Labour MP Kim Leadbeater rather than the government.Experts including Matthew England, a researcher at the Hansard Society, said the number of amendments \"does appear to be a record, at least in the recent past\".Others drew comparisons to the bill to take the UK out of the European Union, which had 820 amendments in total. A peer in favour of the legislation told the BBC that the number of amendments \"looks like a delaying tactic to me... It's obviously not a coincidence.\"Defending the volume of amendments,  Baroness Luciana Berger, who opposes assisted dying, told the BBC that evidence to the select committee \"strongly refuted any suggestion this bill is either safe or workable\".\"This bill is full of holes which vulnerable people will fall through and be harmed if peers don't act to change and amend it,\" she added.However, signatories to the letter highlighted how the bill had \"already undergone unprecedented scrutiny\" and \"offers dying people the choice of a safe, dignified end while strengthening protections for the vulnerable\".Former Royal College of Nursing president Baroness Rafferty was among the 65 peers to have signed, and she was joined by scientist and broadcaster Lord Winston, former Labour leader Lord Kinnock and former Whitehall chief Lord O'Donnell.They urged opponents to focus on refining the bill to find where \"genuine improvements can be made, while respecting both the will of the Commons and the overwhelming support of the public\".In response to the letter, a source close to peers who are concerned about the bill said: \"This letter is making claims directly contradicted by the evidence provided in the last few weeks at the Lords select committee by the royal colleges, professionals and independent statutory bodies. \"Evidence and facts are vital when crafting good legislation.\"The bill is being treated by parties as a matter of conscience, meaning they will not instruct their MPs or peers how to vote. The bill will become law in England and Wales only if both the House of Commons and House of Lords agree on the final drafting of the legislation - with approval needed before spring next year, when the current session of Parliament ends.If it does pass into law, the government has four years in which to get an assisted dying service into place, meaning it could be 2029/30 before the first assisted death happens.The legislation proposes allowing terminally ill adults with fewer than six months to live to apply for an assisted death.This would be subject to approval by two doctors and a panel featuring a social worker, a senior legal figure and a psychiatrist. Sign up for our Politics Essential newsletter to read top political analysis, gain insight from across the UK and stay up to speed with the big moments. It'll be delivered straight to your inbox every weekday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Peers suggest over 900 changes to assisted dying bill",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/345e/live/a4721120-c0c3-11f0-9de8-edd64aee3552.png"
      ],
      "datePublished": "2025-11-13T19:05:44.000Z",
      "dateModified": "2025-11-13T19:05:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Our dogs' diversity can be traced back to the Stone Age",
    "url": "https://www.bbc.com/news/articles/ce9d7j89ykro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fa83/live/3be79930-bff2-11f0-9c0c-65b4fe15616b.jpg",
    "tag": "Trending",
    "date": "2025-11-13T19:00:29.000Z",
    "description": "6 hours agoVictoria GillScience correspondent, BBC NewsVictoria Gill/BBC NewsMy own dog seems a long way from a wild wolfIf you, like me, have a spoil",
    "body": "6 hours agoVictoria GillScience correspondent, BBC NewsVictoria Gill/BBC NewsMy own dog seems a long way from a wild wolfIf you, like me, have a spoiled, lazy dog that enjoys cheese flavoured treats, the fact that your pet's ancestors were wild predators can seem unfathomable.But a major new study suggests their physical transformation from wolf to sofa-hogging furball began in the Middle Stone Age, much earlier than we previously thought.\"When you see a Chihuahua - it's a wolf that's been living with humans for so long that it's been modified,\" says Dr Allowen Evin from the University of Montpellier, a lead researcher on this study.She and her colleagues discovered that the transformation of our pets championed by the Victorians through selective breeding actually started more than 10,000 years ago.C AmeenThe researchers studied more than 600 skulls that spanned 50,000 years of dog and wolf evolutionIn a paper published in the journal Science, this international team of researchers focused their attention on prehistoric canine skulls. Over more than a decade, they collected, examined and scanned bones that spanned a period of 50,000 years of dog evolution.They created digital 3D models of each of the more than 600 skulls they examined - and compared specific features across ancient and modern dogs - and their wild relatives.This revealed that, nearly 11,000 years ago, just after the last ice age, dog skulls started to change shape. While there were still slender, wolf-like dogs, there were also many with shorter snouts and wider, stockier heads.Dr Carly Ameen from the University of Exeter, another lead researcher on this project, explained to BBC News that almost half of the diversity we see in modern dog breeds today was already present in dog populations by the middle of the Stone Age.\"It's really surprising,\" she said. \"And it starts to challenge the ideas about whether or not it was the Victorians -  and their kennel clubs - that drove this.\"C Brassard (VetAgro Sup/Mecadev)The researchers produced digital scans of each of the skulls they studied. The pink skull on the left in this image is a modern dog with a shorter snout and the green image on the right is a scan of a wolf skull. Domestication: An ancient mysteryDogs were the first animals to be domesticated. There is evidence that humans have been living closely with canines for at least 30,000 years. Where and why that close association began remains a puzzle.This study has revealed some of the earliest physical evidence of dogs transforming into the diverse array of pets, companions and working animals that we know today. And the researchers' digital scans of the skulls that they studied will allow them to answer more questions about the evolutionary driving forces behind domestication.Some researchers have suggested that humans and wolves came together almost by accident, when wolves moved to the outskirts of hunter-gatherer communities to scavenge for food.Tamer wolves would get more food, and the humans gradually came to rely on the wolves to clean up remains of messy carcasses and to raise the alarm if a predator came near.As to why that ultimately changed dogs' physical appearance, Dr Ameen said there were likely to be a number of reasons. She did not rule our ancestors preference for boxy heads and cute, snub noses but she explained: \"It's likely to be a combination of interaction with humans, adapting to different environments, adapting to different types food - all contributing to the kind of explosion of variation that we see.\"It's hard to untangle which of those might be the most important one.\"For tens of thousands of years, our human story and that of our dogs has been entangled. In another paper in this same edition of the journal Science, a research group led by scientists in China studied ancient DNA from dogs that lived between 9,700 and 870 years ago - at sites across Siberia, the Central Eurasian Steppe, and northwest China.They concluded that the movement of domestic dogs across that region often coincided with migrations of people - hunter-gatherers, farmers, and pastoralists. So our dogs have travelled alongside us - and been integrated into our societies - for thousands of years.I can't say that my own stubborn, disobedient terrier provides me with any of the benefits that the first domesticated wolves bestowed on our ancestors. But I can see why, as research suggests, once a dog showed up for some leftovers, there was no going back.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Our dogs' diversity can be traced back to the Stone Age",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fa83/live/3be79930-bff2-11f0-9c0c-65b4fe15616b.jpg"
      ],
      "datePublished": "2025-11-13T19:00:29.000Z",
      "dateModified": "2025-11-13T19:00:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC apologises to Trump over Panorama edit but refuses to pay compensation",
    "url": "https://www.bbc.com/news/articles/c874nw4g2zzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/535a/live/63a05d40-c0ab-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "Trending",
    "date": "2025-11-13T22:01:10.000Z",
    "description": "3 hours agoNoor NanjiCulture reporterReuters / AFP via Getty ImagesThe BBC has apologised to US President Donald Trump for a Panorama episode that spl",
    "body": "3 hours agoNoor NanjiCulture reporterReuters / AFP via Getty ImagesThe BBC has apologised to US President Donald Trump for a Panorama episode that spliced parts of his 6 January 2021 speech together, but rejected his demands for compensation.The corporation said the edit had given \"the mistaken impression that President Trump had made a direct call for violent action\" and said it would not show the 2024 programme again.Lawyers for Trump have threatened to sue the BBC for $1bn (£759m) in damages unless the corporation issues a retraction, apologises and compensates him.The fallout from the scandal led to the resignations of BBC director general Tim Davie and head of news Deborah Turness on Sunday.BBC News has approached the White House for comment.The apology comes hours after a second similarly edited clip, broadcast on Newsnight in 2022, was revealed by the Daily Telegraph.In its Corrections and Clarifications section, published on Thursday evening, the BBC said the Panorama programme had been reviewed after criticism of how Trump's speech had been edited.\"We accept that our edit unintentionally created the impression that we were showing a single continuous section of the speech, rather than excerpts from different points in the speech, and that this gave the mistaken impression that President Trump had made a direct call for violent action,\" it said.Lawyers for the BBC have written to President Trump's legal team in response to a letter received on Sunday, a BBC spokesperson said.\"BBC chair Samir Shah has separately sent a personal letter to the White House making clear to President Trump that he and the corporation are sorry for the edit of the president's speech on 6 January 2021, which featured in the programme,\" they said.They added: \"While the BBC sincerely regrets the manner in which the video clip was edited, we strongly disagree there is a basis for a defamation claim.\"Why is Donald Trump threatening to sue the BBC?Trump vs the BBC: What hurdles might the president's legal argument face?In Trump's speech he said: \"We're going to walk down to the Capitol, and we're going to cheer on our brave senators and congressmen and women.\"More than 50 minutes later in the speech, he said: \"And we fight. We fight like hell.\"In the Panorama programme the clip shows him as saying: \"We're going to walk down to the Capitol... and I'll be there with you. And we fight. We fight like hell.\"Speaking to Fox News, Trump said his speech had been \"butchered\" and the way it was presented had \"defrauded\" viewers.The BBC received the letter from Trump's lawyers on Sunday. It demands a \"full and fair retraction\" of the documentary, an apology, and that the BBC \"appropriately compensate President Trump for the harm caused\".It set a deadline of 22:00 GMT (17:00 EST) on Friday for the corporation to respond.Watch: How the BBC works... in under two minutesIn its letter to Trump's legal team, the BBC sets out five main arguments for why it does not think it has a case to answerFirst it says the BBC did not have the rights to, and did not, distribute the Panorama episode on its US channels.When the documentary was available on BBC iPlayer, it was restricted to viewers in the UK.Secondly, it says the documentary did not cause Trump harm, as he was re-elected shortly after.Thirdly, it says the clip was not designed to mislead, but just to shorten a long speech, and that the edit was not done with malice.Fourthly, it says the clip was never meant to be considered in isolation. Rather, it was 12 seconds within an hour-long programme, which also contained lots of voices in support of Trump.Finally, an opinion on a matter of public concern and political speech is heavily protected under defamation laws in the US.A BBC insider said that internally, there is a strong belief in the case the corporation has put forward, and in its defence.Fresh claim of misleading editEarlier on Thursday, the BBC was accused of another misleading edit of Trump's 6 January 2021 speech, two years before the Panorama sequence aired.On a Newsnight programme from 2022, the edit is a little different from Panorama.Trump is shown as saying: \"We're going to walk down to the Capitol. And we're going to cheer on our brave senators and congressmen and women. And we fight. We fight like hell. And if you don't fight like hell, you're not gonna have a country anymore.\"This was followed by a voiceover from presenter Kirsty Wark saying \"and fight they did\" over footage from the Capitol riots.Responding to the clip on the same programme, former White House chief of staff Mick Mulvaney, who quit a diplomatic post and became a critic of Trump after describing the 6 January riots as an \"attempted coup\", said the video had \"spliced together\" Trump's speech.\"That line about 'we fight and fight like hell' is actually later in the speech and yet your video makes it look like those two things came together,\" he said.In response to Thursday's story in the Telegraph, a BBC spokesperson said the BBC holds itself to the \"highest editorial standards\" and the matter was being looked into.A spokesman for Trump's legal team told the Telegraph it was \"now clear that BBC engaged in a pattern of defamation against President Trump\".Concerns over the Trump Panorama documentary emerged when a leaked internal memo, written by a former independent external adviser to the corporation's editorial standards committee, was published by the Telegraph newspaper. Among other things, the document also criticised the BBC's reporting of trans issues, and BBC Arabic's coverage of the Israel-Gaza war.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC apologises to Trump over Panorama edit but refuses to pay compensation",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/535a/live/63a05d40-c0ab-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-13T22:01:10.000Z",
      "dateModified": "2025-11-13T22:01:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]