[
  {
    "title": "The Making of Do They Know It’s Christmas?",
    "url": "https://www.bbc.co.uk/iplayer/episode/m0025gmy/the-making-of-do-they-know-its-christmas?at_mid=Ic6fsbnoVI&at_campaign=The_Making_of_Do_They_Know_Its_Christmas&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m0025gmy&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=The_Making_of_Do_They_Know_Its_Christmas&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0k68msg.jpg",
    "tag": "Trending",
    "date": "2025-12-06T01:05:46.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeThe Making of Do They Know It’s Christmas?The Making of Do They Know It’s Christmas?Contains some strong language.Forty years on from the release of the hit single by charity supergroup Band Aid, this documentary unearths 75 minutes of rare and previously unseen film footage from the day of recording. Duration1h 14mFirst shown25 Nov 2024Available for 21 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesWham!: Last Christmas Unwrapped40 years a festive favourite. Andrew, Pepsi and Shirlie revisit Wham!’s winter wonderland59 minsLive Aid at 40: When Rock ’n’ Roll Took on the WorldNot just for one day. The creation and legacy of a concert that changed everythingWhen Blondie Came to BritainTouched by their presence. How the UK’s always been so special for Debbie and co59 minsSounds of the SixtiesFeaturing vintage performances from Tom Jones, the Kinks and the Moody Blues.9 minsBanned in the 80s: Moments That Shook MusicThe sound of rebellion. From N.W.A to Madonna, the controversial hits that made history55 minsDionne Warwick: Don't Make Me OverWhat the world needs now... How a sublime voice found a second life as a call for change1h 32mThe 80s - Music’s Greatest Decade?Beyond the power ballads. Dylan Jones champions a creative and innovative decade in popGuitar Heroes at the BBCFeaturing the Stones, David Bowie, Michael Chapman, Horslips, Motorhead and Nazareth.59 minsMr Blue Sky: The Story of Jeff Lynne and ELOThe pioneer of progressive pop – from the Brum beat scene to huge hits all over the world57 minsReclaiming AmyHer life, loves and legacy. Amy Winehouse’s family remember her incredible talent58 minsWhen Tina Turner Came to BritainLet’s stay together. From 60s starlet to 80s comeback queen, a career built in Britain59 minsArenaThe first episode of Arena, from 1975.29 mins",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Making of Do They Know It’s Christmas?",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0k68msg.jpg"
      ],
      "datePublished": "2025-12-06T01:05:46.000Z",
      "dateModified": "2025-12-06T01:05:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Person of interest' detained over Brown University shooting, official says",
    "url": "https://www.bbc.com/news/articles/ckg9ll6jpl0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3670/live/2c8ffe30-d8e5-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2025-12-14T12:18:03.000Z",
    "description": "6 minutes agoReutersRachel Muller-HeyndykA person of interest has been detained in connection with a US shooting at Brown University that left two peo",
    "body": "6 minutes agoReutersRachel Muller-HeyndykA person of interest has been detained in connection with a US shooting at Brown University that left two people dead, police said.Nine others were injured when a gunman opened fire at the university in Providence on Saturday.Police confirmed on Sunday a person had been detained, and an earlier order for people on the Brown campus and surrounding areas to shelter had been lifted.Of those injured, medics said one person was in a critical condition, six were \"critical but stable\" and two others were less severely hurt.The gunman opened fire in a classroom at around 16:00 local time (21:00 GMT) on Saturday at the Holley engineering building at the eastern end of Brown's campus, according to officials.The identities of those killed or injured have not yet been released, but Brown University President Christina Paxson told reporters in a press briefing on Saturday that all the victims, including those killed and wounded, were students.Police had earlier released CCTV footage of a male suspect walking away from the scene wearing all black clothing. Officers said a firearm was not found in a sweep of the building.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Person of interest' detained over Brown University shooting, official says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3670/live/2c8ffe30-d8e5-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-14T12:18:03.000Z",
      "dateModified": "2025-12-14T12:18:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - ​​Starmer Says a Doctor Strike Would be 'Reckless' - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mnfl33?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-13T16:30:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·13 Dec 2025,·26 mins​​Starmer Says a Doctor Strike Would be 'Reckless'NewscastAvailable for over a year​​Today, the Prime Minister Keir Starmer has written in the Guardian Newspaper urging members of the British Medical Association to rethink planned strikes. \n​​\n​​Possible strikes coincide with flu-related illnesses and hospitalisations at a higher rate than usual for this time of year, which have led to worries that a strike would lead to problems for the NHS.\n​​\n​​Also, Laura has spoken to the new chair of the Equality and Human Rights Commission, Dr Mary-Ann Stephenson. Since the Supreme Court ruling over the definition of a woman in April they have been working on new guidance on who can access single-sex spaces. So how might the guidance be implemented?\n​​\n​​You can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers.\n​​\n​​You can join our Newscast online community here: https://bbc.in/newscastdiscord\n​​\n​​Get in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\n​​\n​​New episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\n​​\n​​Newscast brings you daily analysis of the latest political news stories from the BBC. The presenters were Laura Kuenssberg and Paddy O'Connell It was made by Chris Flynn with Rufus Gray. The social producer was Joe Wilkinson. The technical producer was Michael Regaard. The weekend series producer is Chris Flynn. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - ​​Starmer Says a Doctor Strike Would be 'Reckless' - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-13T16:30:00.000Z",
      "dateModified": "2025-12-13T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Global News Podcast - Democrats release photos of Trump from Epstein estate - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mnc4k5?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0lqdxrf.jpg",
    "tag": "Trending",
    "date": "2025-12-13T04:15:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·13 Dec 2025,·26 minsAvailable for 88 daysRepublicans accuse the Democrats of playing politics with release of photos from the estate of late sex offender, Jeffrey Epstein, that feature rich and powerful people, including Donald Trump. Also: Thailand attacks what Cambodia describes as civilian facilities near their shared border; Iranian security forces use violence to detain Nobel Peace Prize winner, Narges Mohammadi; the curtain is about to come down on John Cena, one of the most celebrated wrestlers from the world of Sports Entertainment and analysis shows pop song lyrics are getting sadder. \nThe Global News Podcast brings you the breaking news you need to hear, as it happens. Listen for the latest headlines and current affairs from around the world. Politics, economics, climate, business, technology, health – we cover it all with expert analysis and insight.\nGet the news that matters, delivered twice a day on weekdays and daily at weekends, plus special bonus episodes reacting to urgent breaking stories. Follow or subscribe now and never miss a moment.\nGet in touch: globalpodcast@bbc.co.ukProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Global News Podcast - Democrats release photos of Trump from Epstein estate - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0lqdxrf.jpg"
      ],
      "datePublished": "2025-12-13T04:15:00.000Z",
      "dateModified": "2025-12-13T04:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kemi Badenoch: Tories to scrap petrol ban if they win next election",
    "url": "https://www.bbc.com/news/articles/c36z84ej6e0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5d36/live/897828d0-d8bc-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-14T09:41:27.000Z",
    "description": "Kemi Badenoch says the Conservatives will scrap the ban on petrol and diesel vehicles due to come into force in the UK if they win the next election.W",
    "body": "Kemi Badenoch says the Conservatives will scrap the ban on petrol and diesel vehicles due to come into force in the UK if they win the next election.Writing in the Sunday Telegraph, the Conservative Party leader said the Zero Emission Vehicle mandate (ZEV) was a \"well-meaning but ultimately destructive piece of legislation\".From 2030, all new cars will have to be electric or hybrid as part of government efforts to meet a legally binding aim of achieving \"net zero\" by 2050.The Conservative leader's comments come after her meeting with Italian Prime Minister Giorgia Meloni, who has lobbied the EU to water down its own plans for a ban.Net zero refers to the balance between the amount of greenhouse gas produced and the amount removed from the atmosphere.Six EU countries, including Italy, have recently called on other member states to rethink plans to phase out new petrol and diesel cars by 2035, saying it could hurt industrial competitiveness.Badenoch suggested the EU had signalled it would drop a full ban, adding: \"The reality is that the EU's change of heart on EVs will leave Labour even more isolated, and by pressing ahead alone, we are placing our domestic industry at a disadvantage while giving others the opportunity to dominate global supply chains.\"She said the only \"winners in this economic self-harm are China\".The Conservative leader added that her government would still move towards a \"transition to cleaner transport\" but one driven by \"affordability, practicality and technological progress\" rather than \"unrealistic mandates that weaken domestic manufacturing and empower foreign competitors\".She said scrapping the mandate would give \"space\" to rebuild the UK's car industry.UK car firms were said to have been split over the 2030 deadline, with some calling for more support to be able to meet it.In its latest Budget, the government announced an extra £1.3 billion investment into the UK's Electric Car Grant scheme to encourage drivers to make the switch to EVs.Chancellor Rachel Reeves also announced that drivers of battery electric cars, which includes plug-in hybrids, will be charged 3p per mile for the Electric Vehicle Excise Duty from April 2028, with some arguing the move could make electric cars less appealing.The ban on the sale of petrol and diesel cars was originally introduced in 2020 by then Prime Minister, Conservative Boris Johnson - Badenoch, a cabinet member at the time, opposed the plans.It was later pushed back to 2035 by Rishi Sunak, with Labour pledging to bring it forward in its 2024 election manifesto.A spokesperson for the Department for Transport said the government remained \"committed to phasing out all new non-zero emission car and van sales\".They said: \"More drivers than ever are choosing electric\".The next UK general election must be held by 15 August 2029, but the prime minister can opt to call an election at any point before this.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kemi Badenoch: Tories to scrap petrol ban if they win next election",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5d36/live/897828d0-d8bc-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-14T09:41:27.000Z",
      "dateModified": "2025-12-14T09:41:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Violence against women and girls is a national emergency, says Shabana Mahmood",
    "url": "https://www.bbc.com/news/articles/cj69w7kezdzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/edf1/live/3afa8760-d8db-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-14T11:37:54.000Z",
    "description": "45 minutes agoSima Kotecha,Senior UK correspondentandAlex SmithViolence against women and girls is a \"national emergency\", the home secretary has said",
    "body": "45 minutes agoSima Kotecha,Senior UK correspondentandAlex SmithViolence against women and girls is a \"national emergency\", the home secretary has said, as she announced plans to set up specialist rape and sexual offence investigation teams in every police force in England and Wales by 2029.It is part of a long-delayed plan aimed at halving violence against women and girls within a decade.The strategy - which will include funding for undercover units operating online, and a roll out of domestic abuse protection orders - is due to be unveiled on Thursday, after being pushed back three times this year.Shabana Mahmood said that during her time in government she had come to \"the depressing conclusion\" that \"the criminal justice system fails women\". Speaking to the Sunday with Laura Kuenssberg programme, she said the way police forces investigate cases was \"too much of a postcode lottery\".The government says the new teams will have officers with specialist investigation skills for working on rape and sexual offence cases.It says staff will have the right training to understand the mindset of abusers and victims.More than 50% of police forces already have these teams in place, but the government says every force will have dedicated officers by 2029.Metropolitan Police Commissioner Sir Mark Rowley welcomed the move, saying the government will replicate tactics used by the Met in its existing V100 programme.The programme uses data to identify and target men who pose the highest risk to women.Sir Mark said the Met applies the \"same relentless determination we use to combat terrorism to tackle violence against women and girls\", adding: \"We built an entirely new system focused on pursuing and prosecuting men who commit violence and I am pleased the government is now asking all forces to have the same principle.\"Also announced is a roll out of domestic abuse protection orders, which have been trialled over the last year, across England and Wales.They can ban individuals from contacting a victim, visiting their home or posting harmful content online, and can also be used in cases involving coercive or controlling behaviour. Breaching an order is a criminal offence.Mahmood said the early evidence from the pilots on the effectiveness of the orders was \"very, very positive\" with a large number of arrests of people breaching the orders. \"The really different thing that those orders do is they take the onus away from the woman, the victim herself, to chase her abuser all the way around different bits of the legal system in order to enforce the order and actually puts it back on the police,\" she said. There will be almost £2m in investment for special undercover units of police officers operating online - to target those harassing women and girls on the internet.The government is also looking at extending Clare's Law to include offences such as stalking, sexual assault and harassment. The law was established in memory of Clare Wood, who was murdered in 2009 by her-ex-boyfriend who had a history of violent behaviour.It currently allows people to ask for information from the police about their partner, or ex-partner's, history of domestic abuse. A report released earlier this month found that more than a quarter of police forces in England and Wales had not implemented basic policies for investigating sexual offences.It said sexually-motivated crimes against women in public remained widespread, criticised the limited nature of data on them, and called for urgent action to prevent predators from offending.The publishing of the government's strategy has been long delayed. It was initially expected to be announced in the spring.In Labour's general election manifesto last year the party pledged to use \"every government tool available to target perpetrators and address the root causes of abuse and violence\".On Tuesday, the chairs of three Commons select committees raised their concerns over repeated delays in publishing the plans.The BBC has previously been told that changing attitudes among boys and young men will be at the centre of what is proposed.It is understood it will be built around three goals: preventing radicalisation of young men, stopping abusers, and supporting victims.Some domestic abuse survivors have told the BBC the time for talking is over - and these measures must be implemented quickly.Conservative shadow home secretary Chris Philp called the announcement \"too little, too late\".Speaking to Laura Kuenssberg, he said it was \"disappointing\" it had taken the government a year and a half to produce its strategy and that the funding provided was \"a very small amount\". Asked why the previous Conservative government, of which he was a member, and the current Labour one had struggled to grip the problem, he said both parties took the issue \"seriously\" but added that the criminal justice system was \"quite slow and bureaucratic\".He said changes to the disclosure of evidence, introduced after a prosecution collapsed in 2017, had \"slowed the whole system down\". ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Violence against women and girls is a national emergency, says Shabana Mahmood",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/edf1/live/3afa8760-d8db-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-14T11:37:54.000Z",
      "dateModified": "2025-12-14T11:37:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Equality boss expects people to 'follow rules' over single-sex spaces",
    "url": "https://www.bbc.com/news/articles/cpq4ydrprpgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b22a/live/6941e8e0-d8b6-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-13T19:41:59.000Z",
    "description": "17 hours agoLaura KuenssbergPresenter, Sunday with Laura KuenssbergNobody is expecting there to be a \"toilet police\" but everyone should \"follow the r",
    "body": "17 hours agoLaura KuenssbergPresenter, Sunday with Laura KuenssbergNobody is expecting there to be a \"toilet police\" but everyone should \"follow the rules\" when guidance on single-sex spaces is released, the new head of the equality watchdog has told the BBC.Dr Mary-Ann Stephenson, chair of the Equality and Human Rights Commission (EHRC), said \"things could be sorted out if there is goodwill and recognition that everybody has rights\".The guidance, for businesses and services, was drawn up after a unanimous Supreme Court ruling in April that legally a woman should be defined by biological sex for the purposes of the Equality Act 2010.The BBC interview, broadcast on Sunday with Laura Kuenssberg, is Dr Stephenson's first in her new role.The EHRC's guidance was passed to the government three months ago, but it has yet to publish it formally, which would give the code of practice legal force.It aims to provide advice to businesses and services - such as women's refuges, gyms, hospitals or shopping centres - about how the Supreme Court ruling should work.Seen by the BBC after it was leaked, the 300-page document says single-sex spaces should only be open to people of the same biological sex, otherwise they cease to be single-sex areas. That would mean, for instance, that a trans woman – a biological male who identifies as a woman - would not be able to use women's toilets and changing rooms.The guidance says it may be legitimate for businesses or services to ask people to provide confirmation they are of the eligible sex \"by proportionate means\".This has all caused controversy and anger among some transgender campaigners.Dr Stephenson told the BBC: \"Nobody is expecting there to be a toilet police. \"But equally if there are situations where there are complaints about regular problems, then people might need to... improve signage, improve explanations, or make sure they have got alternative provision.\"She said she expected both service providers and people using these services to \"follow the rules\". Dr Stephenson was challenged on what facilities trans people should use if there were no alternatives, or what businesses should do if they did not have the space or resources to make extra provision.She said: \"There's often unisex provision and where there isn't, as I say, we need to think more broadly about how we make sure those that those facilities are available…\"If you've got, you know, two self-contained cubicles, one of which is labelled men and one of which is labelled women, then the most sensible thing in those circumstances for a service provider to do is to make both of those unisex.\"Dr Stephenson was appointed to the role in July and she started earlier this month. It was greeted with hostility by some trans campaigners, in part because she had donated money to the case of lawyer Allison Bailey, who won part of a tribunal claim that she was discriminated against because of her gender-critical views.In our interview, Dr Stephenson was adamant she could still be objective when considering trans issues. She said she donated to the case because she was frustrated by situations where \"women were being harassed and losing their jobs on the basis of lawfully held beliefs\". She said she had been concerned by the experiences of some women \"when trying to have meetings to discuss proposed changes in the law\".\"I thought it was important that actually in a democracy, if there is a proposed change to the law, people should be able to meet and discuss those changes without violence or intimidation,\" she said.  \"If that's taking a side, it's taking a side on the side of kind of democratic norms and open discussion and dialogue.\"The full interview will be on Sunday with Laura Kuenssberg. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Equality boss expects people to 'follow rules' over single-sex spaces",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b22a/live/6941e8e0-d8b6-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-13T19:41:59.000Z",
      "dateModified": "2025-12-13T19:41:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brown University shooting: What we know as police launch huge manhunt",
    "url": "https://www.bbc.com/news/articles/ckg9l1j9wxno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e0f7/live/22331630-d8bc-11f0-b67b-690eb873de1b.jpg",
    "tag": "Trending",
    "date": "2025-12-14T10:08:41.000Z",
    "description": "What we know so far about the Brown University shooting2 hours agoTom McArthurWatch: Police release CCTV of Brown University shooting suspectPolice ar",
    "body": "What we know so far about the Brown University shooting2 hours agoTom McArthurWatch: Police release CCTV of Brown University shooting suspectPolice are searching for a gunman who shot dead two students and injured nine others at Brown University in Providence, Rhode Island.Police say the attacker was a man dressed all in black who fled on foot, and a shelter-in-place warning is in effect for the area surrounding the prestigious university.The attack on the campus brings the number of mass shootings in the US to 389 for this year, according to the independent analysis website Gun Violence Archive.It defines mass shootings as having four or more victims killed or injured, not including the attacker.Here's what we know:What happened?The gunman opened fire in a classroom at around 16:00 local time (21:00) on Saturday at the Holley engineering building at the eastern end of Brown's campus, according to officials.Final exams were taking place in the building at the time of the shooting, the school said.Barus and Holley engineering building is a seven-story block that includes 117 laboratories, dozens of classrooms and three lecture halls.An economics professor told local public media outlet Ocean State Radio that the shooting had taken place during a review session for her course, which was led by her teaching assistant.\"He said that the shooter came in the doors, yelled something - he couldn't remember what he yelled - and started shooting,\" Rachel Friedberg said.\"Students started to scramble to try to get away from the shooter, trying to get lower down in the stadium seating, and people got shot,\" she added.Two students studying in the nearby Rockefeller library when the active gunman alert came through told the BBC they \"stayed away from the windows\" as they awaited police escort.Officers searched the floor, made them drop their bags and raise their hands before before being led out of the library, the pair said.Brown University, one of the one of the oldest higher education institutions in the US, is part of the Ivy League, a group of elite universities in the northeast of the country.The university, which has more than 11,000 students, is located in Providence, Rhode Island's capital city, located about 50 miles (80km) from Boston and 180 miles (290km) from New York City.Who are the victims?Two students were killed, and a further nine people are being treated. Medics say one person is in a critical condition, six are \"critical but stable\", and two others are less severely hurt.The identities of those killed or injured have not yet been released, but Brown University President Christina Paxson told reporters in a press briefing that all the victims, including those killed and wounded, were students.\"This is a day that we hoped never would come to our community. It is deeply devastating for all of us,\" she said in a statement.A ninth victim did not suffer a gunshot wound, according to police, who said they suffered non-life threatening injuries from fragments from the shooting \"that had occurred near them\".Who is the gunman?Very little is known about the gunman so far, but police have released CCTV footage of a male suspect, walking away from the scene of the shooting wearing all black clothing.There is no weapon visible in the video, and his face is covered. Officials also say a firearm was not found in a sweep of the building on Saturday.Investigators do not yet know if the gunman was a student, but Providence Deputy Police Chief Tim O'Hara said the suspect was a male who was dressed all in black and appeared be in his 30s.\"We're utilising every resource possible to find this suspect,\" he said.Some witnesses reportedly told officers he may have been wearing a camouflage grey mask.One person was arrested before police determined they were not involved in the shooting and released them.What is the latest?A massive operation involving police and federal agents is now underway in Providence as around 400 officers try to locate the suspect.Residents and students near to the university have been told to stay at home and stay inside, or to stay away until the shelter-in-place is lifted.Students in the area told the BBC they planned to stay at home until the things calm down and the gunman is caught.US President Donald Trump, speaking to reporters as he returned to the White House from attending the annual Army and Navy football game, described the shooting as \"a terrible thing\".\"All we can do right now is pray for the victims and for those that were very badly hurt,\" he said.Additional reporting by Pratiksha Ghildial",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brown University shooting: What we know as police launch huge manhunt",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e0f7/live/22331630-d8bc-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-14T10:08:41.000Z",
      "dateModified": "2025-12-14T10:08:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "One-eyed flightless parrot Monica gets new adapted home at Hoo Zoo",
    "url": "https://www.bbc.com/news/articles/c3w75391613o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/74d8/live/3bd3aed0-d4f5-11f0-aaaf-55cc3c07b9c9.jpg",
    "tag": "Trending",
    "date": "2025-12-09T12:16:30.000Z",
    "description": "5 days agoChloe HughesWest MidlandsHoo ZooMulch has been put on the floor so that Monica can digA one-eyed flightless African Grey parrot has been giv",
    "body": "5 days agoChloe HughesWest MidlandsHoo ZooMulch has been put on the floor so that Monica can digA one-eyed flightless African Grey parrot has been given a specially-adapted aviary to help her thrive.Monica's new home at Hoo Zoo in Telford was adapted for her after she lost an eye. It has low level perches and a cat flap so she can get in and out and means she can remain with her feathered friends.The bird has been at the zoo for several years but recently lost her eye after becoming ill. She had her wings pinioned by previous owners, meaning she is unable to fly.\"After losing her eye earlier this year she's adapted brilliantly, and we wanted her to have a space that meets her needs while also giving her friends a fantastic new environment to fly and play,\" said zoo owner Will Dorrell.\"She's got some low down perches in there, and she has even got her own little cat flap in and out of the house, so that she can still get in and still get nice and toasty warm when she wants to,\" said keeper Sarah Holt.Hoo Zoo has also put a deep bark mulch on the floor, so that she is able to scratch, dig, and explore naturally.Her food and water are placed at ground level while the other parrots feed from perches in other areas.Hoo ZooMonica, seen perched atop keeper Sarah Holt's shoulder, was formerly a pet before being rehomed at Hoo ZooAs well as suiting her needs, the aviary was also designed to give the flock more space and more opportunities for free flight.\"Monica has been part of our family here for years, and she's an incredible little character,\" Mr Dorrell said.\"She's a real favourite with the team, so this feels like a well-deserved early Christmas gift for her and the rest of the parrots.\"More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "One-eyed flightless parrot Monica gets new adapted home at Hoo Zoo",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/74d8/live/3bd3aed0-d4f5-11f0-aaaf-55cc3c07b9c9.jpg"
      ],
      "datePublished": "2025-12-09T12:16:30.000Z",
      "dateModified": "2025-12-09T12:16:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eyewitness captures moment man tackles and disarms shooter",
    "url": "https://www.bbc.com/news/videos/c62l00q1v88o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/367a/live/fbdf04a0-d8e6-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2025-12-14T11:24:21.000Z",
    "description": "Twelve people have been killed and at least 11 others, including two police officers, injured in a shooting at Bondi Beach on Sunday.Footage captured ",
    "body": "Twelve people have been killed and at least 11 others, including two police officers, injured in a shooting at Bondi Beach on Sunday.Footage captured by an eyewitness shows a man grappling with an alleged gunman, before wrestling the weapon off him.In a press conference, the New South Wales Police Premier Chris Minns said that one of the gunmen had been killed and another was in custody.Follow live here. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eyewitness captures moment man tackles and disarms shooter",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/367a/live/fbdf04a0-d8e6-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-14T11:24:21.000Z",
      "dateModified": "2025-12-14T11:24:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The woman who doodles Xmas scenes on windows in Shropshire",
    "url": "https://www.bbc.com/news/articles/c20gzezr3evo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/43df/live/51199f50-d5a1-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-10T06:02:17.000Z",
    "description": "4 days agoCharlotte Bentonin ShropshireDebbie CarrDebbie Carr took her window painting business full-time in 2018Debbie Carr, also known as Doodle Deb",
    "body": "4 days agoCharlotte Bentonin ShropshireDebbie CarrDebbie Carr took her window painting business full-time in 2018Debbie Carr, also known as Doodle Deb, has been drawing for as long as she can remember.From the moment she could pick up a pen, she was doodling over everything possible - from school textbooks to spare scraps of paper.Fast forward and with a degree in fine art, experience running a face-painting business and doing latte art for nine years, she now makes a living painting characters and scenes on the windows of homes and businesses where she lives in Dudleston Heath, Shropshire.She has just wrapped up her Christmas window paintings for homes and shops in the village. She said she had done about 20 windows with scenes including The Snowman, The Grinch, penguins and elves.\"Usually I say [they take] about four hours but there's been a few that have maybe been six hours,\" she said.\"I work right through, I don't stop and have a break.\"Debbie CarrMs Carr paints mainly on the windows of businesses\"I gave up my job as a barista because of my son's mental health problems, and this is something that just happened... I was already doing chalkboards and portraits.\"She said it gave her the flexibility to be there for her family if needed.\"The people that go past on the street are generally so lovely,\" she told the BBC.\"It inspires so many people, young and old, I get messages from families with young children who send me copies of their doodles, they send me Christmas cards and say: 'Thank you for inspiring our son or daughter'.\"It just spreads a bit of joy all over the town.\"Debbie CarrShe said each display generally took about four hours, and she does not take breaks \"The majority of clients don't have any specific requests which I find is amazing, because I can go wild on lots of them,\" she said.\"I've painted dinosaurs, I've painted leopard print, jungle themes, anything goes.I do get a lot of houses, families requesting, but I'm so busy with businesses I have to prioritise.\"She said doing this for people and seeing their reactions was an honour.\"I cry a lot, I'm a very emotional person, I do put a lot of time and energy into planning my designs usually in the middle of the night.\"More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The woman who doodles Xmas scenes on windows in Shropshire",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/43df/live/51199f50-d5a1-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-10T06:02:17.000Z",
      "dateModified": "2025-12-10T06:02:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "King Charles gives post box to Antarctic research staff",
    "url": "https://www.bbc.com/news/articles/cdrnnze3mepo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9fdc/live/4f6cbe70-d769-11f0-9458-21e2709cd626.jpg",
    "tag": "Trending",
    "date": "2025-12-14T08:56:39.000Z",
    "description": "Red post box sent to Antarctic - on King's orders3 hours agoHelen BurchellCambridgeshire BAS/Martin AllenThe post box will replace a handmade one curr",
    "body": "Red post box sent to Antarctic - on King's orders3 hours agoHelen BurchellCambridgeshire BAS/Martin AllenThe post box will replace a handmade one currently used at the remote stationA shiny new red post box has been given as a gift from King Charles III to staff at a remote Antarctic research station.The Royal Mail lamp post box was sent to staff at the Cambridge-based British Antarctic Survey station at Rothera.The box, featuring the King Charles III cypher, was delivered after Kirsten Shaw, a station support assistant who runs the British Antarctic Territory Post Office for staff, requested an upgrade to their handmade box.\"Being in Antarctica is incredible, but it's full of extremes, so I think it's a special thing to send post back home, to communicate your experiences. It's a moment of your life that you put down on paper and give to someone else,\" she said.King shares personal message on cancer in TV broadcastThe Rothera research station, which opened in 1975, is the largest British Antarctic Survey (BAS) facility, and a renowned global hub for climatic research.It is situated 1,860km (1,155 miles) south of the Falkland Islands.Staff work and live at the station for months at a time. Ms Shaw said: \"Getting post is really special for the team at Rothera. \"If you're doing fieldwork for many months, the feeling of receiving a letter — an actual tangible, piece of paper with handwriting from friends and family — is such a lift. \"It's a wonderful way to connect people that goes beyond what an email or text message can do.\"BAS/Jake MartinKirsten Shaw and Aurelia Reichardt, station leader at Rothera, are pictured with the new post boxThe box will replace the handmade and painted one currently used at the station.The BAS said \"the Royal Household worked with Royal Mail to arrange this particularly special delivery\".It was delivered to Rothera by the UK's polar research vessel RRS Sir David Attenborough, along with the first major drop of supplies to the station following the long Antarctic winter. The post box will be installed in the Discovery Building, a new scientific support and operations hub.BAS/Aurelia ReichardtThe handmade box will now be replaced by the official one from the Royal MailPostal logistics in such a remote area are understandably not straightforward.Ms Shaw's job is to oversee the formal Post Office logistics of getting mail in and out of Antarctica from Rothera, as well as getting post out to staff to other BAS stations and science field camps.Post has to be gathered and put on board the RRS Sir David Attenborough or on BAS aircraft to the Falkland Islands, where BAS maintains an office in Stanley.The final leg involves transport to RAF Brize Norton in Oxfordshire, where letters enter the Royal Mail postal network for onward delivery.BAS/Jake MartinThe box will be placed in a new building at the stationJane Rumble, HM Commissioner for the British Antarctic Territory said: \"Maintaining a postal service in the British Antarctic Territory is far more than a symbolic gesture. \"It reinforces Britain's presence and heritage in Antarctica and provides a vital link to the wider world.\"More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "King Charles gives post box to Antarctic research staff",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9fdc/live/4f6cbe70-d769-11f0-9458-21e2709cd626.jpg"
      ],
      "datePublished": "2025-12-14T08:56:39.000Z",
      "dateModified": "2025-12-14T08:56:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Never give up': Belarusian prisoners celebrate release after US lifts sanctions",
    "url": "https://www.bbc.com/news/articles/cvg1r89m6g7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b968/live/90df80e0-d8cc-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2025-12-14T08:04:53.000Z",
    "description": "4 hours agoSarah RainsfordSouthern and Eastern Europe correspondent, Vilnius, LithuaniaWatch: BBC captures celebrations as Belarus frees political pri",
    "body": "4 hours agoSarah RainsfordSouthern and Eastern Europe correspondent, Vilnius, LithuaniaWatch: BBC captures celebrations as Belarus frees political prisonersRumours of a major prisoner release from Belarus had been swirling for a couple of days.But no one would reveal the names on the list, or the exact number, until everyone was safely out, finally free.In total,123 political prisoners have been released, including some of the best-known names among Belarusian opposition politicians, human rights activists and journalists.Maria Kolesnikova, the protest leader with a famous red-lipsticked smile, was on the release list.A video of her jumping for joy and hugging other former prisoners, overjoyed to be reunited, was soon flying around social media. Then came another, on a bus out of Belarus, where she thanked everyone who'd helped bring this moment about.\"It's a feeling of incredible happiness to see those who are dear to me, to hug them and realise we are all free,\" Masha, as she's best known, told the camera, her lips already painted red again.The first sunset of her freedom was a thing of great beauty, she said.\"But I also think of those who are not yet free and I await the moment when we can all embrace, when all are free.\"ReutersMaria Kolesnikova (centre) was among more than 100 prisoners handed over to UkraineOut too is Viktor Babaryka, a banker who tried to run for president in 2020 but was locked up before the elections even began.The Nobel Peace prize winner Ales Bialiatski has also been released from a 10-year sentence.All were imprisoned for their opposition to the authoritarian rule of Alexander Lukashenko, whose security forces crushed the mass protests of 2020 with brutal force. They were the biggest challenge to his rule that he has ever faced. The prisoners' release now is the result of long and complex negotiations led by the US that culminated in a two-day visit to Minsk this week by Donald Trump's new special envoy, John Coale.For Lukashenko, that engagement itself is a win: after years as a political pariah in the West he is clearly happy to be back on talking terms with the US.But he also got US sanctions dropped on a key export for his country, potash, as a further, more tangible reward. EU penalties - and tougher policies - are still in place.It's not entirely clear what Trump has to gain from this. But Belarus is a close ally of Russia, including in its war on Ukraine, and the move comes as the US has been re-engaging with Moscow too, seeking a peace deal.EPA/ShutterstockNobel Peace Prize winner Ales Bialiatski was one of the prisoners releasedThe dozens of prisoners Lukashenko agreed to let go were always expected to come here to Vilnius, Lithuania, where a crowd of friends, relatives and fellow activists gathered outside the US embassy in the freezing cold to greet them.Some came wrapped in the red and white opposition flag of Belarus.Tatsiana Khomich, Masha Kolesnikova's sister who had campaigned for over five years for her release, couldn't stop smiling. \"I've just spoken to Masha,\" she told me after a video call.A professional flautist before the disputed 2020 elections, Kolesnikova spent much of her sentence in solitary confinement, denied even letters and phone calls to her family.\"She's fine, she's good. I just want to hug her. I still can't quite believe it,\" her sister said.Suddenly, there was a commotion in the crowd: a police car, blue lights flashing, was heading towards the US embassy gates, leading a small convoy of other vehicles.But there was no way all 123 ex-prisoners were inside. Instead, we learned, just seven foreign nationals had been brought to Lithuania and only Ales Bialiatski of the Belarusians.'Optimism and activism'The others, including Kolesnikova, had been taken out of Belarus to Ukraine: from prison, into a war zone.Staying in their own country is not usually an option on offer.\"Lukashenko's idea, who else?\" was how one of opposition leader Svetlana Tikhanovskaya's team interpreted the surprise diversion to Ukraine. It seems he'd decided to play one final power game, so the family reunions, so long awaited, would be delayed.But what of the price paid for that moment? Tikhanovskaya is a friend and political ally of Masha Kolesnikova, but she always calls for maximum pressure on Lukashenko by the West.So has the US gone too far, I wondered.\"This is a process of negotiation. Of course, it would be good for us if nothing is given to Lukashenko, because all those people are hostages of his regime. They are innocent.\"But this is how negotiation goes,\" she replied, before noting that sanctions can always be reapplied if necessary.\"President Trump now uses carrots. He also can use sticks.\"A few steps away, a man waving a giant flag worried that Lukashenko would just take more prisoners. This is not a sign of sudden humanity, he said.After a short time inside the US embassy, Ales Bialiatski emerged onto the street to ecstatic cheers from the crowd.Gaunt, head shaven and still in his padded blue prison jacket, he admitted his head was spinning from all the sensations after four years in jail.\"I was driven across Belarus in a blindfold, from east to west, so I still can't get my head round it. This is so emotional,\" he shared, describing being woken at 04:00 and told by his prison guard to pack.When I asked what he wanted now most of all he didn't hesitate: \"I want to see my wife!\"She's on her way, I was told.Bialiatski's own organisation, Viasna, monitors political detentions in Belarus and the activist reminded everyone that many hundreds of people like him - only less well known - have been left behind bars.\"It is very important for everyone to continue to work for those political prisoners who are still in Belarusian prisons, to strive for the complete release of all of them.\"Then, lifting the red and white flag from his shoulders, he had a message for Belarusians everywhere.\"Optimism and activism,\" Ales Bialiatski told them, with a sudden smile. \"Never give up!\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Never give up': Belarusian prisoners celebrate release after US lifts sanctions",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b968/live/90df80e0-d8cc-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-14T08:04:53.000Z",
      "dateModified": "2025-12-14T08:04:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dopamine decor: Why people are getting a happiness hit from homes",
    "url": "https://www.bbc.com/news/articles/ckg2j5l4q7wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1ea2/live/758fc0f0-d81a-11f0-aae2-2191c0e48a3b.png",
    "tag": "Trending",
    "date": "2025-12-14T01:08:26.000Z",
    "description": "From bland to bold - how these women are ditching beige to spark joy11 hours agoAlice CullinaneWest MidlandsRachel VerneyRachel Verney started renovat",
    "body": "From bland to bold - how these women are ditching beige to spark joy11 hours agoAlice CullinaneWest MidlandsRachel VerneyRachel Verney started renovating her home with colour during the pandemic in 2020While some get a boost of happiness by exercising and getting enough sleep, others are turning to interior design with bold paint and eye-catching patterns.It is a craze known as \"dopamine decor\", which has more than 70,000 posts on TikTok, and involves adding bright, quirky items to your home for a happiness boost.Rachel Verney shares decor inspiration videos of her colourful Surrey home to more than 800,000 followers on social media and she saw her popularity boom when she bought a bright orange sofa.Known as The Shoestring Home, millions watch her renovation videos as she aims to make \"aesthetic accessible\" and help people create colourful spaces on a budget. \"It's my happy place when I work on a project,\" she said. \"Sometimes I feel like an imposter as I'm not qualified to do the job.\"On Facebook, she has experienced \"division\" over her interiors as some find the  designs too bold. But while she might not have a degree in interior design, her ideas have been a hit with younger viewers and she has made content creation her full-time job over the past year. \"Everything is so gloomy and the world is a bit of a scary place at the moment - houses want to be joyful,\" she said.Rachel VerneyPatterned bedding and framed graphics can boost the colour in bedroomsDopamine is a neurotransmitter that plays a crucial role in our brain's reward and pleasure systems. Often referred to as the \"feel-good\" hormone, it influences mood, motivation, and attention. Psychologist Dr Natasha Sharma said vivid colours produced small dopamine hits, which, in uncertain times, provided a sense of optimism and reward.She said dopamine decor allowed people to \"externalise\" their identity and boost their mood, giving a \"heightened sense of wellbeing\".Dr Sharma, from Wolverhampton, added that a home dominated by grey or neutral tones could result in \"feelings of emotional flatness\".Alice Cullinane/BBCNicola Brighton sells bold mirrors and wall prints to decor loversNicola Brighton is among those making a living from the trend, creating kitsch prints and neon mirrors in unique shapes which are stocked in stores across the UK and US. Since 2022, her business Printed Weird, which is based in Birmingham, has grown 62% and her designs frequently sell out as customers look for nostalgia to add to their homes.\"When you come home from work and you've had a rubbish day, you can just look at things that bring you joy and happiness,\" Nicola said.She started her business from her mum's spare bedroom seven years ago, fuelled by a love for colourful decor and a mission to put affordable items on the market.\"Through what you love, why not put that silliness on your wall? It's an extension of your personality and will bring you joy,\" she said.Rachel VerneyBrightly coloured rooms are believed to activate \"neural pathways\" linked to reward and vitality But while Google searches for dopamine decor have risen more than 110% in the past year, estate agents warned the trend could put off potential buyers.Paul Fox Estate Agents, based in Lincolnshire, recommended a neutral colour scheme over bold hues, adding \"timeless\" shades helped sell homes quickly.\"First impressions are everything, so by ensuring that the home is painted in popular colours you are likely to attract buyers,\" the agent said.Alice Cullinane/BBCJodie Edmonds moved into her first house in July and has filled it with bright coloursDespite the agent's advice, new homeowners like Jodie Edmonds have decided to add personality to their walls.\"I'm not bothered when it comes to reselling, people have different tastes and can change the decor,\" she said.For Jodie, a colourful scheme is a way to express herself and make guests feel happier.\"A grey house would make me feel low, a bright house makes me feel motivated and inspired,\" she said.How to add dopamine decor to your home without breaking the bankRachel Verney recommends you introduce colours you love into your decor by starting with items like cushions and rugs, and not being afraid to mix colours and patterns Simple touches to practical items go a long way - vinyl wrap your fridge in an exciting pattern, paint your appliances and radiators any colour of the rainbow or add a fun printed shower curtain and quirky bathmat to a boring bathroomGet crafty to create affordable dupes of your favourite brands, like adding bows to cushion covers or updating candlesticksShop second hand and upcycle pieces from charity shops and Facebook Marketplace to save money and items from landfill Add plants to shelves, mantlepieces and uninspired corners to boost your mood. If your fingers are not green, consider botanical prints on wallpapers, rugs or bedding to bring warmth and tranquillity to your homeMore on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dopamine decor: Why people are getting a happiness hit from homes",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1ea2/live/758fc0f0-d81a-11f0-aae2-2191c0e48a3b.png"
      ],
      "datePublished": "2025-12-14T01:08:26.000Z",
      "dateModified": "2025-12-14T01:08:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]