[
  {
    "title": "NFL play-off preview: Why road to Super Bowl is 'most unusual' in years",
    "url": "https://www.bbc.com/sport/american-football/articles/c2e1gk03k84o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e5f/live/a0162070-eb49-11f0-a422-4ba8a094a8fa.png",
    "tag": "Trending",
    "date": "2026-01-07T09:00:00.000Z",
    "description": "Why the NFL play-offs are the 'most unusual' in yearsImage source, Getty ImagesImage caption, New England's Drake Maye (left) and Chicago's Caleb Will",
    "body": "Why the NFL play-offs are the 'most unusual' in yearsImage source, Getty ImagesImage caption, New England's Drake Maye (left) and Chicago's Caleb Williams were top-three draft picks in 2024ByBen CollinsBBC Sport journalistA dynasty has fallen, big names have faltered and also-rans have become Super Bowl contenders.Even veteran NBC analyst Cris Collinsworth has said \"this is the most unusual year I can remember in the NFL\".Now 14 teams are set to battle it out in the play-offs, and for the first time in 11 years, the Kansas City Chiefs are not among them.Defending champions Philadelphia have not been as dominant as last season while pre-season favourites Buffalo have not lived up to that billing.But for just the second time in 35 years, 11 of the 14 play-off teams gained at least 11 wins in the regular season.A record five teams have qualified after at least 11 defeats the previous season, with two of them going from worst to first in their division - New England and Chicago - so good luck picking the winner for Super Bowl 60.\"If you ask me to pick a favourite, I don't know, because you can put something on all of them,\" Collinsworth added.\"It's going to be amazing to watch these young quarterbacks go at it because I don't know what they will do. This is when legends begin to be built.\"How do the NFL play-offs work?The NFL play-offs feature 14 teams - seven each from the American Football Conference (AFC) and National Football Conference (NFC).Each conference is kept apart during 12 knockout games over three weeks that will decide which team represents their conference at Super Bowl 60 on 8 February.The highest remaining seeds in each round have home-field advantage, with top seeds Denver and Seattle getting a bye for week one, known as Wildcard Weekend.They will enter the fray during the Divisional Round, then the winners of the Conference Championships - effectively the Super Bowl semi-finals - will meet in the title decider at Levi's Stadium in Santa Clara, home of the San Francisco 49ers.Seattle and Denver could set up a repeat of the 2014 Super Bowl, which the Seahawks won comfortably, although the Broncos regrouped to beat Carolina in 2016 - the last Super Bowl to be played at Levi's Stadium.This season's play-off seedingsWhy the AFC Championship is wide openAfter reaching five of the past six Super Bowls, Kansas City's Patrick Mahomes is not in the play-offs for the first time in his career.But the three-time champion isn't the only star quarterback missing. This year's Super Bowl will be the first since 2019 not to feature Mahomes or Joe Burrow (Cincinnati).Either Mahomes or Lamar Jackson (Baltimore) have been the NFL's Most Valuable Player in four of the past seven seasons, but the Chiefs, Bengals and Ravens have all failed to reach the post-season.That has left the race for the AFC Championship wide open, and the path clear for new stars such as Denver's Bo Nix and New England's Drake Maye to be immortalised with play-off glory.Since 2016, only Kansas City, Cincinnati and New England have won the AFC Championship - and none of the Patriots players remain from their last Super Bowl win in 2019.Top seed Denver have only played one play-off game since 2016, and besides the Broncos and Patriots, Pittsburgh are the only other AFC play-off team to have reached the Super Bowl since 1995.There are two AFC quarterbacks still standing who have plenty of pedigree, though, so could Aaron Rodgers (Pittsburgh) and Josh Allen (Buffalo) make their experience count against the young guns?Who are the Super Bowl and MVP favourites?There is more play-off pedigree in the NFC, with the Philadelphia Eagles, Los Angeles Rams or San Francisco 49ers having reached seven of the past eight Super Bowls.And the Rams and 49ers feel as if they've already been playing play-off football for weeks, having battled it out with Seattle to win the NFL's toughest division, the NFC West.The Seahawks beat both in their last three games to prevail with a 14-3 record and go into the post-season on a seven-game win streak.That also secured the NFC's top seed - and Seattle are now marginal Super Bowl favourites, ahead of the 12-5 Rams, whose quarterback Matthew Stafford is the MVP favourite.The 37-year-old, who capped his first season with the Rams by winning the 2022 Super Bowl, has yet to win the award but is rated just ahead of Drake Maye, New England's second-year quarterback.Maye, 23, has blossomed under new head coach Mike Vrabel, with the former Patriots player helping them flip their record from 4-13 last season to 14-3.Caleb Williams is another second-year quarterback who has blossomed under a new head coach, with Chicago's Ben Johnson helping the Bears improve from 5-12 to 11-6 to claim the NFC's second seed.NFL play-offs: 2025 season10 January - 8 February 2026Live text commentary on all play-off games on the BBC Sport website and app, plus live radio commentary on selected games on BBC Radio 5 Sports Extra and BBC Sounds. The Whole 10 Yards, BBC Sport's weekly NFL programme, will also follow the road to Super Bowl 60Schedule for Wildcard WeekendAll times GMTSaturday, 10 JanuaryLos Angeles Rams @ Carolina Panthers (21:30)Green Bay Packers @ Chicago Bears (01:00 Sun)Sunday, 11 JanuaryBuffalo Bills @ Jacksonville Jaguars (18:00)San Francisco 49ers @ Philadelphia Eagles (21:30)Los Angeles Chargers @ New England Patriots (01:00 Mon)Monday, 12 JanuaryHouston Texans @ Pittsburgh Steelers (01:00 Tue)Bills hit road to face in-form JagsMedia caption, Are the Jacksonville Jaguars are a legitimate Super Bowl contender?The Rams kick off Wildcard Weekend at Carolina, who became the seventh team ever to make the play-offs with a losing record (8-9) having stumbled to the NFC South title.LA must hit the road but Stafford led the league for passing yards and touchdown passes while Puka Nacua posted a career-high 1,715 receiving yards. The Rams also hope to have fellow receiver Davante Adams back from injury.A host of injuries late in the season, most notably to Micah Parsons, has halted Green Bay's momentum but they will have quarterback Jordan Love (concussion) back for just the third play-off clash in the NFL's oldest and most-played rivalry.Although Chicago surpassed pre-season expectations by winning the NFC North, the pressure is on to avoid going out of the play-offs with what would be a third straight defeat.The NFC's other wildcard match-up sees injury-hit San Francisco visit defending champions Philadelphia, who rested most of their starters last Sunday after recovering from a wobble to clinch the NFC East.After being dumped out by Kansas City in four of the past five years, Buffalo's reigning MVP Josh Allen hopes to finally reach the Super Bowl, but the Bills must hit the road after New England ended their recent dominance of the AFC East.And they must visit a Jacksonville team on an eight-game win streak, with Trevor Lawrence looking like the 'generational talent' he was billed as when the Jaguars made him the number one draft pick in 2021.The Patriots aim to avoid an upset at home to the Los Angeles Chargers, whose quarterback Justin Herbert hopes to claim his first play-off win in his sixth year in the NFL.Houston's league-leading defence is sure to put four-time MVP Aaron Rodgers under pressure but the 42-year-old, who could retire at the end of the season, can target DK Metcalf again as Pittsburgh's top receiver returns from suspension for Monday's game.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NFL play-off preview: Why road to Super Bowl is 'most unusual' in years",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e5f/live/a0162070-eb49-11f0-a422-4ba8a094a8fa.png"
      ],
      "datePublished": "2026-01-07T09:00:00.000Z",
      "dateModified": "2026-01-07T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Radical with Amol Rajan - Can Donald Trump Be Compared To Julius Caesar? (Your Radical Questions with Tom Holland) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mpbrwl?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mpd8bx.jpg",
    "tag": "Trending",
    "date": "2026-01-05T06:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·05 Jan 2026,·21 minsAvailable for over a yearHistorian and The Rest Is History co-host Tom Holland answers your questions about whether Britain is currently in a more precarious state than it was in the 1970s, what definition of ‘radical’ best describes him and if he will ever score a century playing cricket.\nHe also explains why American presidents are often compared to Julius Caesar and faces a question he’s never heard before.\nGET IN TOUCH\n* WhatsApp: 0330 123 9480\n* Email: radical@bbc.co.uk\nEpisodes of Radical with Amol Rajan are released every Thursday and you can also watch them on BBC iPlayer: https://www.bbc.co.uk/iplayer/episodes/m002f1d0/radical-with-amol-rajan\nAmol Rajan is a presenter of the Today programme on BBC Radio 4. He is also the host of University Challenge on BBC One. Before that, Amol was media editor at the BBC and editor at The Independent.\nRadical with Amol Rajan is a Today Podcast. It was made by Lewis Vickers with Anna Budd. Digital production was by Gabriel Purcell-Davis and Joe Wilkinson. Technical production was by Mike Regaard. The editor is Sam Bonham. The executive producer is Owenna Griffiths.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radical with Amol Rajan - Can Donald Trump Be Compared To Julius Caesar? (Your Radical Questions with Tom Holland) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mpd8bx.jpg"
      ],
      "datePublished": "2026-01-05T06:00:00.000Z",
      "dateModified": "2026-01-05T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - UK Troops In Ukraine…But Only Under A Peace Deal - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0msg62t?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-06T21:26:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·06 Jan 2026,·39 minsUK Troops In Ukraine…But Only Under A Peace DealNewscastAvailable for over a yearToday, Adam and Chris discuss the latest agreement between the Coalition of the Willing and the US to provide security guarantees for Ukraine as part of ongoing efforts to secure a ceasefire with Russia.\nThe talks in Paris saw the UK and France agree to put troops on the ground \"in the event of a peace deal\".\nPlus we look at why President Trump has his sights set on Greenland and whether he really might annex the island.\nAdam is joined by the Economist’s defence editor Shashank Joshi and Dr Gabriella Gricius, senior fellow at the Arctic Institute to discuss the strategic importance of Greenland to security in the Arctic. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Shiler Mahmoudi. The social producers were Joe Wilkinson and Beth Pritchard. The technical producer was Ben Andrews. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - UK Troops In Ukraine…But Only Under A Peace Deal - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-06T21:26:00.000Z",
      "dateModified": "2026-01-06T21:26:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Capybaras 'stolen' from farm in Forres",
    "url": "https://www.bbc.com/news/articles/c87rdr3n379o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c036/live/1db4de50-ebc6-11f0-88a4-f1fbc524c6d9.jpg",
    "tag": "Trending",
    "date": "2026-01-07T16:31:09.000Z",
    "description": "4 hours agoGeorge Gunn/Gunn PhotographyThe farm acquired the animals in MarchA farm in Moray believes its pair of capybaras have been stolen.Thorabell",
    "body": "4 hours agoGeorge Gunn/Gunn PhotographyThe farm acquired the animals in MarchA farm in Moray believes its pair of capybaras have been stolen.Thorabella Farm, near Forres, said the animals - the world's largest rodents and native to South America - vanished from their heated enclosure on Tuesday.It has been snowing in the area and the farm said there were no tracks on the ground to suggest the capybaras - called Javier and Esmerelda - had escaped and run off.Owner Nikki Lake said it was an \"incredibly distressing\" incident and police were doing all they could to help.Searches have been made of the local area for the animals, which the farm acquired in March.On Tuesday night, the owners were assisted by a friend using a thermal camera in an effort to detect the capybaras in the darkness.Mrs Lake said the animals needed heat and a special diet.She told BBC Reporting Scotland, News at Seven: \"If they have been taken I just hope they are being properly cared for.\"The capybaras are 10 months old and still not fully grown.Mrs Lake said the farm, which is open to the public, had been on a waiting list for 18 months to get the animals and there were not many others in the UK.She said thorough searches were made of the enclosure, which is surrounded by 6ft (2m)  high fences.\"We were digging through the snow and my husband was in their pond, which is crazy because it was covered in ice and freezing,\" she said.\"We're devastated.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Capybaras 'stolen' from farm in Forres",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c036/live/1db4de50-ebc6-11f0-88a4-f1fbc524c6d9.jpg"
      ],
      "datePublished": "2026-01-07T16:31:09.000Z",
      "dateModified": "2026-01-07T16:31:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Murderer and fellow inmate who absconded from HMP Leyhill caught",
    "url": "https://www.bbc.com/news/articles/ce9yg59y5r0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f3d9/live/d11a9130-e8d6-11f0-b67b-690eb873de1b.png",
    "tag": "Trending",
    "date": "2026-01-07T15:50:36.000Z",
    "description": "A convicted murderer and another inmate who absconded from an open prison on New Year's Day have been arrested, police say.Matthew Armstrong, 35, who ",
    "body": "A convicted murderer and another inmate who absconded from an open prison on New Year's Day have been arrested, police say.Matthew Armstrong, 35, who was jailed for life for murder in 2009, and Daniel Washbourne, 40, who has previous convictions for violence, both failed to return to HMP Leyhill in South Gloucestershire.Armstrong was found near Henley-in-Arden railway station, Warwickshire, at 12:00 GMT, following a sighting from a member of the public. Washbourne was located in Bristol city centre at 13:30. Both were arrested on suspicion of escaping lawful custody.Armstrong was also arrested on suspicion of robbery, after an incident in a village near Leyhill the night before he absconded.A man had forced his way into a home on 31 December at about 18:45 GMT and threatened the occupants before stealing a mobile phone and a quantity of cash, Avon and Somerset Police said.Following the incident, officers interviewed the victims and neighbours, which led to Armstrong being arrested in relation to the offence.A third man accused of absconding from HMP Leyhill at the same time was arrested in Bristol on 3 January. He will next appear at Bristol Crown Court in February.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Murderer and fellow inmate who absconded from HMP Leyhill caught",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f3d9/live/d11a9130-e8d6-11f0-b67b-690eb873de1b.png"
      ],
      "datePublished": "2026-01-07T15:50:36.000Z",
      "dateModified": "2026-01-07T15:50:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK forces helped US seizure of tanker, says MoD",
    "url": "https://www.bbc.com/news/articles/ckglnprzk72o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d2f7/live/616fcb40-ebe5-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-07T17:28:07.000Z",
    "description": "British armed forces supported the US seizure of a Russian-flagged oil tanker in the North Atlantic on Wednesday, the Ministry of Defence has said.The",
    "body": "British armed forces supported the US seizure of a Russian-flagged oil tanker in the North Atlantic on Wednesday, the Ministry of Defence has said.The Marinera, a Venezuelan-linked tanker previously known as the Bella 1,  was stopped by the US Coast Guard, as it travelled northwards through waters between Iceland and Scotland.The MoD said RAF surveillance aircraft and a naval support vessel, the RFA Tideforce, were among the UK military assets that took part in the operation, following a US request for assistance.Defence Secretary John Healey said the action was \"in full compliance with international law\",  and \"formed part of global efforts to crack down on sanctions- busting\".Healey said: \"The depth of our defence relationship with the US is an essential part of our security, and today's seamlessly executed operation shows just how well this works in practice.\"The seizure of the Marinera came as the US said it had seized the Sophia, another tanker with connections to Venezuela, in the Caribbean - and days after a military operation in Caracas to remove President Nicolás Maduro from power.In a statement, the MoD said the Marinera was assessed to have been involved in illegal activity linked to Lebanon-based militant group Hezbollah.It said: \"The ship, initially flying a false flag, turned off its transponders while at sea and sought to reflag while being pursued.\"Healey said the Marinera was \"part of a Russian-Iranian axis of sanctions evasion which is fuelling terrorism, conflict, and misery from the Middle East to Ukraine\". Speaking on BBC Radio 5 Live, Transport Secretary Heidi Alexander said the tanker had \"a pretty nefarious history\" and the UK \"provided enabling support to the United States\".She said: \"We understand that the vessel in question had been sanctioned by the US when it sought to evade a blockade near Venezuela in December and the sanctions that the US had applied to this vessel were part of their counter-Iran sanctions regime.\"So really this vessel is part of what is known as the shadow fleet.\"Moscow says the Marinera was only temporarily flagged as a Russia vessel, and that \"no state has the right to use force against vessels properly registered in other countries' jurisdictions\". It also demanded the US ensure \"humane and proper treatment\" of Russian citizens on board.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK forces helped US seizure of tanker, says MoD",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d2f7/live/616fcb40-ebe5-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-07T17:28:07.000Z",
      "dateModified": "2026-01-07T17:28:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Prince Harry not planning to meet King on next trip to the UK",
    "url": "https://www.bbc.com/news/articles/c5y5e7l5250o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/18cf/live/cab894c0-ebf3-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-07T16:43:28.000Z",
    "description": "4 hours agoSean CoughlanRoyal correspondentThe Duke of Sussex is not expected to meet his father King Charles on his next trip to the UK, when he come",
    "body": "4 hours agoSean CoughlanRoyal correspondentThe Duke of Sussex is not expected to meet his father King Charles on his next trip to the UK, when he comes to give evidence in a court case against the publisher of the Daily Mail.It is expected that the King will keep his distance during such a court case, which, unless it is settled beforehand, is due to start later in January.On his previous trip to the UK last September,  Prince Harry had a private meeting with his father in London that was seen as a symbolic step towards improving family relationships.It followed a BBC interview with Prince Harry in which he talked of the importance of \"reconciliation\" with his family.There still seems to be uncertainty about the court timetable, but later in January a civil case will be brought by Prince Harry and others claiming that Associated Newspapers' publications gathered information by unlawful means.Among the other plaintiffs are Sir Elton John, Liz Hurley and Baroness Doreen Lawrence, mother of the murder victim Stephen Lawrence.Associated Newspapers Ltd has strongly denied the \"preposterous allegations\".But the court case could see Prince Harry giving evidence and facing questions about his claims about how information was obtained for stories written about him.During a visit for a previous court case in 2023 against Mirror newspapers, Prince Harry did not meet his father.A separate claim against News Group Newspapers was dramatically settled in January 2025, with an out of court settlement reached just as the case was getting under way, with the newspaper group apologising and paying damages.Since then Prince Harry and King Charles had their first face-to-face meeting in 19 months, when they had tea together at Clarence House in London in September 2025, during a week of engagements for Harry in the UK.The meeting appeared to be a sign of warming relationships and followed Prince Harry saying in a BBC interview: \"I would love reconciliation with my family. There's no point continuing to fight any more, life is precious.\"But as the Telegraph first reported, it is not expected that there will be a meeting on this latest visit.There could be a smoother path to future visits though, with a review taking place of Prince Harry's police protection when he is in the UK.Harry has cited his security worries as a major barrier to visiting the UK, and why he is reluctant to bring his children, and an upgrading of his security could make that less of an issue.However no decision on his security has yet been confirmed.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Prince Harry not planning to meet King on next trip to the UK",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/18cf/live/cab894c0-ebf3-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-07T16:43:28.000Z",
      "dateModified": "2026-01-07T16:43:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US will control Venezuela oil sales 'indefinitely', official says ",
    "url": "https://www.bbc.com/news/articles/ckgn7p7g79wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9abf/live/f05eabe0-ebf0-11f0-8608-ef259671aea9.jpg",
    "tag": "Trending",
    "date": "2026-01-07T18:10:42.000Z",
    "description": "2 hours agoNatalie ShermanBusiness reporterBloomberg via Getty ImagesA oil pumpjack on Lake Maracaibo in Cabimas, Zulia state, VenezuelaThe US will co",
    "body": "2 hours agoNatalie ShermanBusiness reporterBloomberg via Getty ImagesA oil pumpjack on Lake Maracaibo in Cabimas, Zulia state, VenezuelaThe US will control sales of sanctioned Venezuelan oil \"indefinitely\" as it prepares to roll back restrictions on the country's crude in global markets, the White House said.Officials said sales were expected to start with 30 million to 50 million barrels of oil and the revenue would be controlled by the US government in order to maintain leverage over the Venezuelan government.\"We're going to let the oil flow,\" Energy Secretary Chris Wright said at a conference with energy executives in Miami.It's not clear what portion of the revenues from the sale - which analysts expect to raise about $2.8bn (£2.1bn) - would be shared with Venezuela.\"We need to have that leverage and control of those oil sales to drive the changes that simply must happen in Venezuela,\" Wright said, while adding that some of the money would then \"flow back into Venezuela\". White House officials said on Wednesday that they had already taken steps to start marketing the oil and the administration was working with key banks and commodity firms to execute the sales. As part of the plan, the US is preparing to \"selectively\" roll back American sanctions, which have restricted sales of Venezuelan crude for decades.The comments offered more insight into plans US President Donald Trump announced on social media on Tuesday. He said that Venezuela would be \"turning over\" up to 50 million barrels of oil to the US, and it would be sold at its market price. The money is set to be deposited into US controlled accounts, which Trump said he as president would control and use to benefit the people of Venezuela and the US.US Secretary of State Marco Rubio said the aim was to disburse the money \"in a way that benefits the Venezuelan people - not corruption, not the regime - so we have a lot of leverage to move on the stabilisation front\".Analysts said the impact of the change in policy would depend on details, like the pace of the sales. But the plan drew swift criticism from Democrats, with Senator Chris Murphy of Connecticut calling it \"insane\". \"They are talking about stealing the Venezuelan oil at gunpoint for a period of time undefined as leverage to micromanage the country,\" he told reporters. \"The scope and insanity of that plan is absolutely stunning.\"Venezuela has some of the world's largest proven oil reserves, but years of disinvestment, mismanagement and US sanctions have left it with output of only about a million barrels per day - less than 1% of global production. That supply, which provided critical resources to the Venezuelan government, in recent years has been going primarily to China. But that too has been disrupted in recent months after the US ramped up strikes and a blockade of Venezuelan tankers as part of its pressure campaign against Maduro. On Wednesday, Beijing's foreign minister condemned the US seizure of Maduro and US plans to exert control over Venezuela's oil resources. Trump is due to meet with oil executives at the White House on Friday. Analysts said that in the short term, US oil firm Chevron and US oil refineries, which are set up to process the kind of \"heavy\" crude that is characteristic of Venezuela's output, are well placed to benefit from increased flow of oil from Venezuela.Chevron is the last major US oil firm operating in Venezuela, though some other European firms have outposts there. The redirection of Venezuelan oil to the US could put pressure on Mexico and Canada, which produce similar crude and are currently the main sellers to US refineries.Oil prices, which are already relatively low amid steady supply and muted demand expectations, slipped further over the last week on the prospect that Venezuela might have increased access to the global market. But analysts have warned that meaningful expansion of the country's output will take years and billions of dollars in investment, which firms may be hesitant to undertake, given less risky opportunities in the US and in other countries such as Guyana. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US will control Venezuela oil sales 'indefinitely', official says ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9abf/live/f05eabe0-ebf0-11f0-8608-ef259671aea9.jpg"
      ],
      "datePublished": "2026-01-07T18:10:42.000Z",
      "dateModified": "2026-01-07T18:10:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MPs would vote on using troops in Ukraine, Keir Starmer says",
    "url": "https://www.bbc.com/news/articles/ckgln3lgl3jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cb9b/live/1815a4a0-ebcd-11f0-98c0-b72e1e8ed823.png",
    "tag": "Trending",
    "date": "2026-01-07T19:11:49.000Z",
    "description": "1 hour agoPaul SeddonPolitical reporter Sir Keir Starmer has pledged that MPs would get a vote on the deployment of British soldiers to police any agr",
    "body": "1 hour agoPaul SeddonPolitical reporter Sir Keir Starmer has pledged that MPs would get a vote on the deployment of British soldiers to police any agreement to end the conflict in Ukraine.The prime minister said the move would be consistent with \"recent practice\" on approving military action in Parliament.It comes after the UK and France reiterated their commitment to deploy troops to deter Russia from attacking Ukraine again if a deal to end the conflict is struck.Sir Keir has not specified how many British troops could be committed, telling MPs it would be \"in accordance with our military plans\".During Prime Minister's Questions, Sir Keir told MPs that in the event of a peace agreement, British personnel would conduct \"deterrence operations\" and protect  new military \"hubs\" allies are planning in Ukraine.The prime minister did not specify whether a vote would take place before troops are sent, but his press secretary later told reporters that Parliament would have a say ahead of any \"long-term deployment\" of UK forces.However, the press secretary would not comment on whether the Commons vote would tie the government's hands should MPs reject the government's proposals.Parliament does not have a legal role in approving military action, which is formally authorised by the prime minister on behalf of the monarch.In recent decades a convention has developed that MPs should have the chance to debate deployments, although the principle has been applied inconsistently.In 2013, MPs voted against possible UK military action against Syria to deter the use of chemical weapons, with David Cameron becoming the first British leader to lose a vote on military action since the late 18th Century.They were also given a say on action against the Islamic State group (IS) in Iraq in 2014, and in Syria the following year.However, Theresa May took action in Syria in 2018 without consulting MPs, whilst more recently Rishi Sunak and Sir Keir have authorised RAF air strikes against Houthi targets in Yemen without doing so. On Tuesday, the UK and France signed a \"declaration of intent\" on deploying troops in Ukraine in the air, on land and at sea after a summit in Paris.The statement added that Ukraine would authorise the UK, France and other allies to use \"necessary means, including the use of force\" within its territory.Allies also proposed that the US would take the lead in monitoring a truce.However, full security guarantees have not been agreed and the US, which has been leading efforts to end the war, reportedly did not sign such a pledge at the talks.Chairman of the Commons Defence Committee, Tan Dhesi, welcomed the announcement but warned \"it intensifies the very real challenges our armed forces are already facing\".\"It also runs the risk of overstretching our armed forces and so calls into question the UK's ability to sustain pre-existing commitments to our allies,\" the Labour MP added.It comes after nine months of planning talks by a group of countries, dubbed the Coalition of the Willing, over security guarantees to be offered to Ukraine in the event of a deal, alongside separate talks over ending the war itself.Sir Keir said a deal to end the war \"will not happen\" without such guarantees in place, \"backed by the United States\". Moscow has repeatedly warned that any foreign troops in Ukraine would be a \"legitimate target\".Russian President Vladimir Putin launched a full-scale invasion of Ukraine in February 2022, and Moscow currently controls about 20% of Ukrainian territory.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MPs would vote on using troops in Ukraine, Keir Starmer says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cb9b/live/1815a4a0-ebcd-11f0-98c0-b72e1e8ed823.png"
      ],
      "datePublished": "2026-01-07T19:11:49.000Z",
      "dateModified": "2026-01-07T19:11:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Three children fall from window of double-decker bus",
    "url": "https://www.bbc.com/news/articles/c9qpj275ldlo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e666/live/c7282bf0-ebfc-11f0-81ae-8378c6aa7ffe.jpg",
    "tag": "Trending",
    "date": "2026-01-07T19:41:42.000Z",
    "description": "34 minutes agoLynette HorsburghNorth WestBBCInsp Simon Barrie said it appeared \"to be an unfortunate accident\"Three schoolchildren have fallen through",
    "body": "34 minutes agoLynette HorsburghNorth WestBBCInsp Simon Barrie said it appeared \"to be an unfortunate accident\"Three schoolchildren have fallen through a window from the top deck of a bus in Greater Manchester.A large emergency response went to the incident on Bolton Road, in Ashton-in-Makerfield, shortly before 16:00 GMT.The children have \"potentially serious injuries\" but they are not thought to be life-threatening, Greater Manchester Police said.An investigation was in the early stages but Insp Simon Barrie said it appeared \"to be an unfortunate accident\".\"This is a serious incident that will cause disruption,\" he said. \"Our priority is to make sure the children get the treatment they need in hospital. Thankfully we don't believe their injuries are life-threatening.\"Gary HurstPasser-by Gary Hurst captured the size of the police and ambulance responseCouncillor Danny Fletcher, of Ashton-on-Makerfield South ward, posted on Facebook and said some of the children had suffered potentially life-changing injuries.\"I've spoken with our policing team this afternoon,\" he said.\"As we know, three young people have fallen from a top floor side window of a school bus and have been taken to Manchester Children's Hospital, some with potentially life-changing injuries.\"I've contacted the schools involved to ensure they have council support if needed. Sending my thoughts and all my love to the kids and families involved.\"The road has since reopened.'Fast recovery'Residents from the town have also posted messages of support for the injured children.One said it was \"absolutely heartbreaking\" and wished a \"fast recovery to the children involved\".Another said: \"A speedy recovery to all the children involved and the children that witnessed it as they will be traumatised as well.\"Transport for Greater Manchester said: \"Our thoughts are with those injured and we want to wish them a speedy recovery.\"Emergency services remain at the scene, and we are working closely with the bus operator in supporting police with their enquiries into the incident.\"Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Three children fall from window of double-decker bus",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e666/live/c7282bf0-ebfc-11f0-81ae-8378c6aa7ffe.jpg"
      ],
      "datePublished": "2026-01-07T19:41:42.000Z",
      "dateModified": "2026-01-07T19:41:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "King's Ayrshire estate to host luxury weddings",
    "url": "https://www.bbc.com/news/articles/crml7lpx4kno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f85d/live/95b72410-ebb9-11f0-bbde-4d6c2b8f31bb.jpg",
    "tag": "Trending",
    "date": "2026-01-07T11:48:34.000Z",
    "description": "8 hours agoDumfries HouseA new public hall could be added to the east wing of Dumfries HousePlans for the King's Ayrshire estate to add a new events s",
    "body": "8 hours agoDumfries HouseA new public hall could be added to the east wing of Dumfries HousePlans for the King's Ayrshire estate to add a new events space for luxury weddings have been unveiled.The development would add a public hall to the east wing of Dumfries House in Cumnock, East Ayrshire, which currently serves as the headquarters of the King's Foundation charity.The foundation said the new space - named the King's Hall in honour of the monarch - could become the \"go-to venue for high-end, luxury weddings and private events\" both nationally and internationally.Up to 200 guests could attend events, with proceeds going towards supporting the conservation and development of the house and estate, as well as education programmes and community initiatives.Dumfries House was bought by a consortium led by King Charles - then Prince Charles - in 2007.The new development would open in July 2027, with the structure built using locally-sourced materials. It is intended that it will match the architecture of the 300-year-old house.Heating will come via newly-installed heat pumps and biomass boilers while menus will be made up of organic food and locally-sourced produce.Dumfries HouseThe new development will host events for up to 200 peopleGordon Neil, executive director of the King's Foundation, said:  \"We've used a local quarry to mine the stone and utilised the same building techniques as those used to build Dumfries House 300 years ago, while also incorporating newer techniques and elements that we need to include to meet today's building standards.\"He added that the King's Hall \"will be a true testament to the impact of His Majesty on Dumfries House and the vital education and employment it provides.\"Dumfries House was built between 1754 and 1759 for William Dalrymple, 5th Earl of Dumfries, with Robert Adam the lead architect.Evan Samson, general manager of Dumfries House, said the new venue would be versatile and able to host a broad range of events.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "King's Ayrshire estate to host luxury weddings",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f85d/live/95b72410-ebb9-11f0-bbde-4d6c2b8f31bb.jpg"
      ],
      "datePublished": "2026-01-07T11:48:34.000Z",
      "dateModified": "2026-01-07T11:48:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "First person charged under new small boat Channel crossing law",
    "url": "https://www.bbc.com/news/articles/cy4gm1x23j3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b1c3/live/ec4a0fd0-9378-11ef-b001-c5ad4742e0c1.jpg",
    "tag": "Trending",
    "date": "2026-01-07T18:07:20.000Z",
    "description": "2 hours agoJacob PanonsSouth EastGetty ImagesThe new offence came into force under the Border Security, Asylum and Immigration ActA teenager believed ",
    "body": "2 hours agoJacob PanonsSouth EastGetty ImagesThe new offence came into force under the Border Security, Asylum and Immigration ActA teenager believed to be the first person to be charged with endangering others during a sea crossing to the UK without valid entry clearance said he was \"forced to do so\".Aman Naseri, 18, is accused of piloting a small boat with 46 people on board during the first Channel crossing of the year on 5 January, the day the new law came into force.At Margate Magistrates' Court on Wednesday he pleaded not guilty to the offence.Naseri, who is an Afghan national and followed proceedings through a Dari interpreter, has been remanded into custody to appear at Canterbury Crown Court on Friday.Julie Farbrace, prosecuting, said: \"We submit Mr Naseri has piloted a boat across the Channel. \"There were 46 other people on that boat and that by piloting the boat he put them in danger.\"The Crown Prosecution Service said Naseri was the first person to be charged with the offence, which is part of a range of measures introduced to limit Channel crossings on small boats.New offenceThe new offence came into force under the Border Security, Asylum and Immigration Act, which became law in December.According to the Home Office, the charge of endangering others during a sea crossing is to stop more people being crammed into unsafe boats and would apply to those involved in physical aggression and intimidation, as well as anyone who resists rescue.When the plans for the offence were first announced in January 2025, Home Office sources said there had been instances of \"floating crime scenes\" where people had acted in such a reckless way people died on board in crushes and drownings.The new charge could include physical or psychological injury, and covers journeys by water to the UK from France, Belgium and the Netherlands.Under the offence, those who endanger or risk another life at sea could face up to six years in prison.Boat supplier jailedIn a separate case a man who supplied thousands of small boats and engines to people smugglers has been jailed. Adem Savas, a Turkish national, was sentenced to 11 years in prison and received a fine of €400,000 (£346,000) on Wednesday, after admitting to offences of people smuggling and being a member of an organised crime group.The National Crime Agency (NCA) said it was thought he had made millions from the operation and described Savas as without a doubt the most significant supplier\" to gangs behind the dangerous crossings between 2019 and 2024.An NCA spokesperson said equipment supplied by Savas is thought to have been used in about half the Channel crossings in 2023. Savas was sentenced at a court in Bruges, Belgium, after a joint operation between the NCA and Belgian authorities, having been arrested at Amsterdam's Schiphol Airport in November 2024.Additional reporting from PA Media.More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "First person charged under new small boat Channel crossing law",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b1c3/live/ec4a0fd0-9378-11ef-b001-c5ad4742e0c1.jpg"
      ],
      "datePublished": "2026-01-07T18:07:20.000Z",
      "dateModified": "2026-01-07T18:07:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Berlin outage highlights German vulnerability to sabotage",
    "url": "https://www.bbc.com/news/articles/cvgrpzn6gz4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5326/live/242f1540-ebec-11f0-8608-ef259671aea9.jpg",
    "tag": "Trending",
    "date": "2026-01-07T17:17:34.000Z",
    "description": "3 hours agoJessica ParkerBerlin correspondentBBCLena's family have been cooking on a camping stovePower is being restored to the last homes hit by a f",
    "body": "3 hours agoJessica ParkerBerlin correspondentBBCLena's family have been cooking on a camping stovePower is being restored to the last homes hit by a five-day blackout in Germany's snow-covered capital, Berlin.The outage was caused by a suspected arson attack and came as temperatures dipped below freezing.It is reportedly the longest blackout in the capital's post-war history. A far-left militant group has admitted being behind.This weeks' images of residents - young and old - living through a prolonged blackout in the country's capital has reignited a debate about Germany's vulnerability to sabotage attacks, whether by domestic or foreign actors.Reinhold has been sleeping in a woolly hat to keep warm at nightSchools, hospitals and care homes are among the tens of thousands of properties which were affected in south-west Berlin.In Berlin's Steglitz-Zehlendorf district, on Mexikoplatz, a police van drove around announcing the imminent return of power over a tannoy.Residents regularly approached a group of emergency service workers for the latest information.Lena said her family had felt \"lost\" - relying on a battery-powered radio for updates.They have been cooking on a camping stove at home while trying to make sure their water pipes don't freeze.Reinhold, 79, was still without power on Wednesday morning and going to his daughter's house to get warm.\"But I always came back to sleep here even in the cold weather with a bobble hat on and sweater and a woollen blanket.\"The retired architect said that he was used to hardship having been born in post-war Germany.\"I was born in 1947. When my mother and I came from the hospital... it was -20C in our shack.\"\"My parents took turns every hour to see whether my hands were tucked in under the cover so my fingers wouldn't freeze off.\"Restoring electricity is happening on a \"step-by-step basis,\" said fire service spokesman Adrian Wentzel.Resources have been pulled in from across Germany, he told me, with an estimated 100,000 people affected.Hospitals have had to rely on emergency generators while some schools have had to close.It was early on Saturday when several cables on a bridge were spotted burning near the Lichterfelde gas-fired power plant.Subsequently, the far-left Vulkangruppe or Volcano Group appeared to claim responsibility, saying its target was the fossil energy industry.\"We apologise to the less wealthy people in the southwest of Berlin,\" a lengthy statement read.\"With the many owners of villas in these districts, our sympathy is limited,\" they added, likely referring to the fact that Steglitz-Zehlendorf is one of Berlin's wealthiest neighbourhoods.However, a different statement was later published online on the Indymedia site - purportedly from Vulkangruppe's founders.\"We expressly distance ourselves from all actions of recent years,\" it said.AFP via Getty ImagesTraffic lights were cut off, tooAnother recent high-profile incident saw activists admit being behind a suspected arson attack that halted production at the huge Tesla factory, just outside Berlin, in 2024.The exact structure and workings of Vulkangruppe is not known.But German authorities describe them as left-wing extremists and say attacks have happened at irregular intervals since 2011 in Berlin and the surrounding state of Brandenburg.Domestic intelligence state that the group's aim is to disrupt \"the day-to-day functions in order to harm the hated capitalist system\".Federal prosecutors are investigating the latest incident as a terrorism offence, with possible charges including \"membership in a terrorist organisation, sabotage, arson and disruption of public services\".This week's outage was larger and lasted longer than a similar incident in September.Plans for a federal law to protect critical infrastructure have been in the works for years but were only presented to parliament in November.The \"Kritis\" bill sets out plans to identify key critical infrastructure transport as well as introduce minimum protection standards.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Berlin outage highlights German vulnerability to sabotage",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5326/live/242f1540-ebec-11f0-8608-ef259671aea9.jpg"
      ],
      "datePublished": "2026-01-07T17:17:34.000Z",
      "dateModified": "2026-01-07T17:17:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Heated Rivalry: When and where to watch as steamy ice hockey hit reaches UK screens",
    "url": "https://www.bbc.com/news/articles/c9wx579999wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5842/live/836e0db0-ebae-11f0-a370-2789d390a94d.jpg",
    "tag": "Trending",
    "date": "2026-01-07T15:41:14.000Z",
    "description": "UK viewers warm up for steamy ice hockey hit Heated Rivalry5 hours agoIan YoungsCulture reporterSabrina Lantos/HBO MaxConnor Storrie and Hudson Willia",
    "body": "UK viewers warm up for steamy ice hockey hit Heated Rivalry5 hours agoIan YoungsCulture reporterSabrina Lantos/HBO MaxConnor Storrie and Hudson Williams in one of the show's many steamy scenesTV's latest word-of-mouth hit Heated Rivalry arrives in the UK this weekend, after setting pulses racing across the Atlantic and catapulting its cast to stardom in recent weeks.Based on Rachel Reid's books, the series centres on the illicit relationship between two ice hockey players - one Canadian and the other Russian - who are rivals on the ice but lovers off it.The show has grabbed attention for its sex scenes, but has won praise for its heartfelt depiction of LGBT relationships, and sparked discussions about representation on TV and in sport.It was made by Canadian streaming service Crave and was swiftly picked up by HBO Max in the US, where it was released in late November.Who's in the cast?Getty ImagesConnor Storrie and Hudson Williams will present a Golden Globe trophy together this weekendCanadian actor Hudson Williams plays Shane Hollander, while Connor Storrie, from Texas, plays Ilya Rozanov.They are the first major roles for both actors, and the show has swiftly made them among the hottest properties in the industry.They have been signed by one of Hollywood's biggest talent agencies, CAA, have been booked to appear on US TV chat shows, and will present an award together at this weekend's Golden Globes.The cast also includes François Arnaud, known for The Borgias and Midnight, Texas; and Christina Chang from shows like Nashville and CSI: Miami.What's the reaction been so far?Sabrina Lantos/HBO MaxHeated Rivalry became \"a word-of-mouth sensation\" (according to Rolling Stone), \"the year's biggest TV surprise\" (Variety) and \"the unexpected TV conversation of the moment\" (Newsweek).It is \"hard to fathom just how quickly Heated Rivalry took the world by storm\", Radio Times said last month.The sex is \"almost constant\" and it's \"no exaggeration to say that far more of the show takes place between the sheets than on the ice\", David Opie wrote.But he added: \"As naughty as the show can be, it's also rather moving at points... Heated Rivalry is as authentic in its feelings as it is in its approach to gay sex, something which mainstream productions rarely nail.\"That view was echoed elsewhere. The show \"resonates because it embodies our lives\", Jim Downs wrote in the New York Times.\"If you want to understand why this show has become our community's equivalent of a cultural earthquake, the answer is that watching a gay couple be mildly boring and in love is still radical,\" he said.Commentators have noted that both the show and the books have attracted a large female audience (the \"wine moms\", as writer-director Jacob Tierney has dubbed them).\"But so much attention to female fandom... risks overshadowing what a bountiful gift Heated Rivalry is to the gays,\" wrote David Rooney in the Hollywood Reporter. \"That becomes increasingly apparent as each successive episode taps into richer veins of queer experience concerning the fight between desire and self-denial.\"He added: \"The combination of sex-positivity and swoony romantic wish-fulfillment makes Heated Rivalry hugely satisfying, taking it far beyond the notion of 'Canadian gay hockey smut,' as it's been reductively called.\"Sabrina Lantos/HBO MaxConnor Storrie's character Ilya Rozanov plays for the fictional Boston RaidersNot everyone agreed that it was telling LGBT stories in a new way.Its \"understanding of gay life is frozen in the past\", said Slate.\"I actually love the series, as do so many viewers, for its heat, its pacing, and its emotional pull,\" wrote Jim Downs.\"But enjoyment does not preclude critique. And what the show reveals is that gay storytelling today is limited not so much by social acceptance as by the narrow stories it keeps repeating.\"Meanwhile, Bloomberg said the show was reigniting a \"troubling debate\" about \"what counts as 'authentic' storytelling\" - noting speculation about the lead actors' real-life sexualities (they haven't commented) and that the books were written by a woman, although showrunner Tierney is a gay man.Asked about the issue, Reid has said: \"Queer joy is important to me, combating homophobia in hockey is important to me, the theme of being brave enough to live how you want and love who you want is important to me. I am not a gay or bisexual man, but I try to write thoughtfully and sensitively about these fictional characters.\"As for the homophobia point, some have suggested the show could trigger a change in attitudes in the sport, with the Athletic pointing out there have never been any openly gay players in the NHL and asking whether Heated Rivalry could \"change hockey culture\".What are the original books?Getty ImagesRachel Reid published her first instalment of her six-book Game Changers series in 2018The show is based on the Game Changers series of novels by Reid, who's a Canadian author.It's specifically adapted from the second book in the series, titled Heated Rivalry, published in 2019, about ice hockey stars Shane Hollander and Ilya Rozanov.There are six books in total, published between 2018 and 2022. In 2023, Tierney approached her about turning the books into a TV show.\"What stood out to me in retrospect is that [Heated Rivalry] accomplishes a different task than these books usually do,\" he told Rolling Stone. \"This is not about somebody coming out, it's about two people figuring out they are allowed to be in love. And that zig where the other books zag really stuck with me.\"Reid said she was most proud of helping to bring \"a sweet, sexy, romantic, and, most importantly, happy queer love story to television\".It is, she said, \"a story where the sexual tension and romance isn't subtext, or a tease, or something that ends in tragedy\", adding: \"I want a million more shows like this one.\"When is Heated Rivalry released and where can you watch?The series  will be available in the UK on Sky from Saturday, 10 January, starting with a double bill on Sky Atlantic from 21:00 GMT.All six episodes will be available on streaming service Now from the same date.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Heated Rivalry: When and where to watch as steamy ice hockey hit reaches UK screens",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5842/live/836e0db0-ebae-11f0-a370-2789d390a94d.jpg"
      ],
      "datePublished": "2026-01-07T15:41:14.000Z",
      "dateModified": "2026-01-07T15:41:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]