[
  {
    "title": "Grammy Awards 2026 highlights - from a chaotic Cher to Sabrina Carpenter's stewardess",
    "url": "https://www.bbc.com/news/articles/c1ev5dq4xvdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c257/live/deadc020-0018-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-02T07:44:40.000Z",
    "description": "5 hours agoMark Savage,Music correspondent,Paul Glynn,Entertainment ReporterandChristal Hayes,Entertainment ReporterWatch: the must-see moments from t",
    "body": "5 hours agoMark Savage,Music correspondent,Paul Glynn,Entertainment ReporterandChristal Hayes,Entertainment ReporterWatch: the must-see moments from the 2026 Grammy AwardsThe 68th Grammys ceremony provided its usual mix of endless awards, powerful speeches and perplexing performances.We stayed up all night to watch it, so you didn't have to.Here are some of the best and worst moments from \"music's biggest night\".Cher's comical cameoReutersCher saw the funny side of her gaffeCher made a surprise appearance at the Grammys - her first in 18 years - to receive a lifetime achievement award, and then to present record of the year.And while it was great to see the singer, her link was messier than a night out with Charli XCX.She gave a heartfelt acceptance speech about the importance of following your dreams before walking off without having revealed the next nominees.When she did, she announced - confusingly - that Luther Vandross had won, seemingly from beyond the grave.Easy mistake, though, and it soon became apparent that she had meant to say Luther... by Kendrick Lamar and SZA - a track that does indeed sample the late soul singer.If only she could turn back time.\"I love live television,\" laughed host Trevor Noah afterwards.An APT start to Trevor's last GrammysEPA/ShutterstockRosé and Bruno Mars performing togetherThe show got under way with a rocking version of APT by Bruno Mars and Rosé, which was up for several awards (but ultimately didn't win any).Comedian Noah - in his sixth and final outing as host - explained afterwards that the track was inspired by popular South Korean drinking game Apartment.He then noted how, in light of recent events, the American public now had their own new national drinking game.\"Every time you turn on the news, you drink,\" he quipped.Pharrell Williams cringes at his careerGetty ImagesPharrell Williams was honoured with a lifetime achievement prizePharrell Williams - the architect of hits like Kelis's Milkshake, Justin Timberlake's Rock Your Body, ODB's Got Your Money and his own feelgood hit Happy - was rightfully given the Grammys global impact award.Looking dapper in a pink tux, the star dedicated his prize to \"everyone in this room who believes in the power of black music\".But he squirmed his way through a celebratory montage of his biggest songs.\"I don't know how y'all feel but, for me, it's like listening to your voicemail over like a loudspeaker,\" he observed.Yungblud's good luck charm from Ozzy OsbourneReutersBritish star Yungblud won best rock performance for his live rendition of Black Sabbath's Changes - recorded during Ozzy Osbourne's farewell concert in Birmingham last year.Speaking to reporters on the red carpet, the Doncaster singer said the prize felt a bit \"bittersweet\", after Osbourne's death last summer.He also revealed that his hotel had hung a picture of the late rock star \"above the fireplace\" of his room, \"as a little good luck charm\".It was a \"pretty epic\" touch, he added of the gesture.Before the show, Osbourne's widow Sharon told BBC News the family were delighted that some of rock's biggest names had got together to \"show their love and respect\" with a tribute performance during the ceremony.Walking the red carpet, his son Jack said it felt like their dad was with them - except that he had actually \"hated awards shows\".\"He wouldn't want to be with us,\" he added with a laugh.All aboard Sabrina AirlinesGetty ImagesSabrina Carpenter lit up the stage Sabrina Carpenter gave one of last year's most memorable performances, with a blooper-filled rendition of Espresso.And she was cleared for take-off again in 2026, thanks to a seatbelt-fastening take on her number one hit Manchild.The star appeared as an air stewardess, twirling her way through baggage reclaim while shrugging off a bevy of useless men – a surgeon, a priest, a magician, an astronaut.It made absolutely no sense, but she delivered it with such panache that it barely mattered – even when she ended the performance by pulling a dove out of a top hat.In other words, she wasn't winging it. She's got an altitude for this sort of thing. The performance landed. Stop me when you've had enough.Leon Thomas's mum picked up his first awardEPA/ShutterstockLeon Thomas won one of the early awards for best traditional R&B performance for his song Vibes Don't Lie, but he wasn't there to pick it up. Luckily his mum, Jayon Anthony, was on hand to accept the award for him and even brought a note explain his absence.\"Right now he's on stage rehearsing,\" she explained, ahead of her son's performance in the best new artist medley.However, Thomas made it to the stage in time to pick up his second award - best R&B album, for Mutt.K-Pop shows its teethEPA/Shutterstock(left ro right) Audrey Nuna and Rei Ami from the fictional bandGolden, the breakout hit from Netflix's KPop Demon Hunters, was named best song for visual media - earning the K-pop genre its first ever Grammy Award.Marking that historic occasion, South Korean-American singer-songwriter EJAE (Eun-jae Kim) thanked her... er, dentist.On the red carpet, she explained that the song came to her on the drive to routine check-up and polish.She recorded the melody as a voice memo, before getting into the dreaded dental chair.\"Thank you dentist,\" she smiled on the red carpet, showing off those pearly whites.Heidi Klum and Chappell Roan reveal (almost) allGetty ImagesSupermodel Heidi Klum got tongues wagging on the red carpet while taking comically short steps in a nude latex dress.She could barely walk, but soldiered on with a smile for the photographers.The German catwalk star later reappeared, having slipped into something more comfortable.Elsewhere on the night, Chappell Roan went totally topless but for two nipple rings, threaded with the spaghetti straps that were holding up the bottom of her dress. Speaking of which...Bieber in his boxersReutersJustin Bieber made his Grammys return with a performance of Yukon, from his 2025 album Swag 2. And the Canadian pop star performed wearing nothing but his silk boxers, a pair of socks and a purple guitar.His wife Hailey wore a smile, looking on in the audience.\"One more move and we would've had to put the show on OnlyFans,\" joked Noah afterwards. \"That was brave.\"Eight-year-old Grammy winner Aura V is living her best lifeReutersAura V and her father Fyutch won best children's music album for HarmonyAnd she is not lacking in confidence either.The Grammys' youngest ever winner won best children's album for her collaboration with her father, Fyütch.Speaking on stage, she said it was \"an honour to be here\", adding: \"I was not expecting us to go this far.\"She also gave a shout-out to Icelandic star Laufey - winner of best traditional pop vocal album.\"I just saw her on the red carpet, and I got to talk to her for a little bit, and I know that she won a Grammy too so congratulations to her.\" Speaking to reporters afterwards, she explained her purple outfit was inspired by her love of lavenders and the calmness they bring.She also confirmed her bedtime had been extended until 1am for the night, while her dad said the fizzy apple juice would be flowing in celebration.Lady Gaga's understated* performanceEPA/ShutterstockLady Gaga on stage wearing an eyelash lampshade hat, of courseAt last year's Grammys, Lady Gaga booked out an entire ad break to premiere the music video for Abracadabra, her fantastically maximalist return to pop theatrics.This time round, she brought the song to life with a small rock ensemble that featured her producer Andrew Watt on guitar and Gaga herself on a vintage Roland keyboard.It was reliably, delightfully over the top. Gaga's head was trapped in Satan's wicker basket, as she performed her \"monster claw\" dance and writhed around on the floor.The painstaking pop production that earned the song a record of the year nomination was jettisoned, with Gaga screaming the hook against a blinding array of floodlights.It was disco. It was punk. It was The Phantom of the Popera. Well done.*NB: Sarcasm.Steven Spielberg is an EGOTGetty ImagesThat's not an insult, by the way. It stands for Emmy, Grammy, Oscar and Tony (awards).In other words, an artist who won all of the above.The famous film director joined the esteemed EGOT club on Sunday with a win in the music film category for his production work on Music for John Williams, a documentary about the US composer.Spielberg's Grammy gong will sit nicely alongside his Oscar ornaments won for Schindler's List and Saving Private Ryan, his Emmys for ER and Animaniacs, as well as his Tony trophy for A Strange Loop.He's gonna need a bigger cabinet.Other card-carrying members of the now 22-strong EGOT club include Sir Elton John, Viola Davis and Whoopi Goldberg.A tale of two TikTokersGetty ImagesAlex Warren and Addison Rae both hit the charts after making their names as influencersAddison Rae and Alex Warren both rose to fame on TikTok. In fact, they were both members of the Hype House, whose members became celebrities during the Covid lockdowns.Over the last couple of years, however, they've both launched pop careers.Warren had the UK's biggest-selling single of 2025 with Ordinary, an ode to his wife Kouvr, who left home to be with him when he was living rough on the streets of LA.Rae took inspiration from Charli XCX and Britney Spears, turning in one of last year's most innovative and addictive debut albums.Both earned nominations for best new artist – which meant both got to perform at the Grammy ceremony. Sadly for Warren, earpiece issues left him singing flat and out of sync during his segment. A more seasoned performer might have pulled through, but his inexperience was telling.Rae was another matter – her background as a dancer helping her pull off a tight and punchy performance of Fame Is A Gun, filmed backstage as a trolley laden with Grammy trophies was driving past.In the end, both lost out to Olivia Dean – whose joyous version of Man I Need had the entire audience singing along.Country shake-up honours the past and futureGetty ImagesZach Top won the best traditional country albumThis year's awards saw the best country album honour divided in two, with new categories for best traditional and best contemporary country album.The move came after Beyoncé's win for the disruptive Cowboy Carter last year, and some saw the change as a dig at the star's attempt to cross genres.But the Recording Academy said the change had been under discussion for years, as forward-thinking artists begin to incorporate pop, rap, hip-hop and even EDM to the Nashville sound.In the end, the newly minted best traditional prize went to Zach Top, who proved his credentials by accepting the trophy in a cowboy hat.Rapper-turned-country star Jelly Roll won the new honour for best contemporary country album.Backstage, he talked about why the category changes were necessary.\"The Grammys is always showing how hip they are, with what's actually going on with music,\" he said, noting there'd been an \"undeniable tsunami\" in the genre over the last five years.Trevor Noah tries to get Bad Bunny cancelledGetty ImagesBad Bunny stole the headlines with his historic album of the year win, but there was one thing he couldn't do: Play his music.Just like Kendrick Lamar last year, he's about to headline the Super Bowl half-time show, which means that, contractually, he's not allowed to perform anywhere else.That didn't stop Noah trying to persuade him. \"Don't you get jealous seeing everyone else [perform]?\" he asked the musician.Smiling, Bad Bunny responded: \"Maybe a little bit\", then tried to turn the tables by asking Noah about his decision to step down as Grammys host.\"I should have taken more photos. I should have given more hugs and more kisses whenever I could,\" Noah replied, quoting Bunny's lyrics in the song DtMF.\"Is that my song in English?\" asked the singer, before transitioning into the actual lyrics: \"Y si hoy me emborracho, pues, que me ayuden.\"All of a sudden, a brass band appeared, goading the star into a few bars of his song.\"Oh man, if they sue you, that wasn't me,\" laughed Noah.Context is (Carole) KingEPA/ShutterstockCarole King (left) alongside Lady GagaThe legendary singer-songwriter provided some much needed context ahead of the ceremony, stressing that, while awards are nice, they are not the most important thing in the music world.The real award, as the Grammy winner said on the red carpet, is the work itself.\"The win is doing it, getting to do it, getting to have people hear the music,\" explained King - who has won multiple Grammys awards including best album in 1972 for the timeless Tapestry.\"And that was just like the extra win, but that the important part was doing it.\"And I kind of want to tell all the nominees who don't get the award, they've already won.\"Devil Wears Prada 2 trailer drops during ad break20th Century StudiosMeryl Streep and Anne Hathaway made an unexpected appearance during the Grammys... kind ofOK, this technically isn't about the music - but a new trailer for the long-awaited Devil Wears Prada sequel casually dropped during a break in the Grammys action.In the preview for the movie, which is out in cinemas on 1 May, it seems that Anne Hathaway's character, Andy Sachs, is no longer the scared assistant to Meryl Streep's menacing fashion editor, Miranda Priestly.But does her old boss recognise the new Andy? Not that she's letting on.\"Sorry, who is this?\" Priestly is heard asking her colleague Nigel Kipling, played by Stanley Tucci.\"Do you know her? Do I know her?\"And just to ram home the fact that Streep's character is based on feared fashion editor Anna Wintour, the soundtrack to the trailer was Madonna's Vogue.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Grammy Awards 2026 highlights - from a chaotic Cher to Sabrina Carpenter's stewardess",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c257/live/deadc020-0018-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-02T07:44:40.000Z",
      "dateModified": "2026-02-02T07:44:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI 'slop' is transforming social media - and there's a backlash",
    "url": "https://www.bbc.com/news/articles/c9wx2dz2v44o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/aa09/live/e3eed6a0-fdd4-11f0-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-02T06:54:06.000Z",
    "description": "6 hours agoJoe TidyCyber correspondent, BBC World ServiceBBCThéodore remembers the AI slop that tipped him over the edge.The image was of two emaciate",
    "body": "6 hours agoJoe TidyCyber correspondent, BBC World ServiceBBCThéodore remembers the AI slop that tipped him over the edge.The image was of two emaciated, impoverished South Asian children. For some reason, despite their boyish features they have thick beards. One of them had no hands and only one foot. The other was holding a sign saying it's his birthday and asking for likes.Inexplicably they are sat in the middle of a busy road in the pouring rain with a birthday cake. The image is full of tell-tale signs that it was made with AI. But on Facebook it went viral with nearly one million likes and heart emojis.Something snapped in Théodore.\"It boggled my mind. The absurd AI made images were all over Facebook and getting [a] huge amount of traction without any scrutiny at all - it was insane to me,\" says the 20-year-old student from Paris.So Théodore started an account on X, formerly known as Twitter, called \"Insane AI Slop\" and started calling out and poking fun at the content he came across that was fooling people. Others took notice and his inbox soon became flooded with people sending submissions for popular so-called AI slop.Left: Théodore. Right: “Baby Bubbles and Babbles” Facebook page.Théodore (left) started an online campaign to poke fun at AI 'slop' on social media, including a fake image (right) that received nearly one million likesCommon themes started becoming apparent - religion, military or poor children doing heartwarming things.\"Kids in the third world doing impressive stuff is always popular - like a poor kid in Africa making an insane statue out of trash. I think people find it wholesome so the creators think, 'Great, let's make more of this stuff up,'\" Théodore says.Théodore's account soon swelled to over 133,000 followers.The onslaught of AI slop - which he defines as fake, unconvincing videos and pictures, made  quickly - is now unstoppable. Tech companies have embraced AI. Some of the firms say they are starting to crack down on some forms of AI 'slop' - though many social media feeds still appear to be full of the content.Over just a couple of years, the experience of using social media has changed profoundly. How did it happen, and what effect will it have on society?And, perhaps most pressingly of all, how much do the billions of social media users actually care?Social media's 'third phase'In October, during another jubilant earnings call, Meta CEO Mark Zuckerberg happily declared that social media had entered a third phase, which is now centred around AI.\"First was when all content was from friends, family, and accounts that you followed directly.\"The second was when we added all of the creator content. Now as AI makes it easier to create and remix content, we're going to add yet another huge corpus of content,\" he told shareholders.Meta, which runs social media sites Facebook, Instagram and Threads, is not only allowing people to post AI generated content - it's launched products to enable more of it to be made. Image and video generators and increasingly powerful filters are now being offered across the board.When approached for comment, Meta pointed the BBC to January's earnings call. In that call, the billionaire said the firm was leaning even more into AI, and made no mention of any clampdown on slop.\"Soon we'll see an explosion of new media formats that are more immersive and interactive, and only possible because of advances in AI,\" Zuckerberg said.YouTube's CEO, Neal Mohan, wrote in his 2026 look-ahead blog that in December alone more than one million YouTube channels used the platform's AI tools to make content.\"Just as the synthesizer, Photoshop and CGI revolutionized sound and visuals, AI will be a boon to the creatives who are ready to lean in,\" he wrote.The CEO also acknowledged that there are growing concerns about \"low-quality content, aka AI slop\". He said his team is working on ways to improve systems to find and remove \"low quality, repetitive content\".ReutersMeta CEO Mark Zuckerberg told investors that AI \"makes it easier to create and remix content\"But he also ruled out making any judgements on what should and shouldn't be allowed to flourish. He pointed out that once-niche content like ASMR (soothing sounds designed to make your scalp tingle) and live video game-playing is now mainstream.According to research from AI company Kapwing, 20% of content shown to a freshly opened YouTube account is now \"low-quality AI video\".Short-form video in particular was a hotspot, with Kapwing finding it featured in 104 of the first 500 YouTube Shorts clips shown to a new account created by the researchers.The creator economy seems to be a big driver as people and channels can earn money from engagement and views. Judging by the views on some AI channels and videos, people are indeed drawn to the content - or the algorithms that dictate what we see are, anyway.According to Kapwing, the AI slop channel with the most views is India's Bandar Apna Dost, which has 2.07 billion views, netting the creators an estimated annual earnings of $4m (£2.9 million).But there is something of a backlash taking place too.Under many viral AI videos, it's now common to see a furious flurry of comments decrying the content.Giant monsters and deadly belly parasitesThéodore, the student from Paris, helped to drive this backlash.Using his newfound influence on X he complained to YouTube moderators about the flood of weird AI cartoons that got huge numbers of views. In his view they were disturbing and harmful, and in some cases appeared to him to be aimed at children.The videos were called things like \"Mum cat saves kitten from deadly belly parasites\", and showed gory scenes.Another short clip showed a woman in a night dress who eats a parasite and then turns into a giant angry monster that is eventually healed by Jesus.'Sprung Nexus' YouTube accountThéodore thought some of the AI cartoons he saw on YouTube were disturbing. YouTube says they removed the videos flagged to them for violating their community guidelinesYouTube removed the channels, telling us they did so because they violated their community guidelines. They said they are \"focused on connecting our users with high-quality content, regardless of how it was made\", and said they are working to \"reduce the spread of low quality AI content\".But that experience, plus many others like it, have ground Théodore down.UnknownSome of the AI 'slop' on social media is downright strange, Théodore saysEven seemingly cosy lifestyle sites like Pinterest - the forum for recipes and interior design ideas -  have been affected.Users have become so frustrated by the deluge of AI slop that the company introduced a new opt-out system for AI-generated content - but this relies on users admitting that their perfect-house imagery is AI made.Fury in the comments sectionOn my feed (and I'm aware that everyone's feed is different - including the comments) - the backlash to AI slop has become incessant.Whether it's TikTok, Threads, Instagram or X - there seems to be a people-power movement against this content.Sometimes the number of likes for the AI backlash comments far exceed the original post. Such is the case with a recent video showing a snowboarder rescuing a wolf from a bear. The video itself had 932 likes - versus 2,400 likes for a commenter who wrote, \"Raise your hand if you're tired of this AI s**t\".But of course it all feeds the beast.All engagement is good engagement for social media platforms where keeping us scrolling is key.So does it actually matter if the amazing, heartwarming or shocking video on your social feed is real or not?The 'brain rot' effectEmily Thorson, associate professor at Syracuse University in the US, who specialises in politics, misinformation and misperceptions, says it depends on what people are doing on the social media platform.\"If a person is on a short-video platform solely for entertainment, then their standard for whether something is worthwhile is simply 'is it entertaining?',\" she says. \"But if someone is on the platform to learn about a topic or to connect with community members, then they might perceive AI-generated content as more problematic.\"How people feel about AI slop also depends on how it is communicated.If something is made clearly as a joke, it seems to be taken as such. But when AI slop has been created specifically to deceive, it can anger people.One AI-generated video I saw recently is emblematic: an incredibly realistic, natural-history-style video of an astonishing leopard hunt. In the comments, some viewers were fooled; others were unsure.\"What documentary is it from?,\" one commenter asked. \"Please - it is the only way to [prove] no AI.\"UnknownA backlash has grown against AI 'slop', with lots of comments under videos and photos now pointing out if something is AI-generatedAlessandro Galeazzi, from the University of Padova in Italy, researches social media behaviour and echo chambers.He says that verifying whether or not a video is AI takes mental effort, and over the long run, he fears people will simply stop checking.\"My feeling is that the flood of nonsense, low-quality content generated using AI might further reduce people's attention span,\" he says.He distinguishes content that is intended to deceive with the more comical and obviously-fake AI slop, like fish with shoes, or gorillas lifting weights at the gym.But even that more whimsical content might also have a damaging impact. He talks of the risk of \"brain rot\" - the idea that our constant exposure to social media is harming our intellectual abilities.\"I would say AI slop increases the brain rot effect, making people quickly consume content that they know is not only unlikely to be real, but probably not meaningful or interesting,\" he says.Cuts to moderation teamsBeyond the slop, some AI-made content can have far worse implications.Elon Musk's companies xAI and social platform X were recently forced to change their rules after the chatbot Grok was being used to digitally undress women and children on X.And in the aftermath of the US attack on Venezuela, fake videos were spread of people crying in the streets and thanking the US. Content like this can shape public opinion and give the impression that the US raid was more popular that it might have really been.This is especially concerning as so many people use social media as their only source of news, analysts say.Dr Manny Ahmed, CEO of OpenOrigins, a company that distinguishes between AI and real  images, says we need a new way for real content posters to be able to prove their clips and pictures are genuine.More from InDepth\"We are already at the point where you cannot confidently tell what is real by inspection alone,\" he says. \"Instead of trying to detect what is fake, we need infrastructure that allows real content to publicly prove its origin.\"You might think this is something that social media companies could take on. But many, including Meta and X, have cut their moderation teams down and embraced a more collective approach. They now lean towards relying on users to label things as fake or misleading.Slop-free social media?So if the existing tech giants are broadly happy to let the slop flow, could a new social media platform rise up, promising a slop-free alternative, and eventually challenge the incumbents?It seems unlikely because detection of AI is becoming harder and harder. Machines are no longer able to accurately detect if a video or image is definitively fake, and machines would struggle even more on the subjective judgement of whether or not content counts as 'slop'.However, if a new social media does come along and people vote with their feet (or eyeballs and thumbs, more accurately), it just might move the dial. I'm reminded of the rise of social media challenger BeReal, a French app that gained popularity during the pandemic, which encourages users to show their authentic selves via non-filtered selfies at random times.BeReal hasn't yet reached the same heights as the Facebooks and Snapchats of the world, and probably never will. But it did make the other platforms sit up and in some cases, they copied the idea.Perhaps that could happen again if an anti AI slop challenger makes a move.As for Théodore, he feels that the battle is lost and that AI slop is here to stay.In spite of the submissions still coming into his mailbox from his now 130,000 followers, he doesn't post as much anymore and has largely resigned himself to the new normal of life online.\"Unlike a lot of my followers, I'm not dogmatically against AI,\" he says. \"I'm against the pollution online of AI slop that's made for quick entertainment and views.\"Top image credit: BBC; AI image generated with Adobe Firefly.BBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. Emma Barnett and John Simpson bring their pick of the most thought-provoking deep reads and analysis, every Saturday. Sign up for the newsletter here",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI 'slop' is transforming social media - and there's a backlash",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/aa09/live/e3eed6a0-fdd4-11f0-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-02T06:54:06.000Z",
      "dateModified": "2026-02-02T06:54:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where Eagles Dare",
    "url": "https://www.bbc.co.uk/iplayer/episode/m0026pqz?at_mid=Wmb0QwHn72&at_campaign=Where_Eagles_Dare&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m0026pqz&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Where_Eagles_Dare&at_bbc_team=BBC&at_creation=Film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0kcvbtt.jpg",
    "tag": "Trending",
    "date": "2026-01-10T17:46:15.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeWhere Eagles DareWhere Eagles DareSeven paratroopers, led by a British intelligence officer, are sent on a seemingly impossible mission - to rescue an American officer from the apparently impregnable Castle of the Eagles. Duration2h 29mFirst shown1968Available for 7 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesKelly's HeroesThey set out to rob a bank - and nearly won a war! Offbeat war caper with Clint Eastwood2h 18mThe Guns of NavaroneGregory Peck leads an all-star cast. Behind enemy lines, guns must fall... or Allies will2h 30mThe Eagle Has LandedStars Donald Sutherland and Michael Caine in the WWII tale of a plot to kidnap Churchill2h 9mThe Heroes of TelemarkCome frozen hell or high adventure. Kirk Douglas in a true story of wartime derring-do2h 5mDunkirkJohn Mills and Richard Attenborough star in an epic WWII mission of courage and bravery2h 10mIce Cold in AlexJohn Mills stars. From Tobruk to Alexandria, they had to make it - even with a traitor!2h 5mThe Great EscapeCourage unites, freedom awaits. The all-time action classic action starring Steve McQueen2h 45mEscape to AthenaRoger Moore in an action-packed wartime yarn. A ragtag bunch of prisoners plan an escape1h 54mA Bridge Too FarRichard Attenborough's star-studded spectacle of a daring, but disastrous, WW2 raid2h 48mThe SearchersHe had to find her... John Wayne in the great American western1h 54mThe Magnificent SevenA star-studded classic Western. Villagers hire gunfighters to protect them from bandits2h 3mSaving Private RyanThe greatest mission for eight men was to save one. Steven Spielberg's Oscar-winning epic2h 38m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where Eagles Dare",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0kcvbtt.jpg"
      ],
      "datePublished": "2026-01-10T17:46:15.000Z",
      "dateModified": "2026-01-10T17:46:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Can Trump really save the midterms for the Republicans? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct8bz2?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-01-30T18:19:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·30 Jan 2026,·34 minsCan Trump really save the midterms for the Republicans?AmericastAvailable for over a yearCan Republicans win the midterm elections and keep control of both houses of Congress? It’s the biggest political event of the year, and this week Donald Trump kicked off the Republican’s campaign in Iowa, telling voters the odds are against him, but Republicans “need to win”.  The president’s chief of staff says this is just the start, and Trump will be campaigning for the midterms as if it were a presidential race because he’s good at driving voter turnout.  \nIn this episode, Sarah and Anthony discuss why the midterm elections matter, what the stakes are, and Republican chances of winning.  They’re joined by a former campaign adviser to Donald Trump, Bryan Lanza, who sets out why ICE immigration protests and worries over the economy shouldn’t stop a Republican victory.\nWe also hear from Mary in Kentucky as we build our own “United States of Americast”, finding Americasters in every US state.  Listen out for what you might not already know about Kentucky… \nHOSTS: \n• Sarah Smith, North America Editor\n• Anthony Zurcher, North America Correspondent\nGUESTS:\n• Bryan Lanza, Former senior advisor to Donald Trump\nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Purvee Pattni, Grace Reeve and Kris Jalowiecki.  The technical producer was Jack Graysmark. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Can Trump really save the midterms for the Republicans? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-01-30T18:19:00.000Z",
      "dateModified": "2026-01-30T18:19:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Epstein Files: New Mandelson and Andrew Allegations - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mygh2c?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-02-01T14:52:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·01 Feb 2026,·44 minsEpstein Files: New Mandelson and Andrew AllegationsNewscastAvailable for over a yearA second woman is alleging that she was sent to the UK by Jeffrey Epstein for a sexual encounter with Andrew Mountbatten-Windsor following the release of more documentation from the Epstein files.\nThe encounter allegedly occurred at the former prince's residence, Royal Lodge, in 2010.\nBBC News has asked Andrew Mountbatten-Windsor for comment, but so far he has not responded to these accusations.\nLaura, Paddy and Henry discuss the story and what it could mean for victims.\nAnd John Bew, a professor, historian and former chief foreign policy adviser to four prime ministers, is in the studio to talk about what Trump might do in Iran, Ukraine, UK defence, and his time in Downing Street.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers.\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Laura Kuenssberg and Paddy O’Connell. It was made by Chris Flynn with Chloe Scannapieco. The social producer was Sophie Millward. The technical producer was Jonny Hall. The weekend series producer is Chris Flynn. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Epstein Files: New Mandelson and Andrew Allegations - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-02-01T14:52:00.000Z",
      "dateModified": "2026-02-01T14:52:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gorton and Denton by-election: Workers Party of Britain not standing",
    "url": "https://www.bbc.com/news/articles/c5y2lj3md8po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a07c/live/7d71d7d0-fc88-11f0-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-02T07:34:42.000Z",
    "description": "5 hours agoReutersThe Workers Party of Britain is led by George GallowayThe Workers Party of Britain has said it has taken the \"difficult decision\"  n",
    "body": "5 hours agoReutersThe Workers Party of Britain is led by George GallowayThe Workers Party of Britain has said it has taken the \"difficult decision\"  not to contest the Gorton and Denton by-election.The party, led by George Galloway, said it was \"in the best interests of the working-class\" to withdraw from the election.At the general election in July 2024, Galloway's party got 10.3% of the vote and came fourth.The by-election was triggered by the resignation of Andrew Gwynne, who said he was stepping down for health reasons that had been aggravated in the last year by the fall-out from leaked messages from a controversial WhatsApp group. Gwynne secured 50.8% of the vote, enough for a majority of more than 13,000 ahead of Reform UK (14.1%). The Greens, on 13.2%, came third.The Conservatives (7.9%) and Liberal Democrats (3.8%) came in fifth and sixth respectively.In a statement, the Workers Party of Britain said Labour had \"woefully failed the people of the constituency\".The party claimed Labour was the \"enemy of the British people\", adding that British people had become \"poorer\" while the government spent money on \"a wasteful war\" in Ukraine. It also criticised the planned introduction of digital ID cards. It added: \"This by-election was triggered by Labour in an attempt to replace Starmer with a new acceptable face.\"Whoever wins, if Labour lose, Starmer must resign.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gorton and Denton by-election: Workers Party of Britain not standing",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a07c/live/7d71d7d0-fc88-11f0-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-02T07:34:42.000Z",
      "dateModified": "2026-02-02T07:34:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Drone incidents near UK military bases double year-on-year",
    "url": "https://www.bbc.com/news/articles/c23rxr1lz8do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0856/live/8373a300-ffe6-11f0-b831-0984d2332470.jpg",
    "tag": "Trending",
    "date": "2026-02-02T07:53:57.000Z",
    "description": "5 hours agoJoe Pike,Politics investigations correspondentandHarry SekulichGetty ImagesThe number of drone incidents near military bases in the UK has ",
    "body": "5 hours agoJoe Pike,Politics investigations correspondentandHarry SekulichGetty ImagesThe number of drone incidents near military bases in the UK has doubled in the last year, figures obtained by the BBC show.There were 266 recorded events involving drones in 2025, a rise from the 126 reported in 2024.Government sources have said that with some of those incidents they \"can't rule out hostile state actors\".Defence Secretary John Healey said: \"The doubling of rogue drones near military sites in the UK in the last year underlines the increasing and changing nature of the threats we face.\"Military personnel do not currently have the legal power to shoot down drones, and instead rely on the police. The government is introducing legislation to change that, which will also allow the military to take action against drones operating underwater.Healey added: \"Through the Armed Forces Bill we're giving our military greater powers to take out and shoot down threatening drones near bases, and stepping up investment in counter-drone technology to keep Britain secure at home and strong abroad.\"Existing protocol requires soldiers to divert drones or disrupt their GPS signal using counter-drone equipment. While the new powers are mostly focused on military sites, it could be extended to civilian locations such as airports.The exact nature of the sightings remain unknown.Stricter drone operating rules came into effect in the UK at the start of this year. Flier IDs are required for anyone flying a drone or model aircraft weighing at least 100g, down from 250g.An uptick of drone incursions across Europe last year, including at commercial airports and power stations, was blamed on Russia's suspected programme of \"hybrid warfare\", almost four years into its full-scale invasion of Ukraine.A proposed European \"drone wall\", a defence system designed to detect and destroy rogue drones stretching from the Baltic states to the Black Sea, is expected to be operational in 2027, according to the EU's foreign policy chief Kaja Kallas.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Drone incidents near UK military bases double year-on-year",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0856/live/8373a300-ffe6-11f0-b831-0984d2332470.jpg"
      ],
      "datePublished": "2026-02-02T07:53:57.000Z",
      "dateModified": "2026-02-02T07:53:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anne Boleyn portrait design work revealed by infrared scans",
    "url": "https://www.bbc.com/news/articles/clyepql1kzko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/53f8/live/0399e340-fd3b-11f0-85f9-892da4472ee9.png",
    "tag": "Trending",
    "date": "2026-02-02T06:01:42.000Z",
    "description": "Anne Boleyn portrait a 'rebuttal of witch rumours'7 hours agoCraig BuchanSouth EastHever CastleResearchers have made discoveries about the Hever Rose ",
    "body": "Anne Boleyn portrait a 'rebuttal of witch rumours'7 hours agoCraig BuchanSouth EastHever CastleResearchers have made discoveries about the Hever Rose portrait of English queen Anne BoleynInfrared images have revealed that an artist who painted Anne Boleyn deviated from an approved design for portraits of the Tudor queen.Curators at Hever Castle, the childhood home of Boleyn, said new research showed that the painter altered the undersketch for the Hever Rose portrait from the standard \"B\" pattern they initially followed.The finished painting deviated from the approved design to include the executed queen's hands, according to researchers.Assistant curator Dr Owen Emmerson said it was a \"visual rebuttal to hostile rumours\" that Boleyn – the second wife of Henry VIII – was a witch with extra fingers.She added: \"The decision to show Anne's hands should be understood as intentional.\"The castle commissioned research on the Hever Rose portrait from the Hamilton Kerr Institute, part of the Fitzwilliam Museum in Cambridge.Dendrochronology analysis of the wooden panel the portrait was painted on dated the work to 1583, during the reign of her daughter Elizabeth I.Emmerson said it made the work the earliest scientifically dated panel portrait of Boleyn.At that time, Boleyn's image was \"being consciously revisited and reshaped\" during a spell of \"intense political and religious anxiety\", he added.Hamilton Kerr InstituteHamilton Kerr InstituteHever historian and deputy curator Kate McCaffrey said the approved pattern \"may itself have been based on an earlier image closer to Anne's lifetime\", which perhaps \"brings us closer to seeing Anne as she truly was\".She said that the Hever Rose portrait, newly dated, offered a \"more human impression that preserves an earlier idea of Anne's image\" than later representations.The painting will be displayed as part of an exhibition at Hever Castle from 11 February, alongside other likenesses of Boleyn.More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anne Boleyn portrait design work revealed by infrared scans",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/53f8/live/0399e340-fd3b-11f0-85f9-892da4472ee9.png"
      ],
      "datePublished": "2026-02-02T06:01:42.000Z",
      "dateModified": "2026-02-02T06:01:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Australian woman dies after becoming snagged in ski lift in Japan",
    "url": "https://www.bbc.com/news/articles/cvgdyj5n3m6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/60db/live/87ef92c0-0029-11f1-a507-573696841dbb.jpg",
    "tag": "Trending",
    "date": "2026-02-02T12:08:22.000Z",
    "description": "31 minutes agoJessica RawnsleyGetty ImagesTsugaike Kogen Mountain Resort is a popular skiing destination in JapanAn Australian woman has died after be",
    "body": "31 minutes agoJessica RawnsleyGetty ImagesTsugaike Kogen Mountain Resort is a popular skiing destination in JapanAn Australian woman has died after becoming trapped in a ski lift at a resort in central Japan, officials have said.The 22-year-old woman had been using a chairlift at Tsugaike Mountain Resort in Otari, Nagano prefecture, when part of her backpack became caught in the lift mechanism, leaving her suspended in midair.The woman then suffered a heart attack and was taken to hospital where she was pronounced dead, officials said.The Tsugaike Mountain Resort and Tsugaike Gondola Lift Co issued a joint apology and said an investigation had been launched into the incident, which occurred around 09:00 local time (0:00 GMT) on Friday. The resort's chief executive Tsuneo Kubo expressed his \"deepest condolences to the bereaved family\" and said safety measures would be strengthened.He said in a statement that an unfastened buckle on the woman's backpack had become hooked to the chair while the bag's chest strap was still fastened, causing her to be dragged along with it after trying to disembark.The lift was stopped by an attendant who pressed the emergency button, after which first aid was administered and the woman was transported to hospital by ambulance, Kubo added.The accident took place at the top of the two-person Tsuga No.2 Pair Lift. The woman had been riding the lift with another person, police told local media.The lift operator said it was co-operating with police and other authorities as the cause of the accident was investigated and safety procedures reviewed.\"We will take concrete measures to prevent recurrence,\" Kubo said. \"We take this situation very seriously and will strive to operate the ski resort in a safe manner so that our customers can use it with peace of mind.\"Police are questioning resort staff and inspecting the lift equipment as part of their inquiry, according to local media.Australia's Department of Foreign Affairs and Trade confirmed that one of its citizens had died in Japan and said it was providing consular assistance to the family.\"We send our deepest condolences to the family at this difficult time. Owing to our privacy obligations we are unable to provide further comment,\" a spokesperson said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australian woman dies after becoming snagged in ski lift in Japan",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/60db/live/87ef92c0-0029-11f1-a507-573696841dbb.jpg"
      ],
      "datePublished": "2026-02-02T12:08:22.000Z",
      "dateModified": "2026-02-02T12:08:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Not a fan of the gym? Why you should try 'exercise snacking'",
    "url": "https://www.bbc.com/news/articles/c8011zke7nko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1103/live/f1c37090-f868-11f0-9796-05e6aeca39b2.jpg",
    "tag": "Trending",
    "date": "2026-02-02T01:49:10.000Z",
    "description": "11 hours agoLucy HookerGetty ImagesJoin the gym, run up a mountain, sign up for spin classes. We are constantly being told to go to great lengths - an",
    "body": "11 hours agoLucy HookerGetty ImagesJoin the gym, run up a mountain, sign up for spin classes. We are constantly being told to go to great lengths - and get very sweaty - to get fit.What if you just don't have the time or inclination?Jo Blodgett has the answer: activity \"snacks\" that you can almost effortlessly add in to your daily schedule. Blodgett is a senior research fellow at the Institute of Sport, Exercise and Health at University College London and has studied the impact that small bursts of action can have on your health.High intensity exercise - getting out of breath, getting your heartbeat up - is really beneficial, but it is only part of the picture, she told Radio 4 podcast What's Up Docs?Here she explains how you can get fitter without a special outfit or a gym membership.1. Fit small bursts of activity into your dayGetty ImagesSpin class is not for everyoneThere are loads of ways you can add \"exercise snacks\" into your day, says Blodgett. Officially she calls it \"vigorous intermittent lifestyle physical activity\" or \"VILPA\" - essentially briefly increasing your effort during routine activities.\"It's about finding opportunities in your daily life that are going to push you a little bit more,\" she says.She suggests:Taking the stairs and the lift - Walking all the way to the 12th floor might be unrealistic, so walk up two floors then get in the liftGetting off the bus early – cycling to work is great, but if you need to take the bus, get off and walk the last stop as fast as possible. No lycra needed.Picking up your pace – you might already go for walks, try speeding up between two lamp postsFortunately, if you are not currently moving much, adding in just three or four bouts of intense movement, lasting one or two minutes each, can make a big difference to heart disease and life expectancy.2. Don't rely on a few gym sessionsGetty ImagesIf you do already manage to fit in regular gym workouts, or a game of football once a week, you can stop feeling smug now. Plenty of us are what Blodgett calls \"active couch potatoes\".Of course those activities are \"a good thing\" she says, but they won't make up for sitting all day at work staring at a screen or spending the evening slouching on the couch.\"Thirty minutes in the gym is only a tiny part of it\", she points out. \"What about the other 23-and-a-half hours?\"If that is you, she advises:Standing up - get up from your desk regularlyGoing for a walk - use half your lunchtime for a leg stretch instead of looking at your phoneMeetings on the go - think West Wing, walk and talk. This works for a lot of phone meetings tooThe evidence suggests sitting only for very short periods is best. \"Every 15, 30 minutes, can you stand up, shake around, sit back down?\" says Blodgett.This does not mean you should quit the gym.There is still a hierarchy, with higher intensity activity, that raises the heart rate, still offering the biggest fitness and health gains, followed by moderate activity such as walking, says Blodgett.3. Reduce the time you are not movingGetty ImagesHealth guidelines tend to focus on how much vigorous exercise you should be aiming for.Blodgett suggests flipping that and seeing if you can reduce the time you are not moving.A few countries including Canada and Australia have started using this message. Assuming you sleep for eight hours, at least half of the time you're awake - eight hours - should be spent on the move.Blodgett says:Keep moving - aim for less than eight sedentary hours a day. The more you can cut that back the better.Let children go free - Advice in Australia is that pre-schoolers should not be restrained in a pushchair or car seat for more than an hour at a time. On rainy days try playing with balloons indoorsLean in to daily chores - Carrying groceries, pushing the lawnmower and tidying the house are all ways to keep on the move and help with strength and balanceThere is no golden rule for how much is enough, says Blodgett. The more you move the better.Drs Chris and Xand van Tulleken are on a mission to help us take better care of ourselves. Listen to What's Up Docs? on BBC Sounds or wherever you get your BBC podcasts.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Not a fan of the gym? Why you should try 'exercise snacking'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1103/live/f1c37090-f868-11f0-9796-05e6aeca39b2.jpg"
      ],
      "datePublished": "2026-02-02T01:49:10.000Z",
      "dateModified": "2026-02-02T01:49:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump threatens to sue Trevor Noah over Epstein joke at Grammys",
    "url": "https://www.bbc.com/news/articles/c98p02yg4jro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8e40/live/f98965f0-0024-11f1-a507-573696841dbb.jpg",
    "tag": "Trending",
    "date": "2026-02-02T12:30:53.000Z",
    "description": "9 minutes agoTom BennettGetty ImagesThe South African comedian was hosting the music awardsUS President Donald Trump has threatened to sue comedian Tr",
    "body": "9 minutes agoTom BennettGetty ImagesThe South African comedian was hosting the music awardsUS President Donald Trump has threatened to sue comedian Trevor Noah after he joked about Trump and Jeffrey Epstein at the Grammy Awards.Hosting the event, Noah said: \"Song of the Year - that is a Grammy that every artist wants almost as much as Trump wants Greenland, which makes sense because Epstein's island is gone, he needs a new one to hang out with Bill Clinton.\"Trump is known to have been an associate of Epstein for years, but says he had no knowledge of his crimes and that they fell out in about 2004. There are no suggestions he ever visited Epstein's private island and he has not been accused of any crime by Epstein's victims.  The US justice department has said allegations about him are unfounded and false.Trump responded to Noah's joke by saying he would be \"sending my lawyers to sue\". Posting on Truth Social, Trump wrote: \"Noah said, INCORRECTLY about me, that Donald Trump and Bill Clinton spent time on Epstein Island. WRONG!!!\"I can't speak for Bill, but I have never been to Epstein Island, nor anywhere close, and until tonight's false and defamatory statement, have never been accused of being there, not even by the Fake News Media.\"Noah, a total loser, better get his facts straight, and get them straight fast.\"He added: \"Get ready Noah, I'm going to have some fun with you!\"Epstein was found dead in his New York prison cell in 2019 while awaiting trial on sex trafficking charges, more than a decade after he was convicted of soliciting prostitution from a minor.He had purchased his private island in 1998. Multiple survivors have alleged that they were trafficked there and abused. Trump has engaged in legal action with multiple media organisations in recent years, including the New York Times and the Wall Street Journal.In December, he filed a multi-billion dollar lawsuit in a Florida court accusing the BBC of defamation and of violating a trade practices law over the editing of a Panorama programme.Noah is a South African-born comedian who hosted The Daily Show on Comedy Central in the US for seven years. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump threatens to sue Trevor Noah over Epstein joke at Grammys",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8e40/live/f98965f0-0024-11f1-a507-573696841dbb.jpg"
      ],
      "datePublished": "2026-02-02T12:30:53.000Z",
      "dateModified": "2026-02-02T12:30:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MP Dan Norris arrested over more alleged sexual offences",
    "url": "https://www.bbc.com/news/articles/c20d7y2rqw6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/68b0/live/8cc30ce0-1552-11f0-bb66-e5a3c361000c.png",
    "tag": "Trending",
    "date": "2026-02-02T12:22:47.000Z",
    "description": "17 minutes agoChloe HarcombeWest of EnglandGetty ImagesMP Dan Norris remains on conditional police bailAn independent MP has been arrested for a secon",
    "body": "17 minutes agoChloe HarcombeWest of EnglandGetty ImagesMP Dan Norris remains on conditional police bailAn independent MP has been arrested for a second time accused of a string of sexual offences.Former Labour MP Dan Norris, 66, remains under investigation on suspicion of the rape of a woman and has been further arrested on suspicion of raping a second woman, sexually assaulting a third woman, voyeurism, and upskirting a number of women.The former West of England Mayor was first arrested in April 2025 on suspicion of sexual offences against a girl, child abduction, and the rape of a woman. Police are no longer investigating the child sexual offences or abduction.All the offences are alleged to have occurred between the 2000s and 2020s. Norris is also being investigated over alleged misconduct in a public office. He remains on conditional bail.More from BristolHe was elected as a Labour MP for North East Somerset and Hanham in July 2024, defeating Conservative MP Jacob Rees-Mogg.The Labour Party said it immediately suspended Norris when it was made aware of his arrest in April. A petition claiming he cannot fully support his constituency and demanding his resignation has reached more than 2,000 signatures.Norris previously said in a statement that he continued to represent his constituents, stayed across local and national developments, handled casework, policy queries and parliamentary questions.Norris is now sitting as an independent MP but has not attended the House of Commons since his arrest. He is still able to vote by proxy.He would only lose his position as an MP if he was charged, convicted and jailed.Norris' term as the West of England mayor came to an end in May 2025, when he was replaced by Helen Godwin.'Complex' investigationPolice said their investigation began in December 2024.A spokesperson for Avon and Somerset Police said: \"Investigations into sexual offences are sensitive and complex and as a result it can take a significant amount of time for enquiries to be completed.\"We're keeping victims updated on any developments and we'll continue to give access to any support they may need.\"We'd respectfully ask people not to speculate on the circumstances so our enquiries can continue unhindered.\"Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MP Dan Norris arrested over more alleged sexual offences",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/68b0/live/8cc30ce0-1552-11f0-bb66-e5a3c361000c.png"
      ],
      "datePublished": "2026-02-02T12:22:47.000Z",
      "dateModified": "2026-02-02T12:22:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Drivers can compare fuel prices at different petrol stations - how does it work?",
    "url": "https://www.bbc.com/news/articles/cp80dpzdg37o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/90bb/live/d2d0f7a0-002b-11f1-a507-573696841dbb.jpg",
    "tag": "Trending",
    "date": "2026-02-02T11:45:33.000Z",
    "description": "55 minutes agoJosh Martinbusiness reporterGetty ImagesDrivers can now compare the cost of fuel offered by all petrol stations across the UK as part of",
    "body": "55 minutes agoJosh Martinbusiness reporterGetty ImagesDrivers can now compare the cost of fuel offered by all petrol stations across the UK as part of a government scheme to help people to shop around for the best price.From Monday, garages and fuel stations must report their prices to third-party apps and websites within 30 minutes. Chancellor Rachel Reeves said the Fuel Finder Scheme could save the average household £40 a year.Motoring groups have said that motorists can end up paying 20p per litre more for petrol or diesel depending on where in the country they fill their tank.The Fuel Finder Scheme will allow \"drivers to find the best deals and spur competition as fuel retailers compete for customers,\" the Competition and Markets Authority (CMA) said. The UK watchdog recommended the scheme after publishing a number of reports into fuel prices on UK forecourts.The most recent study found that competition remained \"weak\" between petrol stations and profit margins for retailers were \"persistently high\". The Petrol Retailer's Association said the industry is facing higher wage and tax bills but pump prices are much cheaper than the highs of 2022 and 2023, following Russia's full-scale invasion of Ukraine which sent oil prices soaring.The CMA found that retail prices tended to \"rise like a rocket, but fall like a feather\" in response to increases or decreases in the cost of crude oil.The shared price database policy was first put forward by the Conservatives in 2023, and announced by the Labour government in last year's Budget.How it worksAlthough the government's Fuel Finder Scheme sources and shares pricing data - as well as forecourt services such as car washes, air pumps, and toilets - there is no specific government app to direct motorists to the cheapest forecourt or garage.Instead, this open source data will be used by established apps and websites that already map out and compare pump prices across the UK.The difference is that previously, sharing price data was voluntary - now all businesses that sell petrol and diesel have to upload their price changes to a government database.Current comparison apps and websites include PetrolPrices, Waze, My RAC and the AA app, as well as in-car navigation systems and online map services.Petrol is currently 131.91p per litre, which is the lowest price since July 2021, according to the RAC motoring group. A litre of diesel is 140.97p.RAC head of policy, Simon Williams, said: \"As a growing number of the country's 8,300 forecourts submit their prices on a daily basis, drivers will be able to easily find the cheapest forecourts near them using their favoured app or sat-nav.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Drivers can compare fuel prices at different petrol stations - how does it work?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/90bb/live/d2d0f7a0-002b-11f1-a507-573696841dbb.jpg"
      ],
      "datePublished": "2026-02-02T11:45:33.000Z",
      "dateModified": "2026-02-02T11:45:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": " Olivia Dean is crowned pop's most exciting new artist at the Grammys",
    "url": "https://www.bbc.com/news/articles/c1ev567ly7qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c1fd/live/edad3980-0012-11f1-a8b8-bdd2c5f9bcad.jpg",
    "tag": "Trending",
    "date": "2026-02-02T09:26:10.000Z",
    "description": "How Grammy winner Olivia Dean became Britain's new global star3 hours agoMark Savage,music correspondentandPaul Glynn,culture reporterGetty ImagesThe ",
    "body": "How Grammy winner Olivia Dean became Britain's new global star3 hours agoMark Savage,music correspondentandPaul Glynn,culture reporterGetty ImagesThe 26-year-old has scored an international hit with her second album, The Art of LovingBritish singer Olivia Dean confirmed her status as one of pop's biggest breakout stars by winning the Grammy Award for best new artist in Los Angeles on Sunday.Dean went into the ceremony as the frontrunner, thanks to joyful, soulful romantic pop songs like Man I Need and So Easy (To Fall In Love), which became transatlantic hits last year.Despite competition from fellow Brit Lola Young and R&B artist Leon Thomas, she came out on top, making her the first Brit to win best new act since Dua Lipa in 2019.\"I'm up here as a granddaughter of an immigrant,\" the 26-year-old noted while accepting her award. \"I'm a product of bravery and I think those people ought to be celebrated.\"She added: \"We're nothing without each other.\"The star also performed a buoyant version of her UK chart-topper Man I Need, in the week it reached number two on the US Billboard Hot 100.Her golden gramophone trophy crowned her as one of pop's biggest new names, joining former best new artist winners like Amy Winehouse, Billie Eilish, Adele and Olivia Rodrigo.She was presented with her award by last year's recipient Chappell Roan.The moment marked the culmination of a slow-burn success that began with Dean's first EP, OK Love You Bye, in 2019. Since then, she has experimented with numerous genres and sounds before settling on the pillowy, jazz-toned sounds of her second album, The Art of Loving.Late-night conversationsBorn and raised in Highams Park, north-east London, Dean knew she wanted to be a singer from an early age.From a distance, she'd watched her cousin - So Solid Crew rapper and actor Ashley Walters - top the charts, but it was another Londoner who really inspired her.\"People always try and say something cool when they talk about their first record - but I remember my granny taking me to Woolworths to buy Leona Lewis's A Moment Like This on CD single,\" she told BBC News two years ago.Her debut album Messy was nominated for the Mercury Prize, but it was last year's The Art Of Loving that really put her on the map.An intimate portrait of matters of the heart, it reached number one in the UK and earned her three concurrent Top 10 singles.The entire album was composed and recorded in a rented house in east London, where Dean shunned A-list writers and asked her closest collaborators to spend two weeks there, mixing sessions with late night conversations over good food and \"lots of red wine\".That easy-going, free-flowing approach is all over the record – whose stories of love and loss are conveyed with an easy informality, like your best friend spilling their secrets.Man I Need became her breakout single in the US. Speaking to the podcast And The Writer Is..., she said it had been inspired by Michael Jackson's 1987 single The Way You Make Me Feel and Haribo's insanely fizzy Tangfastic sweets.\"I came in that day and there was a lot of energy in the room,\" she recalled. \"And I was like, 'Guys, let's make something really fun. I want to make something I can dance to. I want to make something that when I perform live, it's just gonna be like a Tangfastic'.\"We started with the drum beat and I was like, 'Yeah, I want to do something kind of like Michael [Jackson]'s The Way You Make Me Feel-esque'.\"And I sat at the Wurly [a Wurlitzer electric piano] and we kind of just, like, wrote it.\"ReutersOlivia Dean had an outfit change before performing her track, Man I NeedIt's not just the music that has made Dean stand out.Early in her career, she railed against being pigeonholed as an R&B artist when her music spanned genres like pop, alternative and folk, alongside throwback soul.\"I have sometimes felt quite boxed in, like I have to make 'urban' music,\" she said, but \"I feel like I can do anything\".Last year, she made headlines again after demanding, and obtaining, a refund for fans who had bought resale tickets for her US tour from Ticketmaster.The star wrote an open letter to ticketing companies after some tickets were listed at more than 14 times their original face value, with prices rising above $1,000 (£750).Dean called the practice \"disgusting\" and \"vile\", prompting Ticketmaster to announce a price cap on resale tickets, and promise to refund fans \"for any markup they already paid\" on its service.Showing that she's unafraid to stand up for her fans increased the praise she's received from all quarters of the industry - including Sir Elton John, who interrupted the singer's camping trip to offer congratulations on her award nominations.Alexander FjodorovOn Sunday, the singer fended off Young as well as influencers-turned-pop stars Addison Rae and Alex Warren, girl group Katseye, rock star Sombr and US indie pop band The Marías to win the best new artist category.For the second year in a row, all eight nominees performed during a special segment at Sunday night's ceremony - dubbed the biggest night in music.That will have allowed her to win over yet more fans who may not have known her before.\"I think what Olivia has is charm,\" said Stuart Worden, principal of the Brit performing arts school, which Dean attended from the age of 15.\"She's a real hard worker, so she would have worked really hard on her stage presence, really hard on her stagecraft, she would have worked really hard on her songwriting,\" he said.Broadcaster Abbie McCarthy told BBC Radio 4's Today programme that Dean \"oozes this superstar charm\".McCarthy promoted one of Dean's early gigs in 2020, and \"even then she had that star power\", she said.\"The classic styling and the elegance that she brings on stage, she's going to go down as a classic legend, I think,\" McCarthy added.\"She's no longer the best-kept secret. She is the star that she's always deserved to be.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": " Olivia Dean is crowned pop's most exciting new artist at the Grammys",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c1fd/live/edad3980-0012-11f1-a8b8-bdd2c5f9bcad.jpg"
      ],
      "datePublished": "2026-02-02T09:26:10.000Z",
      "dateModified": "2026-02-02T09:26:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]