[
  {
    "title": "Sanctions-busting shadow ships are increasing - the big question is what to do about them",
    "url": "https://www.bbc.com/news/articles/c07jnmgy8jmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/37ac/live/9dd85410-0695-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-11T00:17:37.000Z",
    "description": "1 hour agoPaul Adams,Diplomatic CorrespondentandKayleen Devlin,BBC VerifyBBCOn 26 January, staff in an office in Mumbai received an urgent e-mail from",
    "body": "1 hour agoPaul Adams,Diplomatic CorrespondentandKayleen Devlin,BBC VerifyBBCOn 26 January, staff in an office in Mumbai received an urgent e-mail from a crew member aboard a tanker off the coast of Singapore.The email, purportedly written on behalf of five colleagues aboard the tanker sailing under the name Beeta, contained a litany of complaints: crew members, it was alleged, had not been paid and were being treated \"like animals\"; and provisions were running low.The staff in Mumbai worked for the International Transport Workers Federation (ITF), the world's leading organisation representing seafarers, and were used to dealing with complaints from all corners of the globe.But what caught their eye was the fact that the emails hadn't just been copied to multiple ITF offices, but also to sanctions enforcement bodies in several countries.\"The vessel is sanctioned and blacklisted,\" the sailor wrote.He said he had discovered that the vessel calling itself the Beeta was in fact an American-sanctioned tanker called the Gale.The sailor and his colleagues were desperate to leave.\"I've been at sea for many years,\" he told the BBC when we contacted him. \"I know what's right and wrong.\"Inadvertently, the crew member had found himself involved in a problem at the heart of some of today's most contentious geopolitical issues: a surging number of tankers, transporting Russian and Iranian oil, operating outside maritime rules, using a variety of methods to conceal their identities.This \"shadow fleet\", as it's known, is growing fast.ITFThis image shows the American sanctioned tanker called the GaleEstimates vary, but the latest data from the monitoring group TankerTrackers.com says the fleet currently consists of 1,468 vessels, roughly triple its size at the time of Russia's full-scale invasion of Ukraine four years ago.That's about 18-19% of the total internationally trading tanker fleet, carrying approximately 17% of all seaborne crude, says Michelle Wiese Bockman, senior maritime intelligence analyst at Windward AI.The phenomenon that first emerged in the 2010s, as North Korea and Iran sought to evade international sanctions, has proliferated, leaving western governments scrambling to keep up.So what can those governments do when countries circumvent or flout the rules to export oil and use the profits to fuel engines of war or repression?'Modern-day slavery'Definitions vary - as do names: it's also been called the \"dark\" or \"ghost\" fleet - but shadow vessels generally exhibit some or all of a particular set of characteristics.They tend to be old, averaging an age of around 20 years, and are often poorly maintained. Details of ownership and management are deliberately opaque - names, identification numbers and flags are frequently changed. Insurance is below Western standards and sometimes fake.Vessels frequently switch off or manipulate their automatic identification system (AIS), making them harder to track.Seamen, recruited on contracts that typically last six to nine months, don't always know what they're getting into.\"I didn't understand what shadow fleet vessels actually were,\" Russian engineer Denis told us, after serving aboard an EU- and UK-sanctioned tanker, Serena, for several months last year.Serena is currently flying under the flag of Cameroon. While Denis was aboard, it was flying a false Gambian flag.Denis says he realised the Serena was under sanctions only when he went aboard. But like many seamen, he says he needed the work.\"Once they're at sea, they've got them prisoner on board,\" says Nathan Smith, an ITF inspector familiar with the Serena.Smith has heard numerous stories of abuses aboard shadow vessels.\"It's a modern-day slavery,\" he says.Over the course of months spent sailing between Russia and China, the reality of life aboard a shadow vessel became increasingly apparent to Denis.\"Things began to deteriorate very quickly because no spare parts were sent,\" he said. \"The radar on the bridge hadn't been working for over a year, the life-saving equipment wasn't working and there were numerous faulty fire sensors.\"During a stop at the Russian port of Vladivostok, last October, the crew tried, without success, to repair a davit, a small specialised crane used to lower the tanker's life boats into the water. Denis says a port official nevertheless issued a certificate of successful inspection. The BBC has approached the Port of Vladivostok for comment.Denis says he never found out who owned the Serena or who crew members could contact to raise complaints.It's notoriously difficult to establish ownership of shadow fleet vessels. Ships have registered owners, which are often shell companies or entities set up to manage a single vessel. The names of real, or \"beneficial\" owners are frequently hidden. We have tried to make contact with the owners of the Gale and Serena, but without success. In the case of the Gale, it has proved impossible to establish the identity of the beneficial owner.Crews are poorly protected throughout the industry, with unpaid wages and abandonment by owners all-too frequent. But Denis says shadow vessels are the worst.\"Now I'll be more careful,\" he says. \"I've learned to identify dangerous vessels that I won't work on any more.\"The ships brought back from the deadDeep within the murky recesses of the shadow fleet also lurks a category experts have dubbed \"zombie ships\" - vessels which steal the identity of dead ships in order to hide their true identity.After being sanctioned, a zombie ship often disappears from tracking systems, later reappearing under a new name, using a stolen nine-digit International Maritime Organisation (IMO) number from a scrapped or decommissioned vessel.The ship's AIS tracking system, which uses transponders to continuously broadcast its location, is re-programmed to imitate the previous vessel.With the dead tanker's identity magically resurrected, the zombie ship continues to ply its trade, free from sanctions.The Gale is one such ship.According to the global trade intelligence company Kpler, the tanker, currently flying a false Gambian flag, has assumed multiple identities since being sanctioned by the US last year for its involvement in the export of sanctioned Iranian oil.After a period sailing under the false identity Sea Shell, using a different stolen IMO number, the Gale again changed identities, re-emerging as Beeta and loading a cargo of Iranian oil on 31 January.According to TankerTrackers.com, which uses satellite imagery, AIS data and shoreline photography to follow the movement of crude oil, the shipment was delivered by another US-sanctioned vessel via a ship-to-ship transfer, a procedure commonly used by shadow-fleet vessels involved in the shipment of sanctioned oil.Copernicus Sentinel 2, 2026Satellite imagery shows the Gale (Beeta) loading a cargo of Iranian oil in a ship-to-ship tranferThe ship-to-ship transfer took place south of the Riau Archipelago, around 150 miles east of Singapore.Windward AI's Michelle Wiese Bockmann calls the area \"an epicentre of maritime lawlessness\", where dozens of tankers gather to store or transfer Iranian oil.Bockmann says China imported 1.8 million barrels per day of sanctioned Iranian crude per day in 2025. The BBC has contacted the Chinese embassy for a response.\"None of it was traced,\" she says, \"because tankers hide their loading and the oil has come on four or five tankers, deliberately to obscure the origin and destination of the cargo.\"The Gale's history and behaviour mark it out as a classic zombie ship.A computer screenshot taken on board by the crew member who contacted the ITF appears to give instructions on how to fake the ship's location, a process known as spoofing.Two other screenshots, taken on 26 January, show the spoofing at work.One displays the tanker's actual location, east of Singapore. The second, taken just five minutes later, shows a fake location, around 2,800 miles away, off the coast of the Indian state of Gujarat.\"The confirmed linkage between Gale, Sea Shell, and Beeta, alongside fabricated AIS position history and prior impersonation, is consistent with deliberate identity manipulation,\" says Ana Subasic, an analyst at the global trade intelligence company Kpler.The BBC has no reason to believe the Serena is a zombie vessel, but the ship's former engineer says he saw equipment that would enable the Serena to fake its position.\"I spoke with the bridge officers about turning off the AIS and other manipulation,\" Denis told us. \"We had equipment on board to change the vessel's position. I think this equipment is only used for sanctioned cargo.\"What can be done?Such practices, coupled with the knowledge that Russian and Iranian oil revenues continue to fuel conflict in Ukraine and the Middle East, are driving an urgent debate in western capitals about how to respond.Donald Trump's recent actions in Venezuela – seizing seven tankers since early December as part of a pressure campaign on the regime of then president Nicolás Maduro – has shown that one solution is the simple application of force.The operation to chase and capture one vessel, the Russian-flagged tanker Marinera, took the US military, including a coastguard vessel and special forces, on a two-week chase far out into the North Atlantic.The Marinera, previously known as the Guyanese-flagged Bella 1, was wanted by the US for transporting sanctioned oil from both Venezuela and Iran.Getty ImagesBella 1, renamed Marinera, was intercepted in the early hours of 7 JanuaryThe change of name and flag was designed to provide the tanker with a measure of international protection.Upping the ante further, Russia took the highly unusual step of requesting that the US call off its pursuit and said it had dispatched a submarine to escort the tanker, which was empty at the time. The Russian Foreign Ministry said there was not \"any basis\" to allege the tanker was sailing \"without a flag\" or \"under a false flag\".Undeterred by the possibility of an international incident or by the possible accusation of piracy on the high seas, the US intercepted the Marinera in international waters between Iceland and the UK in the early hours of 7 January.Getty ImagesThe Russian-flagged Marinera - seen in January in Burghead, Scotland - was wanted by the US for transporting sanctioned oil from both Venezuela and IranFor the first time, the UK got involved, sending an RAF surveillance aircraft and a Royal Navy support ship to help the operation.Defence Secretary John Healey said the action was \"in full compliance with international law\" and said the UK was \"stepping up activity against shadow vessels\".Perhaps spurred on by Washington's assertive approach, there is some evidence that European partners are willing to take more robust action too.Two weeks after the Marinera episode, France launched an operation in the Mediterranean to seize the Grinch, another Russia-linked tanker suspected of violating international sanctions.ReutersA French navy boat stopping the Grinch oil tankerOnce again, the UK was involved. A Royal Navy patrol boat, HMS Dagger, shadowed the Grinch, as it passed through the Strait of Gibraltar.With at least one sanctioned vessel passing through the English Channel every day, according to experts, speculation is mounting that the UK might soon conduct its own interceptions.Healey recently told MPs that \"further military options\" were being explored.For some, it can't come soon enough.\"There's obviously huge frustration in the policy-maker circles in Brussels and London that Russia is continuing to sell its oil,\" says Tom Keatinge, founding director of the Centre for Finance and Security at the Royal United Services Institute (Rusi) in London.Keatinge runs a maritime sanctions task force at Rusi, bringing together representatives from industry and government. Some participants, he sees, are keen to see more forthright action.\"We have people… who like jumping out of helicopters on ropes,\" he says. \"And that community has thus far been kept firmly in its box.\"He adds: \"Put bluntly, no one's had the balls to look at what is often a 50-50 call and say 'We'll send the boys in'.\" The MoD said: \"Deterring, disrupting and degrading the Russian shadow fleet is a priority for this government.\"But the constraints are considerable.\"You've got a bunch of consequences that you need to be ready to deal with,\" Keatinge says. \"The first is you've got an absolutely enormous vessel. What the hell do you do with that?\"Once seized, tankers need to be maintained, with engines running and a skeleton crew on board. The appetite for holding such vessels, particularly older ones that might pose an environmental risk, is minimal.The Marinera remains moored in the Moray Firth, with other US-seized vessels being held off the coast of Texas and Puerto Rico.\"If you look at the very high costs that the US is probably incurring at the moment to have two tankers off Houston, awaiting legal action, it's not something you take lightly,\" says Bockmann.A problem of resourcesThen there's the question of what to do with the oil itself.Again, Trump's approach is blunt: confiscate it.The president says 50 million barrels have been taken so far, as the US assumes control of Venezuela's oil industry.\"Venezuela is going to get some and we're going to get some,\" he said in a recent interview.The president's European allies are unlikely to follow suit.\"That would probably be a step too far for the Foreign Office,\" says Keatinge.So would Ukraine's increasingly direct approach. In recent months, Kyiv has targeted at least seven Russian shadow fleet tankers, using a variety of drones and mines.ReutersA Ukrainian sea drone shows the Dashan, a tanker part of Russia's so-called \"shadow fleet\", being struck by another sea drone in the Black SeaMost of Ukraine's attacks have been in the Black Sea, but one tanker, the Qendil, was hit and critically damaged while passing through the Mediterranean in December. Another tanker, the Mersin, was attacked and immobilised off the coast of Senegal in late November. Kyiv has not commented on reports that it carried out the attack.Most of the international effort so far has been more bureaucratic than kinetic: sanctioning hundreds of vessels, persuading countries such as The Gambia, Sierra Leone and Comoros, among others, to tighten their regulations, and addressing the issue of insurance.The number of falsely flagged ships globally more than doubled last year to over 450, according to the IMO, the BBC reported in November.Last year, the European Commission introduced new rules requiring all vessels entering EU waters to provide proof of insurance.The UK has a similar, voluntary reporting scheme, but shadow fleet vessels often ignore it or alter course when challenged.Ultimately, the sheer number of shadow vessels poses a simple problem of resources.But with Russian ships sometimes suspected of involvement in the monitoring or sabotage of undersea cables, there's an added national security dimension.In late January, the UK and thirteen other countries with Baltic and North Sea coastlines issued a coordinated warning that AIS manipulation, along with interference with Global Navigation Satellite Systems represented a growing threat to maritime safety and security.Vessels sailing under flags of convenience, the statement said, \"may be treated as a ship without nationality\", under the terms of the UN Convention on the Law of the Sea, a reminder to anyone paying attention that existing laws already provide for the detention and seizure of ships.Windward AI's Bockmann says the Trump administration's actions over Venezuela have shown European leaders what can be done.\"There's definitely a low threshold [for intervention] building for the darkest of the dark fleet,\" she says.More from InDepthThe net is gradually closing on Russian oil. Last October, the Trump administration imposed sanctions on the country's two largest oil companies, Lukoil and Rosneft.The EU's next sanctions package against Russia may include a full ban on maritime services, making it impossible for European tankers to transport Russian oil under the legal price cap currently in place.Around 30% of Russia's maritime oil exports are currently carried on EU-owned vessels.But for Russia and Iran, war and sanctions are the mothers of invention. As the net tightens, you can be sure that the world's burgeoning fleet of shadow vessels will continue to operate in the dark.Top picture: Getty ImagesBBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. Emma Barnett and John Simpson bring their pick of the most thought-provoking deep reads and analysis, every Saturday. Sign up for the newsletter here",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sanctions-busting shadow ships are increasing - the big question is what to do about them",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/37ac/live/9dd85410-0695-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-11T00:17:37.000Z",
      "dateModified": "2026-02-11T00:17:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Has Keir Starmer Saved His Job (For Now)? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n09735?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-02-10T20:50:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·10 Feb 2026,·44 minsHas Keir Starmer Saved His Job (For Now)?NewscastAvailable for over a yearToday, Keir Starmer says that he will \"never walk away from the country that I love” after surviving a turbulent 24 hours that saw the Scottish Labour leader Anas Sarwar call for him to step down. \nSpeaking to the BBC, his energy secretary Ed Miliband said the Labour Party had \"looked over the precipice” and decided to back their leader leading to a rallying of support from the cabinet and other senior party figures. \nSo, the Prime Minister is in the clear for now, but is he truly safe? Alex and James break down another turbulent 24 hours in Westminster before catching up with Daniela Relph senior royal correspondent and Caitríona Perry, BBC News chief presenter in Washington to discuss the wider fallout from the Epstein files in the US and for the royal family.  \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenters were James Cook and Alex Forsyth. It was made by Anna Harris with Shiler Mahmoudi and Chloe Scannapieco. The technical producer was Philip Bull. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Has Keir Starmer Saved His Job (For Now)? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-02-10T20:50:00.000Z",
      "dateModified": "2026-02-10T20:50:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential ch",
    "body": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Radical with Amol Rajan - Children in Care: How to Fix the Fostering Crisis (Louise Allen) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/m002q39v?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg",
    "tag": "Trending",
    "date": "2026-01-22T06:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·22 Jan 2026,·56 mins,·Available for over a yearAs the government prepares to introduce a strategy to boost fostering in England, Amol speaks to foster carer and author Louise Allen about the crisis in the system and what it will take to fix it.  \nAt the end of March 2024 there were 83,630 children in care in England, of whom 56,390 were being fostered, but there is a shortfall of around 6,000 foster carers nationwide. \nIn this episode Louise explains why we need to be more honest about the realities of caring for often vulnerable kids and focus on retaining foster carers rather than recruiting new ones.  \nShe also explains why there needs to be more practical support like providing a cleaner for every fostering household so that they can focus on emotionally supporting the children in their care. \n(00:03:10) Why is there a fostering crisis?\n(00:06:20) Why do we have so many children in care?\n(00:08:49) Louise's story: growing up in care\n(00:16:13) The effect of smartphones\n(00:20:08) Why is there a shortage of foster carers?\n(00:23:37) Why do people foster?\n(00:27:28) The recruitment process\n(00:30:33) Foster care v residential care\n(00:33:10) What is the fostering allowance?\n(00:39:09) Louise's RADICAL ideas\n(00:45:06) The government's fostering reforms\n(00:47:30) The importance of giving children social capital\n(00:52:19) Amol's reflections\nGET IN TOUCH \n* WhatsApp: 0330 123 9480 \n* Email: radical@bbc.co.uk \nEpisodes of Radical with Amol Rajan are released every Thursday and you can also watch them on BBC iPlayer: https://www.bbc.co.uk/iplayer/episodes/m002f1d0/radical-with-amol-rajan \nAmol Rajan is a presenter of the Today programme on BBC Radio 4. He is also the host of University Challenge on BBC One. Before that, Amol was media editor at the BBC and editor at The Independent. \nRadical with Amol Rajan is a Today Podcast. It was made by Lewis Vickers with Anna Budd. Digital production was by Gabriel Purcell-Davis. Technical production was by Dave O'Neill. The editor is Sam Bonham. The executive producer is Owenna Griffiths.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radical with Amol Rajan - Children in Care: How to Fix the Fostering Crisis (Louise Allen) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg"
      ],
      "datePublished": "2026-01-22T06:00:00.000Z",
      "dateModified": "2026-01-22T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Boy, 13, arrested over double stabbing at north London school",
    "url": "https://www.bbc.com/news/articles/cge8yxpj7e1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/96bf/live/88293a10-06b0-11f1-9a46-37f4a626eabd.jpg",
    "tag": "Trending",
    "date": "2026-02-11T01:25:46.000Z",
    "description": "Boy arrested for attempted murder after two pupils stabbed at school20 minutes agoJames W KellyLondonPA MediaOfficers arrived on the scene within 13 m",
    "body": "Boy arrested for attempted murder after two pupils stabbed at school20 minutes agoJames W KellyLondonPA MediaOfficers arrived on the scene within 13 minutes, the Met Police saidA 13-year-old boy has been arrested on suspicion of attempted murder after two boys were stabbed at a school in north-west London. Officers were called to Kingsbury High School at about 12:40 on Tuesday following reports a 13-year-old boy had been stabbed. Police say they were later made aware that a second victim, a 12-year-old boy, had also been stabbed at the scene. Both boys were taken to hospital, with one admitted to a major trauma centre as a priority. Officers said they were both believed to be in a serious condition.Counter-terror officers are leading the investigation but it has not been declared a terrorist incident, the Met Police said.Weapon recoveredDet Ch Supt Luke Williams said armed and local officers were at the scene within 13 minutes of the 999 call.The suspect, he said, left the scene following the stabbings but was later arrested.According to Williams, a weapon believed to have been used in the attack was recovered and the suspect remained in custody for questioning.Officers are not looking for anyone else in connection with the stabbings, the police spoksman told a press conference on Tuesday evening. \"This is a fast-moving and developing investigation,\" he added.\"At this very early stage, we are keeping an open mind as to any motivation behind this attack. However, due to the surrounding circumstances, the investigation is now being led by officers from Counter Terrorism Policing London, who are working closely with our local officers in response to this incident.\"He added: \"I absolutely recognise that this incident will cause considerable concern among the local community, students and parents. Our officers will remain in the area to offer support and answer any questions.\"PA MediaDet Ch Supt Luke Williams updated media at the school on Tuesday eveningAccording to witnesses quoted by the Daily Mail, the suspect is alleged to have shouted \"Allahu Akbar\", meaning \"God is greatest\" in Arabic, during the attack.Pupils, some of whom were in tears, and parents were still leaving the school on Tuesday evening after being spoken to by police.One father, whose child in year eight was kept in the school as a potential witness, said: \"They're holding up the kids who were in the class.\"The man, who did not wish to be named, added: \"Obviously, they must be traumatised by what happened in front of them.\"The head teacher of Kingsbury High School, Alex Thomas, said in a letter to parents and carers it had been a \"deeply traumatic event for the whole school community\".\"I am very sorry to inform you that there was a serious incident at school today in which two students were stabbed,\" he said. \"Our thoughts and best wishes are with our students and their families at this incredibly difficult time.\"'Deeply distressing'Home Secretary Shabana Mahmood said her thoughts and prayers were with the two pupils.She posted on X: \"A shocking attack at Kingsbury High School, where two children have been stabbed.\"My thoughts and my prayers are with them, their families and all those affected.\"The police have arrested the suspect, and I would like to thank them for their rapid work in doing so. We must now give them the space to pursue their investigation.\"Mayor of London Sir Sadiq Khan said there was \"no honour in staying silent\" as he urged anyone with information to contact the police.In the statement issued on Tuesday evening, Sir Sadiq said:  \"My thoughts are with the family, friends and wider community in Brent following the appalling stabbings today.\"He added: \"The Met have deployed significant resources to the area and I urge anyone with information to call police on 101 or Crimestoppers anonymously on 0800 555 111.\"Muhammed Butt, leader of Brent Council, said the double stabbing was \"deeply shocking and distressing\".\"No parent should ever have to fear for their child's safety at school, and it is horrifying to think of how someone so young came to be in possession of a weapon capable of causing such harm,\" he said.The Labour councillor thanked the emergency services and school staff for their \"swift response\" and said the council would offer its \"full and unlimited support\" to those affected.Kingsbury High School is an academy school serving children aged 11 to 18, with both upper and lower sites.According to the latest Department for Education information, it has 1,997 pupils.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Boy, 13, arrested over double stabbing at north London school",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/96bf/live/88293a10-06b0-11f1-9a46-37f4a626eabd.jpg"
      ],
      "datePublished": "2026-02-11T01:25:46.000Z",
      "dateModified": "2026-02-11T01:25:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ex-Labour comms chief Lord Doyle suspended over links to sex offender",
    "url": "https://www.bbc.com/news/articles/cqxdry8px2xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b680/live/12cc8ab0-0bbb-11f0-9ca8-c5035ea95420.png",
    "tag": "Trending",
    "date": "2026-02-10T22:54:10.000Z",
    "description": "3 hours agoJoe Pike,Politics investigations correspondentandJoshua Nevett,Political reporterAlamyLord Doyle, Sir Keir Starmer's former director of com",
    "body": "3 hours agoJoe Pike,Politics investigations correspondentandJoshua Nevett,Political reporterAlamyLord Doyle, Sir Keir Starmer's former director of communications, has been suspended from Labour's parliamentary party over his links with a convicted sex offender.The peer said he would not take the Labour whip and apologised for his past association with Sean Morton, a former Labour councillor in Moray who admitted indecent child image offences in 2017.It comes after the Sunday Times reported that Lord Doyle campaigned for Morton after he was charged with possessing and distributing indecent images of children in December 2016.\"At the point of my campaigning support, Morton repeatedly asserted to all those who knew him his innocence, including initially in court,\" Lord Doyle said.He added: \"To have not ceased support ahead of a judicial conclusion was a clear error of judgement for which I apologise unreservedly.\"Those of us who took [Morton] at his word were clearly mistaken. I have never sought to dismiss or diminish the seriousness of the offences for which he was rightly convicted. They are clearly abhorrent and I have never questioned his conviction.\"Following his conviction any contact was extremely limited and I have not seen or spoken to him in years. Twice I was at events organised by other people, which he attended, and once I saw him to check on his welfare after concerns were raised through others.\"Lord Doyle, a veteran Labour spin doctor who was the party's head of press between 1998 and 2005 before working for Lord Blunkett and Sir Tony Blair, was given a peerage by Sir Keir in December. He was sworn in as a member of the House of Lords last month. The Sunday Times first reported about Lord Doyle's campaigning for Morton in December last year and last week the Conservatives called for details of the peer's vetting to be published.A Labour Party spokesperson said: \"All complaints are assessed thoroughly in line with our rules and procedures.\"The party is undertaking an investigation and Lord Doyle's Labour whip in the House of Lords has been withdrawn while this is ongoing.Sir Keir faced questions about Lord Doyle's peerage on Monday during a meeting of the Parliamentary Labour Party, when the prime minister rallied MPs behind his leadership.Conservative leader Kemi Badenoch wrote to Sir Keir last week to call on him to \"explain why you appointed another friend of a child sex offender to a prestigious post\".It comes after the PM confirmed he had appointed Lord Mandelson to the role of US ambassador despite knowing about his friendship with convicted sex offender Jeffrey Epstein.The PM apologised to Epstein's victims for believing Mandelson's \"lies\" about the extent of his relationship with the financier.After Lord Doyle was suspended, Badenoch said the PM must \"come clean about what he was told\" before making Doyle a peer, adding: \"We won't let this go.\"Asked if Lord Doyle should remain a member of the House of Lords, Labour Party chair Anna Turley told Sky News: \"No, I don't think he should. That's my personal view.\"Getty ImagesPam Duncan-Glancy has stepped down as Scottish Labour's education spokesperson over her links to MortonLabour have also suspended the party whip in the Scottish Parliament from MSP Pam Duncan-Glancy.A Scottish Labour spokesperson said: \"All complaints are assessed thoroughly in line with our rules and procedures.\"Duncan-Glancy stood down as her party's education spokesperson in December and will quit the Scottish Parliament in May over her friendship with Morton.In December, she admitted a \"serious error of personal judgement\" after it emerged she maintained contact with the former Labour councillor following his 2017 conviction.The Daily Record has since reported that Duncan-Glancy continued her friendship with Morton after he was jailed for further offences and that he attended her birthday party late last year.Morton was jailed in January last year after pleading guilty to possessing indecent photographs of children and breaching his sexual offences order. He was given two 16-month sentences, backdated to May 2024.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ex-Labour comms chief Lord Doyle suspended over links to sex offender",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b680/live/12cc8ab0-0bbb-11f0-9ca8-c5035ea95420.png"
      ],
      "datePublished": "2026-02-10T22:54:10.000Z",
      "dateModified": "2026-02-10T22:54:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Noel Clarke arrested on suspicion of attempted rape, reports say",
    "url": "https://www.bbc.com/news/articles/cr45xkpegqzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/941a/live/c7deb940-06ac-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-10T20:43:18.000Z",
    "description": "5 hours agoNoor NanjiCulture correspondentPA MediaActor Noel Clarke has been arrested on suspicion of attempted rape, exposure and sexual assault by t",
    "body": "5 hours agoNoor NanjiCulture correspondentPA MediaActor Noel Clarke has been arrested on suspicion of attempted rape, exposure and sexual assault by touching, according to reports.The Doctor Who and Kidulthood star was questioned by detectives on Tuesday and bailed pending further inquiries.The Metropolitan Police said the arrest related to a sexual offence which is alleged to have taken place in 2007 in London against a woman in her 20s.According to the Sun newspaper, Clarke, 50, arrived at Islington police station in north London shortly after midday by appointment, accompanied by his wife and lawyer.BBC News has approached Clarke's representatives for a response.The Sun said the actor was arrested and questioned by detectives from the Met's Central Specialist Crime Command.A Met spokesperson said: \"A man in his 50s was arrested on suspicion of attempted rape, exposure and sexual assault by touching on Tuesday, 10 February. He was interviewed by detectives.\"This arrest relates to a sexual offence, which is alleged to have taken place in 2007 in London against a woman in her 20s.\"The man was also interviewed in relation to a voyeurism allegation, for which he was previously arrested in September 2025. This relates to an offence allegedly committed in 2013 at an address in London against a woman in her 20s.\"The man was bailed pending further enquiries and the Met's investigation continues.\"Career collapseClarke found fame playing Mickey Smith in Doctor Who between 2005 and 2010, and went on to become a successful actor, writer, producer and director.But his screen career collapsed in 2021 after the Guardian published accounts from several women who had worked with him, alleging sexual misconduct, which he denied.In August, Clarke lost his libel case against the Guardian, after he sued the newspaper's publisher. In September, a High Court judge ruled that Clarke must pay at least £3m of the Guardian publisher's legal costs.Clarke, who represented himself at the hearing, told the court he thought the Guardian's legal costs were excessive and should be reduced.But he is likely to have to pay even more in total after the Guardian told the court that a conservative estimate of its total costs was £6m.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Noel Clarke arrested on suspicion of attempted rape, reports say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/941a/live/c7deb940-06ac-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-10T20:43:18.000Z",
      "dateModified": "2026-02-10T20:43:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former Daily Mail editor tells hacking trial allegations are 'preposterous'",
    "url": "https://www.bbc.com/news/articles/cy03g54946ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4c18/live/947a4400-06a4-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-10T19:30:14.000Z",
    "description": "6 hours agoNick Johnson,Bruce ThainandImogen JamesPA MediaPaul Dacre started giving evidence on Tuesday, and will return to the High Court on Wednesda",
    "body": "6 hours agoNick Johnson,Bruce ThainandImogen JamesPA MediaPaul Dacre started giving evidence on Tuesday, and will return to the High Court on WednesdayFormer Daily Mail editor Paul Dacre has told the High Court he \"utterly refutes\" the \"preposterous\" allegations of unlawful newsgathering at the paper. Seven people, including Prince Harry and Sir Elton John, are suing Associated Newspapers Limited (ANL) - publisher of the Daily Mail and Mail on Sunday - for \"grave breaches of privacy\".  Dacre is the current editor-in-chief of DMG Media Ltd, the holding company of ANL, which denies all allegations of unlawful information gathering.He told the court he was \"angry and upset\" for his staff at the newspapers as the allegations had \"cast a dark shadow over their lives for the past three years\".On Tuesday Dacre was back in court, facing similar questions from the same barrister, David Sherborne, who is representing the seven claimants. Dacre told the trial that he \"wasn't aware\" of the extent of the paper's use of private investigators - who he referred to as \"inquiry agents\" - until around 2007 when he \"brought the shutters down\".Sherborne asked Dacre whether his involvement in the case \"is motivated by a desire to protect your legacy\" rather than getting a fair outcome. Dacre admitted wanting to clear his name, but also said he cared about the \"honest and dedicated\" staff at the paper.Regarding allegations that hacking and tapping phones was \"habitual and widespread\" at the Daily Mail, Dacre said: \"I utterly reject this. Such blatant illegality would not, I believe, have been countenanced at any level on the paper I edited.\"He added that he is sure if he was told there was evidence a journalist or agent had blagged information, he would \"have been pretty furious\". The \"sometimes preposterous allegations\" have \"in the small hours of the night – reduced me to rage\" he wrote in his witness statement, adding that they have had a \"deeply upsetting and, in some instances, traumatic impact\" on past and present Daily Mail staff. Another of the claimants, Baroness Lawrence, is the mother of the murdered black schoolboy Stephen Lawrence. When Stephen was murdered, the Daily Mail campaigned on her behalf.In her claim, Lawrence alleges that ANL targeted her with hidden electronic surveillance, tapped her phone and monitored her bank account.Dacre told the court on Tuesday that \"my heart bleeds for Doreen Lawrence\"In his statement he added Lawrence's claims in relation to the campaign \"are especially bewildering and bitterly wounding to me personally.\"At times, the atmosphere between Sherborne and Dacre was combative. At one stage, Sherborne suggested \"you choose to remember the things that might be helpful, and deliberately forget the things that might be unhelpful\".Right at the end of the day, Mr Justice Nicklin scolded Sherborne and said he was treating his questioning like a public inquiry. \"I don't consider the large bulk of questions to have any real relevance to the issues I have to decide,\" he added.Dacre will return to the Royal Courts of Justice on Wednesday to continue giving evidence. The trial before Mr Justice Nicklin is due to conclude in March. A written judgment is expected to be issued at a later date.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former Daily Mail editor tells hacking trial allegations are 'preposterous'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4c18/live/947a4400-06a4-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-10T19:30:14.000Z",
      "dateModified": "2026-02-10T19:30:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Under-fire Trump commerce secretary Howard Lutnick confirms he visited Epstein's island",
    "url": "https://www.bbc.com/news/articles/cwyx9vq0ne0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e71f/live/260ce6e0-06d0-11f1-a088-6db44f8964b4.jpg",
    "tag": "Trending",
    "date": "2026-02-10T20:05:05.000Z",
    "description": "6 hours agoAna Faguy and Brandon Drenonon Capitol HillWatch: Lutnick confirms his family had lunch with Epstein on a visit to the late sex offender's ",
    "body": "6 hours agoAna Faguy and Brandon Drenonon Capitol HillWatch: Lutnick confirms his family had lunch with Epstein on a visit to the late sex offender's islandUS Commerce Secretary Howard Lutnick has confirmed he visited Jeffrey Epstein's island in 2012, contradicting previous claims that he had cut ties with the sex offender years earlier, before he was convicted. \"I did have lunch with him as I was on a boat going across on a family vacation,\" Lutnick testified on Capitol Hill on Tuesday. \"My wife was with me, as were my four children and nannies … We had lunch on the island. That is true. For an hour.\"Correspondence about the visit was included in Epstein documents released by the US Department of Justice. Some lawmakers have called on Lutnick to resign, but on Tuesday the White House said he had the full support of US President Donald Trump.The commerce secretary had previously told Congress he cut ties with Epstein in 2005 after the late financier - a neighbour of Lutnick's in New York - used sexual innuendo to explain why he owned a massage table in a room of his home.In Tuesday's testimony, he said: \"Over the next 14 years, I met him two other times that I can recall.\" The justice department files show Lutnick visited Epstein's Caribbean island on 23 December, 2012. That came four years after Epstein was convicted for soliciting prostitution from a child. Lutnick's testimony on Capitol Hill marked the first time he publicly confirmed the visit.\"I don't recall why we did it, but we did it,\" he said Tuesday, referring to the lunch. Lutnick has not been accused of any wrongdoing in relation to Epstein.The other time, outside of meeting Epstein on his island, was a year and a half after that when Lutnick said he had an hour-long meeting with Epstein. Lutnick noted that within the millions of pages of Epstein documents released by the justice department, roughly 10 emails connect him with Epstein. \"Over a 14-year period, I did not have any relationship with him, I barely had anything to do with that person,\" he said. Senator Chris Van Hollen, a Democrat from Maryland, grilled Lutnick about the conflicting accounts.\"The issue is not that you engaged in any wrongdoing in connection with Jeffrey Epstein, but that you totally misrepresented the extent of your relationship with him, to the congress, to the American people and to the survivors of his despicable criminal and predatory acts,\" he said.Lutnick is among a series of high-profile people named in the more than 3.5 million documents that have been released by the justice department, as mandated by law. The revelation that he had visited Epstein's island long after he asserted that he had cut off contact has led to bipartisan calls for the commerce secretary to resign from the Trump administration. Democratic Congressman Ro Khanna and Republican Congressman Thomas Massie, who co-sponsored the law that compelled the justice department to release the Epstein files last year, have both urged Lutnick to step down. Getty ImagesLutnick says he \"did not have any relationship\" with Epstein Khanna and Massie are continuing to pursue further disclosure. After viewing unredacted copies of the files, Khanna revealed the names of six other people on Tuesday that he says were improperly blacked out. Massie said they are \"likely incriminated by their inclusion in these files\".The BBC is contacting the people for comment. While Lutnick was testifying on one side of Capitol Hill, survivors of Epstein abuse gathered on the other to announce Virginia's Law, legislation that aims to remove the time limit for survivors of sexual abuse to file civil claims.The legislation is named for Virginia Giuffre, who was one of the most well-known survivors of Epstein's sexual abuse. She died by suicide in 2025.Giuffre's sister-in-law Amanda Roberts said her wish was to eliminate the statute of limitations. \"No more laws that treat survivors as though time can erase harm,\" Roberts said, before adding: \"Pass Virginia's Law.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Under-fire Trump commerce secretary Howard Lutnick confirms he visited Epstein's island",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e71f/live/260ce6e0-06d0-11f1-a088-6db44f8964b4.jpg"
      ],
      "datePublished": "2026-02-10T20:05:05.000Z",
      "dateModified": "2026-02-10T20:05:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FBI releases images of masked person in hunt for Nancy Guthrie",
    "url": "https://www.bbc.com/news/articles/cy4wdgxr081o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6def/live/a79545d0-06ae-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-10T23:25:28.000Z",
    "description": "2 hours agoJessica MurphyWatch: New video shows masked person outside Nancy Guthrie's homeThe FBI has released images of a masked person in the hunt f",
    "body": "2 hours agoJessica MurphyWatch: New video shows masked person outside Nancy Guthrie's homeThe FBI has released images of a masked person in the hunt for news anchor Savannah Guthrie's mother.Officials are seeking to identify the individual, who they say was armed, more than  eight days after 84-year-old Nancy Guthrie disappeared from her home.Savannah Guthrie said on Tuesday her family believes their mother is still alive and issued a new appeal to anyone with information.Nancy Guthrie disappeared in the middle of night from her Tucson, Arizona, home and was last seen on 31 January. Authorities believe she was taken against her will.\"As of this morning, law enforcement has uncovered these previously inaccessible new images showing an armed individual appearing to have tampered with the camera at Nancy Guthrie's front door the morning of her disappearance,\" FBI Director Kash Patel said in a statement on X.He said authorities had been working to recover images from the home surveillance system that \"may have been lost, corrupted, or inaccessible due to a variety of factors - including the removal of recording devices\".  Officials also released two short videos showing the person approach the front door of Nancy Guthrie's home, then check the camera before moving away, picking up some vegetation from the ground and using it to cover the camera lens. Savannah Guthrie shared the new video on Instagram. \"Someone out there recognises this person,\" she said on Tuesday. \"We believe she is still out there. Bring her home.\"It marks the first major breakthrough in a case that has gripped the country.On Monday, police were still saying they had yet to identify any suspects or vehicles connected to Nancy Guthrie's disappearance, the same day that Savannah Guthrie issued a new video appeal to anyone with information.\"We believe our mum is still out there,\" she said in a video posted to her Instagram account. \"We need your help.\"It was the fourth video appeal released by the family in recent days, including one indicating they would be willing to pay for their mother's safe return.Police have said Nancy Guthrie needs daily medication and has limited mobility. The FBI is offering a $50,000 (£36,000) reward for information in the case.FBIFBIWhite House press secretary Karoline Leavitt said President Donald Trump has reviewed the footage. She said he encouraged people with any information to contact authorities. \"The prayers of this entire White House are with Savannah and her family at this time,\" she said. \"We hope this person is found soon and her mother is brought home safely.\"Last week, Pima County officials said the home's doorbell camera was disconnected at 01:47 local time and the camera's software had registered motion a short time after, at 02:12.At 02:28, the app on her pacemaker, an implanted cardiac device, disconnected from her phone.Police also said they had found blood on Nancy Guthrie's porch and analyses confirmed it was hers.Authorities have said there were taking seriously an email with a ransom note, sent to US media outlets and stating a Monday deadline, the BBC's US partner CBS reported.A previous apparent deadline for ransom, which was demanded in Bitcoin, passed on 5 February.It was one of three reported ransom notes sent in the case. Officials made one arrest last week in relation to a hoax ransom note. The doorbell camera at Guthrie's home has been identified in images as a Nest product, which is part of Google Home's range of devices.While law enforcement officials initially said that video of the incident was not available because Guthrie lacked a subscription for recorded video access, it appears that Google was able to pull footage from the doorbell around the time of her disappearance.Even without a paid subscription to Google Home, most owners of a Nest camera or doorbell have access to a live-stream of video, as well as up to three hours of imagery or footage of any incident captured by their device.A subscription allows a user to access weeks of recorded video from their doorbell camera.Given these functionalities, a Nest doorbell camera is essentially equipped to record constantly.In its privacy policy, and in a guide to security of its Nest products, Google says that video footage is sent to the company from all devices that have the camera turned on.Google did not respond to emails seeking comment on whether it had provided the footage in response to a warrant from investigators.It is unclear why this footage was not released sooner.Additional reporting by Kali Hays",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FBI releases images of masked person in hunt for Nancy Guthrie",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6def/live/a79545d0-06ae-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-10T23:25:28.000Z",
      "dateModified": "2026-02-10T23:25:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Winter Olympics 2026: Maxim Naumov Figure Skating USA",
    "url": "https://www.bbc.com/sport/videos/cx24yg2mm48o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/1e69/live/e67091a0-06aa-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-10T18:32:33.000Z",
    "description": "Maxim Naumov's emotional skate dedicated to his world champion figure skating  parents, Vadim Naumov and Evgenia Shishkova, who died in a plane crash ",
    "body": "Maxim Naumov's emotional skate dedicated to his world champion figure skating  parents, Vadim Naumov and Evgenia Shishkova, who died in a plane crash in January 2025.FOLLOW LIVE: Winter Olympics - Day FourAvailable to UK users only.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winter Olympics 2026: Maxim Naumov Figure Skating USA",
      "image": [
        "https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/1e69/live/e67091a0-06aa-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-10T18:32:33.000Z",
      "dateModified": "2026-02-10T18:32:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Biathlon medallist Sturla Holm Laegreid admits cheating on girlfriend",
    "url": "https://www.bbc.com/sport/articles/ckglnm521kko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0586/live/84f26820-06a7-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-10T17:19:20.000Z",
    "description": "Norwegian biathlete Sturla Holm Laegreid confessed on live television to cheating on his girlfriend moments after winning bronze in the Winter Olympic",
    "body": "Norwegian biathlete Sturla Holm Laegreid confessed on live television to cheating on his girlfriend moments after winning bronze in the Winter Olympics.The 28-year-old, who won his first individual Olympic medal in the 20km individual biathlon at Milan-Cortina, admitted he had an affair three months ago and called it \"my biggest mistake\".Laegreid said it had been \"the worst week of my life\" since he told his girlfriend of six months about the affair.\"There's someone I wanted to share it with who might not be watching,\" he told NRK, Norway's state broadcaster., external\"Six months ago I met the love of my life - the most beautiful and kindest person in the world. Three months ago I made my biggest mistake and cheated on her.\"I had the gold medal in life, and I am sure there are many people who will see things differently, but I only have eyes for her. \"Sport has come second these last few days. Yes, I wish I could share this with her.\"He later told Norwegian newspaper VG: \"My only way to solve it is to tell everything and put everything on the table, and hope that she can still love me.\"I've done that for her, and now for the whole world. I have nothing to lose.\"I want to be a good role model, but I have to admit when I make mistakes.\"The seven-time world champion finished third in the biathlon - which combines cross-country skiing and rifle shooting - behind champion Johan-Olav Botn, a fellow Norwegian, and Eric Perrot of France.It is a second Olympic medal for Laegreid, who won gold in the relay at the 2022 Games.Asked about his admission in the news conference later, he added: \"Of course, now I hope I didn't ruin Johan's day.\"I don't know if it was the right choice or not, but it was the choice I made.\"I made the choice to tell the world what I did so maybe there's a chance she will see what she really means to me - maybe not, but I don't want to think I didn't try everything to get her back.\"I don't want to steal the show. I hope this is just like a day-or-two thing. Then you are an Olympic gold medallist forever.\"Five-time Olympic champion Johannes Thingnes Boe, who is now a biathlete expert with broadcasters NRK, questioned the timing of Laegreid's admission.\"It came as a complete surprise. His action was wrong - we saw a repentant lad standing there. Unfortunately, the time, place and timing are all wrong,\" said Boe, a former team-mate of Laegreid.Botn shouted the name of late team-mate Sivert Guttorm Bakken as he crossed the line to win gold. Bakken was found dead on 23 December in a hotel room in northern Italy, about two hours from where the biathlon was held. \"I was racing with him the entire last loop. And, yeah, it was more like a feeling of crossing the finish line together, and seeing the number one beside my name was really special,\" an emotional Botn said.Laegreid added: \"We were five guys on the start line, and one of them was watching from above. This was for Sivert, really.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Biathlon medallist Sturla Holm Laegreid admits cheating on girlfriend",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0586/live/84f26820-06a7-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-10T17:19:20.000Z",
      "dateModified": "2026-02-10T17:19:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ex-police chief said Trump told him 'everyone' knew of Epstein's behaviour",
    "url": "https://www.bbc.com/news/articles/cx2407jrn83o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/205d/live/2f9455e0-068a-11f1-8eb8-1bf61d08e521.jpg",
    "tag": "Trending",
    "date": "2026-02-10T20:48:27.000Z",
    "description": "5 hours agoMadeline HalpertGetty ImagesTrump was once friendly with Epstein but says he cut off ties before Epstein's first criminal convictionA forme",
    "body": "5 hours agoMadeline HalpertGetty ImagesTrump was once friendly with Epstein but says he cut off ties before Epstein's first criminal convictionA former Florida police chief said he received a call from Donald Trump in 2006 in which the now-president told him \"everyone\" knows about the disgraced financier's behaviour, according to an FBI document released in the latest batch of Epstein files.The document is a written record of a 2019 FBI interview with the former Palm Beach police chief, who alleges Trump called him after the department launched an investigation into Epstein and said: \"Thank goodness you're stopping him, everyone has known he's been doing this.\"The officer's name is redacted, but the document identifies the interview subject as the Palm Beach police chief at the time of its Epstein investigation. That was Michael Reiter, who told the Miami Herald that he received the call from Trump.The president has consistently denied any wrongdoing in relation to Epstein and has said he did not know about his crimes. The alleged call, however, is likely to raise further questions about what Trump knew and when.Watch: Trump call with police chief \"may or may not have\" happened, Leavitt saysAsked by reporters in 2019 - when Epstein was arrested by federal agents for sex trafficking - if he had \"any suspicions\" about the disgraced financier, Trump said: \"No, I had no idea. I had no idea. I haven't spoken to him in many, many years.\"According to the FBI summary of the interview, Reiter said Trump told him in a July 2006 call that he had thrown Epstein out of his Mar-a-Lago club and \"people in New York knew he was disgusting\". Reiter also claims Trump told him Ghislaine Maxwell was Epstein's \"operative\", and \"she is evil and to focus on her\".Maxwell was convicted in 2021 for her role in luring underage girls for Epstein.Reiter also told the FBI that Trump said he was around Epstein when he was with teenagers and that he \"got the hell out of there\".According to the document, he said Trump was one of the \"very first people to call\" Florida police when he heard they were investigating Epstein. In 2006, Palm Beach police were investigating the disgraced financier for the alleged sexual exploitation of underage girls. The case was later turned over to federal prosecutors, who in 2008 made a controversial plea deal with Epstein that included a non-prosecution agreement that protected him from more serious charges.In a statement to the BBC, a justice department official said: \"We are not aware of any corroborating evidence that the president contacted law enforcement 20 years ago.\"At a briefing on Tuesday, White House press secretary Karoline Leavitt was asked about the reported call and said it \"may or may not have happened in 2006. I don't know the answer.\"\"What President Trump has always said is that he kicked Jeffrey Epstein out of his Mar-a-Lago club because Jeffrey Epstein was a creep,\" she said. \"And that remains true in this call. If it did happen it corroborates exactly what President Trump has said from the beginning.\"The BBC has also contacted Reiter for comment.Trump and Epstein socialised and appeared in photographs together in the 1990s, but the president and the White House have repeatedly said he was in the dark about Epstein's crimes before he broke off contact with him in around 2004 - years before he was first arrested.Trump has said their falling out came after he learned Epstein had been trying to \"steal\" his employees from Mar-a-Lago.\"When I heard about it, I told him, we don't want you taking our people,\" Trump said in July. \"He was fine and then not too long after that he did it again and I said 'outta here'.\"Reports of the alleged call came after Maxwell - who is serving a 20-year prison sentence for recruiting teenage girls to be sexually abused by Epstein - testified virtually before the US House Oversight Committee on Monday.During the closed-door deposition, Maxwell refused to answer questions and pleaded the Fifth Amendment, invoking her right to remain silent, Oversight Committee chairman James Comer said.Maxwell's lawyer claimed she was \"prepared to speak fully and honestly if granted clemency by President Trump\".Trump has said he has not thought about giving a pardon to Maxwell.Watch: Ghislaine Maxwell repeatedly invokes right to silence during congressional hearing",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ex-police chief said Trump told him 'everyone' knew of Epstein's behaviour",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/205d/live/2f9455e0-068a-11f1-8eb8-1bf61d08e521.jpg"
      ],
      "datePublished": "2026-02-10T20:48:27.000Z",
      "dateModified": "2026-02-10T20:48:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Small Prophets: Sir Michael Palin on his first TV acting role in seven years",
    "url": "https://www.bbc.com/news/articles/czd81vr9dmyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/29f9/live/fc098400-066d-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-10T11:26:27.000Z",
    "description": "'Funny, warm, and no car chases' - Michael Palin on his return to TV acting14 hours agoSteven McIntoshEntertainment reporterBBCSmall Prophets marks Si",
    "body": "'Funny, warm, and no car chases' - Michael Palin on his return to TV acting14 hours agoSteven McIntoshEntertainment reporterBBCSmall Prophets marks Sir Michael's first TV acting role since 2019's Worzel GummidgeSir Michael Palin has said he was attracted to the \"humour and magic\" of Small Prophets - the new BBC drama that marks his first TV acting role in seven years. Critics have heaped praise on the new comedy series from Detectorists creator Mackenzie Crook, which follows a man who creates tiny creatures capable of foretelling the future and answering any question.Sir Michael said he was attracted to the series because it \"deals with people in a very empathetic, human way\".\"This is not a story where you'll have car chases and people wanting to kill each other,\" he told BBC Radio 4's Today. \"There's a warmth in the way [Crook] writes about people.\"Every single character in this series, gets their moment, however small it might be, it might be two lines or one line, and that line is thought out, careful, and is given to the actor as something special,\" he continued.\"So what Mackenzie does is a very personal kind of writing, where if you like it, it's just the best of all to do, because it's so sympathetic to people.\"Lauren Patel (left) and Pearce Quigley also star in Small ProphetsSmall Prophets centres on Michael Sleep (played by Pearce Quigley), whose partner Clea vanished seven years ago. After a tip-off from his elderly father, played by Sir Michael, he begins cooking up an ancient recipe involving rain water, horse manure, and a little alchemy, to create folkloric creatures who can predict the future.\"They are called homunculi,\" explained Sir Michael, \"which I don't think anybody knows anything about, apart from Mackenzie.\"[He] found them in a book somewhere that there was proof that many many years ago, a man had found a recipe to create little people in jars - a magical alchemist.\"Sleep hopes he can help him find his wife. \"So what seems a very strange thing, becomes magical and quite helpful and improving, and helps him in his quest for his lost partner,\" Sir Michael explained. The series follows Michael (played by Quigley) as he attempts to create small creatures in jarsSmall Prophets marks the actor and presenter's first TV acting role since playing the green man in Worzel Gummidge, which was also written and directed by Crook. The former Monty Python star described Crook as a \"marvellous writer, one of the most original\".He said Crook's latest series is \"quite incisive, it's not dreamy, he writes very funny lines, very tart and quite sardonic in their way\".\"It's all about life in the suburbs of south Manchester, and he can find in that world an amazing amount of humour and magic, and good people doing very funny things.\"Five-star reviews\"If there is a message or a moral, it is that there are still wonderful things at hand in a world that might seem like it is running out of them,\" he said.\"The existence of Small Prophets proves the point: that British telly can still create impossible marvels like this is a reason to keep believing in magic.\"\"Even if this didn't have a supernatural storyline, Crook is already a magician, someone whose joyous storytelling can make you feel strangely and intensely alive,\" he said.The blending of the mundane and the magical \"may not suit every palate\", said the Telegraph's Anita Singh in her four-star review, \"but this is clearly a labour of love for Crook.\" \"Admittedly, some components jar – a cackling colleague at the DIY store feels misplaced, and the final instalment of the six-part series takes an unwanted detour into horror. \"However, Quigley is wonderful; a character in whose company one would happily while away the hours.Also awarding four stars, the Independent's Patrick Smith advised readers: \"If the show's magical realism gives you pause, don't be put off: you'll be rewarded with something funny, strange, and surprisingly accessible. \"Like Detectorists before it, this is a series that wrings emotion from the commonplace and everyday – only this time, the treasure Crook has buried is altogether more peculiar. Small Prophets brings large returns.\"Small Prophets is available now on iPlayer. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Small Prophets: Sir Michael Palin on his first TV acting role in seven years",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/29f9/live/fc098400-066d-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-10T11:26:27.000Z",
      "dateModified": "2026-02-10T11:26:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Spike in antisemitic incidents after Manchester synagogue attack",
    "url": "https://www.bbc.com/news/articles/cjd95r4lyvko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cd93/live/f4bb24d0-06a2-11f1-8d5d-7d6caf00f484.jpg",
    "tag": "Trending",
    "date": "2026-02-11T00:10:17.000Z",
    "description": "Spike in antisemitism reports after synagogue attack2 hours agoNatasha PreskeyandJonny Humphries,North WestGetty ImagesTributes were left at the scene",
    "body": "Spike in antisemitism reports after synagogue attack2 hours agoNatasha PreskeyandJonny Humphries,North WestGetty ImagesTributes were left at the scene in Manchester following the deadly attack on a synagogueReports of antisemitism incidents in the UK spiked after the deadly Manchester synagogue attack last year. The volunteer-run Community Security Trust (CST), which provides security and monitors antisemitism in the UK, said 40 incidents were recorded on the day of the attack and 40 the day after - the highest daily totals of 2025.Worshippers Melvin Cravitz and Adrian Daulby were killed on 2 October when Jihad Al-Shamie drove into the gates of the Heaton Park Synagogue in Manchester and began attacking with a knife, while wearing a fake suicide belt.The CST said more than half of the incidents it recorded across both days involved direct reactions to the attack, including celebrating it. Of these 42 incidents, three involved \"face-to-face taunting and celebration of the attack to Jewish people\", and 39 took place online. These included antisemitic social media posts referencing the attack, abusive responses to public condemnations of the attack from Jewish organisations and individuals, or antagonistic emails sent to Jewish people and institutions.The killings in Manchester were the first fatal antisemitic terror attack in the UK since the CST began recording incidents in 1984.According to the CST report, there were 3,700 anti-Jewish hate incidents recorded in 2025, up 4% from 3,556 in 2024. Last year saw the second highest annual total ever, second only to 2023 when there were 4,298. The total for 2023 included 416 incidents in the week following Hamas's 7 October attacks on Israel - a larger number than any subsequent week.Though 2023 saw the highest total number of incidents, last year was the first time more than 200 cases of anti-Jewish hate were recorded in every calendar month.Last year also saw the highest ever recorded number of cases of damage and desecration to Jewish property - including damage to the homes and vehicles of Jewish people and to synagogues.There were 217 such incidents in 2025, up 38% from 157 in 2024.CST chief executive Mark Gardner described the attack in Manchester as the culmination of \"two years of intense anti-Jewish hatred\".He said: \"The terror attack then triggered even more antisemitism, showing the depths of extremism faced by Jews and all our British society.\"Chief Constable Mark Hobrough, the national policing lead for hate crime, said 2025 had seen \"unacceptably high\" levels of antisemitic hate.He added: \"The tensions that exist in our society have not abated and are both deeper and more long-standing than anything we have experienced in modern times.\"The CST said there was also a spike in reports on the day of the Bondi Beach killings in Sydney in December, and on the two following days.Of the 50 incidents across those three days, just under half (21) directly referenced the Bondi attack, the CST said.PAJihad Al-Shamie pledged allegiance to the so-called Islamic State group after attacking the Heaton Park Congregation synagogueLord John Mann, the government's independent adviser on antisemitism, said it was \"particularly troubling\" to see the large number of incidents that had taken place immediately after the Manchester attack. Overall, he said the latest figures were \"deeply alarming and illustrate the unrelenting nature of antisemitism in our country today\".Home Secretary Shabana Mahmood said the latest numbers were \"shocking\" and the government \"stands against the scourge of antisemitism\".She added: \"We are providing record funding for security at synagogues, Jewish schools and community centres. I will go further to strengthen police powers so they can crack down on intimidating protests.\"Shadow home secretary Chris Philp said while the figures were \"appalling\" they were \"not a surprise\" and said the \"evil of antisemitism\" must be called out.He added: \"Anyone espousing extremist views or who expresses support for terrorism, or racial or religious hatred of any kind, including antisemitism, who is not a British citizen, should be removed from this country.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Spike in antisemitic incidents after Manchester synagogue attack",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cd93/live/f4bb24d0-06a2-11f1-8d5d-7d6caf00f484.jpg"
      ],
      "datePublished": "2026-02-11T00:10:17.000Z",
      "dateModified": "2026-02-11T00:10:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]