[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential ch",
    "body": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Starmer’s Fight For Survival - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n03j41?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-02-09T21:59:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·09 Feb 2026,·34 minsAvailable for over a yearToday, Keir Starmer has addressed his MPs and seems to have rallied some support after Scottish Labour leader Anas Sarwar called for him to quit.\nIn a press conference in Glasgow, Sarwar emphasised his concerns for Scotland ahead of the May elections, and told reporters “the leadership in Downing Street has to change\". \nThe move prompted statements supporting the prime minister from cabinet ministers and other key labour figures including potential rivals Angela Rayner and Wes Streeting.\nThe PM has been facing mounting pressure in recent days with two of his top aides Tim Allen and Morgan McSweeney resigning following the aftermath of revelations about the appointment of former US ambassador Peter Mandelson. \nJames and Alex are in for Adam to talk through what it all mean.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenters were Alex Forsyth and James Cook. It was made by Anna Harris with Shiler Mahmoudi, Chloe Scannapieco and Sophie van Brugen. The technical producer was Hannah Montgomery. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Starmer’s Fight For Survival - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-02-09T21:59:00.000Z",
      "dateModified": "2026-02-09T21:59:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Two boys stabbed at Kingsbury High School in Barnet, London",
    "url": "https://www.bbc.com/news/articles/cge8yxpj7e1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7ed9/live/97e3a760-069c-11f1-8d5d-7d6caf00f484.png",
    "tag": "Trending",
    "date": "2026-02-10T16:56:02.000Z",
    "description": "Hunt on for teen after two boys stabbed at school18 minutes agoJames W KellyLondonGooglePolice were called to Kingsbury High School at about 12:40 GMT",
    "body": "Hunt on for teen after two boys stabbed at school18 minutes agoJames W KellyLondonGooglePolice were called to Kingsbury High School at about 12:40 GMTAn urgent search is taking place for a teenager suspected of stabbing two boys who were injured at a school in north-west London, the Met Police has said.Officers were called to Kingsbury High School at about 12:40 GMT following reports a 13-year-old boy had been stabbed. Police said they were later made aware that a second victim, a 12-year-old boy, had also been stabbed at the scene.Both boys were taken to hospital by the London Ambulance Service, with one taken to a major trauma centre as a priority. Police said they were awaiting an update on their condition.'Significant resources'Det Ch Supt Luke Williams said the stabbings would cause \"considerable concern\" locally.\"We want to reassure local students, parents and residents that we have deployed significant resources to the area and are doing everything we can to locate the suspect,\" he said.Williams added: \"Our thoughts are with the injured boys and I want to thank the paramedics and doctors who are providing them both with care.\"Kingsbury High School said in a statement: \"We want to make you aware that there has been a serious incident at Kingsbury High School today. \"We are working closely with the relevant authorities and following all necessary procedures.\"The situation is now under control, and we have already spoken directly with the parents and carers of the students involved.\"We understand that this will be concerning. At present, it is not possible to enter or leave the school site while the response continues. We will provide further updates as soon as we are able to share confirmed information.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two boys stabbed at Kingsbury High School in Barnet, London",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7ed9/live/97e3a760-069c-11f1-8d5d-7d6caf00f484.png"
      ],
      "datePublished": "2026-02-10T16:56:02.000Z",
      "dateModified": "2026-02-10T16:56:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chappell Roan leaves talent agency led by Casey Wasserman after Epstein fallout",
    "url": "https://www.bbc.com/news/articles/cewz1keql5no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e697/live/9d4f8590-0654-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-10T07:12:36.000Z",
    "description": "10 hours agoTabby WilsonGetty ImagesSinger Chappell Roan says she has left the talent agency led by Casey Wasserman, whose name appears in the Epstein",
    "body": "10 hours agoTabby WilsonGetty ImagesSinger Chappell Roan says she has left the talent agency led by Casey Wasserman, whose name appears in the Epstein files.Announcing her split with the agency, Roan said she has a \"duty to protect her team\" and her decision reflected her belief that \"meaningful change in our industry requires accountability\".Wasserman has been criticised after his flirtatious emails to Ghislaine Maxwell, sent in 2003, were revealed among the millions of files published in relation to convicted paedophile Jeffrey Epstein. Roan made no mention of Epstein, nor the Epstein files, in her statement on Instagram announcing her departure.\"As of today, I am no longer represented by Wasserman, the talent agency led by Casey Wasserman,\" she said. Roan added: \"No artist, agent or employee should ever be expected to defend or overlook actions that conflict so deeply with our own moral values.\" The BBC has reached out to Wasserman for comment.Wasserman is also the chairman of the Los Angeles 2028 Olympic Games, and has faced calls to step down from the position following the release of the emails.He said in a statement that his correspondence with Maxwell \"took place over two decades ago, long before her horrific crimes came to light\".Who is in the Epstein files?Wasserman also emphasised that he had \"never had a personal or business relationship with Jeffrey Epstein\".\"As is well documented, I went on a humanitarian trip as part of a delegation with the Clinton Foundation in 2002 on the Epstein plane,\" he said.\"I am terribly sorry for having any association with either of them.\"Wasserman has not been accused of wrongdoing by any of Epstein's victims, and the appearance of his name in the files does not imply criminal activity of any kind.Roan's announcement comes after two other bands represented by Wasserman released statements indicating they wanted to distance themselves from his agency.Wednesday, a self-described indie rock band, said they were \"aghast\" to see Wasserman feature in the Epstein files and did not want to continue to be associated with him. They said that they hoped he would step down \"for the sake of his staff\".Rock band Beach Bunny said they were \"hugely disappointed and disgusted\" that Wasserman \"had involvement with Ghislaine Maxwell\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chappell Roan leaves talent agency led by Casey Wasserman after Epstein fallout",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e697/live/9d4f8590-0654-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-10T07:12:36.000Z",
      "dateModified": "2026-02-10T07:12:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Radical with Amol Rajan - Children in Care: How to Fix the Fostering Crisis (Louise Allen) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/m002q39v?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg",
    "tag": "Trending",
    "date": "2026-01-22T06:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·22 Jan 2026,·56 mins,·Available for over a yearAs the government prepares to introduce a strategy to boost fostering in England, Amol speaks to foster carer and author Louise Allen about the crisis in the system and what it will take to fix it.  \nAt the end of March 2024 there were 83,630 children in care in England, of whom 56,390 were being fostered, but there is a shortfall of around 6,000 foster carers nationwide. \nIn this episode Louise explains why we need to be more honest about the realities of caring for often vulnerable kids and focus on retaining foster carers rather than recruiting new ones.  \nShe also explains why there needs to be more practical support like providing a cleaner for every fostering household so that they can focus on emotionally supporting the children in their care. \n(00:03:10) Why is there a fostering crisis?\n(00:06:20) Why do we have so many children in care?\n(00:08:49) Louise's story: growing up in care\n(00:16:13) The effect of smartphones\n(00:20:08) Why is there a shortage of foster carers?\n(00:23:37) Why do people foster?\n(00:27:28) The recruitment process\n(00:30:33) Foster care v residential care\n(00:33:10) What is the fostering allowance?\n(00:39:09) Louise's RADICAL ideas\n(00:45:06) The government's fostering reforms\n(00:47:30) The importance of giving children social capital\n(00:52:19) Amol's reflections\nGET IN TOUCH \n* WhatsApp: 0330 123 9480 \n* Email: radical@bbc.co.uk \nEpisodes of Radical with Amol Rajan are released every Thursday and you can also watch them on BBC iPlayer: https://www.bbc.co.uk/iplayer/episodes/m002f1d0/radical-with-amol-rajan \nAmol Rajan is a presenter of the Today programme on BBC Radio 4. He is also the host of University Challenge on BBC One. Before that, Amol was media editor at the BBC and editor at The Independent. \nRadical with Amol Rajan is a Today Podcast. It was made by Lewis Vickers with Anna Budd. Digital production was by Gabriel Purcell-Davis. Technical production was by Dave O'Neill. The editor is Sam Bonham. The executive producer is Owenna Griffiths.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radical with Amol Rajan - Children in Care: How to Fix the Fostering Crisis (Louise Allen) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg"
      ],
      "datePublished": "2026-01-22T06:00:00.000Z",
      "dateModified": "2026-01-22T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Marc Anthony says Beckham family feud is 'unfortunate' but 'hardly the truth'",
    "url": "https://www.bbc.com/news/articles/c98gyegzypxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7203/live/8b6affc0-067d-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-10T13:32:09.000Z",
    "description": "3 hours agoSteven McIntoshEntertainment reporterGetty ImagesSinger Marc Anthony has described the Beckham family rift as \"extremely unfortunate\", but ",
    "body": "3 hours agoSteven McIntoshEntertainment reporterGetty ImagesSinger Marc Anthony has described the Beckham family rift as \"extremely unfortunate\", but added that the way it has played out is \"hardly the truth\".The 57-year-old performed at Brooklyn and Nicola Peltz Beckham's wedding reception in 2022, and is a close friend of the wider family. But Brooklyn recently said the way the couple's first dance was handled at the wedding left him feeling \"uncomfortable and humiliated\", after Anthony reportedly called for him to dance with his mother instead of his wife. Beckham added that his mother then danced \"very inappropriately\" on him. Sir David and Lady Beckham have not commented since Brooklyn published his statement. \"I've known them since before the kids were born. I'm godfather to Cruz. I'm really close to the family. But I have nothing to say about what happened there.\"He added: \"It's extremely unfortunate how it's playing out - but [how it's playing out] is hardly the truth.\"Getty ImagesMarc Anthony is a long-term friend of the Beckham family and godfather to Cruz (pictured in 2023)He accused his parents of trying to \"ruin my relationship\" with Peltz, adding that he had no wish to reconcile with his family.The 26-year-old also said his mother had \"hijacked\" his first dance with Peltz, which had been \"planned weeks in advance to a romantic love song\".\"In front of our 500 wedding guests,\" he continued, \"Marc Anthony called me to the stage, where in the schedule was planned to be my romantic dance with my wife but instead my mum was waiting to dance with me instead.\"\"She danced very inappropriately on me in front of everyone. I've never felt more uncomfortable or humiliated in my entire life.\"After speculation about the nature of Lady Beckham's dancing, Fat Tony clarified: \"There was no slut-dropping, there was no black cat PVC catsuits, there was no Spice Girl action.\"Fat Tony claimed Marc Anthony had called for \"the most beautiful woman in the room\" to come up for the first dance with Brooklyn, but then said Lady Beckham's name instead of Nicola's. The DJ said this led to the bride running out of the room in tears.Sir David and Lady Beckham have not responded to repeated requests for comment on the claims in their eldest son's statementHowever, when asked about young people and their social media use in Davos last month, Sir David remarked that children are \"allowed to make mistakes\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Marc Anthony says Beckham family feud is 'unfortunate' but 'hardly the truth'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7203/live/8b6affc0-067d-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-10T13:32:09.000Z",
      "dateModified": "2026-02-10T13:32:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Macron urges Europe to start acting like world power",
    "url": "https://www.bbc.com/news/articles/ce8n1zdnpd3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4846/live/9de81f70-067d-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-10T11:12:08.000Z",
    "description": "6 hours agoHugh SchofieldParisAFP via Getty ImagesEmmanuel Macron warned that \"today Europe faces a massive challenge, in a world of disorder\"French P",
    "body": "6 hours agoHugh SchofieldParisAFP via Getty ImagesEmmanuel Macron warned that \"today Europe faces a massive challenge, in a world of disorder\"French President Emmanuel Macron has urged Europe to assert itself on the world stage, saying it is time to start acting like a \"power\".In the face of growing threats from China, Russia and now the US, he told a group of European newspapers that the continent faced a \"wake-up call\".\"Are we ready to become a power? This is the question in the field of economy and finance, in defence and security, and in our democratic systems. \"In another era we might have said it is the moment to 'assume our majority',\" he said ahead of an EU summit in Brussels later this week.Macron repeated his call for EU-wide mutualised loans in order to raise hundreds of billions of euros needed for industrial investment.\"The time has come to launch a shared debt capacity to fund our future expense -  eurobonds for the future. We need big European programmes to finance the best projects,\" he said.Similar calls in the past have met scepticism from Germany and other countries, who feel France wants to use Europe to bear a financial burden which it alone - because of its failure to reform - is unable to take up.Macron admitted that France \"has never had a balanced model, unlike certain economies of the north, which are built more on a sense of responsibility. \"And we have never had reforms like the ones initiated in the 2010s in Portugal, Spain, Italy and Greece, which are paying dividends today.\"But he said there was growing demand in the world's financial markets for mutualised European debt, which currently the EU was not equipped to supply.\"The world markets are increasingly afraid of the American greenback [dollar]. They want alternatives… \"For investors everywhere a democratic state of law is a huge attraction. And when I look at the world as it is, we have the authoritarian regime that is China, and on the other side we have the US distancing itself further and further from a state of law.\"According to Macron, the 27-member EU needs €1,2tn (£1tn; $1.4tn) a year to invest in the vital sectors of security and defence, clean energy, and artificial intelligence.Calling on the EU to \"protect\" these and other industries, he said: \"The Chinese do it, the Americans too.  Europe today is the most open market in the world.\"In the face of that, I am not saying we should be protectionist. It's more a question of being coherent - in other words not imposing on our own producers rules which we do not impose on non-Europeans.\"\"Today Europe faces a massive challenge, in a world of disorder,\" he said.\"Climate change is accelerating. The US – which we thought would guarantee our security for ever – is no longer sure. Russia was to give us cheap energy for ever, but that stopped three years ago. China... has become a rival that gets fiercer and fiercer.\"Today, we Europeans are on our own. But we have each other. We are 450 million people. It's huge. For me [becoming a power] is the fulfilment of the European adventure.\"We came together to stop war, we came together to build a market. But we always forbade ourselves to think of power.\"Asked about the latest stand-off with Washington over Greenland, at the end of which US President Donald Trump appeared to back down from threats to annex the Danish territory,  Macron said the Europeans should not be fooled.\"At the end of a crisis, there is a cowardly tendency to sit back and say 'phew'. There are threats and intimidation, and then suddenly Washington gives way. And people think it's over.\"Don't believe it for a single second,\" the French leader said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Macron urges Europe to start acting like world power",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4846/live/9de81f70-067d-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-10T11:12:08.000Z",
      "dateModified": "2026-02-10T11:12:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man found guilty of murdering five-month-old baby in Swansea",
    "url": "https://www.bbc.com/news/articles/c5yqwepn9zeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1821/live/89135220-0693-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-10T15:43:30.000Z",
    "description": "Man convicted of killing baby boy after 'violent shaking'1 hour agoSara DafyddBBC Wales Family photoJensen-Lee's brain injury was described by neurosu",
    "body": "Man convicted of killing baby boy after 'violent shaking'1 hour agoSara DafyddBBC Wales Family photoJensen-Lee's brain injury was described by neurosurgeons as \"devastating\"Warning: This article contains distressing detailsA 29-year-old man has been found guilty of murdering his partner's five-month-old baby.Jensen-Lee Dougal, who was described as a \"happy baby\" adored by his family, died on 31 March 2024 after suffering catastrophic brain injuries at the hands of Thomas Morgan.He had been looking after Jensen-Lee when he violently shook the baby while \"full of rage\" following an abusive text exchange with an ex-girlfriend.The jury at Swansea Crown Court watched \"horrific and unforgettable\" CCTV of a \"limp and lifeless\" Jensen-Lee being carried out of their home on Players Avenue, Clydach, Swansea, in the arms of Morgan.Jensen-Lee's injuries included catastrophic brain injuries, multiple fractures and haemorrhaging behind his eye.Evidence of rib fractures was also found, while Jensen-Lee's brain injury was described by neurosurgeons as \"devastating\".Expert witnesses told the court the injuries sustained by the baby were among the worst they had ever seen.Neighbours in Clydach tried to help Morgan after he came out of the house with Jensen-Lee in his armsDuring the four-week trial the jury heard distressing evidence about how Jensen-Lee was violently shaken.Morgan was regarded as Jensen-Lee's stepfather after starting a relationship with mother Jordan Dougal and moving into the family home in mid-January 2024.Jordan Dougal said her son was \"a really happy baby\" and that she \"never had any issues\" with Morgan caring for her son, adding she thought she had found their family.Morgan was described by Jordan Dougal as being \"brilliant\" with her son and his own two children.Morgan did not immediately call 999, instead he rang his partner.He then told neighbours to call 999, and Judge Justice Stacey paid tribute to those who performed CPR while waiting for the ambulance.Caroline Rees KC, prosecuting, said: \"Morgan has spun a web of lies and deceit in an attempt to cover up his guilt.\"'Worst injuries experts had ever seen'Professor Stavros Stivaros from Royal Manchester Children Hospital, said there was catastrophic bleeding to Jensen-Lee's brain as well as the spinal cord even though there were no outward signs of any injuries.He said the shaking would have been so violent that anybody witnessing a baby being shaken like that from across a street would have immediately crossed the road  to stop it happening.The doctor also said Jensen-Lee would have been rendered unconscious almost immediately by the severity of the shaking, and it could not be as a result of rough play or an attempt at resuscitation.Jordan Dougal told the court: \"He would just be stuck to a machine for the rest of his life,\" adding, \"I didn't want to remember him like that when he was such a happy baby.\"Morgan, from Gorseinon, showed no emotion from the dock as the verdict was read out. There were cries from the public gallery from Jensen-Lee's family as the jury gave their unanimous verdict.Judge Justice Stacey thanked the jury during an \"awful trial\" describing it as \"the saddest of all cases\".She also thanked barristers and the police for their work, as well as Jensen-Lee's family who have sat through the trial.Morgan was also found guilty of one count of causing grievous bodily harm with intent, but found not guilty on two counts of the same charge.He will be sentenced on 25 February.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man found guilty of murdering five-month-old baby in Swansea",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1821/live/89135220-0693-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-10T15:43:30.000Z",
      "dateModified": "2026-02-10T15:43:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Skilled butcher' guilty of murdering, cutting up and burying partner in Derby",
    "url": "https://www.bbc.com/news/articles/cq6qr37z0reo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7bf5/live/42cc8d60-0678-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-10T12:41:29.000Z",
    "description": "'Skilled butcher' murdered, cut up and buried partner4 hours agoGeorge TorrDerbyDerbyshire PoliceAnna Podedworna was convicted of murder by a jury on ",
    "body": "'Skilled butcher' murdered, cut up and buried partner4 hours agoGeorge TorrDerbyDerbyshire PoliceAnna Podedworna was convicted of murder by a jury on TuesdayA \"skilled butcher\" has been found guilty of murdering her partner before cutting her body in two and burying her remains in the back garden of a house more than 15 years ago.Izabela Zablocka was first reported missing in 2010, and her remains were found buried in Princes Street, Derby, on 1 June 2025.The discovery came, Derby Crown Court heard, after Anna Podedworna, 40, of Boyer Street in Derby, contacted Derbyshire Police last year, telling them the body would be found there. Prosecutor Gordon Aspden KC said \"mounting pressure\" caused Podedworna to \"crack\" and email the police last year when a Polish television journalist flew to the UK to interview her.Warning: This article contains details that some readers may find distressingOn Tuesday, Podedworna was convicted of murder by a jury, as well as perverting the course of justice and preventing a lawful burial.Podedworna showed no emotion when the jury returned their verdict, after deliberating for seven hours and six minutes.She will be sentenced on Wednesday.Derbyshire PoliceIzabela Zablocka's remains were discovered in a garden - almost 15 years after she was reported missingThe jury was told the two women had moved to the UK together from Poland in search of work and lived in the Normanton area of Derby.The prosecution said Zablocka phoned her mother in Poland on 28 August 2010 and was not heard from again.Aspden said shortly after this call, Zablocka was murdered by Podedworna, who \"dismembered Izabela's body by cutting it in half with a large knife\".Police discovered the defendant had previously been employed as a \"skilled butcher\", and her work involved \"deboning, and portioning out turkey carcasses using a large knife\".The court heard the body was buried in the back garden, before concrete hardstanding was then laid over the top.The jury was also told Podedworna emailed police on 21 May 2025, saying she wished to provide evidence in relation to Zablocka's disappearance. Zablocka's body was buried in her back garden, before concrete was laid over the top, the court heardShe told officers three days later they would find her body buried in the garden in Princes Street, the court heard.But Podedworna claimed Zablocka died by \"accident\" during a violent confrontation, and claimed she ended up killing her partner in \"self-defence\". The jury was told \"considerable force\" would have been needed to cut Zablocka's body in half, and that electrical tape had been used to bind her legs together before she was buried.Aspden said it was not known why Zablocka was murdered, but there was \"evidence of sexual jealousy\" between her and Podedworna.He described their relationship as \"a stormy and turbulent one\".The court heard men had found Podedworna sexually attractive, which \"caused suspicion, jealousy, and conflict\" in her relationship with Zablocka.Kasia, the victim's daughter who was still living in Poland when Zablocka went missing, told police she believed her mother wanted to undergo gender reassignment surgery but could not afford to, Aspden said.Zablocka was reported missing by her family to UK police in November 2010 and then to police in Poland in January 2011, the court heard.In 2024, Zablocka's daughter, now an adult, contacted Polish organisation Missing for Years, who contacted Podedworna via Facebook.Podedworna claimed that she did not know where Izabela was and that she did not know what had happened to her.A year later in May 2025, Rafal Zalewski - a Polish TV journalist - requested an interview with Podedworna, which the court heard \"proved to be a tipping point\".Derbyshire PoliceZablocka's daughter Kasia was still living in Poland when her mother went missingDet Insp Kane Martin, of Derbyshire Police, said Podedworna was \"a self-proclaimed, deceitful and manipulative liar\".He added the killer's \"chilling account\" to police and subsequently the jury, was \"vague and emotionless\".He said: \"She clearly thought her careful and considered disposal of Izabela and the lies she told in the years that followed would help her to avoid responsibility for what she had done.\"Having cut Izabela in two, she did no more than throw her in the bin as she awaited the opportunity to dig the filthy grave and bury her in the dead of night.\"She then removed all trace of Izabela - lying and obstructing justice in the years that followed.\"Podedworna is a selfish individual, concerned only about the impact upon herself.\"Derbyshire PoliceZablocka, the court heard, phoned her mother on 28 August 2010 and was not heard from againSamantha Shallow, of the Crown Prosecution Service, said: \"Izabela Zablocka came to Derby in search of a new life with her partner, but instead met her death.\"Anna Podedworna not only brutally murdered her partner, but she subjected Izabela's loved ones to 15 years of uncertainty and anguish, not knowing if she was alive or dead.\"Podedworna hid the truth for years, but justice has caught up with her.\"Her callous actions took a mother and daughter away from her family and denied them the opportunity to grieve her passing and lay her to rest.\"More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Skilled butcher' guilty of murdering, cutting up and burying partner in Derby",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7bf5/live/42cc8d60-0678-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-10T12:41:29.000Z",
      "dateModified": "2026-02-10T12:41:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Small Prophets: Sir Michael Palin on his first TV acting role in seven years",
    "url": "https://www.bbc.com/news/articles/czd81vr9dmyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/29f9/live/fc098400-066d-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-10T11:26:27.000Z",
    "description": "'Funny, warm, and no car chases' - Michael Palin on his return to TV acting5 hours agoSteven McIntoshEntertainment reporterBBCSmall Prophets marks Sir",
    "body": "'Funny, warm, and no car chases' - Michael Palin on his return to TV acting5 hours agoSteven McIntoshEntertainment reporterBBCSmall Prophets marks Sir Michael's first TV acting role since 2019's Worzel GummidgeSir Michael Palin has said he was attracted to the \"humour and magic\" of Small Prophets - the new BBC drama that marks his first TV acting role in seven years. Critics have heaped praise on the new comedy series from Detectorists creator Mackenzie Crook, which follows a man who creates tiny creatures capable of foretelling the future and answering any question.Sir Michael said he was attracted to the series because it \"deals with people in a very empathetic, human way\".\"This is not a story where you'll have car chases and people wanting to kill each other,\" he told BBC Radio 4's Today. \"There's a warmth in the way [Crook] writes about people.\"Every single character in this series, gets their moment, however small it might be, it might be two lines or one line, and that line is thought out, careful, and is given to the actor as something special,\" he continued.\"So what Mackenzie does is a very personal kind of writing, where if you like it, it's just the best of all to do, because it's so sympathetic to people.\"Lauren Patel (left) and Pearce Quigley also star in Small ProphetsSmall Prophets centres on Michael Sleep (played by Pearce Quigley), whose partner Clea vanished seven years ago. After a tip-off from his elderly father, played by Sir Michael, he begins cooking up an ancient recipe involving rain water, horse manure, and a little alchemy, to create folkloric creatures who can predict the future.\"They are called homunculi,\" explained Sir Michael, \"which I don't think anybody knows anything about, apart from Mackenzie.\"[He] found them in a book somewhere that there was proof that many many years ago, a man had found a recipe to create little people in jars - a magical alchemist.\"Sleep hopes he can help him find his wife. \"So what seems a very strange thing, becomes magical and quite helpful and improving, and helps him in his quest for his lost partner,\" Sir Michael explained. The series follows Michael (played by Quigley) as he attempts to create small creatures in jarsSmall Prophets marks the actor and presenter's first TV acting role since playing the green man in Worzel Gummidge, which was also written and directed by Crook. The former Monty Python star described Crook as a \"marvellous writer, one of the most original\".He said Crook's latest series is \"quite incisive, it's not dreamy, he writes very funny lines, very tart and quite sardonic in their way\".\"It's all about life in the suburbs of south Manchester, and he can find in that world an amazing amount of humour and magic, and good people doing very funny things.\"Five-star reviews\"If there is a message or a moral, it is that there are still wonderful things at hand in a world that might seem like it is running out of them,\" he said.\"The existence of Small Prophets proves the point: that British telly can still create impossible marvels like this is a reason to keep believing in magic.\"\"Even if this didn't have a supernatural storyline, Crook is already a magician, someone whose joyous storytelling can make you feel strangely and intensely alive,\" he said.The blending of the mundane and the magical \"may not suit every palate\", said the Telegraph's Anita Singh in her four-star review, \"but this is clearly a labour of love for Crook.\" \"Admittedly, some components jar – a cackling colleague at the DIY store feels misplaced, and the final instalment of the six-part series takes an unwanted detour into horror. \"However, Quigley is wonderful; a character in whose company one would happily while away the hours.Also awarding four stars, the Independent's Patrick Smith advised readers: \"If the show's magical realism gives you pause, don't be put off: you'll be rewarded with something funny, strange, and surprisingly accessible. \"Like Detectorists before it, this is a series that wrings emotion from the commonplace and everyday – only this time, the treasure Crook has buried is altogether more peculiar. Small Prophets brings large returns.\"Small Prophets is available now on iPlayer. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Small Prophets: Sir Michael Palin on his first TV acting role in seven years",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/29f9/live/fc098400-066d-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-10T11:26:27.000Z",
      "dateModified": "2026-02-10T11:26:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'A hug, a quick kiss': How to reconnect after having children",
    "url": "https://www.bbc.com/news/articles/ce3kvw4q29wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dc6e/live/74c9c400-05dc-11f1-82f0-b5a11f53e1d7.jpg",
    "tag": "Trending",
    "date": "2026-02-10T02:29:24.000Z",
    "description": "14 hours agoEmily HoltRebecca SommersRebecca says she wanted to reignite a fading connection with her partner after they became parents.Rebecca has be",
    "body": "14 hours agoEmily HoltRebecca SommersRebecca says she wanted to reignite a fading connection with her partner after they became parents.Rebecca has been with her husband for 10 years, but since having three children over the past three years she has grown \"disconnected\" from him. \"We are just cohabiting, like we're not a couple. We are just parents,\" she says. Like many parents, they struggle to find time to spend alone.\"Our kids are so young and they are so demanding that it's hard to even get five minutes to catch up and we're both exhausted come the end of the day.\"She says the dynamic of her relationship changed after she gave birth to her first child. \"We knew it was going to be different when we started trying for our first baby, but I think the gravity of it, we weren't expecting how different it would be.\" In Rebecca's case, her whole life has changed as she's switched from working full time to becoming a full time mother, and says she has struggled to open up with her partner about her feelings. \"His life is still his life. He does see how hard it is for me at home and also our relationship, he knows it's affected, but he'd never bring it up.\"Getty ImagesKate Moyle, psychosexual and relationship therapist, says it's normal for relationships to change after becoming parents.\"There's nothing that can prepare you for becoming parents. You think you know yourselves really well as a couple,  and then everything you think you know about someone is gone.\"The early years are typically the toughest with studies suggesting relationship dissatisfaction is often highest within the first three years of a child being born.Kate says making changes to improve your relationship is not about trying to get back to life before children, but about adapting.\"It's never going to look the same as it looked before, but we have to think about it in a new way now.\"Make time to hug and kissShe advises thinking about the small things such as eye contact or touch that you can do with the time you have in the day together to make you feel like a couple again. \"We call this sexual currency in my world, which is, you know, a hand squeeze, a hug, a quick kiss, anything that makes you connected.\"And when we have those opportunities, drop everything else and just prioritise that.\"Kate says small actions like this can have a big impact on improving a romantic relationship.\"When you're in the thick of it, that's not the time to say we need to change everything.\"She says a kiss or a touch then become bridges for bigger moments of intimacy and connection in the relationship. Be open about how you feelKate also recommends using a quiet moment to be honest about how the relationship is going.\"Their attention is the thing that we often miss. We feel separate, and then we think that our partner also feels separate, and we have this gap between us.\"Like friendships and families, Kate says you have to invest and nurture your relationship throughout, not just at the start.\"It takes work and adaptation and paying attention when we feel like we have nothing left.\"Spend time together without the kidsSam Owen, relationship coach and author, says after children you often need to \"get to know each other\" again, suggesting dates or conversations about interests outside your kids.Dates could include things like massages, checking into a hotel with a creche facility, playing games, getting creative with paint or drawing or cooking a nice meal together,\" she says. \"It's consciously creating a habit of connecting so it becomes part of your relationship.\" She says physical intimacy is also important.\"It's a vital glue for keeping your relationship together, it helps improve communication and reduce couple conflict.\" Since talking to CBeebies Parenting Helpline about her relationship, Rebecca says her and her husband have done several different things to improve their relationship.She says they now make sure they have meals still together with their children, but without their phones, which she says makes conversation flow easier without distractions. They also make sure they spend some time together each evening after they have put the kids to bed, often watching a film or TV show which she says means they now have an offiical time to relax together.\"Relationships take work, if you both want it then you will always find a way back to each other, don't shy away from the hard conversations and hold tight,\" says Rebecca.Other stories you may enjoy",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'A hug, a quick kiss': How to reconnect after having children",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dc6e/live/74c9c400-05dc-11f1-82f0-b5a11f53e1d7.jpg"
      ],
      "datePublished": "2026-02-10T02:29:24.000Z",
      "dateModified": "2026-02-10T02:29:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Aamilah Aswat: Grand National the dream for first black female British jockey to win jumps race",
    "url": "https://www.bbc.com/sport/horse-racing/articles/c3v7k3d26exo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5a43/live/73e7f6d0-069d-11f1-b5e2-dd58fc65f0f6.jpg",
    "tag": "Trending",
    "date": "2026-02-10T16:00:27.000Z",
    "description": "Aswat began riding aged five at St James City Farm - an inner-city stables in Gloucester - before linking up with trainers Kim Bailey and Mat Nicholls",
    "body": "Aswat began riding aged five at St James City Farm - an inner-city stables in Gloucester - before linking up with trainers Kim Bailey and Mat Nicholls.She was hooked by the sport after racing a pony at Cheltenham.Her win earlier this month came in just her fourth professional ride after taking out her jockey's license in autumn 2025.\"All the racing community have been very supportive and nothing has held me back,\" Aswat said. \"Every time I would go to Cheltenham I wouldn't see people the same colour as me, so in that sense it was daunting.\"Bailey could see Aswat's \"natural talent\" straight away.\"I take photographs of horses schooling the whole time for my owners and I've never had a photograph of her being out of place - that's quite a unique thing,\" Bailey told BBC Sport. \"It's very, very hard for [conditional jockeys] to get going - 90% of the jockeys now are either sons of trainers or sons of owners who put a lot of money into the business. \"I ring up an owner and say 'I've got this really good young black girl who wants to ride. Will you let them ride your horse?' Well, I mean, frankly, you're paying the same for her as you would do for [reigning champion jockey] Sean Bowen or anybody else. It's quite a difficult one.\"She's got to be strong enough to take all that and I'm pretty confident she will be able to cope with the additional attention, including potential social media abuse.\"She will always be a role model.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Aamilah Aswat: Grand National the dream for first black female British jockey to win jumps race",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5a43/live/73e7f6d0-069d-11f1-b5e2-dd58fc65f0f6.jpg"
      ],
      "datePublished": "2026-02-10T16:00:27.000Z",
      "dateModified": "2026-02-10T16:00:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wolverhampton superfan joins Robbie Williams on stage",
    "url": "https://www.bbc.com/news/articles/cge8yqze5gjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7eac/live/23f0f440-069a-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-10T14:01:10.000Z",
    "description": "Fan who gave Robbie number as teen joins him on stage3 hours agoOprah Flash,West MidlandsandSarah Julian,BBC Radio WMSuperfan appears on stage with Ro",
    "body": "Fan who gave Robbie number as teen joins him on stage3 hours agoOprah Flash,West MidlandsandSarah Julian,BBC Radio WMSuperfan appears on stage with Robbie WilliamsA Robbie Williams superfan, whose appearance in the Take That Netflix documentary went viral, has joined the star on stage in Wolverhampton.At the age of 14, Jemma Williamson, travelled from Wirral to Chester to attend a band signing event - but her dreams of meeting the star were thwarted as she was unable to get in.Not being put off by the setback, she stayed at the venue and ended up being filmed, taking her chance to urge the singer to call her and the footage featured on the three-part documentary more than 30 years ago.As part of his show at The Halls in Wolverhampton on Monday night, the star invited Williamson up on stage to relive the moment.The star performed in Wolverhampton on Monday nightAddressing the crowd, Williams said: \"Please welcome, Jemma from the Take That documentary.\"After joining him in front of hundreds of fans, she repeated her phrase from the documentary and shouted: \"Robbie's my favourite because he's got gorgeous eyes and a gorgeous body and he can call me any time.\"The singer went on to jokingly quiz her on whether she was inundated with calls but, she unsurprisingly she let him know that the number was no longer working.Williamson got loud cheers of support from the crowd as she was given a hug by Williams before returning to her seat.NetflixWhen the superfan gave her number on camera in the 1990s, she did not expect the star to try to call it more than 30 years laterThe clip on the documentary went viral with more than 107,000 likes on Instagram when the star attempted to call the number after watching the programme.Now a nursery teacher from Wolverhampton, Williamson said she was overwhelmed by the positive response her appearance and the star's video has had.She said \"I think it's brought back a bit of nostalgia for everybody.\"The Stoke-on-Trent singer, who has been travelling the UK with his Long 90's tour said he had chosen some smaller venues, the kind he would have played at the start of his solo career.Jemma WilliamsonWilliamson, now a teacher, appeared on stage next to her favourite popstarWilliams described it as the album he wanted to make when he first left Take That.Robbie Williams phones fan who appears in Netflix documentaryMore on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wolverhampton superfan joins Robbie Williams on stage",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7eac/live/23f0f440-069a-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-10T14:01:10.000Z",
      "dateModified": "2026-02-10T14:01:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Afghan asylum seeker guilty of raping girl, 12, in Nuneaton",
    "url": "https://www.bbc.com/news/articles/ckgkjg76lvxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/54f4/live/687e5470-059d-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-10T16:52:04.000Z",
    "description": "Just nowVanessa Pearce,West MidlandsandDan Johnson,at Warwick Crown CourtWarwickshire PoliceAhmad Mulakhil was found guilty of raping the girl during ",
    "body": "Just nowVanessa Pearce,West MidlandsandDan Johnson,at Warwick Crown CourtWarwickshire PoliceAhmad Mulakhil was found guilty of raping the girl during an attack in Nuneaton last JulyAn Afghan asylum seeker has been found guilty of abducting and raping a 12-year-old girl in Nuneaton.Ahmad Mulakhil, 23, took the girl to a quiet cul-de-sac on 22 July and carried out \"extremely horrific sexual offences\".At Warwick Crown Court, he was found guilty of rape, abduction, sexual assault and taking an indecent video of the girl.Co-defendant Mohammad Kabir, 24, also an Afghan asylum seeker, was found not guilty of strangulation, attempted child abduction and attempting to commit a sexual offence.Jurors at the 10-day trial heard evidence from the victim who said Mulakhil laughed while attacking her. The case prompted changes to guidance on reporting the nationality and immigration status of people arrested and charged.There were widespread protests in Nuneaton because the men's immigration status and nationality were not reported by the authorities when they were arrested.Mulakhil arrived in a small boat from France in March 2025, four months before he raped the girl.Listening to the jury deliver its verdicts in court, he could be seen crying in the dock and blowing his nose with a tissue. Remanding Mulakhil in custody to be sentenced at a later date, Judge Kristina Montgomery KC said: \"He will plainly receive a substantial custodial sentence which will automatically make him liable for deportation at its conclusion.\"Police released footage of the moments when they arrested Ahmad MulakhilThe court heard Mulakhil had made an immigration application linked to \"problems\" he had experienced in Afghanistan. The arrests of the men prompted Reform UK leader Nigel Farage and Warwickshire County Council leader George Finch to claim there had been a \"cover-up\" of details about the attack.At the time, Warwickshire Police said once someone was charged with an offence, the force followed national guidance that did not include sharing ethnicity or immigration status.Hundreds gathered outside Nuneaton Town Hall for an anti-immigration protest in August following the attackThe jury was told that in the hours before the attack, Mulakhil, who admitted one count of rape before the trial, was hanging round the town.The victim told the trial she was approached in a park by both defendants after playing on swings.During the sex attacks, the girl said she told Mulakhil to stop.Asked by police what he was saying, the girl responded: \"Nothing. He was just laughing.\"I was saying 'get off me'. He didn't say anything, he just carried on.\"Commenting after the case, a Home Office spokesperson said: \"We will not allow foreign criminals and illegal migrants to exploit our laws. We are reforming human rights laws and replacing the broken appeals system so we can scale up deportations.\"The home secretary has recently announced sweeping reforms to tackle illegal migration.\"They will make Britain a less attractive destination for illegal migrants and will make it easier to remove and deport them.\"More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Afghan asylum seeker guilty of raping girl, 12, in Nuneaton",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/54f4/live/687e5470-059d-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-10T16:52:04.000Z",
      "dateModified": "2026-02-10T16:52:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US lawmakers accuse justice department of 'inappropriately' redacting Epstein files",
    "url": "https://www.bbc.com/news/articles/cn5gzepnw4lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4540/live/fe1dd650-0673-11f1-b5e2-dd58fc65f0f6.jpg",
    "tag": "Trending",
    "date": "2026-02-10T12:07:35.000Z",
    "description": "5 hours agoCaitlin WilsonWatch: Massie, Khanna suggest Epstein file redactions protect at least six menUS lawmakers say files related to convicted sex",
    "body": "5 hours agoCaitlin WilsonWatch: Massie, Khanna suggest Epstein file redactions protect at least six menUS lawmakers say files related to convicted sex offender Jeffrey Epstein were improperly redacted ahead of their release by the Department of Justice (DOJ).Members of Congress on Monday were allowed to begin a review of the unredacted versions of the approximately three million pages of files released under the Epstein Files Transparency Act (EFTA) since December. \"The core issue is that they're not complying with... my law, because these were scrubbed back in March by Donald Trump's FBI,\" Democratic Representative Ro Khanna told MS NOW. At least one document has been unredacted since the lawmakers' complaint, with Deputy Attorney General Todd Blanche saying on X: \" The DOJ is committed to transparency.\"ReutersThe files' redactions came under scrutiny last week after lawyers for Epstein's victims said the latest tranche of files included email addresses and nude photos in which the names and faces of potential victims could be identified. Survivors issued a statement calling the disclosure \"outrageous\" and said they should not be \"named, scrutinized and retraumatized\". The DOJ said it had taken down all the flagged files and that mistakes were due to \"technical or human error\".After viewing the unredacted documents, Massie and Khanna, who co-sponsored the law which compelled the release of the Epstein files last year, told reporters they had a list of about 20 people in which every name was redacted except for Epstein's and his convicted sex trafficker associate Ghislaine Maxwell.Six of the names could even belong to men who are \"likely incriminated by their inclusion in these files\", Massie said outside the DoJ on Monday night, before posting a screenshot of the redacted file online and demanding an explanation. These names were \"inappropriately\" redacted, Khanna said on MS NOW.In response to their concerns, Blanche said his department \"just unredacted all non-victim names from this document. The DOJ is committed to transparency.\"He linked to what appears to be a new version of the file - which he said contains the names of Epstein victims, whose identities the EFTA law orders the government to conceal - with only two names now blacked out.Blanche also responded to two other files highlighted by Massie, saying those files do not obfuscate any substantive information.But Khanna said those measures taken after the documents' release are still not in compliance with the EFTA law, which passed nearly unanimously in Congress and was signed by President Trump in November.\"Trump's FBI scrubbed these files in March,\" Khanna said on social media. \"The documents (the Department of) Justice [received] had the redactions that the FBI made back then.\"They need to unscrub the FBI files so we know who the rich and powerful men are who raped underage girls.\"Massie said the incorrect redactions show the justice department \"need to do a little more homework\" in their handling of the files.\"What we found out is those 302 forms were redacted before they got to the DOJ,\" in contradiction of the law's order for the FBI - which is part of the DOJ - to un-redact information before sending it to Blance and Attorney General Pam Bondi's office.Who is in the Epstein files?Among the redactions flagged by Massie on Monday night was a document appearing the show an email exchange between Epstein and an unknown person discussing a \"torture video\" and travel between China and the United States.Massie claimed that \"a Sultan seems to have sent this\" and demanded the hidden identity be revealed. Blanche quoted Massie's post on X, saying the blacked-out text is an email address.\"The law requires redactions for personally identifiable information, including if in an email address. And you know that the Sultan's name is available unredacted in the files,\" he said. \"Stop grandstanding,\" he added.Massie also complained that the name of a \"well known retired CEO\" was missing from the publicly available version of an FBI document listing potential Epstein co-conspirators. Within hours, Blanche said that name - which already appears elsewhere in the files - had also been uncovered.\"DOJ is hiding nothing,\" he wrote.Representatives Jamie Raskin, a Democrat, and Lauren Boebert, a Republican, were among the lawmakers who viewed the documents on Monday. \"I think there are folks who are definitely implicated\" named in the files, Boebert said. Raskin complained that the limited way in which lawmakers could view the unredacted files amounts to a \"cover up\".\"The DOJ is giving Members of Congress just four computers in a satellite office to read the unredacted Epstein File of more than 3 million documents,\" he wrote on X, calculating that it would take Congress seven years to read it all.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US lawmakers accuse justice department of 'inappropriately' redacting Epstein files",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4540/live/fe1dd650-0673-11f1-b5e2-dd58fc65f0f6.jpg"
      ],
      "datePublished": "2026-02-10T12:07:35.000Z",
      "dateModified": "2026-02-10T12:07:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]