[
  {
    "title": "Music To Scream To - The Hammer Horror Soundtracks - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/m001f6bj?at_mid=gxZcY1DUwj&at_campaign=Music_To_Scream_To_The_Hammer_Horror_Soundtracks&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=sounds&at_brand=m001f6bj&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Music_To_Scream_To_The_Hammer_Horror_Soundtracks&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0lxywjg.jpg",
    "tag": "Trending",
    "date": "2022-10-27T11:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·31 Oct 2022,·28 minsMusic To Scream To - The Hammer Horror SoundtracksAvailable for over a year* Curse of the Werewolf\n* The Brides of Dracula\n* Frankenstein \n* The Monster from Hell \nThese are just some films from the height of Hammer Films’ prolific cinema output in the late 1950s and 1960s.   \nMany of the musical soundtracks were composed by leading British modernists of the late 20th Century. \nHammer’s music supervisor Philip Martell hired the avant-garde composers of the day.\nThe likes of Malcolm Williamson (later Master of the Queen’s Music), Elisabeth Lutyens, Benjamin Frankel and Richard Rodney Bennett all made a living scoring horror films alongside their concert hall work.\nPrising open Dracula’s coffin to unearth the story of Hammer’s modernist soundtracks, composer and pianist Neil Brand explores the nuts and bolts of scary music – how it is designed to psychologically unsettle us – and explores why avant-garde music is such a good fit for horror. \nOn his journey into the abyss, Neil visits the haunted mansion where many of the Hammer classics were made, Bray Studios in Berkshire\nNeil gets the horrifying low-down from: \n* Hammer aficionado, Wayne Kinsey\n* Film music historian, David Huckvale\n* Composer Richard, Rodney Bennett\n* On-screen Hammer scream queen, actress Madeline Smith.\nProducer: Graham Rogers\nFirst broadcast on BBC Radio 4 in October 2022.Programme Website",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Music To Scream To - The Hammer Horror Soundtracks - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0lxywjg.jpg"
      ],
      "datePublished": "2022-10-27T11:00:00.000Z",
      "dateModified": "2022-10-27T11:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Week: The King v Andrew And Possible Tax Rises - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mcy5jj?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-10-31T14:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·31 Oct 2025,·30 minsThe Week: The King v Andrew And Possible Tax RisesNewscastAvailable for over a yearToday, why did the King choose now to strip Andrew of his titles?\nAdam, Alex, Ben Chu of BBC Verify and Matthew Doyle the former Downing Street communications director react to the news that Prince Andrew will now be known as Andrew Mountbatten Windsor.  Will we see him in public life again?\nThe panel also discuss the possibility of tax rises in the upcoming budget. And whether the labour government have backed themselves into a corner with their tax promises. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Joe Wilkinson. The social producer was Sophie Millward. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Week: The King v Andrew And Possible Tax Rises - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-10-31T14:00:00.000Z",
      "dateModified": "2025-10-31T14:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Radical with Amol Rajan - A New Generational Divide: Living with(out) the Bank of Mum and Dad (Eliza Filby) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/m002lfft?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg",
    "tag": "Trending",
    "date": "2025-10-30T06:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·30 Oct 2025,·69 minsAvailable for over a yearHow can Millennials, Gen Zs and Gen As thrive in a world where so much success depends on having access to the Bank of Mum and Dad? \nHistorian Dr Eliza Filby – an expert in generational identity – tells Amol that society needs to shift in three major ways to mitigate the “rupture” between young and old: in values, education and wealth. \nAmol speaks with her about her book ‘Inheritocracy’ which calls for a radical redefining of meritocracy. They also discuss the shifts in parenthood and the evolving household roles of men and women, and ‘kidulthood’ - where young people move into adulthood in their early thirties instead of their late teens or early twenties. \n(00:02:30) What is ‘Inheritocracy?’ \n(00:04:13) The values rupture – Baby Boomers are the exceptional generation \n(00:10:07) The education rupture - the declining graduate premium \n(00:16:00) The wealth rupture – unattainable ‘big ticket’ items \n(00:28:00) Why is the social contract broken between generations? \n(00:38:27) Shifts in assortative mating \n(00:45:30) Is meritocracy a good idea in principle? \n(00:54:17) How to reconfigure the tax system for a new generation \n(00:57:07) Dr Eliza Filby's radical idea \n(01:01:11) Amol’s reflections \n(01:04:25) Listener messages \nGET IN TOUCH \n* WhatsApp: 0330 123 9480 \n* Email: radical@bbc.co.uk \nEpisodes of Radical with Amol Rajan are released every Thursday and you can also watch them on BBC iPlayer: https://www.bbc.co.uk/iplayer/episodes/m002f1d0/radical-with-amol-rajan \nAmol Rajan is a presenter of the Today programme on BBC Radio 4. He is also the host of University Challenge on BBC One. Before that, Amol was media editor at the BBC and editor at The Independent. \nRadical with Amol Rajan is a Today Podcast. It was made by Lewis Vickers with Anna Budd. Digital production was by Gabriel Purcell-Davis. Technical production was by Gareth Jones. The editor is Sam Bonham. The executive producer is Owenna Griffiths.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radical with Amol Rajan - A New Generational Divide: Living with(out) the Bank of Mum and Dad (Eliza Filby) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg"
      ],
      "datePublished": "2025-10-30T06:00:00.000Z",
      "dateModified": "2025-10-30T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Close Encounters of the Third Kind",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002l55s?at_mid=CYR2LRhPpK&at_campaign=Close_Encounters_of_the_Third_Kind&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002l55s&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Close_Encounters_of_the_Third_Kind&at_bbc_team=BBC&at_creation=Film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0m88w3w.jpg",
    "tag": "Trending",
    "date": "2025-10-18T19:36:51.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeClose Encounters of the Third KindClose Encounters of the Third KindContains language which may offend.Out on a late-night job alone, power repairman Roy Neary has an encounter with an alien spacecraft and becomes consumed with the desire to see it again.  Duration2h 10mFirst shown1980Available for 17 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesEdward ScissorhandsInnocence is what he knows, beauty is what she sees. Stirring drama with Johnny Depp1h 38mThe Thing from Another WorldScientists at a lonely Arctic outpost dig up an alien in a classic 50s chiller.1h 23mBlankYour new chapter awaits... An author battles for survival on an AI-controlled retreat1h 30mThe WitchesWitches are real! Reimagining of a Roald Dahl classic, with Anne Hathaway and Chris Rock1h 35mTwelve MonkeysA convict from 2035 is sent back in time to find the cause of a catastrophic virus.2h 2mCode 46In the future, love is a dangerous game. Dystopian romance starring Samantha Morton1h 29mCrimes of the FutureA new world is revealed. Viggo Mortensen stars in David Cronenberg's gory body-horror1h 38mGhostbusters: AfterlifeFinn Wolfhard and Paul Rudd star. Two kids uncover something strange in the neighbourhood1h 54mAlienIn space, no one can hear you scream. Ridley Scott's terrifying, Oscar-winning sci-fi1h 52mHighlanderThere can be only one. His first battle was in 1536. In 1986 he'll fight his greatest1h 50mDoctor Who (2005–2022)The modern adventures - from Christopher Eccleston to Jodie WhittakerDoctor WhoThe Star Beast. The Doctor finds an old friend, a new enemy and aliens wreaking havoc",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Close Encounters of the Third Kind",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0m88w3w.jpg"
      ],
      "datePublished": "2025-10-18T19:36:51.000Z",
      "dateModified": "2025-10-18T19:36:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-10-31T06:07:39.000Z",
    "description": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and p",
    "body": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-10-31T06:07:39.000Z",
      "dateModified": "2025-10-31T06:07:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC News quiz of the week: How many years since Lily Allen last released an album?",
    "url": "https://www.bbc.com/news/articles/cq50j43pp9go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/362f/live/28767c90-b62e-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-30T19:10:19.000Z",
    "description": "6 hrs agoSting back to support venues that fuelled dreamsThe singer-songwriter says accessing arts growing up on Tyneside inspired him to pursue his c",
    "body": "6 hrs agoSting back to support venues that fuelled dreamsThe singer-songwriter says accessing arts growing up on Tyneside inspired him to pursue his career.6 hrs ago10 hrs agoSmall venues that 'nurture talent' get £245k boostThe £245,000 fund is set up by Manchester City Council to counter changes in business rates. 10 hrs ago12 hrs ago'Give your money away,' Billie Eilish tells billionairesThe singer called on the mega wealthy to donate more to charity, during a speech at the WSJ Awards attended by the likes of Mark Zuckerberg and George Lucas.12 hrs ago16 hrs agoCat Burns' new album shows a softer side to the Traitors starHow To Be Human finds the star grappling with grief and heartbreak, instead of murdering celebrities.16 hrs ago1 day agoPopular festival reveals new home for 2026 returnWOMAD Festival, held in Wiltshire, will have a new home when the festival returns next year.1 day ago",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC News quiz of the week: How many years since Lily Allen last released an album?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/362f/live/28767c90-b62e-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-30T19:10:19.000Z",
      "dateModified": "2025-10-30T19:10:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Manchester synagogue attacker shot multiple times by police",
    "url": "https://www.bbc.com/news/articles/c629qyndq89o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a5fb/live/0efb21c0-a455-11f0-8a21-ff96e44d1cc2.jpg",
    "tag": "Trending",
    "date": "2025-10-31T11:59:33.000Z",
    "description": "4 hours agoMairead Smyth and Sarah Spina-Matthews,North WestFacebookManchester synagogue attacker Jihad Al-Shamie died from multiple police gunshot wo",
    "body": "4 hours agoMairead Smyth and Sarah Spina-Matthews,North WestFacebookManchester synagogue attacker Jihad Al-Shamie died from multiple police gunshot woundsThe Manchester synagogue attacker was repeatedly shot after running \"aggressively\" towards armed police while carrying a knife and wearing what appeared to be a suicide belt, an inquest has heard.Jihad Al-Shamie, 35, was shot minutes after launching his car and knife attack on Heaton Park synagogue in the city's Crumpsall area on 2 October.Adrian Daulby, 53, and Melvin Cravitz, 66, were killed, while another three men were hospitalised. Members of Al-Shamie's family attended the hearing via videolink as the inquest was opened and adjourned at Manchester Coroner's Court earlier.The court heard Al-Shamie was identified at the scene by fingerprints and \"secondary evidence\" at the scene, including his mobile phone and car.Inquests into the two victims, which opened on Wednesday, heard Mr Cravitz was stabbed while Mr Daulby died from a gunshot wound to the chest fired by police.Melvin Cravitz (left) and Adrian Daulby (right) were killedAl-Shamie, a Syrian-born UK citizen, began his rampage by driving his Kia Picanto at security staff and the external gates of the synagogue as worshippers were gathering for Yom Kippur, the holiest day of the year for Jews.CCTV footage from the scene showed Al-Shamie driving his car into the gates and external wall of the synagogue at 09:30 BST, striking a security guard, before attacking worshippers and security guards with a knife.He then tried to storm the synagogue, wearing a fake suicide belt, before being shot dead.Det Ch Supt Lewis Hughes told the hearing that armed officers responding to the call \"discharged several rounds\" at Al-Shamie as \"he ran towards them aggressively while carrying a knife and wearing what clearly presented as a suicide belt\".He added: \"Al-Shamie sustained multiple bullet wounds and collapsed to the ground.\"Al-Shamie wasn't pronounced dead until 16:38 BST because of concerns about the belt on his body, the inquest heard.EPAKing Charles visited the synagogue to pay tribute to the victims last weekDet Ch Supt Hughes continued: \"Three other victims were very seriously injured, which consisted of a security guard struck by the vehicle, a worshipper completing security duties, outside, who was stabbed, and another worshipper, inside, who also sustained a gunshot injury.\"Whilst all received very serious injuries requiring extensive medical treatment, all are recovering and it is not anticipated that there will be any further loss of life arising from this incident.\"The hearing was also attended by representatives from Greater Manchester Police, the government's legal department, Greater Manchester Fire and Rescue Service, the Independent Office for Police Conduct and Counter Terrorism Policing North West.Judge Alexia Durran, chief coroner of England and Wales, released Al Shamie's body to his family for burial.She said it was \"not the day to test or ask questions of [Det Ch Supt Hughes] about his evidence\". \"There will be time at the inquest hearing to do so,\" she said. Judge Durran adjourned the inquest until February 19, when a pre-inquest review will be held.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Manchester synagogue attacker shot multiple times by police",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a5fb/live/0efb21c0-a455-11f0-8a21-ff96e44d1cc2.jpg"
      ],
      "datePublished": "2025-10-31T11:59:33.000Z",
      "dateModified": "2025-10-31T11:59:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dutch centrist Rob Jetten claims victory over Wilders in neck-and-neck election race",
    "url": "https://www.bbc.com/news/articles/cq6z5e5y55eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/db70/live/052af770-b656-11f0-969b-0be52cca84d5.jpg",
    "tag": "Trending",
    "date": "2025-10-31T15:38:53.000Z",
    "description": "37 minutes agoPaul KirbyEurope digital editorCentrist liberal leader Rob Jetten has claimed victory in Wednesday's nail-biting Dutch election, after v",
    "body": "37 minutes agoPaul KirbyEurope digital editorCentrist liberal leader Rob Jetten has claimed victory in Wednesday's nail-biting Dutch election, after vote analysis indicated his party could not be beaten by anti-Islam populist Geert Wilders.Jetten's D66 party currently has a narrow lead of 15,000 votes over Wilders' Freedom Party, and Dutch news agency ANP says even though the vote count is not complete, Wilders can no longer win.\"We are the biggest party in the Netherlands! Now we'll get to work for all Dutch people,\" Jetten posted on X. Wilders said it was the electoral council not a news agency that decided the result: \"What arrogance not to wait for that.\"Projections from about 99% of the vote put both parties on 26 seats in the 150-seat parliament - but ANP says Jetten's centrists could win a 27th seat.Jetten, 38, told reporters he was \"very proud of this historic result\" and now felt a great responsibility to form a stable and ambitious government.Wilders had led opinion polls going into Wednesday's election, but Rob Jetten succeeded in winning in some of the main Dutch cities including Rotterdam, The Hague and Utrecht with a positive campaign using a catchphrase of \"Yes, we can\". No Dutch election race has ever been so close, and if Jetten does become prime minister he will be the youngest in Dutch history.Until now Jetten was careful not to declare victory until all votes were in, but ANP said based on figures from postal voters abroad he could now be declared the winner.Wilders said even if D66 did go on to become the biggest party, his Freedom Party (PVV) would \"not let the Netherlands be broken up by Jetten and his people\".Jetten told reporters that his party had \"shown to the rest of Europe and the world that it is possible to beat the populist movements if you campaign with a positive message\".The Dutch electoral system is based on proportional representation in one nationwide constituency, so whichever party secures most votes wins most seats. Jetten's liberals have so far won 16.9% of the vote, while Wilders' Freedom Party is on 16.7%. As results came in on Thursday, the race was so close that the lead flipped between the two parties.Although the D66 leader's path to forming a coalition is not straightforward, Jetten has said he wants to make a quick start.Jetten said after the vote that never before had a party won a Dutch election with fewer than 30 seats. He will need the support of at least three other parties to gather the 76 seats needed to form a coalition. The most obvious candidates would be the conservative-liberal VVD, the left-wing Labour (PvdA)-GreenLeft alliance and the Christian Democrats, but it could take months if that is to happen.VVD leader Dilan Yesilgöz has so far ruled out working with the left, but Jetten said he favoured a broad-based government from the centre of Dutch politics.The weekend would be a good chance for all the parties to reflect, before a \"scout\" is given the task next Tuesday of sounding them out. Jetten said he wanted to construct a coalition that represented best the millions of voters who had backed other parties to tackle the main issues, including the housing shortage and asylum and migration.His path to victory has stunned observers. Less than two years ago he led D66 - a party formed by democratic reformers in 1966 - to fifth place and just nine seats. Only a few weeks ago they were still languishing in the opinion polls, but gradually improved as Jetten put in several polished performances in TV debates and even  competed in the final of a TV quiz show 11 days before the election.Outgoing Prime Minister Dick Schoof predicted on Friday that Jetten's task of forming a coalition would prove complicated. \"I reckon I'll still be prime minister at Christmas - I'd be surprised if it happened [by then]\".Schoof, a former chief of Dutch intelligence, was picked for the top job by Geert Wilders, who abandoned his bid to lead the country last year because his prospective coalition partners would not support having a far-right prime minister.Wilders won the last election in November 2023, and a government was only formed in July 2024. Eleven months later, he brought his own government down, in a row with his coalition partners over asylum and migration policy.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dutch centrist Rob Jetten claims victory over Wilders in neck-and-neck election race",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/db70/live/052af770-b656-11f0-969b-0be52cca84d5.jpg"
      ],
      "datePublished": "2025-10-31T15:38:53.000Z",
      "dateModified": "2025-10-31T15:38:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Post Office justice scheme paves way for face-to-face meetings",
    "url": "https://www.bbc.com/news/articles/cze6w4e8kxeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a196/live/d4a0ecd0-a4fe-11f0-9779-cd87a9626924.jpg",
    "tag": "Trending",
    "date": "2025-10-31T14:56:01.000Z",
    "description": "1 hour agoLucy Hooker,business reporter and Emma Simpson,business correspondentVictims of the Horizon Post Office scandal could meet face-to-face with",
    "body": "1 hour agoLucy Hooker,business reporter and Emma Simpson,business correspondentVictims of the Horizon Post Office scandal could meet face-to-face with Fujitsu and Post Office representatives as part of a restorative justice effort.The charity overseeing a new scheme said the first five months were an initial pilot phase, but it hoped the scheme would last five years and include extra initiatives such as a special commemorative postage stamp.It comes on top of the various financial compensation schemes in place for sub-postmasters.The Horizon IT scandal saw hundreds of sub-postmasters falsely accused of embezzling Post Office funds after faulty software suggested money was missing from their branch accounts.More than 900 sub-postmasters were wrongly prosecuted because of incorrect information from the Horizon computer system.Restorative justice is a process in the criminal justice system which brings the victims of an injustice and the people responsible together in a bid to repair harm caused. The first face-to-face meetings under the scheme could take place as early as December, and also include representatives from the Department for Business and Trade. However, the process is voluntary, so while victims can request to speak directly to specific individuals - for example the former boss of the Post Office, Paula Vennells - ex-executives are not obliged to take part.The Post Office has already held some restorative meetings between sub-postmasters and its former chief executive, Nick Read.But this would mark the first time representatives of Fujitsu, the company responsible for the faulty software at the heart of the scandal, have been involved in a restorative meeting with sub-postmasters affected. Fujitsu representatives have met with Lost Chances, the group formed to campaign on behalf of the adult children of affected sub-postmasters.The Restorative Justice Council (RJC), which was asked to come up with the programme, said the aim was to rebuild trust and support among the sub-postmasters and their families.Jim Simon, chief executive of the Restorative Justice Council, said the process was not just about addressing past harms, but also about \"creating a safe and compassionate space for individuals to share their stories and begin their healing journeys\". The RJC held events with over a hundred victims to establish what they wanted to see from a restorative programme.The initial phase will operate from now until March next year, and include a phone helpline and support service staffed by restorative justice practitioners. A full formal programme is expected to be launched in April 2026.The idea for a commemorative postage stamp was suggested by sub-postmasters, and could help raise funds for Lost Chances and educational initiatives related to the scandal.Funding is provided by the government, the Post Office, which is state-owned, and Fujitsu. Current Post Office chief executive Neil Brocklehurst, said it was time to \"establish a lasting and meaningful restorative justice programme which is directly informed by the wishes of those who were harmed.\"Paul Patterson, Fujitsu's chief executive for Europe, said the restorative process was an important step and that it would help ensure \"lessons are learned\".\"We deeply regret Fujitsu's role in sub-postmasters' suffering and recognise the profound impact it has had on them and their families,\" he said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Post Office justice scheme paves way for face-to-face meetings",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a196/live/d4a0ecd0-a4fe-11f0-9779-cd87a9626924.jpg"
      ],
      "datePublished": "2025-10-31T14:56:01.000Z",
      "dateModified": "2025-10-31T14:56:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Virginia Giuffre's family celebrate Andrew's 'prince' title being stripped",
    "url": "https://www.bbc.com/news/articles/cy9pn12w4n8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e824/live/a9e827c0-b623-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-31T05:08:24.000Z",
    "description": "The family of the late Virginia Giuffre, who accused Prince Andrew of sexual abuse,  have celebrated his title of 'prince' being stripped from him as ",
    "body": "The family of the late Virginia Giuffre, who accused Prince Andrew of sexual abuse,  have celebrated his title of 'prince' being stripped from him as a victory which is \"unprecedented in history\".\"This normal girl from a normal family has taken down a prince. We are so proud of her,\" Sky Roberts, Giuffre's brother, told BBC Newsnight through tears.But Mr Roberts told the BBC removing his title was \"not enough\" and called for an investigation into Andrew, adding that he \"needs to be behind bars\". Andrew has denied all claims against him.Giuffre took her own life earlier this year. The publication of her posthumous memoirs this month intensified pressure on the Royal Family over Andrew's friendship with paedophile financier Jeffrey Epstein.Follow live updates on this storyBuckingham Palace announced on Thursday that King Charles III had initiated a formal process to \"remove the style, titles and honours\" of Prince Andrew, now known as Andrew Mountbatten-Windsor.Asked how Giuffre might have responded to that decision, her brother said: \"She is celebrating from the heavens now saying 'I did it'.\"\"She'd be so proud. He's just Andrew.\"In her memoir, Giuffre - a prominent accuser of Jeffrey Epstein - alleged Andrew had sex with her three times as a teenager and that he \"believed that having sex with me was his birthright.\" Andrew, who has denied the allegations, reached an out-of-court settlement with Giuffre in 2022 which contained no admission of liability or apology.\"It truly is a moment for her and all survivors,\" Giuffre's sister-in-law Amanda Roberts said.\"Everything she fought for was not in vain,\" she added, noting that she \"broke down\" when she heard the news at work.While the pair celebrated what they described as a moment of \"victory\", Giuffre's brother also stressed it was \"not enough\".\"We have to have some sort of investigation that goes further into this,\" he said.\"[Andrew is] still walking around a free man. He needs to be behind bars.\"Earlier this month, Andrew voluntarily gave up several royal titles including the Duke of York, saying \"we have concluded the continued accusations about me distract from the work of His Majesty and the Royal Family.\"The King's decision to strip Andrew of his title of 'prince' follows the emergence this month of emails from 2011 that showed Andrew had maintained contact with Epstein, despite claiming otherwise.Giuffre's family also addressed the implications of the King's decision for the US, where calls have grown for the release of documents related to Epstein. Partial records have been released that named Andrew as a passenger on a flight with Epstein.\"The US government hold the key to the larger scope of the Jeffrey Epstein case,\" Mr Roberts said.\"The UK is setting an example for what the US should be doing right now.\" \"There's many more of them, I promise you.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Virginia Giuffre's family celebrate Andrew's 'prince' title being stripped",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e824/live/a9e827c0-b623-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-31T05:08:24.000Z",
      "dateModified": "2025-10-31T05:08:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reeves rebuked by PM over 'regrettable' rental confusion but faces no further action",
    "url": "https://www.bbc.com/news/articles/cvgk40l8jm7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8911/live/babb1080-b63c-11f0-b537-0b1fa31d0c29.jpg",
    "tag": "Trending",
    "date": "2025-10-31T09:45:01.000Z",
    "description": "7 hours agoBecky MortonPolitical reporterThe prime minister has said Chancellor Rachel Reeves will face no further action over the failure to obtain t",
    "body": "7 hours agoBecky MortonPolitical reporterThe prime minister has said Chancellor Rachel Reeves will face no further action over the failure to obtain the correct licence when renting out her family home.However, Sir Keir Starmer said it was \"regrettable\" Reeves did not share all the relevant emails when she first told him about the issue on Wednesday evening.The chancellor initially said neither she nor her husband were aware a licence was needed but later found correspondence between her husband and the letting agent showing he was told one was required but the agency would apply on their behalf.The letting agent has said an \"oversight\" meant it had never ultimately applied for the licence.Reeves has apologised for the \"inadvertent mistake\" but said she accepted full responsibility.Conservative Party chairman Kevin Hollinrake called for a full investigation, saying the chancellor's story \"keeps on changing\".\"On Wednesday, the independent adviser on ministerial standards said he was simply willing to take Rachel Reeves's word and the case was closed,\" he told BBC Breakfast.\"The next day some more evidence came to light, which meant Rachel Reeves's story on Wednesday was a false narrative of the event.\"Reeves put her four-bedroom south London home up for rent in July 2024, when Labour won the general election and she moved into 11 Downing Street.The house falls in an area where Southwark Council requires private landlords to obtain a selective licence at a cost of £945. Reeves or her letting agent could face an unlimited fine if the council takes the matter to court.Southwark Council has refused to comment on Reeves's case but said it only takes enforcement action against landlords who do not apply for a licence within 21 days of receiving a warning or where a property is found to be in an unsafe condition.Reeves says she has now applied for a licence.The chancellor said she first became aware that her property did not have the correct licence on Wednesday when the Daily Mail, who first reported the story, contacted her.After consulting his ethics adviser Sir Laurie Magnus, who decided against launching an investigation, Sir Keir accepted Reeves's apology and said he was happy the \"matter can be drawn to a close\".However, the release of the emails between her husband and the letting agent on Thursday reopened the row.After reviewing the emails, Sir Laurie said he still believed Reeves made an \"unfortunate but inadvertent error\".While he did not rule on whether the ministerial code had been broken, he said he found \"no evidence of bad faith\".In a letter to Reeves on Thursday evening, Sir Keir said he agreed with his ethics adviser and saw \"no need for any further action\".He accepted the emails from the estate agent were only found by her husband on Thursday morning and Reeves was \"acting in good faith\".However, he added: \"It would clearly have been better if you and your husband had conducted a full trawl through all email correspondence with the estate agency before writing to me yesterday.\"Defending his colleague, Trade Minister Chris Bryant said he did not think the fault lay with Reeves and she would be \"entitled to feel a bit grumpy\" about the situation.\"She realised that her husband had actually had some emails, some correspondence with the estate agent - and the estate agent had said categorically in terms we will sort out this licence for you and then subsequently it didn't happen,\" he told the BBC.The revelations come at a politically awkward time for Reeves, who is preparing for a Budget at the end of the month amidst speculation the government is planning to break a manifesto commitment not to raise income tax.In a statement, Gareth Martin, owner of Harvey & Wheeler, the estate agent which rented out the property on behalf of Reeves, said: \"In an effort to be helpful our previous property manager offered to apply for a licence on these clients' behalf, as shown in the correspondence. That property manager suddenly resigned on the Friday before the tenancy began on the following Monday.\"Unfortunately, the lack of application was not picked up by us as we do not normally apply for licences on behalf of our clients; the onus is on them to apply. We have apologised to the owners for this oversight.\"At the time the tenancy began, all the relevant certificates were in place and if the licence had been applied for, we have no doubt it would have been granted.\"Our clients would have been under the impression that a licence had been applied for.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reeves rebuked by PM over 'regrettable' rental confusion but faces no further action",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8911/live/babb1080-b63c-11f0-b537-0b1fa31d0c29.jpg"
      ],
      "datePublished": "2025-10-31T09:45:01.000Z",
      "dateModified": "2025-10-31T09:45:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Second casting of solid gold toilet stolen from Blenheim Palace up for sale ",
    "url": "https://www.bbc.com/news/articles/c1j8z6r8zl6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/95b0/live/63cff800-b653-11f0-b2a1-6f537f66f9aa.png",
    "tag": "Trending",
    "date": "2025-10-31T14:42:03.000Z",
    "description": "2 hours agoEthan GudgeSouth of EnglandA second solid gold toilet is to be auctioned off, after the first casting was stolen from Blenheim Palace in 20",
    "body": "2 hours agoEthan GudgeSouth of EnglandA second solid gold toilet is to be auctioned off, after the first casting was stolen from Blenheim Palace in 2019.America, created by Italian conceptual artist Maurizio Cattelan, is a fully functional toilet, fashioned from more than 15st 13lb (101.2kg) of solid 18-karat gold.The first version of the work was initially installed in a public bathroom at the  Guggenheim museum in New York in 2016 but hit the news again three years later when a gang of thieves stole it from Blenheim in Oxfordshire. Now, the existence of a second golden toilet has been revealed which is due to go under the hammer at Sotheby's in New York City on 18 November.It is estimated more than more than a 100,000 people used the first toilet while it was at the Guggenheim before it was moved and exhibited at Blenheim Palace.It was there that in the early hours of 14 September 2019, five men smashed their way in, ripped out the £4.8m solid gold installation and fled in a stolen Volkswagen Golf.The heist and the trial that followed made news across the world.    James Sheen, 40, from Oxford, pleaded guilty to burglary and transferring criminal property in 2024. Michael Jones, 39, from Oxford, was found guilty of burglary in March. Both were both jailed earlier this year.Fred Doe, 36, from Windsor, was also convicted of conspiracy to transfer criminal property and given a suspended sentence.Sotheby's has revealed that Cattelan created three toilets in 2016, with work number two now up for sale.The second version will be on display in a bathroom at New York's Breuer Building until it goes under the hammer.The auction house described it as a \"cultural phenomenon\" and an \"incisive commentary on the collision of artistic production and commodity value\".David Galperin, head of contemporary art at Sotheby's New York, said: \"America is Maurizio Cattelan's tour de force.\"\"Holding both a proverbial and literal mirror to the art world, the work confronts the most uncomfortable questions about art, and the belief systems held sacred to the institutions of the market and the museum,\" Mr Galperin explained.The auction house said that in a world first, the starting bid on the artwork would be determined by the exact price of its weight in gold when the sale begins.That means, if sold at today's rate, bidding on the solid gold toilet would begin at around $10m (£7.6m).",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Second casting of solid gold toilet stolen from Blenheim Palace up for sale ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/95b0/live/63cff800-b653-11f0-b2a1-6f537f66f9aa.png"
      ],
      "datePublished": "2025-10-31T14:42:03.000Z",
      "dateModified": "2025-10-31T14:42:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US strikes on alleged drug boats violate law, UN human rights chief says",
    "url": "https://www.bbc.com/news/articles/cx2nx95pgz7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/27e7/live/62a6c930-b672-11f0-ba75-093eca1ac29b.jpg",
    "tag": "Trending",
    "date": "2025-10-31T13:05:44.000Z",
    "description": "3 hours agoRachel Hagan and Imogen Foulkes,Geneva CorrespondentEPA-EFE/REX/ShutterstockThe UN's human rights chief has condemned US military strikes o",
    "body": "3 hours agoRachel Hagan and Imogen Foulkes,Geneva CorrespondentEPA-EFE/REX/ShutterstockThe UN's human rights chief has condemned US military strikes on vessels allegedly carrying drugs in the Caribbean and Pacific, saying the lethal attacks violate international law and amount to \"extrajudicial killing\".Volker Türk said on Friday that more than 60 people have reportedly been killed in US strikes since early September.Calling the attacks \"unacceptable\", he said Washington must halt them immediately and conduct prompt, independent and transparent investigations.President Donald Trump has said the strikes are necessary to stem the flow of drugs into the US and he has the legal authority to continue bombing boats in international waters.Secretary of Defence Pete Hegseth has said strikes are being carried out on vessels operated by drug-trafficking groups designated as terrorist organisations by the US, saying this week that \"the Western Hemisphere is no longer a safe haven for narco-terrorists bringing drugs to our shores to poison Americans\".Türk, while acknowledging the challenges of tackling drug trafficking, said in a statement that the circumstances for the deadly strikes \"find no justification in international law\".\"Countering the serious issue of illicit trafficking of drugs across international borders is - as has long been agreed among States - a law-enforcement matter, governed by the careful limits on lethal force set out in international human rights law.\"Under law, the intentional use of lethal force \"is only permissible as a last resort against individuals who pose an imminent threat to life\", he said.He added that based on \"very sparse information provided publicly by the US authorities, none of the individuals on the targeted boats appeared to pose an imminent threat to lives of others\".He called on the US to use law enforcement methods including intercepting boats and detaining suspects, and if necessary, prosecuting individuals.Watch: What we know about US strikes targeting alleged drug boatsMost strikes have taken place off the coast of South America in the Caribbean, though attacks in the Pacific this week killed at least 18 people, according to Hegseth.In the Caribbean, the US has deployed troops, aircraft and naval vessels and last week ordered the world's largest warship - the USS Gerald R Ford - to the area.The strikes have drawn condemnation in the region and experts have questioned their legality. Members of US Congress, both Democrats and Republicans, have also raised concerns and questioned the president's authority to order them.Mexican President Claudia Sheinbaum said her government does not \"agree with these attacks\" and has called for meetings with the US ambassador, insisting that \"all international treaties be respected.\"BBC NewsThe US actions have also heightened tensions between Washington and the governments of Colombia and Venezuela.The US has placed sanctions on Colombian president Gustavo Petro, accusing him of failing to curb drug trafficking and allowing cartels to \"flourish\". Petro has responded that he has been fighting drug trafficking \"for decades\".Trump has also accused Venezuelan President Nicolas Maduro of leading a drug-trafficking organisation, which he denies.Venezuela's attorney general told the BBC there is \"no doubt\" that Trump is trying to overthrow the Venezuelan government. He accused the US of hoping to seize the country's natural resources, including reserves of gold, oil and copper.The US is among many nations that do not recognise Maduro as Venezuela's legitimate leader, after the last election in 2024 was widely dismissed as neither free nor fair. Opposition tallies from polling stations showed its candidate had won by a landslide.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US strikes on alleged drug boats violate law, UN human rights chief says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/27e7/live/62a6c930-b672-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-31T13:05:44.000Z",
      "dateModified": "2025-10-31T13:05:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israel confirms identities of hostages' bodies returned by Hamas",
    "url": "https://www.bbc.com/news/articles/c4gj90j2g8jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1e21/live/adf59be0-b632-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-31T10:14:53.000Z",
    "description": "6 hours agoDavid GrittenJerusalemReutersThe Israeli military said Sahar Baruch (L) and Amiram Cooper (R) were killed by their captorsIsrael has confir",
    "body": "6 hours agoDavid GrittenJerusalemReutersThe Israeli military said Sahar Baruch (L) and Amiram Cooper (R) were killed by their captorsIsrael has confirmed the identities of two deceased hostages whose bodies it received from Hamas via the Red Cross in Gaza on Thursday.Forensic tests showed the remains were those of Amiram Cooper, 84, and Sahar Baruch, 25, the Israeli prime minister's office said.\"The government of Israel shares in the deep sorrow of the Cooper and [Baruch] families and all the families of the fallen hostages,\" it said in a statement.The Hostages and Missing Families Forum in Israel demanded that all 11 Israeli and foreign deceased hostages still in Gaza be returned immediately by Hamas in line with the US-brokered ceasefire agreement.Amiram Cooper was abducted along with his wife, Nurit, from Kibbutz Nir Oz during the Hamas-led attack on Israel on 7 October 2023, which sparked the war. Hamas released Nurit after 17 days, but it continued to hold Amiram.The Israeli military said it estimated Amiram was murdered in captivity in February 2024, but that final conclusions will be made upon completion of a post-mortem.It had previously said he was killed along with three other hostages - Nadav Popplewell, Chaim Peri and Yoram Metzger - in Khan Younis while troops were operating in the area. Hamas had claimed they were killed by an Israeli strike.Sahar Baruch was kidnapped during the attack on Kibbutz Be'eri by Hamas gunmen, who also killed his brother, Edan, and grandmother, Geula Bachar.The Israeli military said it estimated that he was murdered in captivity on 8 December 2023, and that it was awaiting the results of a post-mortem.It had previously announced that he was killed during a rescue attempt by Israeli forces.The military expressed its deep condolences to the two men's families and stressed that Hamas was \"required to fulfil its part of the agreement and make the necessary efforts to return all the hostages to their families and to a dignified burial\".The Hostages and Missing Families Forum, which represents many hostages' families, said: \"There are no words to express the depth of this pain.\"\"The hostages have no time. We must bring them all home, now!\"On Friday morning, Israeli authorities returned via the Red Cross the bodies of another 30 dead Palestinians in exchange for the two hostages, Nasser hospital in Khan Younis said.Under the ceasefire deal, Israel has agreed to hand over the remains of 15 Palestinians for every deceased Israeli hostage. Israeli prime minister's officeIsraeli soldiers salute the coffins, which were handed over by Hamas via the Red Cross in GazaOn Tuesday, the Israeli government accused Hamas of violating the Gaza ceasefire deal after the group handed over a coffin containing human remains that did not belong to one of the 13 deceased Israeli and foreign hostages then still in Gaza.It said forensic tests showed they belonged to Ofir Tzarfati, a hostage whose body had been recovered by Israeli forces in Gaza in late 2023.The Israeli military also released footage filmed by a drone that showed Hamas members removing a body bag containing the remains from a building in Gaza City, reburying it, and then staging the discovery in front of Red Cross staff.The Red Cross said its staff were unaware that the body bag had been moved before their arrival and that the staged recovery was \"unacceptable\".Hamas rejected what it called the \"baseless allegations\" and accused Israel of \"seeking to fabricate false pretexts in preparation for taking new aggressive steps\".Hours later, the Israeli government accused Hamas of another ceasefire violation, saying the group's fighters had killed an Israeli soldier in an attack in an area of southern Gaza.Hamas claimed it was not involved in the incident in the Rafah area, but Israel's prime minister ordered a wave of air strikes across Gaza on Tuesday night in response. The Israeli military said it attacked \"dozens of terror targets and terrorists\".Gaza's Hamas-run health ministry said 104 Palestinians were killed, including 46 children and 20 women, making it the deadliest day since the ceasefire took effect on 10 October.US President Donald Trump maintained \"nothing\" would jeopardise the ceasefire agreement, which his administration brokered along with Qatar, Egypt and Turkey, but he added that Israel should \"hit back\" when its soldiers were targeted.EPAOn Tuesday, Hamas fighters removed a body bag from a tunnel in the southern Gaza city of Khan YounisUnder the deal, Hamas agreed to return the 20 living and 28 dead hostages it was holding within 72 hours.All the living Israeli hostages were released on 13 October in exchange for 250 Palestinian prisoners and 1,718 detainees from Gaza.Israel has handed over the bodies of 225 Palestinians in exchange for the bodies of the 15 Israeli hostages so far returned by Hamas, along with those of two foreign hostages - one of them Thai and the other Nepalese.Nine of the 11 dead hostages still in Gaza are Israelis, one is Tanzanian, and one is Thai.All but one of the dead hostages still in Gaza were among the 251 people abducted during the Hamas-led attack on southern Israel on 7 October 2023, during which about 1,200 other people were killed.Israel responded by launching a military campaign in Gaza, in which more than 68,600 people have been killed, including more than 200 since the ceasefire took effect, according to the territory's health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israel confirms identities of hostages' bodies returned by Hamas",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1e21/live/adf59be0-b632-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-31T10:14:53.000Z",
      "dateModified": "2025-10-31T10:14:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]