[
  {
    "title": "Enzo Maresca: What went wrong between Chelsea and Maresca?",
    "url": "https://www.bbc.com/sport/football/articles/cj0n8d913d8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9ad2/live/d8535560-e708-11f0-bda7-cd77a7bc9f3b.jpg",
    "tag": "Trending",
    "date": "2026-01-01T18:21:39.000Z",
    "description": "Image source, Getty ImagesImage caption, Enzo Maresca's Chelsea won only once in the Premier League in DecemberByFootball reporterUpdated 1 hour agoLe",
    "body": "Image source, Getty ImagesImage caption, Enzo Maresca's Chelsea won only once in the Premier League in DecemberByFootball reporterUpdated 1 hour agoLess than six months after guiding Chelsea to Club World Cup success, Enzo Maresca has left his post as head coach.The Blues won just one of their final seven Premier League matches under Maresca and sit fifth in the table - 15 points adrift of leaders Arsenal.After their most recent game - a 2-2 draw with Bournemouth on 30 December - assistant manager Willy Caballero said Maresca felt too unwell to speak to the media, but it is understood his absence was more due to him considering his next steps.Two days on, Maresca has gone. But how did things unravel?From stability to troubleMedia caption, From Match of the Day on 13 December: What did Maresca mean?At the end of November, Chelsea appeared in a harmonious place, with the team third in the Premier League and having recently dismantled Barcelona in the Champions League.On 12 December, Maresca was named Premier League manager of the month for November.Just one league win followed in December but it was not only results that added to the focus on Maresca, with fissures emerging between the Italian and the club's hierarchy.Maresca stunned key figures at Stamford Bridge - and even his own staff - when, after beating Everton 2-0 for Chelsea's solitary Premier League win in December, he said \"many people\" had made it his \"worst 48 hours\" since joining the club.Those comments came from a position of strength after a good performance but were viewed dimly by the club hierarchy, at whom they appeared to be aimed.They have since been explained as being linked to medical recommendations. Senior figures inside Chelsea said instructions were ignored and decisions either risked players getting injured again - or prevented them from training because of overload. Maresca felt the club were telling him who to pick, based on a player's value.Even after that, the plan remained to conduct an end-of-season review to decide whether to move forward with Maresca or part company.Those with knowledge of Maresca's views, though, said he was capable of walking away having grown unhappy at a multitude of factors, including encouragement over which players should start and which substitutions should be made during matches.He also felt a lack of protection from the club over the quality of his work. And on Thursday came news that was not unexpected, with Chelsea confirming the two parties had gone their separate ways. The Blues' players will return to work on Friday closer in points to 15th place than third in the Premier League as they prepare for a defining period.They face Manchester City on Sunday to start a difficult month that also includes games against Arsenal and Napoli.Chelsea's primary goal this season is to qualify for the Champions League, which remains realistic, while also aiming for domestic cup runs.What happened to Maresca behind the scenes?Chelsea were satisfied with Maresca at the end of last season when he delivered Champions League qualification - regarded internally as his most important achievement - plus success in the Conference League and Club World Cup.While victory in Europe's third-tier competition was broadly expected, beating Paris St-Germain to be crowned 'world champions' was a welcome surprise.Maresca had delighted key figures at Stamford Bridge - including sporting directors Paul Winstanley and Lawrence Stewart, and influential co-owner Behdad Eghbali.In line with the agreed strategy when the Italian moved from Leicester City in 2024 - for which the club paid £10m - he focused on coaching while those above him oversaw much of the backroom staff, medical department and transfers.Maresca knew what he was signing up for in terms of the transfer policy - signing the world's best young players from 'lesser' leagues to create the youngest team in the Premier League - and his issues were not with the quality of players or the strategy, but about the perception of his work with a young group. Maresca also did not expect decisions on team selection to be influenced.This season, he and his agent had informed the club on two occasions of interest from Manchester City. Chelsea noted it came at a time when City boss Pep Guardiola had said Maresca was the best manager in the league. Maresca had also notified the club of interest from Juventus, as well as his willingness to stay despite interest from two of Europe's biggest clubs.He indicated speculation would end if he was handed a new contract. He was only 18 months into his initial deal and contracted until 2029.Difficulties remained in his working relationship with the Chelsea ownership.The Italian was encouraged to rotate his squad, but often felt that when he did so in the Premier League, they dropped points. He openly urged reporters to question the club's hierarchy but there was frustration each time Maresca sought to make his complaints public rather than discussing internally first.He later admitted his comments after the Everton match were premeditated - rejecting the club's claim they were an emotional outburst after a tense match. After winning two trophies in his first two seasons, Maresca wanted to be seen as more than a project-focused manager, and believes the club stopped him raising his profile.The Italian wanted to take on some external engagements and had floated the idea of publishing a book but was blocked by the club - though this is a claim a source close to Maresca denies. He also spoke at Il Festival dello Sport - an event in Italy organised by La Gazzetta dello Sport newspaper - without their permission.He also made public that he disagreed with the club not signing a central defender after Levi Colwill injured his anterior cruciate ligament in pre-season. The club's hierarchy explained that doing so could prompt academy prospect Josh Acheampong to request a transfer, which ultimately led Maresca to back down.Those close to Maresca, who has switched agents from the Wasserman agency to Jorge Mendes, made it known he was weighing up his future.The last week seemed to be the turning point in Maresca's mind, with Chelsea more keen to make any change of manager in the summer. The home supporters, who Maresca holds in high regard, booed his decisions to take off Cole Palmer in a defeat by Aston Villa and the draw with Bournemouth. Maresca was reportedly told by the medical department he needed to make that change, despite insisting in his news conference his star attacker could complete 90 minutes if he wanted to.All of this after a positive start...After Maresca's side beat Cardiff City in the Carabao Cup in December, supporters chanted his name.They hadn't done so as openly since appearing to be mounting an unlikely title challenge last season, when fans also sang 'We've got our Chelsea back'.But a disappointing run followed, and supporters turned on Maresca both inside the stadium and on social media.Part of the criticism was Maresca seemed a distant, project-focused manager, as fans struggled to move on from the very different and successful era under Roman Abramovich's stewardship.Though he won the Club World Cup, many supporters disliked his communication style and slow, patient football - and influential fans said chants in support of Maresca were largely a protest against the club's BlueCo ownership.That is why Chelsea continued efforts to convince supporters Maresca was the right manager and that the ownership's ultra long-term approach would eventually bring sustained success.Key figures at the club admired Maresca's style of play, insisting it improved players, and that any successor would adopt a similar approach. Further progress was made with team spirit after Mauricio Pochettino had laid the foundations.Regular starters broadly liked Maresca, but - perhaps inevitably - he was less popular on the fringes of the squad. There were complaints after one-off tactical missteps. One player questioned their man-to-man marking approach in a heavy defeat at Manchester City in January 2025, and Maresca said he needed to coach better after a home loss to Brighton, when Chelsea had a player sent off.The club's only real concern in his first season was that he had played down Chelsea's chances of Champions League qualification too much - alienating ambitious fans. There was also a curious moment at the Club World Cup when he awkwardly refused to praise Mexican set-piece coach Bernardo Cueva to a compatriot in the media, despite previously praising coaches closer to him.Maresca also adopted a cold, aggressive tone towards Chelsea's so-called 'bomb squad'. Initially, it proved useful - leaving unwanted players in no doubt they had to leave. But when players such as Raheem Sterling and Axel Disasi failed to secure transfers, the approach became counterproductive, as the Blues have a legal obligation to look after the interests of all players on their books.Sources close to Maresca say he felt he deserved backing similar to that enjoyed by Mikel Arteta at Arsenal, Jurgen Klopp at Liverpool and even Ruben Amorim during his struggles at Manchester United - including a say in shaping the project. Arteta, for example, has significant influence over Arsenal's transfer policy.But at Chelsea, the project is king - and the club are more comfortable seeing another manager slot in, rather than ceding any control.Can Chelsea move forward?Chelsea face a packed January schedule across four competitions.They begin with Sunday's Premier League trip to the Etihad, with a series of London derbies - home and away - against Fulham, Crystal Palace, Brentford and West Ham before the end of the month.In addition, they have an FA Cup third-round tie away to Charlton, a Carabao Cup semi-final first leg against Arsenal, and two Champions League fixtures - at home to Pafos and away to Napoli.Chelsea realistically need to win both European games to avoid the play-off round and secure a top-eight finish in the league phase.The fifth place they occupy in the Premier League may be enough to secure a return to the Champions League for the 2026-27 season.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Enzo Maresca: What went wrong between Chelsea and Maresca?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9ad2/live/d8535560-e708-11f0-bda7-cd77a7bc9f3b.jpg"
      ],
      "datePublished": "2026-01-01T18:21:39.000Z",
      "dateModified": "2026-01-01T18:21:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Puss in Boots: The Last Wish",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002nzvn?at_mid=7iCYilTXXa&at_campaign=Puss_in_Boots_The_Last_Wish&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002nzvn&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Puss_in_Boots_The_Last_Wish&at_bbc_team=BBC&at_creation=Film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0ml96qz.jpg",
    "tag": "Trending",
    "date": "2025-12-26T16:53:25.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomePuss in Boots: The Last WishPuss in Boots: The Last WishTo restore his nine lives, Puss must beat a host of fairy-tale characters to the magical map of the Wishing Star, but a fearful adversary is on his trail. Duration1h 32mFirst shown2022Available for 23 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesMinions: The Rise of GruA villain will rise! In 70s suburbia, Gru plots his world take over. It's not going well1h 20mPuss in BootsNine lives. One destiny. Puss takes on Jack and Jill to get a goose that lays golden eggs1h 21mPaddington 2Magic. Mystery. Marmalade. Paddington's only a small bear... but he’s in big trouble1h 37mPeter RabbitBorn to be wild. Peter had the perfect life, until a new neighbour changed everything1h 25mMinionsIt's going to be a blast. They've had despicable masters, but this one might destroy them1h 24mDespicable Me 2Back to being bad, or maybe a little good. Gru goes undercover to find a new supervillain1h 31mHow to Train Your Dragon 3: The Hidden WorldFly on your own. A fight to the ends of the Earth to save the dragons from evil1h 33mDespicable MeBeing good's SO overrated. Gru’s out to steal the moon - if his heart isn't stolen first1h 28mThe Scarecrows' WeddingTwo devoted scarecrows dream of wedding bliss - until a rival plots to ruin all this25 minsWallace & Gromit: The Curse of the Were-RabbitIt gnaws no fear... The duo's pest control business takes action against a huge rabbit1h 16mShaun the SheepShaun, Bitzer and the flock are always getting into mischiefThe Croods: A New AgeAll in a day's survival. The Croods face their biggest challenge yet - another family!1h 26m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Puss in Boots: The Last Wish",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0ml96qz.jpg"
      ],
      "datePublished": "2025-12-26T16:53:25.000Z",
      "dateModified": "2025-12-26T16:53:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Were our 2025 predictions right? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mpqcjw?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-12-24T07:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·24 Dec 2025,·35 minsAvailable for over a yearWhat did the Americast team get right when they made their predictions for what the big news stories of 2025 might be? Justin, Anthony, Sarah and Marianna look back at a tumultuous year for Donald Trump in his second term, which include deportation raids, Elon Musk’s role, the war in Gaza, the US shutdown and more. It’s time to open up the Americast time capsule of predictions and find out what we got right and what we got wrong…\nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Anthony Zurcher, North America Correspondent\n• Marianna Spring, Social Media Investigations Senior Correspondent \nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray and Grace Reeve. The technical producer was Jonny Hall. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Were our 2025 predictions right? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-12-24T07:00:00.000Z",
      "dateModified": "2025-12-24T07:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Newscast Review of the Year 2025 - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mqch0p?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-24T12:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·24 Dec 2025,·52 minsThe Newscast Review of the Year 2025NewscastAvailable for over a yearAdam, Chris, Laura and Paddy go through the biggest stories of 2025 with the help of economics editor Faisal Islam and international editor Jeremy Bowen.\nThey also reveal what it was like to be on the inside as they happened, and discuss how Keir Starmer will reflect on his first full year as prime minister, how Donald Trump's tariffs reshaped the world's economy, and how a ceasefire between Israel and Hamas was reached.\nAnd we look at where the rise of Nigel Farage’s Reform UK and Zack Polanski’s Green Party have left politics in the UK.\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenters were Adam Fleming, Chris Mason, Laura Kuenssberg and Paddy O’Connell. It was made by Chris Flynn. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Newscast Review of the Year 2025 - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-24T12:00:00.000Z",
      "dateModified": "2025-12-24T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Channel migrant crossings for 2025 highest in three years",
    "url": "https://www.bbc.com/news/articles/c5y3k9z75leo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2ba0/live/0aa5e250-e649-11f0-a14d-bdb5da8c32cf.jpg",
    "tag": "Trending",
    "date": "2026-01-01T15:12:32.000Z",
    "description": "Annual Channel migrant crossings highest since 20225 hours agoBob DaleSouth EastPA MediaSeveral migrants were brought ashore in Dover on 20 DecemberA ",
    "body": "Annual Channel migrant crossings highest since 20225 hours agoBob DaleSouth EastPA MediaSeveral migrants were brought ashore in Dover on 20 DecemberA total of 41,472 migrants crossed the Channel in small boats in 2025 - almost 5,000 more than the previous year.Home Office figures showed a 13% rise on the 36,566 total in 2024.It was the highest number since 2022, when nearly 46,000 migrants crossed.The government says it has already removed 50,000 people who were in the UK illegally and is working more closely with the French government.There were 28 days without any crossings from 15 November to 12 December, which some observers attributed to strong winds in the Channel.Figures from the Home Office then showed 737 people arrived on 13 December, and more than 600 more in the following four days.A total of 803 people arrived in 13 boats on 21 December, a record for a single day in December.The last arrivals of 2025 were on 22 December, when 17 people were brought ashore at Dover.PA MediaHome Secretary Shabana Mahmood announced a major shake up of the asylum system in November.In November the Home Secretary Shabana Mahmood announced major reforms for the asylum process, describing the current system as \"out of control and unfair\".The changes include overseas visas requiring higher qualifications, immigrants will have to wait longer to be allowed residency, overseas students only being allowed to stay for 18 months after graduating and some migrants facing a 20-year wait before being allowed to settle permanently.A Home Office spokesperson said: \"The number of small boat crossings are shameful and the British people deserve better.\"This government is taking action. We have removed almost 50,000 people who were here illegally, and our historic deal with the French means those who arrive on small boats are now being sent back.\"More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Channel migrant crossings for 2025 highest in three years",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2ba0/live/0aa5e250-e649-11f0-a14d-bdb5da8c32cf.jpg"
      ],
      "datePublished": "2026-01-01T15:12:32.000Z",
      "dateModified": "2026-01-01T15:12:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Two killed in clashes between protesters and security forces in Iran",
    "url": "https://www.bbc.com/news/articles/c36810pkz96o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4486/live/1b001130-e729-11f0-b497-893ee467f2f6.jpg",
    "tag": "Trending",
    "date": "2026-01-01T18:18:42.000Z",
    "description": "2 hours agoGhoncheh Habibiazad,BBC PersianandAlys DaviesTwo people are reported to have been killed during growing unrest in Iran on the fifth day of ",
    "body": "2 hours agoGhoncheh Habibiazad,BBC PersianandAlys DaviesTwo people are reported to have been killed during growing unrest in Iran on the fifth day of protests over the soaring cost of living.Both the semi-official Fars news agency and human rights group, Hengaw, said people had died during clashes between protesters and security forces in the city of Lordegan, in south-western Iran.On Thursday videos posted on social media showed cars set on fire during running battles between protesters and security forces. Many protesters have called for ending the rule of the country's supreme leader. Some have also called for a return to the monarchy.Thursday marks the fifth day of protests in cities across the country, sparked by a currency collapse.Videos verified by BBC Persian show protests in the central city of Lordegan, the capital Tehran and Marvdasht in the southern Fars province taking place on Thursday.Fars reported that in Lordegan two people were killed, citing an informed official. The report did not specify whether those killed were protesters or members of the security forces.Rights group Hengaw said the two killed were protesters, naming them as Ahmad Jalil and Sajjad Valamanesh.BBC Persian has not been able to independently verify the deaths.Separately state media said a member of the security forces linked to Iran's Revolutionary Guards (IRGC) was killed in clashes with protesters on Wednesday night in the city of Kudasht, in the western Lorestan province. The BBC has not been able to verify this and protesters say the man was one of their number and was shot dead by the security forces. A further 13 police officers and Basij members were injured by stone throwing in the area, the state media report said.Schools, universities and public institutions were closed across the country on Wednesday after a bank holiday was declared by authorities in an apparent effort to quell the unrest. It was ostensibly to save energy because of the cold weather, though it was seen by many Iranians as an attempt to contain the protests.They began in Tehran - among shopkeepers angered by another sharp fall in the value of the Iranian currency against the US dollar on the open market.By Tuesday, university students were involved and they had spread to several cities, with people chanting against the country's clerical rulers.The protests have been the most widespread since an uprising in 2022 sparked by the death in custody of Mahsa Amini, a young woman who was accused by morality police of not wearing her veil properly. But they have not been on the same scale.To prevent any escalation, tight security is now reported in the areas of Tehran where the demonstrations began.President Masoud Pezeshkian has said his government will listen to the \"legitimate demands\" of the protesters.But the prosecutor general, Mohammad Movahedi-Azad, has also warned that any attempt to create instability would be met with what he called a \"decisive response\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two killed in clashes between protesters and security forces in Iran",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4486/live/1b001130-e729-11f0-b497-893ee467f2f6.jpg"
      ],
      "datePublished": "2026-01-01T18:18:42.000Z",
      "dateModified": "2026-01-01T18:18:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Elvis",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002nzws?at_mid=mGEMw411dH&at_campaign=Elvis&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002nzws&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Elvis&at_bbc_team=BBC&at_creation=Film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mlkz71.jpg",
    "tag": "Trending",
    "date": "2025-12-27T22:12:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeElvisElvisContains some strong language.Elvis Presley's story seen through the lens of his complicated relationship with his enigmatic manager, Colonel Tom Parker. Duration2h 26mFirst shown2022Available for 25 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesCall the MidwifeThe nurses of Nonnatus House face up to a country fizzing with change and challenge.The War Between the Land and the SeaWe inherited their world - they want it back. When oceans rise, whose side do you choose?ShetlandEven the most beautiful places have a dark side. Detective Jimmy Perez returns homeDeath in ParadiseDon't be fooled by the beautiful island of Saint-Marie - even paradise can be murder.OppenheimerCillian Murphy stars as the man who built the bomb - and changed the world forever2h 49mBeyond ParadiseNew adventures for DI Humphrey Goodman. Back from Saint Marie to a new life in DevonFour Weddings and a FuneralHe's quite engaging. She's already engaged. Hugh Grant in Richard Curtis' timeless tale1h 52mReturn to ParadiseComing home can be tough, but sometimes it's murder. An Aussie twist on Death in ParadiseBack to the FutureGreat Scott! The most iconic time-travel adventure ever told, starring Michael J. Fox1h 49mMission: ImpossibleGlobal threats, daring stunts and one agent's fight to save the world. Tom Cruise stars1h 43mPrisoner 951Drama based on the true story of Nazanin Zaghari-Ratcliffe and the struggle to free her.The HolidayKate Winslet stars. Sometimes the heart needs a holiday to find where it truly belongs2h 7m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elvis",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mlkz71.jpg"
      ],
      "datePublished": "2025-12-27T22:12:00.000Z",
      "dateModified": "2025-12-27T22:12:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gladiator Giant to revert to birth surname... Bigg",
    "url": "https://www.bbc.com/news/articles/cy8yxv13192o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1b64/live/0083ec60-e660-11f0-a8f2-d9e8fba7dc3b.jpg",
    "tag": "Trending",
    "date": "2026-01-01T07:09:53.000Z",
    "description": "13 hours agoGeorge TorrEast MidlandsBBCJamie Christian-Johal - who appears on the BBC show under the name Giant - is reverting to his previous surname",
    "body": "13 hours agoGeorge TorrEast MidlandsBBCJamie Christian-Johal - who appears on the BBC show under the name Giant - is reverting to his previous surname of BiggGladiators star Jamie Christian-Johal - who appears as Giant on the BBC show - has announced he is reverting to his former surname of Bigg.The former professional bodybuilder and firefighter, from Ilkeston in Derbyshire, has become a fan favourite on the rebooted series over the past two years.He said he was dropping his double-barrelled surname following his divorce and a recent diagnosis of attention-deficit hyperactivity disorder (ADHD).Posting on social media, he said: \"At my birth, believe it or not was Jamie Bigg. So in 2026, I'll be reclaiming my birth name and making some big changes.\"The 6ft 5in (1.96m) star, who has 52cm biceps and eats 10,000 calories a day to maintain his physique, has appeared on Gladiators since its return in 2024 and is currently playing The Giant in a production of Jack and the Beanstalk in Chesterfield.He said the name change was borne out of a desire to re-establish his own identity.Gladiators has been a big hit since returning in 2024Addressing his followers on Instagram, he said: \"You'll never believe what my original name was on my birth certificate... at the age of four, I lost my identity [when] I became Johal when my mum got married.\"For many years, I hid behind my physique as a bodybuilder and even double-barrelled my surname when I got married.\"I then went on a TV show and became a character and now that character's more well known than I am. So who am I? Who is Jamie?\"Turning 40 and getting my ADHD diagnosis and going through a divorce really reinforced the need and desire to have my own identity again.\"At my birth, believe it or not was Jamie Bigg. So in 2026, I'll be reclaiming my birth name and making some big changes.\"I want to move forward with the greatest amount of transparency in all walks of my life.\"So whether that's speaking on my ADHD diagnosis and journey or helping with your fitness goals, being the best father possible or just being a better human overall, I'll be entering 2026 as me, Jamie Bigg.\"More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gladiator Giant to revert to birth surname... Bigg",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1b64/live/0083ec60-e660-11f0-a8f2-d9e8fba7dc3b.jpg"
      ],
      "datePublished": "2026-01-01T07:09:53.000Z",
      "dateModified": "2026-01-01T07:09:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dad pays tribute to 'wonderful family' killed in Stroud Boxing Day fire",
    "url": "https://www.bbc.com/news/articles/c14r88ylvl1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c667/live/abf192b0-e6ff-11f0-b67b-690eb873de1b.jpg",
    "tag": "Trending",
    "date": "2026-01-01T12:16:18.000Z",
    "description": "8 hours agoAlexandra BassinghamWest of EnglandFacebookFionnghuala Shearman and her daughter Eve and son Ohner died in the fire on Boxing DayA man whos",
    "body": "8 hours agoAlexandra BassinghamWest of EnglandFacebookFionnghuala Shearman and her daughter Eve and son Ohner died in the fire on Boxing DayA man whose wife and two children died in a Boxing Day fire has paid tribute to his \"wonderful family\". Tom Shearman escaped the fire after it engulfed their home on Brimscombe Hill in Stroud, Gloucestershire, killing seven-year-old Eve, four-year-old Ohner, and their mother, Fionnghuala Shearman, known as Nu.\"I cannot begin to describe the anguish and trauma of the events of Boxing Day 2025,\" he said in a tribute released by Gloucestershire Constabulary.\"My family had its very core, its very essence, ripped from it in the most violent way.\"Mr Shearman, a serving police officer with the Gloucestershire force, escaped the burning house and tried multiple times to re-enter to save his family.He said in the tribute: \"I have stared at my keypad for what seems like an eternity waiting for the words to appear. \"I have no way to thank any of you for the unbelievable out-of-this-world generosity that you have shown to me in the darkest of hours.\"PAMr Shearman was unable to regain entry to the house after trying multiple timesMr Shearman continued: \"My life, the lives of my loved ones, my friends and the whole community changed on Boxing Day.\"Most importantly, and tragically, three of the greatest humans to ever grace our presence were taken from not just me, but all of us.\"The mother and father were woken by the fire and Mr Shearman smashed his way out through the bathroom window to try and reach their children in the back bedroom.But he was unable to because of the \"ferocity and heat\" of the blaze, Det Supt Ian Fletcher said.Police believe the fire started on the ground floor and investigations are ongoing to establish the cause, but it is not being treated as suspicious.The bodies of the mother, two children and the family dog, Hutch, have all been recovered from the property.Floral tributes have been placed near the homeHundreds of thousands of pounds in donations has been raised to support Mr Shearman in the wake of the tragedy.The police officer said he was \"humbled beyond comprehension\" by the generosity and had started a plan to \"make sure my unbelievably talented, empathetic, compassionate and beautiful wife's legacy of craft, design and making lives on\".He said he wanted to ensure \"that my bright spark Eve's legacy of enjoyment from books and writing be carried on\" as well as his \"incredible son's sheer compassion and desire to help people\".\"I thank each and every one of you for your donations. I shall forever be in your debt and you will now forever be in my thoughts and prayers, hopefully I can repay in some way,\" he said.He urged people to take \"every opportunity to hug your loved ones and tell them you love them\".\"Because, as [Brazilian author] Paulo Coelho said, one day you will wake up and there won't be any more time to do the things you want. Do it now,\" he said.\"My heartfelt thanks to the emergency services whom tried everything to save my wonderful family. I hope they are all being looked after by their colleagues and friends. Boxing Day was horrific for all involved.\"Now go light up the darkest corners and the black sky.\"In memory of Nu. Eve. Ohner. Hutch.\"More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dad pays tribute to 'wonderful family' killed in Stroud Boxing Day fire",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c667/live/abf192b0-e6ff-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2026-01-01T12:16:18.000Z",
      "dateModified": "2026-01-01T12:16:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Disbelief as tragedy hits Swiss ski resort on New Year's Day",
    "url": "https://www.bbc.com/news/articles/c70lwkk4zkro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8cc9/live/bcbd2dd0-e72b-11f0-b497-893ee467f2f6.jpg",
    "tag": "Trending",
    "date": "2026-01-01T16:04:02.000Z",
    "description": "4 hours agoSilvia CosteloeCrans-MontanaWatch: BBC reports from the scene of Swiss resort bar fireThere is sheer disbelief on people's faces here, conf",
    "body": "4 hours agoSilvia CosteloeCrans-MontanaWatch: BBC reports from the scene of Swiss resort bar fireThere is sheer disbelief on people's faces here, confronted by this tragedy - they just can't believe it.I've been coming to Crans-Montana all my life, and this is a wonderful ski resort that just keeps getting bigger and bigger.There's a lot of building going on all the time. It's a place where there's a lot of money and a lot of great skiing. It's very family friendly and there are lots of children.In the summer they've got golf, in the winter they've got skiing, there are mountain bike trails. It's a really popular destination year round, quite a high-end market, and not the kind of place where you would expect a fire to engulf a bar.Le Constellation is somewhere I used to go to when I was much younger. It's a really classic bar.It's very big and right smack in the centre of Crans just by the cinema, and somewhere a lot of locals as well as tourists would be hanging out.This is a bar where lots of young people went. There will be people who are unsure if those they knew were out there, who are trying to trace them.Earlier today, I was speaking to a woman who asked: \"What is happening in the world if you can't go to a bar now in Crans-Montana?\" A British tourist told me he'd heard all these ambulances and just thought people had taken the drinking too far.LATEST UPDATES: Read more about the Swiss ski resort fire'I hid from a wall of heat': Eyewitnesses describe escapeWhat we know so far about how the fire broke outBut, of course, what it actually involved is this horrible tragedy.It's hard to imagine that something like that would happen here, in a place where there's money, very good levels of health and safety, great infrastructure and where police arrived at the scene pretty much immediately.ReutersPeople leave flowers outside Le ConstellationThis morning I woke up to go skiing, but when I saw what had happened I came to the scene instead.The cordoned off area is usually the beating heart of Crans. Initially it was incredibly quiet. I got there before they had erected this huge wall outside the bar. In the early hours of New Year's Day, people were sleeping off their hangovers and their partying, so the police presence gave the scene an almost eerie quality.Now more and more media tripods are going up. People started waking up - some had their skis on - and they all just came up against the cordon and asked what was going on. Some people had not heard yet.Increasingly however small huddles of people are talking about it. Some people have been sharing their stories of a really tragic and horrific night - how they saw people with severe burns, and how they escaped the burning bar by smashing a window.Others are looking in total disbelief at the police cordon in this very well-to-do Swiss Alpine resort. The size of the cordon, the amount of disruption and the number of closed roads all indicate a major disaster.It's just completely shocking.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Disbelief as tragedy hits Swiss ski resort on New Year's Day",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8cc9/live/bcbd2dd0-e72b-11f0-b497-893ee467f2f6.jpg"
      ],
      "datePublished": "2026-01-01T16:04:02.000Z",
      "dateModified": "2026-01-01T16:04:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Netherlands police face 'unprecedented' New Year's violence",
    "url": "https://www.bbc.com/news/articles/c3r1lx75nl8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/51af/live/72cf5e40-e709-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2026-01-01T13:30:09.000Z",
    "description": "Watch: Huge fire rips through historic Amsterdam church during New Year celebrationsPolice in the Netherlands were pelted with fireworks and faced an ",
    "body": "Watch: Huge fire rips through historic Amsterdam church during New Year celebrationsPolice in the Netherlands were pelted with fireworks and faced an \"unprecedented amount of violence\" on New Year's Eve, officers have said.A 19th century church in Amsterdam was engulfed by fire in the early hours of New Year's Day, although the cause of the blaze is not yet known.The Vondelkerk, which overlooks the largest park in the city, the Vondelpark, has been a tourist attraction since it was built in 1872.Elsewhere in the Netherlands, a 17-year-old boy and 38-year-old man were killed in fireworks incidents. In Bielefeld, Germany, local police said two 18-year-olds died after setting off homemade fireworks.The head of the Dutch Police Union, Nine Kooiman, said she had been pelted by fireworks and other explosives on her shift in Amsterdam.The amount of violence was \"unprecedented\" she said.Reports of attacks against police and firefighters were widespread across the country. Petrol bombs were thrown at police in the southern city of Breda. In Rotterdam, the city's eye hospital said it had treated 14 patients, including 10 minors, for eye injuries. Two received surgery.A 17-year-old boy from Nijmegen and a 38-year-old man from Aalsmeer were killed in fireworks incidents, local media reported.In Amsterdam the 50-metre high tower of the historic Vondelkerk church collapsed. Authorities said the roof was badly damaged but the structure was expected to remain intact.The neo-Gothic basilica was designed by architect Pierre Cuypers whose works also include the Rijksmuseum. A ban on unofficial fireworks is due to come into force in 2026. According to the Dutch Pyrotechnics Association, a record €129m (£112m) had been spent on them this year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Netherlands police face 'unprecedented' New Year's violence",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/51af/live/72cf5e40-e709-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2026-01-01T13:30:09.000Z",
      "dateModified": "2026-01-01T13:30:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US military says five killed in strike on alleged drug boats",
    "url": "https://www.bbc.com/news/articles/czdq1ple2l4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fb7a/live/28724790-e6e6-11f0-b67b-690eb873de1b.png",
    "tag": "Trending",
    "date": "2026-01-01T10:19:32.000Z",
    "description": "10 hours agoVanessa BuschschlüterUS Southern CommandA screengrab from a video posted by US Southern Command shows a small vessel in the sea with what ",
    "body": "10 hours agoVanessa BuschschlüterUS Southern CommandA screengrab from a video posted by US Southern Command shows a small vessel in the sea with what appears to be debris floating nearby.The US military says it struck two boats it alleges were carrying drugs on Wednesday, killing five people on board.US Southern Command did not say where it had carried out the latest strikes but US forces have been targeting vessels they suspect of smuggling narcotics through the Caribbean and eastern Pacific for the past three months. Wednesday's strike came a day after the US targeted what it said were \"three narco-trafficking vessels travelling as a convoy\", killing at least three people.The Trump administration has cast its operations as a non-international armed conflict with the alleged traffickers but legal experts say they could be in violation of the laws governing such conflict.In total, there have been more than 30 strikes on vessels as part of the Trump administration's \"war on drugs\" with more than 110 people killed since the US carried out its first attack on a boat in international waters on 2 September. That first attack has come under particular scrutiny from lawmakers in Washington since it emerged that US forces struck the targeted boat twice.Two people who had survived the first strike and were clinging to the hull of their boat were killed in the second. Some lawmakers expressed concern that the \"double-tap\" strike breached the rules of engagement. In its post announcing the strike on a convoy of three boats carried out on 30 December, US Southern Command said that there had been a number of survivors, without specifying how many.It said that \"the remaining narco-terrorists abandoned the other two vessels, jumping overboard and distancing themselves before follow-on engagements sank their respective vessels\". It added that the US Coast Guard had been \"immediately notified\" to search for the survivors.Reuters news agency reports that it was told by a US official who asked to remain anonymous that eight survivors were being searched for.It is not yet clear if any of them have been found. The US has provided no evidence that the boats it has targeted are carrying drugs but in its most recent post, Southern Command again insisted that \"intelligence confirmed the vessels were transiting along known narco-trafficking routes and engaged in narco-trafficking\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US military says five killed in strike on alleged drug boats",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fb7a/live/28724790-e6e6-11f0-b67b-690eb873de1b.png"
      ],
      "datePublished": "2026-01-01T10:19:32.000Z",
      "dateModified": "2026-01-01T10:19:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shamima Begum: Home secretary to 'robustly defend' citizenship decision",
    "url": "https://www.bbc.com/news/articles/c3wzp693nv3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/67bf/live/0b0da7c0-e6ec-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2026-01-01T09:01:43.000Z",
    "description": "Government to defend decision to strip Begum's UK citizenship11 hours agoSuzanne LeighSam Tarling/Getty ImagesThe home secretary will \"robustly defend",
    "body": "Government to defend decision to strip Begum's UK citizenship11 hours agoSuzanne LeighSam Tarling/Getty ImagesThe home secretary will \"robustly defend\" the decision to strip Shamima Begum of her British citizenship, as European judges scrutinise the move, according to a government source.The European Court of Human Rights (ECHR) has called for an investigation, but a government source said the decision had already been upheld by UK courts.Ms Begum was 15 when she travelled from east London to the Middle East, to a territory held by the Islamic State group, where she married a fighter.Now 26, she was subsequently stripped of her British citizenship on the grounds that she posed a threat to national security but her lawyers say this failed to consider whether she was a victim of grooming and trafficking.The ECHR has asked the Home Office whether ministers at the time considered whether Ms Begum had been a victim, and whether the UK had obligations to her.But a government source said: \"The home secretary will robustly defend the decision to revoke Shamima Begum's citizenship, which has been tested and upheld time and again in our domestic courts.\"The home secretary will always put this country's national security first.\"In a document published by the ECHR earlier this month, it states that Ms Begum is challenging the decision to revoke her British citizenship under Article 4 of the European Convention of Human Rights - prohibition of slavery and forced labour.The case was lodged in December 2024 after the UK's Supreme Court denied her the chance to challenge the decision.The four questions posed by judges in Strasbourg to the Home Office, include: \"Did the Secretary of State  have a positive obligation, by virtue of Article 4 of the Convention, to consider whether the applicant had been a victim of trafficking, and whether any duties or obligations to her flowed from that fact, before deciding to deprive her of her citizenship?\"Ms Begum was born in the UK to parents of Bangladeshi heritage and was 15 when she left Bethnal Green, east London, with two schoolfriends in 2015 to support the Islamic State group.She had married an Islamic State fighter soon after arriving and went on to have three children, none of whom survived.She was later found in a refugee camp in Syria and a tribunal ruled in February 2020 that because she was \"a citizen of Bangladesh by descent\" removing her British nationality would not make her stateless.A series of appeals were made, ending in the decision that she would not be allowed to challenge it at the Supreme Court.Lawyer Gareth Pierce, who is representing Ms Begum, said it was \"impossible to dispute\" that a 15-year-old was \"lured, encouraged and deceived for the purposes of sexual exploitation to leave home and travel to Isil-controlled territory\".She added: \"It is equally impossible not to acknowledge the catalogue of failures to protect a child known for weeks beforehand to be at high risk when a close friend had disappeared to Syria in an identical way and via an identical route.\"It has already been long conceded that the then home secretary, Sajid Javid, who took the precipitous decision in 2019 very publicly to deprive Ms Begum of citizenship, had failed entirely to consider the issues of grooming and trafficking of a school child in London and of the state's consequent duties.\"The Conservatives said Ms Begum should not be allowed to return to the UK \"under any circumstances\".Shadow home secretary Chris Philp said Ms Begum \"chose to go and support the violent Islamist extremists\".He added: \"She has no place in the UK and our own Supreme Court found that depriving her of citizenship was lawful.\"It is deeply concerning the European Court of Human Rights is now looking at using the ECHR to make the UK take her back.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shamima Begum: Home secretary to 'robustly defend' citizenship decision",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/67bf/live/0b0da7c0-e6ec-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2026-01-01T09:01:43.000Z",
      "dateModified": "2026-01-01T09:01:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eyewitnesses describe tragedy of Swiss ski resort fire",
    "url": "https://www.bbc.com/news/articles/clyml77ml7jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/30e4/live/44ed7fe0-e72f-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2026-01-01T16:24:02.000Z",
    "description": "4 hours agoSilvia Costeloe and Ben TobiasCrans-Montana and LondonThis story contains details some readers may find upsetting. \"I thought my little bro",
    "body": "4 hours agoSilvia Costeloe and Ben TobiasCrans-Montana and LondonThis story contains details some readers may find upsetting. \"I thought my little brother was inside so I came and tried to break the window to help people to exit, and after that I went in.\"The 18-year-old man, who did not want to give his name, was speaking to the BBC after a huge fire at a New Year's Eve party in the Swiss resort of Crans-Montana rapidly turned what was an evening of celebration into a nightmare.Police say dozens of people are presumed to have died when the blaze broke out in a bar called Le Constellation at around 01:30 local time (00:30 GMT) on Thursday. Around 100 more were injured, mainly with severe burns.LATEST UPDATES: Read more about the Swiss ski resort fireDisbelief as tragedy hits Swiss ski resort on New Year's DayWhat we know so far about how the fire broke outThe eyewitness told the BBC he was close to the bar when he heard a big explosion, followed by a lot of smoke.As others tried to escape, he went in, looking for his brother. Once inside, he described a scene of horror.\"I saw people burning... I found people burning from head to foot, no clothes anymore,\" he said, adding: \"It was very shocking.\" His brother was unharmed.\"I went in this bar every day this week - the day I didn't go, it burned,\" he said.Firefighters and medics quickly took over, he said, but he tried to help where he could, offering water and clothes to the injured.Just minutes earlier, locals and tourists were celebrating the arrival of 2026 during one of the busiest holiday periods of the year for Alpine ski resorts.Le Constellation is a large bar with space for around 300 people spread over two floors and a terrace, although it is not known how many people were in the bar at the time.Two French women, Emma and Albane, told French media outlet BFMTV that they were inside when the fire started.They said they believed it began when a waitress put \"birthday candles\" on top of some champagne bottles.\"In a matter of seconds, the entire ceiling was ablaze. Everything was made of wood,\" they said, adding that the flames \"started to rise very quickly\".Evacuation was \"very difficult\", Emma and Albane said, because the escape route out of the room they were in was \"narrow\" and the stairs leading outside were \"even narrower\".\"We were very lucky,\" they added, claiming there were \"about 200 people trying to get out within 30 seconds through some very narrow steps\".Another teenager who was inside the bar told the BBC how he was forced to hide from a \"wall of heat\" before managing to escape up the stairs.Still, he could not get out so tried to break a window with a table. But it was only when he used his foot to smash through the glass that he was able to make it out alive.The intensive care unit at the nearest hospital quickly filled up and some patients have been sent elsewhere for treatment, including to Milan in neighbouring Italy. Among those who heard the tragedy unfold was Oleh Paska, who is visiting Crans-Montana with his wife and child.He told the BBC they had just celebrated the New Year in their hotel room around 50m (160ft) from the bar when they heard a series of explosions, which they initially thought were firecrackers. They heard someone crying outside but thought at first that a fight had broken out. It was only when emergency services began to arrive, with the \"different types of sirens\" signalling the arrival of ambulances, police and firefighters, that they realised something was wrong. By Thursday, the area which is usually teeming with tourists was unusually quiet, Mr Paska said. An atmosphere of shock hung over the town of Crans-Montana on Thursday, after the scenes of chaos and tragedy overnight. Italy's ambassador to Switzerland has said it could take weeks for all of the victims to be identified, with the country's foreign minister saying identification would be difficult due to the severe burns.For now, friends and relatives nervously wait for news of loved ones. An Italian man said one of his friends who was in the bar at the time was \"burned all over\", while another was taken to Zurich by helicopter. \"Another friend of ours... last night we had no news, he couldn't be found,\" he told Italian public broadcaster Rai News. \"My friends and I, we haven't slept last night, we've barely eaten,\" he added. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eyewitnesses describe tragedy of Swiss ski resort fire",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/30e4/live/44ed7fe0-e72f-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2026-01-01T16:24:02.000Z",
      "dateModified": "2026-01-01T16:24:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]