[
  {
    "title": "Banned in the 80s: Moments That Shook Music",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002k85n?at_mid=XZLfF6kcDM&at_campaign=Banned_in_the_80s_Moments_That_Shook_Music&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002k85n&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Banned_in_the_80s_Moments_That_Shook_Music&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0m3w047.jpg",
    "tag": "Trending",
    "date": "2025-09-27T21:22:31.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistBanned in the 80s: Moments That Shook MusicContains very strong language.Contains discriminatory languageDocumentary revealing the untold stories behind the most controversial music of the 1980s, featuring Frankie Goes to Hollywood, Queen, George Michael, N.W.A, Madonna and others. Duration55 minsFirst shown27 Sep 2025Available for 11 monthsWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesWhen Bruce Springsteen Came to BritainBorn in the USA, made in the UK. The Boss explains why Britain is so special to him59 minsSimple Minds: Everything Is PossibleDaring to dream. The inspirational story of Scotland's biggest band1h 27mSimon & Garfunkel: The Harmony GameInspiration – and separation. The stormy relationship that created beautiful music1h 11mWhen Tina Turner Came to BritainLet’s stay together. From 60s starlet to 80s comeback queen, a career built in Britain59 minsWham!: Last Christmas Unwrapped40 years a festive favourite. Andrew, Pepsi and Shirlie revisit Wham!’s winter wonderland59 minsDionne Warwick: Don't Make Me OverWhat the world needs now... How a sublime voice found a second life as a call for change1h 32mBryan Ferry and Roxy Music: A Musical HistoryDocumentary exploring the music of rock band Roxy Music and its frontman Bryan Ferry.58 minsCarole King and James Taylor: Just Call Out My NameLong ago and far away. Two sensational solo artists created the perfect partnership1h 33mLive Aid at 40: When Rock ’n’ Roll Took on the WorldNot just for one day. The creation and legacy of a concert that changed everythingSharon & Ozzy Osbourne: Coming HomeRock legend Ozzy's final chapter as Birmingham’s favourite son - and family - return home59 minsMr Blue Sky: The Story of Jeff Lynne and ELOThe pioneer of progressive pop – from the Brum beat scene to huge hits all over the world57 minsSince Yesterday: The Untold Story of Scotland's Girl BandsPopstars, punks and pioneers. Defiant trailblazers who rocked a mostly male music world1h 30m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Banned in the 80s: Moments That Shook Music",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0m3w047.jpg"
      ],
      "datePublished": "2025-09-27T21:22:31.000Z",
      "dateModified": "2025-09-27T21:22:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC News - Newscast, Israel-Gaza: The Ceasefire Is Now \"In Effect\"",
    "url": "https://www.bbc.co.uk/programmes/p0m7y2cg?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-10-10T15:36:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live             \n\n        \n    \n        \n        \n                            Palestinians begin returning to Gaza's north.\n                        \n                Show more\n            \n        \n        \n                            Today, the Israeli military says the ceasefire in Gaza is now in effect. \n                            Troops have positioned themselves along the lines agreed under the Trump plan, the IDF says - but will continue to \"remove any immediate threat\". It comes after the Israeli government approved a deal with Hamas which will also see the release of hostages.\n                            Hamas now has 72 hours to release all Israeli hostages, while Israel will release hundreds of Palestinian detainees. Adam is joined by Lyse Doucet, chief international correspondent. \n                            And Adam, Chris and Dharshini are joined by Sarah Montague, presenter of the World At One, to round up the political week. \n                            You can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \n                            You can join our Newscast online community here: https://bbc.in/newscastdiscord\n                            Get in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\n                            New episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\n                            Newscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Miranda Slade and Shiler Mahmoudi. The social producer was Sophie Millward. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.\n                        \n                Show less\n            \n        \n    \n        \n                            \n                                    Available now\n                            \n                    \n                45 minutes\n            \n                    \n    \n    \n            \n                                    \n                        Timings (where shown) are from the start of the programme in hours and minutes\n                    \n                                    \n                                                    \n    \n            \n                .\n            \n            \n                                            \n                            \n            \n                                \n                                    \n                                        \n    \n                \n            \n    \n                Newscast\n    \n                The latest on Israel-Gaza ceasefire agreement.\n            \n    \n\n                                    \n                                \n                            \n        \n        \n                        \n                ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC News - Newscast, Israel-Gaza: The Ceasefire Is Now \"In Effect\"",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-10-10T15:36:00.000Z",
      "dateModified": "2025-10-10T15:36:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Big Cases - Murdered by his Grandparents",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002j88v?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0lz3f5r.png",
    "tag": "Trending",
    "date": "2025-10-03T15:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistThe Big Cases - Murdered by his GrandparentsContains some upsetting scenes.The tragic case of two-year-old Ethan, who was killed by his grandparents. A police investigation unraveled a horrific story of brutal abuse by those who should have cared for and nurtured him. Duration29 minsFirst shown3 Oct 2025Available for 11 monthsWatchlistAudio DescribedSign LanguageEpisodesEpisodes EpisodesThis episodeMurdered by his GrandparentsThe Sycamore Gap - From Roots to RuinAn ancient tree, symbolising a community, is chopped down overnight. Who did it and why?26 minsThe Aristocrat, the Convict and the Missing BabyAn aristocrat and her convict partner go on the run with their newborn, ending in tragedy.29 minsThe Predator Who Fled to ParadiseThe shocking tale of a predator who fled to paradise for almost three decades.25 minsThe Bus Stop MurderThe tragic story of a schoolgirl who was stabbed to death in a row about a teddy bear.27 minsNeighbour, Friend, KillerWendy Buckney knew about her neighbour's past but wanted to give him a second chance.21 minsThe Mistaken Identity Murders The shocking story of two innocent teenagers murdered in a case of mistaken identity.30 minsMy Husband the MonsterThe shocking story of Gisele Pelicot, raped by strangers her husband invited to abuse her.29 minsTortured Behind Closed DoorsThe tragic story of Sara Sharif who was brutally killed by her father and stepmother.35 minsStabbed After SchoolThe shocking story of how a teenage relationship ended in murder. 28 minsThe Abuser HeadteacherThe story of a respected head who abused his power and became a convicted sex offender.29 minsCrushed: The Six Year NightmareSix years after surviving a horror smash, Monika died. It was time for justice, again.21 minsThe House Party MurderHow a house party turned into a murder scene - the fatal stabbing of Mikey Roynon.28 minsKiller In The AtticWhen a man is stabbed to death outside a nightclub, armed police search for his killer.25 minsThe Dance Floor MurderThe story of footballer Cody Fisher who was stabbed to death in a nightclub in Birmingham.26 minsThe Executioner Next DoorThe true story of the Army’s killer agent inside the IRA.\n25 minsThe Nottingham AttacksIn the summer of 2023, the lives of three families changed forever.29 minsHeld Captive And Left To DieShakira Spencer was tortured and starved by people she considered friends.23 minsKilled In The ParkBrianna Ghey was stabbed to death - two teenagers tried to get away with murder.26 minsThe Student Who Never Came HomeKidnapped and murdered while on a gap year in France. Is it finally time for justice?25 minsThe Doping WardThe hospital unit where patients were drugged to keep them 'quiet and compliant'.26 minsKilled By My BoyfriendThe story of a young mum killed by her boyfriend of eight weeks.22 minsThe Commons CriminalThe MP who rose from obscurity to being imprisoned for fraud. The story of Jared O'Mara.23 minsThe Missing MumLinda Razzell was murdered by her husband in 2002 - will he now reveal where her body is?22 minsDeadly InfluenceThe story of a social media influencer, her mum and a murder plot.26 minsUnmasking a FugitiveThe story of Nicholas Rossi, the US fugitive who came to the UK with a new identity.30 minsKilled on DutyThe story of how a handcuffed prisoner shot dead Sgt Matt Ratana in 2020.21 minsThe Killing in the LaneLilia Valutyte died from a single stab wound in her chest. Who killed the nine-year-old?17 minsKilled on Christmas EveElle Edwards was shot dead as she celebrated at Christmas in a murder that shocked the UK32 minsThe Sunshine ScammerThe bogus travel agent who conned hundreds of holidaymakers and her own family.28 mins30 Years For JusticeNikki Allan's murder shocked Sunderland. Why did it take so long to catch her killer?26 minsCaught In The CrossfireNine year old Olivia Pratt-Korbel was killed when shots were fired into her family home.28 minsThe Lie That Destroyed a TownThe story of false accusations about being the victim of a grooming gang.30 minsHomegrown TerroristCould the Manchester Arena bombing have been stopped?24 minsTwenty Minutes Of TerrorA gunman kills five people within minutes. Could the shootings have been prevented?20 minsFound Under the FloorThe story of Bennylyn and Jellica who were murdered after starting a new life in the UK.23 minsPagination controlsPrevious1Page 1 of 22Page 2 of 2Next",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Big Cases - Murdered by his Grandparents",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0lz3f5r.png"
      ],
      "datePublished": "2025-10-03T15:00:00.000Z",
      "dateModified": "2025-10-03T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-10-11T04:34:42.000Z",
    "description": "Updated 11 October 2025 05:34 BSTBritain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere els",
    "body": "Updated 11 October 2025 05:34 BSTBritain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-10-11T04:34:42.000Z",
      "dateModified": "2025-10-11T04:34:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tens of thousands attend pro-Palestinian march in London",
    "url": "https://www.bbc.com/news/articles/cewnwgnqj2qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6f4f/live/b1807ac0-a6a4-11f0-a409-e197032d359e.jpg",
    "tag": "Trending",
    "date": "2025-10-11T17:17:54.000Z",
    "description": "4 hours agoMaia DaviesGetty ImagesProtesters marched over Westminster Bridge towards WhitehallTens of thousands of pro-Palestinian protesters have gat",
    "body": "4 hours agoMaia DaviesGetty ImagesProtesters marched over Westminster Bridge towards WhitehallTens of thousands of pro-Palestinian protesters have gathered in central London a day after a ceasefire between Israel and Hamas came into effect in Gaza.The demonstration, organised by the Palestine Coalition, began along Victoria Embankment on Saturday afternoon - attendees then marched on Whitehall, where a rally was held.Images showed a sea of Palestinian flags being carried over Westminster Bridge while a small group of counter-protesters gathered nearby, with many holding Israeli flags and signs calling for the return of hostages.The Metropolitan Police said it had made 14 arrests for offences including breaching Public Order Act conditions, affray and supporting a proscribed group.It made a number of arrests after a small group of counter-protesters breached conditions \"by demonstrating at the form-up point of the Palestine Coalition protest\", leading to a \"scuffle\" with members of the march.\"Officers were quickly on the scene to separate those involved,\" the force said.As the protest began, stalls were selling keffiyeh scarves while people handed out placards for protesters. During the march, slogans such as \"stop arming Israel\" and \"free Palestine\" could be seen.The director of Palestine Solidarity Campaign, one of the groups involved in the action, said it would \"never stop\" supporting Palestinians.Ben Jamal said Israel was \"capable of breaking the ceasefire at any time\" and that the ceasefire plan did \"nothing to address the root causes\" of the conflict.At the rally, speakers referred to the US-brokered ceasefire as a positive but \"precarious\" development - adding they would not stop protesting until Palestinians were fully free.The ceasefire kicked in after the Israeli government approved the first phase of US President Donald Trump's ceasefire and hostage return deal on Thursday, but the next phases are still being negotiated.Many of the details for the later phases could be hard to reach an agreement on, such as the governance of Gaza, the extent of Israeli troop withdrawal, and the disarming of Hamas.PA MediaA small crowd of counter-protesters - from a group calling itself Stop the Hate - also gathered near the marchThe protest comes days after the prime minister said the UK government could consider pursuing more curbs on protest laws, including targeting some of the chants used at pro-Palestinian demonstrations.Sir Keir Starmer said he wanted to \"go further\" than the measures announced a week prior, granting police forces broader powers to restrict repeat protests.He had separately called for such protests to be postponed after the terror attack at a synagogue in Manchester last week, which killed two Jewish people - urging demonstrators to \"respect the grief of British Jews\".However, demonstrations in support of the Palestine Action group did go ahead last week, with nearly 500 people arrested in central London.The Met said 488 of the arrests were for supporting a proscribed organisation, with the youngest person held being 18 and the oldest 89.The Israeli military launched a campaign in Gaza in response to the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.Since then, more than 67,000 Palestinians have been killed, including more than 18,000 children, the Hamas-run health ministry says.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tens of thousands attend pro-Palestinian march in London",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6f4f/live/b1807ac0-a6a4-11f0-a409-e197032d359e.jpg"
      ],
      "datePublished": "2025-10-11T17:17:54.000Z",
      "dateModified": "2025-10-11T17:17:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lostprophets singer Ian Watkins dies in prison attack",
    "url": "https://www.bbc.com/news/articles/cm2d2me0eljo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dd93/live/cff02cb0-a6c4-11f0-92db-77261a15b9d2.jpg",
    "tag": "Trending",
    "date": "2025-10-11T17:49:44.000Z",
    "description": "3 hours agoHolly HarrisonBBC WalesSouth Wales PoliceThe disgraced rock star from Pontypridd was serving a 29-year sentence at HMP Wakefield for child ",
    "body": "3 hours agoHolly HarrisonBBC WalesSouth Wales PoliceThe disgraced rock star from Pontypridd was serving a 29-year sentence at HMP Wakefield for child sex offencesLostprophets singer Ian Watkins has died after being attacked in jail, prison sources have confirmed.The disgraced rock star from Pontypridd was serving a 29-year sentence at HMP Wakefield for child sex offences.West Yorkshire Police said they were called to the prison on Saturday morning to an assault on a prisoner, who was pronounced dead at the scene.Watkins, 48, was jailed in December 2013 for a string of child sex offences, including the attempted rape of a baby.A Prison Service spokesperson said it was aware of an incident at the prison. \"We are unable to comment further while the police investigate.\"He was attacked with a knife by another inmate, PA reported, citing sources.Police said detectives were investigating and inquiries ongoing at the scene.He was attacked in prison in August 2023, but his injuries were not life threatening.Watkins was sentenced to 29 years in prison with a further six years on licence, and his two co-defendants, the mothers of children he abused, were jailed for 14 and 17 years.The attack at Wakefield Prison comes less than two weeks after a report into the facility was published that found violence there had \"increased markedly\".The report from the chief inspector of prisons said: \"Many prisoners told us they felt unsafe, particularly older men convicted of sexual offences who increasingly shared the prison with a growing cohort of younger prisoners.\"Police were called to Wakefield Prison on Saturday morningWatkins admitted the attempted rape and sexual assault of a child under 13 but pleaded not guilty to rape.He also admitted conspiring to rape a child, three counts of sexual assault involving children, seven involving taking, making or possessing indecent images of children and one of possessing an extreme pornographic image involving a sex act on an animal.Judges rejected an appeal by Watkins in 2014 to reduce the length of his jail term.During sentencing, Mr Justice Royce said the case broke \"new ground\" and \"plunged into new depths of depravity\".\"Any decent person... will experience shock, revulsion and incredulity.\"The judge said Watkins had a \"corrupting influence\", and had shown a \"complete lack of remorse\".As a rock star in his 20s, Watkins sold millions of albums around the world and commanded huge arena crowds.Formed in 1997, Welsh rock band Lostprophets released five studio albums in total, including a number one album in the UK and two top 10 singles.Getty ImagesWatkins performing in London a few months before his arrest in 2012They also saw some success in the US, where their second and third albums both reached the top 40.After Watkins was sentenced, Des Mannion, NSPCC national head of service for Wales, said: \"Watkins used his status and global fame as a means to manipulate people and sexually abuse children.\"But we must nevertheless remember that this case isn't about celebrity, it's about victims. And those victims are children.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lostprophets singer Ian Watkins dies in prison attack",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dd93/live/cff02cb0-a6c4-11f0-92db-77261a15b9d2.jpg"
      ],
      "datePublished": "2025-10-11T17:49:44.000Z",
      "dateModified": "2025-10-11T17:49:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Four killed in mass shooting after Mississippi football game",
    "url": "https://www.bbc.com/news/articles/c4gvgr7w2yko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ee6f/live/49e8f3a0-a6aa-11f0-b55a-e7725355d83f.png",
    "tag": "Trending",
    "date": "2025-10-11T18:27:27.000Z",
    "description": "Four people have been killed and 12 others injured, four critically, after a mass shooting in the US state of Mississippi.The shooting happened at aro",
    "body": "Four people have been killed and 12 others injured, four critically, after a mass shooting in the US state of Mississippi.The shooting happened at around midnight on the main street in Leland, a small town 120 miles (190km) north-east of the state capital Jackson, the small city's Mayor John Lee told the BBC.Four of the injured were airlifted to hospital, Lee added. No suspects were in custody, but a police manhunt was under way.Leland was busier than usual on Friday with the local high school scheduled to play a football game to mark homecoming, an annual US tradition, usually in autumn, when former students are welcomed back to celebrate school spirit and community. The mayor said that the shooting did not take place on the Leland High School campus.\"This is an event where we have held yearly for years and hadn't had any incidents of this sort, ever,\" Lee told BBC. \"And we're a city that, not high crime and about 3,700 people. We all get along, and everybody knows everybody. So this is definitely a tragedy to us.\"The Leland Police Department is still investigating the incident and told the BBC it cannot share any further details at this time, including how many rounds were fired and what kind of gun was used. The Mississippi Bureau of Investigation is helping the inquiry.State Senator Derrick Simmons told the Associated Press that the scene was \"very chaotic\" after the gunfire erupted, as police and first responders rushed to the area \"from all over\". \"People were just congregating and having a good time in the downtown of Leland,\" Simmons told the AP. Officials are asking for anyone with information about the \"horrific\" shooting to come forward, Simmons added. A deadly shooting was also reported on Friday night in another small Mississippi town, Heidelberg, about 200 miles south-east of Leland.That attack also happened during the town's homecoming weekend, and claimed two lives, Heidelberg Police Chief Cornell White told the AP. There is no indication the Leland and Heidelberg shootings were linked. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Four killed in mass shooting after Mississippi football game",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ee6f/live/49e8f3a0-a6aa-11f0-b55a-e7725355d83f.png"
      ],
      "datePublished": "2025-10-11T18:27:27.000Z",
      "dateModified": "2025-10-11T18:27:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Joe Biden receiving radiation therapy for prostate cancer, spokesman says",
    "url": "https://www.bbc.com/news/articles/c1ede670jnyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3846/live/3e341bf0-a6b1-11f0-90fd-c3777763571c.jpg",
    "tag": "Trending",
    "date": "2025-10-11T15:17:45.000Z",
    "description": "Former US President Joe Biden is receiving radiation therapy as part of his treatment for prostate cancer, his spokesman has said.The spokesman also s",
    "body": "Former US President Joe Biden is receiving radiation therapy as part of his treatment for prostate cancer, his spokesman has said.The spokesman also said that Biden, 82, was undergoing hormone treatment, without giving any further details.The radiation treatment was expected to span five weeks and marked a new point in his care, a source told NBC News.In May, Biden's office announced that he was diagnosed with a more aggressive form of the disease, which had spread to his bones. The discovery was made after the Democrat politician reported urinary symptoms which led doctors to find a small nodule on his prostate. The Biden office said at the time that \"he was diagnosed with prostate cancer, characterised by a Gleason score of 9 (Grade Group 5) with metastasis to the bone.\"While this represents a more aggressive form of the disease, the cancer appears to be hormone-sensitive which allows for effective management.\"A Gleason score of nine meant his illness was classified as \"high-grade\" and the cancer cells could spread quickly, according to Cancer Research UK.Biden left office in January as the oldest serving US president in history and questions about his health dogged his first term, leading him to end his run for re-election late in his campaign.His former vice-president, Kamala Harris, ran instead as the Democrat's presidential candidate, losing to current US President Donald Trump.For many years, Biden has advocated for cancer research.In 2022, he and his wife Jill Biden relaunched the \"cancer moonshot\" initiative with the goal of mobilising research efforts to prevent more than four million cancer deaths by the year 2047.Biden himself lost his eldest son, Beau, to brain cancer in 2015.In recent months, Biden has largely retreated from the public eye. In May, he sat down for an interview with the BBC - his first since leaving the White House - where he admitted that the decision to step down from the 2024 race was \"difficult\".Prostate cancer is the second most common cancer affecting men, behind skin cancer, according to the American Cancer Society.The US Centres for Disease Control and Prevention (CDC) says that 13 out of every 100 men will develop prostate cancer at some point in their lives. It says age is the most common risk factor.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Joe Biden receiving radiation therapy for prostate cancer, spokesman says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3846/live/3e341bf0-a6b1-11f0-90fd-c3777763571c.jpg"
      ],
      "datePublished": "2025-10-11T15:17:45.000Z",
      "dateModified": "2025-10-11T15:17:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nova festival survivor found dead two years after 7 October attack",
    "url": "https://www.bbc.com/news/articles/cdxqx5vwqk2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/282d/live/62ebe300-a6d0-11f0-af59-a3ff604fe7e1.jpg",
    "tag": "Trending",
    "date": "2025-10-11T18:32:34.000Z",
    "description": "An Israeli survivor of the 7 October 2023 Hamas attack on the Nova musical festival who saw his girlfriend murdered in front of him has been found dea",
    "body": "An Israeli survivor of the 7 October 2023 Hamas attack on the Nova musical festival who saw his girlfriend murdered in front of him has been found dead.Roei Shalev's body was recovered on Friday evening near Tel Aviv.Hours earlier the 30-year-old wrote on social media that \"I just want this suffering to end. I'm alive, but inside everything is dead\". He also asked for forgiveness.Shalev's mother took her own life two weeks after the Hamas attack.Shalev died three days after the two-year anniversary of the Hamas attack.During the attack he tried to shield his girlfriend Mapal Adam and was also shot, but survived by playing dead for hours.Concerned by Shalev's message, his friends and family members immediately started searching for him.His body was eventually recovered by emergency services near the city of Netanya.Israeli police are now investigating the circumstances surrounding his death.Survivors of the Nova festival massacre said they were \"heartbroken and deeply saddened by the death of our dear friend\". \"Roei was a pillar of strength within the community, and his death is an immeasurable loss for us,\" they wrote in a post on Instagram.\"Sadly, many members of the Nova community are still experiencing traumatic moments daily since 7 October,\" they said, asking everyone \"to show constant awareness and emotional sensitivity the mental state of those affected\" by those events.About 1,200 people were killed, including more than 370 at the Nova music festival, and 251 taken hostage in the Hamas attack on 7 October 2023 on southern Israel. Israel responded by launching a military offensive that has killed more than 67,000 Palestinians in Gaza, according to the territory's Hamas-run health ministry.BBC Action Line: If you want advice and information on any of these subjects here's a list of organisations that offer help and support.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nova festival survivor found dead two years after 7 October attack",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/282d/live/62ebe300-a6d0-11f0-af59-a3ff604fe7e1.jpg"
      ],
      "datePublished": "2025-10-11T18:32:34.000Z",
      "dateModified": "2025-10-11T18:32:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Diane Keaton: Oscar-winning actress dies aged 79, US media report",
    "url": "https://www.bbc.com/news/articles/cr5q5rp4r64o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5712/live/63564b50-a6d5-11f0-826a-6be1fb467f36.jpg",
    "tag": "Trending",
    "date": "2025-10-11T20:50:41.000Z",
    "description": "27 minutes agoNoor NanjiCulture reporterOscar-winning actress Diane Keaton has died at the age of 79, according to US media reports.Keaton, who was bo",
    "body": "27 minutes agoNoor NanjiCulture reporterOscar-winning actress Diane Keaton has died at the age of 79, according to US media reports.Keaton, who was born in Los Angeles, shot to fame in the 1970s through her role as Kay Adams-Corleone in The Godfather films.She was also known for starring in Father of the Bride, First Wives Club and Annie Hall, which won her the Academy Award for Best Actress in 1978.The actress, whose Hollywood career spanned more than 50 years, died in California, her family confirmed to People magazine. A source also confirmed her death to the New York Times.Paying tribute, her First Wives Club co-star Bette Midler wrote on Instagram: \"The brilliant, beautiful, extraordinary Diane Keaton has died. I cannot tell you how unbearably sad this makes me.\"She was hilarious, a complete original, and completely without guile, or any of the competitiveness one would have expected from such a star. What you saw was who she was ... oh, la, lala!\"Actor Ben Stiller paid tribute on X, writing: \"Diane Keaton. One of the greatest film actors ever. An icon of style, humor and comedy. Brilliant. What a person.\"Keaton was nominated for three further Oscars - all in the best actress category - for her work in Something's Gotta Give, Marvin's Room and Reds.She never married and had two adopted children - a daughter, Dexter, and a son, Duke.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Diane Keaton: Oscar-winning actress dies aged 79, US media report",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5712/live/63564b50-a6d5-11f0-826a-6be1fb467f36.jpg"
      ],
      "datePublished": "2025-10-11T20:50:41.000Z",
      "dateModified": "2025-10-11T20:50:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "We're grateful for what Trump is doing for peace, Nobel winner Machado tells BBC",
    "url": "https://www.bbc.com/news/articles/c5y8y25l250o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/87d5/live/9f59bf00-a6d1-11f0-b741-177e3e2c2fc7.jpg",
    "tag": "Trending",
    "date": "2025-10-11T18:51:32.000Z",
    "description": "2 hours agoNorberto ParedesBBC Mundo andAlex BoydWatch: 'A great honour for Venezuelan society' - Machado speaks to the BBCNobel Peace Prize winner Ma",
    "body": "2 hours agoNorberto ParedesBBC Mundo andAlex BoydWatch: 'A great honour for Venezuelan society' - Machado speaks to the BBCNobel Peace Prize winner María Corina Machado has told the BBC she is grateful for what US President Donald Trump is doing \"around the world for peace\".Machado, Venezuela's opposition leader, was awarded the 2025 prize having long campaigned against the country's President Nicolás Maduro Moros, whose 12-year rule is viewed by many as illegitimate.She told BBC Mundo that during a congratulatory phone call with Trump she told him \"how grateful the Venezuelan people are for what he's doing, not only in the Americas, but around the world for peace, for freedom, for democracy\".Trump has made no secret about wanting to win the award himself, regularly speaking about the seven wars he claims to have ended.Nominations for the award closed in January, just as Trump's second term as president began. A White House official said on Friday the \"Nobel Committee proved they place politics over peace\".Machado said she was \"very glad\" to speak to the US president and was \"able to convey to him our appreciation\".The 58-year-old, forced to live in hiding for much of the past year, was hailed by the Nobel Committee as \"one of the most extraordinary examples of civilian courage in Latin America in recent times\".Nobel chairman Jørgen Watne Frydnes said she was recognised for \"her struggle to achieve a just and peaceful transition from dictatorship to democracy\".He added: \"Despite serious threats against her life, she has remained in the country, a choice that has inspired millions.\"Machado was barred from running in last year's presidential elections, in which Maduro won a third six-year term in office.The elections were widely dismissed on the international stage as neither free nor fair, and sparked protests across the country.Even after she was barred from the polls, she managed to unite the notoriously divided opposition faction and succeeded in getting millions of Venezuelans behind the little-known candidate which replaced her on the ballot, Edmundo González.When the government-controlled National Electoral Council declared Maduro the winner - even though tallies from polling stations showed that González had won by a landslide - Machado continued to campaign from hiding as the Maduro government has repeatedly threatened her with arrest.Machado told BBC Mundo her award was \"like an injection\" for her political movement.\"It infuses energy, hope, strength on the Venezuelan people because we realise that we are not alone,\" she added. \"The democrats around the world share our struggle.\"She said she thought Trump and the international community were already helping with the political situation in Venezuela.\"The regime in Venezuela is a criminal structure,\" Machado told the BBC. \"And as such, it sustains themselves on the criminal flows from their illicit activities.\"We need the international community to cut those flows that are not only used for corruption, but also for repression, violence and terror.\"So when you cut the inflows that come from drug trafficking, gold smuggling, arms smuggling, human trafficking, or the black market of oil, then the regime falls.\"And that's exactly what we're seeing, cracks that are getting deeper and deeper as we talk right now.\"Earlier this month, US forces killed four people in an attack on a boat off the coast of Venezuela that was allegedly trafficking drugs.It was the latest in a number of recent strikes by the US on boats in international waters it said were involved in \"narco-trafficking\".They have attracted condemnation in countries including Venezuela and Colombia, with some international lawyers describing the strikes as a breach of international law.On Thursday Colombian President Gustavo Petro said one of the boats was \"Colombian with Colombian citizens inside\", an allegation the White House called \"baseless\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "We're grateful for what Trump is doing for peace, Nobel winner Machado tells BBC",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/87d5/live/9f59bf00-a6d1-11f0-b741-177e3e2c2fc7.jpg"
      ],
      "datePublished": "2025-10-11T18:51:32.000Z",
      "dateModified": "2025-10-11T18:51:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "No survivors found after Tennessee explosives plant blast",
    "url": "https://www.bbc.com/news/articles/cx2523997p9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a40e/live/ecf31290-a6c0-11f0-92db-77261a15b9d2.jpg",
    "tag": "Trending",
    "date": "2025-10-11T20:16:12.000Z",
    "description": "1 hour agoKwasi Gyamfi Asiedu & Blanca EstradaBucksnort, TennesseeNo survivors are expected to be found after a major explosion at a Tennessee munitio",
    "body": "1 hour agoKwasi Gyamfi Asiedu & Blanca EstradaBucksnort, TennesseeNo survivors are expected to be found after a major explosion at a Tennessee munitions factory on Friday that has left 18 people unaccounted for.Recovery teams are still clinging to hope of finding any of the missing alive, but assume they are deceased, said Humphreys County Sheriff Chris Davis.\"As we get into this, we find it even more devastating than we thought initially,\" he told a news conference.It's still unclear what caused the explosion at the plant in Bucksnort, Tennessee - roughly 56 miles (90km) south-west of Nashville. The facility specialises in the development and manufacture of explosives.Video footage taken on Friday showed fires still burning, charred vehicles, and smoke rising from the razed building. Officials said debris was scattered for half a mile around where the building once stood.Accurate Energetic Systems (AES), which runs the plant, has suspended its operations.Aerial footage shows devastation after blast at explosives manufacturer in TennesseeMore than 300 state and local first responders have been searching the site since Friday morning, Sheriff Davis said on Saturday.\"The expectation of anyone who's inside of that building… we can assume that they are deceased,\" he told media.By Saturday morning, the rescue mission had shifted to a recovery operation, said a visibly choked-up Davis. The FBI is also at the scene conducting rapid DNA tests to identify victims and notify families.\"We're trying to focus as much attention as we can, on taking care of their families,\" Sheriff Jason Craft, from neighbouring Hickman County, told the BBC.The Bureau of Alcohol, Tobacco, and Firearms is at the scene helping to investigate the incident. There was a previous fatal explosion at a unit in the same location in 2014.Ann Myers was woken from her sleep by the explosion on Friday morning and feared for the safety of her four children. She wondered if it was a tornado or a road accident.The camper home they live in shook and the electricity went out briefly.\"It was the weirdest thing ever,\" she said. \"So then I'm like, are we in a tornado? Is there, you know, a bomb somewhere? \"But then I thought maybe a tractor trailer, you know, hit somewhere off the interstate. So it's definitely very frightening.\"Justin Stover, whose property borders the sprawling AES plant, told the BBC his house shook violently following the explosion. At first, he thought it was a plane crash and he feared his house would collapse.\"Things fell off the wall, items fell off shelves,\" Mr Stover said. \"It was very intimidating, like the loudest thunder you've ever heard in your life and rumble.\"Then he saw \"a large cloud of smoke coming from the area of AES\", Stover added.He is still assessing damage to his house and said the explosion may have affected his water well.Stover, who has lived in Bucksnort for 20 years, said AES had about 80 workers.\"It's one of the only businesses in this area,\" he said. \"So it's one of the only places for employment, for locals. \"There's a lot of people that we know that work there and that possibly lost their lives yesterday morning.The tragedy will be devastating for the whole community, he said, as it has already been for families of the victims. Residents farther away from the site also heard the blast, including some in a town about 15 miles (25km) away, Sheriff Davis said on Friday.One local resident who lives about 20 minutes away from the facility told the BBC she was sitting at her daughter's dining table when she heard it. \"All of a sudden we just a heard a loud bang. We didn't know if it was a gun or what,\" she said.Another local resident, Lucy Garton said her husband knows people who worked in the facility.\"I think it will definitely impact the area,\" she said. \"It's a very close-knit community and everyone, they're just simple people, go to work every day, take care of their families and just real a family-oriented community.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "No survivors found after Tennessee explosives plant blast",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a40e/live/ecf31290-a6c0-11f0-92db-77261a15b9d2.jpg"
      ],
      "datePublished": "2025-10-11T20:16:12.000Z",
      "dateModified": "2025-10-11T20:16:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Liam Gallagher becomes a grandad for first time",
    "url": "https://www.bbc.com/news/articles/c07v7drpp52o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bf66/live/9c5ae170-a6d2-11f0-af59-a3ff604fe7e1.jpg",
    "tag": "Trending",
    "date": "2025-10-11T18:45:25.000Z",
    "description": "3 hours agoNoor NanjiCulture reporterLiam Gallagher has become a grandfather for the first time after his daughter Molly Moorish-Gallagher gave birth ",
    "body": "3 hours agoNoor NanjiCulture reporterLiam Gallagher has become a grandfather for the first time after his daughter Molly Moorish-Gallagher gave birth to a boy.The 27 year old announced the news on Saturday in an Instagram post - along with pictures of her son, Rudy, and a sign saying \"we adore you\".The Oasis frontman, 53, met his daughter for the first time in 2018. She was raised by her mother, the singer Lisa Moorish.He has three other children - two sons from his marriages to actress Patsy Kensit and singer Nicole Appleton, and another daughter from his relationship with US journalist Liza Ghorbani.In the post, Moorish-Gallagher added a caption which said \"In a message to you, Rudy\", accompanied by a blue heart emoji.Other photos in her post included a \"hello baby\" sign hanging on a kitchen door, and a picture of Moorish-Gallagher holding her son's hand.In a third photo, Rudy is seen wearing an orange jumper with the letter \"R\" on the back, as Moorish-Gallagher's footballer boyfriend Nathaniel Phillips cuddles their son.Phillips, who began his career at Liverpool, plays for West Bromwich Albion.Fans and celebrities were quick to comment on her post, with the model Daisy Lowe writing: \"Biggest congratulations sweetheart.\"Moorish-Gallagher first revealed she was pregnant in May, posting a photo on Instagram with Phillips as she held her baby bump.In 2017, before the reconciliation with his daughter, Gallagher admitted he had \"never got around\" to meeting her, saying he \"didn't get on\" with her mother.The following year, he revealed they had met by posting a photo of them standing together. They were joined by his sons Lennon and Gene.It is not known whether Gallagher has met his grandson.Earlier this year, Oasis embarked on a series of sold-out gigs following the band's dramatic split in 2009 after a backstage bust-up between Gallagher and his brother Noel. The Oasis Live '25 tour was the biggest concert launch ever seen in the UK and Ireland, with more than 10 million fans from 158 countries queuing to buy tickets last summer.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Liam Gallagher becomes a grandad for first time",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bf66/live/9c5ae170-a6d2-11f0-af59-a3ff604fe7e1.jpg"
      ],
      "datePublished": "2025-10-11T18:45:25.000Z",
      "dateModified": "2025-10-11T18:45:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bardsey Island off Welsh coast looks for new tenants ",
    "url": "https://www.bbc.com/news/articles/cnvr076y68lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/df15/live/5e61e480-a453-11f0-8a21-ff96e44d1cc2.jpg",
    "tag": "Trending",
    "date": "2025-10-08T19:42:30.000Z",
    "description": "A tiny island with more sheep than people needs a new tenant - could you live here?3 days agoNathan BevanBBC WalesBBCDespite its remoteness, the islan",
    "body": "A tiny island with more sheep than people needs a new tenant - could you live here?3 days agoNathan BevanBBC WalesBBCDespite its remoteness, the island is described as being \"very much a living community\"A tiny island off Gwynedd's Llŷn Peninsula, with more sheep than humans, is looking for new nature-loving inhabitants to live and work there. Ynys Enlli, also known as Bardsey Island, is wind-whipped, sea-sprayed and most definitely off-grid, boasting - as it does - a current year-round population of just three people. In 2023, it also became the first International Dark Sky Sanctuary in Europe, meaning its unspoiled view of the night sky is protected for current and future generations.And now, for the first time in almost 20 years, the trust which owns and runs the island, is welcoming one adventurous family or couple to its craggy shoreline - and the \"opportunity of a lifetime\". Bardsey Island Trust is asking anyone who might be interested in moving there to come forward, with the successful applicant settling on the island in September 2026.Once comfortably installed, the newest residents will be in charge of managing its 200 sheep and 25 Welsh Black cattle, alongside current tenant famer Gareth Roberts, from Aberdaron.\"Gareth and his family have been there since 2007, and he knows the island intimately - and the challenges and benefits of living on Enlli,\" said the trust's chief officer, Sian Stacey, adding Mr Roberts will mentor the new arrivals.Measuring just 440 acres (0.69 square miles), the island is a national nature reserve and a site of special scientific interest (SSSI).International Dark Sky Sanctuary certification saw the island join 16 other sites worldwide, each of them recognised as the most remote and dark places on Earth. However, with a handful of seasonal residents living there temporarily, as wardens, for some of the year, Sian described it as being \"very much a living community\".\"I lived there for three years myself - it's an amazing place to be,\" she said.  What is Bardsey Island famous for?No wifi or electricity in the houses, and the water flows straight from a wellIt's a mile and a half at its longest and a half mile at its widestThe \"Burial Place of 20,000 Saints\" hails from the early Middle Ages, when it was believed three pilgrimages to Enlli were as spiritually significant as one to RomePilgrims, pirates, fishermen, and farmers have been visiting the island since the 2nd Century BC200 sheepThe 1821 lighthouse still stands at the southern end of the islandEurope's first Dark Sky SanctuaryHome to 30,000 breeding pairs of Manx shearwaterAmanda RuggeriThe island's sheep vastly outnumber its human residentsHailed as one of the holiest places in Britain during the Middle Ages, Ynys Enlli has been dubbed the Island of 20,000 Saints. Legend also casts it as the final resting place of pilgrims from across the world seeking salvation. An excavation in the 1990s unearthed dozens of medieval graves.More stories like this Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bardsey Island off Welsh coast looks for new tenants ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/df15/live/5e61e480-a453-11f0-8a21-ff96e44d1cc2.jpg"
      ],
      "datePublished": "2025-10-08T19:42:30.000Z",
      "dateModified": "2025-10-08T19:42:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]