[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Israel-Gaza: Why Is Hamas Recalling Fighters? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0m83h8w?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-10-11T18:17:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·11 Oct 2025,·27 minsIsrael-Gaza: Why Is Hamas Recalling Fighters?NewscastAvailable for over a yearToday, we look at the progress of the Trump peace plan for Israel and Gaza as Hamas recalls 7,000 fighters to reassert control over Gaza amid fears of renewed internal violence.\nThe Hamas mobilisation had been widely anticipated amid growing uncertainty about who will govern Gaza once the war ends.\nThe ceasefire appears to have held but Israeli hostages and Palestinian prisoners are yet to be released. \nLaura and Paddy speak with international editor Jeremy Bowen about the latest.\nPlus, Laura explains how the contest to become deputy leader of the Labour party could be seen as a verdict on Keir Starmer.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Laura Kuenssberg and Paddy O’Connell. It was made by Chris Flynn and Adam Chowdhury. The social producer was Joe Wilkinson. The technical producer was Jack Graysmark. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Israel-Gaza: Why Is Hamas Recalling Fighters? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-10-11T18:17:00.000Z",
      "dateModified": "2025-10-11T18:17:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man arrested over murder of schoolgirl Lindsay Rimer in 1994",
    "url": "https://www.bbc.com/news/articles/cvg4rn3vdx6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8ae6/live/d8391850-9c4d-11ef-b80c-51ebf6f5ee4f.jpg",
    "tag": "Trending",
    "date": "2025-10-13T12:16:04.000Z",
    "description": "10 minutes agoJulia BrysonYorkshirePA MediaLindsay Rimer was found dead five months after she went missing from home A man has been arrested on suspic",
    "body": "10 minutes agoJulia BrysonYorkshirePA MediaLindsay Rimer was found dead five months after she went missing from home A man has been arrested on suspicion of the murder of 13-year-old Lindsay Rimer, who went missing from her home in West Yorkshire in 1994. The teenager left her home in Hebden Bridge, near Halifax, on 7 November to buy cornflakes from a nearby shop but never returned. Her body was found five months later, weighted down with a stone in the Rochdale Canal, about a mile from the town centre.West Yorkshire Police said a man was arrested on Monday at an undisclosed UK prison where he was serving a sentence for other offences.A force spokesperson said officers were \"keeping Lindsay's family updated\", adding that the arrest was \"as a result of our continued focus on progressing the investigation\".The arrested man was being interviewed by police and was expected to be bailed and returned to prison while inquiries continued, the spokesperson said.Meanwhile, officers were approaching \"a number of specific potential witnesses, mainly in the Hebden Bridge and wider Halifax area\", who had been identified by the investigation.More on this storyRelated internet links ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man arrested over murder of schoolgirl Lindsay Rimer in 1994",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8ae6/live/d8391850-9c4d-11ef-b80c-51ebf6f5ee4f.jpg"
      ],
      "datePublished": "2025-10-13T12:16:04.000Z",
      "dateModified": "2025-10-13T12:16:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Big Cases - Murdered by his Grandparents",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002j88v?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0lz3f5r.png",
    "tag": "Trending",
    "date": "2025-10-03T15:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistThe Big Cases - Murdered by his GrandparentsContains some upsetting scenes.The tragic case of two-year-old Ethan, who was killed by his grandparents. A police investigation unraveled a horrific story of brutal abuse by those who should have cared for and nurtured him. Duration29 minsFirst shown3 Oct 2025Available for 11 monthsWatchlistAudio DescribedSign LanguageEpisodesEpisodes EpisodesThis episodeMurdered by his GrandparentsThe Sycamore Gap - From Roots to RuinAn ancient tree, symbolising a community, is chopped down overnight. Who did it and why?26 minsThe Aristocrat, the Convict and the Missing BabyAn aristocrat and her convict partner go on the run with their newborn, ending in tragedy.29 minsThe Predator Who Fled to ParadiseThe shocking tale of a predator who fled to paradise for almost three decades.25 minsThe Bus Stop MurderThe tragic story of a schoolgirl who was stabbed to death in a row about a teddy bear.27 minsNeighbour, Friend, KillerWendy Buckney knew about her neighbour's past but wanted to give him a second chance.21 minsThe Mistaken Identity Murders The shocking story of two innocent teenagers murdered in a case of mistaken identity.30 minsMy Husband the MonsterThe shocking story of Gisele Pelicot, raped by strangers her husband invited to abuse her.29 minsTortured Behind Closed DoorsThe tragic story of Sara Sharif who was brutally killed by her father and stepmother.35 minsStabbed After SchoolThe shocking story of how a teenage relationship ended in murder. 28 minsThe Abuser HeadteacherThe story of a respected head who abused his power and became a convicted sex offender.29 minsCrushed: The Six Year NightmareSix years after surviving a horror smash, Monika died. It was time for justice, again.21 minsThe House Party MurderHow a house party turned into a murder scene - the fatal stabbing of Mikey Roynon.28 minsKiller In The AtticWhen a man is stabbed to death outside a nightclub, armed police search for his killer.25 minsThe Dance Floor MurderThe story of footballer Cody Fisher who was stabbed to death in a nightclub in Birmingham.26 minsThe Executioner Next DoorThe true story of the Army’s killer agent inside the IRA.\n25 minsThe Nottingham AttacksIn the summer of 2023, the lives of three families changed forever.29 minsHeld Captive And Left To DieShakira Spencer was tortured and starved by people she considered friends.23 minsKilled In The ParkBrianna Ghey was stabbed to death - two teenagers tried to get away with murder.26 minsThe Student Who Never Came HomeKidnapped and murdered while on a gap year in France. Is it finally time for justice?25 minsThe Doping WardThe hospital unit where patients were drugged to keep them 'quiet and compliant'.26 minsKilled By My BoyfriendThe story of a young mum killed by her boyfriend of eight weeks.22 minsThe Commons CriminalThe MP who rose from obscurity to being imprisoned for fraud. The story of Jared O'Mara.23 minsThe Missing MumLinda Razzell was murdered by her husband in 2002 - will he now reveal where her body is?22 minsDeadly InfluenceThe story of a social media influencer, her mum and a murder plot.26 minsUnmasking a FugitiveThe story of Nicholas Rossi, the US fugitive who came to the UK with a new identity.30 minsKilled on DutyThe story of how a handcuffed prisoner shot dead Sgt Matt Ratana in 2020.21 minsThe Killing in the LaneLilia Valutyte died from a single stab wound in her chest. Who killed the nine-year-old?17 minsKilled on Christmas EveElle Edwards was shot dead as she celebrated at Christmas in a murder that shocked the UK32 minsThe Sunshine ScammerThe bogus travel agent who conned hundreds of holidaymakers and her own family.28 mins30 Years For JusticeNikki Allan's murder shocked Sunderland. Why did it take so long to catch her killer?26 minsCaught In The CrossfireNine year old Olivia Pratt-Korbel was killed when shots were fired into her family home.28 minsThe Lie That Destroyed a TownThe story of false accusations about being the victim of a grooming gang.30 minsHomegrown TerroristCould the Manchester Arena bombing have been stopped?24 minsTwenty Minutes Of TerrorA gunman kills five people within minutes. Could the shootings have been prevented?20 minsFound Under the FloorThe story of Bennylyn and Jellica who were murdered after starting a new life in the UK.23 minsPagination controlsPrevious1Page 1 of 22Page 2 of 2Next",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Big Cases - Murdered by his Grandparents",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0lz3f5r.png"
      ],
      "datePublished": "2025-10-03T15:00:00.000Z",
      "dateModified": "2025-10-03T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tommy Robinson refused to give police phone Pin to protect 'journalistic material'",
    "url": "https://www.bbc.com/news/articles/c2lp1k7pnpno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4755/live/64e20e60-a828-11f0-928c-71dbb8619e94.jpg",
    "tag": "Trending",
    "date": "2025-10-13T11:47:55.000Z",
    "description": "39 minutes agoDaniel SandfordUK correspondent andKathryn ArmstrongFar-right activist Tommy Robinson has said that he refused to give police his mobile",
    "body": "39 minutes agoDaniel SandfordUK correspondent andKathryn ArmstrongFar-right activist Tommy Robinson has said that he refused to give police his mobile phone Pin when he was stopped at the entry to the Channel Tunnel because it had \"journalist material\" on it, a court has heard.Robinson, whose real name is Stephen Yaxley-Lennon, was charged under the Terrorism Act after allegedly failing to comply with counter-terrorism powers in Folkestone in July 2024.He is on trial at Westminster Magistrates' Court and has pleaded not guilty.A person who is detained under Schedule 7 of the Terrorism Act is legally obliged provide the password or Pin for electronic devices. If found guilty, he could be jailed for up to three months and/or receive a £2,500 fine.Robinson's trial began on Monday and is expected to last two days. He is charged under his real name and is being referred to as Mr Lennon in court. The 42-year-old sat in the dock of the court in a navy waistcoat and tie and confirmed his name.PC Mitchell Thorogood, a counter-terrorism officer with Kent Police, told the court that he was on duty policing vehicles travelling to France at the entrance to the Channel Tunnel near Folkestone on 28 July 2024.He described seeing a silver Bentley with a lone driver that he said was \"an unusual car to come through\". The driver was Mr Lennon.He said that before he stopped the vehicle, he \"had a belief that it was Mr Lennon\".PC Thorogood said he asked Mr Lennon where he was going and that he was \"unhappy\" with the account Mr Lennon gave.\"He was travelling a far distance with a vehicle that wasn't his,\" PC Thorogood said.Mr Lennon said he was going to Benidorm and had not bought a ticket in advance, which the officer said was also \"unusual\". He said Mr Lennon did not make eye contact.PC Thorogood described detaining Mr Lennon under Schedule 7 of the Terrorism Act. He said Mr Lennon started filming him, and the officers took away his mobile phone.\"He refused to provide the Pin number, saying there was journalist material in his phone,\" PC Thorogood said.Jo Morris, for the prosecution, said that Mr Lennon had used an expletive at officers, who also found a small bag in the Bentley containing £13,370 and €1,910 (£1,660).District Judge Sam Goozee said Mr Lennon's address should not be published, after the defendant's barrister Alisdair Williamson KC said there were \"credible threats against Mr Lennon's life\".The public gallery at the back of court was packed with more than 30 of his supporters, who had queued from early morning. One was wearing a red Mega (Make England Great Again) baseball cap.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tommy Robinson refused to give police phone Pin to protect 'journalistic material'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4755/live/64e20e60-a828-11f0-928c-71dbb8619e94.jpg"
      ],
      "datePublished": "2025-10-13T11:47:55.000Z",
      "dateModified": "2025-10-13T11:47:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-10-13T03:11:18.000Z",
    "description": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and p",
    "body": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-10-13T03:11:18.000Z",
      "dateModified": "2025-10-13T03:11:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steve Witkoff praises Jonathan Powell's 'tireless efforts' on Gaza",
    "url": "https://www.bbc.com/news/articles/cvg4rwne0ggo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f0c0/live/77246bd0-a824-11f0-9402-2f1ec29d00d4.jpg",
    "tag": "Trending",
    "date": "2025-10-13T11:49:22.000Z",
    "description": "37 minutes agoKate WhannelPolitical reporter andHenry ZeffmanChief political correspondentEPAThe US Middle East envoy Steve Witkoff has praised the \"i",
    "body": "37 minutes agoKate WhannelPolitical reporter andHenry ZeffmanChief political correspondentEPAThe US Middle East envoy Steve Witkoff has praised the \"incredible input and tireless efforts\" of the UK's National Security Adviser Jonathan Powell in bringing about the ceasefire in Gaza.In a social media post, Witkoff also said he wanted to \"acknowledge the vital role of the UK in assisting and coordinating efforts that have led us to this historic day in Israel\".The comments sharply contrast with those of Mike Huckabee, the US's ambassador in Israel, who said a UK minister was \"delusional\" for suggesting the UK played a \"key role\" in the process.The specific and personal praise for Powell from Witkoff is a boost to the national security adviser at a moment of political vulnerability.Powell is facing pressure over what role he played in the collapsed court case against two men accused of spying for China.Sources in government had for some time been emphasising the strength of the relationship between Powell and Witkoff. The two men are said to be in almost daily contact. Their relationship has become closer through their work on the conflict between Russia and Ukraine, with Powell playing an instrumental role in trying to rebuild the US-Ukraine relationship after President Trump and President Zelensky's public confrontation in the Oval Office in February.Powell was also in Egypt last week as negotiations over the ceasefire were being finalised.Some in government expect Powell's experience of negotiating the Good Friday Agreement in Northern Ireland will be called upon by the US and others in the coming weeks and months, especially on the issue of decommissioning of weapons.On Sunday, Education Secretary Bridget Phillipson told Sky News the UK had \"played a key role behind the scenes\" in shaping the Gaza peace plan and had been involved in \"complex matters of diplomacy\". Responding on the social media platform X, Huckabee said: \"I assure you she's delusional. She can thank Donald Trump anytime just to set the record straight.\"Israel's deputy foreign minister Sharren Haskel added to Huckabee's criticism arguing that the UK's decision to recognise Palestinian statehood had \"actually pushed Hamas to embolden their position\". However, on Monday, Witkoff publicly lauded the UK's involvement and specifically the role of Jonathan Powell.Asked about his praise, Conservative leader Kemi Badenoch said: \"I was not born yesterday. \"I think it is actually very sad that the government is having to beg people to send tweets to say something nice about Jonathan Powell.\"I think that that is quite tragic, the way that the UK's reputation is falling under this Labour government.\"Sir Keir Starmer has travelled to Egypt, where US President Donald Trump and negotiators from Egypt, Qatar and Turkey will sign the peace plan.Palestinian President Mahmoud Abbas is also expected to attend the international summit in Sharm el-Sheikh, along with world leaders from around 20 countries. The ceasefire brokered by Trump in Gaza began on Friday morning after Israel and Hamas agreed to the first phase of the peace plan.The last 20 of the Israeli hostages have been released and are now back in Israel, and Hamas is due to hand over the remains of up to 28 deceased hostages.Israel is releasing 250 Palestinian prisoners and 1,700 detainees from Gaza, while increased amounts of aid should enter the Gaza Strip. Getty ImagesIn September Powell met Qatar's Prime Minister and Foreign Minister Mohammed bin Abdulrahman bin Jassim Al-ThanSir Keir Starmer appointed Powell as his national security adviser in November last year, taking over from Sir Tim Barrow.The holder of the post is always appointed by the prime minister but is normally a civil servant. Powell, in contrast, is a special adviser - a political appointee whose wages are paid by taxpayers.Powell was instrumental in brokering the 1998 peace deal in Northern Ireland when he was chief of staff to then Prime Minister Tony Blair. He left Downing Street after 10 years and went on to set up Inter-mediate, a conflict resolution charity which has helped negotiate peace agreements in Colombia, Mozambique and Spain. Bronwen Maddox, director of the international relations think tank Chatham House told BBC Radio 4's Profile that Powell made the case that to achieve peace people had to talk to their enemies \"even if they have blood on their hands\". Talking previously about the process of negotiation, Powell has said: \"It's much harder to kill people when you know them. \"You have to get to know people and build a relationship of trust to break out of the cycle of violence.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steve Witkoff praises Jonathan Powell's 'tireless efforts' on Gaza",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f0c0/live/77246bd0-a824-11f0-9402-2f1ec29d00d4.jpg"
      ],
      "datePublished": "2025-10-13T11:49:22.000Z",
      "dateModified": "2025-10-13T11:49:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Murder arrest over deaths in Stafford of children aged 2 and 3",
    "url": "https://www.bbc.com/news/articles/c78n8y3mlxko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/84e5/live/eae1f310-a803-11f0-92db-77261a15b9d2.jpg",
    "tag": "Trending",
    "date": "2025-10-12T20:51:44.000Z",
    "description": "Woman arrested after girl, 2, and boy, 3, die16 hours agoVanessa PearceWest Midlands andRebecca Harperin StaffordBBCForensic investigation officers we",
    "body": "Woman arrested after girl, 2, and boy, 3, die16 hours agoVanessa PearceWest Midlands andRebecca Harperin StaffordBBCForensic investigation officers were brought in after the deaths of the children, who were found in Corporation StreetA girl and boy confirmed dead in Stafford on Sunday morning were aged two and three, murder investigation police have said.The youngest, Meraj Ul Zahra, was discovered along with Abdul Momin Alfaateh at a home on Corporation Street at about 07:30 BST.Both were injured and unresponsive, Staffordshire Police said.A 43-year-old woman from the Stafford area, arrested on suspicion of murder, remained in custody, the force added.The children's next of kin have been informed and are being supported by specially trained officers. In a statement, the force said the incident had been referred to the Independent Office for Police Conduct (IOPC).An IOPC spokesperson said: \"We were notified by Staffordshire Police of the death of two children in Stafford on Sunday 12 October where there was recent police contact prior to their death.\"We understand a referral is being made by the force, which once received, we will assess before deciding whether further action may be required by us.\"PA MediaThe road was sealed off as investigators worked at the scene\"We are working hard to understand more about what happened leading up to these two children tragically losing their lives,\" said Det Insp Kirsty Oldfield.She added: \"We ask that people do not speculate at this stage as it is distressing for family and friends and could hinder our inquiries.\"Luke Browne, who lives on the street, said he had seen a forensic van and a police car parked there as he left for work on Sunday morning.\"It's very sad,\" he said, \"children dying is a horror. It's quite painful to hear [about] it.\"The 61-year-old book shop owner added: \"I've only lived there a year but everybody I've met has been lovely.\"Sebastian Grzesiak, who also lives nearby, said he too was shocked. \"It's a very quiet and friendly street,\" he said. Neighbour Sebastian Grzesiak said he had been shocked to learn of the deathsA cordon remains in place at the scene. \"We understand that this incident may cause concern in the local community,\" added Det Insp Oldfield.\"There is no threat to the wider public.\"Part of Corporation Street remains closed Officers were called to the home by West Midlands Ambulance Service which attended at 07:26 BST.\"Sadly, it quickly became apparent nothing could be done to save [the children] and they were confirmed dead at the scene,\" an ambulance service spokesperson said. Anyone with information that could help with the investigation is asked to contact Staffordshire Police. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Murder arrest over deaths in Stafford of children aged 2 and 3",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/84e5/live/eae1f310-a803-11f0-92db-77261a15b9d2.jpg"
      ],
      "datePublished": "2025-10-12T20:51:44.000Z",
      "dateModified": "2025-10-12T20:51:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump touts 'dawn of a new Middle East' in address to Israeli parliament",
    "url": "https://www.bbc.com/news/articles/c709jxxrrvlo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d8c3/live/f7e19310-a824-11f0-928c-71dbb8619e94.jpg",
    "tag": "Trending",
    "date": "2025-10-13T12:26:17.000Z",
    "description": "45 minutes agoJames FitzGeraldReutersTrump was the 'greatest friend' Israel had ever had in the White House, Netanyahu saidUS President Donald Trump h",
    "body": "45 minutes agoJames FitzGeraldReutersTrump was the 'greatest friend' Israel had ever had in the White House, Netanyahu saidUS President Donald Trump has told cheering Israeli lawmakers that \"this is the historic dawn of a new Middle East\", after helping to broker a ceasefire between Israel and Hamas in Gaza.During the first such address by a US president since 2008, Trump said Monday was a \"day of profound joy\" after \"two harrowing years\".Trump's address to the Israeli parliament, the Knesset, comes on the day that the last 20 living hostages held in the Palestinian enclave were released by Hamas. Israel is releasing 250 Palestinian prisoners and more than 1,700 other Palestinians detained during the two-year military operations in Gaza.During a whirlwind trip to the region, Trump is also expected to attend a peace summit in Sharm El-Sheikh, Egypt, alongside Egyptian President Abdel Fattah al-Sisi and other world leaders.After hearing politicians' chants of \"Trump, Trump, Trump\" in the Knesset, the American president said the occasion would represent \"not only the end of a war\" but also the possibility of a new age for \"what will soon be a magnificent region\".Trump's suggestion that the region was on the dawn of a new era echoed the words he used when Israel signed landmark deals with several Arab states during his first presidency.Trump was introduced to parliament by Israeli Prime Minister Benjamin Netanyahu, who saluted his counterpart's various acts of solidarity with Israel. Trump was the \"greatest friend\" Israel had ever had in the White House, Netanyahu said. \"Everything changed\" in the American attitude to Israel's military campaign in Gaza when Trump was re-elected as US president last year, Netanyahu added.The Israeli prime minister thanked Trump for his \"unremitting help\" in securing the return of the remaining hostages - part of a group of 251 people seized during the 7 October 2023 attacks in southern Israel by Hamas.Trump went on to offer a tribute of his own to his counterpart, saying: \"He's not the easiest guy to deal with, but that's what makes him great.\"Follow live updatesWho are the released hostages?What we know about Gaza ceasefire agreementEarlier, the US president declared the \"war is over\" in Gaza, after two years of fighting, as he flew to the region from the US on board Air Force One.The ceasefire in Gaza took effect on Friday morning after Israel and Hamas agreed to the first phase of Trump's 20-point peace plan. The next phases are still to be negotiated.Trump told reporters on Air Force One that the ceasefire would hold, and that a \"board of peace\" he is due to head would quickly be set up to administer the territory.In his remarks to parliament, Netanyahu said he was \"committed to this peace\".Also welcomed to the Knesset alongside Trump were other key US officials, including Secretary of State Marco Rubio and Defence Secretary Pete Hegseth. The names of Special Envoy Steve Witkoff and Trump's son-in-law and adviser Jared Kushner received particularly loud cheers from Israeli MPs, for their own roles in brokering the ceasefire. Kushner was accompanied by his wife Ivanka Trump.Members of Trump's audience wore red caps. Instead of Trump's signature slogan \"Make America Great Again\", they read \"Trump the Peace President\".Trump was told by the parliamentary speaker that there was \"no-one\" more deserving of next year's Nobel Peace Prize.But some Israeli lawmakers who want the war in Gaza to continue did not attend.Freed hostage Eitan Mor's emotional reunion with family",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump touts 'dawn of a new Middle East' in address to Israeli parliament",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d8c3/live/f7e19310-a824-11f0-928c-71dbb8619e94.jpg"
      ],
      "datePublished": "2025-10-13T12:26:17.000Z",
      "dateModified": "2025-10-13T12:26:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says Ukraine may get Tomahawk missiles to use against Russia",
    "url": "https://www.bbc.com/news/articles/c93xpqgzkv0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/222d/live/597d8190-a7d7-11f0-928c-71dbb8619e94.jpg",
    "tag": "Trending",
    "date": "2025-10-13T10:01:42.000Z",
    "description": "2 hours agoHarry Sekulich andLaura GozziUS President Donald Trump is considering sending long-range Tomahawk cruise missiles to Ukraine.Asked by repor",
    "body": "2 hours agoHarry Sekulich andLaura GozziUS President Donald Trump is considering sending long-range Tomahawk cruise missiles to Ukraine.Asked by reporters on Air Force One on Sunday whether he would provide Kyiv with Tomahawks, Trump replied: \"We'll see... I may\". The missiles would be \"a new step of aggression\" in Ukraine's war with Russia, he said.The comments follow a phone call at the weekend between Trump and Ukrainian President Volodymyr Zelensky, who pushed for stronger military capabilities to launch counter-attacks against Russia.Moscow has previously warned Washington against providing long-range missiles to Kyiv, saying it would cause a major escalation in the conflict and strain US-Russian relations.Tomahawk missiles have a range of 2,500 km (1,500 miles), which would put Moscow within reach for Ukraine.Trump said he would possibly speak to Russia about the Tomahawks requested by Ukraine. \"I might tell them [Russia] that if the war is not settled, that we may very well, we may not, but we may do it.\"\"Do they [Russia] want Tomahawks going in their direction? I don't think so,\" the US president added.On Sunday, Kremlin spokesman Dmitry Peskov said the topic of Tomahawks was of \"extreme concern\" to Russia. \"Now is really a very dramatic moment in terms of the fact that tensions are escalating from all sides,\" he said.In September Peskov dismissed the threat of Tomahawks, saying they would not be able to \"change the dynamic\" of the war.But in his comments on Sunday he noted that if Tomahawks were launched at Russia Moscow would not be able to tell whether they were carrying nuclear warheads. \"What should the Russian Federation think? Just how should Russia react?\", he said.On Monday morning former Russian President Dmitry Medvedev doubled down on Peskov's comments. \"How should Russia respond? Exactly!\" Medvedev said on social media.\"The delivery of these missiles could end badly for everyone. And first of all – for Trump himself,\" he wrote.Medvedev, who over the last few years has grown into an increasingly hawkish figure, frequently posts on social media espousing more extreme positions than the Kremlin's. He and Trump have sparred online before. Comments by Medvedev in August led Trump to say he had ordered two nuclear submarines to move closer to Russia.Since the start of Russia's full-scale invasion in 2022, Kyiv has made multiple requests for long-range missiles, as it weighs up striking Russian cities far from the front lines of the grinding conflict.In their recent phone calls, Zelensky and Trump discussed Ukraine's bid to strengthen its military capabilities, including boosting its air defences and long-range arms. Ukrainian cities including Kyiv have repeatedly come under heavy Russian bombardment with drones and missiles. Russia has particularly targeted Ukraine's energy infrastructure as winter approaches, causing widespread power cuts. Last month, Trump's special envoy to Ukraine Keith Kellogg suggested the US president had authorised strikes deep into Russian territory, telling Fox News \"there are no such things as sanctuaries\" from attacks in the Russia-Ukraine war.Follow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weekly US Politics Unspun newsletter. Readers in the UK can sign up here. Those outside the UK can sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says Ukraine may get Tomahawk missiles to use against Russia",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/222d/live/597d8190-a7d7-11f0-928c-71dbb8619e94.jpg"
      ],
      "datePublished": "2025-10-13T10:01:42.000Z",
      "dateModified": "2025-10-13T10:01:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nexperia: Dutch government takes control of China-owned chip firm",
    "url": "https://www.bbc.com/news/articles/ckgk21nng0vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dda7/live/b22b30a0-a7cb-11f0-b50c-8f62428b85e3.jpg",
    "tag": "Trending",
    "date": "2025-10-13T09:25:50.000Z",
    "description": "3 hours agoOsmond ChiaBusiness reporterThe Dutch government has taken control of Nexperia, a Chinese-owned chipmaker based in the Netherlands, in a bi",
    "body": "3 hours agoOsmond ChiaBusiness reporterThe Dutch government has taken control of Nexperia, a Chinese-owned chipmaker based in the Netherlands, in a bid to safeguard the European supply of semiconductors for cars and other electronic goods and protect Europe's economic security.The Hague said it took the decision due to \"serious governance shortcomings\" and to prevent the chips from becoming unavailable in an emergency.Nexperia's owner Wingtech said on Monday that it would take actions to protect its rights and would seek government support.The development threatens to raise tensions between the European Union and China, which have increased in recent months over trade and Beijing's relationship with Russia.In December 2024, the US government placed Wingtech on its so-called \"entity list\", identifying the company as a national security concern. Under the regulations, US companies are barred from exporting American-made goods to businesses on the list unless they have special approval.In the UK, Nexperia was forced to sell its silicon chip plant in Newport, after MPs and ministers expressed national security concerns. It currently owns a UK facility in Stockport.The Dutch Economic Ministry said it made the \"highly exceptional\" decision to invoke the Goods Availability Act over \"acute signals of serious governance shortcomings\" within Nexperia.\"These signals posed a threat to the continuity and safeguarding on Dutch and European soil of crucial technological knowledge and capabilities,\" the ministry said in a statement.\"Losing these capabilities could pose a risk to Dutch and European economic security.\"The statement did not detail why it thought the firm's operations were risky. A spokesperson for the minister of economic affairs told the BBC there was no further information to share.The Goods Availability Act is designed to allow the Hague to intervene in companies under exceptional circumstances. These include threats to the country's economic security and to ensure the supply of critical goods.Under the order, the Dutch Minister of Economic Affairs, Vincent Karremans, could reverse or block Nexperia's decisions if they were potentially harmful to the company's interests, to its future as a business in the Netherlands or Europe, or to ensure supply remains available in an emergency.The Dutch government added the company's production can continue as normal.\"This measure is intended to mitigate that risk,\" the ministry said.Shanghai-listed shares in Nexperia's parent company Wingtech fell by 10% on Monday morning.A Nexperia spokesperson said the company \"complies with all existing laws and regulations, export controls and sanctions regimes,\" and had no further comment.In a statement in Mandarin, Wingtech said its operations were continuing uninterrupted and it remained in close communication with its suppliers and customers.Wingtech said in a stock filing that the company's chairman, Zhang Xuezheng, was suspended from Nexperia's boards by an Amsterdam court order earlier this month.The company was also in talks with lawyers about potential legal remedies, it added.The BBC has also contacted the Chinese embassies in the Netherlands and Brussels.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nexperia: Dutch government takes control of China-owned chip firm",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dda7/live/b22b30a0-a7cb-11f0-b50c-8f62428b85e3.jpg"
      ],
      "datePublished": "2025-10-13T09:25:50.000Z",
      "dateModified": "2025-10-13T09:25:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lloyds warns car finance scandal could cost it £2bn",
    "url": "https://www.bbc.com/news/articles/cq6zr733917o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/74d3/live/ca6f5320-a80d-11f0-881e-a7ddfaa732cf.jpg",
    "tag": "Trending",
    "date": "2025-10-13T11:52:11.000Z",
    "description": "32 minutes agoEmer MoreauBusiness reporterLloyds Banking Group is setting aside an additional £800m for car finance compensation claims, bringing the ",
    "body": "32 minutes agoEmer MoreauBusiness reporterLloyds Banking Group is setting aside an additional £800m for car finance compensation claims, bringing the total amount allocated by the bank for redress to nearly £2bn.The company said that the number of eligible claims is expected to be higher than previously thought.Millions of drivers who bought cars on finance with hidden commission payments between 2007 and 2024 may be eligible for redress.The Financial Conduct Authority (FCA) published details of its proposed compensation scheme last week.The FCA said payouts could be due on around 14 million unfair deals, averaging at about £700 each.This could result in lenders paying out a total of £8.2bn in compensation.The payouts are over commission arrangements between lenders and dealers, unfair contracts, and inaccurate information given to car buyers.Lloyds said in a statement: \"Based on the FCA proposals in their current form, the potential impact is at the adverse end of the range of previous expected outcomes.\"It said it was setting aside an additional £800m for redress based on \"the increased likelihood of a higher number of historical cases... being eligible for redress\".It said its \"best estimate\" of the total cost of redress was £1.95bn.The proposed scheme would be free to access for consumers, although the interest they receive on redress will be much lower than that paid following the payment protection insurance (PPI) scandal.That scandal cost Lloyds £22bn.The FCA estimates that 44% of all motor finance agreements made since 2007 will be eligible for payouts.But a ruling at the Supreme Court in August limited the breadth of these cases.The FCA advises anyone who wants to make a complaint to get in touch with their lender or broker, and has this guidance on how to complain.But the Finance and Leasing Association, the body that represents the lending industry, has said the FCA is \"overcompensating\".Lloyds said on Monday that it did not think the FCA's calculations reflect the actual amount that customers lost out.It believes customers could therefore get more than the full commission back under the FCA's proposed scheme.Under the scheme, eligible car owners would be given the average of what it estimates they overpaid - the commission paid, plus interest.Another lender, Close Brothers, which is deeply exposed to motor finance compensation, said it was also likely to need to set aside more money for payouts.In a statement on Thursday, it said its \"initial assessment\" following the FCA's proposals was that it would need to increase its current provision of £165m. However, the company pointed out that uncertainty remained over the final compensation requirements, with the current proposals under consultation.Consumer campaigners have urged lenders not to fight the FCA's compensation plans, in order to ensure drivers do not have to wait even longer for redress and to bring a swifter conclusion to the saga.But Russ Mould, investment director for AJ Bell, said Lloyds \"gives the impression it is not happy with the proposed compensation methodology, implying this is not a done and dusted situation\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lloyds warns car finance scandal could cost it £2bn",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/74d3/live/ca6f5320-a80d-11f0-881e-a7ddfaa732cf.jpg"
      ],
      "datePublished": "2025-10-13T11:52:11.000Z",
      "dateModified": "2025-10-13T11:52:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "First German state visit to UK for 27 years announced",
    "url": "https://www.bbc.com/news/articles/czxklen5p2qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/92c0/live/ec0d7f20-a821-11f0-85ef-e382bd92d5ce.jpg",
    "tag": "Trending",
    "date": "2025-10-13T11:09:58.000Z",
    "description": "1 hour agoSean CoughlanRoyal correspondentThe president of Germany will visit the UK later this year, Buckingham Palace has announced.The visit by Pre",
    "body": "1 hour agoSean CoughlanRoyal correspondentThe president of Germany will visit the UK later this year, Buckingham Palace has announced.The visit by President Frank-Walter Steinmeier, from 3 to 5 December, will be the first German state visit to the UK in 27 years.King Charles and Queen Camilla will host the visit at Windsor Castle as Buckingham Palace is undergoing renovations.Such state visits are used to reinforce alliances and to encourage trade, with the German trip following last month's state visit by US President Donald Trump.State visits are a mix of political and business meetings, alongside royal pageantry and a diplomatic red-carpet welcome, with a banquet, military parade and carriage rides.The visit follows a treaty between Germany and the UK signed in the summer, known as the Kensington Treaty, which agreed to create a direct rail link between London and Berlin, as part of measures bringing the countries closer together.There are plans for more cultural ties such as school exchanges, stronger military links, business investments and joint efforts to tackle illegal migration and people smuggling.The King and Queen will be returning the hospitality to President Steinmeier and his wife Elke Büdenbender for their own visit to Germany in March 2023, in what was the first overseas state visit of the new reign.That first visit as King proved to be a diplomatic success, with the King making a well-received speech to the German Bundestag in Berlin, where he spoke about the importance of Germany's efforts in supporting Ukraine after the invasion by Russia.In a symbolic moment of reconciliation, he also went to Hamburg where he laid a wreath remembering those who had died in the Allied bombing of the city during the Second World War.The last German state visit to the UK was in December 1998, by President Roman Herzog, where he became the first head of state to visit Windsor Castle after the fire of 1992.Queen Elizabeth II hosted the visit and her state banquet speech spoke of the importance of both countries belonging to international organisations, \"headed by the European Union and the North Atlantic Treaty Organisation\", which helped \"to extend our reach and achieve goals which would be impossible on our own\".In that 1998 speech, which would have been written with the advice of the government, she also expressed the hope that Germany would become a permanent member of the UN Security Council - which so far has not happenedThe announcement of the 2025 German state visit adds to what is already a busy autumn schedule for the King, who is still undergoing cancer treatment.The King and Queen will be travelling to meet Pope Leo next week, for a rearranged state visit to the Vatican. A previously planned visit was postponed because of the ill-health of the late Pope Francis.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "First German state visit to UK for 27 years announced",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/92c0/live/ec0d7f20-a821-11f0-85ef-e382bd92d5ce.jpg"
      ],
      "datePublished": "2025-10-13T11:09:58.000Z",
      "dateModified": "2025-10-13T11:09:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "London buses infested with cockroaches, drivers say",
    "url": "https://www.bbc.com/news/articles/cwynyq3vv34o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7e94/live/08925e90-a822-11f0-92db-77261a15b9d2.jpg",
    "tag": "Trending",
    "date": "2025-10-13T05:01:20.000Z",
    "description": "7 hours agoTom EdwardsLondon transport and environment correspondentLondon Bus ForumsA cockroach under a London bus seatMany buses in London are infes",
    "body": "7 hours agoTom EdwardsLondon transport and environment correspondentLondon Bus ForumsA cockroach under a London bus seatMany buses in London are infested with cockroaches according to drivers, who want the issue resolved immediately.Drivers say a number of buses and their rest areas are infested with cockroaches and say the insects need eradicating.Images and video sent to BBC London show cockroaches on buses and in eating areas. In one video, filmed on 8 October, cockroaches can be seen in a driver's food container in the rest area.Bus safety campaigners have written to transport bosses highlighting the problem. Transport for London (TfL) says such instances are rare and it has launched an urgent investigation.London Bus ForumsA cockroach on a London bus Kevin Mustafa, a London bus safety campaigner, said: \"The current state is untenable for drivers who already face demanding working conditions. Swift, transparent and decisive action will go a long way toward restoring trust, ensuring safety, and maintaining public confidence in London's bus services.\"London bus drivers are reporting persistent issues with cockroaches and unsanitary conditions onboard their vehicles. This is not a matter of occasional nuisance — many drivers describe infestations, and the situation is starting to pose real health, safety and wellbeing risks.\"Campaigners want a deep clean of all buses more frequently, and the use of insecticidal treatments, heat treatments, improved vacuuming and sealed barriers in known hotspots.Drivers also want pest-control measures put in place. The London Bus Forums group said: \"The cockroach reports are not isolated. They point to a wider failure to maintain safe and clean conditions for bus drivers.\"This is a public health issue affecting both staff and passengers. That's why drivers will be marching on 5 November to demand safer conditions and the adoption of the Bus Drivers Bill of Rights.\"London Bus ForumsA cockroach on a piece of official TfL documentation About five million bus journeys are made every day in the capital. There are 675 bus routes served by over 8,700 buses, almost all of which are operated by private companies under contract to Transport for London.A TfL spokesperson said: \"We are committed to working together with operators to provide a clean environment for staff and customers. \"Most TfL welfare facilities are cleaned multiple times a day, and at a minimum daily, to maintain hygiene and safety standards. All buses are also cleaned every night before entering service and reports such as these are rare.\"We take any report seriously and are urgently investigating the specific incidents that have been raised.\"As with any reports, we will take appropriate action as part of the investigation, which can include taking buses out of service for inspection, deep cleans and treatment with specialist equipment if necessary.\"We would like to reassure staff that our operators would never take action against people raising concerns about welfare or safety and encourage any driver with concerns to contact their employer, their union, or contact us directly.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "London buses infested with cockroaches, drivers say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7e94/live/08925e90-a822-11f0-92db-77261a15b9d2.jpg"
      ],
      "datePublished": "2025-10-13T05:01:20.000Z",
      "dateModified": "2025-10-13T05:01:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chilworth mum warns against modified e-bikes after home destroyed",
    "url": "https://www.bbc.com/news/articles/cj3yk5xvjgmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bc0a/live/af3be870-a795-11f0-8c9e-87f67f3eb58c.jpg",
    "tag": "Trending",
    "date": "2025-10-13T05:00:15.000Z",
    "description": "Heartbreak after modified e-bike fire destroys home7 hours agoCash MurphySouth EastBBCEmma Wills moved in to the Chilworth property five months before",
    "body": "Heartbreak after modified e-bike fire destroys home7 hours agoCash MurphySouth EastBBCEmma Wills moved in to the Chilworth property five months before the fireA mother has warned about the perils of modified e-bikes after a fire left her family homeless and killed one of her kittens.Emma Wills, from Chilworth in Surrey, moved in to the property five months before a modified e-bike charging in her living room caught fire at the end of January.\"To go from a fresh start to losing everything so quickly has been devastating,\" she said.The e-bike, which belonged to a family friend, had recently been modified using a conversion kit bought online.According to new research from consumer safety charity Electrical Safety First, a total of 23% of UK push-bike owners surveyed were considering turning their push-bike into an e-bike.Conversion kits are cheaper to buy than a fully manufactured e-bike but come with huge risks, the charity has said.Electrical Safety FirstMrs Wills said the fire destroyed all the \"sentimental keepsakes\" that remind her of her late mother  Giuseppe Capanna, its product safety engineer, said: \"Kits made up of substandard components can cause devastating fires. \"At present, technology has outpaced regulation meaning there are no existing safety standards for conversion kits.\"Mrs Wills, who has three children, said: \"I lost my mum in 2021, so all the memories and sentimental keepsakes I had of her are gone. \"They can never be replaced, and that breaks my heart.\"Electrical Safety FirstMrs Wills said losing the family kitten was \"heartbreaking\" She added: \"It's had a huge impact on my two youngest children. They don't want to go out anymore. \"It doesn't just affect one part of your life, it affects everything.\"Mrs Wills said losing the kitten, which had been hand-reared by the family from four-weeks-old, was \"heartbreaking\".In 2024, the Office for Product Safety and Standards received 170 reports of e-bike fires, with 45% confirmed to be from converted e-bikes.The actual number is expected to be much higher as not all fire and rescue services notify OPSS of blazes involving consumer products.More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chilworth mum warns against modified e-bikes after home destroyed",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bc0a/live/af3be870-a795-11f0-8c9e-87f67f3eb58c.jpg"
      ],
      "datePublished": "2025-10-13T05:00:15.000Z",
      "dateModified": "2025-10-13T05:00:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]