[
  {
    "title": "Mr Burton",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002m3tl/mr-burton?at_mid=FCqiGdjR3M&at_campaign=Mr_Burton&at_medium=display_ad&at_campaign_type=owned&at_nation=WLS&at_audience_id=SS&at_product=iplayer&at_brand=m002m3tl&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Mr_Burton&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mcr9fp.jpg",
    "tag": "Trending",
    "date": "2025-11-10T06:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeMr BurtonMr BurtonFilm biopic about the power of an inspirational teacher and how talent can sometimes transcend the circumstances in which it is found. Duration1h 59mFirst shown2025Available for over a yearWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesHarrietBe free or die trying. An extraordinary true story of courage, sacrifice and freedom1h 56mThe Life and Death of Peter SellersNever judge a man by his cover. The comedic genius who could play anyone - except himself1h 54mThe Tommy Steele StoryThe sensational success story of Britain's first rock 'n' roll teen idol1h 18mHattieWhat a carry on. How actress Hattie Jacques' home life was shattered by a secret affair1h 25mSelmaOne dream can change the world. Oscar-winning biopic of Martin Luther King's 1965 march1h 59mHero: The Extraordinary Life of Mr Ulric CrossThe rise of a hero. Biopic inspired by the world-changing Trinidadian freedom fighter1h 46mBlinded by the LightFor anyone with dreams. A feel-good true story with words and music of Bruce Springsteen1h 49mOdetteAnna Neagle stars in a stirring spy drama based on a wartime heroine's true story1h 52mBurton and TaylorHollywood's glamorous, fiery stars - the celebrity 'it' couple, together one last time1h 22mA Song for JennyLove, tragedy and grief. A mother's story of losing her daughter in a terrorist attack1h 17mBabsFrom cockney kid to queen of soap, the inspiring, heartwarming story of Barbara Windsor1h 28mFear of FannyJulia Davis stars as the culinary icon who whisked up a storm with her food and fashion1h 19m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mr Burton",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mcr9fp.jpg"
      ],
      "datePublished": "2025-11-10T06:00:00.000Z",
      "dateModified": "2025-11-10T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Darkest Hour",
    "url": "https://www.bbc.co.uk/iplayer/episode/m000j4wd/darkest-hour?at_mid=Vd0xZ0H89s&at_campaign=Darkest_Hour&at_medium=display_ad&at_campaign_type=owned&at_audience_id=SS&at_product=iplayer&at_brand=m000j4wd&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Darkest_Hour&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p08c6bjp.jpg",
    "tag": "Trending",
    "date": "2025-11-08T20:01:03.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeDarkest HourDarkest HourAs the Nazis advance against Britain's European allies, newly elected prime minister Winston Churchill must decide whether to negotiate with Hitler or fight for the greater good. Duration1h 57mFirst shown2017Available for 26 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesThe MercyThe true story of Donald Crowhurst's bid to sail around the world. Stars Colin Firth1h 35mPersuasionLove lost, love regained. An adaptation of Jane Austen's heartfelt tale of second chances1h 42mRosalieA woman ahead of her time, in a world that wasn’t ready. Acclaimed historical drama1h 48mNorthanger AbbeyRomance, mystery, and mischief — where Gothic fantasy meets Jane Austen charm1h 30mA Cock and Bull StoryBecause everyone loves an accurate period piece. Chaotic comedy starring Steve Coogan1h 31mMacbethOrson Welles' haunting retelling of Shakespeare's classic tale of treachery and murder1h 43mThe Magnificent AmbersonsOrson Welles' acclaimed, moving portrayal of the changing fortunes of an American dynasty1h 24mAs You Like ItRomance...or something like it. Kenneth Branagh in an adaptation of the Shakespeare play1h 59mJane EyreA beautiful version of a Bronte classic. Starring Mia Wasikowska and Michael Fassbender1h 51mRomeo + JulietThe greatest love story the world has ever known. With Leonardo DiCaprio and Claire Danes1h 50mMr Malcolm's ListFinding perfection can be… complicated. Regency rom-com with Freida Pinto and Sope Dirisu1h 49mMrs DallowayA lifetime of lessons. Vanessa Redgrave in an adaptation of Virginia Woolf's classic book1h 33m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Darkest Hour",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p08c6bjp.jpg"
      ],
      "datePublished": "2025-11-08T20:01:03.000Z",
      "dateModified": "2025-11-08T20:01:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reinventing Football: Fans have their say on which laws should change",
    "url": "https://www.bbc.com/sport/football/articles/cx2y3j1924xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9b48/live/cb307600-bf13-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-11T16:34:04.000Z",
    "description": "Reinventing Football - five things fans would changeImage source, Getty ImagesAfter asking players, pundits and referees what changes they would make ",
    "body": "Reinventing Football - five things fans would changeImage source, Getty ImagesAfter asking players, pundits and referees what changes they would make to reinvent football, we opened the debate up to you.We opened the floor for fans to imagine a world in which they could rip up the rulebook and start again. The topic stirred up plenty of debate across our live page and social media and we received thousands of messages from our audience, suggesting the one thing they would change.Here are the top five talking points, followed by the assessment of former Premier League referee Chris Foy and BBC Sport's football issues correspondent Dale Johnson.Ditch marginal offsides - make it clear and obviousImage source, Getty ImagesImage caption, An injury suffered by Nottingham Forest striker Taiwo Awoniyi in May raised questions about the future of the offside lawThe offside rule was a widely-debated topic, with fans wanting to either tweak the law, or get rid of it completely. Former Premier League referee Anthony Taylor said \"scrapping offside might be the answer\" and added: \"One of the best tournaments I refereed in was a prison officer tournament and we had no offside... and we had so many goals it was unbelievable.\"Another frustration for supporters is around 'delaying the flag' - where officials are told to keep their flag down if they felt there was an immediate goalscoring opportunity.What the fans said:Matt: Scrap the offside flag going up 20 minutes after someone is offside. Needlessly wasting time and play continuing could result in injuries. Just throw the flag up when they're off.Sal: I would change the offside rule, where there has to be \"daylight\" between the last defender and attacker, in order for a claim of offside to be legitimate.Charlie: I would remove offside completely. Hockey successfully removed offside many years ago and I think it would see more goals which is what fans want to see.Chris: I would like the offside law changed, so you can only be offside beyond the 18-yard line. This would spread out the play.What Chris Foy said: \"Assistant refereeing is an art form and they are encouraged to keep the flag down in clear attacking situations. But I do understand that sometimes it can be frustrating.\"With semi-automated technology, I believe we have an accurate judgement of offside.\"What Dale Johnson said: \"'Daylight offside' has been a topic of discussion ever since it was suggested by Arsene Wenger in 2020.\"It has not made it to full trials because there are serious doubts about its impact on the tactical approach to a game. Giving more advantage to the attacker doesn't necessarily mean more goals, it could lead to more defensive play. I'd be very surprised if this ever happens.\"Stop the clock and reduce time-wastingMedia caption, What if pundits could change one thing about football...Goalkeepers holding the ball for more than eight seconds are now punished with a corner for the opposition, but what about time-wasting elsewhere on the pitch? The average ball-in-play time this season 55 minutes 05 seconds - 114 seconds down from last season.What the fans said:Anthony: When infringements or injuries occur, stop the clock as they do in rugby. Then at the 90th minute, that is the end of the match. No more debates about why several minutes have been added to half-time or full-time.Gary: Change the game to 60 minutes, but with a stop clock when the ball isn't in play [like basketball]. In most current games, there is less than 50 minutes of play. Would eliminate time-wasting in an instant.Tony: The clock stops every time ball goes out of play, and the referee blows his whistle to stop play.Alex: Follow rugby, stop the clock for any injury, video assistant referee (VAR) check, etc. If you are losing, you want more injury time; if you are winning, you want less. So just stop the clock, get rid of the unknown at the end of the game.What Chris Foy said: \"Time is always a big talking point in football. Something could be adopted to address this, for example, an independent timekeeper as we have in other sports such as basketball.\"The referee calls time off and on when play restarts. The fans can then also see the clock counting down which I'm sure will add to the excitement.\"What Dale Johnson said: \"One issue with a stopped clock is that unless you're in a ground with a scoreboard, the fans would have no idea how long there is left to play.\"But more and more time is being lost to stoppages like goal-kicks, throw-ins and corner-kicks. All three are at their highest this season. So something has to be done about it.\"'Ban the cheats' - punish dissent and simulationImage source, Getty ImagesImage caption, Only captains are supposed to approach referees during Premier League matches this seasonUnder current rules referees can instruct players not to approach them, and show yellow cards to those who do so without permission and behave in a disrespectful manner. Diving should also result in a booking. However, many fans believe this is not enforced enough.Former Liverpool and Fulham midfielder Danny Murphy said \"for anyone caught cheating or diving, the other team gets a penalty\", while ex-Blackburn and Celtic forward Chris Sutton said: \"Rather than just a yellow card for simulation, I would upgrade that to a red card and a three-game ban. Let's ban the cheats.\"What the fans said:Christopher: Swearing at the ref or any abusive language = immediate red card and a four-match ban.Jeff: Any attempt to simulate a foul would be an instant yellow card, but given when a break in play, and monitored by VAR. Any holding or pulling of clothing to be a yellow card, again monitored by VAR. Both of these are against the spirit of the game.Dave: Implement cards for any kind of simulation. Too many players conning the ref trying to get advantage, in particular players going down holding face or head when never touched. Classic example was Gabriel holding his face for Sunderland's second goal when clearly nowhere near his face.David: Red card for simulation, how long have fans been asking for this?What Chris Foy said: \"Dissent is a problem at many levels of football and when I was refereeing it was no different. If open acts of dissent are detected they should be dealt with - 2019 saw the introduction of sin-bins at grassroots football which is a great addition for dealing with open shows of dissent. Referees cannot do it alone and everyone has a duty to protect the image of the game.\"Change handball ruleImage source, Getty ImagesImage caption, Arsenal defender Gabriel handles the ball against NewcastleReferees now have a whole menu of reasons to give handball, with the aim to give a \"clearer and more consistent definition and interpretation\". What it brought was consistently more penalties, because there were many more reasons to give one.Former England captain Alan Shearer said some of the phraseology was confusing and has called for change: \"Proximity... obvious position... not in an obvious position... natural,\" he said. \"For me, it's pretty simple - is it deliberate handball or not?\". It's safe to say fans agree with him.What fans said:Mike: Bring back the old, sensible \"ball to hand\" as accidental handball. Common sense interpretation needed. Some of these handball calls are utterly ridiculous and ruin a game.Harry: Hand to ball is a penalty, ball to hand is not a penalty. That would stop players from aiming for hands in the penalty area.David: Handball in the box by a defender should be an indirect free-kick. The ball accidentally hitting a hand does not warrant a penalty, which can change a game completely.Simon: Scrap penalties for handballs in the box unless it's denying a goalscoring opportunity. Indirect free-kick instead. Giving the attacking team an almost guaranteed goal for something can be a really minor infraction by the defender is wildly disproportionate.What Chris Foy said: \"To prove if something was absolutely deliberate, you would have to ask a player if they meant to handle the ball.\"Personally, I think the game is in a good place regarding the handball rule and don't forget we have had a number of changes over the past five years. We don't want to see changes every year.\"Bring in a challenge system on VARImage source, Getty ImagesImage caption, Premier League fans have protested against VAR since its introduction in 2019-20Former England striker Ellen White said VAR \"takes out the joy and the emotion when a goal is scored\" for players and fans alike, while ex-Liverpool defender Stephen Warnock said it has \"too many inconsistencies and it's down to human error, which is still a massive problem\".Match of the Day presenter Gabby Logan doesn't think we should get rid of VAR, but \"there should be a 90-second rule. If it is not clear an obvious in 90 seconds, it's not clear and obvious.\"What fans said:Owen: With VAR, learn from cricket and only go to VAR on request from the captain... Three requests per game for each team. It would mean fewer VAR calls and would only be when there were really clear errors not just minor ones.Barry: I would change VAR to only be activated if the referee asks for a check, similar to rugby.Jeff: If something takes more than a minute, it's not clear and obvious. Refs have a big enough on-field team, VAR is an unnecessary addition, and I would love to know the cost to clubs, and why they don't bin it?Mike: Get rid of VAR completely. We had 120-odd years of the old system when football was football. Now, it's a waste of time.Charlie: Why aren't refs allowed to request to see the monitor themselves? Stop VAR telling the ref what to do and let the ref use VAR himself. If the ref isn't sure he should ask VAR to bring it up on the monitor instead of waiting five minutes.What Chris Foy said: \"In relation to VAR and its protocol, the referee can initiate a 'review' for a potential 'clear and obvious error' or 'serious missed incident' when the VAR (or another match official) recommends a 'review' and the referee suspects something serious has been missed.\"Time limit on checks are difficult to implement as in some situations, checks have many moving pieces.\"Dale Johnson added: \"The problem with placing a time limit on reviews is the necessary proof may not be immediately available.\"Last season, in a VAR review for a penalty Liverpool had been awarded against Wolves, the VAR appeared ready to support the decision after the first few replay angles. But then the next replay clearly showed the attacker had initiated contact.\"With a time limit, this may have stayed as a penalty. There's no doubt that if you do place a time limit, incorrect decisions may not be overturned.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reinventing Football: Fans have their say on which laws should change",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9b48/live/cb307600-bf13-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-11T16:34:04.000Z",
      "dateModified": "2025-11-11T16:34:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Will We See Trump V BBC In Court? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mg2xlc?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-11-11T17:59:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·11 Nov 2025,·36 minsWill We See Trump V BBC In Court?NewscastAvailable for over a yearToday, will the BBC actually end up in court against President Trump?\nWhere would a potential lawsuit by President Trump against the BBC take place? Is $1 billion dollars a realistic figure? What are the calculations both sides are making? Adam discusses with BBC home and legal correspondent Dominic Casciani. \nAnd, the rate of UK employment has risen to 5%, the highest level since the pandemic. Meanwhile, Keir Starmer has dropped the biggest hint yet he is about to scrap the two child benefit cap. Adam is joined by Henry and Dharshini. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Jem Westgate. The social producer was Sophie Millward. The technical producer was Ricardo McCarthy. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Will We See Trump V BBC In Court? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-11-11T17:59:00.000Z",
      "dateModified": "2025-11-11T17:59:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why War? The Einstein-Freud Letters - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/m001tr2s?at_mid=1gnEePe6cS&at_campaign=Why_War_The_Einstein_Fraud_Letters&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=sounds&at_brand=m001tr2s&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Why_War_The_Einstein_Fraud_Letters&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0h22621.jpg",
    "tag": "Trending",
    "date": "2023-12-29T17:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·29 Dec 2023,·28 minsWhy War? The Einstein-Freud LettersAvailable for over a yearIn 1932 the world-famous physicist Albert Einstein wrote a public letter to the founder of psychoanalysis, Sigmund Freud. Einstein, a keen advocate of the League of Nations and peace campaigner, asked Freud if he thought war and aggression was forever tied to human psychology and the course of international relations: could we ever secure a lasting world peace? \nEinstein’s letter is deeply prescient, as is Freud’s extraordinary response. The exchange was titled ‘Why War?’. The two thinkers explore the nature of war and peace in politics and in all human life; they think about human nature, the history of warfare and human aggression and the hope represented by the foundation of the League of Nations (precursor to the UN) and its promise of global security and a new architecture of international law. \nAt the time of their exchange, Freud is in the last great phase of his career and has already introduced psychoanalysis into the field of politics and society. Einstein, the younger of the two, is using his huge international profile as a physicist for political and pacifist intervention.\nFor Einstein, future world security means a shared moral understanding across the global order - that humankind rise above the ‘state of nature’ never to devolve into total war again. He wrote to Freud, as 'a citizen of the world…immune to nationalist bias...I greatly admire your passion to ascertain the truth. You have shown how the aggressive and destructive instincts are bound up in the human psyche with those of love and the lust for life. At the same time, you make manifest your devotion to the goal of liberation from the evils of war...’ Is it possible, Einstein asks Freud, to make us 'proof against the psychoses of hate and destructiveness?'. Freud's answer is fascinating and quite unexpected.  \nThe exchange of letters was sponsored by the International Institute of Intellectual Cooperation, an organisation promoting global security by using prominent thinkers, drawing on multiple fields of knowledge (from science to psychology, politics and law) to achieve a new language for international peace, following the lessons learned from the Great War of 1914-18. \nBut even as Einstein wrote to Freud in the summer of 1932, the Nazi party became the largest political party in the German Reichstag. Both men felt a sense of apprehension about what was coming; both were pacifist, both Jewish, both would be driven into exile (both Einsteinian physics and Freudian psychoanalysis were denounced by the new regime). The letters were finally published in 1933 when Hitler came to power, suppressed in Germany, and as a result never achieved the circulation intended for them. \nFeaturing readings from the Einstein–Freud letters and contributions from historians of warfare and psychoanalysis, war journalism and global security, this feature showcases the little-known exchange between two of the 20th century’s greatest thinkers, ‘Why War?’ – a question just as relevant in today’s world.\nContributors include historian of war and peace Margaret MacMillan, BBC chief international correspondent Lyse Doucet, defence and security expert Mark Galeotti, historian of international relations Patrick O Cohrs, author Lisa Appignanesi, who has written on Freud and the history of psychoanalysis, and Faisal Devji, historian of conflict and political violence in India and the Middle East. \nReadings are by Elliot Levey (Einstein) and Henry Goodman (Freud) \nProduced by Simon Hollis\nA Brook Lapping production for BBC Radio 4Programme Website",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why War? The Einstein-Freud Letters - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0h22621.jpg"
      ],
      "datePublished": "2023-12-29T17:00:00.000Z",
      "dateModified": "2023-12-29T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Americanswers on 5 Live! Why is Donald Trump threatening to sue the BBC for $1 billion? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mfxsk5?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-11-10T20:07:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·10 Nov 2025,·33 minsAmericanswers on 5 Live! Why is Donald Trump threatening to sue the BBC for $1 billion?AmericastAvailable for over a yearPresident Donald Trump has threatened to sue the BBC for $1 billion over how the editing of his speech in a Panorama documentary, calling it \"false and defamatory\". The BBC chair Samir Shah has apologised for an \"error of judgement\" over the edit, and said the BBC was considering how to respond to Trump.\nMatt Chorley, Justin, Anthony and Marianna discuss what Trump actually said in his January 6th speech, Trump’s long battle with the mainstream media, and what this could mean for the BBC.\nWe also look at the US government shutdown, Elon Musk launching a rival to Wikipedia, and whether a return of Barack Obama to politics could be possible.  \nHOSTS:\n* Justin Webb, Radio 4 presenter\n* Anthony Zurcher, North America correspondent\n* Marianna Spring, Social Media Investigations correspondent \nGET IN TOUCH:\n* Join our online community: https://discord.gg/qSrxqNcmRB\n* Send us a message or voice note via WhatsApp to +44 330 123 9480\n* Email Americast@bbc.co.uk\n* Or use #Americast\nThis episode was made by Rufus Gray with Alix Pickles and Grace Reeve. The technical producer was Ben Andrews. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app.\nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155\nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Americanswers on 5 Live! Why is Donald Trump threatening to sue the BBC for $1 billion? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-11-10T20:07:00.000Z",
      "dateModified": "2025-11-10T20:07:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-11-11T07:07:10.000Z",
    "description": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and p",
    "body": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-11-11T07:07:10.000Z",
      "dateModified": "2025-11-11T07:07:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Government to rethink rejection of Waspi compensation",
    "url": "https://www.bbc.com/news/articles/c709y7ln5zro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5764/live/6cfa9250-bf13-11f0-b8cd-876b55a928f2.jpg",
    "tag": "Trending",
    "date": "2025-11-11T18:24:52.000Z",
    "description": "2 hours agoKevin PeacheyCost of living correspondentGetty ImagesA decision to reject compensation for women hit by changes to the state pension age wi",
    "body": "2 hours agoKevin PeacheyCost of living correspondentGetty ImagesA decision to reject compensation for women hit by changes to the state pension age will be reconsidered by the government.Campaigners say 3.6 million women born in the 1950s were not properly informed of the rise in state pension age to bring them into line with men. Last year, the government apologised for a 28-month delay in sending letters, but rejected any kind of financial payouts.A document was not shown to Liz Kendall, who was Work and Pensions Secretary at the time of the decision, but had since come to light and needed to be considered, the government has now said.There is no guarantee any payout will be made, but campaigners said the move was a major step forward. Current Pensions Secretary Pat McFadden told the Commons that retaking the decision would not automatically lead to compensation.\"Retaking this decision should not be taken as an indication that government will necessarily decide that it should award financial redress,\" he said.The undisclosed evidence involved was a survey from 2007, and McFadden said that checks would be made to ensure other documents and surveys had not been missed. No timescale has been given for the work to be done.\"I understand that people are impatient for this matter to be resolved,\" he said.\"It is important that we give it full and appropriate consideration.\"Angela Madden, who chairs Women Against State Pension Inequality (Waspi), said: \"The government now knows it got it wrong and we are pleased they are now trying to do it properly.\"We hope they also try to do it quickly.\"She added that the \"only correct thing to do\" was to compensate those affected immediately.Compensation recommendedEarly last year, a parliamentary ombudsman recommended compensation of between £1,000 and £2,950 for each of those affected.While the Parliamentary and Health Service Ombudsman (PHSO) could recommend compensation, it could not enforce it and the government rejected it.Ministers said there was no evidence of \"direct financial loss\" resulting from the government's decision, and that Labour did not believe that paying a flat rate to all women at a cost of up to £10.5bn would be \"fair or proportionate\" to taxpayers.The Waspi campaign had called for payments of at least £10,000 each.It is pursuing a judicial review of the government's decision not to pay compensation. Campaigners raised money for the legal challenge and a court capped the contribution to the government's legal fees if they were unsuccessful.The case was scheduled to go to the High Court in December. The government has now informed the court of its latest decision.The age at which people receive the state pension has been increasing as people live longer, and currently stands at 66 for men and women.But for decades, men had received their state pension at 65 and women at the age of 60.Under the 1995 Pensions Act a timetable was drawn up to equalise the age at which men and women could draw their state pension. The plan was to raise the qualifying age for women to 65 and to phase in that change from 2010 to 2020.But the coalition government of 2010 decided to speed that up. Under the 2011 Pensions Act the new qualifying age of 65 for women was brought forward to 2018.The increases have been controversial. Campaigners say women born in the 1950s have been treated unfairly by the rapid changes and the way they were communicated to those affected.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Government to rethink rejection of Waspi compensation",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5764/live/6cfa9250-bf13-11f0-b8cd-876b55a928f2.jpg"
      ],
      "datePublished": "2025-11-11T18:24:52.000Z",
      "dateModified": "2025-11-11T18:24:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC must fight to restore trust, Nandy tells MPs",
    "url": "https://www.bbc.com/news/articles/cjd0g034r11o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/195b/live/f1a5f6d0-bf2b-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-11T19:47:09.000Z",
    "description": "27 minutes agoPaul Gribben and Ruth ComerfordCulture Secretary Lisa Nandy said the BBC must fight to restore trust after criticism that a Panorama doc",
    "body": "27 minutes agoPaul Gribben and Ruth ComerfordCulture Secretary Lisa Nandy said the BBC must fight to restore trust after criticism that a Panorama documentary misled viewers by editing a speech by Donald Trump.She said a review of the broadcaster's charter would ensure a \"genuinely accountable\" BBC, defending it as a \"national institution\".BBC director general Tim Davie earlier told staff \"we've got to fight for our journalism\" after the US president's threat to sue the corporation for $1bn (£760m).A leaked internal BBC memo said the Panorama film misled viewers by splicing together parts of Trump's speech on 6 January 2021 and made it appear as if he had explicitly encouraged the Capitol Hill riot. BBC chair Samir Shah has apologised.Davie resigned on Sunday alongside BBC News CEO Deborah Turness after mounting pressure over that memo. He told staff: \"We have made some mistakes that have cost us, but we need to fight\", adding that \"this narrative will not just be given by our enemies, it's our narrative\".He said the BBC went through \"difficult times… but it just does good work, and that speaks louder than any newspaper, any weaponisation\".Later on Tuesday Nandy thanked Davie and Turness for their work leading the BBC \"through stormy times.\"She warned MPs attacking the broadcaster to \"consider just what is at stake\".She told the Commons: \"There is a fundamental difference between raising serious concerns over editorial failings and members of this House launching a sustained attack on the institution itself, because the BBC is not just a broadcaster, it is a national institution that belongs to us all.\"She added that the BBC \"has faced criticism from all sides for its coverage of highly contentious and contested issues, and [has been] accused of giving too much airtime to particular parties, and for giving them too little\".The BBC's charter expires at the end of 2027 and the once-a-decade process of reviewing it is set to begin shortly, which she said would help it \"renew its mission for the modern age\".Nandy said there was a concern over how long the BBC took to respond to criticisms which undermined trust. She acknowledged the \"serious concerns and failings\" of the BBC Arabic Service, that had been raised in the memo, but urged strong support for the World Service, which she said was \"a light on the hill for people in places of darkness\".BBC figures on the corporation's editorial guidelines and standards committee will face questions at a hearing in coming weeks.Shah and board members Sir Robbie Gibb and Caroline Thomson are expected to attend a session called by the Commons culture, media and sport committee.Former editorial standards advisers Michael Prescott, the author of the leaked memo, and Caroline Daniel will also be invited to give evidence.Shadow culture secretary Nigel Huddleston said there are \"too many examples of bias\" at the BBC and said the corporation required \"institutional change\".In a post on social media on Tuesday, Conservative leader Kemi Badenoch said that while the BBC as an institution \"ought to be treasured\", it has \"continually let down licence fee payers\".Trump threatened to take legal action if the BBC did not make a \"full and fair retraction\" of the Panorama programme by Friday. The corporation has said it will reply in due course.In the staff call on Tuesday neither Davie nor the BBC chair mentioned Trump's legal threat.Downing Street has said this was a \"matter for the BBC\".\"It is clearly not for the government to comment on any ongoing legal matters,\" the prime minister's official spokesperson said.\"Our position is clear, the BBC is independent and it's for the corporation to respond to questions about their editorial decisions.\"Asked whether there were concerns the issue would affect Sir Keir Starmer's contacts with Trump, the spokesperson said the two had a \"very strong\" relationship.The spokesperson would not be drawn on whether the BBC should apologise directly to the president.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC must fight to restore trust, Nandy tells MPs",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/195b/live/f1a5f6d0-bf2b-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-11T19:47:09.000Z",
      "dateModified": "2025-11-11T19:47:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Biologist bitten in head by shark hopes to meet animal again",
    "url": "https://www.bbc.com/news/articles/cj0ep00g3ydo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e817/live/298cd6d0-befb-11f0-a970-eb79eb0c7376.jpg",
    "tag": "Trending",
    "date": "2025-11-11T15:56:32.000Z",
    "description": "'This animal spared my life': Biologist bitten in head by shark hopes to meet it again4 hours agoRafael AbuchaibeBBC News MundoMauricio HoyosMauricio ",
    "body": "'This animal spared my life': Biologist bitten in head by shark hopes to meet it again4 hours agoRafael AbuchaibeBBC News MundoMauricio HoyosMauricio Hoyos has spent 30 years studying the behaviour of different shark speciesMauricio Hoyos still remembers the pressure that the jaws of a female Galapagos shark, over 3m (10ft) in length, exerted on his skull.The animal had lunged at him with astonishing speed, giving him barely enough time to duck his head in a last ditch effort to protect his jugular vein.\"When it closed its jaw, I felt the pressure of the bite, and then, after what I think was a second, it opened it again and it let me go,\" Hoyos told BBC Mundo from his home in Baja California, Mexico, a little over month after surviving the incident.Hoyos, a marine biologist with over 30 years of experience studying sharks in their natural habitat, was on a research trip in Costa Rica when he was attacked by the shark in September.Less than two months on, and still bearing the scars from the attack on his face, he describes his recovery as \"incredible\" - and says he even hopes to encounter his assailant again.Hoyos calls the shark bite \"a battle scar that looks like gills\"For Hoyos, what happened to him that day in the waters off Cocos Island is the result of normal animal behaviour when confronted with a perceived threat. \"In this case, this bite was like a dog's,\" he says.\"Have you ever seen how dogs, when another dog gets too close, throw a quick bite? It doesn't hurt it, but it calms the other dog down.\"Hoyos - who along with his colleagues attaches acoustic tags to sharks to help pinpoint their mating and spawning grounds as part of his work - was alerted to the shark's presence in the water by tourists.It was at a depth of 40m, and Hoyos told the captain of the boat he was on that he would be there \"for a maximum of five minutes\".He then entered the water and began his slow descent.Getty ImagesGalapagos sharks can grow 3m in lengthHoyos recalls encountering the shark: \"This giant female, measuring between 3 and 3.5m (11.5ft), swam by and headed toward the bottom, and I positioned myself to tag her at the base of her dorsal fin.\"But Hoyos, who has tagged many kinds of sharks in his decades-long career, says this animal reacted differently to others.\"Obviously the tip - the metal tip attached to the cable hanging from the probe - goes in, and unlike the other sharks I've tagged that immediately flee, she turns around and stares at me,\" he recalls.\"I saw her little eye looking at me, and I saw her very calmly turning around.\"Hoyos and his colleagues tag sharks with probes like this oneHoyos says he held the shark's gaze as it swam away - but then, suddenly, out of nowhere, it lunged at him.\"I lowered my head, and what I felt was its lower jaw digging into my cheek and its upper jaw into my head. I was there, I imagine for a second, no more, inside its jaw, and then it simply opened it again.\"\"When it closed it, I felt the pressure of the bite, and then it just let me go,\" he marvels.The Galapagos shark's 29 serrated teeth not only left Hoyos with deep wounds to his face and head, but also severed the air line of his diving apparatus.He had survived the shark attack but was still in mortal danger.In addition, one of the teeth had torn his diving mask, and the blood-tinged water was further blurring his already limited visibility.\"When I realised that no air was coming out of the hose, I grabbed a second one we have, which we call an octopus, that is used to give air to someone else if they need it,\" he tells BBC Mundo. \"But then I realised that the regulator wasn't working and was blowing air instead of regulating it, so I had to remember my training and start regulating it with my lips.\"Bleeding, blinded, and with the air escaping, Hoyos calculated that he had less than a minute to reach the surface.\"Since I couldn't see anything, what I did was look for the light that I knew was the surface. I started swimming upwards, in a very coordinated manner, because I wanted to avoid erratic movements that would attract the shark.\"Mauricio HoyosHoyos had to use all the lessons he had learned during years of diving to survive the attackAfter Hoyos reached the surface, a young man pulled him aboard the boat, and when the captain saw his condition, he called the park ranger station to report the incident.Hoyos explained that he didn't feel the pain of his injuries until much later.\"Obviously, I had adrenaline in my system, but the bite didn't hurt that much. What hurt the most was the impact: when the shark bit me - an animal 3m long and at that speed - it was like being hit by a car. In fact, I ended up with a huge bruise all over my jaw; I thought it was broken.\"When they docked, a team of paramedics was ready to provide him with emergency care.Hoyos was lucky: as well as surviving the attack and the subsequent ascent, none of his wounds became infected, and the healing process took less time than anyone could have imagined.\"The doctors told me it was amazing: the attack happened on 27 [September], I had a 34-hour trip, they performed a surgical debridement [removing damaged tissue], and two days later they were already evaluating whether they could perform reconstructive surgery.\"It could have been far worse for Hoyos. According to the doctors, a young man who survived a Galapagos shark attack in the same area in 2017 had to remain in a hyperbaric chamber for almost a month because his wounds weren't healing properly.\"They told me my recovery had been incredible. After the surgery, the doctors confessed how worried they had been about an infection, because being on my face, it was a direct path to the brain.\"Mauricio HoyosSmiling broadly, Hoyos adds that he is already planning to get back into the water and has a diving trip booked for 14 November.And he says that after having survived an attack of this magnitude he has even more respect for the animals he studies.\"Many people think the oceans would be better off without sharks, but they really say that because they don't understand the crucial role sharks play in maintaining their delicate balance.\"Pointing to the large scar on his cheek, he says: \"This is the proof that this female spared my life; I can't put it any other way. And this will allow me to continue speaking well of sharks and advocating for their conservation in the future.\"Meanwhile, the Galapagos shark that had Hoyos in its jaws continues its natural life in the depths, and he hopes to see it again. And since he was able to mark it before it attacked him, that possibility exists.\"In January I'm going to Cocos Island, we have a trip from the 20 to 27. And obviously I'm going to Roca Sucia [where the attack happened], I'm going to dive down there,\" he says, undeterred.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Biologist bitten in head by shark hopes to meet animal again",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e817/live/298cd6d0-befb-11f0-a970-eb79eb0c7376.jpg"
      ],
      "datePublished": "2025-11-11T15:56:32.000Z",
      "dateModified": "2025-11-11T15:56:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kate and Queen lay Armistice Day wreaths as nation pays tribute",
    "url": "https://www.bbc.com/news/articles/cj41g5w0vgno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/842f/live/9cf37ac0-bef6-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "Trending",
    "date": "2025-11-11T12:18:04.000Z",
    "description": "The Princess of Wales and the Queen have joined services to mark Armistice Day in the UK as events took place around the world.Catherine stood at the ",
    "body": "The Princess of Wales and the Queen have joined services to mark Armistice Day in the UK as events took place around the world.Catherine stood at the ceremony at the National Memorial Arboretum in Staffordshire, where the Last Post signalled the start of a national two-minute silence at 11:00 GMT to mark the end of World War One.Queen Camilla was at Paddington Station in London for the wreath-laying ceremony, having travelled by train.The Prince of Wales has also delivered a video message to young people, sharing his views on the importance of wearing a red poppy and to say that \"remembrance is for everyone\".It was the first time Catherine had attended the service at the National Memorial Arboretum.She laid a wreath in the centre of the armed forces memorial, watched by a crowd which included veterans and their families.Catherine appeared to take a moment of reflection before returning to her seat where she bowed her head as the crowd prayed for those who had been affected by conflict.The Prince of Wales' message was a virtual event for children between nine and 14 in the UK.In it he says: \"When we remember, we connect with service in a personal way.\"We learn from the courage of others, and we carry their stories forward, so they are not forgotten.\"It's not just about the past - it's about shaping who we become in the future.\"Remembrance teaches us empathy, resilience and responsibility.\"And when we wear a red poppy or take a moment of silence, we are saying, 'Thank you. We have not forgotten, and we will not forget'.\"Meanwhile, the service in Staffordshire featured the reading of a specially- commissioned poem by the arboretum's poet in residence, Arji Manuelpillai.\"A Sonnet For Us All captures the stories etched into the hundreds of memorials within the National Memorial Arboretum, it invites people to listen, reflect and consider the emotion that was the inspiration for these sculptures,\" Mr Manuelpillai said.\"These human connections, and the gentle responsibility to carry love forward, are themes that resonate not only with me, but also with HRH The Princess of Wales, for whom the importance of service and compassion lies especially close to the heart.\"Queen Camilla joined commuters on the 09:28 train from Chippenham in Wiltshire to Paddington where a service was held for service personnel and their families.Later on Tuesday, William will join the King and Queen at Windsor Castle where a reception will honour veterans who served in the Pacific during the Second World War.The event, which the Duke of Edinburgh and the Duchess of Gloucester will also attend, continues the commemorations for the 80th anniversary of VJ Day - or Victory over Japan Day.Elsewhere around the world French President Emmanuel Macron attended a wreath-laying ceremony in the Champs-Elysees in Paris to mark the signing of the armistice at the 11th hour of the 11th day of the 11th month.Meanwhile the Princess Royal is in Australia, visiting Brisbane's Galipolli Barracks where she laid a wreath.Along with her husband, Sir Timothy Laurence, Princess Anne also met current and former armed forces and their families.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kate and Queen lay Armistice Day wreaths as nation pays tribute",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/842f/live/9cf37ac0-bef6-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-11T12:18:04.000Z",
      "dateModified": "2025-11-11T12:18:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man dances for 144 hours to break video game marathon record",
    "url": "https://www.bbc.com/news/articles/cy8vwjp4jxyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2cf6/live/ee8d7260-bf0e-11f0-b5a4-fb5de6982057.jpg",
    "tag": "Trending",
    "date": "2025-11-11T17:19:37.000Z",
    "description": "3 hours agoLaura CressGuinness World RecordsA Hungarian man has set a new record for longest video game marathon by playing the rhythm-based music gam",
    "body": "3 hours agoLaura CressGuinness World RecordsA Hungarian man has set a new record for longest video game marathon by playing the rhythm-based music game Dance Dance Revolution for six days.Szabolcs Csépe, from Budapest, bopped to over 3000 songs and burned more than 22,000 calories in his quest to romp into the record books.The 34-year-old, known as GrassHopper on his gaming channels, said that preparation for the marathon took six months and included physical training, focusing on his \"legs and glutes\", as well a a diet plan.\"Playing DDR is always fun for me,\" he told BBC News, \"so this challenge was best described as tediously joyful\".His feat has been officially recognised by Guinness World Records.Dance Dance Revolution is a Japanese video game series which was first released to arcades in 1998.Players stand on a dance platform or mat and hit coloured arrows with their feet, to score points in time with visual cues and the music from a catalogue of songs.The series has spawned dozens of spin-offs in arcades and many more across home consoles.The games have also become popular as a way to keep fit, featuring in UK and US school exercise programmes. In 2004 the series was even recognised as an official sporting event in Norway.More recently the game has grown in popularity in the esports community, with players across the world competing in official and fan-run tournaments.Getty ImagesDance Dance Revolution started life as an arcade game in 1998.Mr Csépe said he was inspired to try the challenge after watching the attempt of previous holder Carrie Swidecki, from the US, who spent a little over 138 hours playing Just Dance in 2015.But the avid gamer, who works in IT engineering, had already broken several records before attempting this dancing feat. In 2021, he achieved the longest videogame marathon playing a Naruto game (28 hr 11 min 32 sec playing Narutimetto Akuseru 2) and the longest videogame marathon playing a puzzle game (32 hr 32 min 32 sec playing Tetris Effect).And in 2023, a 90-hour gaming session on Gran Turismo 7 earned him three more endurance-testing accolades, including the longest videogame marathon playing a racing simulator game.Mr Csépe, who earned the nickname GrassHopper as a child because he was \"always jumping around\", told the BBC he had been playing Dance Dance Revolution for almost 20 years, but the marathon was far from a dance in the park.Mr Csépe said he was allowed to have breaks \"through well-earned rest times\", with one hour of dancing earning him a ten minute break, which could be accumulated to allow him to sleep for an hour or two.Despite the immense effort, the world record holder added that if the record got beaten in the future, he would \"certainly return\" to defend his dancing crown.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man dances for 144 hours to break video game marathon record",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2cf6/live/ee8d7260-bf0e-11f0-b5a4-fb5de6982057.jpg"
      ],
      "datePublished": "2025-11-11T17:19:37.000Z",
      "dateModified": "2025-11-11T17:19:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hamas fighters trapped in tunnels present new obstacle to Gaza ceasefire progress",
    "url": "https://www.bbc.com/news/articles/c8912d7jxl2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8b30/live/01205110-bf1c-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "Trending",
    "date": "2025-11-11T18:16:47.000Z",
    "description": "2 hours agoHugo BachegaMiddle East correspondent  , JerusalemAFPHamas wants its fighters in Rafah to be given safe passage, which has so far been reje",
    "body": "2 hours agoHugo BachegaMiddle East correspondent  , JerusalemAFPHamas wants its fighters in Rafah to be given safe passage, which has so far been rejected by Israel (file photo)US President Donald Trump's envoy and son-in-law, Jared Kushner, returned to Israel on Monday, as mediators face a new obstacle in their efforts to advance negotiations on the fragile Gaza ceasefire deal to the next and more complex phase.Key sticking points remain unresolved, including Hamas's disarmament, the reconstruction and future governance of Gaza, and the deployment of an international security force to the territory.Without a timeline for the discussions, which are likely to require significant concessions from both Israel and Hamas, there are doubts that any progress can be achieved.Another challenge has emerged recently, involving scores of Hamas fighters believed to be in tunnels beneath the southern city of Rafah behind the so-called \"Yellow Line\", which marks the area under Israeli control.Israel GPO via EPAJared Kushner (2nd L) and Prime Minister Benjamin Netanyahu (2nd R) held talks in Jerusalem on MondayLast week, US special envoy Steve Witkoff said an amnesty could be offered for fighters who laid down their arms, and that this could be a \"model\" for what Washington hoped to apply in the rest of Gaza.Witkoff said 200 fighters were trapped, although this number has not been confirmed.According to media reports, Kushner and the Israeli Prime Minister, Benjamin Netanyahu, discussed the issue during a meeting in Jerusalem on Monday.Hamas has previously said the fighters will not surrender and demanded that they are given safe passage, which has so far been rejected by Israel.An Israeli government spokeswoman said Netanyahu and Kushner had \"discussed phase one, which we are currently still in, to bring our remaining hostages, and the future of phase two of this plan, which includes the disarming of Hamas, demilitarising Gaza, and ensuring Hamas will have no role in the future of Gaza ever again\".The war in Gaza was triggered by the Hamas-led attack on southern Israel on 7 October 2023, when about 1,200 people were killed and 251 others were taken hostage.Since then, more than 69,000 people have been killed by Israeli attacks in Gaza, according to the Hamas-run health ministry, whose figures the UN considers reliable.The first phase of the ceasefire, which came into force last month, focused on halting the war, returning all hostages, and securing a surge in humanitarian aid into Gaza.Twenty living hostages and the remains of 24 deceased captives have been released, with four bodies remaining in Gaza.In return, Israel has freed 250 Palestinian prisoners from its jails and 1,718 detainees from Gaza who were being held without charge or trial. It has also handed over the remains of 315 Palestinians from Gaza.Both Israel and Hamas have accused each other of violating the truce, with Israel saying Hamas has deliberately delayed the return of the remains of hostages and Hamas saying that Israel has killed at least 240 Palestinians and is restricting the entry of aid supplies.Watch: BBC's Lucy Williamson taken to east of Gaza City in IDF-led visitHamas has previously rejected disarmament, saying it would only do so once a Palestinian state has been established. Israel refuses any involvement in the governance of Gaza by the Western-backed Palestinian Authority, which is the body that governs parts of the occupied West Bank. Countries are reluctant to commit troops to the multinational force without clear goals, concerned that their soldiers might end up confronting fighters from Hamas and other Palestinian factions.The Israeli military currently occupies 53% of Gaza's territory and is expected to withdraw further in the next stage of the plan.With no indication of imminent advances in the negotiations, a de-facto partition of Gaza between the area controlled by Israel and another ruled by Hamas was increasingly likely, sources told the Reuters news agency, with talks about reconstruction apparently likely to be limited to the Israel-controlled territory.Arab countries have already expressed concerns that the current separation could become a permanent partition of Gaza.The Trump plan does not include a pathway to Palestinian statehood - a concept which Israel rejects.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hamas fighters trapped in tunnels present new obstacle to Gaza ceasefire progress",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8b30/live/01205110-bf1c-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-11T18:16:47.000Z",
      "dateModified": "2025-11-11T18:16:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Northern Lights set to dazzle UK this week due to possible 'Severe' geomagnetic storm",
    "url": "https://www.bbc.com/weather/articles/cpv13jpmxw7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/a1d4/live/38051140-bf15-11f0-b8cd-876b55a928f2.jpg",
    "tag": "Trending",
    "date": "2025-11-11T18:02:49.000Z",
    "description": "Image source, PA / Owen HumphreysByElizabeth RizziniLead Weather Presenter There is a good chance of seeing the Northern Lights in the early hours of ",
    "body": "Image source, PA / Owen HumphreysByElizabeth RizziniLead Weather Presenter There is a good chance of seeing the Northern Lights in the early hours of Wednesday or on Wednesday night in many parts of the UK.That is because the Sun is going through an active phase experiencing a number of eruptions, called Coronal Mass Ejections. These send solar particles towards the Earth.It is the interaction of these particles with the Earth's atmosphere that create the stunning light displays we see in the night sky.According to the UK Met Office Space Weather forecast, the best chance of seeing the Northern Lights or aurora will be across the northern half of the UK. But there is also a chance in clear skies further south.Image source, BBC Weather Watcher / olly79Image caption, Portmahomack in the Highlands captured last weekWhat is a geomagnetic storm? Geomagnetic storms are disturbances in the Earth's magnetic field that last minutes or hours and are caused by Coronal Mass Ejections (CMEs) and solar flares.It has been reported that there are three CMEs heading towards Earth from the Sun.The National Oceanographic Atmospheric Administration (NOAA), who measure the strength of these storms, say that there is chance of a Strong G3 or even Severe G4 geomagnetic storm being triggered especially on Wednesday into Thursday.Although dangerous for astronauts, geomagnetic storms are not harmful to humans as Earth's atmosphere protects us from the radiation.However, these storms can sometimes disrupt satellites and also different forms of electronic devices, such as phones.For example, in 2017 two massive solar flares fired out from the surface of the Sun disrupted devices such as GPS navigation systems on Earth.And the Victorians also struggled with the effect of space weather in 1859 when a huge solar eruption caused a geomagnetic storm that interfered with railway signalling and telegraph lines. This was known as the Carrington Event.The KP index is an alternative measure of geomagnetic activity extending from KP1 to KP9. It can be be used to denote the southern extent of the aurora. This storm is classed as a rare KP8. This means the aurora could be visible across many parts of the UK including the south in the nights to come.There may be effects on power grids and satellite navigation.What is a Coronal Mass Ejection?Image source, NASA via ReutersImage caption, A NASA image of the Sun showing solar eruptionsCoronal Mass Ejections are huge bursts of charged plasma travelling at millions of miles an hour that explode out of the Sun's outer atmosphere or corona.They spew light, energy and solar material into space, sometimes towards Earth, which is the case this week.The solar material, or plasma, is charged. These charged particles can interact with gases in the Earth's atmosphere, particularly near the poles, leading to the displays of aurora. These ejections can sometimes take days to reach the Earth.In addition on Tuesday, the US National Weather Service Space Weather Prediction Center reported seeing a massive solar flare on the Sun - likely the strongest of the current cycle.Solar flares are bursts of electromagnetic radiation that travel from the Sun at the speed of light, reaching Earth in just over eight minutes. These can also cause aurora.Clear skies for the aurora?Image source, BBC WeatherTo see the aurora find a dark spot with minimal light pollution and a good view of the northern horizon. The aurora is sometimes more clearly viewed through a camera lens.You will also need clear skies. So what is in the forecast?On Tuesday night there will always be the risk of some cloud around but clear skies should develop in southern and north-eastern Scotland as a weather front clears southwards. Northern England and Northern Ireland will also see some clear skies in the second half of the night. There could also be some clearer spells developing across Wales, the Midlands and perhaps south-west England later in the night.We are less likely to see clear skies overnight on Wednesday although there could be some early on for East Anglia and later for northern Scotland. If you are not lucky enough to catch the Aurora Borealis this time, keep an eye out for further alerts here at BBC Weather. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Northern Lights set to dazzle UK this week due to possible 'Severe' geomagnetic storm",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/a1d4/live/38051140-bf15-11f0-b8cd-876b55a928f2.jpg"
      ],
      "datePublished": "2025-11-11T18:02:49.000Z",
      "dateModified": "2025-11-11T18:02:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]