[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Is Rachel Reeves Facing a Budget ‘Groundhog Day’? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0m933jg?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-10-16T20:07:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·16 Oct 2025,·33 minsIs Rachel Reeves Facing a Budget ‘Groundhog Day’?NewscastAvailable for over a yearToday, the Institute for Fiscal Studies has warned the Chancellor she’s risking being stuck in ‘Groundhog Day’ when it comes to her upcoming Autumn budget.\nAdam is joined by Faisal, who’s been speaking to Chancellor Reeves at the IMF summit in Washington DC, and Helen Miller, director of the Institute for Fiscal Studies, who have published their Green Budget document today. They discuss why Rachel Reeves should fear being stuck in an economic doomloop, the taxes that could rise in November’s budget, and what the chancellor has said to Faisal about ‘targeted action’ on inflation and the cost of living. \nAnd, BBC Security Correspondent Frank Gardener has been at a lock-in listening to the MI5 boss Sir Ken McCallum giving his annual speech on threats to the UK. Adam and Frank discuss what Sir Ken said about the UK’s relationship with China, following this week’s collapsed China spy case. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Miranda Slade with Shiler Mahmoudi and Sophie Millward. The social producer was Beth Pritchard. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Is Rachel Reeves Facing a Budget ‘Groundhog Day’? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-10-16T20:07:00.000Z",
      "dateModified": "2025-10-16T20:07:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ukrainecast - Q&A: Tomahawk missiles, the drone race, and Ukrainian Halloween - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0m91pv4?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0kwvwyl.jpg",
    "tag": "Trending",
    "date": "2025-10-16T17:10:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·16 Oct 2025,·27 minsQ&A: Tomahawk missiles, the drone race, and Ukrainian HalloweenUkrainecastAvailable for over a yearAs Volodymyr Zelensky prepares to make his latest pitch to Donald Trump at the White House on Friday, the US is yet to announce a decision on the delivery of long range Tomahawk missiles to Ukraine. Could Washington have given the green light behind the scenes already? Are Ukrainian claims of frontline counteroffensives being exaggerated? And which side is coming out on top when it comes to drone technology?\nTo answer your questions, Lucy is joined by BBC Verify’s Olga Robinson and Mikey Kay from The Security Brief on the BBC news channel. The team also discuss Russian attacks on energy infrastructure, Nato military exercises and Halloween celebrations in Ukraine.\nToday’s episode is presented by Lucy Hockings.\nThe producers were Laurie Kalus and Julia Webster. The technical producer was Jonny Baker. The social producer was Joe Wilkinson. The series producer is Chris Flynn. The senior news editor is Sam Bonham.\nEmail Ukrainecast@bbc.co.uk with your questions and comments. You can also send us a message or voice note via WhatsApp, Signal or Telegram to +44 330 1239480\nYou can join the Ukrainecast discussion on Newscast’s Discord server here: tinyurl.com/ukrainecastdiscordProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ukrainecast - Q&A: Tomahawk missiles, the drone race, and Ukrainian Halloween - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0kwvwyl.jpg"
      ],
      "datePublished": "2025-10-16T17:10:00.000Z",
      "dateModified": "2025-10-16T17:10:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-10-17T04:59:32.000Z",
    "description": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and p",
    "body": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-10-17T04:59:32.000Z",
      "dateModified": "2025-10-17T04:59:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "KISS founding guitarist Ace Frehley dies aged 74",
    "url": "https://www.bbc.com/news/articles/cj41vwgv47no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/285f/live/b09d0690-aaec-11f0-83de-033e77bcbaac.jpg",
    "tag": "Trending",
    "date": "2025-10-17T00:14:22.000Z",
    "description": "8 hours agoHelen SullivanBBC NewsGetty ImagesPaul Daniel \"Ace\" Frehley, founding guitarist for the American rock band KISS, has died aged 74, his fami",
    "body": "8 hours agoHelen SullivanBBC NewsGetty ImagesPaul Daniel \"Ace\" Frehley, founding guitarist for the American rock band KISS, has died aged 74, his family announced in a statement reported in US media.Frehley died surrounded by family, who said they were \"completely devastated and heartbroken\".\"We were fortunate enough to have been able to surround him with loving, caring, peaceful words, thoughts, prayers and intentions as he left this earth,\" the statement said. The guitarist was known for his \"Spaceman\" persona, from the days when KISS was founded with the original line-up of Paul Stanley on vocals and rhythm guitar, Gene Simmons on vocals and bass guitar, Frehley, on lead guitar and vocals and Peter Criss on drums and vocals. Getty ImagesThey applied black and white face paint to create four enduring characters - Demon, Starchild, Spaceman and Catman.  \"We cherish all of his finest memories, his laughter, and celebrate his strengths and kindness that he bestowed upon others. The magnitude of his passing is of epic proportions, and beyond comprehension. Reflecting on all of his incredible life achievements, Ace's memory will continue to live on forever!\" the family said. In a joint statement, Stanley and Simmons said, \"We are devastated by the passing of Ace Frehley. He was an essential and irreplaceable rock soldier during some of the most formative foundational chapters of the band and its history. He is and will always be a part of KISS's legacy.\"Frehley is survived by his wife Jeanette and his daughter, Monique.Kiss first formed in 1973. The band produced hits such as Rock and Roll All Nite and God of Thunder. Known for wearing big wigs, black leather, glitter, platform shoes - and making a lot of noise - the band had sold 100 million records by 2024. Frehley often played a guitar that emitted smoke.In 1983, they appeared without face paint for the first time and enjoyed something of a resurgence. This was known as their \"unmasking\". They later re-masked in the late 1990s.In 1982, Frehley quit the group, which continued with different musicians. He returned for the band's 1996 reunion tour and stayed on until 2002. The original members were inducted into the Rock n Roll Hall of Fame in 2014. Getty ImagesFreyley was born in the Bronx, New York, and was given his first guitar as a Christmas present when he was 13. He later left high school to pursue music. \"I'm a high school drop out but here I am a millionaire and I never even took a guitar lesson in my life,\" he told Metal Express radio in 2020.In 2024, the band sold its back catalogue of songs to a Swedish music investor for a figure thought to be upwards of $300m (£237m).Stockholm-based Pophouse Entertainment also bought the group's brand, likeness and intellectual property.The sale marked the band's retirement from live performances, but Frehley continued to perform, releasing eight solo albums. In September this year he announced that he would have to cancel his performance at the Antelope Valley Fair in Lancaster, California after falling in his studio and being taken to hospital. \"He is fine, but against his wishes, his doctor insists that he refrain from travel at this time,\" representatives said in a statement at the time. He later cancelled the remainder of his tour dates due to \"ongoing medical issues\". The BBC has reached out to the band's representatives. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "KISS founding guitarist Ace Frehley dies aged 74",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/285f/live/b09d0690-aaec-11f0-83de-033e77bcbaac.jpg"
      ],
      "datePublished": "2025-10-17T00:14:22.000Z",
      "dateModified": "2025-10-17T00:14:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Saltend: Major UK rare earths refinery scrapped in favour of US",
    "url": "https://www.bbc.com/news/articles/czxnv7y03nno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0928/live/867e40c0-aabc-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-17T07:26:58.000Z",
    "description": "49 minutes agoTheo LeggettBusiness correspondentPlans for a groundbreaking rare earths refinery in East Yorkshire have been abandoned, after the compa",
    "body": "49 minutes agoTheo LeggettBusiness correspondentPlans for a groundbreaking rare earths refinery in East Yorkshire have been abandoned, after the company behind the project decided to seek investment in the United States instead.Pensana has spent the past seven years developing a rare earths mine in Angola. The $268m (£185m) project, one of the largest of its kind in the world, will begin delivering raw materials in 2027.The company had planned to build a refinery at the Saltend Chemicals Plant near Hull, which would have processed the raw materials into metals used to create powerful magnets.These magnets would then be used in high-tech applications such as motors for electric vehicles, wind turbines and robotics.The project would have given the UK a strategic foothold in the rare earths industry, which is currently dominated by China. However, as first reported by Sky News, the plan has now been dropped.Despite what the name implies, rare earths are actually relatively common. The term is used to describe a group of chemically similar minerals which are abundant in the Earth's crust – but which are also comparatively difficult and costly to extract.However, according to Pensana, China has in recent years used its market power to keep prices artificially low in order to stifle potential competition – and this has made refining in the UK uneconomic without significant government support.Speaking to reporters on Thursday at a meeting of the International Monetary Fund, Chancellor Rachel Reeves was asked about growing tension between the US and China over rare earths. The chancellor said she was working with G7 counterparts \"on our own critical minerals strategy, so that we are less reliant\".In 2022, Boris Johnson announced plans for \"a multi-million pound investment\" in the Saltend project - launched alongside the then Tory government's 'Critical Minerals Strategy'. However, according to Pensana's founder and chairman, Paul Atherley, this contribution – actually £5m - was \"nowhere near enough\", and the Treasury proved unwilling to contribute more.Mr Atherley compares this with a deal between the US government and MP Materials, under which MP will benefit from more than half a billion dollars worth of investment and soft loans to fund a similar facility in California, as well as a 10-year agreement to ensure all the magnets it produces are sold for a minimum price.Earlier this year Pensana announced plans to team up with the US refiner ReElement, to develop a \"sustainable, independent rare earth supply chain\". It is also planning to list its shares on the Nasdaq stock exchange.Mr Atherley insists he remains \"very positive on the UK\". Another company he is involved in, Tees Valley Lithium, is pushing ahead with plans for a lithium refinery in the Northeast.A spokesperson for the Department for Business and Trade said: \"It is disappointing Pensana has decided not to proceed with this development, but it is ultimately a commercial decision for the company.\"We will publish a new Critical Minerals Strategy soon to help secure our supply chains for the long term, and we're reducing industrial electricity costs for businesses as part of our modern Industrial Strategy.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Saltend: Major UK rare earths refinery scrapped in favour of US",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0928/live/867e40c0-aabc-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-17T07:26:58.000Z",
      "dateModified": "2025-10-17T07:26:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Taylor Swift fans flock to German museum to see Ophelia painting",
    "url": "https://www.bbc.com/news/articles/cvgvwvq2jg4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cc42/live/9f5a4000-ab0a-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-17T08:11:35.000Z",
    "description": "4 hours agoHelen SullivanGetty ImagesListening events for Taylor Swift's releases allow fans to gather together to hear the new materialTaylor Swift f",
    "body": "4 hours agoHelen SullivanGetty ImagesListening events for Taylor Swift's releases allow fans to gather together to hear the new materialTaylor Swift fans are driving a surge in popularity of a German museum exhibiting a portrait of the Shakespeare character Ophelia, recently reimagined in a song and music video from Swift's new album The Life of a Showgirl.The Hessische Landesmuseum in the central German city of Wiesbaden saw hundreds more visitors than usual over the weekend, as fans hoped to see the real version of the painting that opens the music video for The Fate of Ophelia.In the video, viewed more than 65 million times on Youtube, the painting comes alive, with Swift at its centre. \"We're really enjoying this attention - it's a lot of fun,\" museum spokesperson Susanne Hirschmann told the Associated Press. Hirschmann said that one family had travelled from the northern city of Hamburg, a five-hour drive away, while some of the visitors were Americans from an army base nearby. Hirschmann said fans realised the Friedrich Heyser painting - believed to date to 1900 - was there when the team, noticing the resemblance, put an announcement on their website inviting any Swift fans to attend a special tour. The news then went viral online, the museum said. Social media posts explaining the painting's whereabouts got thousands of likes, far higher than the hundred or so likes that most of its posts tend to get.In Hamlet, Ophelia, his wife, a young noblewoman from Denmark, goes mad and drowns. While less well-known than John Everett Millais's painting of Ophelia, the portrait also depicts a woman in a long dress lying drowned in water, surrounded by flowers. AlamyThe Friedrich Heyser painting depicts Shakespeare character Ophelia and is believed to date to 1900 The image is invoked by on Swift's album cover, which shows her partially submerged in water. \"We are surprised and delighted that Taylor Swift used this painting from the museum as inspiration for her video,\" museum director Andreas Henning told German news agency DPA. \"This is, of course, a great opportunity to attract people to the museum who don't know us yet.\"The Life of a Showgirl secured the UK's biggest opening week of 2025, after selling 304,000 copies in the first seven days. In the US, it earned more than 4 million equivalent album units in the United States in its opening week, according to Billboard, beating the record set by Adele with her album 25 in 2015. The record is Swift's third album to top the UK album chart in 2025, following Lover (Live From Paris) in February and The Tortured Poets Department, when it returned to number one in April.It is also the first studio album Swift has released since she announced her engagement to NFL star Travis Kelce in August and revealed in May that she had regained control over her back catalogue.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Taylor Swift fans flock to German museum to see Ophelia painting",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cc42/live/9f5a4000-ab0a-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-17T08:11:35.000Z",
      "dateModified": "2025-10-17T08:11:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Baek Se-hee: South Korean author of I Want to Die But I Want to Eat Tteokbokki dies at 35",
    "url": "https://www.bbc.com/news/articles/cpq1dy8w3jwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d211/live/06e5cf80-ab21-11f0-93f3-35cf52b1b510.png",
    "tag": "Trending",
    "date": "2025-10-17T06:20:46.000Z",
    "description": "2 hours agoKoh EweInstagram / Baek Se-heeBaek Se-hee's 2018 memoir was lauded for its honest portrayal of mental health conversationsBaek Se-hee, the ",
    "body": "2 hours agoKoh EweInstagram / Baek Se-heeBaek Se-hee's 2018 memoir was lauded for its honest portrayal of mental health conversationsBaek Se-hee, the South Korean author of the bestselling memoir I Want to Die but I Want To Eat Tteokbokki has died at the age of 35.Her 2018 book, a compilation of conversations with her psychiatrist about her depression, was a cultural phenomenon with its themes of mental health resonating with readers across the world.Originally written in Korean, it found international acclaim after its English translation was published in 2022.The details surrounding her death are unclear.Baek donated her organs - her heart, lungs, liver and kidneys - which have helped to save five lives, the Korean Organ Donation Agency said in a statement on Friday.The statement also included comments from her sister, which said that Baek had wanted to \"share her heart with others through her work, and to inspire hope\".I Want to Die but I Want to Eat Tteokbokki, published in 2018, has sold more than a million copies worldwide and been translated in 25 countries.The runaway bestseller was celebrated for normalising mental health conversations and its nuanced take on inner struggles - most notably, the author's personal conflict between depressive thoughts and her appreciation for simple joys.BloomsburyI Want to Die but I Want To Eat Tteokbokki contains a record of conversations between the author and her psychiatrist\"The human heart, even when it wants to die, quite often wants at the same time to eat some tteokbokki, too,\" goes the book's most famous line.Born in 1990, Baek Se-hee took creative writing in university and worked for five years at a publishing house, according to her short biography on Bloomsbury Publishing, which produced the English version of her 2018 memoir.For a decade she received treatment for dysthymia, a mild but long-lasting type of depression, which formed the basis of her bestseller, said her Bloomsbury bio.A sequel, I Want to Die but I Still Want to Eat Tteokbokki, was published in Korean in 2019. Its English translation was published in 2024.A list of organisations in the UK offering support and information with some of the issues in this story is available at BBC Action Line. If you are outside of the UK, you can visit the Befrienders website.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Baek Se-hee: South Korean author of I Want to Die But I Want to Eat Tteokbokki dies at 35",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d211/live/06e5cf80-ab21-11f0-93f3-35cf52b1b510.png"
      ],
      "datePublished": "2025-10-17T06:20:46.000Z",
      "dateModified": "2025-10-17T06:20:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'China spy fiasco' and 'Ban' on Israeli fans a 'national disgrace'",
    "url": "https://www.bbc.com/news/articles/crmxz4zlj97o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d6e8/live/1aa65a90-aaf3-11f0-b2a1-6f537f66f9aa.png",
    "tag": "Trending",
    "date": "2025-10-17T01:09:33.000Z",
    "description": "7 hours agoThe collapsed China spy case leads the majority of the papers for the second day in a row, with the Telegraph detailing who is facing quest",
    "body": "7 hours agoThe collapsed China spy case leads the majority of the papers for the second day in a row, with the Telegraph detailing who is facing questions in the aftermath. It reports that the prime minister could be forced to give evidence in public after two parliamentary committees announced inquiries into the \"fiasco\". Speaking the day after the release of witness statements submitted by the government, Sir Ken McCallum, head of MI5, expressed frustration over the collapse of the case, it notes.Sir Ken's \"rare public intervention\" also leads the i Paper, which reports that the collapse of the trial against Christopher Cash and Christopher Berry has \"effectively 'killed' some active intelligence work to tackle China spying\". Both men deny any wrongdoing.  The front page features several quotes from the head of MI5, including his insistence that Chinese state operatives threaten the UK's national security \"every day\". The Mirror has taken a similar approach, pairing the headline \"China is threat every day\" with a photo of Sir Ken. In the annual speech at MI5's London headquarters he also warned of a \"more hostile world\", the paper says. The Financial Times has focused on Beijing's response to the case, after the Chinese embassy in London released a statement that warned the UK to \"stop undermining China-UK relations\". The embassy has condemned the statements released by the government on Wednesday evening as \"pure speculation and fabrication\".The Duke of York has been pulled into the scandal, says the Daily Mail, which pictures Prince Andrew shaking hands with Chinese politician Cai Qi in 2018 on its front page. Mr Cash and Mr Berry were accused of collecting insider information about UK politics and government policy, and passing it to a Chinese intelligence agent, who then forwarded it to Cai. Cai is often referred to as President Xi Jinping's right-hand man. \"MPs press top prosecutor over collapse of spy case\" says the Guardian, after the chairs of home affairs, foreign affairs, justice and national security committees wrote to the head of the Crown Prosecution Service (CPS), Stephen Parkinson, to call for a \"fuller explanation for the dropping of the charges\". The paper reports that the chairs asked Mr Parkinson to explain the steps he made to \"make ministers aware\" that the case was at risk of collapse, in addition to asking whether witness Matthew Collins was warned that his testimony could be insufficient. The Times reports that the diplomatic fallout surrounding the spy case \"highlights the growing tensions\" between national security concerns regarding China and \"the government's desire to build 'positive' economic relations\". The paper notes that ministers have now delayed a decision on whether to approve a Chinese super-embassy in London until December, which it alleges is due to concerns that it \"could become a base for further espionage\".\"Whose side are you on, Sir Keir?\" asks the Metro. It comes after former Security Minister Tom Tugendhat, for whom Mr Cash was a parliamentary researcher, accused the government of focusing on \"process\" over doing what it could to ensure the \"prosecution works\". He asked the government in a Commons debate:  \"Who the hell's side are you on?\"The decision to block Maccabi Tel Aviv fans from an upcoming match against Aston Villa has been branded a \"national disgrace\", the Daily Express says. The paper is quoting Conservative leader Kemi Badenoch, who was one of several politicians to criticise the move, made because of \"safety concerns\", the body responsible for issuing safety certificates for matches said. West Midlands police said the game had been classified as \"high risk\" and this was \"based on current intelligence and previous incidents, including violent clashes and hate crime offences that occurred during the 2024 Europa League match between Ajax and Maccabi Tel Aviv in Amsterdam\".Former cricket player Freddie Flintoff has given an interview on his \"guilt\" following champion boxer Ricky Hatton's death, with his comments leading the Star.Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'China spy fiasco' and 'Ban' on Israeli fans a 'national disgrace'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d6e8/live/1aa65a90-aaf3-11f0-b2a1-6f537f66f9aa.png"
      ],
      "datePublished": "2025-10-17T01:09:33.000Z",
      "dateModified": "2025-10-17T01:09:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rachel Reeves plans 'targeted action' on bills in Budget",
    "url": "https://www.bbc.com/news/articles/c8eykkgdze5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a818/live/0e3e46d0-aaaa-11f0-ba75-093eca1ac29b.jpg",
    "tag": "Trending",
    "date": "2025-10-16T23:01:43.000Z",
    "description": "9 hours agoFaisal IslamEconomics editorWatch: Government will be taking targeted action on cost of living, says ReevesChancellor Rachel Reeves has sai",
    "body": "9 hours agoFaisal IslamEconomics editorWatch: Government will be taking targeted action on cost of living, says ReevesChancellor Rachel Reeves has said she is planning \"targeted action to deal with cost of living challenges\" in next month's Budget.Speaking to the BBC, she said it was the job of both the government and the Bank of England to reduce inflation.The UK's inflation rate is forecast to be the highest among the G7 group of developed nations this year and next.The BBC understands that the government could intervene to bring down energy bills, for example, by cutting the current 5% rate of VAT charged on energy.Another option is to reduce some of the regulatory levies currently added to bills.The government will receive the next draft from the official forecaster, the Office for Budget Responsibility (OBR), on Monday, which will reveal how much space there is for such a measure.The expectation from most analysts is that Reeves will have to announce tax rises or spending cuts in order to meet her self-imposed borrowing rulesEarlier on Thursday, the Institute for Fiscal Studies calculated there was a £22bn gap for the chancellor to fill, which is at the lower end of expectations.\"There's a shared job between the Bank of England and the government to bear down further on some of the causes of inflation,\" Reeves told the BBC in Washington, at the annual meetings of the International Monetary Fund and World Bank.While much of the focus has been on likely tax rises, the chancellor said the latest information from the OBR had not changed her commitment to manifesto promises not to raise rates on income tax, VAT or National Insurance.She blamed an \"uncertain world\" with rising geopolitical and trade concerns for the Budget tax moves, likely to be focused on those \"with the broadest shoulders\".Referring to the concerns about the UK's economic relations with China, she said: \"Our national security always come first.\"Last week's announcement by China to tighten export controls on rare earths and other materials that are key for advanced tech manufacturing led US President Donald Trump to threaten an additional 100% tariff on imports from China, raising the prospect of an all-out trade war between the two economic giants.US Treasury Secretary Scott Bessent called China's move \"economic coercion\" and \"a global supply chain power grab\".Asked about accepting the US offer to join it in its battle with China, Reeves said she was \"very concerned\" by China's actions and urged the Chinese government \"not to put up barriers and restrict access\".She said the move was \"bad for the global economy and creates further headwinds\".\"I believe there are areas where we must challenge China, but there are also important opportunities to sell into Chinese markets, including financial services and other areas of the economy. We've got to get that balance right.\"The chancellor also confirmed she was working with G7 counterparts \"on our own critical minerals strategy, so that we are less reliant\".Reeves also acknowledged that the price the NHS pays for medicines could go up as a result of ongoing negotiations with the Trump administration and its drugs companies, in return for lower tariffs and investment.Some of the world's largest drug companies have said recently that they are either pausing or scrapping projects in the UK, with some blaming the low prices they are receiving.Last month, Science Minister Patrick Vallance said the price the NHS pays for medicines would need to rise to stop companies and pharmaceutical investment leaving the UK.Reeves told the BBC: \"We have seen because of the pricing regime, that clinical trials, new drugs have not been offered in the UK in the way that they are in other European countries.\"We want to make sure that people getting treatment from the NHS are able to access the best life-saving drugs in the world. And so we are looking at all of that, and… looking to secure more investment into Britain.\"Later, the chancellor announced a new support scheme to help attract financial firms to invest in the UK.The government said its \"concierge\" facility – called the Office for Investment: Financial Services – would guide companies through regulations and help them choose the best locations to set up, making it easier for them to do business in Britain.About 1.2 million people across the UK are employed in the financial services sector, with more than half of those jobs located outside of London, according to the Treasury.Reeves said: \"This service will drive investment across our United Kingdom, making sure that the world's most innovative businesses can access the talent found in every corner of our country and that working people feel better off.\"Additional reporting by Pritti Mistry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rachel Reeves plans 'targeted action' on bills in Budget",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a818/live/0e3e46d0-aaaa-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-16T23:01:43.000Z",
      "dateModified": "2025-10-16T23:01:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "John Bolton: Former Trump national security adviser indicted",
    "url": "https://www.bbc.com/news/articles/cgql2qzkz5zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c0ec/live/769b8cd0-a9d1-11f0-aa31-b1f6905de5c6.jpg",
    "tag": "Trending",
    "date": "2025-10-16T23:48:28.000Z",
    "description": "8 hours agoAna FaguyWashington andAoife WalshGetty ImagesBolton, who Trump fired from his first administration in 2019, has been a vocal critic of the",
    "body": "8 hours agoAna FaguyWashington andAoife WalshGetty ImagesBolton, who Trump fired from his first administration in 2019, has been a vocal critic of the presidentJohn Bolton, who served as Donald Trump's national security adviser before becoming a vocal critic of the president, has been criminally indicted on federal charges.The Department of Justice presented a case to a grand jury in Maryland on Thursday, and they agreed there was enough evidence to indict Bolton, who issued a statement maintaining his innocence.It comes after FBI agents searched Bolton's home and office in August as part of an investigation into the handling of classified information. The indictment makes Bolton, 76, the third of the US president's political opponents to face charges in recent weeks. He could face decades in prison.According to a 26-page indictment filed at a court in Greenbelt, Maryland, on Thursday, Bolton is charged with eight counts of transmission of national defence information (NDI) and 10 counts of unlawful retention of NDI.Prosecutors accuse him of illegally transmitting top secret information about US national defence using his personal email and other messaging apps. \"These documents revealed intelligence about future attacks, foreign adversaries, and foreign-policy relations,\" the court papers state.Watch: \"That's the way it goes\", says Trump on John Bolton's indictmentIf found guilty, Bolton could face up to 10 years in prison for each charge. He is expected to surrender to authorities on Friday.\"No one is above the law,\" US Attorney General Pam Bondi said in a statement announcing the charges. Bolton said in a statement that he looked forward to defending his \"lawful conduct\" in court as he accused Trump of seeking \"retribution against me\".\"Now, I have become the latest target in weaponizing the Justice Department to charge those he [Trump] deems to be his enemies with charges that were declined before or distort the facts,\" Bolton said.Bolton's lawyer, Abbe Lowell, said the charges stemmed from diary entries kept by his client over his 45-year career in public service. \"Like many public officials throughout history, Amb Bolton kept diaries – that is not a crime,\" said Mr Lowell. He described the records as \"unclassified, shared only with his immediate family, and known to the FBI as far back as 2021\".According to CNN, Bolton is alleged to have shared the information with his wife and daughter. The unauthorised information includes \"diary-like entries from Bolton's time as the National Security Advisor\" and were allegedly \"printed and stored\" at Bolton's home in Bethesda, Maryland.Bolton was fired from Trump's first administration in 2019. His 2020 memoir, The Room Where It Happened, recounted his time working under Trump and portrayed him as a president who was ill-informed about geopolitics.The White House filed a lawsuit to block the book from being published, arguing it contained classified information and had not been properly vetted. A judge denied the request and the book was released days later.The US Department of Justice then opened an investigation into whether Bolton had mishandled classified information by disclosing certain information in the book. Asked about the indictment on Thursday at the White House, Trump said he did not know about it, but added that Bolton was \"a bad guy\". Watch: How the FBI raids on John Bolton's home and office unfoldedBolton, who served as George W Bush's UN ambassador, was among former officials critical of Trump who had their Secret Service protection stripped in January.He is the third Trump critic to be criminally charged since September. New York City Attorney General Letitia James was indicted on bank fraud charges in October. Former FBI director James Comey was charged in late September with lying to Congress.The cases were filed after Trump urged the US attorney general to prosecute his political opponents.\"We can't delay any longer, it's killing our reputation and credibility,\" he wrote on social media.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "John Bolton: Former Trump national security adviser indicted",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c0ec/live/769b8cd0-a9d1-11f0-aa31-b1f6905de5c6.jpg"
      ],
      "datePublished": "2025-10-16T23:48:28.000Z",
      "dateModified": "2025-10-16T23:48:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celebrity Traitors episode 4: Strange shrieks by Clare Balding, Celia Imrie and Stephen Fry",
    "url": "https://www.bbc.com/news/articles/cjr04nwnq57o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b5d0/live/40bf6c10-ab22-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-16T22:25:52.000Z",
    "description": "Strange shrieks as tensions rise in Celebrity Traitors10 hours agoNoor NanjiCulture reporterThe Celebrity Traitors: Could you guess this clue?Spoiler ",
    "body": "Strange shrieks as tensions rise in Celebrity Traitors10 hours agoNoor NanjiCulture reporterThe Celebrity Traitors: Could you guess this clue?Spoiler warning: This article reveals details from the fourth episode of The Celebrity TraitorsThe latest episode of The Celebrity Traitors has taken place, and all we're talking about is which celebrity can shriek the best.During a challenge, the contestants - including Alan Carr, Celia Imrie and Lucy Beaumont - were tasked with asking a group of banshees to sing, before relaying the songs down a well.It was weird, and off-the-wall. But for many social media users, it was the subtitles that stole the show.\"Celia shrieks strangely,\" read one, while another said: \"They repeat the wail.\"\"The people responsible for the subtitles deserve a raise,\" wrote one X user.Singer Charlotte Church was, unsurprisingly, the most impressive. Meanwhile, Imrie's efforts - and facial expressions - won her more love online, with one calling her \"the funniest person to have ever existed\".The subtitles during the challenge left many fans in hystericsThere was also a rare moment where presenter Claudia Winkleman's mask appeared to slip, as national treasure Sir Stephen Fry plunged his head into the well.\"Oh no, Stephen Fry is in the water, I can't look\" she said, covering her eyes.\"I'm a grown man, what the hell am I doing,\" said Sir Stephen after he emerged, in a quote that could sum up the entire series.Elsewhere, the celebrities' continued inability to pick out a Traitor was the other big talking point of the night.\"They're hopeless, absolutely hopeless,\" said TV critic Toby Earle.TV sports presenter Clare Balding became the latest celebrity to be banished from the castle.The 54-year-old received seven votes from her fellow contestants during Thursday's episode, before revealing she was in fact a faithful.\"What are the odds of us being so useless,\" said Sir Stephen, while Winkleman urged the celebrities to do better. \"Stop being so polite,\" she told them.Other faithfuls - YouTube star Niko Omilana, and actress Tameka Empson - were both already voted out at previous roundtables.The younger celebs are being murdered and banished at a rapid paceEarlier in the episode, another of the younger celebrities - actress Ruth Codd, 29 - was murdered by the traitors.Codd had won fans with her cutting one-liners, and there was sadness on social media to see her go. \"Icon down,\" wrote one X user.Her murder comes after she raised her suspicions about TV presenter Jonathan Ross being a traitor during Wednesday's episode.Fellow traitor Cat Burns warned that \"it could backfire on you\" to remove his prime suspect, but Ross replied: \"Look, if I was a traitor, I wouldn't have done that.\"The words \"double bluff\" and \"double double bluff\" were bandied around throughout the episode - but in the end, Ross survived to tell the tale.\"How am I still here. I've got to be the luckiest traitor in the history of the game,\" Ross wondered.Murder, betrayal and lies - why we're attracted to The Traitors' dark sideOther highlights from the show included Ross's leopard cardigan, which Balding likened to a \"Flintstones outfit\".Meanwhile, comedian Alan Carr continues his transformation “from giggly liability to cold-hearted killer,” said TV critic Earle.\"Let's get rid of her now before she poisons everyone,\" Carr declared about poor Codd.Lucy Beaumont wondered whether her height may be a disadvantage. Sir Stephen is \"too tall\" for her to see his eyes and suss out his motives, she says - although she can tell you if his flies are undone.And finally, Fartgate hasn't gone away. At one point, the celebrities were playing badminton, and Carr shouted out to Imrie: \"Celia, we need a bit of wind to get it over the net.\"She replied: \"Oh, shut up.\"The Celebrity Traitors is on BBC One on Wednesdays and Thursdays at 21:00 BST and on BBC iPlayer. There will be nine episodes.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celebrity Traitors episode 4: Strange shrieks by Clare Balding, Celia Imrie and Stephen Fry",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b5d0/live/40bf6c10-ab22-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-16T22:25:52.000Z",
      "dateModified": "2025-10-16T22:25:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Riba Stirling Prize 2025: Appleby Blue Almshouse named Britain's best new building",
    "url": "https://www.bbc.com/news/articles/c4gwlz6k96no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5be8/live/748d3c60-ab28-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-16T22:13:48.000Z",
    "description": "Housing designed to combat loneliness wins top architecture award10 hours agoIan YoungsCulture reporterPhilip Vile/RibaA modern answer to the traditio",
    "body": "Housing designed to combat loneliness wins top architecture award10 hours agoIan YoungsCulture reporterPhilip Vile/RibaA modern answer to the traditional almshouse, designed to combat loneliness, has won a prestigious architecture award for Britain's best new building.Appleby Blue Almshouse, which provides affordable flats for over-65s in Southwark, south London, has won this year's Royal Institute of British Architects' (Riba) Stirling Prize.The complex, in Bermondsey, has 59 flats plus communal facilities, including a roof garden, courtyard and community kitchen.The Stirling Prize judges said it \"sets an ambitious standard for social housing among older people\".Philip Vile/RibaArchitects Witherford Watson Mann have crafted \"high-quality\" and \"thoughtful\" spaces to create environments that truly care for their residents\", according to jury member Ingrid Schroder, director of the Architectural Association (AA) School of Architecture.Philip Vile/RibaThe building was praised for its \"generous\" homes, terracotta-paved hallways with benches and plants, and a water feature that gives the building the \"sense of a woodland oasis\".That all creates an \"aspirational living environment\" that stands \"in stark contrast to the institutional atmosphere often associated with older people's housing\", Riba said.Philip Vile/RibaThe Appleby Blue Almshouse was built on the site of an old care home by United St Saviour's Charity, which subsidises the flats for people on low incomes.Almshouses were traditionally built from the Middle Ages to provide charitable accommodation for people in need.Philip Vile/RibaAppleby Blue beat a range of other nominated buildings and architecture projects to this year's Stirling Prize, ranging from the restoration of the Big Ben tower in London to a new fashion college campus, a science laboratory and an \"inventive\" home extension.The other contenders were:House of CommonsRory GaylorThe Elizabeth TowerHastings HouseThe prize is given to the building judged to be \"the most significant of the year for the evolution of architecture and the built environment\", and is judged on criteria including design vision, innovation and originality.This is Witherford Watson Mann's second time as winning architects, 12 years after they were selected for their design for a groundbreaking modern holiday home inside the ancient Astley Castle in Warwickshire.The Elizabeth line - London's east-west train line - won the prestigious award last year.Other previous winners of the prize - first presented in 1996 - include Liverpool's Everyman Theatre, Hastings Pier and the Scottish Parliament building in Edinburgh.Sign up here to receive our weekly newsletter highlighting uplifting stories and remarkable people from around the world.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Riba Stirling Prize 2025: Appleby Blue Almshouse named Britain's best new building",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5be8/live/748d3c60-ab28-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-16T22:13:48.000Z",
      "dateModified": "2025-10-16T22:13:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mamdani, Cuomo and Sliwa spar over housing, city noise and Trump",
    "url": "https://www.bbc.com/news/articles/cn8xlx53jn6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1aad/live/03a87b70-aaf8-11f0-af50-73683b2b8713.jpg",
    "tag": "Trending",
    "date": "2025-10-17T02:43:13.000Z",
    "description": "Five takeaways from NYC mayoral debate as Mamdani and Cuomo clash 6 hours agoKayla EpsteinRockefeller Center,Grace Eliza GoodwinRockefeller Center and",
    "body": "Five takeaways from NYC mayoral debate as Mamdani and Cuomo clash 6 hours agoKayla EpsteinRockefeller Center,Grace Eliza GoodwinRockefeller Center andSakshi VenkatramanWatch: Sliwa, Mamdani and Cuomo debate grocery bills, Trump and Gaza The three leading candidates for New York City mayor took the stage at Rockefeller Center in Manhattan on Thursday to make a case to lead America's biggest city.Early voting in the race is set to begin next week, and the most recent polling suggests Zohran Mamdani has widened his lead to 46%, while Andrew Cuomo stands at 33%. The outcome of the race could have political implications beyond the Empire State as President Donald Trump looms large, and whoever wins will likely face pressure from Washington in some form.The Democratic Party nationally is likely watching to see if the America's biggest Democratic stronghold chooses an establishment, centrist figure in Cuomo - who is running as an independent - or the progressive Mamdani. The winner could help determine the kind of candidate and platform Democrats choose in the future following their staggering 2024 loss to Trump. Republicans also will watch to see if their candidate, Curtis Sliwa, continues to make inroads with his public safety platform.Here are five big takeaways from tonight's debate.Mamdani pressed on views on PalestiniansMamdani's past statements on Israel and Palestinians came up several times during the night in both questions from moderators and opponents' criticisms.The candidate has stressed his support for Palestinians and statehood, and has criticised Israel's military operation in Gaza.He also was criticised for declining to condemn the phrase \"globalise the intifada\" when probed by interviewers. Many Jews argue this slogan is an antisemitic call for violence, but pro-Palestinian activists say it is a call for international solidarity with Palestinians.Mamdani said he would seek to serve as a mayor for all New Yorkers, including its large and ideologically diverse Jewish population.Cuomo attacked Mamdani for his views, calling the New York state assemblyman a \"divisive personality across the board\".Angelina Katsanis/Pool via REUTERSThe fourth man: Donald TrumpThere were three candidates at tonight's debate but a fourth name kept coming up: Donald Trump.The president has implied he wants to send the National Guard into cities controlled by Democrats and has moved to withhold government funds for infrastructure projects in New York City. Trump has also prioritised the city for his mass deportation policy, and the mayor — who has little power over federal immigration enforcement — will likely have to weigh the city's response. Sliwa, the Republican, noted that the mayor would need to get along with Trump regardless of political views. But Mamdani made his opposition to the president explicit from his very first response, promising to \"take on Trump.\"Cuomo, meanwhile, positioned himself as the only candidate experienced enough to deal with the current White House, warning \"it will be Mayor Trump\" if Mamdani is elected.\"I fought Donald Trump,\" he told voters. \"When I'm fighting for New York, I am not going to stop.\"Affordability front and centreAs large as Trump looms, the biggest policy issue around this mayoral election is affordability. New Yorkers face high costs of living on everything - especially rent and groceries.In his opening statement, Sliwa acknowledged the \"really serious issues of affordability\" facing the city. He called for the next mayor to free up vacant apartments in NYCHA - New York's public housing programme — and allow people to move in.The moderators directly asked each candidate how much they paid for rent, groceries and whether they paid off credit card debt monthly. The candidates pitched a volley of proposals to tackle the cost of living, including Mamdani's plan to make buses free and Cuomo's proposal to place income limits on people who resided in rent-stabilised apartments.Cuomo criticised Mamdani for living in a rent-stabilised apartment -a form of affordable housing - even though his parents are wealthy (his mother is the filmmaker Mira Nair).Cuomo also opposed Mamdani's proposed rent freeze on stabilised apartments, saying it would only postpone future increases, force building owners into bankruptcy, and fail New Yorkers who don't live in rent-stabilised apartments.\"If you think that the problem in this city is that my rent is too low, vote for him,\" Mamdani said in response. \"If you know the problem in this city is that your rent is too high, vote for me.\"Former Governor Andrew Cuomo announces run for New York City mayorFULL COVERAGE: Mamdani, Cuomo, Sliwa debateWho is Zohran Mamdani?How Mamdani stunned New York - and what Democrats can learn from his winCuomo's controversies still loomCuomo touted his decades of experience in office, rising from federal housing secretary during President Bill Clinton's administration to New York governor.However, controversies surrounding his governorship have shadowed his campaign. He resigned as governor in 2021 after an investigation by the state attorney general found he had sexually harassed 11 women. Cuomo apologised for acting \"in a way that made people feel uncomfortable\" but denied allegations.The New York attorney general also investigated his administration for undercounting nursing home deaths during the Covid-19 pandemic, finding he understated the actual number of deaths.Mamdani attacked Cuomo on these matters, accusing him of \"sending seniors to their death in nursing homes,\" and accused him of lacking integrity.Cuomo said the allegations about harming seniors in nursing homes were \"totally false.\"\"During Covid, everyone did whatever they could in this state, and there have been numerous investigations where they've gone through it, and they said we followed federal guidance,\" Cuomo said. \"But yes, people died during Covid. And my heart breaks for everyone that broken, that died in this state and across this nation.\"Sliwa, too, attacked Cuomo for the \"lawsuits filed against you for sexual harassment.\" The former governor rebutted that the case brought by New York State Attorney General Letitia James, who investigated the misconduct claims, \"was political.\"Curtis Sliwa makes his markSliwa held his own as the only Republican on stage. His voting bloc might be in the minority in New York City, but the 2024 presidential election revealed that residents prioritise public safety issues and Sliwa hammered that repeatedly. As the founder of the Guardian Angels, a New York City organization devoted to crime prevention, he seized the opportunity to connect with voters.The longtime New York media and political personality knew how to make himself heard. He frequently interjected, telling moderators he wanted to speak, and elbowing his way into the debate's most heated moments. From centre stage, he took swings at both opponents in equal measure.He felt confident after the debate, saying his night went \"extraordinarily well\" and likening his opponents to \"two kids in the schoolyard.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mamdani, Cuomo and Sliwa spar over housing, city noise and Trump",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1aad/live/03a87b70-aaf8-11f0-af50-73683b2b8713.jpg"
      ],
      "datePublished": "2025-10-17T02:43:13.000Z",
      "dateModified": "2025-10-17T02:43:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zelensky to make case for missiles at White House, after Trump and Putin agree meeting",
    "url": "https://www.bbc.com/news/articles/crmxz37nv3zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ea26/live/4896a750-ab0e-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-17T07:40:01.000Z",
    "description": "36 minutes agoSean SeddonReutersZelensky is on his third visit to Washington since JanuaryUkrainian President Volodymyr Zelensky will meet with US Pre",
    "body": "36 minutes agoSean SeddonReutersZelensky is on his third visit to Washington since JanuaryUkrainian President Volodymyr Zelensky will meet with US President Donald Trump in Washington on Friday, as Trump weighs whether to arm Ukraine with Tomahawk missiles capable of striking deep into Russia.Their meeting comes a day after Trump said \"great progress\" was made during a phone call with Russian President Vladimir Putin, with the pair agreeing to face-to-face talks in Hungary.Trump said the call, the first with Putin since mid-August, was \"very productive\", adding that teams from Washington and Moscow will meet next week.As Zelensky arrived in the US, his third visit since January, he said Moscow was \"rushing to resume dialogue as soon as it hears about Tomahawks\".Zelensky has called on the US to provide Ukraine with the advanced missiles, which have a range of 2,500 km (1,500 miles).Asked earlier this week if Trump was considering giving Ukraine Tomahawks, he said: \"We'll see... I may.\" But asked about the same prospect after his call with Putin, Trump said \"we can't deplete\" the US stockpile of Tomahawks, adding \"we need them too... so I don't know what we can do about that\".Putin-Trump call a curveball for Zelensky ahead of his visitWriting on his Truth Social platform after his call with Putin concluded, Trump said he and the Russian president \"spent a great deal of time talking about Trade between Russia and the United States when the War with Ukraine is over\". He said \"high level advisors\" from both countries would meet at an unspecified location next week, with Secretary of State Marco Rubio leading the American delegation. Trump also said he would update Zelensky on his talks with Putin on Friday, adding: \"I believe great progress was made with today's telephone conversation.\"He later told reporters he expected to meet Putin in Hungary \"within two weeks\".Putin and Trump could speak a week after Rubio's meeting with advisors, Hungary's prime minister said.Viktor Orban told state radio he would speak to the Russian president later on Friday.\"Since the EU is pro-war, it is logical that it will be left out of this peace process,\" he said. The planned meeting in Budapest was \"great news for the peace-loving people of the world\", Orban wrote on X on Thursday, and he added that he had spoken to Trump by phone.Earlier, he also said: \"Peace requires patience, strength, and humility. Europe must shift its stance. Instead of arrogance and fanning the flames of endless war, we need negotiations with Russia. Only dialogue can bring peace to our continent.\"Hours before the Trump-Putin call, Russia launched one of its largest attacks of the year on Ukraine, including 28 ballistic missiles, and 320 drones, according to Ukraine's ambassador to the US, Olga Stefanishyna.Stefanishyna said Russia launching overnight strikes on Ukraine before the call \"exposes Moscow's real attitude toward peace\".In a statement to the BBC's US partner CBS, she added: \"These assaults show that Moscow's strategy is one of terror and exhaustion. The only effective response is pressure - through tougher sanctions, reinforced air defense, and the supply of long-range capabilities.\"Trump has taken a much tougher line towards Putin over the Ukraine war since a face-to-face summit in Alaska in August failed to produce a decisive breakthrough in attempts to broker a peace deal.The pair met on US soil on 15 August for a summit which the US president hoped would help convince the Russian president to enter comprehensive peace talks to end the Ukraine war. Russia launched its full-scale invasion of Ukraine in February 2022.They spoke again days later when Trump interrupted a meeting with Zelensky and European leaders to call Putin.Since then, neither the White House or Kremlin have publicly confirmed any communications between the two.During his presidential election campaign, Trump claimed he would be able to end the war in Ukraine within days but has since admitted resolving the conflict has been more challenging than any he has been involved in since returning to power. Trump had been seen as more sympathetic to Russia than his predecessor Joe Biden, and strained relations with Zelensky came to a head on 28 February when he and Vice-President JD Vance berated the Ukrainian president in the Oval Office on live television. But public relations with Zelensky have vastly improved in recent months. In September, Trump signalled a major shift in his view of the conflict, saying he  believed Kyiv could \"win all of Ukraine back in its original form\", a far cry from his public calls for Kyiv to cede territory occupied by Russia. ReutersPutin and Trump last met in person at a US base in Alaska in August 2025In late July, Trump set Putin a deadline of less than a fortnight to agree to a ceasefire or face sweeping sanctions, including measures against countries which still trade with Russia.But he did not follow through the threat after Putin agreed to meet Trump in Alaska, which the US president hailed as a significant diplomatic success at the time, despite it not producing any tangible outcome.Earlier on Thursday, India's foreign ministry cast doubt on a claim made by Trump a day earlier saying Indian Prime Minister Narendra Modi had agreed to stop purchasing Russian oil.An Indian government spokesman said he was \"not aware of any conversation between the two leaders\" taking place the previous day, after Trump said Modi had assured him purchases would stop \"within a short period of time\".The US has pushed for countries - in particular India, China and Nato members - to stop buying Russian energy in an effort to increase economic pressure on the Kremlin. Zelensky has also repeatedly echoed those calls.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zelensky to make case for missiles at White House, after Trump and Putin agree meeting",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ea26/live/4896a750-ab0e-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-17T07:40:01.000Z",
      "dateModified": "2025-10-17T07:40:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]