[
  {
    "title": "Murder and MI5: the extraordinary battle over what stays secret",
    "url": "https://www.bbc.com/news/articles/c1w94v205y2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/10d7/live/8f15af90-dbfc-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2026-01-26T00:25:19.000Z",
    "description": "Murder and MI5: How an extraordinary battle erupted over what the state keeps secret8 hours agoDaniel De SimoneInvestigations correspondent BBCPaul Th",
    "body": "Murder and MI5: How an extraordinary battle erupted over what the state keeps secret8 hours agoDaniel De SimoneInvestigations correspondent BBCPaul Thompson was shot dead while being driven home in a taxi through Belfast in April 1994. He was murdered in a sectarian attack by loyalist paramilitaries who had set out to kill Catholics.The taxi driver was a friend who was collecting a fare at another address in the Springfield Park area in the west of the city. But no one at the address had rung the taxi firm. The call is suspected to have been a deliberate decoy by the killers who wanted to lure a taxi as prey. Paul was not specifically targeted. They could not have known he would ask for a lift or be in the area.One resident described hearing a heavy burst of gunfire after 23:00, running to the car and finding Paul.Members of a banned loyalist terror group, the Ulster Defence Association, using the cover name Ulster Freedom Fighters, claimed responsibility for the killing. During the Troubles in Northern Ireland, the group repeatedly murdered Catholic civilians like Paul.Family Handout/PA WireMembers of a banned loyalist terror group, the Ulster Defence Association, using the cover name Ulster Freedom Fighters, claimed responsibility for killing Paul, who was nicknamed TopperOn the morning of the day that Paul was killed, locals had told police about a hole in a barrier – known as the 'Peace Line' – which separated the largely Catholic Springfield Park area from a largely Protestant neighbouring area. The residents were concerned the breach could give loyalist paramilitaries access to launch an attack.The hole was not fixed. After the murder, those responsible escaped through it.An inquest into Paul's death was opened in 1995 but never concluded. No-one has ever been held to account. There has never been a full investigation.Left by themselves to fight for answers, his mother Margaret and brother Eugene, both now dead, came to suspect collusion between British security forces and informants – meaning state agents - in the group responsible.In 2024, a coroner decided to release to the family a summary of secret information held by the police. This was said by the coroner to be of central relevance to the case and the police supported the move. But the British government and MI5 argued this would prejudice national security and mounted a legal challenge.PA MediaPaul Thompson was killed by the UDA, which used the cover name of the Ulster Freedom FightersThe case, which centred on who had the power to decide to release the information, reached the Supreme Court last summer, with Paul Thompson's brother, Eugene, tuning in to hearings from a hospice, as he neared death from cancer.The case is widely viewed as a major test of the state's policy of neither confirming nor denying (NCND) information involving national security.Who decides what is secret?The NCND policy is a position adopted by the government and security services when responding to questions about sensitive matters. It means there will be no confirmation, no denial, and no acknowledgement that the information requested is true, false, or even exists.Eugene Thompson's barrister, Monye Anyadike-Danes KC, said the family had concluded the murder happened because the authorities were colluding with the \"very group that actually perpetrated the killing\". She said Eugene was \"trying to find out why his younger brother was murdered\" and felt a \"deep responsibility\".PA MediaEugene Thompson, who has since died, spent years trying to find out the truth about his brother's deathEugene, she added, believed the public should be able to trust that those who kill will be held accountable, especially when they are agents of the state. She asked the judges not to let the NCND policy be used to \"conceal the involvement of state parties in the killing of an ordinary citizen\".Just before Christmas, the court ruled that the government's assessment of damage to national security \"should have been accepted by the coroner\" unless it was plainly irrational or there was no supporting evidence.The justices found the coroner had failed to understand it was \"solely\" for the government to make submissions on national security, not the chief constable of the Police Service of Northern Ireland (PSNI), Jon Boutcher, who had argued for the release of the summary of police files.PA WireJon Boutcher argued for the release of the summary of police filesPaul Thompson's case is part of a battle over the truth and whether it can be told. The battle concerns official secrets, often connected to state agents, and it pits bereaved families and senior police officers against the government and the security service, MI5.It raises a profound question: can the state, especially when it is implicated in killing, be trusted as the arbiter of what should remain secret?The spycatcher who was himself a spyOther cases in the coming months will force these issues further into the spotlight – and they come at a time when MI5's integrity is under significant scrutiny.Yet the Supreme Court's ruling in the Thompson case creates a precedent that says the government and MI5 can withhold information from bereaved families, for national security reasons, even when the police want it to be disclosed.Grainne Teggart, from Amnesty International, described it as a \"grim day for truth\" and part of a pattern of \"national security being used as a shield to cover up and conceal the state's role in very serious crimes such as murder and other serious human rights violations.\"The government, by contrast, welcomed the court's \"unanimous judgment\".\"This is a highly complex case with wide-ranging implications,\" it said. \"The government will therefore take time to fully consider all aspects of this judgment.\"The Supreme Court's ruling in the Thompson case has created a precedentDuring the Troubles, the state made widespread use of informants, otherwise known as agents, who were tasked with carrying out actions and often paid. Agents existed in the IRA and in loyalist paramilitary groups. They were run by the police, the army, and MI5.The former Met Police chief Lord Stevens, who led UK government-commissioned investigations into collusion in Northern Ireland between the 1980s and 2000s, once said that of 210 people arrested during his enquiries, only three were not state agents.Collusion occurred in a number of ways, he said, ranging from the state withholding intelligence and evidence from investigators, to state agents being involved in murder. In some cases agents told the authorities in advance about planned attacks but nothing was done to stop them.One of the most notorious agents was codenamed Stakeknife. It has been publicly known for more than 20 years that Stakeknife was a man called Freddie Scappaticci. He died under MI5 protection in 2023 having never been charged with any of the many murders and other crimes to which he is linked.Pacemaker Press/ PAFreddie Scappaticci, or Stakeknife, died under MI5 protection in 2023Scappaticci was a senior figure in the IRA's internal security unit, which was tasked by IRA leaders with identifying and killing British agents in the organisation. But, with the spycatcher himself a spy, the result was one British agent killing other agents, or people accused of being agents, and the state repeatedly not intervening to save them.Intelligence agencies and historic wrongdoingA long-running police investigation into Stakeknife, Operation Kenova, was forbidden from officially naming Scappaticci in its final report, published in December, despite the fact that his identity was widely known.The head of the Kenova team, Sir Iain Livingstone, pleaded with Northern Ireland Secretary Hilary Benn for the right to name Scappaticci in his report, but Benn said he would decide after the Supreme Court ruling in the Paul Thompson case, which came later in December.That ruling has, in effect, strengthened Benn's power to stop him being named. If permission is granted, a revised version of the Kenova report can be published.Jon Boutcher, who was Livingstone's predecessor leading the Kenova investigation, has described the situation preventing Scappaticci being named as a \"pantomime\". It leads to the truth being \"suppressed,\" he argues, with \"profound and severe adverse impacts on victims and families, legitimate public discussion and debate, media freedom, open justice and public confidence in state agencies and the criminal justice system\".PA WireThe integrity of MI5, which is currently led by Sir Ken McCallum, is under scrutinyBoutcher, the PSNI chief constable, is involved in a significant and extraordinary stand-off with the government and MI5 over NCND.He has called for reform of the policy, a principle he fully supports but believes is being wrongly applied and has become a dogma that can be used to conceal wrongdoing.He has recommended the policy is reviewed to ensure it is applied proportionately and only where genuinely necessary for the protection of life or national security. The government has not yet responded to the call for a review of the policy.Boutcher has directly asked whether NCND's continued application on Stakeknife amounts to it being used as a tool for covering up things that should never have happened.\"I question whether this decision protects agents, or rather does it actually protect the government and intelligence agencies from accountability for historical wrongdoing.\"More from InDepthIn the Paul Thompson case he argued that he, as chief constable, rather than the government, had the right to allow the coroner to release a summary of police files. The high court and court of appeal backed his position before it was ultimately rejected by the Supreme Court.During the hearings, government barrister Sir James Eadie KC said Boutcher was being \"thoroughly disingenuous\" and that \"politics is being played with national security\". He argued the government is best placed to make assessments on national security, as only it has access to the full range of necessary advice. The principal advice, in this context, is from MI5.The argument the government is best informed seemed somewhat at odds with the fact the MI5 officer whose sworn statement was provided to support the case had not read the relevant underlying material.For the chief constable of Northern Ireland to be at loggerheads with MI5 is \"unprecedented\" says veteran investigative journalist, John Ware, who has reported on the Troubles since the 1970s.\"If anybody had told me even 10 years ago that there would come a time when the chief constable of the PSNI and the Security Service were at loggerheads, I would have fallen off my stool,\" he says.Trust, state secrecy and the publicBoutcher has a raised a stark question: can the authorities who played a role in the events, including MI5, be trusted to decide whether to tell the public about what happened, when doing so could leave them exposed?He has also indirectly raised this question about the legal system itself - due to its own role in the Stakeknife case.Scappaticci helped create a legal precedent on state secrecy that is routinely cited by the government to this day.In 2003, he sought a judicial review over the then government's refusal to publicly deny media reports that he was Stakeknife.But Scappaticci was bluffing and did not actually want to succeed, since if the government was ordered to tell the truth, he would have been confirmed as Stakeknife. Scappaticci was engaged in a pretence to help shore up his reputation: publicly fighting a legal case, while hoping – and expecting – he would lose.VCG via Getty ImagesMany families of those killed or injured in the Troubles are still fighting through the courtsHowever, the government feared Scappaticci would win because a judge would assume he was not Stakeknife and force ministers to be honest.Jon Boutcher has now confirmed an extraordinary fact: the judge who heard the case did so after being secretly briefed on the real identity of Stakeknife.That judge, the then Lord Chief Justice of Northern Ireland, Lord Carswell, ultimately allowed the government to maintain NCND, creating the legal precedent on the policy.\"The full facts about this and the government's explanation will never be known while it is able to hide behind the shield of NCND,\" Boutcher has said.There is a second extraordinary fact: the government barrister who did the secret briefing was Philip Sales, who as Lord Sales was one of the Supreme Court justices in the Paul Thompson case. This fact was uncovered by the journalist John Ware.This is an issue because it is Lord Sales' ruling in the Thompson case which has a central bearing over whether Scappaticci can be named and more details revealed about what went on, including Lord Sales' own role.I asked the Supreme Court whether, given Lord Sales' role in the Scappaticci matter, if it was appropriate for him to have heard the Thompson case.In a statement, the court said: \"Great care is taken in the selection of the panels which will hear a case at the UK Supreme Court.\"A Justice will not deal with a case where it is considered there is a conflict of interest and individual Justices are careful to ensure that they have none.\"The cases of Seamus Dillon and Sean BrownTwo further cases that touch on the potential release of information about the role of the state during the Troubles are also before the Supreme Court.Troubles-related inquests were shut down in 2024 with the passing of the Legacy Act, which created a new body called the Independent Commission for Reconciliation and Information Recovery (ICRIR) to examine relevant cases, including those being investigated by police.The families of four men who were either killed or injured during the Troubles won a further legal victory, when the Northern Ireland Court of Appeal ruled the government has too much veto power over the disclosure of material by the ICRIR.Lady Chief Justice Siobhan Keegan said that the provision in the Act giving the Northern Ireland secretary \"the final say\" on disclosure of sensitive national security information by the ICRIR would risk undermining public confidence in the body.The UK government's appeal will be ruled on by the Supreme Court in the coming months. The lead respondent in the case is Martina Dillon, whose husband Seamus was killed in 1997.PA WireMartina Dillon's husband Seamus was killed in 1997 by the paramilitary Loyalist Volunteer Force (LVF)The paramilitary Loyalist Volunteer Force (LVF) claimed responsibility. A coroner had opened an inquest on the basis there was evidence of collusion by state authorities, but the inquest was halted by the Legacy Act. No-one has ever been held accountable.The government has also registered an appeal in another key case.Sean Brown was also murdered in 1997 by members of the LVF. The 61-year-old father-of-six was abducted as he locked the gates at a sports club in County Londonderry. There were investigative failures by police and no-one has been brought to justice.PA MediaSean Brown, a father of six, was abducted as he locked the gates at a sports clubDecades later, a coroner issued a summary of secret material stating that \"a number of the individuals linked through intelligence to the murder were agents of the state.\" Sean's family want a public inquiry, and have won judgments over the past two years at the High Court and Court of Appeal. The government, which was found to have acted unlawfully by refusing a public inquiry, has registered an appeal to the Supreme Court on the basis the issue has constitutional significance regarding who should order inquiries.'The state viewed itself as above the law'At its heart, this vast battle over secrecy centres on two core claims by the state: that only the government and MI5 can ultimately be fully trusted on national security, and that their decisions on what information to release are solely about protecting the public.But these claims have been undermined by MI5's actions and omissions in several recent cases, all during the leadership of MI5's current director general, Sir Ken McCallum.A public inquiry into the 2017 Manchester Arena bombing, which killed 22 people, concluded that MI5 had not given an \"accurate picture\" of the key intelligence it held about the suicide bomber who carried out the attack. The inquiry chairman only uncovered what MI5 had done through his own persistent investigations during secret evidence sessions.The government has been resisting calls by families bereaved by the Manchester Arena attack for MI5 officers to be fully included in planned new legislation - known as the Hillsborough Law - that's designed to stop cover-ups and enforce truth-telling by public officials.Getty ImagesA public inquiry into the Manchester Arena bombing concluded that MI5 had not given an \"accurate picture\" of key intelligence it heldAnother ongoing case is an example of how MI5's evidence cannot always be taken at face value: MI5 gave false evidence to three courts about having maintained its NCND secrecy policy in relation to an abusive neo-Nazi agent who attacked his girlfriend with a machete. But MI5 had in fact told me the man was an agent when attempting to prevent me from investigating him. After MI5 apologised, we then showed that inquiries into what happened by MI5 and the government were deficient and unreliable, with further falsehoods provided to the court. This prompted the most senior judge in England and Wales to dismiss MI5's explanations and led the prime minister to order a new investigation, which will report this year.In the Stakeknife investigation, MI5 disclosed key documents years after enquiries began, aer Scappaticci had died and charging decisions had been made, and at a point when the Legacy Act banned police from investigating further. The new material revealed MI5 had greater and earlier knowledge of Stakeknife than detectives had previously been told, including that MI5 had been involved in tasking him. The lead detective said it was a \"significant failure on the part of MI5\". A review commissioned by MI5 found no deliberate wrongdoing.Cover-ups and failures to disclose information have a long history in Northern Ireland. Lord Stevens, recalling his investigations, has said: \"I was misled deliberately, I was criminally obstructed from doing my job by the Royal Ulster Constabulary and military, whilst MI5 failed to disclose information.\"Judge Pomerance, who was senior counsel on another major investigation, concluded bluntly: \"The state viewed itself as above the law\".The battle of bereaved familiesLast July, days before Eugene Thompson died, Jon Boutcher delivered a letter of apology on behalf of PSNI. He apologised for the police's failure to take action that may have prevented Paul Thompson's murder, and for failures in the investigation, including not properly pursuing suspects.Mark Thompson from Relatives for Justice (no relation of Paul and Eugene Thompson) says the apology was \"important\" but that Eugene was by this stage \"very ill\".Thompson familyJust before he died, Eugene Thompson (right) received an apology for police failings over the murder of his brother Paul (left). Their mother Margaret is also picturedMark had watched the Supreme Court hearings with Eugene on a laptop in his hospice and describes the experience as \"tough\". Eugene was \"praying and hoping that before he died the judgment could be made\", Mark says.Bereaved families caught up in these cases have had to battle for decades, trying to fill voids left by the lack of proper investigations by the state.\"You became an investigator, tracking down witnesses. You became an expert in the law in that field. And you fought your own case tooth and nail.\"Eugene Thompson became an \"accidental lawyer and expert in his own case\", he says, as he campaigned for answers about why his brother Paul was murdered.\"I think if we take anything from the legacy of him, it's the example of never giving up.\"Email: security.investigations@bbc.co.ukSignal: @investigation.56Click here to learn how to use SecureDrop, an anonymous whistleblowing tool that works only in the Tor browser and follow the advice to stay secure.BBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. You can now sign up for notifications that will alert you whenever an InDepth story is published - click here to find out how",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Murder and MI5: the extraordinary battle over what stays secret",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/10d7/live/8f15af90-dbfc-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2026-01-26T00:25:19.000Z",
      "dateModified": "2026-01-26T00:25:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where Eagles Dare",
    "url": "https://www.bbc.co.uk/iplayer/episode/m0026pqz?at_mid=Wmb0QwHn72&at_campaign=Where_Eagles_Dare&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m0026pqz&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Where_Eagles_Dare&at_bbc_team=BBC&at_creation=Film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0kcvbtt.jpg",
    "tag": "Trending",
    "date": "2026-01-10T17:46:15.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeWhere Eagles DareWhere Eagles DareSeven paratroopers, led by a British intelligence officer, are sent on a seemingly impossible mission - to rescue an American officer from the apparently impregnable Castle of the Eagles. Duration2h 29mFirst shown1968Available for 14 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesKelly's HeroesThey set out to rob a bank - and nearly won a war! Offbeat war caper with Clint Eastwood2h 18mThe Guns of NavaroneGregory Peck leads an all-star cast. Behind enemy lines, guns must fall... or Allies will2h 30mThe Eagle Has LandedStars Donald Sutherland and Michael Caine in the WWII tale of a plot to kidnap Churchill2h 9mThe Heroes of TelemarkCome frozen hell or high adventure. Kirk Douglas in a true story of wartime derring-do2h 5mThe Battle of the River PlateA saga of the sea. True story of the pursuit of a seemingly unstoppable German battleship1h 54mThe Cockleshell Heroes10 daring men, one impossible mission. WWII drama inspired by a true tale of heroism1h 33mDunkirkJohn Mills and Richard Attenborough star in an epic WWII mission of courage and bravery2h 10mThe Great EscapeCourage unites, freedom awaits. The all-time action classic action starring Steve McQueen2h 45mIce Cold in AlexJohn Mills stars. From Tobruk to Alexandria, they had to make it - even with a traitor!2h 5mThe SearchersHe had to find her... John Wayne in the great American western1h 54mEscape to AthenaRoger Moore in an action-packed wartime yarn. A ragtag bunch of prisoners plan an escape1h 54mBen-HurRevenge. Redemption. The race of a lifetime. Charlton Heston stars in the biblical epic3h 23m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where Eagles Dare",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0kcvbtt.jpg"
      ],
      "datePublished": "2026-01-10T17:46:15.000Z",
      "dateModified": "2026-01-10T17:46:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Labour Block Andy Burnham From Standing - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mx4v36?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-25T21:33:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·25 Jan 2026,·15 minsLabour Block Andy Burnham From StandingNewscastAvailable for over a yearToday, Andy Burnham has said he is \"disappointed\" after being blocked from standing as a candidate for the upcoming parliamentary by-election in Gorton and Denton by Labour's ruling body.\nAs a directly elected mayor, Burnham had to get approval from Labour's national executive committee (NEC), after he applied to be a candidate on Saturday.\nBut Labour said the party had decided to deny him permission to stand to \"avoid an unnecessary mayoral election, which would use substantial amounts of taxpayers' money and resources\".\nAdam and Chris are here to discuss what it means and what might happen next. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers.\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nThe presenters were Adam Fleming and Chris. It was made by Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Labour Block Andy Burnham From Standing - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-25T21:33:00.000Z",
      "dateModified": "2026-01-25T21:33:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Are ICE immigration agents acting outside the law? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct8bz1?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-01-23T16:16:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·23 Jan 2026,·30 minsAre ICE immigration agents acting outside the law?AmericastAvailable for over a yearDonald Trump came into power with a promise to carry out the “largest mass deportation programme in history”.  One year on, ICE (Immigration and Customs Enforcement) raids in US cities are one of biggest political issues dividing America right now, with questions over how ICE agents are behaving and who they are targeting.\nIn this episode, Anthony, Marianna and Justin look at whether ICE agents are going beyond their remit, and is public opinion starting to turn against the president? \nWe focus on Minneapolis after the killing of 37 year old Renee Nicole Good two weeks ago, who was shot dead by an ICE officer.  Anti-ICE protests have been ongoing within the city, and this week, the Vice President JD Vance who was visiting Minneapolis called for Democrats to co-operate with the Trump agenda.  \nJustin talks to John Sandweg, former Acting Director of ICE under President Obama who gives us his insight into how ICE agents are being vetted and recruited, plus the wider impact of diverting billions of dollars into Trump’s enforcement operations.  \nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Anthony Zurcher, North America Correspondent\n• Marianna Spring, Social Media Investigations Senior Correspondent \nGUEST: \nJohn Sandweg, former Acting Director of ICE under President Obama \nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Purvee Pattni and Laura Cain. The technical producer was Mike Regaard. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Are ICE immigration agents acting outside the law? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-01-23T16:16:00.000Z",
      "dateModified": "2026-01-23T16:16:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Venezuela frees dozens of political prisoners, human rights group says",
    "url": "https://www.bbc.com/news/articles/clymr3pz2kxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/612b/live/8a6f54c0-fa13-11f0-b12c-a199f4d4d58c.png",
    "tag": "Trending",
    "date": "2026-01-25T18:29:57.000Z",
    "description": "14 hours agoThomas MackintoshEPASince 8 January families have been spending the night outside the El Rodeo jail in ZamoraA leading Venezuelan human ri",
    "body": "14 hours agoThomas MackintoshEPASince 8 January families have been spending the night outside the El Rodeo jail in ZamoraA leading Venezuelan human rights group says at least 80 political prisoners have been released under pressure from the US.Alfredo Romero, head of Foro Penal, said his group was verifying the identities of those freed from prisons across the country on Saturday - and more releases were likely to take place.It is the latest batch of detainees released since the US seized Venezuelan President Nicolás Maduro in a raid, and took him to New York to stand trial on drug-trafficking charges earlier this month.On Friday Venezuela's interim President Delcy Rodriguez said more than 600 prisoners had been freed - but Foro Penal says this figure has been inflated.Romero announced the releases on social media. He also posted an image of Foro Penal colleague Kennedy Tejeda who he said had been held in Tocorón prison, west of the capital caracas since August 2024.In a post on X, Foro Penal lawyer Gonzalo Himiob said the number of releases could rise above 80 \"as we proceed with verification\".Previously, Foro Penal said that many of those freed in recent weeks have not had the charges against them dropped.This has left them in legal limbo and they have been barred from speaking in public, the group said.Before this weekend's developments, the group had confirmed the release of just 156 political prisoners since 8 January.Some domestic opposition figures and at least five Spanish nationals are among those confirmed to have been freed so far.Separately, Rodriguez said she was due to have a call on Monday with the United Nations High Commissioner for Human Rights, Volker Turk, to ask the UN to verify the lists of those released so far.Human rights groups and activists have long accused the government of using detentions to muzzle critics. The Venezuelan government has denied holding political prisoners, insisting they were arrested for criminal activity.Many were detained after the 2024 presidential election, when Maduro claimed victory despite opponents and many countries disputing the results.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Venezuela frees dozens of political prisoners, human rights group says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/612b/live/8a6f54c0-fa13-11f0-b12c-a199f4d4d58c.png"
      ],
      "datePublished": "2026-01-25T18:29:57.000Z",
      "dateModified": "2026-01-25T18:29:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Traitors moves from TV to theatre with 'bold' West End show",
    "url": "https://www.bbc.com/news/articles/c0r4jwkl2vqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0c6b/live/2e666020-f887-11f0-802d-45770cee28e3.jpg",
    "tag": "Trending",
    "date": "2026-01-26T08:00:07.000Z",
    "description": "20 minutes agoPaul GlynnandIan Youngs,Culture reportersBBCClaudia Winkleman hosts the hit BBC One showThe makers of The Traitors are creating a stage ",
    "body": "20 minutes agoPaul GlynnandIan Youngs,Culture reportersBBCClaudia Winkleman hosts the hit BBC One showThe makers of The Traitors are creating a stage version, in the hope that the TV show's dramatic twists and huge popularity will translate into a theatre hit.The play will tell a new story inspired by the programme's format, in which a group of faithfuls try to root out the traitors in their ranks, and will be staged at an unnamed London venue next year.It is being created by Studio Lambert, which makes the BBC TV series, and Neal Street Productions, which was co-founded by Oscar winner Sam Mendes and is behind shows and films like Call the Midwife and Hamnet.Studio Lambert chief executive Stephen Lambert said they would \"reimagine the show as a bold and surprising theatrical performance\".The contestants' roundtable discussions are packed with high dramaHe went on to say that taking it from the screen to stage \"is a hugely exciting next step for this much-loved brand\".\"Faithful fans should expect an intense, joyful night out as we reveal a thrilling new hunting ground for our Traitors,\" he said.The play will be written by John Finnemore, known for TV's Good Omens and radio series Cabin Pressure. It will be directed by Olivier Award winner Rob Hastie, who staged shows like Operation Mincemeat and Standing at the Sky's Edge, and is deputy artistic director of London's National Theatre.The announcement follows Friday's conclusion of series four of the murder mystery reality TV show, which is presented by Claudia Winkleman.It places secret saboteurs among a group of faithful contestants in a grand castle in Scotland, all fighting it out to win a cash prize.The final of the celebrity edition of the show was the UK's most-watched TV event of 2025, with about 15 million people tuning in to see traitorous comic Alan Carr become king of the castle.Caro Newling, co-founder of Neal Street Productions, said they had \"curated a team of brilliant faithful theatre-makers\", led by Hastie and Finnemore, \"to bring a bold, structural twist to the format that only the live medium can provide\".Stage adaptations of small screen hits have ranged from Stranger Things: The First Shadow, which has been running in the West End for more than two years, to The Great British Bake Off Musical, which ran in the capital for three months.More from the BBC",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Traitors moves from TV to theatre with 'bold' West End show",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0c6b/live/2e666020-f887-11f0-802d-45770cee28e3.jpg"
      ],
      "datePublished": "2026-01-26T08:00:07.000Z",
      "dateModified": "2026-01-26T08:00:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mahmood to call for more police patrols and faster responses to 999 calls",
    "url": "https://www.bbc.com/news/articles/c4gwx2271xzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/af92/live/629a1c10-fa2b-11f0-9dc3-0da0e125fd57.jpg",
    "tag": "Trending",
    "date": "2026-01-25T22:33:55.000Z",
    "description": "10 hours agoImogen JamesEPAHome Secretary Shabana Mahmood will pledge to cut \"unnecessary admin\"Police officers in England and Wales would spend more ",
    "body": "10 hours agoImogen JamesEPAHome Secretary Shabana Mahmood will pledge to cut \"unnecessary admin\"Police officers in England and Wales would spend more time on the streets under sweeping reform plans to be outlined on Monday. Home Secretary Shabana Mahmood will pledge to cut \"red tape\" and \"unnecessary admin\" that she says prevents officers from leaving their stations.She will also promise faster response times for emergencies by setting a national standard for 999 calls.Mahmood said: \"People are reporting crimes and then waiting hours or even days for a response.\"Shadow home secretary Chris Philp said \"it's hard to take Labour's promises seriously when they have stripped more than 1,300 officers from the front line in our communities\". Liberal Democrat home affairs spokesman Max Wilkinson said the government \"must deliver\" on its promises and \"get more officers back onto our streets\".The reform plans would see police forces required to respond to emergencies in urban areas within 15 minutes, and within 20 minutes in rural areas.Most forces already have response targets, but the Home Office said there was currently no way of holding them accountable if they do not meet that standard.Failure to reach targets would see the home secretary sending in experts from high performing forces to help improve response times.John Hayward-Cripps, chief executive of Neighbourhood Watch, said the new targets would be a \"welcome step forward\" towards the \"basic expectation that police will respond when you report a crime\". Mahmood will also say she wants to change how staffing levels are funded amid concern the current 'officer maintenance grant' encourages some forces to employ uniformed officers in administrative roles such as IT or human resources.The targets are part of the government's plans for sweeping changes to policing in England and Wales. Many of the changes have already been announced by the government in the run-up to Monday's announcements. These include: A new National Police Service to free up local forces in tackling everyday crime. The new service will take over responsibility for counter-terror, fraud and organised crime investigationsPlans for every police officer in England and Wales to hold a licence to be able to continue working. They will have to prove they have the right skills in issues such as tackling violence against women and girls or face being removed from their jobThe number of police forces will also be reduced, cutting them from the current 43. No official figure has been given for what will remain, but police chiefs have been calling for the creation of 12 \"mega forces\".More from the BBC",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mahmood to call for more police patrols and faster responses to 999 calls",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/af92/live/629a1c10-fa2b-11f0-9dc3-0da0e125fd57.jpg"
      ],
      "datePublished": "2026-01-25T22:33:55.000Z",
      "dateModified": "2026-01-25T22:33:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'Starmer triggers Labour civil war' and 'Republicans break ranks'",
    "url": "https://www.bbc.com/news/articles/c07x0d8283no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c21e/live/a43c57a0-fa49-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-26T05:47:31.000Z",
    "description": "2 hours agoBBCAlmost all of the papers are leading on a \"Labour civil war\", after Mayor of Greater Manchester Andy Burnham was blocked from standing a",
    "body": "2 hours agoBBCAlmost all of the papers are leading on a \"Labour civil war\", after Mayor of Greater Manchester Andy Burnham was blocked from standing as a candidate for the upcoming parliamentary by-election in Gorton and Denton by the party's ruling body. The i Paper reports the prime minister is facing \"condemnation from within his own party\", with one minister telling the publication that the move has made Sir Keir Starmer look \"cowardly\".\"Labour MPs revolt over blocking of Burnham\" reads the Times, which says the block saw Sir Keir defy calls from senior figures in his own party. According to the paper, Ed Miliband, Angela Rayner and Lucy Powell all advised that Burnham should be allowed to stand in the Gorton and Denton by-election, in part due to a  \"significant risk\" that Labour could lose the constituency to Reform UK. The paper warns that a combination of by-election defeat and the local elections in May could \"prove fatal for Starmer\".Sir Keir is now facing his \"biggest Labour civil war yet\", says the Express.The Telegraph has taken a similar approach, declaring the Labour party in \"open revolt\". The paper says a letter is circulating among backbenchers which claims that the decision amounted to a \"remote stitch-up from a small group of people at the very top of London\".The Daily Mail leads on a reported warning to the PM that his decision to block Burnham's return has only \"hastened his demise\" and make it more likely that he will face a leadership challenge.The Metro quotes Labour MP Karl Turner saying that \"there'll be a lot of bloodletting\" as a result of the decision.The Financial Times reports mounting backlash against Donald Trump, following the killing of a second person in Minneapolis by federal agents. It quotes top Republicans who have publicly condemned the shooting, such as Oklahoma Governor Kevin Stitt, who said the president is \"getting bad advice right now\". Democrats are threatening a second government shutdown in response, while former President Barack Obama has declared the shooting a \"wake-up call to every American\", in what the paper calls a \"rare public intervention\". The Guardian also echoes other headlines of a Labour \"civil war\" in its coverage. Elsewhere, the paper focuses on the continued fallout from the fatal shooting of Alex Pretti by an immigration officer in Minneapolis as pressure mounts on Donald Trump's administration to fully investigate the killing.\"Strong Starm tactics\" says the the Daily Mirror, citing \"furious\" Burnham supporters who called the ruling a \"stitch-up\".\"Crash and Burnham\" is the Sun's take. The paper quotes Burnham's reaction on social media, saying he is \"disappointed\" by Labour's move.The Independent says the move to block Burnham has \"laid bare\" the divisions in the Labour party.Inbetweeners actor James Buckley has made £2m making videos for fans, according to the front page of the Star.Labour's treatment of Andy Burnham dominates the morning papers.The Daily Telegraph quotes a letter said to be circulating among backbenchers with its headline \"Labour in revolt over Burnham stich-up\". The former deputy Prime Minister, Angela Rayner, also considers the move a mistake, according to the paper.The Guardian says Labour risks a \"civil war\". Its report notes that many of the party members unhappy with the decision aren't natural allies of Andy Burnham, but are growing weary of Sir Keir's leadership. The i Paper and the Sun's headlines also talk of a Labour \"civil war\".The Daily Mirror says Sir Keir has deployed \"Strong Starm Tactics\" by torpedoing Burnham's comeback and derailing any leadership bid. The paper says the prime minister has retained the support of loyalists, despite the party backlash. But the Daily Express says he has been accused of \"cowardice\" by a senior party figure. And the Daily Mail warns Sir Keir has \"only hastened his demise\" by blocking Burnham from running in the by-election. Its report says the prime minister will \"inevitably face a leadership challenge\".Sir Keir isn't the only leader facing a potential revolt within his party, according to the Financial Times. It says members of President Trump's Republican party are \"breaking rank\" over the killings of two US citizens by immigration officers in Minneapolis. The paper quotes Oklahoma's Republican governor, Kevin Stitt, who said Donald Trump was getting \"bad advice\" on the situation.The Times says China has sacked its most senior general, over accusations that he leaked information about Beijing's nuclear weapons programme to the US. The removal of Zhang Youxia gives President Xi control of his country's military affairs, the report says, to an extent unseen since Chairman Mao.The Daily Telegraph says there were more than 70,000 people with a university degree out of work claiming benefits at the end of last year. Its report focuses on figures from the Centre for Social Justice, which says an increasing number of graduates are getting degrees that fail to meet the skills required from employers.Britain's oldest podcasters feature in the Daily Express. Lifelong friends Doreen, Maureen and Anne - who have a combined age of 272 - have launched the online talk show from their care home. The paper quotes the group, who said they didn't know what a podcast was, but likened it to having \"a good natter over dinner\".Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'Starmer triggers Labour civil war' and 'Republicans break ranks'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c21e/live/a43c57a0-fa49-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-26T05:47:31.000Z",
      "dateModified": "2026-01-26T05:47:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Philippines: 18 dead after ferry carrying 300 passengers sinks ",
    "url": "https://www.bbc.com/news/articles/cwy1vpqpy23o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f9de/live/cce379f0-fa6b-11f0-ba3f-fd73924e5353.jpg",
    "tag": "Trending",
    "date": "2026-01-26T08:17:35.000Z",
    "description": "At least 18 people have died after a ferry carrying more than 350 passengers and crew members onboard sank in the waters off Philippines' southern coa",
    "body": "At least 18 people have died after a ferry carrying more than 350 passengers and crew members onboard sank in the waters off Philippines' southern coast.Search crews have rescued 317 people on board the MV Trisha Kerstin 3, but at least 24 people are still missing, according to the Philippine Coast Guard.The ship, both a cargo and passenger ferry, was on its way from the southern island of Mindanao to Jolo island when it issued a distress call at 1:50 local time Monday (17:50 GMT Sunday).Authorities say they are investigating the cause of the sinking. The Philippines -  an archipelago nation of 7,100 islands - has a long history of maritime disasters involving inter-island ferries.\"Based on the account of some survivors, the waters in the area were rough at the time,\" Philippine Coast Guard spokeswoman Noemie Cayabyab said in a televised interview, according to an AFP report. A video shared by the disaster management office in the southwestern Bongao Municipality show people wearing life vests floating in the water as they wait for rescuers.Another Facebook video posted by Basilan Governor Mujiv Hataman showed survivors wrapped in blankets as they disembarked from a rescue boat.Rescuers have been overwhelmed by the influx of survivors, Basilan emergency responder Ronalyn Perez told AFP. \"The challenge really is the number of patients that are coming in. We are short-staffed at the moment,\" Perez said.Another rescuer said their office had received more than 100 calls from family members, AFP reported.Poor maintenance and overloading have been blamed for past ferry accidents in the Philippines. Despite this, many Filipinos still travel by ferry due to its low costs. In May 2023, 28 people died after a passenger ferry caught fire. The fatalities included three children, among them a six-month-old baby.The year before that, at least seven people died after a fire in a high-speed ferry carrying 134 people.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Philippines: 18 dead after ferry carrying 300 passengers sinks ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f9de/live/cce379f0-fa6b-11f0-ba3f-fd73924e5353.jpg"
      ],
      "datePublished": "2026-01-26T08:17:35.000Z",
      "dateModified": "2026-01-26T08:17:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chris Mason: Burnham saga unlikely to be last act in drama of Starmer's leadership",
    "url": "https://www.bbc.com/news/articles/cpwnjdnz2n5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3f56/live/37cf7c10-fa8e-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-25T17:41:21.000Z",
    "description": "14 hours agoChris MasonPolitical editorThe other day I compared the saga of Andy Burnham, his ambitions and the forthcoming by-election in Greater Man",
    "body": "14 hours agoChris MasonPolitical editorThe other day I compared the saga of Andy Burnham, his ambitions and the forthcoming by-election in Greater Manchester to a long and twisting marble run.If, and it was a big if, the marble trundled all the way to the bottom, it was possible to imagine Burnham as prime minister, before this year was out.But, as I said then, it was also possible the marble would fly off the run spectacularly – which is precisely what has now happened.In an exercise of brute power, which is simultaneously an illustration of how they perceive their own weakness, No 10 has scuppered Burnham's attempted run from Manchester to Westminster and perhaps on to Downing Street.Yes, this was a decision taken by a committee of the Labour Party, but allies of Sir Keir Starmer are making it perfectly clear he joined the remote meeting on Sunday morning and he cast a vote to block Andy Burnham.The relationship between the two men has long been fascinating to observe.Burnham's first act in politics was very much as a creature of Westminster: an adviser, an MP for 16 years, a cabinet minister. He has run for the Labour leadership twice before. Here he is talking to me more than a decade ago about his ambition to be prime minister. He later reinvented himself - by defining himself against Westminster as the Mayor of Greater Manchester.But his ambitions beyond the north west of England have long been transparent - and long provoked a roll of the eyes or a raised eyebrow from Sir Keir.Burnham's interventions last autumn, around the time of Labour's annual conference, deeply irritated many within the party. He gave an interview to The New Statesman, which carried the less than cryptic headline \"Andy Burnham's plan for Britain.\"Shortly after came an interview in The Telegraph, headlined \"Andy Burnham: MPs want me to challenge Starmer\".Burnham's team would point out, rightly, that politicians don't write the headlines but the wider point stands – his desires were very, very clear.Just the other day, he set out in The Guardian how he believed his approach to his mayoralty in Greater Manchester could be applied nationally.Of course, aspiring to lead the country is noble, but it shouldn't be surprising that the current occupier of that role might have a rather sniffy view of such manoeuvring, particularly when Starmer can argue that it is he who won Labour's colossal majority not Burnham, whatever people might think of how governing has gone for Labour since.No 10 has calculated that it would rather weather a short-term storm – the gales of reaction for and against this decision currently gusting across social media – than authorise a circus lasting weeks, then months, with Burnham as a by-election candidate and one question dominating: what's your plan if you become prime minister?\"I'm afraid no-one is convinced that Andy is coming in to be a team player and the last thing we should do is allow this kind of psychodrama,\" one senior party figure tells me, adding: \"We can't allow insecurity and destabilisation to indulge one man's personal ambition.\"Others are livid, arguing it is absurd and counterproductive to spike the prospects of someone they see as one of the party's brightest lights.\"You should not block democracy. Keir is running scared and it's a very bad look,\" one senior Labour MP said.All this means that in the space of just a few months, those loyal to the prime minister have briefed heavily against Health Secretary Wes Streeting, whose ambitions they view with nervousness too - and have now blocked Andy Burnham from returning to Westminster.They argue that the electorate is sick of political soap opera and they want to get on with governing – against a tricky international and domestic backdrop.Their critics, within the Labour Party and beyond, say both are acts of a weak prime minister seeking to cripple capable rivals who might, they argue, do a considerably better job than him in No 10.This will likely be far from the last act this year in the drama of Sir Keir Starmer's leadership, and how much of a future it has.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chris Mason: Burnham saga unlikely to be last act in drama of Starmer's leadership",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3f56/live/37cf7c10-fa8e-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-25T17:41:21.000Z",
      "dateModified": "2026-01-25T17:41:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gold tops $5,000 for first time ever, adding to historic rally",
    "url": "https://www.bbc.com/news/articles/cvgd8kj2y2po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c5ea/live/315436b0-fa47-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-26T01:02:44.000Z",
    "description": "7 hours agoPeter HoskinsandAdam Hancock,Business reportersHiba Kola/ReutersThe price of gold has risen above $5,000 (£3,659) an ounce for the first ti",
    "body": "7 hours agoPeter HoskinsandAdam Hancock,Business reportersHiba Kola/ReutersThe price of gold has risen above $5,000 (£3,659) an ounce for the first time ever, extending a historic rally that saw the precious metal jump by more than 60% in 2025.It comes as tensions between the US and NATO over Greenland have added to growing concerns about financial and geopolitical uncertainty.US President Donald Trump's trade policies have also worried markets. On Saturday he threatened to impose a 100% tariff on Canada if it strikes a trade deal with China.Gold and other precious metals are seen as so-called safe-haven assets that investors buy in times of uncertainty. On Friday, silver topped $100 an ounce for the first time, building on its almost 150% rise last year.Demand for precious metals has also been driven by a range of other factors including higher-than-usual inflation, the weak US dollar, buying by central banks around the world and as the US Federal Reserve is expected to cut interest rates again this year.Wars in Ukraine and Gaza, as well as Washington seizing Venezuelan President Nicolás Maduro, have also helped push up the price of gold.One of the biggest appeals of gold is its relative scarcity. Only around 216,265 tonnes of the metal have ever been mined, according to the World Gold Council trade association.That's enough to fill between three to four Olympic-sized swimming pools. The majority of that was only extracted from the earth since 1950, as mining technology advanced and new deposits were discovered.The US Geological Survey estimates that another 64,000 tonnes of gold can still be mined from underground reserves, although the supply of the metal is predicted to plateau in the coming years.\"When you own gold, it's not attached to the debt of somebody else like a bond is or an equity where the performance of a company will drive performance,\" said Nicholas Frappell, global head of institutional markets at ABC Refinery.\"It's a really good diversifier in a very uncertain world,\" he added.'People go to gold'Gold saw a blockbuster year in 2025, with its biggest annual gain since 1979 as investors flocked to precious metals.With financial markets spooked by concerns including Trump's tariffs and fears that artificial intelligence-related stocks are overpriced, gold repeatedly hit new record highs.\"I think a large part of that is the extreme uncertainty we have around US policy,\" said Nikos Kavlis from research consultancy Metals Focus.While economic concerns can help to push up the price of gold, it also tends to rise when investors expect interest rates to be cut.Lower rates typically mean smaller returns for investments such as bonds, so investors look to assets like gold and silver.The US Federal Reserve is widely expected to cut its main interest rate twice this year.\"It's inversely correlated because the opportunity cost of keeping the money in a [government bond] is really not worth it anymore, so people go to gold,\" said Ahmad Assiri, Research Strategist at Pepperstone.Getty ImagesIn many cultures, gold is purchased during festivals or given as a gift at celebrationsIt's not just investors who have been buying up gold.Last year, central banks added hundreds of tons of bullion to their reserves, according to the World Gold Council.\"There's a very clear shift away from the US dollar, which is benefiting gold immensely,\" said Kavalis.The start of this year has seen gold continue to rally but Frappell warns the \"news-driven\" market could also result in a fall in its price.\"There's got to be scope for unexpected news that actually might be positive for the world and not necessarily positive for gold,\" he said.But not everybody is buying gold for purely investment reasons.In many cultures, the metal is purchased during festivals or given as gifts at celebrations such as weddings.In India, the annual Diwali festival is believed to be an auspicious occasion to buy precious metals in order to bring on wealth and luck.According to the US investment bank Morgan Stanley, Indian households held $3.8tn of gold, equivalent to 88.8% of the country's gross domestic product (GDP).Neighbouring China is the world's largest single consumer market for gold, with many believing that buying it brings good fortune.\"We often see a seasonal uptick in demand around Chinese New Year, which we are seeing at the moment to an extent,\" said Kavalis, referencing the upcoming Year of the Horse, which begins in February.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gold tops $5,000 for first time ever, adding to historic rally",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c5ea/live/315436b0-fa47-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-26T01:02:44.000Z",
      "dateModified": "2026-01-26T01:02:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NRA stresses right to carry weapons in wake of Minneapolis shooting",
    "url": "https://www.bbc.com/news/articles/cnvg812n01no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/32a6/live/87ac7320-fa32-11f0-a26c-15c7ecb8d30d.png",
    "tag": "Trending",
    "date": "2026-01-25T22:29:48.000Z",
    "description": "10 hours agoEPACrowds gathered in Minneapolis despite the freezing temperaturesThe National Rifle Association (NRA) has joined other US gun lobby grou",
    "body": "10 hours agoEPACrowds gathered in Minneapolis despite the freezing temperaturesThe National Rifle Association (NRA) has joined other US gun lobby groups in calling for a \"full investigation\" by the Trump administration into the killing of Alex Pretti in Minnesota.Comments from the NRA come after a border agent fatally shot Pretti - registered nurse at a Veterans Affairs hospital - in Minneapolis on Saturday.State and federal officials have given starkly different accounts. The Trump administration has said Pretti carried a gun and posed a danger to officers - while no available video shows Pretti holding a gun.The NRA labelled a suggestion by a federal prosecutor that people who carry guns risk being lawfully shot by officers as \"dangerous and wrong\".\"Responsible public voices should be awaiting a full investigation, not making generalisations and demonising law-abiding citizens,\" the NRA said in a statement.The NRA - which is typically aligned with Donald Trump - was reacting to comments from First Assistant US Attorney for the Central District of California on Saturday night.Bill Essayli wrote on social media: \"If you approach law enforcement with a gun, there is a high likelihood they will be legally justified in shooting you. Don't do it!\"In a separate social-media post, the NRA said: \"As there is with any officer-involved shooting, there will be a robust and comprehensive investigation that takes place to determine if the use of force was justified. \"As we await these facts and gain a clearer understanding, we urge the political voices to lower the temperature to ensure their constituents and law enforcement officers stay safe.\"What we know about fatal shooting of Alex Pretti by federal agents in MinneapolisProtests and anger after man shot dead by immigration agents in MinneapolisWhat is ICE and what powers do its agents have to use force?Essayli's comments have drawn criticism from other gun advocacy groups, as well as politicians from across the spectrum.Gun Owners of America said in a statement: \"The Second Amendment protects Americans' right to bear arms while protesting - a right the federal government must not infringe upon.\"Republican Thomas Massie said: \"Carrying a firearm is not a death sentence, it's a constitutionally protected God-given right, and if you don't understand this you have no business in law enforcement or government.\"In a follow-up social media post, Essayli accused critics of taking his comments out of context.\"I never said it's legally justified to shoot law-abiding concealed carriers,\" he said on X. \"My comment addressed agitators approaching law enforcement with a gun and refusing to disarm.\"For the second time this month, federal agents have been involved in a fatal shooting in Minneapolis linked to a crackdown on illegal immigration by the Immigration and Customs Enforcement (ICE) agency.Bystander video footage has captured the moments before Pretti was shot on Saturday.The altercation that led to Pretti's shooting was recorded from many points of view and federal and state officials have given conflicting accounts.Watch: Video shows moments around fatal shooting in MinneapolisThe Department for Homeland Security shared an image of a gun it claimed belonged to Pretti and said he was a threat to officers. On Saturday, Homeland Security Secretary Kristi Noem was asked to clarify if Pretti had brandished a gun and said agents fired what she called \"defensive shots\" while trying to disarm Pretti.\"They responded according to their training, and took action to defend the officer's life and those of the public around him. And, I don't know of any peaceful protester that shows up with a gun and ammunition rather than a sign.\"Minnesota Governor Tim Walz branded the Trump administration's version of events \"nonsense\" and \"lies.\"Minneapolis Mayor Jacob Frey likened the federal operation to an invasion and accused ICE of \"trying to spin this as an action of self-defence\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NRA stresses right to carry weapons in wake of Minneapolis shooting",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/32a6/live/87ac7320-fa32-11f0-a26c-15c7ecb8d30d.png"
      ],
      "datePublished": "2026-01-25T22:29:48.000Z",
      "dateModified": "2026-01-25T22:29:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Second body found in search for missing Devon swimmers",
    "url": "https://www.bbc.com/news/articles/cn7j8k012kxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/82a9/live/82753550-fa81-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-26T06:51:46.000Z",
    "description": "1 hour agoBBCFlowers were placed along the edge of the beach at Budleigh SaltertonThe body of a man has been recovered after two swimmers went missing",
    "body": "1 hour agoBBCFlowers were placed along the edge of the beach at Budleigh SaltertonThe body of a man has been recovered after two swimmers went missing on Christmas Day, police have said.Devon and Cornwall Police said emergency services were called just before 15:00 GMT on Sunday to Exmouth Beach following a report of a possible body seen near the shore.Formal identification is yet to be carried out, but officers said the family of a 64-year-old man from Budleigh Salterton had been informed.The body of a 47-year-old man, thought to be the other of the two swimmers who went missing on 25 December, was recovered on Tuesday.The family of Matthew Upham, owner of an antiques shop in Budleigh Salterton, Devon, previously named him as one of the swimmers. According to a friend, Upham had gone into the sea to help a woman in difficulty.\"Matthew is deeply loved and will be forever missed,\" said his family, thanking emergency services who responded.Singer-songwriter Kate Bush paid tribute to 64-year-old Upham, who she said was one of her \"very dearest friends\" who she had known for 30 years.Emergency services were called to Budleigh Salterton shortly after 10:25 GMT on 25 December after two men in their 40s and 60s could not be located. The coastguard search operation was called off at about 17:00.RNLI crews as well as coastguard helicopters carried out extensive shoreline and offshore searches and a number of people were safely brought back to shore.They were checked either by paramedics at the scene or taken to hospital as a precaution.Organisers of some Christmas and Boxing Day swims in Devon and Cornwall had postponed or cancelled events due to a yellow weather warning for wind.More on this storyRelated internet linksMore from the BBC",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Second body found in search for missing Devon swimmers",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/82a9/live/82753550-fa81-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-26T06:51:46.000Z",
      "dateModified": "2026-01-26T06:51:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ban phones throughout the school day, Phillipson tells teachers",
    "url": "https://www.bbc.com/news/articles/cgk827r8mrzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1f4e/live/bc4e4f80-f87b-11f0-875b-85e16a28ee0c.jpg",
    "tag": "Trending",
    "date": "2026-01-26T07:31:23.000Z",
    "description": "46 minutes agoNathan StandleyEducation reporterAll schools in England should follow new government guidance and be phone-free for the entire school da",
    "body": "46 minutes agoNathan StandleyEducation reporterAll schools in England should follow new government guidance and be phone-free for the entire school day, Education Secretary Bridget Phillipson has said.In a letter to schools seen exclusively by the BBC, she said it was \"not appropriate for phones to be used as calculators, or for research during lessons\", as well as during break times and lunchtime.Ofsted will be inspecting schools on the implementation of their mobile phone policies going forward, she confirmed, with teachers also being advised not to use their phones in front of pupils.One head teachers' union said using Ofsted to \"police\" schools' mobile phone policies was \"deeply unhelpful and misguided\".Schools were first given guidance on phones by the previous Conservative government in February 2024, but Phillipson said in her letter that it \"did not deliver the clarity or consistency that schools need\".She said the government had therefore \"strengthened\" the guidance issued last week, to make it \"explicit\" that pupils should not be using their phones at school.Shadow policing minister Matt Vickers told BBC Breakfast he was \"entirely supportive of us empowering headteachers to make sure that classrooms are places of learning\".Phillipson's letter to schools comes just under a week after the announcement that the government would be launching a three-month consultation on banning social media for all under-16s in the UK.The education secretary has encouraged teachers to \"contribute your professional insight\".Conservative leader Kemi Badenoch has already said her party would introduce such a ban if it was in power.Last week's announcement also included tougher guidance for schools from Ofsted, including telling staff not to use their devices for personal reasons in front of pupils.Recent research by the survey tool Teacher Tapp suggested 86% of primary school teachers said they were able to use their phones at school for personal use, but only during breaks, while 44% of secondary school teachers said they were allowed to use their phones freely.Only 2% of both primary and secondary teachers surveyed said their schools banned staff from using phones entirely during the school day.Tony McCabe, headteacher at St Joseph's High School in Horwich, Greater Manchester, said he welcomed the guidance because phones can be \"very destructive for young people during the school day\".He told BBC Breakfast that screen time for children was \"incredibly excessive\", with some looking at devices for as long as five hours before the school day had even begun.Mobile phones are banned from being used at his school, except for in emergency situations with adult supervision.But he said that it was important to strike a balance, adding: \"We've got to prepare them for the world of work out there. That involves emerging technology. We can't ignore that it exists and I believe that schools have a role and a duty to educate young people to use that technology wisely and effectively.\"Teaching unions have generally welcomed the social media consultation, but pushed back on the suggestion of Ofsted monitoring schools' mobile phone policies.Paul Whiteman, general secretary of the National Association of Head Teachers, said school leaders \"need support from government, not the threat of heavy-handed inspection\".The Association of School and College Leaders also said the government had been \"sluggish\" in responding to the online risks posed to children.Although the government consultation on social media concerns the whole of the UK, its guidance for schools on phones only includes England, as education is a devolved policy area.The Senedd said last year that phones should not be banned \"outright\" from schools in Wales, but that schools themselves should be supported to set and implement their own policies.In Northern Ireland, Education Minister Paul Givan previously advised schools to restrict pupils in their use of mobile phones, and has recently supported a campaign encouraging parents not to buy their children smartphones until they reach 14 years old.And in Scotland, schools have been given government guidance on setting their own rules, such as pupils having to hand in phones before lessons, or not being allowed to use them on school trips.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ban phones throughout the school day, Phillipson tells teachers",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1f4e/live/bc4e4f80-f87b-11f0-875b-85e16a28ee0c.jpg"
      ],
      "datePublished": "2026-01-26T07:31:23.000Z",
      "dateModified": "2026-01-26T07:31:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]