[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - The Americast Awards 2025… on 5 Live! - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mntf0r?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-12-15T21:07:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·15 Dec 2025,·35 minsThe Americast Awards 2025… on 5 Live!AmericastAvailable for over a yearIt’s time for the 2025 Americast Awards…\nThere’s no doubt that it’s been a tumultuous year in US politics. From a dramatic disagreement between President Trump and Ukraine’s President Zelensky in the Oval Office, the deployment of the National Guard to cities across America, self-described democratic socialist Zohran Mamdani becoming the Mayor of New York, to Trump announcing his plan to turn Gaza into the ‘Riviera of the Middle East’. \nJustin, Sarah and Marianna pitch the moments which they think caused the biggest ripples in America this year to Matt Chorley. And we hear some of your picks too. \nHOSTS:\n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Marianna Spring, Social Media Investigations Correspondent \nGET IN TOUCH:\n• Join our online community: https://discord.gg/qSrxqNcmRB\n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast\nThis episode was made by Alix Pickles and Grace Reeve.The technical producer was Johnny Hall.The series producer is Purvee Pattni.The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app.\nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155\nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - The Americast Awards 2025… on 5 Live! - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-12-15T21:07:00.000Z",
      "dateModified": "2025-12-15T21:07:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Poison Water",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002mshv?at_mid=hccWjMbQd4&at_campaign=Poison_Water&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002mshv&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Poison_Water&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mgrl3w.jpg",
    "tag": "Trending",
    "date": "2025-11-26T06:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomePoison WaterPoison WaterWhen tap water turns toxic in Cornwall, a public health disaster leads to accusations of a cover-up and the search for the truth. The story of Britain’s biggest mass poisoning. Duration1h 18mFirst shown9pm 26 Nov 2025Available for 11 monthsWatchlistAudio DescribedSign Language",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Poison Water",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mgrl3w.jpg"
      ],
      "datePublished": "2025-11-26T06:00:00.000Z",
      "dateModified": "2025-11-26T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - ​​Starmer Says a Doctor Strike Would be 'Reckless' - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mnfl33?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-13T16:30:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·13 Dec 2025,·26 mins​​Starmer Says a Doctor Strike Would be 'Reckless'NewscastAvailable for over a year​​Today, the Prime Minister Keir Starmer has written in the Guardian Newspaper urging members of the British Medical Association to rethink planned strikes. \n​​\n​​Possible strikes coincide with flu-related illnesses and hospitalisations at a higher rate than usual for this time of year, which have led to worries that a strike would lead to problems for the NHS.\n​​\n​​Also, Laura has spoken to the new chair of the Equality and Human Rights Commission, Dr Mary-Ann Stephenson. Since the Supreme Court ruling over the definition of a woman in April they have been working on new guidance on who can access single-sex spaces. So how might the guidance be implemented?\n​​\n​​You can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers.\n​​\n​​You can join our Newscast online community here: https://bbc.in/newscastdiscord\n​​\n​​Get in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\n​​\n​​New episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\n​​\n​​Newscast brings you daily analysis of the latest political news stories from the BBC. The presenters were Laura Kuenssberg and Paddy O'Connell It was made by Chris Flynn with Rufus Gray. The social producer was Joe Wilkinson. The technical producer was Michael Regaard. The weekend series producer is Chris Flynn. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - ​​Starmer Says a Doctor Strike Would be 'Reckless' - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-13T16:30:00.000Z",
      "dateModified": "2025-12-13T16:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former Oxfam boss to sue charity over dismissal",
    "url": "https://www.bbc.com/news/articles/cgex8w9930wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/319d/live/c135ff20-d95e-11f0-a8a9-5322ff02ea00.jpg",
    "tag": "Trending",
    "date": "2025-12-16T15:36:07.000Z",
    "description": "41 minutes agoJoe PikePolitical correspondentBBCLawyers for the axed former chief executive of Oxfam GB have said she will launch legal action against",
    "body": "41 minutes agoJoe PikePolitical correspondentBBCLawyers for the axed former chief executive of Oxfam GB have said she will launch legal action against the charity, claiming she was constructively dismissed.Halima Begum's solicitors say she was \"forced to resign\" due to the \"hostile, victimising and discriminatory conduct of Oxfam\".They said she \"entirely denies the defamatory and unfounded criticism of her\".Dr Begum was forced out by the charity's board on Friday amid accusations of bullying. An independent review found \"serious issues\" with her behaviour and decision making.The organisation's trustees decided Dr Begum's position was \"untenable\" because of an \"irretrievable breakdown in its trust and confidence\" in her ability to do the job.Dr Begum had been in the role for almost two years.Her solicitor, Lawrence Davies, said: \"Our client alleges that she was subjected to, and continues to be subjected to, a victimising witch-hunt. \"The truth of what actually happened will be revealed in due course. \"Our client has whistleblown to the Charity Commission about various public interest matters which we assume are now being investigated.\"Dr Begum's lawyers said she had been constructively dismissed and legal proceedings would be commenced against Oxfam in the Employment Tribunal.Constructive dismissal is when an employee is forced to leave a job because the employer created a hostile work environment.About 70 members of staff had signed a letter calling for Oxfam to investigate Dr Begum's conduct, with several employees said to have resigned after falling out with her, the Times reported.Oxfam GB has been contacted for comment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former Oxfam boss to sue charity over dismissal",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/319d/live/c135ff20-d95e-11f0-a8a9-5322ff02ea00.jpg"
      ],
      "datePublished": "2025-12-16T15:36:07.000Z",
      "dateModified": "2025-12-16T15:36:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Negotiations over US-UK tech deal stall",
    "url": "https://www.bbc.com/news/articles/c79x54dprngo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b07a/live/9a15a890-da68-11f0-a03c-01668bc4a165.jpg",
    "tag": "Trending",
    "date": "2025-12-16T13:42:57.000Z",
    "description": "3 hours agoLiv McMahonTechnology reporterReutersNegotiations over a technology deal between the UK and US have stalled due to stumbling blocks in wide",
    "body": "3 hours agoLiv McMahonTechnology reporterReutersNegotiations over a technology deal between the UK and US have stalled due to stumbling blocks in wider trade negotiations between the two sides.The Technology Prosperity Deal - which was billed as \"historic\" when it was unveiled during US President Donald Trump's state visit in September - saw both countries pledge to co-operate in areas such as AI.However, talks on the agreement are now being held up because of US concerns about what it considers to be wider UK trade barriers.A government spokesperson said \"our special relationship with the US remains strong and the UK is firmly committed to ensuring the Tech Prosperity Deal delivers opportunity for hardworking people in both countries\".The New York Times - which first reported the story - said there were \"broader disagreements\" between the two sides, including over digital regulations and food safety rules.The UK government did not comment on these specific claims. The White House has not responded to the BBC's request for a comment.When the deal was announced the government was keen to highlight the benefits it said it would bring.\"This Tech Prosperity Deal marks a generational step change in our relationship with the US, shaping the futures of millions of people on both sides of the Atlantic,\" Prime Minister Sir Keir Starmer said in a statement.Technology secretary Liz Kendall said the partnership would \"transform lives across Britain\" and was a \"vote of confidence in Britain's booming AI sector.\"At the same time the deal was revealed, a series of US tech firms announced a flurry of investment in the UK.A total of £31bn in planned spending was set out by tech giants including Microsoft, Nvidia and Google.It is believed those investment plans are unaffected.Google, Microsoft and Nvidia have also been approached for comment, but the firms have not yet responded to the BBC.Nvidia boss Jensen Huang said in September his company's UK investment reflected his belief it could become an \"AI superpower\" - an ambition championed by Sir Keir's government.It said investment announced by tech firms alongside the Tech Prosperity Deal would be used to scale-up AI infrastructure such as data centres, across the UK.'Piecemeal approach'The tech pact was documented in a Memorandum of Understanding (MOU) which said both countries would seek to collaborate across AI, quantum computing and nuclear power.It said this could include working together to build \"powerful quantum machines,\" support innovation in AI hardware and explore potential new ways to use advanced nuclear energy.But the MOU also states any proposals are not binding and that it only \"becomes operative alongside substantive progress being made to formalise and implement\" the wider US-UK Economic Prosperity Deal, signed in May.The Trump administration has sought to rewrite the global rules on trade, imposing tariffs on many countries - including traditional allies like the UK - and seeking new deals which it argues are fairer to the US.For the UK that has meant haggling over various sectors of the economy, a process which has yielded agreements on cars and more recently, pharmaceuticals.  However, a proposed deal to eliminate tariffs on UK steel exports to the US has been put on hold indefinitely, the BBC understands.Allie Renison, director of communications firm SEC Newgate UK and a former government trade adviser, said the current impasse over tech reflected the US and UK's \"slightly piecemeal approach\" to inking trade deals.\"Instead of having everything done at once, different areas are being linked to different parts,\" she told the BBC - noting how concerns about separate trade areas may now be affecting tech agreements.While questions hung over what the potential roadblocks could mean for US tech firms' pledged investments in the UK, Ms Renison added, it was unlikely to be little more than \"a bit of posturing in the wider negotiations\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Negotiations over US-UK tech deal stall",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b07a/live/9a15a890-da68-11f0-a03c-01668bc4a165.jpg"
      ],
      "datePublished": "2025-12-16T13:42:57.000Z",
      "dateModified": "2025-12-16T13:42:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stelvio national park: Thousands of dinosaur footprints found on Italian mountain",
    "url": "https://www.bbc.com/news/articles/c30j94p56d6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/568d/live/410fcef0-da96-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-16T15:09:21.000Z",
    "description": "1 hour agoLaura GozziElio Della Ferrera, Arch. PaleoStelvioInitial research was carried out before snow covered the areaThousands of dinosaur footprin",
    "body": "1 hour agoLaura GozziElio Della Ferrera, Arch. PaleoStelvioInitial research was carried out before snow covered the areaThousands of dinosaur footprints dating back 210 million years have been found in a national park in northern Italy.The footprints - some of which are up to 40cm (15in) in diameter - are aligned in parallel rows, and many show clear traces of toes and claws. It is thought the dinosaurs were prosauropods - herbivores with long necks, small heads and sharp claws. \"I never would have imagined I'd come across such a spectacular discovery in the region where I live,\" said Milan-based paleontologist Cristiano Dal Sasso.Illustrazione di Fabio Manucci, Arch. PaleoStelvioArtist's rendition of a herd of prosauropods walking across a muddy plain during low tide. Smaller footprints suggest the herd also included young specimensLast September a photographer spotted the footprints stretching hundreds of metres on a vertical mountain wall in the Stelvio national park, north-east of Milan.In the Triassic period - between about 250 and 201 million years ago - the wall was a tidal flat, which later became part of the Alpine chain.\"This place was full of dinosaurs; it's an immense scientific treasure,\" Mr Dal Sasso said.The herds moved in harmony, he added, \"and there are also traces of more complex behaviours, like groups of animals gathering in a circle, perhaps for the purposes of defence.\"The prosauropods, which could be up to 10m (33ft) long,  walked on two legs but in some cases handprints were found in front of footprints, indicating that they probably stopped and rested their forelimbs on the ground.Elio Della Ferrera, Arch. PaleoStelvioPhotographer Elio Della Ferrera snapped the first picture of the mountain wall showing the footprintsElio Della Ferrera, the photographer who discovered the site, said he hoped the discovery would \"spark reflection in all of us, highlighting how little we know about the places we live in: our home, our planet\".According to a press release from the Italian culture ministry, the area is remote and not accessible by paths, so drones and remote sensing technology will be employed instead.The Stelvio national park is located in the Fraele valley by Italy's border with Switzerland, near where the Winter Olympics will take place next year. \"It's as if history itself wanted to pay homage to the greatest global sporting event, combining past and present in a symbolic passing of the baton between nature and sport,\" said the Italian Ministry of Culture.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stelvio national park: Thousands of dinosaur footprints found on Italian mountain",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/568d/live/410fcef0-da96-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-16T15:09:21.000Z",
      "dateModified": "2025-12-16T15:09:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Minister orders probe into foreign financial interference in UK politics",
    "url": "https://www.bbc.com/news/articles/c87l5nq93wno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a9fb/live/6a6efaa0-da8c-11f0-b800-5d5b12ef9423.jpg",
    "tag": "Trending",
    "date": "2025-12-16T15:41:59.000Z",
    "description": "36 minutes agoKate WhannelPolitical reporterThe government has ordered an independent review into foreign financial interference in UK politics in res",
    "body": "36 minutes agoKate WhannelPolitical reporterThe government has ordered an independent review into foreign financial interference in UK politics in response to what it called the \"shocking\" case of Nathan Gill, the former leader of Reform UK in Wales. Gill was jailed in November, after admitting to taking bribes for pro-Russian interviews and speeches when he was a Member of the European Parliament (MEP).Announcing the review, Communities Secretary Steve Reed said the government must \"learn the lessons\" from the case so \"this can never happen again\".The review will be led by former senior civil Philip Rycroft and will report back in March. Speaking in the House of Commons, Reed said: \"The facts are clear. A British politician took bribes to further the interests of the Russian regime, a regime which forcefully deported vulnerable Ukrainian children and killed a British citizen on British soil using a deadly nerve agent.\"This conduct is a stain on our democracy. The independent review will work to remove that stain.\"Earlier this year the government published its strategy for \"modern and secure elections\", which Reed said \"will close loopholes that should have been closed long before we entered office\".\"However, in the time since that strategy was published, events have shown that we need to consider whether our firewall is enough,\" he added.The government said the review would conduct an \"in-depth assessment of the current financial rules and safeguards and offer recommendations to further mitigate risks from foreign political interference\".It will also examine whether rules are in place to \"protect our democracy from illicit money from abroad, including cryptocurrencies\".The government described the review as \"a response to the evolving threat posed by political interference to British democracy, including the shocking cases of former MEP Nathan Gill and Christine Lee\".In 2022, MI5 issued a rare warning alleging that Ms Lee was a Chinese agent who infiltrated Parliament and made donations to politicians. Ms Lee has previously said the MI5 alert \"wrongly accused her of knowingly engaging in political interference\" on behalf of the Chinese Communist Party.Last month, Gill became the first politician to be jailed under the Bribery Act. He is thought to have received up to £40,000 to help pro-Russian politicians in Ukraine.He was an MEP when he accepted money from Oleg Voloshyn, a man once described by the US government as a \"pawn\" of Russian secret services.Gill was an MEP for UKIP and the Brexit Party, before joining Reform UK, where he served for a brief period as its leader in Wales until May 2021.At the time of Gill's conviction Reform UK said it was glad justice was served, calling his actions \"reprehensible, treasonous and unforgivable\".Responding to Reed's statement in the Commons, Reform UK's deputy leader Richard Tice said his party welcomed the review but called on the government to also make sure it looked into the influence of China on the Labour Party. Conservative shadow communities minister Paul Holmes also welcomed the review and said all political parties should be consulted during the inquiry.He called for better \"information sharing\" so political parties could more easily be able to \"identify irregular sources\" when accepting donations. Liberal Democrat spokesperson Zöe Franklin expressed concern that \"a small number of extremely wealthy individuals now wield disproportionate influence over British politics - that includes overseas donors\".She urged the government to introduce a cap on political donations. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Minister orders probe into foreign financial interference in UK politics",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a9fb/live/6a6efaa0-da8c-11f0-b800-5d5b12ef9423.jpg"
      ],
      "datePublished": "2025-12-16T15:41:59.000Z",
      "dateModified": "2025-12-16T15:41:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stephen Lawrence killer David Norris denied parole",
    "url": "https://www.bbc.com/news/articles/c208zd92780o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2c55/live/abdaa460-da7f-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-16T13:42:22.000Z",
    "description": "3 hours agoDaniel De SimoneInvestigations correspondent David Norris, who murdered Stephen Lawrence, has been denied parole, the BBC understands.He so",
    "body": "3 hours agoDaniel De SimoneInvestigations correspondent David Norris, who murdered Stephen Lawrence, has been denied parole, the BBC understands.He sought release during a parole hearing in October, having been jailed in 2012.Stephen, 18, was stabbed to death in a racist attack in south London in 1993.Only two of his killers have been convicted, with police always saying six people were involved.At the parole hearing, Norris admitted he was part of the attack but refused to name the other killers. He had previously denied involvement.Norris gave evidence via a video link from prison during the public hearing, in which he was bidding for release on licence.Stephen's mother, Baroness Doreen Lawrence, said at the hearing that Norris remained a danger to the public and must remain in prison. The justice secretary also opposed Norris's release.The hearing took place 13 years after Norris was jailed for life, with a minimum sentence of 14 years and three months. Stephen was stabbed to death by a gang as he waited at a bus stop in Eltham, south-east London. Only Norris and one other killer, Gary Dobson, have been convicted.The Met's failures to properly investigate the five prime suspects in the case became notorious and led to the force being branded \"institutionally racist\" by a landmark public inquiry.Witness evidence in the case records that an extreme racist slur was used towards Stephen just before the gang attacked.In his evidence to the parole hearing, Norris said he was the last person to punch Stephen. He had tried to hit him two or three times and one of his punches connected.For decades Norris publicly denied involvement in the murder, giving no-comment interviews to police, and claiming he was innocent during his trial.However, the hearing heard confirmation that he had admitted involvement since being in prison, but denies stabbing Stephen or using a knife.It also heard Norris continued to use racist language in prison, with him having been recorded in 2022 using the same racial slur that was hurled at Stephen before he was stabbed.In a prepared statement that Norris read out, he apologised to the Lawrence family and wider black and ethnic community for the \"fear\" and \"horror\" his role in the attack had caused.In a statement read on her behalf at the hearing, Baroness Lawrence said Norris had \"killed my son in the most brutal and callous fashion. In doing so he changed my life and life of my family members forever\".She said she could not forgive Norris because he has not \"expressed any acceptance, any contrition and certainly has no humanity\".Stephen's father previously told the BBC that Norris should name the other killers before he could be judged to be safe for release from prison.The Met Police ended its murder investigation in 2020, but a BBC investigation led to an independent review of the case, which began in September.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stephen Lawrence killer David Norris denied parole",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2c55/live/abdaa460-da7f-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-16T13:42:22.000Z",
      "dateModified": "2025-12-16T13:42:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Weston-super-Mare: Teenage boy held on suspicion of murdering girl, 9",
    "url": "https://www.bbc.com/news/articles/c62d0vezjw3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e2d3/live/13f07050-da87-11f0-ad83-3fe81c076d4b.jpg",
    "tag": "Trending",
    "date": "2025-12-16T15:39:01.000Z",
    "description": "39 minutes agoSarah TurnnidgeWest of England BBCResidents have been told to expect an increased police presence in the areaA teenage boy has been arre",
    "body": "39 minutes agoSarah TurnnidgeWest of England BBCResidents have been told to expect an increased police presence in the areaA teenage boy has been arrested on suspicion of murdering a nine-year-old girl.Avon and Somerset Police said officers were called to Lime Close in the Mead Vale area of Weston-super-Mare, North Somerset, at 18:09 GMT on Monday, where the girl was pronounced dead at the scene. The boy was arrested in nearby Worle at 18:19 and is currently in police custody. House-to-house inquiries are being carried out, with a police cordon in place. Supt Jen Appleford gave a statement on Lime Close on Tuesday afternoon.\"We know the whole of Weston-super-Mare will be distraught and shocked to learn of this utterly dreadful news,\" she said.Supt Appleford said the girl's family had been informed on Monday evening, adding: \"It is impossible for us to adequately put into words the pain and anguish they are feeling right now.\" Supt Jen Appleford of Avon and Somerset Police, spoke to the media on Tuesday afternoonAn investigation is under way, with a post-mortem examination to be carried out. \"Out of respect for the family we'd please ask people not to speculate on the circumstances, or the identities, of those involved because that will only add to their enormous distress,\" Supt Appleford added. Police have asked the local community to remain \"patient\" as inquiries are carried out at the house and in the surrounding area.There will also be an increased police presence in the streets around the crime scene in the coming days, although Avon and Somerset Police stressed it was not aware of any risk to the wider public.North Somerset Council leader Mike Bell said he was \"shocked and saddened\" to hear of the incident. In a post on social media, he said: \"My thoughts are with all those affected, particularly the family and friends of the girl who has lost her life.\"The community will, I am sure, pull together to support each other at this difficult time.\"Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Weston-super-Mare: Teenage boy held on suspicion of murdering girl, 9",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e2d3/live/13f07050-da87-11f0-ad83-3fe81c076d4b.jpg"
      ],
      "datePublished": "2025-12-16T15:39:01.000Z",
      "dateModified": "2025-12-16T15:39:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lottery winners scoop jackpot again in 24-trillion-to-one odds",
    "url": "https://www.bbc.com/news/articles/cx2pr1njl9vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d10c/live/9afac8b0-da79-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-16T11:55:51.000Z",
    "description": "Couple win £1m lottery jackpot for second time - in 24-trillion-to-one odds4 hours agoNathan BevanBBC WalesNational LotteryThe couple celebrating thei",
    "body": "Couple win £1m lottery jackpot for second time - in 24-trillion-to-one odds4 hours agoNathan BevanBBC WalesNational LotteryThe couple celebrating their first big win in 2018One lucky couple has beaten extraordinary odds to win £1million on the National Lottery - for the second time.  Richard Davies, 49, and Faye Stevenson-Davies, 43, first scooped a seven-figure jackpot playing the EuroMillions Millionaire Maker in June 2018.And now they have done it again by matching five main numbers and the Bonus Ball in the Lotto draw on 26 November - the chances of which are more than 24-trillion-to-one, say experts.\"We knew the odds of it happening again were outrageous, but we're proof that if you believe anything is possible,\" said Faye, from mid Wales.But, as Richard explained, their second win was not a case of simply picking the right numbers.\"It came to us through a series of four consecutive Lotto draws,\" he said.\"When you match two numbers in the Lotto draw, you automatically win a Lucky Dip for the next game and that's what's happened to us. \"We matched two numbers and won a free Lucky Dip from one draw which put us into the next draw and so on, until the winning draw on 26 November.\"However, this latest windfall is unlikely to change the couple's community-minded attitude.Former hairdresser Richard uses his skills at a shelter for the homeless in Cardiff, a project which received vital National Lottery funding, while also helping out friends by working as a delivery driver.National Lottery\"We're just going to take our time and enjoy the moment,\" said Richard and FayeMeanwhile, ex-nurse Faye is a volunteer cook at Cegin Hedyn community kitchen in Carmarthen, while also providing mental health counselling services to local organisations such as Brecon & District Mind charity.\"The first time we won we gifted people cars, donated a minibus to the local rugby team and did our best to help friends and family,\" said Faye, who will even be working on Christmas Day. \"It was all new and it was amazing to be able to make a difference. \"This time around, who knows? We're just going to take our time and enjoy the moment.\"Andy Carter, senior winners' adviser at Allwyn, operator of The National Lottery, said: \"I can still remember the day I met Richard and Faye for the first time, and it's just as special to be with them as they celebrate their second £1m win. \"I saw the positive impact of that first win and know this second one will be just as meaningful.\"More top stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lottery winners scoop jackpot again in 24-trillion-to-one odds",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d10c/live/9afac8b0-da79-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-16T11:55:51.000Z",
      "dateModified": "2025-12-16T11:55:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dentists to prioritise urgent care and save some patients more than £200 under plans",
    "url": "https://www.bbc.com/news/articles/cm20r9r1j48o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f3ba/live/93c08e60-da59-11f0-a8f0-851857e2c194.jpg",
    "tag": "Trending",
    "date": "2025-12-16T11:19:42.000Z",
    "description": "5 hours agoDominic Hughes and Catherine SnowdonBBC NewsGetty ImagesPeople needing urgent dental treatment and patients requiring complex care will be ",
    "body": "5 hours agoDominic Hughes and Catherine SnowdonBBC NewsGetty ImagesPeople needing urgent dental treatment and patients requiring complex care will be prioritised under government plans to improve access to NHS dentists in England. The proposals could mean a saving of £225 for patients requiring numerous appointments for complicated treatments.For years, many patients have found it increasingly hard to find a dentist, with some towns in England referred to as \"dental deserts\", with no access to NHS dentists at all.The British Dental Association (BDA) said that without more funding and real reform, the plans wouldn't solve current issues.Speaking on Radio 4's Today programme, health minister Stephen Kinnock said the plans were intended to \"prioritise\" urgent care.He said there was \"a lot of unnecessary routine care going on\" in NHS dentistry services at the moment. If a patient has \"good oral health\" he said they don't need to see a dentist \"more than about once every two years\".He said the current practice of most patients being offered NHS check-ups every six months was \"not the right use\" of dentists' time, and added that it was \"sucking up a lot of money in NHS dentistry\".Under the current system, which dates back to 2006, dentists are paid for what are called Units of Dental Activity, known as UDAs.Different procedures - fillings, extractions and more complicated work - are assigned a different number of UDAs.Dentists who provide NHS care have a contract that says how many UDAs they will carry out each year and are paid accordingly.But this has meant that more money was available to dentists for carrying out simple check-ups, rather than spending longer with patients who needed more complex, time-consuming care.For years dentists have been complaining that the contract for NHS work fails to cover the costs of what they're being asked to carry out.As a result many dentists have been walking away from NHS work – meaning it's increasingly hard for people to access care. There are parts of the country where there is simply no access to NHS dentistry. 'Chronic underfunding'Under the government plans, there would be new incentives for dentists to offer longer-term treatments for major issues such as gum disease and tooth decay through the NHS. Currently, a patient with tooth decay in several teeth or severe gum disease - both of which require complex treatment - would need to be treated over multiple appointments, which is costly and time consuming.But under proposed changes to the dental contract for NHS work, dental practices would be able to offer patients a single comprehensive package of treatment over a longer period, tailored to their needs. And ministers argue that this could save a patient up to £225 in fees. Shiv Pabary, chair of the BDA's General Dental Practice Committee said \"a dental crisis\" had come about directly as a result of the contract put in place in 2006. \"The reforms announced today are trying to tweak a system that's broken.\"He added that until the \"chronic underfunding\" and wider systemic problems were addressed, NHS dentistry would continue to fail to work for \"dentists and for patients\".\"To try and deliver comprehensive care within the same budget that we have at the moment is going to be hugely challenging.\"Mr Kinnock said the government had a \"massive issue to fix\" in dental care and was negotiating with the BDA on a \"radical overhaul\" of the NHS dentistry contract.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dentists to prioritise urgent care and save some patients more than £200 under plans",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f3ba/live/93c08e60-da59-11f0-a8f0-851857e2c194.jpg"
      ],
      "datePublished": "2025-12-16T11:19:42.000Z",
      "dateModified": "2025-12-16T11:19:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump defends his criticism of killed Hollywood director Rob Reiner",
    "url": "https://www.bbc.com/news/articles/c7413d9xvkeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/57e7/live/c89138a0-da73-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-16T09:49:57.000Z",
    "description": "6 hours agoBernd Debusmann Jrat the White HouseUS President Donald Trump has repeated his criticism of Rob Reiner - after his earlier remarks about th",
    "body": "6 hours agoBernd Debusmann Jrat the White HouseUS President Donald Trump has repeated his criticism of Rob Reiner - after his earlier remarks about the killed Hollywood director, a longtime Trump critic, sparked widespread condemnation.The US president told reporters the director was \"very bad for our country\", having earlier written on Truth Social that Reiner's death was linked to \"Trump derangement syndrome\" - a term he often uses to describe his critics.Reiner and his wife Michele Singer Reiner were found dead at their Los Angeles home on Sunday, and police have arrested their son Nick on suspicion of murder.They have not suggested any motive in the case, or any evidence that Reiner's politics and criticism of Trump played any role.In his social media post, which called the couple's deaths \"very sad\", Trump criticised Reiner, saying: \"He was known to have driven people CRAZY by his raging obsession of President Donald J. Trump.\"Those comments were widely criticised, including by prominent Republicans.Kentucky representative Thomas Massie, a Republican who has clashed with Trump since the president returned to the White House in January, wrote on X: \"Regardless of how you felt about Rob Reiner, this is inappropriate and disrespectful discourse about a man who was just brutally murdered.\"He added: \"I guess my elected GOP colleagues, the VP, and White House staff will just ignore it because they're afraid? I challenge anyone to defend it.\"Georgia Republican Marjorie Taylor Greene, who was once a staunch supporter of Trump before recently becoming a frequent critic, said that \"this is a family tragedy, not about politics or political enemies\" and that the murders should be \"met with empathy\".Multiple other senior members of Trump's party appeared to distance themselves from the remarks. Senator John Kennedy, a Republican representing Louisiana, said he thought Trump should not have made the comments.\"I think a wise man once said nothing. Why? Because he was a wise man,\" Kennedy said. \"I think President Trump should have said nothing. I think when the president says these sorts of things, it detracts from his policy achievements.\"Reiner was a lifelong Democrat and prominent liberal activist, and frequently spoke out against Trump.In 2017, for example, he called Trump \"mentally unfit\" for office. And as recently as October, Reiner said he believed Trump was ushering in an age of \"full-on autocracy\" in the US.Hours after his social media post, Trump repeated his thoughts on Reiner in comments given in the Oval Office to reporters, describing the director as a \"deranged person\" who was partly \"behind\" previous claims of collusion between Russia and Trump's team.\"I was not a fan of Rob Reiner at all, in any way, shape or form,\" he said.Trump has in the past criticised political foes after their death.Following the death of Arizona Senator John McCain - with whom he clashed regularly - in 2019, for example, Trump said he \"was never a fan\" and \"never will be\".In another incident the same year, Trump quipped that the late Democratic lawmaker John Dingell could be \"looking up\" at him from the grave, a comment which was widely interpreted as a suggestion that Dingell was in hell.In a statement following the remarks about Dingell, the White House said that the president was \"just riffing\".Reiner, who was 78, was known for directing several iconic films in a variety of genres, including This is Spinal Tap, Stand By Me, Misery and A Few Good Men.He married Michele, an actress, photographer and producer, in 1989, later recalling that they met during the making of one of his best-known films, When Harry Met Sally. The couple had three children together - including Nick, 32.Michele, 68, owned the Reiner Light photography agency and production house.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump defends his criticism of killed Hollywood director Rob Reiner",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/57e7/live/c89138a0-da73-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-16T09:49:57.000Z",
      "dateModified": "2025-12-16T09:49:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Australia PM Anthony Albanese visits Bondi hero Ahmed al Ahmed in hospital ",
    "url": "https://www.bbc.com/news/articles/cvg13z47vpdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9813/live/cbc6e830-da73-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-16T11:43:27.000Z",
    "description": "Australia's Prime Minister has visited Bondi hero Ahmed al Ahmed in hospital, after the bystander tried to disarm one of the gunmen in the nation's de",
    "body": "Australia's Prime Minister has visited Bondi hero Ahmed al Ahmed in hospital, after the bystander tried to disarm one of the gunmen in the nation's deadliest gun attack since 1996. \"Your heart is strong\", PM Anthony Albanese told the father-of-two, later calling him \"the best of our country\".The fruit shop owner, who was born and raised in Syria, was shot several times in the shoulder after tackling one of the alleged gunmen. Albanese said Mr Ahmed would \"undergo further surgery\" on Wednesday.At least 15 people have been confirmed dead after Sunday's attack in Sydney during an event to mark the first night of Hanukkah.Police have declared the attack as a terrorist incident targeting the Jewish community.\"He was trying to get a cup of coffee and found himself at a moment where people were being shot in front of him,\" Albanese said after the bedside visit. \"He decided to take action, and his bravery is an inspiration for all Australians. He is a very humble man.\"\"At a moment where we have seen evil perpetrated, he shines out as an example of the strength of humanity,\" the prime minister added. \"We are a brave country. Ahmed al Ahmed represents the best of our country.\"He later added: \"Ahmed, you are an Australian hero.\"There has been nationwide support for the 43-year-old including from US President Donald Trump who commended his courage, and a US billionaire who donated $99,999 (US$ 65,000; £49,000) to Mr Ahmed, calling him a \"brave hero\".In the footage, Mr Ahmed is seen hiding behind a parked car before he leaps out.He runs at the alleged gunman and seizes his weapon, before turning the gun round on him. The suspected attacker then begins to retreat.Mr Ahmed then lowers the weapon and raises one hand in the air, appearing to show police he was not one of the  attackers.Mr Ahmed's father previously told the BBC that his son was driven to act by his \"sentiment, conscience and humanity\".He \"saw the victims, the blood, women and children lying on the street, and then acted\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australia PM Anthony Albanese visits Bondi hero Ahmed al Ahmed in hospital ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9813/live/cbc6e830-da73-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-16T11:43:27.000Z",
      "dateModified": "2025-12-16T11:43:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ukraine struggling to keep lights on under Russian attack, says energy boss",
    "url": "https://www.bbc.com/news/articles/c80xjkm0283o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c2f8/live/5cf15330-da7a-11f0-b60a-5db3d22facb6.jpg",
    "tag": "Trending",
    "date": "2025-12-16T12:54:00.000Z",
    "description": "3 hours agoJonathan BealeDefence correspondent in KyivYURIY DYACHYSHYN/AFPAcross Ukraine electricity is being rationed – with supplies turned on for a",
    "body": "3 hours agoJonathan BealeDefence correspondent in KyivYURIY DYACHYSHYN/AFPAcross Ukraine electricity is being rationed – with supplies turned on for a few hours each dayUkraine's biggest private energy provider is living in permanent crisis mode because of Russian attacks on the grid, its chief executive has told the BBC.Most of Ukraine is suffering from lengthy power cuts as temperatures drop and Maxim Timchenko, whose company DTEK provides power for 5.6 million Ukrainians, says the intensity of strikes has been so frequent \"we just don't have time to recover\".President Volodymyr Zelensky said on Tuesday that Russia knew the winter cold could become one of its most dangerous weapons.\"Every night Ukrainian parents hold their children in basements and shelters hoping our air defence will hold,\" he told the Dutch parliament.As the fourth anniversary of Russia's full scale invasion approaches, Maxim Timchenko says Russia has repeatedly targeted DTEK's energy grid with \"waves of drones, cruise and ballistic missiles\" and his company has found it difficult to cope.Tens of thousands of people in the southern city of Odesa have been without electricity for three days this week, following a co-ordinated Russian attack.ReutersMuch of Odesa has been without power in recent days\"Life has been difficult, but people are very supportive of each other,\" says Yana, who is among those lucky enough still to have power. She has invited friends to her home to charge their phones.Power outages also cut off heat and water supplies and Yana says those still connected to the grid have offered strangers the chance to wash or take a shower.Across Ukraine electricity is being rationed – with supplies turned on for a few hours each day.Many Ukrainians rely on power banks and generators as a back-up, and the sound of generators in the capital is now more constant than the air raid warnings.Kyiv resident Tetiana says the first thing she does in the morning is to check her phone to find out the daily schedule for when her power will be switched on. Like many she has invested in power banks to make life more bearable:\"You need to remember when you leave home to leave the powerbanks on so that you have them charged when you get back home.\"ShutterstockMany Ukrainians rely on powerbanks and generators during regular power cutsAbout 50% of Ukraine's energy is currently supplied by three large nuclear power plants in central and western Ukraine. But the network that transfers that power has been severely damaged.DTEK runs about 5 power stations, most of them fuelled by coal.One was recently targeted by five 5 ballistic missiles and Mr Timchenko said some of their power plants and sub stations had been attacked \"every three or four days\".\"I don't remember a single day when I had no reports about some damage to our grid.\"Matthew Goddard/BBCDTEK chief executive Maxim Timchenko says his company has found it hard to copeFinding spare parts to repair damaged equipment has become a significant challenge.The energy provider used to be able to source equipment from within Ukraine, but now it has to scour the ret of Europe for replacement parts.This year DTEK has had to spend $166m (£123m) on repairing its damaged thermal power plants and coal facilities.\"We will not give up,\" Maxim Timchenko insists: \"We have a responsibility to millions of mothers to have power and heat\".DTEK's origins are in the Donbas in Eastern Ukraine where the fighting is fiercest and where power supplies have been disrupted the most. Eight of its engineers have been killed doing their job.\"Every day they risk their lives to keep power in this area,\" Mr Timchenko said.Additional reporting by Anastasia Levchenko and Kyla Herrmannsen.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ukraine struggling to keep lights on under Russian attack, says energy boss",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c2f8/live/5cf15330-da7a-11f0-b60a-5db3d22facb6.jpg"
      ],
      "datePublished": "2025-12-16T12:54:00.000Z",
      "dateModified": "2025-12-16T12:54:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]