[
  {
    "title": "Martin O'Neill leaves with Celtic's thanks as well as a new tracksuit",
    "url": "https://www.bbc.com/sport/football/articles/ckg941rn8r6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b5be/live/2eb60b00-d0ac-11f0-b487-79c943b69f96.jpg",
    "tag": "Trending",
    "date": "2025-12-04T01:01:28.000Z",
    "description": "He came. He conquered. He nicked a tracksuit.Martin O'Neill's return to Celtic has been anything but dull. Box office news conferences, an Old Firm cu",
    "body": "He came. He conquered. He nicked a tracksuit.Martin O'Neill's return to Celtic has been anything but dull. Box office news conferences, an Old Firm cup semi-final victory, a revival of fortunes in the league, and line after line lapped up by the adoring Parkhead support.The adulation for the 73-year-old pours out of the place, and on Wednesday, it was gushing on his final bow as Wilfried Nancy prepares to take charge. After Celtic's 1-0 win over Dundee brought them level with Hearts at the top of the Scottish Premiership, O'Neill led a lap of honour around Celtic Park, players applauding him in his wake, and he played to the gallery singing his name. \"These players have been absolutely fantastic and that's why they are champions,\" he told the crowd. \"It's been a privilege.\"Back in the guts of the Celtic Park main stand speaking to the media, O'Neill's form mirrored that of the team he's helped haul back on the rails.\"Do you know what? I'm going to take the tracksuit,\" he told the press pack. \"Steven, the kit man, he doesn't know, but I'm putting this in the bag.\"Seriously, absolutely. I'm definitely taking this.\"O'Neill, much like predecessor Brendan Rodgers, is a showman. The self-deprecating Northern Irishman might have carried himself with a humble air of astonishment over these last few weeks, but his presence has been a PR and coaching masterstroke. The wily old fox, his patter and his influence has juxtaposed a disconnect between the board and the stands. Fan disruption at the recent club AGM led to it being abandoned, and during Rodgers' final months, protests were a regular thing. Fury and venom at Celtic's calamitous attempt at a Champions League bid and a transfer window has spewed and sparked like hot lava from sections of the support.O'Neill's arrival was a gear change. It provided a unity and a serene calm in the midst of discombobulation and disquiet. Eight games, seven wins, and a League Cup final reached. Celtic have gone from being eight points off the top to level with Hearts and hold a game in hand. It's not all been swashbuckling like it was in Rotterdam - when they beat Feyenoord in the Europa League - but ways to win have been found.\"It's like a complete blur,\" said O'Neill after claiming it's been \"the time of his life\" back at Celtic.\"I was secretly hoping that Easter Road [against Hibernan last Sunday] was going to be the last game, so I didn't want to make a mess of it tonight.\"It wasn't the most flamboyant of victories. But three points on the board keeps it going. How did Hearts do?\"O'Neill's bombshell arrival hauled Celtic out of one hole. But some could argue his fond farewell - and timing of it - puts a bit of pressure the man coming behind him.The veteran boss arrived in Glasgow claiming he had no claims on taking the job permanently. Whether secretly he harboured ambitions to the contrary we will never know. But there was a steady warming from some fans that O'Neill, who has proven the safest of safe hands, should stick about for longer. At the very least, be given the chance to lead Celtic out against St Mirren in the League Cup final a week on Sunday.Instead, Nancy will come in faced with a run of fixtures which will require him to hit the ground running like an Olympic sprinter. On Sunday, leaders Hearts come to Celtic. That is followed by Serie A giants Roma coming to Glasgow on Thursday. Then that final at Hampden. Celtic could finish that hat-trick of games top of the league, heading towards the Europa League knockouts, and with a trophy in the cabinet.Or, they may not. For any new manager coming in, it's a colossal baptism of fire to try and navigate your way through. O'Neill remaining in post may have alleviated that instant pressure, but faith has been put in his replacement.Celtic's season has been righted, and O'Neill will leave with his heralded legacy intact, and if anything, improved. It's a tough act for Nancy to follow.The club legend leaves behind a Celtic team with a renewed identity. He leaves behind a support with renewed belief. He leaves behind a high bar. He does not leave behind a tracksuit.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Martin O'Neill leaves with Celtic's thanks as well as a new tracksuit",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b5be/live/2eb60b00-d0ac-11f0-b487-79c943b69f96.jpg"
      ],
      "datePublished": "2025-12-04T01:01:28.000Z",
      "dateModified": "2025-12-04T01:01:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Did we get too excited, too soon about Hearts?",
    "url": "https://www.bbc.com/sport/football/articles/c2ep3j4g004o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/acdb/live/6a180400-d0a7-11f0-995d-7baeef489b2e.jpg",
    "tag": "Trending",
    "date": "2025-12-04T00:33:48.000Z",
    "description": "Little over a month ago, observers outside of Scottish football were looking in at a potential storybook season unfolding at Tynecastle.A statement 3-",
    "body": "Little over a month ago, observers outside of Scottish football were looking in at a potential storybook season unfolding at Tynecastle.A statement 3-1 win for leaders Hearts over reigning champions Celtic had opened up an eight-point gap at the Scottish Premiership summit. A title challenge was on.Six games later, the Edinburgh side's advantage has vanished, with a trip to Parkhead looming on Sunday and Celtic having played a game fewer.Victory in the east end of Glasgow will refuel talk of a title push from Derek McInnes' side, but the past month has served as a reality check.Wednesday's draw with Kilmarnock was a fourth in the last six games and was greeted with a little bit of discontent from the stands.\"There was a bit of booing, probably borne from frustration,\" said former Hearts winger Neil McCann on Sportscene.\"They've not won since 1 November and Celtic are putting a bit of pressure on. They play both the Old Firm and having the Edinburgh derby coming up, too.\"The Hearts support made a habit of belting out 'we shall not moved' throughout a stunning start to the campaign. There was even footage of head coach McInnes joining in.Carried away too early? That is certainly what some will say, but why shouldn't those scenes have unfolded?Nobody has the right to police the emotion within a fanbase, although the past few weeks have been a harsh reminder of the scale of the task when it comes to a non-Old Firm side maintaining a lead, never mind winning a title.Of course, nothing is ruled out at this stage. Yes, Hearts are now level on points with an unconvincing Celtic, but McInnes' men are still top.They have only lost once in 15 games. They have still scored six more goals than the second-placed Parkhead side. They are still nine points clear of Rangers.Although it feels unlikely given their current run of one win in six matches, a seismic victory at Celtic Park on Sunday would have the outsiders peeking back through their curtains again.Brendan Rodgers was Celtic boss when McInnes' side overwhelmed the Glasgow club at Tynecastle in late October.That was the Northern Irishman's final match in charge, a shock resignation coming the following day.Legendary Celtic boss Martin O'Neill returned as interim manager to pick up the pieces and led the team to five straight league wins, closing the gap at the top.Coupled with that has been Hearts' stuttering league form. Since beating Celtic they have won just once - a 4-0 victory over struggling Dundee.Celtic have not pulled up trees with some league displays but have found the results, while goals have become a recent issue for the leaders.Hearts have failed to score in two of their past four games, netting just twice in that run, and they were made to pay for failing to put the game to bed in Wednesday's 1-1 draw with Kilmarnock.\"Hearts were always going to go through a spell where they wouldn't win games but they're not losing them and that's key,\" said Sportscene pundit Scott Allan.\"They are coming away from these games with a point and they all add up.\"Experienced manager McInnes never got carried away in the face of the media when Hearts were seemingly threatening to make the impossible possible.A win on Sunday wouldn't sweep him away either. Nor will he be too downbeat if it is another result that does not go his way.He is expecting Celtic to have a \"lift\" from the arrival of new manager Wilfried Nancy, whose first game will be on Sunday.This season has already shown signs that an exciting new era for Hearts - and the Scottish game - could be on the way.However, the past month has only highlighted how challenging that ambitious journey will be.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Did we get too excited, too soon about Hearts?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/acdb/live/6a180400-d0a7-11f0-995d-7baeef489b2e.jpg"
      ],
      "datePublished": "2025-12-04T00:33:48.000Z",
      "dateModified": "2025-12-04T00:33:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Poison Water",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002mshv?at_mid=hccWjMbQd4&at_campaign=Poison_Water&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002mshv&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Poison_Water&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mgrl3w.jpg",
    "tag": "Trending",
    "date": "2025-11-26T06:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomePoison WaterPoison WaterWhen tap water turns toxic in Cornwall, a public health disaster leads to accusations of a cover-up and the search for the truth. The story of Britain’s biggest mass poisoning. Duration1h 18mFirst shown9pm 26 Nov 2025Available for 11 monthsWatchlistAudio DescribedSign Language",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Poison Water",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mgrl3w.jpg"
      ],
      "datePublished": "2025-11-26T06:00:00.000Z",
      "dateModified": "2025-11-26T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Did Donald Trump fall asleep at a cabinet meeting? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mldr2g?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-12-03T18:45:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·03 Dec 2025,·34 minsDid Donald Trump fall asleep at a cabinet meeting?AmericastAvailable for over a yearIn Trump’s last cabinet meeting of the year, we hear the US Defense Secretary Pete Hegseth - under pressure over possible war crimes in the Carribean Sea - give his fullest explanation yet over what he knew, and when. Citing the “fog of war” in a chaotic situation, Hegseth said he “did not personally see survivors” after a deadly strike on an alleged drug boat in the Carribean, amid concerns that US forces may have violated laws governing armed conflict.  \nSarah, Anthony and Justin unpack Hegseth’s explanation, and where it leaves Trump’s ongoing dispute with the Venezuelan president, Nicolas Maduro.  \nWe also hear Trump’s tirade against Somalian immigrants and why he doesn’t want them in the United States, telling reporters they are “garbage” who should go back to where they came from and that “their country is no good for a reason”. Americast looks at the reasons behind Trump's outburst, and how immigration authorities will now be targeting Minnesota’s large Somali community.  \nAnd - did Trump fall asleep during Tuesday's cabinet meeting? \nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Anthony Zurcher, North America Correspondent\nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by George Dabby and Grace Reeve.  The technical producer was Dafydd Rees. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Did Donald Trump fall asleep at a cabinet meeting? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-12-03T18:45:00.000Z",
      "dateModified": "2025-12-03T18:45:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Is Russia Really Ready For War With Europe? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mldzp8?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-03T19:13:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·03 Dec 2025,·44 minsIs Russia Really Ready For War With Europe?NewscastAvailable for over a yearToday, NATO ministers have been meeting to discuss the US’s 28-point plan for peace between Russia and Ukraine after Russia rejected the plan and said it was “ready” for war with Europe.\nAdam is joined by Europe editor, Katya Adler and the Economist’s defence editor, Shashank Joshi to discuss what President Putin’s statement means for a divided NATO.\nPlus Faisal Islam, BBC Economics Editor, joins the conversation to discuss the UK’s possible involvement in a new European defence fund and the government’s latest suggestions it could be looking to get closer to the EU again. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Kris Jalowiecki. The social producer was Joe Wilkinson. The technical producer was Dafydd Evans. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Is Russia Really Ready For War With Europe? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-03T19:13:00.000Z",
      "dateModified": "2025-12-03T19:13:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steve Cropper, guitarist of Booker T and the MGs, dies aged 84",
    "url": "https://www.bbc.com/news/articles/cx2gqd05geno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0205/live/e11860c0-d0b3-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-12-04T02:20:18.000Z",
    "description": "2 hours agoChris GrahamReutersSteve Cropper was part of the house band of influential Memphis label Stax RecordsSteve Cropper, the legendary guitarist",
    "body": "2 hours agoChris GrahamReutersSteve Cropper was part of the house band of influential Memphis label Stax RecordsSteve Cropper, the legendary guitarist with Booker T and the MGs, has died at the age of 84.The musician, who played on and co-wrote Otis Redding's Sittin' On the Dock of the Bay and Wilson Pickett's In the Midnight Hour, died on Wednesday in Nashville, the Associated Press reported, citing a source who was informed by Cropper's family.Considered among the best backing bands in soul music, the quartet Booker T & the MGs was the house band of influential Memphis label Stax Records and is best remembered for their 1962 track Green Onions. Cropper also joined the John Belushi-Dan Aykroyd act The Blues Brothers in the late 1970s and played on their hit cover of Soul Man.\"Steve was a beloved musician, songwriter, and producer whose extraordinary talent touched millions of lives around the world,\" his family said in a statement, according to Rolling Stone magazine.\"While we mourn the loss of a husband, father, and friend, we find comfort knowing that Steve will live forever through his music,\" they added.A cause of death was not immediately known.Associate Eddie Gore told the AP he was with Cropper on Tuesday in Nashville, where he had been working on new music. \"He's such a good human,\" Gore said. \"We were blessed to have him, for sure.\"Getty ImagesSteve Cropper, right, with Sheryl Crow and Eddie FloydNamed the second-best guitarist of all time by British music magazine Mojo in 1996, Cropper began working at Stax Records in 1961 at the age of 20.A year later, the MGs were founded, comprising keyboardist Booker T Jones, drummer Al Jackson and bassist Lewie Steinberg - who was replaced by Donald \"Duck\" Dunn in 1964.The band was inducted into the Rock and Rock Hall of Fame in 1992.\"I've always thought of myself as a rhythm player,\" Cropper said in an interview with Guitar.com in 2021.\"I get off on the fact that I can play something over and over and over, while other guitar players don't want to even know about that. They won't even play the same riff or the same lick twice.\"As well as a guitarist, Cropper was a prolific songwriter, and in addition to Dock of the Bay and In the Midnight Hour, he co-wrote Eddie Floyd's Knock on Wood. According to Cropper's website, he was \"involved in virtually every record issued by Stax from the fall of 1961 through year end 1970\".\"We would literally spend 15 hours a day in the studio,\" Cropper told the Guardian in 2012. \"I think we had 17 or 18 artists on the roster, so we had a pretty busy schedule.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steve Cropper, guitarist of Booker T and the MGs, dies aged 84",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0205/live/e11860c0-d0b3-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-12-04T02:20:18.000Z",
      "dateModified": "2025-12-04T02:20:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'Face ID in every town' and 'Kate's great herr do'",
    "url": "https://www.bbc.com/news/articles/cpq4e5jzjqpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d6ab/live/e510f9e0-d0ad-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-04T01:18:47.000Z",
    "description": "3 hours agoBBCThe Daily Telegraph leads on government proposals for police to expand the use of facial recognition to fight crime across the UK. The p",
    "body": "3 hours agoBBCThe Daily Telegraph leads on government proposals for police to expand the use of facial recognition to fight crime across the UK. The paper describes it as a \"police plan for face ID in every town\". Labour wants to provide forces with access to Britain's passport database to catch criminals and it \"could be deployed in every city, town and village\". And the Telegraph joins many of Thursday's papers in carrying photos of the state banquet for German President Frank-Walter Steinmeier at Windsor - with Catherine, Princess of Wales, in a purple gown widely pictured.For the Sun, it's \"Kate's great herr do\" at the state banquet that makes a splash. The paper also reports the home secretary wants to extend opening hours for pubs during next year's World Cup. It is \"sup for the cup\", says the headline.The Times says a government review is to study rising diagnoses of ADHD and mental health conditions as it seeks a fresh crackdown on welfare spending. The paper reports the inquiry will ask if normal feelings and stresses are being \"overpathologised\".Conservative leader Kemi Badenoch's claim the government's business rate rise means Sir Keir Starmer is on a \"mission to crush\" High Street hospitality businesses leads the Daily Express. A Treasury spokesperson told the paper it backs the industry and highlighted a £4.3bn support package and the 25% cap on corporation tax.Thomas Markle, father of the Duchess of Sussex, is \"fighting for life\" after emergency surgery in the Philippines, reports the Daily Mail. His son, Thomas Jr, told the paper that the 81-year-old had undergone three hours of surgery and had been in an intensive care unit.A culture of bullying that harmed patient safety was \"allowed to flourish\" at \"scandal-hit\" NHS hospital Blackpool Victoria, writes the Guardian after a report from the Royal College of Physicians. In political news, the paper reports Reform UK leader Nigel Farage has said he is aiming for a \"reverse takeover\" of the Conservatives by \"winning over defectors\" from the party.The i Paper says Russian spies are \"secretly entering UK on cargo ships\" at docks in Torquay, Middlesbrough and Grangemouth. The men then visit areas with military bases and critical infrastructure, it writes in an investigation. The Independent leads on its investigation with Channel 4 into formaldehyde, which it says thousands of NHS staff are being exposed to, putting their health at risk. It also says No 10 has derided a \"war threat\" from Vladimir Putin, with a spokesperson for the prime minister calling it \"Kremlin claptrap\".The Financial Times says bond investors have warned the US Treasury of the \"risk\" of picking Kevin Hassett as Fed chair. It says they feared \"he would cut interest rates aggressively to please Donald Trump\". In British economic news, HSBC has appointed a new chair \"ending a chaotic search process that left the crucial role vacant for months\", says the FT.The Daily Mirror leads with a photo from inside Jeffrey Epstein's \"island lair\". The images of the convicted paedophile's property were released by House Democrats.The Daily Star headlines on evicted I'm a Celebrity... Get Me Out of Here! star Kelly Brook's reunion with her husband. \"I hope walls aren't thin\" in the hotel, she has said.Metro celebrate a \"formula win\" after the prime minister announced parents will save £500 a year\" on baby formula. The paper had run a campaign called \"Formula for Change\" to tackle the \"soaring cost\" of baby milk.Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'Face ID in every town' and 'Kate's great herr do'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d6ab/live/e510f9e0-d0ad-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-04T01:18:47.000Z",
      "dateModified": "2025-12-04T01:18:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Investigation into pre-Budget leaks is under way, MPs told",
    "url": "https://www.bbc.com/news/articles/c4g9e7wp79zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ba48/live/54e3c280-d0c6-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-12-04T00:12:53.000Z",
    "description": "4 hours agoJosh MartinBusiness reporterReutersEV levies, tourist taxes, pension changes and income tax policy were announced in the Budget on 26 Novem",
    "body": "4 hours agoJosh MartinBusiness reporterReutersEV levies, tourist taxes, pension changes and income tax policy were announced in the Budget on 26 November, but were reported by media beforehandChancellor Rachel Reeves is backing an inquiry into pre-Budget leaks from the Treasury which knocked business and consumer confidence and moved markets.The chief secretary to the Treasury told the Commons on Wednesday an inquiry into pre-Budget leaks was under way,  led by top Treasury civil servant James Bowler and had \"the full support of the chancellor\".Policies such as a freezing of income tax thresholds, a pay-per-mile levy on electric vehicles and a tourist tax were all reported in the lead-up to the Budget on 26 November. A downgrade of UK productivity from the Office for Budget Responsibility, and a plan to raise income tax rates, later abandoned, were also briefed to media.Speaker Sir Lindsay Hoyle criticised the leaks, branding it the \"hokey-cokey Budget,\" and reminded the government that policy should be announced first to the Commons.James Murray, chief secretary to the Treasury, told the Commons: \"The government puts the utmost weight on Budget security, including prevention of leaks of information. \"A leak inquiry is now under way with the full support of the chancellor and the whole Treasury team.\"Mr Bowler would investigate the \"security processes to inform future fiscal events\", Mr Murray said.The Chair of the Treasury Select Committee, Dame Meg Hillier MP, said: \"Leak inquiries have a habit of not finding someone responsible. But if somebody is found responsible, will they follow the lead set by Richard Hughes [and resign]?\"Mr Murray responded saying he would \"not speculate on the outcome of the leak inquiry\".'Unhelpful' speculationThe steady flow of headlines around taxation and forecasts for the economy also influenced the bond markets, which dictates the interest rates the UK pays on its debt.A pre-Budget survey by Barclays pointed to more than half of business leaders saying they had delayed investment decisions until after the two-month lead-up to the Budget.\"Hundreds of thousands\" of people drew down part of their pension savings prematurely ahead of this Budget and the previous one because they were worried about what might be in it, the boss of one of the UK's biggest pension providers told Radio 4's Today programme. Mark FitzPatrick, chief executive of the FTSE 100 wealth manager St James's Place, said: \"The run-up to the Budget this time...there was a lot of speculation...and people act on speculation.\"The flying of kites is unhelpful when it affects people's lives.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Investigation into pre-Budget leaks is under way, MPs told",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ba48/live/54e3c280-d0c6-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-04T00:12:53.000Z",
      "dateModified": "2025-12-04T00:12:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Court sides with Adidas in appeal over Kanye West collaboration",
    "url": "https://www.bbc.com/news/articles/cqjg7w8z7dvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/87b5/live/a706d300-d0ac-11f0-b487-79c943b69f96.jpg",
    "tag": "Trending",
    "date": "2025-12-04T02:51:49.000Z",
    "description": "2 hours agoOsmond ChiaBusiness reporterAdidas has fended off an appeal from shareholders who accused it of hiding misconduct by rapper-entrepreneur Ka",
    "body": "2 hours agoOsmond ChiaBusiness reporterAdidas has fended off an appeal from shareholders who accused it of hiding misconduct by rapper-entrepreneur Kanye West - otherwise known as Ye - before their partnership broke down in 2022.A San Francisco court said the sportswear giant did not mislead investors, who claimed they had lost money after Adidas shares plunged when it cut ties with West.The Yeezy tie-up with West had been one of Adidas' most successful partnerships, but its collapse after a spate of anti-Semitic comments by the rapper cost the brand hundreds of millions of dollars.The BBC has contacted Adidas for comment but could not reach the firm leading the class action or West's team.West, who is not party to the lawsuit, was widely criticised after repeatedly making antisemitic remarks and promoting conspiracy theories.His Yeezy brand collaboration with Adidas was put under review after he showed a \"White Lives Matter\" T-shirt design at a fashion show in 2022. Shortly after, he posted anti-Semitic comments online, which prompted Adidas to pull his products from sale.West's behaviour also prompted several companies, including Gap and JP Morgan, to sever ties with the rapper.Court documents filed on Wednesday show that HLSA-ILA Funds, the firm representing investors, alleged that Adidas continued its partnership with West despite knowing about his controversial conduct for years.The filing claims Adidas \"internally grappled\" with West's behaviour but misled shareholders by failing to disclose the risk in its reports.The 9th US Circuit Court of Appeals in San Francisco ultimately sided with Adidas. The court said on Wednesday that a reasonable investor would know that a partnership with a celebrity like West could come with \"inherent risks relating to improper behaviour\".A district court had previously dismissed HLSA-ILA's case, and the firm later appealed.The collapse of Adidas' partnership with West caused the German firm's share price to tank in 2023.Yeezy, luxury sneakers designed by West, had been a particularly lucrative line of products for Adidas, generating around €1.5bn (£870m; $1.17bn) in sales in 2021.The partnership breakdown left Adidas with more than €1bn worth of Yeezy shoes sitting in storage. In 2023, the brand announced that it would sell those products and donate some of the proceeds to charities who worked on combating hate.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Court sides with Adidas in appeal over Kanye West collaboration",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/87b5/live/a706d300-d0ac-11f0-b487-79c943b69f96.jpg"
      ],
      "datePublished": "2025-12-04T02:51:49.000Z",
      "dateModified": "2025-12-04T02:51:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Streeting orders review into mental health and ADHD diagnosis",
    "url": "https://www.bbc.com/news/articles/ce8q26q2r75o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/15c4/live/2ca58ea0-d0b9-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-04T03:51:55.000Z",
    "description": "Health Secretary Wes Streeting is to launch an independent review into rising demand for mental health, ADHD, and autism services in England. Streetin",
    "body": "Health Secretary Wes Streeting is to launch an independent review into rising demand for mental health, ADHD, and autism services in England. Streeting has previously suggested mental health conditions are being \"overdiagnosed\", and the government has argued that increased pressure on the system has led to long waits for people with an urgent need for help.He said: \"We must look at this through a strictly clinical lens to get an evidence-based understanding... That's the only way we can ensure everyone gets timely access to accurate diagnosis and effective support.\"The Department of Health and Social Care (DHSC) said the review is being launched alongside extra funding of £688m but it also comes as ministers seek to tackle a growing welfare bill. Earlier this year, the government was forced to climbdown on planned cuts to disability benefits, including for those with mental health conditions, after facing major backlash from more than 100 of Labour's own backbenchers. But on Monday, the prime minister promised a renewed push on reforming the welfare system, which is said had \"trapped people in poverty\" and \"wrote young people off as too ill to work\".Led by clinical psychologist Prof Peter Fonagy, the new review's findings will be published in Summer 2026.Prof Fonagy said the aim was \"to test assumptions rigorously and listen closely to those most affected, so that our recommendations are both honest and genuinely useful\".As of March this year, around four million working-age adults in England and Wales claimed either disability or incapacity benefit - up from almost three million in 2019, according to research from the Institute for Fiscal Studies (IFS). The DHSC said the increased pressure on the NHS \"means that for too long, people with acute needs have faced long waits, had to navigate overstretched services, experienced inequalities in care and felt abandoned when support was needed most\".Mental health charity Mind welcomed the government's announcement and signalled their willingness to contribute to the review.\"This is a huge opportunity to really understand what is driving increasing levels of mental illness, especially among our young people,\" chief executive Dr Sarah Hughes said.President of the Royal College of Psychiatrists, Dr Lade Smith, called for the review to \"rigorously identify gaps in care\" while considering the \"many complex reasons\" people reach out for help.The National Autistic Society said: \"We need urgent action because, while we are currently seeing the number of people seeking an assessment levelling out, the average waiting time is rocketing.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Streeting orders review into mental health and ADHD diagnosis",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/15c4/live/2ca58ea0-d0b9-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-04T03:51:55.000Z",
      "dateModified": "2025-12-04T03:51:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Drunk raccoon found passed out on liquor store floor after breaking in",
    "url": "https://www.bbc.com/news/articles/cy8jnxxm70jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6f8d/live/38da3f80-d0c4-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-12-03T23:28:26.000Z",
    "description": "Staff at a Virginia liquor store got a shock on Saturday when they came into work to find a raccoon had burgled the store, drinking its way through th",
    "body": "Staff at a Virginia liquor store got a shock on Saturday when they came into work to find a raccoon had burgled the store, drinking its way through the spirits section.The \"masked bandit\" was found passed out in the bathroom between the toilet and bin having helped itself to bottles on a bottom shelf.Animal control officer Samantha Martin transported the \"suspect\" for questioning at Hanover County Animal Protection and Shelter but not before it had a chance to sober up.After a few hours of sleep and zero signs of injury (other than maybe a hangover), the animal was safely released back into the wild.The Ashland ABC store had been closed for Thanksgiving when it suffered its \"Black Friday break-in\".When staff arrived on Saturday they found smashed bottles and liquor pooling on the floor, including its apparent tipple of choice, scotch. Officer Martin said the animal had fallen through one of the ceiling tiles before going \"on a full-blown rampage, drinking everything\". Only one blurry CCTV image of the boozy break-in exists, so it's unknown just how much alcohol the thirsty creature consumed before passing out in the bathroom.In a social media post, the store thanked Hanover County Animal Protection and Shelter for its professionalism and providing its visitor with a \"sober ride home\".Officer Martin said it was \"just another day in the life of an animal control officer\". ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Drunk raccoon found passed out on liquor store floor after breaking in",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6f8d/live/38da3f80-d0c4-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-03T23:28:26.000Z",
      "dateModified": "2025-12-03T23:28:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Patients clogging up A&E with hiccups, sore throats and niggles",
    "url": "https://www.bbc.com/news/articles/c74xqn2zg1eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f384/live/af6f0f00-d069-11f0-8039-b97ff13472bc.jpg",
    "tag": "Trending",
    "date": "2025-12-04T01:34:07.000Z",
    "description": "3 hours agoNick TriggleHealth correspondentPatients are being warned not to clog up A&E with everyday niggles as NHS figures show thousands turned to ",
    "body": "3 hours agoNick TriggleHealth correspondentPatients are being warned not to clog up A&E with everyday niggles as NHS figures show thousands turned to hospitals for minor ailments such as hiccups and ingrowing toenails last winter.There were more than 200,000 A&E attendances in England from November to February for conditions that could have been dealt with elsewhere, according to NHS England.This represents more than 2% of all attendances during that four-month period, taking up vital resources at under-pressure A&Es, health bosses said.Patients with such minor conditions are being advised to seek help elsewhere, including from pharmacists, GPs and NHS 111 – either via the phone or online – as some of them can be managed at home.Between 1 November 2024 and 28 February 2025, NHS figures show there were:6,382 visits for nasal congestion 83,705 visits for earache 96,998 visits for sore throats3,890 visits for ingrowing nails8,669 for itching skin384 for hiccupsThe attendances were to either major A&E units or minor injury units run by hospitals.Research shows one of the factors driving unnecessary A&E visits is difficulty accessing GP services, with latest figures showing more than a fifth of patients cannot get through to their GP on the day they try.NHS England said patients can get prescription-only medication – traditionally dispensed by GPs – at pharmacies for a range of common conditions, including a sore throat, sinusitis and earache.It is also releasing a video entitled '24 Hours Not In A&E' as part of a social media campaign to help avoid unnecessary visits to A&E departments and GPs.NHS England urgent and emergency care director Julian Redhead said: \"The last place a patient wants to be when they have a minor illness is in a busy A&E – so this winter we're working hard to expand the number of routes into the NHS so patients can get fast and convenient care closer to them.\"Whether the services are online, over the phone or in person, a variety of doorways to care are open across the NHS.\"As always, use A&E & 999 for life-threatening conditions and serious injuries.\"GP Dr Ellie Cannon, who appears in NHS England's social media video, said patients should remember they can contact their GP through their websites rather than relying on phone lines.\"Knowing where to get the care you need can make all the difference,\" she said.\"It's common for people to default to the 8am scramble for a GP appointment, or go to A&E, as it's what feels most familiar – but there are many far more convenient and quicker ways to handle your health concern while you get on with your day.\"She said contacting GPs through their websites could be quicker and easier alongside using pharmacies and NHS 111.GP practices in England were ordered to offer online booking from October and figures released this week show more than 98% now do. Those systems allow patients to ask questions as well as request appointments.But the change has provoked opposition from the British Medical Association (BMA) which has warned it could put patients at risk because GPs could become overwhelmed assessing online queries.It comes as the NHS in England starts to publish its winter monitoring statistics on Thursday. They will provide a snapshot of how hospitals are coping, including the number of patients on wards with flu, how long ambulances are queuing for outside A&E and bed occupancy rates.Last month, NHS England chief executive Sir Jim Mackey warned this winter could be one of the toughest the health service has faced as rates of flu started rising early amid what appears to the spread of a severe strain.The NHS is also facing the prospect of more strikes by resident doctors, who were previously called junior doctors.BMA members are staging a five-day walkout from 17 December.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Patients clogging up A&E with hiccups, sore throats and niggles",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f384/live/af6f0f00-d069-11f0-8039-b97ff13472bc.jpg"
      ],
      "datePublished": "2025-12-04T01:34:07.000Z",
      "dateModified": "2025-12-04T01:34:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What latest Ukraine talks reveal about Putin's state of mind",
    "url": "https://www.bbc.com/news/articles/cpq4e21nr5vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a3a9/live/085d6ac0-d0c5-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-12-03T15:40:06.000Z",
    "description": "13 hours agoSteve RosenbergBBC Russia editorWhat does the latest round of diplomacy on Ukraine tell us about Russian President Vladimir Putin's mood a",
    "body": "13 hours agoSteve RosenbergBBC Russia editorWhat does the latest round of diplomacy on Ukraine tell us about Russian President Vladimir Putin's mood and intentions?For starters, that he's not ready to sign a peace deal. At least, not right now.And certainly not the deal (or deals) on the table.\"No compromise version has yet been found,\" commented Kremlin foreign policy aide Yuri Ushakov after five hours of talks in Moscow involving Putin, US envoy Steve Witkoff, and Donald Trump's adviser and son-in-law Jared Kushner.No compromise is no real surprise, considering the Kremlin leader's uncompromising comments in recent days. In various statements he has condemned the Ukrainian leadership as a \"thieving junta\", accused European leaders of trying to sabotage peace efforts, and insisted that Russia holds the initiative on the battlefield.On a couple of recent occasions Russian TV showed Putin in military fatigues, studying maps of the front line and trumpeting military gains, many of which Ukraine and international observers have denied.After nearly four years of Russia's full-scale invasion of Ukraine, despite the heavy losses Russia has suffered on the battlefield and the damage to the Russian economy, President Putin seems convinced that he is winning this war and that now is not the moment to stop.At least, that is what he would like the West to believe: that nothing can stop him now from achieving his goals.I've said before that, in many ways, Vladimir Putin reminds me of a car with no brakes, no steering wheel and no reverse gear; a vehicle careering full speed down the motorway.Nearly four years after the full-scale invasion of Ukraine there is still no sign of the \"Putinmobile\" turning off, turning back, or coming to a halt.He certainly wants his opponents to think that nothing or no one can force him to change direction: neither European leaders, nor the Trump administration, nor President Zelensky.But cars need fuel (a constant supply).And, to fight a war, countries need money (a constant supply).For now, despite international sanctions, Russia's government is still able to finance the \"special military operation\" - its war on Ukraine. But economic pressures are building: revenues from oil and gas have been falling, the budget deficit growing.Even Putin admits there are problems, referring to \"imbalances\" in the economy.\"In several sectors, production output not only failed to increase this year but actually decreased,\" Putin said this week. \"Are we satisfied with such trends? No.\"The big unknown: at what point, if at all, will economic concerns start to influence the Kremlin's calculations on the battlefield?",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What latest Ukraine talks reveal about Putin's state of mind",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a3a9/live/085d6ac0-d0c5-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-03T15:40:06.000Z",
      "dateModified": "2025-12-03T15:40:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Miley Cyrus engaged to musician boyfriend Maxx Morando ",
    "url": "https://www.bbc.com/news/articles/cwypwxprjd4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c591/live/d6a49660-d07f-11f0-92b0-9b1b6ce7fb6f.jpg",
    "tag": "Trending",
    "date": "2025-12-03T23:24:33.000Z",
    "description": "Miley Cyrus has confirmed her engagement to her partner of four years, musician Maxx Morando. The three-time Grammy winner was seen wearing a gold and",
    "body": "Miley Cyrus has confirmed her engagement to her partner of four years, musician Maxx Morando. The three-time Grammy winner was seen wearing a gold and diamond ring on her engagement finger at the premiere of Avatar: Fire and Ash in Los Angeles on Monday.In an interview with US TV show Good Morning America on Wednesday, the 33-year-old said Morando had got down on one knee for the proposal during a recent trip to Asia.\"I am not easy to surprise because I love to control every situation and I had completely surrendered and I'm telling you, I was so, so, so surprised,\" she said.Cyrus, whose hits include Flowers and Party in the U.S.A, previously married Australian actor Liam Hemsworth in 2018. The couple had been in a relationship for a decade but announced their divorce in 2019. Speaking to British Vogue in 2023, Cyrus said she and 27-year-old Morando met after being \"put on a blind date\". Morando is a drummer with LA-based band Liily. The band participated in NBC's Miley's New Year's Eve Party - hosted by Cyrus - in 2022, alongside musicians including Cyrus's godmother Dolly Parton and David Byrne.Holding up her ring, Cyrus told Good Morning America that Morando \"did good\" with the choice.\"Me and Max have been together for four years and it's very obvious the drastic amount of growth that I've had in those four years,\" she said.\"You want to have someone by your side that always tells you you can do it.\"The pop star's latest song, Dream as One, is featured in the latest Avatar instalment. She released her ninth album earlier this year but has said she has \"no desire\" to go on tour, saying she is put off by how hard it is to maintain sobriety and her mental health while on the road.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Miley Cyrus engaged to musician boyfriend Maxx Morando ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c591/live/d6a49660-d07f-11f0-92b0-9b1b6ce7fb6f.jpg"
      ],
      "datePublished": "2025-12-03T23:24:33.000Z",
      "dateModified": "2025-12-03T23:24:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]