[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ukrainecast - Q&A: Tomahawk missiles, the drone race, and Ukrainian Halloween - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0m91pv4?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0kwvwyl.jpg",
    "tag": "Trending",
    "date": "2025-10-16T17:10:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·16 Oct 2025,·27 minsQ&A: Tomahawk missiles, the drone race, and Ukrainian HalloweenUkrainecastAvailable for over a yearAs Volodymyr Zelensky prepares to make his latest pitch to Donald Trump at the White House on Friday, the US is yet to announce a decision on the delivery of long range Tomahawk missiles to Ukraine. Could Washington have given the green light behind the scenes already? Are Ukrainian claims of frontline counteroffensives being exaggerated? And which side is coming out on top when it comes to drone technology?\nTo answer your questions, Lucy is joined by BBC Verify’s Olga Robinson and Mikey Kay from The Security Brief on the BBC news channel. The team also discuss Russian attacks on energy infrastructure, Nato military exercises and Halloween celebrations in Ukraine.\nToday’s episode is presented by Lucy Hockings.\nThe producers were Laurie Kalus and Julia Webster. The technical producer was Jonny Baker. The social producer was Joe Wilkinson. The series producer is Chris Flynn. The senior news editor is Sam Bonham.\nEmail Ukrainecast@bbc.co.uk with your questions and comments. You can also send us a message or voice note via WhatsApp, Signal or Telegram to +44 330 1239480\nYou can join the Ukrainecast discussion on Newscast’s Discord server here: tinyurl.com/ukrainecastdiscordProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ukrainecast - Q&A: Tomahawk missiles, the drone race, and Ukrainian Halloween - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0kwvwyl.jpg"
      ],
      "datePublished": "2025-10-16T17:10:00.000Z",
      "dateModified": "2025-10-16T17:10:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-10-18T04:45:18.000Z",
    "description": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and p",
    "body": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-10-18T04:45:18.000Z",
      "dateModified": "2025-10-18T04:45:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sir David Attenborough is oldest Daytime Emmy winner for Secret Lives of Orangutans",
    "url": "https://www.bbc.com/news/articles/c1lqnjpvr79o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3a00/live/8613c530-ac27-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-18T14:14:35.000Z",
    "description": "Sir David Attenborough has broken the record for the oldest winner of a Daytime Emmy award for his work on documentary Secret Lives of Orangutans.The ",
    "body": "Sir David Attenborough has broken the record for the oldest winner of a Daytime Emmy award for his work on documentary Secret Lives of Orangutans.The 99-year-old came out top in the outstanding daytime personality, non-daily category, with the Netflix film - which follows a group of apes living in the jungles of Sumatra, Indonesia - also coming away with two other awards.Sir David beat the record previously held by actor Dick Van Dyke, who was 98 when he won the guest performer in a daytime drama series category in 2024. The 52nd annual Daytime Emmys was held on Friday in Pasadena, California, but Sir David - who is eight months away from his 100th birthday - was not in attendance.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sir David Attenborough is oldest Daytime Emmy winner for Secret Lives of Orangutans",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3a00/live/8613c530-ac27-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-18T14:14:35.000Z",
      "dateModified": "2025-10-18T14:14:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Louisiana resident assisted in Hamas 7 October attack, US says",
    "url": "https://www.bbc.com/news/articles/cdx495n0qn9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c5f9/live/bc023a50-ac27-11f0-a20e-778f714a31ba.jpg",
    "tag": "Trending",
    "date": "2025-10-18T14:02:48.000Z",
    "description": "US prosecutors have accused a Louisiana resident of participating in the 7 October attack by Hamas on Israel, recently unsealed court documents show. ",
    "body": "US prosecutors have accused a Louisiana resident of participating in the 7 October attack by Hamas on Israel, recently unsealed court documents show. Mahmoud Amin Ya'qub al-Muhtadi, 33, allegedly armed himself and joined a paramilitary group that fought alongside Hamas in the 2023 attack that saw about 2,000 people killed and 251 taken as hostages. At least 67,900 people have been killed by Israeli attacks in Gaza since then, according to the territory's Hamas-run health ministry, whose figures are seen by the UN as reliable.A year after the attack, Mr al-Muhtadi allegedly travelled to the US on a fraudulent visa and became a permanent resident. He was charged with providing, attempting to provide or conspiring to provide material support to a foreign terrorist organization, and the fraud and misuse of a visa or other documents.Mr al-Muhtadi was allegedly an operative of the National Resistance Brigades, the military wing of the Democratic Front for the Liberation of Palestine, according to the complaint brought by the FBI. He is accused of coordinating a \"group of armed fighters\" to cross into Israel after hearing about the attack and asked one man to \"bring the rifles\", court documents show. Mr al-Muhtadi sent messages asking others to bring a bulletproof vest for another man and ammunition, prosecutors allege.   Hours after the 7 October attack began, his phone pinged a cell tower near Kibbutz Kfar Aza, the sight of a massacre, the documents said. The complaint said that Mr al-Muhtadi denied ever having been involved in terrorist activities on his US visa application.  After coming to the US, he lived in a handful of places before landing in Lafayette, Louisiana, where he worked in a local restaurant.He was arrested on Thursday, the Justice Department said. During a court appearance in Louisiana on Friday, he was asked if he understood the charges against him. An interpreter translated his response as: \"Yes, but there are a lot of things mentioned here that are so false, I'm innocent,\" according to the New York Times. The documents do not accuse Mr al-Muhtadi of specific crimes or killings. Federal prosecutors have previously charged senior members of Hamas with the deaths of American citizens on 7 October. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Louisiana resident assisted in Hamas 7 October attack, US says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c5f9/live/bc023a50-ac27-11f0-a20e-778f714a31ba.jpg"
      ],
      "datePublished": "2025-10-18T14:02:48.000Z",
      "dateModified": "2025-10-18T14:02:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lady Annabel Goldsmith dies aged 91",
    "url": "https://www.bbc.com/news/articles/cn40xq2xgn5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3c23/live/2f704430-ac16-11f0-a687-b9c529d97293.jpg",
    "tag": "Trending",
    "date": "2025-10-18T14:10:58.000Z",
    "description": "2 hours agoTony GrewLondonGetty ImagesAnnabel's nightclub in Mayfair was named after Lady Annabel GoldsmithLady Annabel Goldsmith, the socialite and c",
    "body": "2 hours agoTony GrewLondonGetty ImagesAnnabel's nightclub in Mayfair was named after Lady Annabel GoldsmithLady Annabel Goldsmith, the socialite and campaigner who gave her name to a famous 1960s London nightclub, has died aged 91.Lady Annabel was the mother of six children from her two marriages, including Zac, who was Conservative MP for Richmond Park for eight years and who ran for mayor of London in 2016. Her youngest child Ben said she was \"quite simply irreplaceable\". He added: \"We are bereft, not for her – because her life has been extraordinary and complete - but for us, because of the immense hole in our lives she leaves behind.\"Hulton Archive via Getty ImagesLady Annabel with her children Ben, Zac, Jemima and Jane in 1981 Mr Goldsmith said: \"I spoke to her every day for 45 years, she truly had my back and we loved each other very much. I will miss her terribly.\"Annabel's, which was opened by her first husband in 1963 and was one of London's first modern nightclubs, was named in her honour. It was popular with the British aristocracy and celebrities in the 1960s and 1970s.Born in London in 1934 into an Anglo-Irish aristocratic family, Annabel Vane-Tempest-Stewart was the daughter of Viscount Castlereagh, who later became The 8th Marquess of Londonderry. She became Lady Annabel in February 1949, when her father became marquess. Getty ImagesLady Annabel's son Zac ran for mayor of London in 2016Lady Annabel was the mother of Rupert, Robin and India Jane with her first husband, hospitality industry entrepreneur Mark Birley: they were married from 1954 to 1979.She then married financier Sir James Goldsmith and they had three children: Jemima, Zac and Ben Goldsmith. Jemima is the former wife of Imran Khan, an international cricketer who served as prime minister of Pakistan from 2018 to 2022. Lady Annabel was a campaigner and advocate for a range of causes, including the countryside, animal charities and working to lessen the impact of HIV/AIDS on children in South Africa.In 2004 she published her memoirs Annabel: An Unconventional Life, where she recalled her aristocratic childhood, glamorous social life in 1960s Swinging London to her role as matriarch and grandmother. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lady Annabel Goldsmith dies aged 91",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3c23/live/2f704430-ac16-11f0-a687-b9c529d97293.jpg"
      ],
      "datePublished": "2025-10-18T14:10:58.000Z",
      "dateModified": "2025-10-18T14:10:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eleven killed after Israel hits bus in Gaza, Hamas-run civil defence says",
    "url": "https://www.bbc.com/news/articles/cpv1nk7dy4yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/59d2/live/17878350-ac30-11f0-969d-e546dac1b2a4.jpg",
    "tag": "Trending",
    "date": "2025-10-18T14:39:50.000Z",
    "description": "2 hours agoHugo BachegaMiddle East correspondent  , JerusalemGaza's Hamas-run civil defence says 11 people were killed, all from the same family, afte",
    "body": "2 hours agoHugo BachegaMiddle East correspondent  , JerusalemGaza's Hamas-run civil defence says 11 people were killed, all from the same family, after the bus they were in was hit by an Israeli tank shell in northern Gaza.The Abu Shaaban family, it said, were trying to reach their home to inspect it when the incident happened in the Zeitoun neighbourhood of Gaza City on Friday night.This is the deadliest single incident involving Israeli soldiers in Gaza since the start of the ceasefire eight days ago.The Israeli military said soldiers had fired at a \"suspicious vehicle\" that had crossed the so-called yellow line demarcating the area still occupied by Israeli forces in Gaza.Israeli soldiers continue to operate in more than half of the Gaza Strip, under the terms of the first phase of the ceasefire agreement.Civil defence spokesman Mahmud Bassal told AFP news agency the victims were members of the Abu Shaaban family and were killed while \"trying to check on their home\" in the area.The dead included women and children, according to the civil defence.The Israel Defence Forces (IDF) said a \"suspicious vehicle was identified crossing the yellow line and approaching IDF troops operating in the northern Gaza Strip\" on Friday, prompting it to fire \"warning shots\" towards the vehicle.It said the vehicle \"continued to approach the troops in a way that caused an imminent threat to them\" and \"troops opened fire to remove the threat, in accordance with the agreement.\"Hamas said the family had been targeted without justification.The IDF has warned Palestinians from entering areas in Gaza still under its control. With limited internet access, many Palestinians do not know the position of Israeli troops as the yellow demarcation line is not physically marked, and it is unclear if the area where the bus was travelling did cross it.The BBC has asked the IDF for coordinates of the incident.Israeli Defence Minister Israel Katz said on Friday the army would set up visual signs to indicate the location of the line.In a separate development, Hamas on Friday released the body of Israeli hostage Eliyahu Margalit to the Red Cross, which returned it to Israel.Mr Margalit was the tenth deceased hostage to be returned from Gaza. The remains of another 18 people are yet to be repatriated. Israel handed the bodies of 15 more Palestinians over to officials in Gaza via the Red Cross, the Hamas-run health ministry said, bringing the total number of bodies it has received to 135.There has been anger in Israel that Hamas has not returned all of the dead hostages' bodies, in line with last week's ceasefire deal - though the US has downplayed the suggestion it amounts to a breach.The IDF has stressed that Hamas must \"uphold the agreement and take the necessary steps to return all the hostages\".Hamas has blamed Israel for making the task difficult because Israeli strikes have reduced so many buildings to rubble and it does not allow heavy machinery and diggers into Gaza to be able to search for the hostages' bodies.As part of the US-brokered ceasefire deal, Israel freed 250 Palestinian prisoners in Israeli jails and 1,718 detainees from Gaza.Hamas also returned all 20 living hostages to Israel. The Israeli military launched a campaign in Gaza in response to the 7 October 2023 attack, in which Hamas-led gunmen killed about 1,200 people in southern Israel and took 251 others hostage.At least 67,900 people have been killed by Israeli attacks in Gaza since then, according to the territory's Hamas-run health ministry, whose figures are seen by the UN as reliable.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eleven killed after Israel hits bus in Gaza, Hamas-run civil defence says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/59d2/live/17878350-ac30-11f0-969d-e546dac1b2a4.jpg"
      ],
      "datePublished": "2025-10-18T14:39:50.000Z",
      "dateModified": "2025-10-18T14:39:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "George Santos: 'Have a great life!' Trump orders prison release of disgraced ex-congressman",
    "url": "https://www.bbc.com/news/articles/cy5q3439xpqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/93db/live/56e06400-abb2-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-18T05:45:54.000Z",
    "description": "US President Donald Trump has commuted the sentence of George Santos, a former Republican congressman serving seven years in prison for fraud and iden",
    "body": "US President Donald Trump has commuted the sentence of George Santos, a former Republican congressman serving seven years in prison for fraud and identity theft. In a post on social media, Trump said Santos \"has been horribly mistreated\", adding: \"Therefore, I just signed a Commutation, releasing George Santos from prison, IMMEDIATELY. Good luck George, have a great life!\"The former lawmaker was only the sixth in US history to be expelled from Congress, after a damning ethics report in 2023. Santos, who admitted to stealing the identities of 11 people, including his own family members, was released on Friday night, US media reported. He served less than three months of a seven-year sentence.\"God bless President Donald J Trump,\" said one of Santos's lawyers, Joseph Murray, following Trump's announcement.In April when Santos was sentenced a judge told him: \"You got elected with your words, most of which were lies.\"He reportedly cried in court and begged for forgiveness, saying: \"I cannot rewrite the past, but I can control the road ahead.\"Prosecutors argued that the novice politician had lied about his background and misused campaign funds to finance his lifestyle.In his post, Trump justified the move by criticising a Democratic lawmaker, Senator Richard Blumenthal, whom he accused of fabricating his US military service. \"This is far worse than what George Santos did, and at least Santos had the Courage, Conviction, and Intelligence to ALWAYS VOTE REPUBLICAN!\" Trump wrote.Trump has previously called for an investigation into Blumenthal over the claim. The Democrat has acknowledged that he misspoke on numerous occasions about his time in the military, but has said the mishaps were more than a decade old. \"This allegation of 15 years ago has been really rejected by the voters of Connecticut three times, overwhelmingly re-electing me,\" Blumenthal told CNN earlier this month. Santos's downfall began in 2022, after the New York Times published an investigation revealing the freshman congressman had lied about his CV, including having a university degree and working for Citigroup and Goldman Sachs.From there, the lies continued to pile up, including allegations that he stole money from a fundraiser for a dying dog and that he lied about his mother surviving the 9/11 terrorist attacks. Shortly afterwards, local and federal officials began to investigate.He was eventually charged with 23 federal felony crimes, and in 2023 became the first expelled member of Congress in more than 20 years, and only the sixth in history.A report from the House ethics panel accused him of misusing campaign funds for personal benefits, including Botox and subscriptions on the OnlyFans website.Santos defeated a Democratic incumbent in 2022, flipping the district that encompasses parts of New York's Long Island and Queens, where he grew up.Earlier this week, Santos published an open letter to Trump in the South Shore Press newspaper in Long Island, repeating his plea to be pardoned. The letter, which was titled a \"passionate plea to President Trump\" asked for \"the opportunity to return to my family, my friends, and my community.\"He wrote that he had been kept in solitary confinement after a death threat in August, and apologised for his actions. \"Mr President, I am not asking for sympathy. I am asking for fairness - for the chance to rebuild,\" he wrote.\"I know I have made mistakes in my past. I have faced my share of consequences, and I take full responsibility for my actions. \"But no man, no matter his flaws, deserves to be lost in the system, forgotten and unseen, enduring punishment far beyond what justice requires.\"Santos began serving his sentence in July at a minimum-security jail in New Jersey.Trump has issued pardons to at least two other former Republican lawmakers since returning to office in January.In May, he pardoned former congressman Michael Grimm, who pleaded guilty in 2014 to tax crimes.He also pardoned former Connecticut Governor John Rowland, who pleaded guilty in 2004 to corruption and fraud charges.Commutations do not void criminal convictions, unlike a pardon.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "George Santos: 'Have a great life!' Trump orders prison release of disgraced ex-congressman",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/93db/live/56e06400-abb2-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-18T05:45:54.000Z",
      "dateModified": "2025-10-18T05:45:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Galleri test: Exciting results from blood test for 50 cancers ",
    "url": "https://www.bbc.com/news/articles/c205g21n1zzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f714/live/07276060-aba5-11f0-bba9-81f28efa2a1e.jpg",
    "tag": "Trending",
    "date": "2025-10-18T07:13:48.000Z",
    "description": "9 hours agoFergus WalshMedical editorA blood test for more than 50 types of cancer could help speed up diagnosis, according to a new study.Results of ",
    "body": "9 hours agoFergus WalshMedical editorA blood test for more than 50 types of cancer could help speed up diagnosis, according to a new study.Results of a trial in North America show that the test was able to identify a wide range of cancers, of which three-quarters don't have any form of screening programme.More than half the cancers were detected at an early stage, where they are easier to treat and potentially curable.The Galleri test, made by American pharmaceutical firm Grail, can detect fragments of cancerous DNA that have broken off a tumour and are circulating in the blood. It is currently being trialled by the NHS.The trial followed 25,000 adults from the US and Canada over a year, with nearly one in 100 getting a positive result. For 62% of these cases, cancer was later confirmed.  Lead researcher Dr Nima Nabavizadeh, associate professor of radiation medicine at Oregon Health & Science University, said the data showed that the test could \"fundamentally change\" their approach to cancer screening. He explained that it could help detect many types of cancer \"earlier, when the chance of successful treatment or even cure are the greatest\".The test correctly ruled out cancer in over 99% of those who tested negative.  When combined with breast, bowel, lung and cervical screening it increased the number of cancers detected overall seven-fold.  Crucially, three-quarters of cancers detected were those which have no screening programme such as ovarian, liver, stomach, bladder and pancreatic cancer.The blood test correctly identified the origin of the cancer in nine out of 10 cases.These impressive results suggest the blood test could eventually have a major role to play in diagnosing cancer earlier.But scientists not involved in the research say more evidence is needed to show whether the blood test reduces deaths from cancer.Clare Turnbull, professor of translational cancer genetics at The Institute of Cancer Research, London, said: \"Data from randomised studies, with mortality as an endpoint, will be absolutely essential to establish whether seemingly earlier-stage detection by Galleri translates into benefits in mortality.\"The topline results are to be released at the European Society for Medical Oncology congress in Berlin on Saturday, but the full details have yet to be published in a peer-reviewed journal.Much will depend on the results of a three-year trial involving 140,000 NHS patients in England, which will be published next year.The NHS has previously said that if the results are successful, it would extend the tests to a further one million people.Sir Harpal Kumar, president of biopharma at Grail called the results \"very compelling\".  Speaking to BBC Radio 4's Today programme, he said: \"The vast majority of people who die from cancer do so because we find their cancers too late.\"Many cancers are found when they are \"already very advanced\" he added, explaining that the aim is to \"shift to earlier detection, when we have the chance to use treatments that are much more effective and potentially curative\".But Naser Turabi of Cancer Research UK cautioned that further research is needed to \"avoid overdiagnosing cancers that may not have caused harm\". \"The UK National Screening Committee will \"play a critical role in reviewing the evidence and determining whether these tests should be adopted by the NHS,\" he added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Galleri test: Exciting results from blood test for 50 cancers ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f714/live/07276060-aba5-11f0-bba9-81f28efa2a1e.jpg"
      ],
      "datePublished": "2025-10-18T07:13:48.000Z",
      "dateModified": "2025-10-18T07:13:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tory MP George Freeman reports deepfake defection video to police",
    "url": "https://www.bbc.com/news/articles/c62e7xz02dpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9002/live/d1f49450-ac0b-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-18T12:51:07.000Z",
    "description": "3 hours agoOwen SennittLocal Democracy reporterA Tory MP says he has reported a deepfake video depicting him announcing he had joined Reform UK to the",
    "body": "3 hours agoOwen SennittLocal Democracy reporterA Tory MP says he has reported a deepfake video depicting him announcing he had joined Reform UK to the police.George Freeman said he remained \"the Conservative MP for Mid Norfolk and have no intention of joining Reform or any other party\", denouncing the video circulating on social media as \"an AI-generated deepfake\".Freeman said he reported the video to the authorities. Norfolk Police and Facebook have been approached for comment. \"This sort of political disinformation has the potential to seriously distort, disrupt and corrupt our democracy,\" he added.In the widely-circulated video, the MP appeared to say \"the time for half measures is over\" and that the \"Conservative party had lost its way\" after announcing he had joined Reform, according to the Local Democracy Reporting Service.In response, Freeman said: \"The video is a fabrication, created without my knowledge or consent, and uses my image and voice without permission.\"\"Regardless of my position as an MP, that should be an offence.\"Freeman has been a Conservative MP since 2010 and served in various ministerial capacities in the previous government.Most recently, he was Minister of State in the Department for Science, Innovation and Technology. He said: \"I do not know whether this incident was a politically motivated attack by political opponents or just a dangerous prank, but it is clear that in recent months there has been a huge increase in political disinformation, disruption and extremism – on both the left and the right, by religious extremists, by dangerous influencers like Andrew Tate, and anti-democratic disrupters.\"I have reported this matter to the relevant authorities, and I urge anyone who sees the video to report it immediately rather than share it further.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tory MP George Freeman reports deepfake defection video to police",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9002/live/d1f49450-ac0b-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-18T12:51:07.000Z",
      "dateModified": "2025-10-18T12:51:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Londonderry: 90-year-old woman graduates from university",
    "url": "https://www.bbc.com/news/articles/cx24kkxgwxlo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6c3e/live/cab7ac40-a909-11f0-99b2-a3801a157d90.jpg",
    "tag": "Trending",
    "date": "2025-10-14T14:30:41.000Z",
    "description": "Great-grandmother graduates from university at 90 years old4 days agoRobbie MeredithEducation and arts correspondent, BBC News NIThe Open University90",
    "body": "Great-grandmother graduates from university at 90 years old4 days agoRobbie MeredithEducation and arts correspondent, BBC News NIThe Open University90-year-old Maryette McFarland graduated from the Open University on TuesdaySeventy years after starting her studies, Maryette McFarland from Londonderry was finally able to graduate from university with a degree in English Literature.\"I can hardly believe it, and it's taken me quite a long time,\" she said.The 90 year old was the oldest of more than 300 graduates at the Open University's ceremony in Belfast on Tuesday.And her story is one of determination, patience and a little help from friends, tutors and family.'I had a bit of time to spare'Ms McFarland had originally started university in Dublin back in the 1960s, but love intervened before she finished her degree.She said she dropped out of her course and got married instead. Although it took a few years, she decided to study again with the Open University while recovering from a car accident.\"I had a bit of time to spare and I thought I'd like to do something,\" Ms McFarland told BBC News NI.Studying online had proved a challenge at times. However, she said her family - including her four children, and grandchildren and great-grandchildren - had been \"wonderful\".\"I'm very bad online but I had a lot of help from the family,\" she said, adding that her daughter-in-law taught her how to type. \"I know they're there if I want them and they help me in every way they can.\"But, you know, I think they think for granny to have a degree, it's a bit odd!\"Ms McFarland also said she had a \"lovely\" tutor who provided \"a lot of support\". 'It's never too late'Her eldest daughter Shauna Gailey accompanied her mother to the graduation ceremony in the Waterfront Hall.\"I am just so proud of her,\" Ms Gailey said.\"She is a B.A. undergraduate full-on at the age of 90, that's just so exciting for her and for the rest of us.\"She's always regretted not finishing the Trinity Dublin degree, we all knew that, but she had four children, she had a busy life and all the rest of it.\"Ms Gailey said her mother had really thrown herself into her studies. \"She used to sit on her sofa, surrounded by piles of books, with her laptop and tablet in front of her,\" she recalled.All of the family came to Belfast \"for a big family lunch\", before watching Maryette graduate.And Maryette had a message for anyone who thinks they are too old to learn new things.\"If I can do it, anybody can do it. It's never too late.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Londonderry: 90-year-old woman graduates from university",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6c3e/live/cab7ac40-a909-11f0-99b2-a3801a157d90.jpg"
      ],
      "datePublished": "2025-10-14T14:30:41.000Z",
      "dateModified": "2025-10-14T14:30:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zelensky fails to secure Tomahawk missiles at talks with Trump",
    "url": "https://www.bbc.com/news/articles/c93dqew8l3xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e77b/live/0f8fc3a0-ab87-11f0-a7be-25e543799ac8.jpg",
    "tag": "Trending",
    "date": "2025-10-18T07:42:19.000Z",
    "description": "9 hours agoBernd Debusmannat the White House andJohn SudworthKyivPresident Volodymyr Zelensky appears to have come away empty-handed from a White Hous",
    "body": "9 hours agoBernd Debusmannat the White House andJohn SudworthKyivPresident Volodymyr Zelensky appears to have come away empty-handed from a White House meeting after US President Donald Trump indicated he was not ready to supply sought-after Tomahawk cruise missiles to Ukraine.Zelensky said after the cordial bilateral talks that he and Trump had talked about long-range missiles, but decided not to make statements on the issue \"because the United States does not want an escalation\".Following the meeting, Trump took to social media to call for Kyiv and Moscow to \"stop where they are\" and end the war.The Trump-Zelensky meeting came a day after Trump spoke with Russian President Vladimir Putin by phone and agreed to meet him in Hungary soon.Zelensky believes using Tomahawks to strike at Russian oil and energy facilities would severely weaken Putin's war economy. While Trump did not rule it out, his tone at the White House on Friday was non-committal. \"Hopefully they won't need it, hopefully we'll be able to get the war over without thinking about Tomahawks,\" the US president said, adding: \"I think we're fairly close to that.\"He described the weapons as \"a big deal\" and said that the US needed them for its own defence. He also said that supplying Tomahawks to Ukraine could mean a further escalation in the conflict, but that discussions about sending them would continue. Asked by the BBC if the Tomahawks had prompted Putin to meet Trump, the US president said: \"The threat of that [the missiles] is good, but the threat of that is always there.\"The Ukrainian leader suggested his country could offer drones in exchange for the Tomahawks, prompting smiles and nodding from Trump.Zelensky also complimented Trump on his role in securing the first phase of a peace deal in the Middle East, suggesting the US leader could build on that momentum to help end Russia's war in Ukraine. After the meeting, Zelensky was asked by a reporter outside the White House if he thought Putin wanted a deal or was just buying time with the planned meeting with Trump in Budapest. \"I don't know,\" he said, adding that the prospect of Ukraine having Tomahawks had caused Russia to be \"afraid because it is a strong weapon\".Asked if he was leaving Washington more optimistic that Ukraine would get the Tomahawks, he said: \"I am realistic.\"The Ukrainian leader also appeared to suggest he would be amenable to Trump's suggestion of stopping the war along the current front line.\"We have to stop where we are, he is right, the president is right,\" Zelensky said. He added that the step after that would be \"to speak\". He later posted on X, saying that he had called European leaders to share details of the meeting with Trump, adding that the \"main priority now is to protect as many lives as possible, guarantee security for Ukraine, and strengthen all of us in Europe.\"UK Prime Minister Keir Starmer said the call with European leaders was \"productive\" and promised that \"the UK will continue to send humanitarian aid and military support\".While Trump had shown an openness to the idea of selling the Tomahawks in recent days, Putin warned that such a move would further strain the US-Russian relationship.On Thursday, Trump said \"great progress\" was made during a phone call with Putin, with the pair agreeing to face-to-face talks soon in Hungary - although no date has been set.Asked by a reporter on Friday if he was concerned Putin might be playing for time by agreeing to a new summit, Trump said: \"I am.\"\"But I've been played all my life by the best of them, and I came out really well. So, it's possible, a little time, it's alright. But I think that I'm pretty good at this stuff. I think that he wants to make a deal,\" he said.When asked by another reporter whether Zelensky would be involved in the prospective talks in Budapest, Trump - who was sat beside the Ukrainian president  said there was \"bad blood\" between Putin and Zelenksy. \"We want to make it comfortable for everybody,\" Trump said. \"We'll be involved in threes, but it may be separated.\" He added that the three leaders \"have to get together\". The US president said his call, the first with Putin since mid-August, was \"very productive\", adding that teams from Washington and Moscow would meet next week.Trump had hoped a face-to-face summit in Alaska in August would help convince Putin to enter into comprehensive peace talks to end the war, but that meeting failed to produce a decisive breakthrough.They spoke again days later when Trump interrupted a meeting with Zelensky and European leaders to call Putin.Back in Ukraine, the BBC spoke on Friday to a couple repairing the small store they own in a suburb of Kyiv, after it was obliterated by Russian missiles last month.When the store-owner, Volodymyr, was asked about Trump's forthcoming summit meeting with Putin, he began to say: \"We appreciate all support\".But he stepped away as tears welled up in his eyes. After a long pause, he composed himself and started again.\"Truth and democracy will win, and all the terrorism and evil will disappear,\" he said. \"We just want to live, we don't want to give up, we just want them to leave us alone.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zelensky fails to secure Tomahawk missiles at talks with Trump",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e77b/live/0f8fc3a0-ab87-11f0-a7be-25e543799ac8.jpg"
      ],
      "datePublished": "2025-10-18T07:42:19.000Z",
      "dateModified": "2025-10-18T07:42:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Virginia Giuffre brother calls on King to strip Andrew of prince title",
    "url": "https://www.bbc.com/news/articles/cdegkd00yz3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9408/live/7109ed20-ab98-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-18T15:16:18.000Z",
    "description": "57 minutes agoGeorge WrightReutersPrince Andrew speaks with King Charles at the funeral of Katharine, Duchess of Kent, in September The brother of Vir",
    "body": "57 minutes agoGeorge WrightReutersPrince Andrew speaks with King Charles at the funeral of Katharine, Duchess of Kent, in September The brother of Virginia Giuffre has called on King Charles to strip Prince Andrew of the title \"prince\" after he announced he is giving up his other titles, including the Duke of York.Ms Giuffre alleged she was forced to have sex with the prince on three occasions, including when she was aged 17 at the home of his friend Ghislaine Maxwell in London in 2001.The prince made a financial payment to Ms Giuffre in an out-of-court settlement in 2022, after she had brought a civil case against him. He denies all the accusations against him. Sky Roberts told BBC Newsnight his sister, who took her own life earlier this year, would be \"very proud\" of the latest development regarding Prince Andrew.The prince has been under increasing pressure over his links with sex offender Jeffrey Epstein, with calls for Buckingham Palace to take action against him.On Friday, the prince announced that he was deciding to voluntarily hand back his titles and to give up membership of the Order of the Garter, the oldest and most senior order of chivalry in Britain.He will also cease be the Duke of York, a title received from his mother, the late Queen Elizabeth II. But Mr Roberts said he would like to see the King go a step further, saying: \"We would call on the King to potentially go ahead and take out the prince in the Andrew.\"\"I think anybody that was implicated in this should have some sort of resolve. They should have some sort of responsibility and accountability for these survivors,\" he said, adding that he would \"welcome any contact from the King, from members of parliament\".When Prince Andrew was born in 1960, he was automatically a prince as the son of a monarch. This could only be changed if a Letters Patent was issued by the King.Virginia RobertsMs Giuffre alleged that the prince had sex with her when she was 17 years old, at his friend Ghislaine Maxwell's house in London in 2001In his statement on Friday, Prince Andrew said: \"In discussion with the King, and my immediate and wider family, we have concluded the continued accusations about me distract from the work of His Majesty and the Royal Family.\"I have decided, as I always have, to put my duty to my family and country first.\"I stand by my decision five years ago to stand back from public life.\"With His Majesty's agreement, we feel I must now go a step further. I will therefore no longer use my title or the honours which have been conferred upon me. As I have said previously, I vigorously deny the accusations against me.\"He said he continued to \"vigorously deny the accusations against me\".The prince had already ceased to be a \"working royal\" and had lost the use of his HRH title and no longer appeared at official royal events. His role now will be even more diminished.Getty ImagesVirginia Giuffre took her own life earlier this yearThe prince has faced a series of scandals over recent years, including a court case he settled with Ms Giuffre.Next week a posthumous memoir by Ms Giuffre will be published. It is likely to cast further attention on Prince Andrew's involvement with her and Epstein.Ms Giuffre claimed that she was one of many vulnerable girls and young women who had been sexually exploited by Epstein and his circle of wealthy connections.She alleged that she was forced to have sex with the prince at the house of his friend Ghislaine Maxwell in London in 2001, when Ms Giuffre was 17 years old.Her memoir describes two other occasions on which she alleges she was forced to have sex with Prince Andrew - in Epstein's townhouse in New York and on Epstein's private island in the US Virgin Islands.Ms Giuffre's brother, Mr Roberts, told BBC Newsnight: \"We have shed a lot of happy and sad tears today. I think happy because in a lot of ways this vindicates Virginia.\" \"All the years of work that she put in is now coming to some sort of justice, and these monsters can't escape from it - the truth will find its way out.\"He said this was \"a moment where survivors are not staying quiet any more\".\"It's just a joyous moment for them because we're finally getting some sense of acknowledgement, like 'this actually happened, what we're saying is the truth',\" Mr Roberts added.He said there was \"so much more to be accomplished, especially here in the United States\".Prince Andrew spoke to BBC Newsnight in 2019Prince Andrew has faced intense scrutiny over his links with disgraced financier Epstein, more recently including questions about when he had really cut off contact.In a now-infamous BBC Newsnight interview in 2019, Prince Andrew said that he had severed all links with Epstein after they had been photographed together in New York in December 2010.But emails sent in February 2011 later emerged suggesting that he had privately stayed in touch with Epstein, including sending a message that read: \"Keep in close touch and we'll play some more soon!\"Prince Andrew is expected to stay in his Windsor home, Royal Lodge, on which he has his own private lease which runs until 2078.His ex-wife will be known as Sarah Ferguson and no longer Duchess of York, but their daughters will continue to have the title of princess.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Virginia Giuffre brother calls on King to strip Andrew of prince title",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9408/live/7109ed20-ab98-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-18T15:16:18.000Z",
      "dateModified": "2025-10-18T15:16:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anger as historic Clyde ship towed out to sea and sunk in Hawaii",
    "url": "https://www.bbc.com/news/articles/cn7em5p087vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/df07/live/3c22e370-ab78-11f0-acd1-6bae268efee4.jpg",
    "tag": "Trending",
    "date": "2025-10-18T08:18:31.000Z",
    "description": "8 hours agoCalum WatsonBBC ScotlandGetty ImagesThe Honolulu Harbour Board wanted the ship removed so it could redevelop the harbourA historic Clydebui",
    "body": "8 hours agoCalum WatsonBBC ScotlandGetty ImagesThe Honolulu Harbour Board wanted the ship removed so it could redevelop the harbourA historic Clydebuilt sailing ship has been towed out to sea off the coast of Hawaii and deliberately sunk, prompting outrage from maritime conservation groups.Falls of Clyde, built in 1878, had been moored as a museum ship in Honolulu since the 1960s but had fallen into a poor state of repair. The Honolulu Harbour Board confirmed it had the ship towed into deep water about 25 miles offshore on Wednesday and then scuttled.The news has been met with anger and dismay by campaigners who have spent more than a decade trying to bring the ship back to its birthplace to rebuild it.Falls of Clyde was the first in a series of eight iron-hulled ships built in the late 19th Century by the Port Glasgow shipbuilder Russell & Co.The ship spent many years carrying various cargoes to and from the Far East and Australasia before moving to Hawaii. Hawaii Department of TransportationFalls of Clyde was towed out of Honolulu Harbour at dawn and scuttled in deep waterIn the early 20th Century it had steel tanks fitted and was converted into a tanker to carry paraffin to the islands, where it later became a floating fuel depot before being acquired by a museum in Honolulu. But the ship was badly damaged by a hurricane in the 1980s, the maritime section of the museum closed down and for years it has been left slowly decaying.Enthusiasts in Scotland have spent a decade trying to bring the ship home for restoration, but were unable to reach an agreement with the harbour board which wants to redevelop the quay where it was moored.  The Hawaii Department of Transportation said the operation to remove the ship began at dawn on Wednesday and it was sunk about 25 miles south of the harbour. It said the vessel's name, wheel and bell were retained along with other artifacts which will be put on display.'A day that will go down in infamy'The destruction of the historic ship has been widely criticised by maritime conservation groups both in the UK and the USA. Friends of Falls of Clyde, a group of supporters in Hawaii, described it as \"a day that will go down in infamy\". \"It is almost inconceivable that this situation has been allowed to happen,\" the group posted on social media.The group organised a farewell ceremony with bagpipers on Tuesday after learning that the ship was to be sunk the following morning. The Tall Ship Glenlee, the charity that looks after another Clydebuilt sailing vessel moored beside Glasgow's Riverside Museum, said it was \"deeply saddened\".David O'Neill, from the Scotland based Save Falls of Clyde campaign, said he was \"horrified\" at the behaviour of the authorities in Hawaii but had become resigned to the ship meeting such a fate after years of fruitless negotiation. A 19th Century oil painting of Falls of Clyde when it sailed in the Far EastHe first became involved in efforts to rescue the ship in 2015 when someone in Hawaii alerted him to its condition, prompting him to post an appeal on social media saying: \"Old Scottish lady needs a lift home.\"A Norwegian firm which operates heavy lift ships offered to transport Falls of Clyde back to Scotland for free, but the campaign was soon embroiled in a wrangle with the harbour board over insurance costs and other conditions. Earlier this year Mr O'Neill said an American firm won a contract to remove the ship from the  harbour and it also offered to transport it to Scotland for free.\"They didn't want to sink the ship - they had a conscience and a respect for maritime heritage,\" he said. But the deal between the firm and the harbour board fell through, and the contract went instead to another company which then carried out the scuttling. The Hawaii Department of Transportation has been contacted for comment. Getty ImagesFalls of Clyde was part of a maritime museum for decades before it fell into decayMr O'Neill said he had seen a video showing the final moments of Falls of Clyde. \"She was towed out of harbour looking really elegant and stunning for a 147-year-old ship, unaided, not needing any pumps,\" he said. \"She was still afloat and for us that's representative that she was truly Clydebuilt.\"He said he found watching the ship go down \"quite disturbing\". \"She goes down by the stern and most of the ship lifts out of the water, like in the Titanic movie.\"The businessman is now concentrating his efforts on trying to bring home a Clydebuilt ship from a different era - the Type 21 frigate HMS Ambuscade. The warship was built for the Royal Navy at the Yarrow shipyard in Glasgow in the 1970s, and saw action in the Falklands War.  It later sold to the Pakistan Navy where it served until it was decommissioned two years ago. Mr O'Neill said he secured the frigate for free after making a \"cheeky request\" to the Pakistani government, and he is working on plans to return it to the Clyde to become a museum ship. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anger as historic Clyde ship towed out to sea and sunk in Hawaii",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/df07/live/3c22e370-ab78-11f0-acd1-6bae268efee4.jpg"
      ],
      "datePublished": "2025-10-18T08:18:31.000Z",
      "dateModified": "2025-10-18T08:18:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Award-winning Wrexham Spaniel sniffing out wildlife crime",
    "url": "https://www.bbc.com/news/articles/c14pll3pd70o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3e59/live/36830b30-aa87-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-17T05:16:39.000Z",
    "description": "Award for dog, abandoned five times but now solving wildlife crime1 day agoMatthew RichardsBBC WalesBBCHenry was a \"lost soul\" who found his purpose a",
    "body": "Award for dog, abandoned five times but now solving wildlife crime1 day agoMatthew RichardsBBC WalesBBCHenry was a \"lost soul\" who found his purpose as a detection dogA \"superdog\" rejected from five homes for his energetic nature has won an international award for his ability to help catch criminals and save wildlife.Henry, a 10-year-old Springer Spaniel, has been named Animal of the Year by the International Fund for Animal Welfare (IFAW), which recognises the unsung heroes of animal welfare.He was rescued by Louise Wilson, of Conservation K9 Consultancy in Wrexham, at eight months old when he was a \"lost soul\" struggling to find a home.Now Henry can detect seven scents, ranging from birds of prey to hedgehogs, helping police track down those involved in wildlife crime.Henry can locate bird carcasses and even small monitoring tags removed from birds, and his nose has helped police target criminals who kill or steal birds of prey. Although not a police dog, he has been invaluable to the National Wildlife Crime Unit (NWCU) in their work protecting birds of prey. Det Insp Mark Harrison, from the NWCU,  said Henry's work is crucial in helping police to gather evidence for potential crimes. \"If we don't recover anything, the investigation grinds to a halt,\" he said.\"We had a search recently and underneath a load of heather where you couldn't see a thing from the surface, Henry recovered a tiny bird's skull.\"Det Insp Harrison also said intelligence showed that offenders are \"scared and worried\" by the work being done by animals like Henry. Henry can detect seven different scents including hedgehogs and pine martensAs well as working with police, Henry also helps conservationists with \"ecological monitoring\", including for pine martens, hedgehogs, otters and water voles. Louise has worked around the world with dogs detecting firearms, explosives and tobacco, but said Henry was one of a growing number involved in conservation detecting and tackling wildlife crime. She said Henry's strong will and \"unruly energy\" make him the perfect detection dog. \"He's got so much energy and drive and as soon as we trained him for conservation detection we were able to give him focus,\" she said. IFAWHenry was honoured at the awards, presented by wildlife presenter Michaela StrachanHenry was honoured at the 25th Animal Action Awards in London on Thursday, alongside human conservations from around the world. Wildlife presenter Michaela Strachan, who presented the awards, described Henry as a \"superdog\", praising Louise's work training him. \"To be able to train a dog like Henry to do the work that he does needs an enormous amount of time, patience, dedication and commitment,\" she said. \"The two of them together are a formidable team for wildlife protection.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Award-winning Wrexham Spaniel sniffing out wildlife crime",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3e59/live/36830b30-aa87-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-17T05:16:39.000Z",
      "dateModified": "2025-10-17T05:16:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]