[
  {
    "title": "Millionaire Liverpool GP behind asylum seeker hotels",
    "url": "https://www.bbc.com/news/articles/ckgvn4rr03vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4a76/live/2eb68b00-ed5a-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-28T10:36:29.000Z",
    "description": "10 hours agoMarc WaddingtonBBC North West Investigations BBCDr Faisal Maassarani, seen here in a BBC health programme in 2018, spent £3.5m buying an a",
    "body": "10 hours agoMarc WaddingtonBBC North West Investigations BBCDr Faisal Maassarani, seen here in a BBC health programme in 2018, spent £3.5m buying an asylum seeker hotelMore than 100 people were threatened with eviction from their homes to make way for asylum seekers after companies linked to a prominent GP started running migrant hotels.Firms connected to Dr Faisal Maassarani became landlords of Serco hotels in 2022 when asylum applications were almost at a 20-year high.But soon after a hotel in Seel Street in Liverpool owned by one of the firms was found to be unsuitable, people in one of their Liverpool housing complexes were told they had to move out over \"urgent\" fire safety issues, unaware that 116 asylum seekers had seemingly been lined up to replace them almost immediately.Maassarani, whose involvement with one of the firms was hidden behind a complex structure of companies and trusts registered in the Isle of Man, said he had no part in the day-to-day running of the buildings and did not authorise any communication with tenants.Maassarani operates several GP surgeries in Knowsley and Sefton and in 2009 set up the social isolation charity Care Merseyside.Between 2021 and 2022, a company he had founded, Schloss Roxburghe Holdings, acquired about £5m of freeholds on buildings that were originally owned by property developer Elliot Lawless before his companies went into administration.In August 2022, when some of Maassarani's business associates bought the Waverley Hotel in Whitehaven in Cumbria, Serco moved asylum seekers into it within a week.In November, one of Maassarani's companies then spent £3.5m buying the King's Gap hotel in Hoylake, which had been running as asylum seeker accommodation since 2020.Protests have been held over the Hoylake King's Gap hotel being used as asylum accommodationAt the same time, asylum seekers were moved into the Seel Street hotel as the firms' relationships with Serco and the Home Office expanded.And the BBC's investigations suggest it was the use of that hotel that directly led to dozens of people almost losing their homes in an alleged illegal eviction attempt.A tenant of Parliament Place in Liverpool told the BBC he came home from work in March 2023 to find a letter from Schloss Roxburghe Holdings (SRH).Andrew Lewis said he was left in \"disbelief\" at what the letter said.Andrew Lewis was told he had to move out of his flat, unaware of plans to move asylum seekers in The letter told tenants they needed to move out because the building required urgent fire safety works.Lewis, 47, said: \"People were afraid, panicking… and didn't want to be evicted.\"The IT worker added: \"They put it vague enough to make us assume we could come back in again. It wasn't until someone emailed the management company and said what happens after this four-week period that they said they were going to terminate our leases.\"And that's when we thought, we're not standing for this.\"The tenants did not know about plans to move asylum seekers into their homes, nor that the plan had been under discussion for up to three months.Those the BBC has spoken to also said they did not know that the buy-to-let landlords who owned the flats they lived in had been directly approached by an \"agent\" of SRH promoting the asylum deal to them.Plans were being made to move asylum seekers into Parliament PlaceIn February 2023, an email was sent to some of the private landlords of flats in the building telling them a deal with \"the United Kingdom Home Office\" would give them a guaranteed £435 a month per flat, potentially for up to seven years.The email said the Home Office had \"undertaken a full survey of the building\" in December 2022, and had then issued a \"heads of terms\" for a contract to use it from March 1.The BBC understands the unsigned and undated \"heads of terms\" was actually a draft proposal, and that no agreement had been made.But at the time, the Home Office and Serco were facing pressure from Liverpool City Council about the use of the SRH-owned Seel Street hotel as asylum accommodation because its location in the middle of the city centre's nightlife district made it unsuitable.The Seel Street Hotel - now known as the Ropewalks Hotel - housed asylum seekers briefly in 2022 The timing suggests it was likely it was these asylum seekers that were destined to move into Parliament Place.Liverpool City Council said it had visited the building \"informally\" in February 2023 \"to check room sizes for intended occupancy\" and whether the fire alarm system was suitable.It is understood that not all of the building's private landlords were told about the plan, and that when some were, they objected to it.The tenants were then contacted directly by letter by SRH and told they had to move out for fire safety works to take place.Liverpool City Council said it had never suggested anyone needed to move out of the building.Lewis, whose own landlord was not aware of the move, said he \"100% believed\" that the fire safety claims were a ruse to clear the building.SRH shelved the asylum seeker plan, and was reported in the Liverpool Echo at the time to have withdrawn from the plan when it became clear the \"upheaval to tenants was too great\".The tenants did not have to leave, and, to their knowledge, the fire safety works never took place.Family tiesMaassarani set up SRH in 2018 in the Isle of Man. Its directors were all professionals from other Isle of Man or British Virgin Islands-based firms. And because the shares in the company are owned by a foundation, there is no publicly available information linking Maassarani to it.The GP said the revelation of his involvement in the company was not in the public interest, that he derived no financial income from it, and that while he had been told about plans to move asylum seekers into Parliament Place, he was not involved in the day-to-day running of the company.Dr Maassarani, seen here taking part in a BBC health documentary in 2018, says he makes no financial benefit from Schloss Roxburghe Holdings The trust which owns SRH was founded to pay for education and training for his family, and Maassarani has a personal business history with people believed to have been involved in both running SRH and managing his interests in asylum seeker accommodation.The agent who wrote to Parliament Place landlords promoting the asylum seeker deal signed off the correspondence as 'Mike Murphy'. The BBC understands this to be Michael Murphy, at the time a partner at major Liverpool law firm and Everton stadium sponsor Hill Dickinson.The BBC have asked Murphy about his alleged involvement, and he said he could not respond because of client confidentiality.Tenants were not told their buy-to-let landlords had been told about an alleged deal with the Home Office The BBC has found that as well as having acted as a solicitor for both Maassarani and Lawless, Murphy had personal business links to both men in relation to property deals worth nearly £2m.He is also the son-in-law of one of the directors of the firm that managed the Waverley asylum seeker hotel in Cumbria, 76-year-old former building firm boss David Lloyd.Lloyd is now the sole director of SRH, which in recent months has faced fresh illegal evictions allegations in relation to another of its Liverpool buildings, Queensland Place.Schloss Roxburghe Holdings has also faced allegations of illegal eviction attempts at Queensland Place in LiverpoolIn November, leaseholders there secured an injunction against the firm to stop it changing the locks on some tenants' rooms as part of a row over ground rent payments, with the company warned its assets could be seized and its director jailed if it was breached.Maassarani and Lloyd are both currently directors of a firm called Optimus Hotel Management, which has recently taken a loan out against the £3.5m Wirral King's Gap asylum seeker hotel. Solicitor Murphy acted as a witness to the application.'Not good enough'The Wirral hotel remains asylum seeker accommodation, but the Cumbria hotel was closed in December 2023, owing more than £170,000 to unpaid staff and His Majesty's Revenue and Customs.It had been operated through a company that did not have its own bank account, and its liquidation fees were paid by another firm of which Maassarani is a director.GoogleThe Waverley Hotel in Whitehaven was turned into asylum accommodation soon after it was bought in summer 2022Murphy – who resigned from Hill Dickinson last April - declined to respond to any of the BBC's questions, citing \"client confidentiality\". Hill Dickinson said it could not comment on \"the matters of any individual organisation or the private interests of existing or former partners\".Lloyd has not responded to the BBC's enquiries.In a statement to the BBC, a spokesman for Dr Maassarani said he was \"a local GP with over 20 years of NHS service to thousands of patients and their families across the Merseyside area\" and \"holds senior leadership positions within the NHS\".The statement added: \"He is not in any way involved in the running or management of Schloss Roxburghe Holdings, neither does he benefit financially from it.\"As such he had no knowledge of, and was not involved in or responsible for, any communications with tenants at Parliament Place or Queensland Place.\"It added he \"is neither a party, defendant or respondent\" in the injunction proceedings relating to Queensland Place.  Parliament TVKim Johnson raised the attempted eviction of Parliament Place tenants in the House of CommonsLiverpool Riverside's Labour MP Kim Johnson said the incident at Parliament Place raised questions about how asylum accommodation deals were done, and rejected Maassarani's suggestion there was no public interest in knowledge of his link to SRH.She added: \"It's not good enough. I think there needs to be more investigation and scrutiny of how contracts are awarded and the whole procurement process. More due diligence is definitely required.\"The Home Office – which the BBC understands has to approve all accommodation looking to be used by Serco - has declined to comment on its providers' commercial relationships.North West Investigations",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Millionaire Liverpool GP behind asylum seeker hotels",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4a76/live/2eb68b00-ed5a-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-28T10:36:29.000Z",
      "dateModified": "2026-01-28T10:36:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Are ICE immigration agents acting outside the law? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct8bz1?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-01-23T16:16:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·23 Jan 2026,·30 minsAre ICE immigration agents acting outside the law?AmericastAvailable for over a yearDonald Trump came into power with a promise to carry out the “largest mass deportation programme in history”.  One year on, ICE (Immigration and Customs Enforcement) raids in US cities are one of biggest political issues dividing America right now, with questions over how ICE agents are behaving and who they are targeting.\nIn this episode, Anthony, Marianna and Justin look at whether ICE agents are going beyond their remit, and is public opinion starting to turn against the president? \nWe focus on Minneapolis after the killing of 37 year old Renee Nicole Good two weeks ago, who was shot dead by an ICE officer.  Anti-ICE protests have been ongoing within the city, and this week, the Vice President JD Vance who was visiting Minneapolis called for Democrats to co-operate with the Trump agenda.  \nJustin talks to John Sandweg, former Acting Director of ICE under President Obama who gives us his insight into how ICE agents are being vetted and recruited, plus the wider impact of diverting billions of dollars into Trump’s enforcement operations.  \nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Anthony Zurcher, North America Correspondent\n• Marianna Spring, Social Media Investigations Senior Correspondent \nGUEST: \nJohn Sandweg, former Acting Director of ICE under President Obama \nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Purvee Pattni and Laura Cain. The technical producer was Mike Regaard. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Are ICE immigration agents acting outside the law? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-01-23T16:16:00.000Z",
      "dateModified": "2026-01-23T16:16:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Braverman Backs Reform - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mxb5dn?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-25T21:33:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·26 Jan 2026,·33 minsAvailable for over a yearToday, Adam and Chris discuss ex-Conservative home secretary Suella Braverman defecting to Reform. She’s the third sitting Tory MP to do so in the last eleven days.\nAlso happening in Westminster — the Prime Minister has been defending the decision to block Manchester mayor Andy Burnham from standing in the Gorton and Denton by-election. It’s reported that 50 Labour MPs wrote to Keir Starmer to complain about the decision.\nAnd, a 37-year-old man — Alex Pretti — was shot dead in Minneapolis by Border Patrol agents on Saturday. This is the second shooting by federal agents in less than three weeks. Adam speaks to BBC North America editor and Americast host Sarah Smith.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris and Shiler Mahmoudi. The social producer was Joe Wilkinson. The technical producers were Philip Bull & Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Braverman Backs Reform - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-25T21:33:00.000Z",
      "dateModified": "2026-01-25T21:33:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Iran: Trump warns 'time is running out' for nuclear deal as US military builds up in Gulf",
    "url": "https://www.bbc.com/news/articles/cly5pd459gko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c97b/live/151aa270-fc47-11f0-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-01-28T18:58:42.000Z",
    "description": "1 hour agoJaroslav LukivandKathryn ArmstrongHandout via ReutersThe fleet is headed by aircraft carrier USS Abraham Lincoln (file image)Donald Trump ha",
    "body": "1 hour agoJaroslav LukivandKathryn ArmstrongHandout via ReutersThe fleet is headed by aircraft carrier USS Abraham Lincoln (file image)Donald Trump has warned Iran that \"time is running out\" to negotiate a deal on its nuclear programme following the steady build-up of US military forces in the Gulf.The US president said a \"massive Armada\" was \"moving quickly, with great power, enthusiasm, and purpose\" towards Iran, referring to a large US naval fleet.In response, Iran's Foreign Minister Abbas Araghchi said the country's armed forces were ready \"with their fingers on the trigger\" to \"immediately and powerfully respond\" to any aggression by land or sea.Iran insists its nuclear programme is entirely peaceful and has repeatedly denied accusations by the US and its allies that it is seeking to develop nuclear weapons.Trump's latest warning follows his promise that Washington will intervene to help those involved in the brutal and unprecedented crackdown on protests in the country earlier this month.\"Help is on the way,\" he said, before later changing his tune and saying he had been told on good authority that the execution of demonstrators had stopped.The US-based Human Rights Activists News Agency (HRANA) says it has confirmed the killing of more than 6,301 people, including 5,925 protesters, since the unrest began at the end of December. HRANA says it is also investigating another 17,000 reported deaths received despite an internet shutdown after nearly three weeks.Another group, the Norway-based Iran Human Rights (IHR), has warned that the final toll could exceed 25,000.Trump's latest comments on Iran appeared to focus more on the country's nuclear programme.\"Hopefully Iran will quickly 'Come to the Table' and negotiate a fair and equitable deal - NO NUCLEAR WEAPONS,\" he wrote on Truth Social. Trump added that this force was \"ready, willing, and able to rapidly fulfil its mission, with speed and violence, if necessary\".Araghchi responded by saying: \"Iran has always welcomed a mutually beneficial, fair and equitable NUCLEAR DEAL - on equal footing, and free from coercion, threats, and intimidation - which ensures Iran's rights to PEACEFUL nuclear technology, and guarantees NO NUCLEAR WEAPONS.\"Such weapons have no place in our security calculations and we have NEVER sought to acquire them,\" he added.Iran's Deputy Foreign Minister Kazem Gharibabadi said that no negotiations with the US were currently under way, despite \"exchanges of messages\". Using open-source tools, BBC Verify has been able to track some of the recent US deployments to the region, with satellite images showing that at least 15 fighter jets arrived at Jordan's Muwaffaq Air Force Base.There has also been an increase in the number of aircraft arriving at bases in Jordan, Qatar, and Diego Garcia in the Indian Ocean.BBC Verify has identified dozens of cargo planes and refuelling aircraft arriving in the Middle East, while drones and P-8 Poseidon spy planes have been seen on the FlightRadar24 tracking site operating near Iranian airspace.A naval \"armada\", as Trump referred to it, led by the USS Abraham Lincoln aircraft carrier has also arrived and is thought to be operating somewhere near Oman, a US defence official confirmed.\"In the past two weeks, the US has surged naval and aerial assets to the region, significantly increasing its regional posture,\" Megan Sutcliffe, a principal analyst at the risk advisory firm Sibylline, said.Satellite images show that at least two US guided missile destroyers and three combat ships have been docked in Bahrain for several months.Meanwhile, Tehran has deployed the IRIS Shahid Bagheri - a drone carrier ship which entered service last year - just off the Iranian coast, satellite images show.Maxar TechnIRIS Shahid Bagheri, shown on a satellite image taken in December 2024US and European officials, quoted by the New York Times, have said Iran must permanently end all enrichment of uranium, limit the range and number of its ballistic missiles and stop supporting proxy groups in the Middle East, including Hamas, Hezbollah and the Houthis, as part of a new nuclear deal.UN sanctions were reinstated on Iran in October, after European powers accused Tehran of \"continued nuclear escalation\" and a lack of co-operation with international inspectors monitoring the original nuclear deal, which was negotiated in 2015.That deal - agreed with the US, UK, France, China, Russia and Germany - saw Iran limit its nuclear activities in return for sanctions relief and followed years of tensions over Tehran's alleged covert efforts to develop a nuclear weapon, which it denied.The US abandoned the deal in 2018, during Trump's first term - with the president saying it did too little to stop Iran from creating a pathway to a nuclear bomb - and reinstated its own sanctions, which crippled the Iranian economy.Tehran retaliated by increasingly breaching key restrictions under the deal, particularly those related to the production of enriched uranium, which is used to make reactor fuel but also nuclear weapons.US officials then said the operation - codename \"Midnight Hammer\" - had significantly set back the prospect of Tehran building a nuclear weapon.However, Hassan Abedini, the deputy political director of Iran's state broadcaster, claimed that the country \"didn't suffer a major blow because the materials had already been taken out\" of the facilities.In retaliation, Iran launched missiles on a US military base in Qatar - an attack described by Trump as \"very weak\" and \"expected\".Additional reporting by Joshua Cheetham, Matt Murphy, Alex Murray, Barbara Metzler and Sofia Ferreira Santos.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iran: Trump warns 'time is running out' for nuclear deal as US military builds up in Gulf",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c97b/live/151aa270-fc47-11f0-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-01-28T18:58:42.000Z",
      "dateModified": "2026-01-28T18:58:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Don't take us to a hospital': Iran protesters treated in secret to avoid arrest",
    "url": "https://www.bbc.com/news/articles/c5yx015nkplo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b164/live/a27f6500-fc70-11f0-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-01-28T17:28:08.000Z",
    "description": "3 hours agoSoroush PakzadBBC PersianBBCX-rays showed birdshot embedded in the legs of a wounded protester\"People helped us and we got into a car... I ",
    "body": "3 hours agoSoroush PakzadBBC PersianBBCX-rays showed birdshot embedded in the legs of a wounded protester\"People helped us and we got into a car... I said, 'Don't take us to a hospital.'\"Tara and her friend were attending a protest in the central Iranian city of Isfahan when security forces arrived on motorcycles and began shouting at the crowd.\"My friend told an armed member of the security forces, 'Just don't shoot us,' and he immediately fired several shots at us. We fell to the ground. All our clothes were covered in blood,\" she said.They were bundled into a stranger's car, but Tara said they were too frightened to be taken to the hospital because of the risk of being arrested. \"All the alleyways were full of security forces, so I asked a couple standing at their front door to let us in.\"They stayed at the couple's home until it was almost dawn and then managed to find a doctor they knew, who cleaned the birdshot wounds on their legs, according to Tara.She said a surgeon was later able to remove some of the birdshot at home but warned them: \"They cannot all be removed and will remain in your bodies.\"All names in this article have been changed for their safety.Warning: This story contains details and images which some readers might find distressing.The full scale of the bloodshed resulting from the crackdown by security forces on the anti-government protests that swept across Iran this month is still not known because of an internet shutdown and a ban on reporting by most international news organisations.But the US-based Human Rights Activists News Agency (HRANA) has said it has confirmed the killing of 6,301 people, including 5,925 protesters, 112 children, 50 bystanders and 214 affiliated with the government. It is also investigating reports of 17,091 more deaths.At least another 11,000 protesters were seriously wounded, according to HRANA.Some of them have told the BBC that they have avoided seeking treatment for their injuries at hospitals because they fear being arrested.That has left them reliant on doctors, nurses and other volunteers willing to risk their own safety by treating them secretly at their homes.Healthcare workers have also told the BBC that security forces are present in hospitals and that they are constantly monitoring patients' medical records to identify injured protesters.Tara was able to find doctors willing to treat her wounds at their homesNima, a surgeon in Tehran, said he witnessed many young people being injured in the streets on his way to work on 8 January, when authorities responded to the escalating protests with lethal force.\"I put one of the wounded in the boot of my car to take him to hospital, as I was worried that we would get in trouble if we were stopped by the police,\" he told the BBC.Nima said armed officers stopped him but allowed him to go after seeing his hospital identification card.\"For almost 96 hours straight - without interruption, without sleep, without even closing our eyes for a moment - we were operating. We were crying and operating. Nobody complained.\"\"All our clothes and hospital gowns were covered in blood - our outer clothes, our underwear, everything was soaked in the blood of these young people.\"Nima described operating on one man who had been shot in the leg and face at a protest.\"A bullet had entered through his chin, ripped through his mouth and exited through his upper jaw,\" he recalled.Nima also said many of the young people treated at his hospital suffered gunshot wounds to their vital organs and limbs that required amputation and left them with permanent disabilities.Blood was seen on the floor of a hospital in TehranIranian authorities have said more than 3,100 people have been killed during the unrest, but that majority were security personnel or bystanders attacked by \"rioters\".Health ministry spokesman Hossein Shokri was also quoted by the semi-official Tasnim news agency as saying that around 13,000 operations had been carried out during the unrest.\"Fortunately, people trust the ministry of health and hospitals, and confidence that all injured individuals are treated impartially in medical centres has led around 3,000 people who had been treating themselves at home over the past six days to seek care at hospitals,\" he added.The head of the Farabi Eye Hospital in Tehran, Dr Qasem Fakhrai, told Isna, another semi-official news agency, that it had treated a total of 700 patients with severe eye injuries requiring emergency surgery as of 10 January, and referred almost 200 to other hospitals. He said almost all of the patients were admitted after 8 January.Imanemunmusic/XVideo footage from a street in eastern Tehran showed wounded people fleeing the sound of gunfire at a protestSaeed told the BBC that his friend's eyes were hit by birdshot fired by security forces during a protest in the central city of Arak.Local doctors told him to go to a specialist eye hospital in Tehran, he said.Upon arrival, nurses took protesters with eye injuries to operating theatres through the back by using staff lifts.According to Saeed's friend, around 200 people with eye injuries from different cities were being treated at that hospital.\"He had two operations, but the surgeon did not charge him,\" Saeed said.A healthcare worker in Tehran also said that doctors were trying to avoid mentioning gunshot wounds in medical records because they were being constantly monitored by security forces.Vahid OnlineVideo footage from early January showed security forces storming a hospital in Ilam where activists said wounded protesters were being treatedSina took his brother to a hospital after he was shot in the legs during protests in Tehran.\"It was like a battlefield hospital - there were so many wounded that there were no blankets or medical kits,\" Sina told the BBC.\"When I asked a nurse for a blanket for my brother, she told me to bring one from home because there were too many injured and not enough supplies.\"Sina said they had no choice but to give their actual ID number in order to use their health insurance. \"At any moment, the security forces could raid our home,\" he added.In smaller cities, the situation is believed to be even more dire.Reports received by the BBC said security forces had abducted patients from hospitals and that they had not been seen again.HRANADr Alireza Golchini, a surgeon in Qazvin, has reportedly been arrested for treating injured protestersHuman rights groups have also said that medics and others who have treated injured protesters are now themselves being targeted by security forces.Iran Human Rights (IHR) said last week its sources on the ground in Iran had reported the arrest of at least five doctors and a volunteer first responder. \"Security agencies appear to be aiming to intimidate the public and obstruct treatment for injured protesters by arresting doctors and raiding makeshift medical shelters,\" the Norway-based organisation warned.And this week, sources close to Dr Alireza Golchini, a surgeon from the northern city of Qazvin, said he had been beaten up at his home by security forces when they arrested him for treating injured protesters.They added that he had been accused of \"moharebeh\" (enmity against God) - an offence that can carry the death penalty under Iranian law.Additional reporting by Faren Taghizadeh and Maryam Afshang, BBC Persian",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Don't take us to a hospital': Iran protesters treated in secret to avoid arrest",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b164/live/a27f6500-fc70-11f0-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-01-28T17:28:08.000Z",
      "dateModified": "2026-01-28T17:28:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mobo Awards 2026: Olivia Dean set to perform",
    "url": "https://www.bbc.com/news/articles/c20g2d38eg8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6bcd/live/fb811ec0-fc28-11f0-9554-45dc30088314.jpg",
    "tag": "Trending",
    "date": "2026-01-28T11:44:03.000Z",
    "description": "Olivia Dean's standout year continues as she is set to 'light up' Mobo Awards stage9 hours agoNaomi ClarkeBBC NewsbeatGetty ImagesOlivia Dean's second",
    "body": "Olivia Dean's standout year continues as she is set to 'light up' Mobo Awards stage9 hours agoNaomi ClarkeBBC NewsbeatGetty ImagesOlivia Dean's second album, The Art Of Loving, is nominated for four Mobo AwardsOlivia Dean has been going from strength to strength of late, with the singer securing major award nominations and topping the charts. She is now set to \"light up\" the Mobo Awards stage as one of the performers on the night, says its founder.R&B girl group Flo and Nigerian singer Tiwa Savage are also on the line-up for the ceremony, which will be held at Manchester's Co-op Live on 26 March for the first time.Mobo founder and CEO Kanya King says she \"can't wait to see\" the artists perform, describing them as \"bold, brilliant and rooted in creative truth\".Hip-hop star Eve is also set to make her hosting debut at the show, alongside comedian Eddie Kadi, who returns for the third time. The ceremony will mark the 30th anniversary of the organisation, which celebrates black music in the UK and beyond.It is already set to be an exciting night for London-born singer Olivia whose soulful album, The Art Of Loving, is up for four awards, including album of the year.She will be up against British trio Flo for the coveted prize, who have been nominated for their debut album, Access All Areas.Rapper and three-time Mobo winner Little Simz's sixth album Lotus is also up for the prize and has received four nods in total. Other album of the year nominees include jazz quintet Ezra Collective for Dance, No One's Watching, Kojey Radical's second offering, Don't Look Down and Central Cee's first studio album, Can't Rush Greatness.Boy's A Liar singer PinkPantheress and rapper Skepta have also received multiple nominations, as well as newcomers Kwn and Jim Legxacy.Getty ImagesAmerican rapper Eve says she is \"so excited\" to co-host the showAmerican rapper Eve, known for hip-hop classics Let Me Blow Ya Mind and Who's That Girl?, says she is \"so excited\" to co-host the show. \"Even though our journeys started around the same time across the Atlantic from each other, we have our shared love for music and the culture, and in making sure we continue to have spaces that celebrate talent and share our stories,\" she adds.Eddie says he is \"so proud\" to be part of the \"legendary show\" again and warns fans to \"expect the unexpected\" with the performances and surprise appearances.The hosts \"represent excellence, authenticity and cultural impact in their own right,\" says Kanya.\"Together, they embody the spirit, humour and global perspective that has always defined the MOBO Awards.\"Other performers on the line-up and those receiving a special honour will be announced at a later date.Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mobo Awards 2026: Olivia Dean set to perform",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6bcd/live/fb811ec0-fc28-11f0-9554-45dc30088314.jpg"
      ],
      "datePublished": "2026-01-28T11:44:03.000Z",
      "dateModified": "2026-01-28T11:44:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man guilty of assault after Barron Trump reported attack to UK police",
    "url": "https://www.bbc.com/news/articles/cd6wpdpylj1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fca7/live/fe544c10-fc61-11f0-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-01-28T14:54:59.000Z",
    "description": "5 hours agoMaia DaviesMetropolitan PoliceMatvei Rumiantsev, 22, was convicted on Wednesday at Snaresbrook Crown CourtA Russian man has been found guil",
    "body": "5 hours agoMaia DaviesMetropolitan PoliceMatvei Rumiantsev, 22, was convicted on Wednesday at Snaresbrook Crown CourtA Russian man has been found guilty of assault occasioning actual bodily harm after Donald Trump's son told UK police he had seen a woman being beaten up on a video call.Barron Trump, 19, contacted officers when he was in the US to say his friend had been attacked by Matvei Rumiantsev in London in January 2025, a trial at Snaresbrook Crown Court heard.Prosecutors said Rumiantsev, 22, had been jealous of the woman's friendship with Trump. Rumiantsev, who lived in Canary Wharf, east London, was also convicted of perverting the course of justice. He was found not guilty of one count of rape and intentional strangulation, and another of rape and assault alleged to have occurred in November 2024.The trial had heard that Trump called the victim, who cannot be named for legal reasons, on 18 January last year and contacted UK police shortly afterwards.\"I'm calling from the US, uh I just got a call from a girl, you know, she's getting beat up,\" he said, according to a transcript of the call released by the Crown Prosecution Service.Asked by the operator how he knew the woman, Trump said: \"I don't think these details matter, she's getting beat up but OK fine, also I met her on social media, I don't think that matters.\"The operator responded: \"Can you stop being rude and actually answer my questions?\"A few months later, in May 2025, Trump told police in an email that what he saw had been \"very brief indeed but indeed prevalent\".The 19-year-old said his video call to the woman had been picked up by \"a shirtless man with darkish hair\".This view lasted \"maybe one second\" before the camera flipped to \"the victim getting hit while crying\", he told police, adding: \"This whole interaction had lasted five to seven seconds.\"Jurors heard that Rumiantsev and the woman had been drinking together on the evening of 17 January and into the next morning.The prosecution said he assaulted the woman on 18 January 2025, including hitting her in the face. Getty ImagesBarron Trump is the US president's fifth and youngest childJudge Mr Justice Bennathan KC had cautioned the jury not to rely on Trump's account as the main basis for a conviction, noting he had not given evidence under oath or been cross-examined.Prosecutor Serena Gates said Rumiantsev had been jealous of the woman's friendship with Trump, perhaps because of his \"public profile\".Asked during cross-examination whether he was jealous of men the victim might speak to, Rumiantsev said: \"What I was really unhappy about was that she was frankly leading him [Trump] on.\"Mr Justice Bennathan KC told Rumiantsev the trial was about whether he \"attacked her or not\".Rumiantsev responded: \"I am being portrayed as a jealous person who can lose his temper due to jealousy. I want to just make clear that her actions towards him was wrong and it was not fair.\"He added: \"I was jealous to some extent.\"The conviction for perverting the court of justice relates to a letter Rumiantsev wrote to the woman from prison after the 18 January attack, asking her to withdraw her allegations.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man guilty of assault after Barron Trump reported attack to UK police",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fca7/live/fe544c10-fc61-11f0-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-01-28T14:54:59.000Z",
      "dateModified": "2026-01-28T14:54:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ex-Spandau Ballet singer Ross Davidson found guilty of rape",
    "url": "https://www.bbc.com/news/articles/c0er7j820p0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/28d1/live/baa088a0-f09d-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-28T17:20:33.000Z",
    "description": "3 hours agoGetty ImagesRoss Davidson, 37, who used Ross Wild as his stage name, was known for singing with the 80s band Spandau Ballet in 2018A former",
    "body": "3 hours agoGetty ImagesRoss Davidson, 37, who used Ross Wild as his stage name, was known for singing with the 80s band Spandau Ballet in 2018A former singer for Spandau Ballet has been found guilty of rape and attempted rape.Ross Davidson, who used Ross Wild as his stage name, was known for singing with the 80s band Spandau Ballet in 2018 as well as starring in the Queen-themed West End musical We Will Rock You.The 37-year-old from Finchley, north London, had pleaded not guilty to the rape of a woman in London in March 2015. He also denied the attempted rape and sexual assault of another woman in Thailand in December 2019.Jurors at Wood Green Crown Court found him guilty of all charges after more than 11 hours of deliberation.Following the convictions, Det Con Kamila Kedadrova, from the Metropolitan Police, described the Aberdeen-born singer as \"a prolific offender who carried out cowardly and opportunistic assaults against his victims\".'Helpless and scared'During the trial, prosecutor Richard Hearnden said Davidson had been thought of as \"a bit of a sex symbol\" but the two women found he had \"a much darker side that they did not notice, at least at first\".Davidson had met both women on the dating app Tinder and claimed that all sexual activity he engaged in was consensual.The rape victim told the jury she woke to find Davidson assaulting her while she slept in his bed at his London home. She said she felt \"helpless\" and \"scared to react\".She also said that Davidson had told her he was interested in the idea of sex with \"a person in a helpless state, someone not moving\".Davidson described himself as \"sex positive\", explaining that for him the term meant having \"open dialogue\" and being \"open minded about people's predilections\".Met PoliceJurors at Wood Green Crown Court found Davidson guilty of all chargesDavidson had earlier pleaded guilty to a charge of voyeurism in December 2019 against the woman in Thailand after he secretly filmed a video of her as she slept.Detectives later traced her after discovering a video on Davidson's phone which the prosecution said showed her being touched while \"asleep, still and unresponsive\" and \"at least half naked\" in the hotel room.She told the court she had no idea the footage existed until that point.Davidson admitted the voyeurism charge, but had denied sexual assault and attempted rape.He said he created the video for \"selfish reasons, for sexual gratification\". He told the jury he wished he \"had never done it\".The court heard Davidson had been found guilty of rape, two counts of sexual assault and voyeurism at a previous trial.He is due to be sentenced for his later convictions at a later date.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ex-Spandau Ballet singer Ross Davidson found guilty of rape",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/28d1/live/baa088a0-f09d-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-28T17:20:33.000Z",
      "dateModified": "2026-01-28T17:20:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chagos discussions with US continue, says Starmer",
    "url": "https://www.bbc.com/news/articles/cp80p875pdko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c367/live/ac3645c0-fae8-11f0-adda-0755af0bac4f.jpg",
    "tag": "Trending",
    "date": "2026-01-28T17:00:10.000Z",
    "description": "3 hours agoJack FenwickPolitical correspondentReutersThe prime minister has said that discussions are ongoing with the United States over a controvers",
    "body": "3 hours agoJack FenwickPolitical correspondentReutersThe prime minister has said that discussions are ongoing with the United States over a controversial deal to hand the Chagos Islands to Mauritius, amid concerns the US could withdraw support for the agreement.Under the deal, which the US backed last year, the UK would transfer sovereignty of the islands to Mauritius and lease back a joint UK-US military base on the largest island, Diego Garcia.Ministers insist the deal is necessary to protect the base from \"malign interests\", but last week President Trump called it \"an act of great stupidity\".The Conservatives have accused the government of undermining national security because of Mauritius's close ties to China.Speaking to reporters while travelling to Beijing, Sir Keir Starmer said he had discussed it with Donald Trump \"a number of times\" and said the issue had been \"raised with the White House at the tail end of last week, over the weekend and into the early part of this week\".The prime minister said the Trump administration had been given three months to look at the deal last year and had concluded it \"was a deal they wanted to support, did support and did so in very clear terms\".US support was thrown into doubt last week when Trump said on social media that he was \"against\" the deal.Hours later, Downing Street said it believed the US still supported the deal, despite the president's comments.Those around Sir Keir believed that the president was simply using the issue to put pressure on the UK over the Greenland row, and did not think that Trump had actually changed his mind on Chagos.But the following morning, the US Treasury Secretary Scott Bessent also criticised the deal and accused the UK of \"letting us down\" by handing sovereignty of the islands to Mauritius.Officials inside the Foreign Office are thought to be more concerned about Bessent's comments than they were about Trump's social media post – and Downing Street has since declined to repeat its claim that the US still supports the deal.It's understood there has not been an official approach from the US to the UK about a change of position on the Chagos deal, but there is some concern in Whitehall that such an approach could happen in the future.The Chagos Islands have been under British control since 1814 and became formally established as an overseas territory in 1965, but Mauritius has argued that it was illegally forced to give the islands away.In 2021 a United Nations court ruled that the UK had no sovereignty over the islands, a decision which eventually led to negotiations over this deal.The deal would see the UK lease back Diego Garcia for a period of 99 years, at an average cost of £101m a year.The US initially agreed to the deal in May 2025, but one source involved in those negotiations says the Trump administration was \"never enthusiastic\" and \"just decided then to go along with it\".Last year, the then-Foreign Secretary David Lammy said: \"If President Trump doesn't like the deal, the deal will not go forward.\"Foreign Office minister Stephen Doughty told MPs on Monday that UK officials \"remain engaged with the United States on a daily basis\".It has also emerged that a 1966 treaty signed by the US and the UK would have to be updated for the deal to be completed.Those inside government are refusing to share details of how that treaty could be updated, but the Conservatives believe it would effectively give the US an opportunity to veto the entire deal.Foreign Office officials do not believe that is the case, but Doughty declined to answer when asked in the House of Commons whether that treaty could be updated unilaterally by the UK.The source involved in negotiations between the UK and US said the 1966 treaty had not been discussed during those talks.They said: \"To have overlooked it and not realised its importance is the most monumental piece of incompetence.\"A government source said they wanted it to return to Parliament as quickly as possible, but said it wasn't yet known when that would be.Conservative leader Kemi Badenoch said the deal wasn't in the interests of the UK or the US and said she had spoken to the US ambassador Warren Stephens and the speaker of the House of Representatives Mike Johnson.Reform UK is also against the deal and party sources say Nigel Farage has personally discussed the issue with President Trump, Scott Bessent, JD Vance and other members of the administration.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chagos discussions with US continue, says Starmer",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c367/live/ac3645c0-fae8-11f0-adda-0755af0bac4f.jpg"
      ],
      "datePublished": "2026-01-28T17:00:10.000Z",
      "dateModified": "2026-01-28T17:00:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Moment British Airways plane loses wheel during take-off in Las Vegas",
    "url": "https://www.bbc.com/news/videos/c04120yqdq5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/62c0/live/10898c50-fc6d-11f0-a8b8-bdd2c5f9bcad.jpg",
    "tag": "Trending",
    "date": "2026-01-28T16:00:39.000Z",
    "description": "This is the moment a British Airways flight to London suddenly lost a wheel shortly after take-off from Las Vegas. The right rear wheel could be seen ",
    "body": "This is the moment a British Airways flight to London suddenly lost a wheel shortly after take-off from Las Vegas. The right rear wheel could be seen detaching from the Airbus A350-1000, before plummeting to the ground at Harry Reid International Airport. In a statement to the BBC, British Airways said: \"safety and security underpins everything we do and we're supporting the authorities with their investigations\". Harry Reid International Airport said it was aware of an incident involving a British Airways aircraft on departing on Monday for London, where it said the plane \"landed safely without further incident\". It said the tyre was retrieved from the airfield, there were no reported injuries or damage, and the National Safety Board had been notified.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Moment British Airways plane loses wheel during take-off in Las Vegas",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/62c0/live/10898c50-fc6d-11f0-a8b8-bdd2c5f9bcad.jpg"
      ],
      "datePublished": "2026-01-28T16:00:39.000Z",
      "dateModified": "2026-01-28T16:00:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cardiff University cricket club suspended over pub initiation",
    "url": "https://www.bbc.com/news/articles/cy8p2lk5x5ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a1c7/live/177dcfb0-fc5b-11f0-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-01-28T18:17:15.000Z",
    "description": "Cricketers banned as university club suspended over initiation2 hours agoAmy MackrillBBC WalesGetty ImagesThe behaviour was reported to have breached ",
    "body": "Cricketers banned as university club suspended over initiation2 hours agoAmy MackrillBBC WalesGetty ImagesThe behaviour was reported to have breached Cardiff University's Code of ConductA university cricket club has been suspended for the rest of the academic year, with players banned, following an investigation into reports of serious misconduct.Concerns first emerged in October about the behaviour of members of the Cardiff University sports team during an initiation event at a pub in the city.Cardiff University Students' Union confirmed the men's cricket club would be suspended and that committee members involved would no longer be allowed to represent the university in cricket.In a statement, the union said it had a \"zero-tolerance position on initiation-type behaviour\", while the university - which is separate to the union - said it would consider next steps.The union added: \"These behaviours were inconsistent with our code of conduct, breached explicit guidance that had been repeatedly communicated to the club committee in advance, and raised significant concerns around student safety and welfare.\"Our approach is guided by a clear duty of care to students and a zero-tolerance position on initiation-type behaviour.\"While we want students to take part in sport and social activity, we will act where evidence shows our expectations have not been met to ensure activity is run responsibly.\"The union said it was taking steps to establish a cricket programme administered directly by the Students' Union for students not involved in the reported behaviour. It also said it would consider applications from students to establish a men's cricket club in a future academic year, but any future application would be subject to \"robust scrutiny\".It added it would be writing to all sports club members to reiterate the standards of behaviour required of anyone representing the students' union or the wider university.A Cardiff University spokesperson said: \"We want to be clear, initiations have no place at Cardiff University and we reserve the right to investigate using our student conduct regulations. \"We will need to consider our next steps and consider what, if any, action the university might need to take\", they added, urging any students impacted to get in touch. More top stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cardiff University cricket club suspended over pub initiation",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a1c7/live/177dcfb0-fc5b-11f0-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-01-28T18:17:15.000Z",
      "dateModified": "2026-01-28T18:17:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lily Allen to headline Boardmasters festival",
    "url": "https://www.bbc.com/news/articles/ce9ym73g1ggo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/33c0/live/311a1de0-fc4a-11f0-8ee8-9f8ad0c97346.jpg",
    "tag": "Trending",
    "date": "2026-01-28T17:14:48.000Z",
    "description": "Lily Allen to bring break-up album to Boardmasters festival3 hours agoPete AllisonandGeorgia Levy-Collins,BBC NewsbeatGetty ImagesLily Allen will join",
    "body": "Lily Allen to bring break-up album to Boardmasters festival3 hours agoPete AllisonandGeorgia Levy-Collins,BBC NewsbeatGetty ImagesLily Allen will join Fatboy Slim and Kasabian in topping the bill in Newquay Lily Allen will headline Boardmasters festival this summer, where she will perform her break-up album in full. Her addition comes after an explosive reaction to her 2025 album West End Girl, which provides a brutally honest take on the breakdown of her marriage to Stranger Things star David Harbour.The singer will join DJ Fatboy Slim and rock band Kasabian in topping the bill in Newquay, Cornwall between 5 to 9 August.BoardmastersThe singer will headline the festival in Cornwall between 5 to 9 AugustLily's set for a busy year, having already scaled up a tour of smaller venues to add full-size arenas due to demand.She will also join Scissor Sisters in headlining Mighty Hoopla festival in London's Brockwell Park in May.Her first album in more than seven years became one of the most talked about records of the year.It went on to claim number two in the Official Charts last October, while its candid lyrics sparked endless memes and viral videos.Lily's return also led to her receiving three nominations for the upcoming Brit Awards, including Artist of the Year.But next August she will swap making waves for being beside the sea at Boardmasters, with more than 50,000 people expected to attend the festival.The Kooks, Loyle Carner and Tinie Tempah are among the artists who have already been announced for next summer's line-up.Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lily Allen to headline Boardmasters festival",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/33c0/live/311a1de0-fc4a-11f0-8ee8-9f8ad0c97346.jpg"
      ],
      "datePublished": "2026-01-28T17:14:48.000Z",
      "dateModified": "2026-01-28T17:14:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mum says Glasgow University ‘failed’ son who took his own life after grade error",
    "url": "https://www.bbc.com/news/articles/c3dm27359xxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a1d4/live/a6cd6ff0-fc50-11f0-9aca-0d1869acdee8.jpg",
    "tag": "Trending",
    "date": "2026-01-28T14:56:22.000Z",
    "description": "5 hours agoClaire ThomsonandJames Cheyne,BBC ScotlandTracy ScottEthan Brown was awarded the wrong grade for a courseThe mother of a student who took h",
    "body": "5 hours agoClaire ThomsonandJames Cheyne,BBC ScotlandTracy ScottEthan Brown was awarded the wrong grade for a courseThe mother of a student who took his own life after wrongly being told he could not graduate says he was \"failed\" by Glasgow University after a report highlighted serious concerns.An investigation by the Quality Assurance Agency for Higher Education (QAA) found that the university's processes posed a \"systemic risk to academic standards\".Its review was carried out after the death of Ethan Brown, who should have been awarded a 2:1 degree but was incorrectly told he had not passed his course.His mother, Tracy Scott, said the findings confirmed the family's suspicions about failures at the institution. Glasgow University apologised and said it fully accepted the report's recommendations.Ethan was due to graduate from the University of Glasgow with an Honours degree in geography in December 2024.Tracy Scott said her \"kind and caring\" son enjoyed studying and was proud to be a Glasgow University student.\"He was looking forward to graduating and wanted to be like his aunt who also has a degree from the university,\" she said.'We don't want other families going through what we did. We are not going away.'But with three months to go, he was told he would not be eligible to graduate because he had not been awarded a grade for one course.The 23-year-old took his own life on the day he should have received his degree.An internal investigation was launched after Scott sought answers from the university.It concluded he had been awarded the wrong grade for a course due to an error by the university and should have graduated with a 2:1 Honours degree. The error was not spotted by any University of Glasgow staff, or by two internal exam boards and one external exam board.Scott said the report from the QAA was a \"very emotional read\" which confirmed the family's suspicions about the \"failures\" at the university.\"We're in shock but happy to know what we thought is true,\" she said.Scott said Ethan asked for help but had not been offered any support.\"They failed my son,\" she said.PA MediaEthan's mother Tracy (second right) collected his degree posthumously at a ceremony in DecemberScott said the university must make changes and wants a fatal accident inquiry to be carried out into Ethan's death to \"safeguard present and future students\".\"We can't help Ethan now but we can protect other students,\" Scott said.\"Ethan was a huge loss to our family and we don't want other families to go through what we went through.\"At the time of Ethan's death, the university said it was confident that the error with his marks was an isolated one and \"no other students have been affected\". But the QAA report reveals that two other students in the geography school were given the wrong outcomes, and that five other potential cases were being investigated. Final degree classifications at Glasgow University are currently calculated by aggregating individual course marks.The School of Geographical and Earth Sciences, where Ethan had been studying, was the only one of the 23 different schools which the university itself had identified as \"high risk\".Tracy ScottEthan had been proud to study at Glasgow UniversityThe QAA carried out its investigation after concerns were raised by the Scottish Funding Council.The review did not cover the individual circumstances of Ethan's death but focused on broader issues.It found that Glasgow University's assessment regulations posed a \"systemic risk to academic standards\".The QAA report described the university's code of assessment as \"convoluted\" and said there was a risk of inconsistent interpretation and decision-making at exam boards throughout the institution.It said the extent to which past, present and future awards at the university were affected by this systemic risk was not known.It also highlighted a lack of communication about the options for students who are at risk of not graduating.The report makes 21 recommendations, including mandatory training for staff and a review of how exam boards log final degree awards across the university.It also recommends the university's next regular external peer review takes place one year sooner than planned.Glasgow University apologised to Ethan's familyQAA chief executive Vicki Stott said the findings were \"of serious concern\".She said her organisation would work to ensure that the university implemented the recommendations \"in a timely manner\" to protect academic standards.The Scottish Funding Council, which asked the QAA to carry out the independent review, said a national review of assessment procedures at all universities would now be carried out.Jacqui Brasted, from the SFC, said the report's findings were \"deeply concerning\" and needed to be implemented \"as a matter of urgency\".A spokesperson for the University of Glasgow offered a \"sincere apology\" to Ethan's family and said it fully accepted the QAA recommendations and the risks identified in its report.\"We are profoundly sorry that Ethan tragically took his own life and understand the deep distress it has caused his family,\" it said.\"Since February 2025, we have worked to address the issues highlighted in the internal investigation and will implement the recommendations of the QAA review through a comprehensive plan that builds on current change projects.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mum says Glasgow University ‘failed’ son who took his own life after grade error",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a1d4/live/a6cd6ff0-fc50-11f0-9aca-0d1869acdee8.jpg"
      ],
      "datePublished": "2026-01-28T14:56:22.000Z",
      "dateModified": "2026-01-28T14:56:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "King's film reveals his personal philosophy",
    "url": "https://www.bbc.com/news/articles/c62wepw43k3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b787/live/2b962a00-fc75-11f0-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-01-28T17:30:28.000Z",
    "description": "3 hours agoSean CoughlanRoyal correspondent, WindsorKing's FoundationThe King's film explained the meaning of his 'harmony' philosophyIn an unusually ",
    "body": "3 hours agoSean CoughlanRoyal correspondent, WindsorKing's FoundationThe King's film explained the meaning of his 'harmony' philosophyIn an unusually personal royal film, King Charles has asserted his belief in the need for human life to work in keeping with the natural world - saying he would not be deterred by critics or scepticism.\"This was the approach I was going to stick to, a course I set, and I wasn't going to be diverted,\" says the King, in the film Finding Harmony - A King's Vision, to be screened on Amazon's Prime Video next month.King Charles and Queen Camilla attended the film's launch - in the first premiere held at Windsor Castle, with the spectacular Waterloo Chamber turned into a makeshift cinema.Dame Judi Dench, Sir Rod Stewart, Sir Kenneth Branagh and Stanley Tucci were among the celebrities at the glitzy premiere.PA MediaKing Charles and Queen Camilla watched the film inside Windsor CastleThe King's spokesman said this was a different kind of royal documentary - without any gold carriages or glittering crowns.Instead the golden thread running through the 90-minute documentary is the King's own philosophy of \"harmony\", that brings together environmentalism, religion, architecture, art and design.He provides his own description: \"It all boils down to the fact that we are actually nature ourselves, we are a part of it, not apart from it, which is really how things are being presented for so long,\" says the King.PA MediaSir Rod Stewart and Penny Lancaster were among the celebrity guestsThe film, made in collaboration with his King's Foundation charity, is a sometimes elegiac look at his many decades of campaigning to protect the natural world.He watches himself making a speech in 1970, aged 21, arguing the environmentalist cause. The accent might have been plummier, but his position has been remarkably consistent, even though he has faced mockery, saying that people thought his views were \"bonkers\".Elsewhere in the documentary, narrated by Kate Winslet, he is described as a \"bit of a hippie\".And the movie addresses one of the hardiest old chestnuts about the King - that he talks to plants - showing how the comments he made about being close to nature became an opportunity to marginalise his views.Although as the decades went by, support for sustainability became more mainstream and his views were seen as going from \"crazy\" to \"common sense\".King's FoundationThe King watched speeches he'd made decades ago about the environmentPutting ideas into practice has been an important part of his approach. Dumfries House in Ayrshire has been renovated and turned into a training centre in a part of Scotland hit badly by the closure of local coal mines. The film shows how this project has become an important local asset and economic driver, providing jobs and skills, training 10,000 people a year.Highgrove, a quirky and characterful house in Gloucestershire, that seems allergic to straight lines, has become a living laboratory for his organic gardening and farming techniques.The King is seen in Highgrove feeding chickens and collecting eggs, in a shed called Cluckingham Palace.He also gives a glimpse of the outside of his \"sanctuary\", a private place for his own personal reflection. Reflecting his deep interest in religion and spirituality, above the door is inscribed the prayer: \"Lighten our darkness, we beseech thee, O Lord.\"The inclusivity of his beliefs are also suggested as we see him at a fire ceremony, alongside indigenous peoples wearing elaborate headdresses, at an inaugural \"Harmony Summit\" last summer.PA MediaDame Judi Dench was among the famous faces at the Windsor premiereThere are glimpses in the film of Prince William and Prince Harry in archive footage, along with childhood images of King Charles.There is an unexpected appearance from the Duke of York. Although in this case it is the name of a variety of potato that the King recommends as a good choice for baking.\"If you want to have a decent baked potato, which I love, you've got to have the crispy skins, so the red Duke of Yorks are very good,\" he says.The movie is promoting his world view about the interconnectedness of all things - and it is an example of how we are seeing more of the King as an inner man, beyond his role as a public figure.It comes soon after an exhibition about another his personal passions, with his King's Foundation displaying examples of icons that are an important part of the Orthodox faith.It is an eclectic and international vision, with the film sweeping around examples of harmony in places including India, Guyana and Afghanistan.But it is also a world in which the US politician we hear from is former vice president Al Gore, who has campaigned on climate change.The King makes his own observation about his life of campaigning.\"Maybe, by the time I shuffle off this mortal coil, there might be a little more awareness… of the need to bring things back together again,\" he says.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "King's film reveals his personal philosophy",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b787/live/2b962a00-fc75-11f0-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-01-28T17:30:28.000Z",
      "dateModified": "2026-01-28T17:30:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]