[
  {
    "title": "The Global Story - Viktor Orban’s dilemma: Trump’s favour or Russian oil - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct7151?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mf7yk3.jpg",
    "tag": "Trending",
    "date": "2025-11-07T10:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·07 Nov 2025,·26 minsAvailable for over a yearThe man Donald Trump has called a \"great leader\", and who has long provoked admiration in MAGA circles, suddenly finds himself in an unusual position – at odds with the US president on an issue of critical importance. \nViktor Orban, Hungary’s prime minister, is visiting the White House on Friday to try to resolve a dispute over Russian oil and gas. Orban wants to keep buying it, but Trump wants countries to wean themselves off Russian energy and help put the brakes on Russia’s war in Ukraine. Will Trump choose to keep an old friend close, or put pressure on Putin? We speak to Nick Thorpe, the BBC’s correspondent in Budapest, who has covered Orban since the 1980s. \nProducer: Viv Jones \nExecutive producer: James Shield \nSenior news editor: China Collins \nMix: Travis Evans  \nPhoto: U.S. President Donald Trump and Hungarian Prime Minister Viktor Orban. Suzanne Plunkett, Reuters.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Global Story - Viktor Orban’s dilemma: Trump’s favour or Russian oil - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mf7yk3.jpg"
      ],
      "datePublished": "2025-11-07T10:00:00.000Z",
      "dateModified": "2025-11-07T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Week: Mistaken Prisoner Releases and Tax Rises Are Coming? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mf970z?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-11-07T11:38:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·07 Nov 2025,·30 minsThe Week: Mistaken Prisoner Releases and Tax Rises Are Coming?NewscastAvailable for over a yearToday, after another two prisoners were mistakenly released from prison - why is the justice system failing and who is to blame?\nJustice Secretary David Lammy is under increasing pressure after details have emerged that two more prisoners have been wrongly released. Why didn’t Mr Lammy explain the situation when he was speaking during PMQs? And what has gone wrong?\nPlus, after a week where it has become increasingly clear more tax rises are expected at the budget - what is the chancellor’s plan?\nAdam and Chris are joined by the head of the Institute for Fiscal Studies Helen Miller and Luke Tryl from More in Common. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Shiler Mahmoudi. The social producer was Sophie Millward. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Week: Mistaken Prisoner Releases and Tax Rises Are Coming? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-11-07T11:38:00.000Z",
      "dateModified": "2025-11-07T11:38:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Quiz: How big is one trillion?",
    "url": "https://www.bbc.com/news/articles/c20p8ldy32yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fd30/live/f1953230-bbef-11f0-8456-eff94716b162.png",
    "tag": "Trending",
    "date": "2025-11-07T14:09:24.000Z",
    "description": "2 hours agoA pay package that could be worth $1 trillion has been approved for Tesla CEO Elon Musk. The mind-meltingly large number is conditional on ",
    "body": "2 hours agoA pay package that could be worth $1 trillion has been approved for Tesla CEO Elon Musk. The mind-meltingly large number is conditional on achieving certain targets for the company - but what does one trillion actually look like?Take our quiz to understand the scale of how the world's richest man could get richer.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Quiz: How big is one trillion?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fd30/live/f1953230-bbef-11f0-8456-eff94716b162.png"
      ],
      "datePublished": "2025-11-07T14:09:24.000Z",
      "dateModified": "2025-11-07T14:09:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-11-07T05:50:47.000Z",
    "description": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and p",
    "body": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-11-07T05:50:47.000Z",
      "dateModified": "2025-11-07T05:50:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Joey Barton guilty over 'offensive' X posts",
    "url": "https://www.bbc.com/news/articles/cwykwlkewr7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0f2c/live/60f697b0-1203-11ef-82e8-cd354766a224.png",
    "tag": "Trending",
    "date": "2025-11-07T16:10:59.000Z",
    "description": "Just nowJonny HumphriesLiverpool Crown CourtBBCJoey Barton had been charged with 12 counts of sending a grossly offensive electronic communication wit",
    "body": "Just nowJonny HumphriesLiverpool Crown CourtBBCJoey Barton had been charged with 12 counts of sending a grossly offensive electronic communication with intent to cause distress or anxietyFormer footballer Joey Barton has been found guilty of six counts of sending \"grossly offensive\" social media posts directed at broadcaster Jeremy Vine and TV football pundits Lucy Ward and Eni Aluko.Barton, 43, had compared Aluko and Ward to the serial killer couple Fred and Rose West, and called Vine a \"bike nonce\", a slang term for a paedophile, in posts sent between January and March 2024.This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version.You can receive Breaking News on a smartphone or tablet via the BBC News App. You can also follow @BBCBreaking on X to get the latest alerts.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Joey Barton guilty over 'offensive' X posts",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0f2c/live/60f697b0-1203-11ef-82e8-cd354766a224.png"
      ],
      "datePublished": "2025-11-07T16:10:59.000Z",
      "dateModified": "2025-11-07T16:10:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "GTA 6 release delayed to November 2026",
    "url": "https://www.bbc.com/news/articles/cwypgvd9j8qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ddf/live/9349ecd0-bb62-11f0-824f-39b3b0e3b0ee.jpg",
    "tag": "Trending",
    "date": "2025-11-07T10:33:41.000Z",
    "description": "Grand Theft Auto 6 delayed again until November 20266 hours agoLaura CressRockstarGrand Theft Auto 6 tells the story of lovers Jason and LuciaGrand Th",
    "body": "Grand Theft Auto 6 delayed again until November 20266 hours agoLaura CressRockstarGrand Theft Auto 6 tells the story of lovers Jason and LuciaGrand Theft Auto 6 has been delayed - for a second time - until 19 November 2026.One of the most anticipated gaming releases ever, the sequel by developer Rockstar Games was due to come out in May 2026.It had already been postponed once before, from autumn 2025. But in a statement on Thursday, Rockstar said it needed extra months to to finish the game with the level of polish fans had come to \"expect and deserve\".GTA 5, the latest in the series, was released in 2013 and is the second best-selling game of all time.Despite being 12 years old, it remains extremely popular with fans today due to its online mode.In its statement, Rockstar said it was \"sorry for adding additional time\" to a long wait and thanked fans for their patience.It said it was \"incredibly excited\" for players to experience the game's setting of Leonida - a fictional US state based on Florida - and a modern-day version of the Miami-inspired Vice City.Rockstar GamesGTA 6 takes place in a fictional, yet familiar, version of the USAAs ever, GTA news sparked the usual mix of anger, jokes and acceptance on social media.Streamer IShowSpeed gave a typically over-the-top response to the news during one of his online broadcasts.\"I'm gonna be 50 before this game comes out,\" he said.\"I might have kids, I might have a wife.\"The account for animated character Lofi Girl, who has been locked in a never-ending study session on YouTube since 2017, joked that she \"might actually graduate before GTA 6\".While an official Domino's Pizza account encouraged Rockstar to \"call us if you need help delivering\". Others were more measured, saying they would rather developers take their time than rush out an unfinished game.The announcement follows the firing of 31 workers from Rockstar's UK studios on 30 October.The Independent Workers' Union of Great Britain (IWGB), which represents people working in the gaming sector, has accused the developer of sacking UK staff to stop them unionising.Members led rallies outside the company's offices in Edinburgh and London on Thursday. The BBC has approached Rockstar's parent company, Take-Two Interactive, for comment.IWGBPickets have taken place outside Take-Two Interactive's UK head office in London.Rockstar has stayed tight-lipped about GTA 6, releasing only two trailers so far, with the second arriving in May this year.With over 100 million views, the nearly three-minute video gave players more insight into the backstory of protagonists Jason and Lucia - a couple who live a life of crime in Leonida - as well as revealing new characters and map locations.Rockstar has form for delaying its games and a reputation for perfectionism, with its previous big release - Red Dead Redemption 2 - delayed by roughly a year from its original release date.Increased demand for complexity and scope from players, as well as soaring development costs, has meant publishers are less willing to take risks on unfinished products.When it finally lands, GTA 6 is likely to be one of the most expensive video games ever made, but also expected to set records with its launch sales.Whether it will live up to the hype remains to be seen.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "GTA 6 release delayed to November 2026",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6ddf/live/9349ecd0-bb62-11f0-824f-39b3b0e3b0ee.jpg"
      ],
      "datePublished": "2025-11-07T10:33:41.000Z",
      "dateModified": "2025-11-07T10:33:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Released Israeli hostage says he was sexually assaulted in Gaza captivity",
    "url": "https://www.bbc.com/news/articles/cgkz0yzde80o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d9a5/live/d9034bc0-bbd7-11f0-bd4a-49c00e3ca628.jpg",
    "tag": "Trending",
    "date": "2025-11-07T14:18:27.000Z",
    "description": "A former Israeli hostage who was released last month has told Israeli TV that he was sexually assaulted during his two years in captivity in Gaza.In a",
    "body": "A former Israeli hostage who was released last month has told Israeli TV that he was sexually assaulted during his two years in captivity in Gaza.In an interview with Channel 13's Hazinor programme, Rom Braslavski, 21, described being stripped naked and tied up by members of Palestinian Islamic Jihad (PIJ).\"It was sexual violence, and its main purpose was humiliation. Its goal was to humiliate me, to crush my dignity,\" he said.He is the first man held hostage to allege publicly that he was sexually assaulted.Warning: This article contains details some readers may find disturbing.Rom Braslavski was on leave from his service as a soldier in the Israeli military and was working as a security guard at the Nova music festival when Hamas and allied Palestinian armed groups attacked southern Israel on 7 October 2023, killing about 1,200 people and taking 251 others as hostages.Israel responded to the attacks by launching a military campaign in Gaza that has killed more than 68,800 people, according to the territory's Hamas-run health ministry.Four weeks ago, Mr Braslavski was among the last 20 living Israeli hostages who were released under a US-brokered ceasefire deal between Israel and Hamas.In the interview with Channel 13, broadcast late on Thursday, Mr Braslavski said his treatment by PIJ deteriorated rapidly after he had refused to convert from Judaism to Islam in March this year, which was also when the previous ceasefire collapsed.He said he was kept blindfolded for three weeks, had stones pushed into his ears to limit his hearing, and had his rations of food and water reduced.Then, he added, his captors received what they described as an order to torture him.Mr Braslavski said they tied him up, punched him, and whipped him with a metal cable – and that this was repeated several times a day.\"I entered into a loop, which I doubted I would come out of alive,\" he recalled.In August 2025, PIJ posted a video in which Mr Braslavski was seen crying and saying that he had run out of food and water, was unable to stand or walk, and was \"at death's door\".Following the publication of the video, Mr Braslavski told Channel 13, his captors also began to sexually assault him.\"They stripped me of all my clothes, my underwear, everything. They tied me up from the... When I was completely naked I was wiped out, dying without food and I prayed to God: 'Save me, get me out of this already',\" he said.When asked whether his captors did \"more things like that\", Mr Braslavski replied: \"Yes. It's hard for me to talk about this part specifically. I don't like to talk about it. And it's hard. It was a horrific thing.\"He added: \"You just pray to God for it to stop. And while I was there, every day, every beating, every day, I'd say to myself: 'I survived another day in hell. Tomorrow morning, I'll wake up to another hell. And another hell'.\"Israeli President Isaac Herzog said Mr Braslavski had shown \"extraordinary courage in sharing the horrors of his captivity, including a horrific sexual assault he endured\".\"The world must understand the scale of the crimes committed by the terrorists in Gaza, heinous cruelty, sexual violence, and abuse,\" he wrote on X.At least four women held as hostages have spoken publicly about alleged incidents of sexual abuse against themselves or fellow captives, according to Reuters.A PIJ official told Reuters news agency that Mr Braslavski's allegation of sexual assault was \"incorrect\", without elaborating.The UN Special Representative on Sexual Violence in Conflict said in March 2024 that she and a team of experts had found \"convincing information\" of rape and sexualised torture being committed against some hostages in Gaza. They also found reasonable grounds to believe that sexual violence occurred in multiple locations, including rape and gang rape, during the 7 October attacks. Hamas said the report's findings were \"baseless\".A separate report by a UN commission of inquiry in March 2025 concluded that Israel had \"increasingly employed sexual, reproductive and other forms of gender-based violence against Palestinians\", including \"forced public stripping and nudity, sexual harassment including threats of rape, as well as sexual assault\". Israel called the allegations \"unfounded\".Last week, the former top lawyer in the Israeli military resigned after saying she was responsible for the leaking of a video that purportedly shows soldiers abusing a Palestinian detainee at a base in Israel last year. The detainee was treated for severe injuries after allegedly being stabbed in the rectum. Five soldiers have been charged over the incident.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Released Israeli hostage says he was sexually assaulted in Gaza captivity",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d9a5/live/d9034bc0-bbd7-11f0-bd4a-49c00e3ca628.jpg"
      ],
      "datePublished": "2025-11-07T14:18:27.000Z",
      "dateModified": "2025-11-07T14:18:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What are the numbers behind prison releases?",
    "url": "https://www.bbc.com/news/articles/cp85r4744pvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/63db/live/ada4e0d0-bb35-11f0-b2a1-6f537f66f9aa.png",
    "tag": "Trending",
    "date": "2025-11-07T12:51:52.000Z",
    "description": "3 hours agoDaniel Wainwright, Gerry Georgieva and Nicholas BarrettBBC VerifyGetty ImagesThe recent cases of prisoners being mistakenly released has pu",
    "body": "3 hours agoDaniel Wainwright, Gerry Georgieva and Nicholas BarrettBBC VerifyGetty ImagesThe recent cases of prisoners being mistakenly released has put a fresh spotlight on the demands facing the justice system.Prison overcrowding, staffing levels and government funding have all been called into question.How many prisoners have been released by mistake?There were 262 prisoners accidentally released in the 12 months to March 2025, compared with 115 the previous year.Of 121 prisons across England and Wales, 72 released at least one prisoner by mistake in 2024-25.The overall number of releases has also increased - but not by as much.  There were just over 57,000 releases of prisoners who had finished the custodial part of their sentences in England and Wales in 2024-25. This includes the period when some prisoners were released after serving 40% of their sentence.The year before there were about 50,000 releases. That's a rise in the number of releases of about 13% - a lot lower proportionally than the increase in errors.One in 10 released from 'escort areas'The majority of accidental releases were from a prison itself.Pentonville Prison in London released the most in 2024-25 - 16, up from six the year before.To put that in context, Pentonville had a population of just under 1,200 in March 2025. So that's equivalent to letting out more than one in every 100 prisoners by mistake over the year.Another category of mistaken release is from \"escort areas\" - places where prisoners are being taken between prisons, to and from court hearings or to immigration removal centres.Around one in 10  were released in error from these areas, the figures show.However it's not clear from the data how many had been convicted or were in prison on remand, awaiting a trial or sentencing hearing.Staffing challengesAt the end of June 2025, there were a total of 36,627 people working in prison service establishments across England and Wales.That's 787 fewer people than a year ago, but well above the staff numbers in previous years.However staff turnover is an ongoing issue.In the year to June, nearly 13% of staff left the prison service, almost twice the 7.1% turnover rate across the Civil Service.Half had spent a year or less in the job.Sickness rates also impact operations.In the year to June, prison staff missed an average of 12 days of work due to sickness. In two out of five cases, the absence was related to a mental health issue.For comparison, average workers in the UK miss just over four days a year due to sickness.Government funding The mistaken releases have led to renewed questions over government funding for the justice system.Former Conservative justice secretary Alex Chalk says the MoJ, which is responsible for prisons, the probation system, courts and legal aid, spends in a year the amount \"spent by the Department for Work and Pensions (DWP) every two weeks\".MoJ is spending this year is around £13bn  according to the National Audit Office - compared to the Department for Work and Pensions (DWP), which spent nearly £276bn in 2023-24.And, according to the Institute for Fiscal Studies thinktank, the MoJ is expected to be 5.6% smaller than it was in 2010 by the end of the current parliament.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What are the numbers behind prison releases?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/63db/live/ada4e0d0-bb35-11f0-b2a1-6f537f66f9aa.png"
      ],
      "datePublished": "2025-11-07T12:51:52.000Z",
      "dateModified": "2025-11-07T12:51:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Harper's Bazaar: Jade, Reece Witherspoon and Aimee Lou Wood honoured at Women of the Year awards",
    "url": "https://www.bbc.com/news/articles/cj978m447rpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bdc3/live/67992c30-bbbd-11f0-b372-073abfdb1a21.jpg",
    "tag": "Trending",
    "date": "2025-11-07T10:15:50.000Z",
    "description": "6 hours agoYasmin RufoClaridge's HotelGetty ImagesCheryl praised Jade as being \"fearless, talented and utterly herself\"Some of the biggest names in en",
    "body": "6 hours agoYasmin RufoClaridge's HotelGetty ImagesCheryl praised Jade as being \"fearless, talented and utterly herself\"Some of the biggest names in entertainment, music and sport gathered at London's Claridge's Hotel on Thursday night for the annual Harper's Bazaar Women of the Year Awards.The star-studded ceremony, celebrating powerful and inspiring women, included Gillian Anderson, Chloe Kelly and Chimamanda Ngozi Adichie.Singer Jade, who rose to fame as part of Little Mix before launching a solo career, was also among the winners and received the musician of the year award from Cheryl. Jade told the BBC it was a meaningful moment to accept the award from Cheryl, as she was \"a major influence during my X Factor journey and throughout my time in Little Mix\". \"Both being from the north east, Cheryl was the first person I looked up to and thought if she can do it, so can I,\" she said. \"I'd take pictures of her to the hair salon when I was younger and ask if I could look like her,\" she added.Getty ImagesCheryl and Mel C celebrated Jade's musician awardThe evening also celebrated achievements in television and Erin Doherty took home the performance of the year award for her role in Netflix's hugely successful drama series Adolescence.Owen Cooper, the main character in the show, presented Doherty with her award and praising her for her \"power and authenticity on the screen\". Getty ImagesThe 33-year-old actress is best known for playing Princess Anne in The CrownDoctor Who star Ncuti Gatwa presented Aimee Lou Wood with her award for The White Lotus. He jokingly read the star's complete birth chart to the audience to show how \"her fate to be this brilliant is written in the stars\". Getty ImagesGatwa and Wood both shot to fame on Netflix drama series Sex EducationReese Witherspoon was honoured as cultural icon by Barbie's America Ferrera. In her speech, the American actress said she built her production company, Hello Sunshine, because \"the system I existed in wasn't right for me, and I realised Hollywood wasn't telling the right stories\". Getty ImagesWitherspoon said she was most proud about producing Gone Girl and Big Little LiesTheatre veteran Celia Imrie, presented the Theatre Award to Rosamund Pike for her acclaimed performance in the National Theatre's Inter Alia, and shocked guests when she joked about revealing who won Celebrity Traitors. Getty Images",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Harper's Bazaar: Jade, Reece Witherspoon and Aimee Lou Wood honoured at Women of the Year awards",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bdc3/live/67992c30-bbbd-11f0-b372-073abfdb1a21.jpg"
      ],
      "datePublished": "2025-11-07T10:15:50.000Z",
      "dateModified": "2025-11-07T10:15:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sudan war: Khartoum hit by drone attacks a day after RSF agrees to truce - reports",
    "url": "https://www.bbc.com/news/articles/c5y4j155g49o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/baf1/live/7f85eb40-bbd0-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-07T13:10:59.000Z",
    "description": "3 hours agoBarbara Plett Usher,Nairobi and Mayeni Jones,PretoriaExplosions have been heard near the Sudanese capital of Khartoum, a day after the para",
    "body": "3 hours agoBarbara Plett Usher,Nairobi and Mayeni Jones,PretoriaExplosions have been heard near the Sudanese capital of Khartoum, a day after the paramilitary Rapid Support Forces (RSF) said it would agree to a humanitarian ceasefire.Residents in Khartoum, which is controlled by the army, told the AFP news agency that they were woken overnight by the sound of drones and explosions.The blasts appeared to take place near a military base and a power station in the early hours of Friday morning, the residents said.The RSF has not addressed these accounts, but Sudan's military-led government said it would be wary of agreeing to a truce as the group did not \"respect\" ceasefires.The two sides have been embroiled in a civil war that has killed at least 150,000 people and forced 12 million others from their homes since it erupted in April 2023.This week a UN-backed global hunger monitor confirmed that famine conditions were spreading in conflict zones.On Friday, drones were heard not only in Khartoum, but also 300km (186 miles) north of the city, in the military-controlled town of Atbara.\"Anti-aircraft defences shot them down, but I saw fires breaking out and heard sounds of explosions in the east of the city,\" a resident there told AFP.The day before, the RSF announced it had agreed to a humanitarian truce proposed by the US, the United Arab Emirates (UAE), Saudi Arabia and Egypt.The four countries put forward the plan in September - and said it should be followed by a permanent ceasefire and a transition to civilian rule.At the time the Sudanese government rejected \"foreign interference\" and any attempts that equated it with a \"racist terrorist militia that relies on foreign mercenaries\".It is not clear if the proposal has been modified since then.But during a press conference on Friday, Sudan's ambassador to South Africa said it was too early for his country to agree to the plan.\"From our experience, we had many truces at the beginning of the war but every time there was no respect from [the RSF],\" Osman Abufatima Adam Mohammed said.\"They use these truces to move to new areas and make moves against the government.\"The ambassador opposed the UAE's presence at the ceasefire talks, repeating his government's allegation that the Gulf nation was supplying the RSF with weapons and foreign fighters.UN experts say accusations of such military support are credible, but the UAE has denied all involvement with the RSF.The RSF and the military have agreed to ceasefire proposals before, but none have stuck.This time, the RSF waited until it had finally seized el-Fasher, a key city that it had been blockading for 18 months, before announcing it was on board with the truce.Now that the paramilitary group has consolidated control over el-Fasher and, consequently, the vast wider western region of Darfur, it may have greater leverage in future ceasefire negotiations.But the RSF is also facing an international backlash against widespread reports of mass killings and sexual violence during the fall of el-Fasher, which it has denied.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sudan war: Khartoum hit by drone attacks a day after RSF agrees to truce - reports",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/baf1/live/7f85eb40-bbd0-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-07T13:10:59.000Z",
      "dateModified": "2025-11-07T13:10:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "British man Howard Phillips jailed after trying to spy for Russia",
    "url": "https://www.bbc.com/news/articles/c205d7e912qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/955c/live/3e4d0f20-bbce-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "Trending",
    "date": "2025-11-07T13:52:03.000Z",
    "description": "2 hours agoShivani ChaudhariEssexPhillips was arrested by plain-clothed officers near King's Cross railway station, after being filmed talking to unde",
    "body": "2 hours agoShivani ChaudhariEssexPhillips was arrested by plain-clothed officers near King's Cross railway station, after being filmed talking to undercover agentsA British man who jurors were told \"dreamt about being like James Bond\" has been jailed for seven years after trying to spy for Russia.Howard Phillips, from Harlow, Essex, wanted to pass on personal information about former Defence Secretary Sir Grant Shapps.The Conservative MP recalled going to Mr Phillips's house after moving to a new home in 2002.Phillips, 66, was found guilty of assisting a foreign intelligence service under the National Security Act and was sentenced at Winchester Crown Court in Hampshire.\"You were prepared to betray your country for money,\" said Mrs Justice Cheema-Grubb.\"You took a grave risk and didn't care what damage you caused.\"Through the deliberate work of the security services you were caught before providing material assistance to a foreign intelligence service so the danger was averted.\"She said he was being sentenced on the basis he was not \"ideologically driven but motivated by money\".CPSHoward Phillips's ex-wife told his trial that he had dreams of being like James Bond and was \"infatuated\" with MI5 and MI6His trial earlier this year was told he applied for a job with UK Border Force in October 2023, which prosecutors said was part of his bid to assist Russia.Phillips offered to help two agents who he thought were from the country's intelligence service, but who were actually undercover British intelligence officers.His ex-wife told jurors he \"would dream about being like James Bond\" and watched films about MI5 and MI6 as he was \"infatuated with it\".Phillips told the agents on WhatsApp that he was \"semi-retired but with connections in high places\", before meeting them in both London and at Lakeside Shopping Centre in West Thurrock, Essex, on 9 May 2024.He agreed to pass on personal information about Sir Grant, including his address, phone number and location of his private plane.Prosecutors said he left the agents a USB on a bike near St Pancras and Euston stations in London.PA MediaSir Grant Shapps was defence secretary in 2023 and 2024In a victim impact statement read to the court, Sir Grant said he was \"shocked\" about the defendant's plans and said he was concerned for his family's safety.Sir Grant recalled going to dinner at Phillips's home, three years before he became MP for Welwyn Hatfield in Hertfordshire.\"I feel it has been a complete breach of trust by Mr Phillips,\" said Sir Grant.\"He chose to take whatever information he had and attempted to sell it to a foreign intelligence service thereby, wantonly, putting myself, my family and ultimately the country at risk.\"Met PolicePhillips left the agents a USB on a bike near St Pancras and Euston stations in LondonBethan David, head of the Crown Prosecution Service's Counter Terrorism Division, said: \"Phillips was brazen in his pursuit for financial gain, and unbothered about the potential detriment to his own country.\"Phillips's defence lawyer, Jeremy Dein KC, said said there was an \"element of fantasy\" in his actions.He was described in court as a \"lost soul\" and an \"eccentric fantasist\" who believed he could manage Arsenal football club or even England.\"This was an ageing man whose life had collapsed, who was clearly not thinking straight and was desperate for money,\" said Mr Dein.More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "British man Howard Phillips jailed after trying to spy for Russia",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/955c/live/3e4d0f20-bbce-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-07T13:52:03.000Z",
      "dateModified": "2025-11-07T13:52:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Six officers face misconduct hearing over Cardiff car crash",
    "url": "https://www.bbc.com/news/articles/c2lpw1rj924o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d019/live/50ba3d60-bbdb-11f0-8669-5560f5c90fbe.jpg",
    "tag": "Trending",
    "date": "2025-11-07T15:12:15.000Z",
    "description": "60 minutes agoOscar EdwardsBBC WalesSocial mediaShane Loughlin, Eve Smith, Sophie Russon, Rafel Jeanne and Darcy Ross (clockwise from top left) went m",
    "body": "60 minutes agoOscar EdwardsBBC WalesSocial mediaShane Loughlin, Eve Smith, Sophie Russon, Rafel Jeanne and Darcy Ross (clockwise from top left) went missing on a night outSix police officers will face a misconduct process over their actions after it took them two days to find a car that had crashed and killed three people.Five people - Sophie Russon, 20, Eve Smith, 21, Darcy Ross, 21, Rafel Jeanne, 24, and Shane Loughlin, 32 - were last seen at about 02:00 GMT on 4 March 2023 after they went missing on a night out.Police believed the group had been involved in a car crash, but did not find the car until 6 March.When they found the car, on the A48 near Cardiff, three of the group had died and two were injured.The families of the three young women had all reported them missing on the evening of 4 March, with Gwent Police receiving the first missing persons report in relation to the group at about 19:30. Family and friends of the five made repeated appeals to find the missing group over the course of the weekend, with the mother of one of the girls saying she had been told to stop contacting police for updates.They were eventually found just after midnight on 6 March in the St Mellons area of the city. The white Volkswagen Tiguan had crashed deep in undergrowth near a roundabout, and they were not found for 46 hours.Ms Smith, Mr Jeanne, who was driving, and Ms Ross, died while Ms Russon and Mr Loughlin were critically injured and taken to hospital.Mr Loughlin was not driving at the time of the fatal crash, but had driven the same car while inhaling laughing gas earlier that night.In September 2023, he was sentenced to one year and five months in prison after admitting dangerous driving and driving while disqualified, in relation to the earlier driving.Social mediaEve Smith, Rafel Jeanne and Darcy Ross died in the collisionCourt papers obtained by PA news agency revealed that the group had been drinking alcohol and inhaling nitrous oxide - also known as laughing gas - prior to the collision.An initial inquest hearing into the deaths of Mr Jeanne, Ms Ross and Ms Smith heard they were declared dead at the scene of the crash.The inquest was adjourned to await the findings of further histology and toxicology tests.GoogleIn a statement the Independent Office for Police Conduct (IOPC) said it had \"examined Gwent Police's response\" to the missing person reports made by family members of the victims \"including if they were appropriately risk assessed, reviewed and resourced\".The statement said the following officers face disciplinary proceedings:A sergeant responsible for the investigation on 5 March for gross misconduct for their \"supervision of the missing persons inquiry\"A PC for gross misconduct for allegedly failing to carry out basic inquiries including not recording and sharing information with a supervisor, and allegedly failing to communicate appropriately with family members who had reported their loved ones missingTwo PCs for gross misconduct after allegedly failing to conduct house searches as per policy and giving dishonest accounts to their supervisor and IOPC investigators about thisOne of these officers was also criminally investigated for offences of misconduct in public office and perverting the course of justice, but the IOPC did not find sufficient evidence to make a referral to the Crown Prosecution ServiceA PC for misconduct for allegedly not carrying out adequate house searches as per policyA sergeant for misconduct relating to allegations of failing to review all available information at the time of conducting a risk assessment for the missing womenThe families of the victims questioned the police response at the time of the incident IOPC Director, Derrick Campbell, said it had examined \"more than thirty complaints\" from the families involved regarding the \"actions and decisions\" made by Gwent Police and South Wales Police.\"The complaints included the way in which both forces communicated with the families throughout the missing person investigation, not progressing information given to police by relatives and communication between the two forces as the investigation progressed.\"The IOPC determined that \"more than half\" the service provided by both forces was \"unacceptable\", according to Mr Campbell.Deputy Chief Constable of Gwent Police, Nicky Brain, said the force had \"fully co-operated with the IOPC\" during the investigation and will now \"start the process to hold the relevant misconduct hearings and misconduct meetings\".\"We acknowledge the impact that this investigation has had on them and understand how important the findings of the IOPC will be to all those affected and the wider community.\"The IOPC also recommended that three South Wales Police officers should undertake \"reflective practice\" following their investigation.In a statement, the force said \"opportunities were identified\" during the investigation to improve the way it worked with Gwent Police on missing person investigations.It said those changes had \"since been implemented.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Six officers face misconduct hearing over Cardiff car crash",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d019/live/50ba3d60-bbdb-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-07T15:12:15.000Z",
      "dateModified": "2025-11-07T15:12:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why human-shaped robots loom large in Musk's Tesla plans",
    "url": "https://www.bbc.com/news/articles/cdrz2rdlykdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e10f/live/40cbac10-bbc0-11f0-9279-29df2198f231.jpg",
    "tag": "Trending",
    "date": "2025-11-07T12:15:04.000Z",
    "description": "4 hours agoZoe Kleinman,Technology editor and Liv McMahon,Technology reporterIt has appeared in Tesla showrooms, on its factory floors and has even po",
    "body": "4 hours agoZoe Kleinman,Technology editor and Liv McMahon,Technology reporterIt has appeared in Tesla showrooms, on its factory floors and has even posed with Kim Kardashian.But Elon Musk's vision for his human-like robot Optimus is much grander than that.Since first unveiling it at a Tesla showcase in 2022, the tech billionaire has suggested his company's droid could play a huge role in the homes and lives of people all over the world.Along with self-driving robotaxis and Cybertrucks, Musk believes Tesla robots are key to establishing a foothold in the artificial intelligence (AI) landscape.And investors who signed off on his $1tn (£760bn) pay package on Thursday would appear to agree.One of the many tasks Musk must complete to get his whopping pay deal is to deliver a million AI bots over the next decade.But is Tesla's big bet on humanoid robots rooted in science fiction or reality?Silicon Valley is gunning hard for humanoids.A report released by Morgan Stanley on Friday predicted Apple, which is reportedly  looking into the robots, could potentially earn $133bn a year from them by 2040.Foxconn is reported to be deploying them at its Nvidia factory in Texas.The idea of advanced AI within a human-shaped shell is an astonishingly powerful combination in theory. It would let the tech interact with the physical world around it – and yes that includes us.While many companies have sought to develop human-like robots for factory and industrial use - such as UK robotics firm Humanoid - some are already looking to insert the tech in homes.The highly-publicised Neo from tech firm 1X, slated to launch in 2026, can do menial chores like emptying the dishwasher, folding clothes and fetching you items.It will cost $20,000 but it does come with a caveat - the WSJ reported it was actually controlled by a person wearing a virtual reality headset.Forrester analyst Brian Hopkins said the falling costs of components, combined with improvements to robot dexterity and AI, was helping to make humanoid robots feasible for a variety of different settings.\"From warehouses and restaurants to elder care and security, new use cases are gaining traction fast,\" he wrote in a blog post.\"If current trajectories hold, humanoid robots could disrupt many physical-service industries significantly by 2030.\"Musk previously told investors his robots had \"the potential to be more significant than the vehicle business, over time\".He went one step further after his pay package deal was approved on Thursday, saying he believed it could be \"the biggest product of all time by far, bigger than cell phones, bigger than anything\".He has also suggested it might boost Tesla's AI ambitions - particularly in advancing artificial general intelligence (AGI) systems capable of matching human abilities.\"Tesla AI might play a role in AGI, given that it trains against the outside world, especially with the advent of Optimus,\" he wrote on X in 2022.Elsewhere in the space, Boston Dynamics' hydraulic humanoid Atlas has captivated millions on YouTube with its gymnastics and dance routines.Viral videos of its leaps, bounds, somersaults and backflips have shown the advances in robotics over the years - with scientists now seizing upon the AI boom to boost their capabilities with systems enabling them to undertake more complex tasks.When it was retired last year, it was replaced with a newer, fully electric model developers said could contort its metal frame in even more ways.But many of the roboticists the BBC has spoken to over the years have rolled their eyes about tech firms shaping robots like humans.Practically, there is little reason for robots to have legs.The mechanics and hardware involved in creating machine legs are far more intensive.As one scientist put it - \"wheels are so much more efficient\".And don't get them started on why a robot doesn't need to have a head.Psychologically though, humanoids have long been a human fascination – and something reflected decades of sci-fi.You need only look to the legacy of characters such as Star Wars' C-3PO, Futurama's Bender or the Terminator to see humans might sometimes feel more comfortable around something closely resembling us.Back in reality, humanoid machines have been often far less polished and more gimmicky, clumsy and buggy than their fictional counterparts.But that appears to be changing with the likes of Optimus and sleeker droids which edge us closer to living in an uncanny valley.Tesla's droid has been appearing in more public settings as of late - serving burgers and popcorn to customers at the company's Hollywood diner.Sam Altman, boss of ChatGPT-maker OpenAI, said in May he doesn't think the world is ready for humanoids, while simultaneously describing it as an incoming moment.There's no love lost between him and Elon Musk but on this occasion they seem to be on the same page that the robots are on their way – and Musk certainly has the power, the influence and the cash to make it happen.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why human-shaped robots loom large in Musk's Tesla plans",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e10f/live/40cbac10-bbc0-11f0-9279-29df2198f231.jpg"
      ],
      "datePublished": "2025-11-07T12:15:04.000Z",
      "dateModified": "2025-11-07T12:15:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Typhoon Kalmaegi kills three in Vietnam after leaving 188 dead in Philippines",
    "url": "https://www.bbc.com/news/articles/c70jnx9e414o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/95a3/live/d9d56b00-bbe6-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "Trending",
    "date": "2025-11-07T05:13:58.000Z",
    "description": "Typhoon which killed almost 200 in Philippines and Vietnam weakens11 hours agoJonathan Head,South East Asia correspondent and Sen NguyenWatch: Typhoon",
    "body": "Typhoon which killed almost 200 in Philippines and Vietnam weakens11 hours agoJonathan Head,South East Asia correspondent and Sen NguyenWatch: Typhoon Kalmaegi barrels through central VietnamTyphoon Kalmaegi has killed at least 188 people in the Philippines and five in Vietnam, according to the latest figures from the two countries.The storm is now headed west to Cambodia and Laos after it barrelled through central Vietnam on Thursday with winds of up to 149km/h (92mph).Towns along Vietnam's central coast were littered with debris this morning after taking the full brunt of the storm overnight. The strong winds uprooted trees, tore off roofs, and smashed large windows. Thousands of people sought shelter in schools and other public buildings as the army was deployed to help deal with the damage. Vietnamese authorities have warned of possible flooding in low-lying areas. Central Vietnam has already seen record rainfall in the past week which has killed 50 people.Earlier this week the same storm devastated parts of the Philippines when heavy rainfall sent torrents of mud down hillsides and into residential areas. Some poorer neighbourhoods were obliterated by the fast-moving flash floods. The death toll reported on Friday was a jump from the 114 reported the previous day. Another 135 people are listed as missing. The Philippines government has declared a state of calamity across the country as it prepares for another typhoon which is building up in the Pacific Ocean.Ahead of Typhoon Kalmaegi, Vietnam's military on Thursday deployed more than 260,000 soldiers and personnel for relief efforts, along with more than 6,700 vehicles and six aircraft. Some airports and expressways in the country were closed and hundreds of thousands were evacuated.Shortly after the typhoon made landfall at 19:29 local time (12:29 GMT), hundreds of residents in Dak Lak province called for help, local media reported.Dak Lak province is approximately 350km (215 miles) north-east of Ho Chi Minh City.Many people said their homes had collapsed or been flooded, while strong winds and heavy rain continued to batter the area.AFP via Getty ImagesTrees came down in high winds near Quy Nhon beach in Gia Lai, central Vietnam, as Kalmaegi approached on ThursdayAccording to local media reports, Prime Minister of Vietnam Pham Minh Chinh held an online meeting to direct the emergency response.\"We must reach isolated areas and ensure people have food, drinking water, and essential supplies,\" he was quoted as saying.\"No one should be left hungry or cold.\" Before making landfall in Vietnam, the typhoon, known locally as Tino, left a trail of devastation in the Philippines.At least 188 people were killed and tens of thousands were evacuated, particularly from central areas including the populous island and tourist hotspot of Cebu, where cars were swept through the streets. Kalmaegi dumped the equivalent of a month's worth of rain on the island in just 24 hours, sending torrents of mud and debris down mountainsides and into urban areas. Stunned survivors who had made it to higher ground watched as buses and shipping containers were tossed about in the raging floodwaters. The storm has wiped out entire neighbourhoods in poorer districts, where building materials are flimsier.In Talisay City, which suffered some of the worst destruction, Mely Saberon looked on in despair at the pile of debris that had once been her home.\"We don't have any home anymore,\" she told the BBC. \"We weren't able to salvage anything from our house. \"We didn't expect the surge of rain and wind. We've experienced many typhoons before, but this one was different.\"Residents have now started the backbreaking task of cleaning away the thick layer of mud, and picking through the wreckage for anything that can be used. Early on Thursday, Philippines President Ferdinand Marcos Jr declared a state of emergency, the threshold of which involves mass casualty, major damage to property, and disruption to means of livelihoods and the normal way of life for people in the affected areas.EPAPeople have been sheltering in evacuation centres after flooding destroyed homes in Cebu, Philippines this week",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Typhoon Kalmaegi kills three in Vietnam after leaving 188 dead in Philippines",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/95a3/live/d9d56b00-bbe6-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-07T05:13:58.000Z",
      "dateModified": "2025-11-07T05:13:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]