[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential ch",
    "body": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Trump's big, long, State of the Union speech - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n32y2g?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-02-17T05:21:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·25 Feb 2026,·30 minsTrump's big, long, State of the Union speechAmericastAvailable for over a yearThe Americast team assembles for a late evening/early morning special as President Trump delivers the longest State of the Union address ever. On the agenda was a full-throated defence of the administration’s record, hailing a \"turnaround for the ages,” whilst playing down the Supreme Court's ruling against his signature tariff policy (with the judges themselves in the crowd).\nDespite the speech lasting nearly two hours,  there was little to suggest a change of course from Trump’s favourite taking points. He focused on the economy, immigration, the Democrats…. And the US men’s olympic hockey team.\nBut with growing voter dissatisfaction souring the polls, will Trump’s sales pitch be enough to counter sliding approval ratings and convince voters to stick with him for November's midterm election?\nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Anthony Zurcher, North America Correspondent\nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray, Grace Reeve and Kris Jalowiecki. The technical producer was Stephen Bailey. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Trump's big, long, State of the Union speech - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-02-17T05:21:00.000Z",
      "dateModified": "2026-02-17T05:21:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Woman's Hour - SEND reforms: A Woman's Hour and SEND in the Spotlight special - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/m002rql9?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0m1q1c4.jpg",
    "tag": "Trending",
    "date": "2026-02-24T12:23:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·24 Feb 2026,·58 minsSEND reforms: A Woman's Hour and SEND in the Spotlight specialWoman's HourAvailable for over a yearWoman's Hour in collaboration with our SEND in the Spotlight podcast brings you a special programme on the impact of the government's SEND reforms in England.\nWhether you’re a parent, a young person, a teacher or someone who works in the wider system we find out what the changes mean for you - and help you decode the new language - whether it's IB, ISP, Targeted, Targeted Plus, or SPP. \nNuala McGovern speaks to parents, teachers, charities, the School Standards Minister and the Children’s Commissioner for England.  We also hear from SEND in the Spotlight podcast regulars - actors Anna Maxwell Martin and Kellie Bright.\nSearch for the SEND in the Spotlight podcast on BBC Sounds.\nContributors:\nGeorgia Gould MP, Schools Standards Minister\nMarsha Martin, founder of Black SEN Mamas\nKatie Ghose, CEO of Kids charity and Disabled Children's Partnership\nMargaret Mulholland, Association of School and College Leaders\nKate McGough, BBC Education reporter\nEleanor Wright, solicitor at SOS!SEN\nRamandeep Kaur, SEND parent\nCarrie Grant, SEND parent and broadcaster\nKatie Nellist, SEND ambassador\nLouise Gittins, chair of the Local Government Association\nDame Rachel de Souza, Children's Commissioner for England\nPresenter: Nuala McGovern\nProducer: Sarah Crawley, with Carolyn Atkinson\nDigital producer: Olivia Bolton\nEditor: Karen DalzielProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Woman's Hour - SEND reforms: A Woman's Hour and SEND in the Spotlight special - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0m1q1c4.jpg"
      ],
      "datePublished": "2026-02-24T12:23:00.000Z",
      "dateModified": "2026-02-24T12:23:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mandelson's lawyers say he was arrested over 'baseless' claim he was a flight risk",
    "url": "https://www.bbc.com/news/articles/c05vey47yddo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/343b/live/b9dd85d0-1212-11f1-b048-c9424b2cf5fd.jpg",
    "tag": "Trending",
    "date": "2026-02-24T20:13:35.000Z",
    "description": "12 hours agoJoe Pike,Politics investigations correspondentandJoshua Nevett,Political reporterBBCLord Mandelson was arrested at his London home on Mond",
    "body": "12 hours agoJoe Pike,Politics investigations correspondentandJoshua Nevett,Political reporterBBCLord Mandelson was arrested at his London home on MondayLord Mandelson's lawyers have said police officers arrested the former ambassador to the US at his London home on Monday afternoon because they worried he was a flight risk.The peer's lawyers have told the BBC there is \"absolutely no truth\" in the suggestion that Lord Mandelson was planning to leave the UK and move abroad.The Metropolitan Police has said it will not comment.The former Labour minister was arrested on suspicion of misconduct in public office on Monday and later released on bail, pending further investigation.A spokesperson for Mishcon De Reya, Lord Mandelson's lawyers, said: \"Peter Mandelson was arrested yesterday despite an agreement with the police that he would attend an interview next month on a voluntary basis.\"The arrest was prompted by a baseless suggestion that he was planning to leave the country and take up permanent residence abroad. There is absolutely no truth whatsoever in any such suggestion.\"We have asked the MPS [Metropolitan Police Service] for the evidence relied upon to justify the arrest. \"Peter Mandelson's overriding priority is to cooperate with the police investigation, as he has done throughout this process, and to clear his name.\"Lord Mandelson was arrested on Monday afternoon and taken to Wandsworth police station in London for interview.He was at the police station for nine hours before being released on bail in the early hours of Tuesday morning.The force launched an investigation earlier this month over allegations that, while he was serving as a minister, Lord Mandelson had passed on market-sensitive government information to the late convicted paedophile Jeffrey Epstein.The arrest on Monday followed search warrants at two addresses in Wiltshire and Camden.The BBC understands that Lord Mandelson's position is he has not acted in any way criminally and that he was not motivated by financial gain.On Monday, Lord Mandelson was seen being led away from his London home by plain clothes officers who put him in the back of an unmarked car.The BBC understands his arrest was carried out by officers from the Met's central specialist crime division.Consultations between the police and the Crown Prosecution Service are ongoing.The Met said Lord Mandelson has been bailed to the end of May.The former Labour spin doctor has been a high profile figure in British politics for decades.He began working for Labour in the 1980s, playing a key role in the New Labour movement and Sir Tony Blair's landslide election victory in 1997.Lord Mandelson became the British ambassador to the US in February 2025 but was sacked in September after Downing Street said new information about the depth of his relationship with Epstein had emerged.The allegations against Lord Mandelson surfaced after the US Department of Justice released a tranche of documents last month, including emails between him and Epstein.An email from 2009 appears to show that Lord Mandelson passed on an assessment by an adviser to the then prime minister Gordon Brown about policy measures, including an \"asset sales plan\".He also appeared to discuss a tax on bankers' bonuses and confirm an imminent bailout package for the Euro on the day before it was announced in 2010.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mandelson's lawyers say he was arrested over 'baseless' claim he was a flight risk",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/343b/live/b9dd85d0-1212-11f1-b048-c9424b2cf5fd.jpg"
      ],
      "datePublished": "2026-02-24T20:13:35.000Z",
      "dateModified": "2026-02-24T20:13:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK weather: Spring-like warmth set to peak Wednesday as 18C forecast",
    "url": "https://www.bbc.com/weather/articles/cedzvwe1nn5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/99c9/live/313f4da0-1189-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-24T20:20:12.000Z",
    "description": "On Tuesday, temperatures in High Beach in Essex and Frittenden in Kent reached 16.6C.In Kinloss, in Moray, 13.7C was recorded. In Wales and Northern I",
    "body": "On Tuesday, temperatures in High Beach in Essex and Frittenden in Kent reached 16.6C.In Kinloss, in Moray, 13.7C was recorded. In Wales and Northern Ireland, temperatures fell a little short of those recorded at the weekend but still reached 15.2C and 13.4C in Hawarden and Helen's Bay respectively. The mercury could rise a little further still on Wednesday in south-east England with the liklihood of us seeing 18C (64F) in the best of the sunshine. Northern Ireland may also be a little warmer than on Tuesday,  following a wet start.In the north and west of the UK there will be more cloud and some rain, but temperatures even here will still be above average.To put this warmer weather into context - the last time the temperature reached 18C was 13 November 2025, and the record for February is 21.2C (70.2F) on 26 February 2019 at Kew Gardens.Wednesday is likely to be the peak of the warmth this week, with temperatures back to near average on the last day on February and a possible frost for many on Friday night.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK weather: Spring-like warmth set to peak Wednesday as 18C forecast",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/99c9/live/313f4da0-1189-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-24T20:20:12.000Z",
      "dateModified": "2026-02-24T20:20:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Harry and Meghan arrive in the Middle East for summit on refugees' needs",
    "url": "https://www.bbc.com/news/articles/c5ykqg09k6yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/32b8/live/d7e0f880-121e-11f1-9123-81d30b1ac5de.png",
    "tag": "Trending",
    "date": "2026-02-25T08:18:41.000Z",
    "description": "19 minutes agoThomas MackintoshPA MediaDuring their trip, Meghan and Harry will support the WHO's efforts to spotlight Jordan's leadership in the regi",
    "body": "19 minutes agoThomas MackintoshPA MediaDuring their trip, Meghan and Harry will support the WHO's efforts to spotlight Jordan's leadership in the regional humanitarian health responseThe Duke and Duchess of Sussex have arrived in the Middle East for their first international trip together in 18 months.Prince Harry and Meghan will spend two days visiting Jordan to highlight efforts to support vulnerable communities affected by conflict and displacement.The couple, who stepped down as working royals in 2020, have travelled to Amman at the invitation of Dr Tedros Adhanom Ghebreyesus, director-general of the World Health Organization (WHO).Their visit comes at time of crisis for the Royal Family following the arrest of Harry's uncle, Andrew Mountbatten-Windsor, on suspicion of misconduct in public office.Harry and Meghan arrived on Wednesday morning and were warmly greeted by Ghebreyesus on the steps of WHO's country office in Amman.Once inside, the couple joined a roundtable discussion hosted by the WHO with individuals from leading bodies including the United Nations and many of its agencies, diplomatic representatives, and donors.Over the next two days, Harry and Meghan are expected to meet Jordanian leaders and senior health officials.They are expected to engage with WHO teams, visit front line health and mental health programmes and meet World Central Kitchen staff who are co-ordinating food relief for Gaza from Amman.PA MediaThe Duke and Duchess of Sussex attended a WHO roundtable event with key donors and humanitarian partnersThe Sussexes will also visit the social development organisation Questscope's youth centre to hear from young people participating in creative and wellbeing programmes.They are expected to see initiatives they have helped fund to medically evacuate children from the war in Gaza to the Middle East nation.The couple first partnered with the WHO on a global campaign to encourage vaccine equity and co-hosted a high-level event at the UN General Assembly in 2021, and their charitable body has also worked with the organisation on its global initiative to help end violence against children.Since moving to California in 2020 for a new life the Sussexes have carried out a number of foreign visits that have taken the form of official trips they made when still part of 'The Firm' as the royal family is colloquially known.Harry and Meghan also spoke at a summit on digital responsibility staged in part by their Archewell Foundation.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Harry and Meghan arrive in the Middle East for summit on refugees' needs",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/32b8/live/d7e0f880-121e-11f1-9123-81d30b1ac5de.png"
      ],
      "datePublished": "2026-02-25T08:18:41.000Z",
      "dateModified": "2026-02-25T08:18:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chris Mason: MPs take a new tone on Andrew – but how big is their appetite for radical changes?",
    "url": "https://www.bbc.com/news/articles/cvgk3gpy34jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0ba7/live/38140330-1208-11f1-9fb1-ab2daaf1c707.jpg",
    "tag": "Trending",
    "date": "2026-02-25T02:45:43.000Z",
    "description": "6 hours agoChris MasonPolitical editorPAIt was quite a moment when a minister of the crown called the King's brother \"rude, arrogant and entitled\" at ",
    "body": "6 hours agoChris MasonPolitical editorPAIt was quite a moment when a minister of the crown called the King's brother \"rude, arrogant and entitled\" at the despatch box of the House of Commons.Granted, Sir Chris Bryant was almost as disobliging about Andrew Mountbatten-Windsor 15 years ago, as an opposition MP, when there were calls then for him to be sacked as the government's trade envoy.So Sir Chris's views about the former prince are not new but still, when speaking on behalf of the government, it tells you something about how the collapse in respect for Mountbatten-Windsor has been near total.But the debate in the Commons, triggered by a Liberal Democrat demand for documents relating to the former prince's appointment as a trade envoy to be published, was not a case study in and of itself in a collapse of parliamentary deference around the Royal Family.Andrew Mountbatten-Windsor has effectively been fired out of a cannon — disowned by the Royal Family and the political classes, and stripped of his titles.But remarks were much more muted, restrained or simply absent about remaining senior royals.There were, though, some concerns expressed about those conventions — and a sense from some that for too long custom had been the midwife of deference and that must change.MPs back move to release files on Andrew's appointment as trade envoyAndrew is Prince William's problem too - and it makes his future job harderHow much could Andrew's arrest hurt the Royal Family?Why the limitations on criticising the royals, asked some. Why limit the capacity of the Freedom of Information Act to allow probing questions of the monarchy? Why not have a public inquiry into all of the recent revelations?The government has said it will publish the documents relating to the appointment of the former prince 25 years ago. But they are more circumspect about those other requests, while saying they want to press on \"at pace\" in removing Mountbatten-Windsor from the line of succession.But let's see how sustained and broad — or the opposite — the appetite for radical change around conventions really is.Such things have a British habit of being rather sticky. But perhaps the drip, drip of disclosures and developments may shift things. Let's see.It is also true that there is a subtlety to these conventions. Debate about the Royal Family isn't banned – the House of Commons Library points to the Counsellors of State Act 2022, which was fully debated in the Commons and the Lords.And, clearly, the Royal Family is treated as different to the rest of us, in Parliament and beyond. Some cherish this, some don't, but it is a fundamental reality of a hereditary monarchy.One final observation. In a parliamentary debate a week after the King's brother was arrested as part of a criminal investigation into his conduct, no MPs stood up and made a first-principles, direct argument for the abolition of the monarchy.Granted, the debate was sparsely populated for much of the discussion and there are MPs in the Commons right now who would prefer an elected head of state to the current constitutional arrangements.But the case for a republic appears to be a first-order concern to fewer MPs now than it has been in the past.And, perhaps counterintuitively to some given what many see as the rolling horror show of revelations right now, this moment is yet to provoke, among many parliamentarians at least, a debate about the fundamentals of the UK's constitutional settlement.For those in Buckingham Palace braced for whatever might come next in this saga, that may be at least some consolation.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chris Mason: MPs take a new tone on Andrew – but how big is their appetite for radical changes?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0ba7/live/38140330-1208-11f1-9fb1-ab2daaf1c707.jpg"
      ],
      "datePublished": "2026-02-25T02:45:43.000Z",
      "dateModified": "2026-02-25T02:45:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paramount boosts Warner Bros offer to rival Netflix in takeover bid",
    "url": "https://www.bbc.com/news/articles/c24dz0683dyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/feca/live/6ce23f40-11dc-11f1-b048-c9424b2cf5fd.jpg",
    "tag": "Trending",
    "date": "2026-02-25T00:01:02.000Z",
    "description": "9 hours agoNatalie ShermanBusiness reporterReutersParamount Skydance has boosted its proposal to buy Warner Bros Discovery, with an offer that could f",
    "body": "9 hours agoNatalie ShermanBusiness reporterReutersParamount Skydance has boosted its proposal to buy Warner Bros Discovery, with an offer that could finally knock rival bidder Netflix out of the game. Warner Bros, which put itself up for sale last year, said Paramount had agreed to increase its purchase offer by $1 per share, creating a bid that its board had determined \"could reasonably be expected to lead to a ... superior proposal\".Warner Bros said it would engage in further talks before making a final decision about whether to abandon the deal it struck with Netflix in December.Netflix, which would have four days to make a counter-offer, did not immediately comment. In a recent interview with the BBC, Netflix co-chief executive Ted Sarandos declined to say whether the company was prepared to engage in a bidding war, calling the back-and-forth \"part of the process\".\"I don't want to do hypotheticals,\" he said, before the new Paramount bid was made. \"We very much like the deal where we're at right now, we're very disciplined buyers and we always have been.\"\"This is all a process of price-discovery,\"  he added later. Paramount, which is backed by tech billionaire Larry Ellison and led by his son David, has waged an outspoken campaign to buy Warner Bros since last year as it looks to transform itself into a Hollywood heavyweight. But Warner Bros has so far spurned Paramount's offers. Instead, in December it said it had agreed to sell its film and streaming divisions, including HBO, to Netflix in a deal worth $27.75 per share or roughly $82bn (£61bn), including debt.Warner Bros said it would spin-off the remainder of its business, including traditional television networks and the news channel CNN, as an independent company.After getting rejected, Paramount has sweetened its original proposal, which called for paying $30 per share to take over the entire company. But this is the first time the company has officially agreed to pay more.Warner Bros said Paramount had now offered to pay $31 per share in cash, with additional money due if completion is delayed. It has also agreed to pay $7bn should the deal fall through and cover the $2.8bn fee Warner Bros had agreed to pay Netflix in the event of a break-up of the merger plan. Warner Bros said its board had not made a final determination on what to do. Lawmakers have raised concerns about both proposals, citing monopoly considerations and the impact on the wider entertainment industry. In a hearing in Washington earlier this month, Sarandos faced questions about potential price rises and the future of cinemas. The Ellison family's ties to the Trump administration have also drawn attention from Democrats. Warner Bros said the firm would \"engage further ... to determine if a proposal that constitutes a company superior proposal ... can be reached,\" it said.In an interview before Paramount's offer was revealed, Luke Stillman, managing director at the US media and advertising consultancy Madison and Wall, said he thought Warner Bros was looking to create a bidding war. He said he thought the price could ultimately go as high as $33 per share. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paramount boosts Warner Bros offer to rival Netflix in takeover bid",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/feca/live/6ce23f40-11dc-11f1-b048-c9424b2cf5fd.jpg"
      ],
      "datePublished": "2026-02-25T00:01:02.000Z",
      "dateModified": "2026-02-25T00:01:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MPs openly criticising Andrew reflects shift in tradition",
    "url": "https://www.bbc.com/news/articles/c9wny21kkd9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cbe5/live/307c0fc0-11ac-11f1-a8f6-f18f581059b8.jpg",
    "tag": "Trending",
    "date": "2026-02-24T20:29:41.000Z",
    "description": "12 hours agoDaniela RelphSenior royal correspondentGetty ImagesThe MPs in the chamber did not hold back. This was new territory – hearing politicians ",
    "body": "12 hours agoDaniela RelphSenior royal correspondentGetty ImagesThe MPs in the chamber did not hold back. This was new territory – hearing politicians openly criticising a member of the Royal Family in a parliamentary debate was striking.The language was stark. We heard Andrew Mountbatten-Windsor was \"a rude, arrogant, entitled man who could not distinguish between the public interest, which he said he served, and his own private interest\".For Buckingham Palace, it may have been an uncomfortable watch at times.MPs shared their personal experiences of meeting the former prince – all of them were resoundingly negative. The debate, called by the Liberal Democrats to demand the release of documents relating to Andrew's 2001 appointment as UK trade envoy, took in privilege, deference, and holding power to account. The talk was of building a culture of accountability and transparency.MPs questioned Andrew's appointment and what oversight existed during his decade-long tenure, and if lessons had been learned following allegations he shared sensitive information with convicted sex offender Jeffrey Epstein.Andrew has not responded to the BBC's requests for comment on specific allegations that have emerged after the US release of files in January related to Epstein. He has previously denied any wrongdoing in relation to the late financier.The fact that this debate happened at all is in itself significant. It reflects the heat of the Andrew story and how conventions are shifting with the public mood.Buckingham Palace will not be getting involved in the details of what we heard today, but their position remains the same. Their focus is on supporting the police investigation and they will not be saying anything that could impact the proper process of the law.Erskine May, the guide to parliamentary procedure first published in 1844, says MPs should not put a question before Parliament which \"casts reflections upon the sovereign or the Royal Family\".That has generally been treated more as guidance than an official ban on discussing or criticising the Royal Family in Parliament.Decisions on royals being talked about in Parliament have been managed by the Speaker of the House, with a nod to convention and historical precedent.Over the years, MPs have generally abided by that approach - sometimes grudgingly.Today was perhaps the closest Parliament had come to removing those bandages.The level of public interest and the mounting questions around Andrew's work as trade envoy made it worthy of parliamentary debate.Several MPs said the public deserved clarity about the nature of his official role and how concerns, if raised at the time, were handled.It was, of course, a debate with limitations due to the ongoing police investigation but even hearing the small number of MPs in the chamber openly discussing stories that had existed in the shadows for so long felt impactful.Today was a reminder that public mood is moving fast and conventions must sometimes shift with it.Liberal Democrat leader Ed Davey, who led the debate, called the Jeffrey Epstein associations with the British establishment a \"stain\" on the UK and said today's debate had been an opportunity to \"clean away that stain with the disinfectant of transparency\".More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MPs openly criticising Andrew reflects shift in tradition",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cbe5/live/307c0fc0-11ac-11f1-a8f6-f18f581059b8.jpg"
      ],
      "datePublished": "2026-02-24T20:29:41.000Z",
      "dateModified": "2026-02-24T20:29:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NewJeans: Ex-K-pop boss Min Hee-jin offers to forgo compensation if label drops lawsuits",
    "url": "https://www.bbc.com/news/articles/c98qd17e274o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9e00/live/0b343b40-121d-11f1-9123-81d30b1ac5de.jpg",
    "tag": "Trending",
    "date": "2026-02-25T07:54:46.000Z",
    "description": "Don't break up NewJeans and I'll forgo $18m payout, says ex-K-pop boss43 minutes agoKelly NgandHosu Lee,SeoulGetty ImagesMin said she \"can no longer b",
    "body": "Don't break up NewJeans and I'll forgo $18m payout, says ex-K-pop boss43 minutes agoKelly NgandHosu Lee,SeoulGetty ImagesMin said she \"can no longer bear to watch\" NewJeans get \"torn apart\" when its five members \"should instead be standing happily on stage\"The ex-boss of NewJeans' record label has offered to forgo a 25.6bn won ($17.9m; £13.2m) payout if entertainment giant Hybe drops all lawsuits against the K-pop group.Min Hee-jin said she \"can no longer bear to watch\" NewJeans get \"torn apart\" when its five members \"should instead be standing happily on stage\". The chart-topping band has been locked in a bitter feud with its label Ador, a Hybe subsidiary, since it sacked Min as the label's CEO in August 2024.NewJeans, who saw Min as a mentor, announced they would leave the agency following her dismissal, but a South Korea district court ruled last October that they must honour their contract with Ador, which runs until 2029.In a separate ruling earlier this month, the court sided with Min in a put option dispute with Hybe, ordering the entertainment giant to pay her 25.6bn won.A put option is a contract that gives its owner the right to sell an asset at a future date at a predetermined price.Hybe has appealed against the ruling.\"I'm here because there are values I desperately want more than a large sum of money,\" Min said on Wednesday, noting that NewJeans was the main reason behind her decision to give up the payout.Min has called for the withdrawal of all ongoing civil and criminal lawsuits against NewJeans members, as well as external partners, former Ador employees, and fans who have been drawn into the conflict.\"Only then will the artistes, their families, and their fans be free from further unnecessary noise,\" she said.Hybe has yet to respond to her offer.NewJeans, who became the eighth biggest-selling act in the world a year after their debut in 2022, were seen as a game-changer by critics for their blend of 1990s R&B and sugar-coated pop melodies. Their dramatic row with Hybe has rocked the K-pop world. Fans around the world have taken to social media urging the agency to \"free NewJeans\".\"It's not fair at all. Free NewJeans [all 5 members],\" a fan wrote on Instagram after Marsh's termination last year. \"All they wanted to do was to be [artists] and make their fans happy.\"Min's statement on Wednesday echoed these sentiments. She concluded it by addressing Hybe's chairman Bang Si-hyuk: \"Let us now meet not in the courtroom, but in the space of creation\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NewJeans: Ex-K-pop boss Min Hee-jin offers to forgo compensation if label drops lawsuits",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9e00/live/0b343b40-121d-11f1-9123-81d30b1ac5de.jpg"
      ],
      "datePublished": "2026-02-25T07:54:46.000Z",
      "dateModified": "2026-02-25T07:54:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NHS secures bone cement rescue package so surgery can resume",
    "url": "https://www.bbc.com/news/articles/cnv670d128go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5c31/live/6786e2d0-11d7-11f1-bd07-7dc7b5f46c6b.jpg",
    "tag": "Trending",
    "date": "2026-02-25T00:08:16.000Z",
    "description": "8 hours agoNick TriggleHealth correspondentGetty ImagesThe NHS says it has secured a rescue package of alternative medical cement to allow joint surge",
    "body": "8 hours agoNick TriggleHealth correspondentGetty ImagesThe NHS says it has secured a rescue package of alternative medical cement to allow joint surgery to continue.Last week hospitals had been told to postpone treatments, including knee and hip replacements, after the health service's main supplier encountered a major production problem.The NHS was thought to have only two weeks' supply in stock and so was focussing on emergency patients and the most complex cases on the waiting list.But NHS England believes the shortfall will now be covered after a new supplier was found and an existing supplier agreed to up its deliveries.Prof Tim Briggs of NHS England said: \"This shortage has been extremely concerning for patients and surgeons and we are delighted the NHS has now been able to secure this 'rescue package' of alternative bone cement to ensure trauma and elective care can continue across the country.\"he said the NHS would be in touch with patients who have had their operations cancelled and  they would be rescheduled as soon as possible.Heraeus Medical, which supplies around three-quarters of the bone cement used by the NHS, had to temporarily halt production at its main site in Germany last week.It said it had experienced a critical machine failure when it was in the process of upgrading its production processes. It is expected to cause disruption to supply for two months.The product is used in more than 1,000 operations a week, including in joint replacements and to treat older patients who have suffered falls and those with broken hips.Currently there are 850,000 patients on the waiting list in England requiring planned treatment for their joints – the largest of any speciality.But the NHS has now secured enough for 10 to 12 weeks' supply of bone cement from Dutch manufacturer Zimmer Biomet, with the first stocks already in the country.One of the NHS's other suppliers – Johnson and Johnson – has said it can increase its deliveries too.The extra supplies will also be available to hospitals in other parts of the UK which were affected too.Fergal Monsell of the British Orthopaedic Association said: \"The alternative bone cement has been widely used since 2008 and has been assessed by surgical experts who confirm that it has the same chemical components and material properties. \"Patients can therefore be reassured that it this will not affect the outcome of their surgery.\"Health minister Zubir Ahmed said he was delighted by the breakthrough: \"This government's top health priority is cutting NHS waiting lists – and while it's good news that disruption has been minimised, our focus is now on rescheduling those procedures that were postponed.\"Get our flagship newsletter with all the headlines you need to start the day. Sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NHS secures bone cement rescue package so surgery can resume",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5c31/live/6786e2d0-11d7-11f1-bd07-7dc7b5f46c6b.jpg"
      ],
      "datePublished": "2026-02-25T00:08:16.000Z",
      "dateModified": "2026-02-25T00:08:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'US shuns war anniversary' and 'Prince of Darkness'",
    "url": "https://www.bbc.com/news/articles/ckgl4588ryxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c67c/live/2e70f450-11ea-11f1-b048-c9424b2cf5fd.png",
    "tag": "Trending",
    "date": "2026-02-25T06:18:57.000Z",
    "description": "2 hours agoThe fourth anniversary of the war in Ukraine leads the Financial Times, which pictures Ukrainian President Volodymyr Zelensky alongside oth",
    "body": "2 hours agoThe fourth anniversary of the war in Ukraine leads the Financial Times, which pictures Ukrainian President Volodymyr Zelensky alongside other European leaders holding commemorative candles during a ceremony in Kyiv's Independence Square on Tuesday. The headline reads \"US shuns war anniversary\", noting that the Trump administration did not send a representative to Kyiv for the ceremony.\"Prince of Darkness\" declares the Daily Star, following the arrest and subsequent release of former US ambassador Lord Mandelson on suspicion of misconduct in public office. The paper pictures the former Labour minister leaving the police station in the early hours of Tuesday morning. The BBC understands that Lord Mandelson's position is he has not acted in any way criminally and that he was not motivated by financial gain.The Guardian says that Lord Mandelson was arrested over concerns that he was a flight risk, and reports that his lawyers say Scotland Yard previously agreed to interview the peer under caution next month rather than arrest him. According to the paper, the Met was told Lord Mandelson was preparing to move abroad to the British Virgin Islands, a claim his lawyers have dismissed as \"baseless\".\"Flight-risk fiction led to my arrest\" is the headline on the Times story about Lord Mandelson. Police declined to comment when asked by the paper the conditions of Lord Mandelson's arrest, including whether or not he had been forced to surrender his passport. The Telegraph says that officials have now confirmed that they will release documents related to Lord Mandelson's work in government in early March, but notes that MPs will have the final say over what is made available to the public.\"Minister attacks 'rude, arrogant' Andrew in historic Commons rebuke\" declares the i Paper, following what it calls an \"unprecedented political attack\" on the former prince by trade minister Chris Bryant. According to the paper, he said Andrew Mountbatten-Windsor was a man \"on a constant self-aggrandising and self-enriching hustle\".Andrew is pictured on the front page of the Sun under the headline \"Get orf your high horse Andy\", following reports that the former prince has been banned from horse riding in the wake of his arrest.The Mail features a political piece on the front page of its Wednesday edition, which takes a look at the Green Party's immigration policy. The paper says that under the proposed policy, illegal migrants would be given a free house and a wage with \"no requirement to work\", in addition to free use of the NHS. \"Beware the green menace,\" the paper warns.Former Labour Prime Minister Gordon Brown has penned a piece for the Mirror to warn voters of the \"dark days of Tory austerity\", ahead of a by-election in Gordon and Denton. He writes that \"poorer children will suffer the most\" under Reform UK, and adds that the Nigel Farage's party plans to cut the rights of works and renters.\"Tough porn crackdown to tackle abuse\" says the Metro, which says that new laws will make it illegal to create or possess pornographic content which portrays incest or \"twisted family sex\". The changes are part of an amendment to last year's Crime and Policing Bill, which entered Parliament on Monday, and are designed to protect women and girls.The Express leads on new research that suggests that \"millions\" of people in the UK went without healthcare that they needed last year.The Sun reports that Andrew Mountbatten-Windsor has been given a riding ban. Royal aides reportedly fear him being seen grinning on horseback is a \"bad look\" while under investigation for allegedly leaking secrets to Jeffrey Epstein. \"Get orf your high horse, Andy\", is the Sun's headline.The Daily Express leads on a poll which suggests 48% of adults avoided or delayed contacting their GP about a health concern last year. The finding is based on a survey of 2,200 people. Reasons for putting off a visit included problems contacting surgeries and the expectation of not getting a suitable appointment time. The Guardian says the results \"underline the public concern\" about getting fast access to NHS services.Getty ImagesAt the count at the Haltemprice and Howden by-election in 2008The Financial Times features a photograph of Ukrainian President Volodymyr Zelensky leading commemorations in Kyiv on the fourth anniversary of Russia's full-scale invasion. The paper says while \"most European nations sent either leaders or senior officials\" there was no one from the Trump administration. The Daily Star's editorial strikes a sombre tone. \"We pray,\" the paper says, \"for an end to this conflict soon.\"And the Times notes that even though broadcasters are \"tiring\" of the obligation to read out all 11 candidates in the Gorton and Denton by-election, the situation \"could be worse\". The paper reminisces about the record 26 candidates who stood in Haltemprice and Howden in 2008. The list included the Church of Militant Elvis Party, the Miss Great Britain Party and the conspiracy theorist David Icke.Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'US shuns war anniversary' and 'Prince of Darkness'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c67c/live/2e70f450-11ea-11f1-b048-c9424b2cf5fd.png"
      ],
      "datePublished": "2026-02-25T06:18:57.000Z",
      "dateModified": "2026-02-25T06:18:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who is Abigail Spanberger, the Democrat who gave the State of the Union response?",
    "url": "https://www.bbc.com/news/articles/ce8w2r69wyeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/59ee/live/d2a3eac0-121f-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-25T05:28:54.000Z",
    "description": "3 hours agoAna FaguyWashington Spanberger delivers Democratic response to Trump addressAbigail Spanberger, the first female governor in Virginia's his",
    "body": "3 hours agoAna FaguyWashington Spanberger delivers Democratic response to Trump addressAbigail Spanberger, the first female governor in Virginia's history, attacked President Donald Trump's economic and immigration policies during Democrats' response to the State of the Union address.She questioned whether the president was working to make life more affordable and safer for Americans, while criticising Trump's immigration crackdown in US cities and tariffs on imports.The rebuttal - first delivered in 1966 by a rising star in the opposing party - came just moments after Trump finished his remarks on Capitol Hill. Spanberger, 46, was elected as Virginia's governor in November after serving in Congress and working as a CIA officer.\"Tonight the president did what he always does,\" she said of Trump's remarks. \"He lied, he scapegoated, and he distracted, and he offered no real solutions to our nation's pressing challenges, so many of which he is actively making worse.\"She began her speech laying out three questions she wanted Americans to ask themselves: is the president working to make life more affordable, is the president working to keep America safe at home and abroad, and is the president working for you. Spanberger said the answer to all three of those questions is no. She attacked the Trump administration's Immigration and Customs Enforcement (ICE) raids in Democrat-led cities, and applauded resistance to the efforts in Minneapolis. \"Our president has sent poorly trained federal agents into our cities where they have arrested and detained American citizens and people who aspire to be Americans,\" she said. \"And they have done it without a warrant.\"Reuters\"They have killed American citizens in our streets. And they have done it all with their faces masked from accountability.\"Federal agents shot and killed Alex Pretti and Renee Good - both US citizens - last month during immigration enforcement operations in Minneapolis. The Trump administration replaced the top official and withdrew agents from the city following an outcry after the deaths. Spanberger also criticised the rising costs of housing and healthcare, and described Trump's tariff policy as \"reckless\". She claimed his policies have cost American families $1,700 (1,260£) each. Even though the Supreme Court ruled against the Trump administration's tariff policy, Spanberger said \"the damage to the American people has already been done\". She said Republicans in Congress, by failing to oppose the president, are costing Americans.\"They're making your life harder,\" the governor said. \"They're making your life more expensive.\"The selection of Spanberger to deliver the Democratic rebuttal to Trump represented little political risk for Democrats. She was elected a few months ago and cannot run for re-election, since Virginia has a one-term limit.In her rebuttal speech, she suggested Democrats could be in a good position to win seats in Congress in November's midterm elections, noting that she ousted a Republican incumbent in 2018 to win a seat in US Congress and helped Democrats secure a majority.\"In my case, I was the first Democrat elected in 50 years, swinging our district17 points,\" Spanberger said.She said her fellow Democrats running in November will be \"working to lower costs -  we are working to keep our communities and our country safe, and we are working for you\".In the November election, Spanberger won 57.6% of the vote in one of the first major US races after Trump was re-elected.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who is Abigail Spanberger, the Democrat who gave the State of the Union response?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/59ee/live/d2a3eac0-121f-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-25T05:28:54.000Z",
      "dateModified": "2026-02-25T05:28:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Driver admits causing death of Willingham mother pushing pram",
    "url": "https://www.bbc.com/news/articles/c4gql405dydo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a486/live/6f9bbdf0-11b0-11f1-9c3e-09b6f259d76e.jpg",
    "tag": "Trending",
    "date": "2026-02-24T18:35:40.000Z",
    "description": "14 hours agoBrian FarmerFamily handoutMr Tuczemskyi said his partner Rebecca Ableman \"helped so many people\" both in her work and personal lifeA lorry",
    "body": "14 hours agoBrian FarmerFamily handoutMr Tuczemskyi said his partner Rebecca Ableman \"helped so many people\" both in her work and personal lifeA lorry driver has admitted causing the death of a woman who was struck on the head by crane equipment while pushing a pram.Rebecca Ableman, 30, was with her two-year-old daughter Autumn on the pavement by the B1050 in Willingham, Cambridgeshire, when she was hit in September 2022.Kevin Miller, 71, of Gayton Road, King's Lynn, Norfolk, admitted causing death by careless or inconsiderate driving at a hearing in Peterborough Crown Court, officials said.Court staff said he was due to be sentenced on 14 April.Family handoutRebecca Ableman was pushing her two-year-old daughter Autumn in her pram through the village where she livedMiller had gone on trial last year after denying causing death by dangerous driving - when detail of the incident emerged.The trial was halted in April and a new trial was due to start this week.Ms Ableman, who lived in Willingham, had left a farm shop in Station Road with her daughter when she was struck by the equipment at about 11:15 BST.She died from head and brain injuries three weeks later.Family handoutRebecca Ableman with daughter Autumn and partner Chris TuczemskyiProsecutors said Miller was transporting scrap metal from King's Lynn docks to two Network Rail depots in Essex and Cambridgeshire on 22 September.As he passed through Willingham, loose unsecured crane equipment moved from its position and was hanging over the edge of a trailer, the court heard.Miller said he did not know there had been an incident until he was arrested.Kevin Miller has admitted causing death by careless or inconsiderate drivingMore on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Driver admits causing death of Willingham mother pushing pram",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a486/live/6f9bbdf0-11b0-11f1-9c3e-09b6f259d76e.jpg"
      ],
      "datePublished": "2026-02-24T18:35:40.000Z",
      "dateModified": "2026-02-24T18:35:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Carmarthenshire woman spiked on night out says spiking can happen anywhere",
    "url": "https://www.bbc.com/news/articles/clygnvw2q3qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/edca/live/f4924270-109a-11f1-9852-a7aef0355ca9.jpg",
    "tag": "Trending",
    "date": "2026-02-25T06:08:09.000Z",
    "description": "I dropped to the floor and couldn't move - spiking can happen anywhere2 hours agoAnnell DyfriBBC WalesBBCTirion had been out with friends for drinks i",
    "body": "I dropped to the floor and couldn't move - spiking can happen anywhere2 hours agoAnnell DyfriBBC WalesBBCTirion had been out with friends for drinks in Cardigan when she \"suddenly dropped to the floor\"A woman who says her drink was spiked on a night out wants people to be aware that spiking can happen in rural areas as well as larger towns and cities.Tirion Richards, 31, said she was conscious but unable to see, move her legs or lift her head following the incident in Cardigan, Ceredigion, in January.Spiking - when alcohol or drugs are given to a person without them knowing or agreeing - is a criminal offence which carries a sentence of up to ten years in prison.Dyfed-Powys Police said spiking could \"happen anywhere, no matter one's age, gender, sexuality or ethnicity\".'Collapsed on the floor'Tirion, from Brechfa in Carmarthenshire, had been out for drinks with friends and was walking back to her mum's house afterwards when she \"suddenly dropped to the floor\".\"I remember that I couldn't move my legs. I was really struggling to put one foot in front of the other and I remember linking both of my friends' arms and they were trying to help me walk and I just couldn't even stand up.\"She said her friends carried her to her sister's house where she \"collapsed on the floor and I remember I was conscious but couldn't see anything\".\"I was choking on my vomit because I wasn't even lifting my head forward to be sick.\"Getty ImagesSpiking is giving someone alcohol or drugs without them knowing or agreeing, for example in their drink or with a needleWhen Tirion woke up the following morning, she felt very unwell and initially believed she was hungover until she began piecing the night's events together.She reported the incident to the police via 101 and gave a statement and urine sample, for which she is still awaiting the results.Tirion said she felt violated and upset about what could have happened to her.\"I'm quite shaken actually, because it made me unwell for a couple of days.\"She said she was \"very surprised\" that it had happened in a rural area and decided to share her story on social media.Many women contacted her to share their own experiences, the vast majority of whom said they had not reported what happened to the police.One of the women who contacted Tirion was Lorraine Beattie, who also said she was spiked while at a birthday drinks in a pub in Cardigan.\"It could've killed me, if I had not been with sensible people who demanded an ambulance,\" said Lorraine.Lorraine said she went to the party mid-afternoon and remembered \"feeling really enclosed, the room was just becoming really small, it was a really weird feeling\".She said that she bought two glasses of wine but felt unwell, \"phasing out a little\", after the second drink.\"There were lots of people back and forth from the bar and table as it was a birthday and I did leave my drink unattended.\"I don't remember anything, because I was unconscious and vomiting on the floor.\"Lorraine said she woke up in hospital \"covered in vomit, it was all in my hair, all over my face\".'Inhumanity'Lorraine said while she was grateful for the treatment she received in hospital, medical staff initially suspected she was drunk, before blood tests \"proved I was not intoxicated by alcohol\".\"The doctor asked what recreational drugs I had taken - this is the point when I realised I had been spiked,\" she said.\"It's the inhumanity of the evil person that did this to me that's unforgivable. They will kill somebody doing this,\" she added.Dawn Dines, CEO of the charity Stamp Out Spiking, said there was a misconception that spiking only happened \"in the big cities, in Cardiff, London, in Manchester, you know, all the big cities, but that really is not the case. Spiking can happen at any place, at any time, and to anybody\".\"We believe that the government should really be putting some sort of funding into training bar staff, door security. We also think that they should be possibly funding to get some of these drink covers put into bars and restaurants,\" she added.A Home Office spokesperson said: \"Nobody should ever have to worry about their safety on a night out when they should be enjoying themselves.\"We are already working with bars, pubs and venues across the country to roll out free, specialist training for staff, supporting police with pilots of new tactics, and have introduced a new criminal offence for spiking to help victims come forward and bring more offenders to justice.\"A Cardiff University report found that 91% of spiking victims were female and 55% were between the ages of 18 and 25.Prof Simon Moore, Director of the Violence Research Group at Cardiff University, said: \"Spiking is a crime that predominantly targets young people, anyone could become a victim of - it can be carried out by people you know and strangers. \"With the various forms of spiking and the motivations behind spiking, we must get an in-depth understanding of who is being impacted by spiking and how people are being spiked.\"More top stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Carmarthenshire woman spiked on night out says spiking can happen anywhere",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/edca/live/f4924270-109a-11f1-9852-a7aef0355ca9.jpg"
      ],
      "datePublished": "2026-02-25T06:08:09.000Z",
      "dateModified": "2026-02-25T06:08:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]