[
  {
    "title": "Elvis",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002nzws?at_mid=mGEMw411dH&at_campaign=Elvis&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002nzws&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Elvis&at_bbc_team=BBC&at_creation=Film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mlkz71.jpg",
    "tag": "Trending",
    "date": "2025-12-27T22:12:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeElvisElvisContains some strong language.Elvis Presley's story seen through the lens of his complicated relationship with his enigmatic manager, Colonel Tom Parker. Duration2h 26mFirst shown2022Available for 25 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesCall the MidwifeThe nurses of Nonnatus House face up to a country fizzing with change and challenge.The War Between the Land and the SeaWe inherited their world - they want it back. When oceans rise, whose side do you choose?ShetlandEven the most beautiful places have a dark side. Detective Jimmy Perez returns homeDeath in ParadiseDon't be fooled by the beautiful island of Saint-Marie - even paradise can be murder.OppenheimerCillian Murphy stars as the man who built the bomb - and changed the world forever2h 49mBeyond ParadiseNew adventures for DI Humphrey Goodman. Back from Saint Marie to a new life in DevonFour Weddings and a FuneralHe's quite engaging. She's already engaged. Hugh Grant in Richard Curtis' timeless tale1h 52mReturn to ParadiseComing home can be tough, but sometimes it's murder. An Aussie twist on Death in ParadiseBack to the FutureGreat Scott! The most iconic time-travel adventure ever told, starring Michael J. Fox1h 49mMission: ImpossibleGlobal threats, daring stunts and one agent's fight to save the world. Tom Cruise stars1h 43mPrisoner 951Drama based on the true story of Nazanin Zaghari-Ratcliffe and the struggle to free her.The HolidayKate Winslet stars. Sometimes the heart needs a holiday to find where it truly belongs2h 7m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elvis",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mlkz71.jpg"
      ],
      "datePublished": "2025-12-27T22:12:00.000Z",
      "dateModified": "2025-12-27T22:12:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Puss in Boots: The Last Wish",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002nzvn?at_mid=7iCYilTXXa&at_campaign=Puss_in_Boots_The_Last_Wish&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002nzvn&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Puss_in_Boots_The_Last_Wish&at_bbc_team=BBC&at_creation=Film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0ml96qz.jpg",
    "tag": "Trending",
    "date": "2025-12-26T16:53:25.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomePuss in Boots: The Last WishPuss in Boots: The Last WishTo restore his nine lives, Puss must beat a host of fairy-tale characters to the magical map of the Wishing Star, but a fearful adversary is on his trail. Duration1h 32mFirst shown2022Available for 24 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesMinions: The Rise of GruA villain will rise! In 70s suburbia, Gru plots his world take over. It's not going well1h 20mPuss in BootsNine lives. One destiny. Puss takes on Jack and Jill to get a goose that lays golden eggs1h 21mPaddington 2Magic. Mystery. Marmalade. Paddington's only a small bear... but he’s in big trouble1h 37mPeter RabbitBorn to be wild. Peter had the perfect life, until a new neighbour changed everything1h 25mMinionsIt's going to be a blast. They've had despicable masters, but this one might destroy them1h 24mDespicable Me 2Back to being bad, or maybe a little good. Gru goes undercover to find a new supervillain1h 31mHow to Train Your Dragon 3: The Hidden WorldFly on your own. A fight to the ends of the Earth to save the dragons from evil1h 33mDespicable MeBeing good's SO overrated. Gru’s out to steal the moon - if his heart isn't stolen first1h 28mThe Scarecrows' WeddingTwo devoted scarecrows dream of wedding bliss - until a rival plots to ruin all this25 minsWallace & Gromit: The Curse of the Were-RabbitIt gnaws no fear... The duo's pest control business takes action against a huge rabbit1h 16mShaun the SheepShaun, Bitzer and the flock are always getting into mischiefThe Croods: A New AgeAll in a day's survival. The Croods face their biggest challenge yet - another family!1h 26m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Puss in Boots: The Last Wish",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0ml96qz.jpg"
      ],
      "datePublished": "2025-12-26T16:53:25.000Z",
      "dateModified": "2025-12-26T16:53:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Were our 2025 predictions right? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mpqcjw?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-12-24T07:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·24 Dec 2025,·35 minsAvailable for over a yearWhat did the Americast team get right when they made their predictions for what the big news stories of 2025 might be? Justin, Anthony, Sarah and Marianna look back at a tumultuous year for Donald Trump in his second term, which include deportation raids, Elon Musk’s role, the war in Gaza, the US shutdown and more. It’s time to open up the Americast time capsule of predictions and find out what we got right and what we got wrong…\nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Anthony Zurcher, North America Correspondent\n• Marianna Spring, Social Media Investigations Senior Correspondent \nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray and Grace Reeve. The technical producer was Jonny Hall. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Were our 2025 predictions right? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-12-24T07:00:00.000Z",
      "dateModified": "2025-12-24T07:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Newscast Review of the Year 2025 - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mqch0p?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-24T12:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·24 Dec 2025,·52 minsThe Newscast Review of the Year 2025NewscastAvailable for over a yearAdam, Chris, Laura and Paddy go through the biggest stories of 2025 with the help of economics editor Faisal Islam and international editor Jeremy Bowen.\nThey also reveal what it was like to be on the inside as they happened, and discuss how Keir Starmer will reflect on his first full year as prime minister, how Donald Trump's tariffs reshaped the world's economy, and how a ceasefire between Israel and Hamas was reached.\nAnd we look at where the rise of Nigel Farage’s Reform UK and Zack Polanski’s Green Party have left politics in the UK.\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenters were Adam Fleming, Chris Mason, Laura Kuenssberg and Paddy O’Connell. It was made by Chris Flynn. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Newscast Review of the Year 2025 - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-24T12:00:00.000Z",
      "dateModified": "2025-12-24T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Keir Starmer vows to 'defeat decline and division' in new year message",
    "url": "https://www.bbc.com/news/articles/c98p5p6rmm2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f5b6/live/0b723b90-e660-11f0-a8f2-d9e8fba7dc3b.png",
    "tag": "Trending",
    "date": "2026-01-01T06:43:29.000Z",
    "description": "2 hours agoBecky MortonPolitical reporterDowning StreetPrime Minister Sir Keir Starmer has promised to \"defeat the decline and division offered by oth",
    "body": "2 hours agoBecky MortonPolitical reporterDowning StreetPrime Minister Sir Keir Starmer has promised to \"defeat the decline and division offered by others\" in his new year message, as he insisted 2026 would see people feel \"positive change\" in their lives.He acknowledged \"things have been tough in Britain for a while\" but said the public should now start to see improvements including lower bills, more police on the streets and new health hubs.It has been a difficult year for the PM, who has been battling slowing economic growth, poor poll ratings and speculation he could face a leadership challenge.In her own new year message, Conservative leader Kemi Badenoch said 2025 had seen \"no growth, higher taxes and record unemployment\".However, she added that Britain was \"not destined for decline\" and her party's plan would \"back business and fix our economy so we can fund our armed forces, police, schools, NHS and build something that we feel proud of\".Sir Keir said he shared \"frustration about the pace of change\" but \"the challenges we face were decades in the making, and renewal is not an overnight job\".He added: \"By staying the course, we will defeat the decline and division offered by others.\"The PM promised that over the next year things would \"start to feel easier\", pointing to frozen rail fares, prescription charges and fuel duty, as well as increases to the minimum wage.\"In 2026, the choices we've made will mean more people will begin to feel positive change in your bills, your communities and your health service,\" he said.\"But even more people will feel once again a sense of hope, a belief that things can and will get better, feel that the promise of renewal can become a reality, and my government will make it that reality.\"The Liberal Democrats and Reform UK look forward to May's local elections in their new year messages.Both parties are hoping to make gains in the polls, which cover the Scottish parliament and the Welsh Senedd as well as thousands of council seats in England and a handful of directly elected mayoralties.Lib Dem leader Sir Ed Davey said his party could \"win again in 2026\" after \"our record-breaking success\" in the last local elections.He vowed to \"stop Trump's America becoming Farage's Britain\" and \"change our country for the better\".Meanwhile, Reform UK leader Nigel Farage, whose party has been consistently leading in national opinion polls since last spring, said his party was offering \"hope\" and \"change\", as he predicted May would be \"the single most important set of elections between now and the next general election\".He said the country was getting \"gloomier\" and \"poorer\", with higher unemployment and debt \"running completely out of control\".Farage criticised both Labour and the Conservatives for not understanding the \"new world\" of cryptocurrencies, AI and digital assets, which he described as \"the technologies of growth\".In his new year message, SNP leader John Swinney said the last year had been \"difficult\" for some, with \"conflict and upheaval\" across the world. The first minister said he would be \"toasting Scotland's famous win against Denmark\" to qualify for the World Cup, as well as looking forward to the competition over the summer and the Commonwealth Games in Glasgow.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Keir Starmer vows to 'defeat decline and division' in new year message",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f5b6/live/0b723b90-e660-11f0-a8f2-d9e8fba7dc3b.png"
      ],
      "datePublished": "2026-01-01T06:43:29.000Z",
      "dateModified": "2026-01-01T06:43:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: PM's 'year of proof' and 'fight' with judges over Shamima Begum",
    "url": "https://www.bbc.com/news/articles/cre2dl09q0yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3587/live/3a189770-e6b3-11f0-b67b-690eb873de1b.jpg",
    "tag": "Trending",
    "date": "2026-01-01T02:00:32.000Z",
    "description": "6 hours agoSir Keir Starmer will attempt to fix relationships with voters and \"woo MPs\" with a push to cut cost of living in 2026, the Guardian report",
    "body": "6 hours agoSir Keir Starmer will attempt to fix relationships with voters and \"woo MPs\" with a push to cut cost of living in 2026, the Guardian reports, ahead of a speech by the prime minister in the coming days. His reported plans are accompanied by Sydney's dazzling fireworks display \"as the world rings in the new year\".Another message from Sir Keir that \"2026 will be better\" leads the Daily Mirror, as the PM promises to deliver change after a \"tough year\". Above, Queen Camilla meets with the Hunt family, whose family members were murdered in 2024. The paper reports that their story inspired Camilla to open up about her experience of an indecent assault as a teenager.The Daily Mail enters the new year by leading on \"Digital IDs for babies\" that it says are a \"sinister new plan\" ministers have been privately discussing. Newborns could be allocated digital IDs \"along with the 'red book' of health records given to parents\", the paper writes, as part of an expansion of the digital ID scheme introduced by Sir Keir. The Independent features Sydney's world-famous fireworks in its top slot while mentioning that \"images of a menorah were projected on the Harbour Bridge\" to pay tribute to Bondi Beach attack victims. The lead story focuses on the HS2 project being accused of spending \"£37m of taxpayers' money buying up homes\" on an axed part of the line. Smiles and sunshine feature on the front page of the Daily Telegraph as British national Molly Taylor-South enters the New Year early in Sydney. Elsewhere, the home secretary vows to \"fight European judges\" over Shamima Begum. The European Court of Human Rights has reportedly formally challenged Britain's decision to strip Begum of her citizenship in 2019, the paper writes, after she \"ran off to Syria\" to join the Islamic State group.Parents could lose support for their children living with \"moderate mental health and development needs\" due to cost-cutting plans, the Times reports.The \"big freeze begins\" across the UK in the new year, as the i Paper informs readers of health and travel alerts. Yellow weather warnings have been issued for Scotland, England, Wales and Northern Ireland, the paper reports, while the Health and Security Agency reminds people to \"check on vulnerable friends\".Dame Esther Rantzen asks the public to write to peers who oppose the assisted dying bill to \"stop millions more suffering\", the Daily Express reports. Last year, MPs narrowly backed proposed legislation which would introduce assisted dying in England and Wales, in an historic House of Commons vote. The front pages of the Guardian and the Daily Mirror focus on Prime Minister Sir Keir Starmer's messages for 2026 as the UK wakes up to a new year. According to the Daily Mail, \"secret meetings\" have taken place in which ministers have raised the prospect of newborn babies being allocated a digital ID. The Mail describes the possible plan as a \"major expansion\" of the scheme announced by the prime minister in September to try to curb illegal immigration.The Daily Telegraph leads on the home secretary's vow to fight European judges over a fresh attempt by the IS bride, Shamima Begum, to return to the UK. The European Court of Human Rights has asked Britain to justify its decision to strip Ms Begum of her citizenship after she ran off to join the Islamic State group in Syria. A government source quoted by the Telegraph says the ruling has been \"upheld time and again\" in domestic courts.There's a plea from the assisted dying campaigner, Dame Esther Rantzen, in the Daily Express. She is reportedly urging members of the public to write to peers who are opposed to the assisted dying bill in England and Wales. Dame Esther says members of the House of Lords must be reminded of the \"pain and suffering\" dying people will endure if the landmark legislation fails.The Guardian reports that the Prime Minister will give a speech in the coming days focusing on how the government is bringing down living costs. \"2026 will be better\", is Sir Keir's message in the Daily Mirror. Writing in the paper, he says the next 12 months will see \"hope\" rediscovered adding people can \"look forward with confidence\".Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: PM's 'year of proof' and 'fight' with judges over Shamima Begum",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3587/live/3a189770-e6b3-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2026-01-01T02:00:32.000Z",
      "dateModified": "2026-01-01T02:00:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK welcomes new year with celebrations across the country ",
    "url": "https://www.bbc.com/news/articles/cy594gkele3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4ab4/live/ba331a40-e6ac-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2026-01-01T07:05:41.000Z",
    "description": "1 hour agoTabby WilsonandSuzanne LeighWatch: London rings in 2026 with spectacular fireworksMillions of people across the UK have officially rung in t",
    "body": "1 hour agoTabby WilsonandSuzanne LeighWatch: London rings in 2026 with spectacular fireworksMillions of people across the UK have officially rung in the new year, gathering at firework events and parties all over the country. In London, 12,000 fireworks were set off in the city's biggest pyrotechnic display to date, with 100,000 people watching on from the banks of the Thames.Edinburgh Castle was lit up by six minutes of carefully choreographed explosions, surrounded by tens of thousands of revellers attending the famous Hogmanay street party. The new year brings chilly weather with snow and ice forecast across much of the UK.A yellow weather warning for snow and ice is in place for northern Scotland from 06:00 GMT until the end of Friday. On 2 January, a further yellow warning for snow and ice has been issued across large parts of England and Wales between midnight and noon, extending as far south as London and Kent.As the iconic midnight bongs of Big Ben sounded across London, the London Eye was at the centre of Europe's biggest firework display, which celebrated some of the highlights of 2025.The soundtrack included Raye, Sabrina Carpenter, Ed Sheeran and Coldplay, and featured voiceovers from stars such as Celia Imrie, Andrew Cotter and Alison Hammond. England's Women's Rugby World Cup triumph was acknowledged in the display, along with the Lionesses' win at the Euros and Cynthia Erivo's performance in Wicked: For Good. London Mayor Sir Sadiq Khan hailed the display as the most \"legendary\" in the world, writing on X that the city's new year celebrations held a clear message about \"the importance of togetherness\". Watch: The weather forecast for New Year's Day in the UKFollow live: Nations around the world welcome the new year Chaos, fun and fireballs: Working the Hogmanay night shiftFireworks and first-footing: Your guide to Hogmanay in EdinburghFive New Year traditions you (probably) didn't know aboutOther celebrations took place across the country, from Belfast to Cardiff, Manchester and Newcastle.Edinburgh held its last official celebration in 2024, after \"extreme weather\" forced organisers to cancel Hogmanay celebrations.This time, approximately 45,000 people attended the sold-out street party to usher in 2026, with some of the fireworks used in the display salvaged from last year's cancelled event. The spectacle was accompanied by a soundtrack that featured some of Scotland's biggest artists, such as Lewis Capaldi and Simple Minds, before concluding with a version of Auld Lang Syne by Skye duo Valtos.Liverpudlians Cheryl and Terry Brown were among those making merry in the Scottish capital, soaking up all four days of the city's celebrations alongside their seven-year-old son, Oliver. \"We done it a few years ago and we just had to come back,\" Terry told the BBC, explaining that the family had celebrated in Belfast and London on previous years but Edinburgh's party atmosphere has kept them coming back. And they aren't the only ones. Cosmio and Neal, two friends from the US state of New Jersey, crossed the pond specifically to ring in 2026 from Edinburgh. \"The dancing, the people, the energy, the vibe - it's just the best way to bring in the new year together,\" said Neal. Cosmio added that the pair have made travelling for new year a regular thing but says the energy from the street party in Edinburgh is \"a thousand times better\" than watching the famous ball drop in New York's Times Square.PA MediaCelebrations have already taken place in much of the rest of the world, too. Japan and South Korea marked the event with bell-ringing ceremonies in their capital cities, while Australians celebrated with a spectacular firework display in Sydney.Copacabana Beach in Rio de Janeiro was lit up by a similarly enormous series of pyrotechnics, with organisers hoping to beat their 2024 Guinness World Record for the biggest New Year's Eve celebration.On the RRS Sir David Attenborough, stationed in the Antarctic, the crew and science teams rang in the new year with the ship's bell.By midday GMT, it will officially be 2026 worldwide.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK welcomes new year with celebrations across the country ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4ab4/live/ba331a40-e6ac-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2026-01-01T07:05:41.000Z",
      "dateModified": "2026-01-01T07:05:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Community key to good healthcare, says incoming Archbishop of Canterbury",
    "url": "https://www.bbc.com/news/articles/ckgk1m5zkm6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0d9f/live/557dbac0-e6ce-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2026-01-01T06:39:48.000Z",
    "description": "Dame Sarah Mullally, the incoming Archbishop of Canterbury, has focused her first new year's message on pressures facing the healthcare system and the",
    "body": "Dame Sarah Mullally, the incoming Archbishop of Canterbury, has focused her first new year's message on pressures facing the healthcare system and the importance of access to \"holistic services\". Drawing on her experience as an NHS nurse, she said: \"Good healthcare is incredibly important to me. It goes hand in hand with my Christian faith, inspired by Jesus' call for us to love and care deeply for one another.\"Support for people in their communities could help deal with the \"root causes\" of many hospital admissions, she said, adding that social and palliative services are \"stretched\".Dame Sarah will be made the first-ever female leader of the Church of England later this month.In her address, Dame Sarah said churches offering regular lunches in a community setting \"can be as important as medical intervention for our physical and mental health\".She added that they can also assist people getting health check-ups.\"At St Thomas' Hospital, where I first trained, the chapel is a place of sanctuary for staff and patients, away from the busy wards. The multi-faith chaplaincy team is on hand to listen, pray or simply sit with those going through life's most difficult and painful moments.\"She continued: \"Near the chapel is the children's hospital. There are staff here who specialise in play therapy, softening the anxiety of a hospital stay, and speeding up recovery.\"Services are under growing pressure, she said, but community support \"can help deal with the root causes of many admissions\". \"I see this in my own diocese in London, where people are delivering holistic support in different settings,\" she said.At churches like SAINT in Hackney, where regular lunches are held, \"people from all over the world, from many different backgrounds, experience a warm welcome, a health check-up if they need it - and importantly, the love of Jesus Christ, who showed us how to wash the feet of others\".She added: \"In my calling now, I strive to carry the care and compassion that shaped my vocation as a nurse into everything that I do.\"\"The role of the Church should be a healing presence in our nation, bringing people together at times of often intense division, caring deeply for those who need our help.\"Dame Sarah will become the 106th Archbishop of Canterbury at a ceremony in Canterbury Cathedral on 28 January. She was chosen to succeed Justin Welby after he announced his resignation more than a year ago over failures in the handling of an abuse scandal.The Church of England is considering a complaint against Dame Sarah over her handling of an abuse allegation.King Charles, as head of state, is the head of the Church of England, but the Archbishop of Canterbury is the most senior bishop and the spiritual leader of the Church and worldwide Anglican Communion.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Community key to good healthcare, says incoming Archbishop of Canterbury",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0d9f/live/557dbac0-e6ce-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2026-01-01T06:39:48.000Z",
      "dateModified": "2026-01-01T06:39:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anthony Joshua discharged from hospital after Nigeria car crash",
    "url": "https://www.bbc.com/news/articles/c5yvdw77j04o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c8c5/live/775d3eb0-e6a4-11f0-b67b-690eb873de1b.jpg",
    "tag": "Trending",
    "date": "2026-01-01T00:32:22.000Z",
    "description": "8 hours agoChris GrahamSocial mediaLatif Ayodele (left) and Sina Ghami (right) were close friends and team members of Anthony JoshuaBritish heavyweigh",
    "body": "8 hours agoChris GrahamSocial mediaLatif Ayodele (left) and Sina Ghami (right) were close friends and team members of Anthony JoshuaBritish heavyweight boxer Anthony Joshua has been discharged from hospital in Nigeria days after a fatal car accident that killed two of his close friends.The former world champion was deemed fit to recuperate at home, the Ogun and Lagos states said in a joint statement, describing him as \"heavy hearted\" over the loss of his friends.The 36-year-old was a passenger in a Lexus SUV that collided with a stationary truck on a major expressway in Ogun State, near Lagos, on Monday.The two men who died were Joshua's close friends and team members Sina Ghami and Latif \"Latz\" Ayodele.After leaving the hospital on Wednesday, the Briton visited the funeral home where the bodies of his friends were \"being prepared for repatriation\", the joint statement added.Earlier, Eddie Hearn, who has promoted Joshua since he turned professional after winning gold at the 2012 Olympics, paid tribute to Joshua's close friends and team members.\"Rest in peace Latz and Sina,\" Hearn posted on Instagram.\"Your energy and loyalty among so many other great qualities will be deeply missed. Praying for strength and guidance for all their family, friends and of course AJ during this very difficult time.\"Ghami was Joshua's full-time sport and exercise rehabilitation coach and worked with him for more than 10 years.Moment Anthony Joshua is taken out of carSpeaking to the BBC on Wednesday, Ogun State police spokesperson Oluseyi Babaseyi said \"investigations are still ongoing\" and described the process as \"still discreet\".The Traffic Compliance and Enforcement Agency (TRACE) in Ogun state, where the accident occurred, has said preliminary investigations showed the vehicle had burst a tyre before crashing into the truck.Joshua, who was born in Watford to Nigerian parents, was on holiday in Nigeria after his win over Jake Paul in Miami on 19 December.Earlier, Tony Bellew, the retired cruiserweight world champion, posted on X: \"Thoughts and prayers to the families of these men. Tragic losses in horrific circumstances!\"I hope he (Joshua) is able to process this with time because there is no pain in life worse than grief.\"Two-time undisputed heavyweight champion Oleksandr Usyk and British former heavyweight champion Tyson Fury also posted Instagram stories to offer condolences.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anthony Joshua discharged from hospital after Nigeria car crash",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c8c5/live/775d3eb0-e6a4-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2026-01-01T00:32:22.000Z",
      "dateModified": "2026-01-01T00:32:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bulgaria joins the euro after rocky path to new currency",
    "url": "https://www.bbc.com/news/articles/crlere3x28lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e3c6/live/b35440d0-e654-11f0-b67b-690eb873de1b.jpg",
    "tag": "Trending",
    "date": "2025-12-31T22:05:03.000Z",
    "description": "10 hours agoNick ThorpeCentral Europe correspondentBulgaria - the poorest country in the European Union - has become the 21st member of the eurozone -",
    "body": "10 hours agoNick ThorpeCentral Europe correspondentBulgaria - the poorest country in the European Union - has become the 21st member of the eurozone - leapfrogging more obvious and prosperous candidates like Poland, the Czech Republic and Hungary.For mostly urban, young and entrepreneurial Bulgarians, it's an optimistic and  potentially lucrative leap - the final move in a game which has brought Bulgaria into the European mainstream - from Nato and EU membership, to joining the Schengen zone, and now the euro.For the older, rural, more conservative parts of the population, the replacement of the Bulgarian lev by the euro provokes fear and resentment.The lev - meaning lion - has been the Bulgarian currency since 1881, but it has been pegged to other European currencies since 1997 - first the Deutschmark, then the euro.Opinion polls put Bulgaria's 6.5 million population more or less equally divided on the new currency, and political turmoil is not making the transition easy. Prime Minister Rosen Zhelyazkov's coalition government lost a confidence vote on 11 December, after mass protests against the 2026 budget. Bulgaria has held seven elections in the past four years - an eighth looks likely early next year.\"I don't want the euro, and I don't like the way it has been imposed on us,\" Todor, 50, a small business owner in the central town of Gabrovo, at the foot of the Balkan mountains, told the BBC. \"If there were a referendum, I reckon 70% of the people would vote against it.\" A referendum on euro adoption was proposed by President Rumen Radev but rejected by the outgoing government. Todor's business, producing coloured plastics for the domestic market, had a bad  year because of high inflation, he said, and a fall in sales fuelled, he believed, by fear of the euro.Ognian Enev, 60, who owns a tea shop in central Sofia, was more enthusiastic. \"On the whole, it's a good thing. It's just a technical change. It doesn't bother me,\" he told the BBC. In any case, he pointed out, people who bought flats or cars until now have got used to prices marked in euros. The 1.2 million Bulgarians who live outside the country have also been sending money home for years in euros.Like many shopkeepers, Ognian has the new currency ready, in coins and small denomination notes, ready for the transition. Throughout January, you can pay in both lev and euros, but change is supposed to be in euros. From 1 February, it will no longer be permitted to pay in lev. He hopes joining the single currency will be good for trade - many of his flavoured and fruit teas come from sellers in the eurozone, while the more expensive, high-end teas are imported direct from China and Japan.Since August 2025, all shops in Bulgaria have been required by law to display prices in both currencies. Conveniently, €1 is worth about two lev (1.95583 to be exact). In response to public fears that prices will be rounded up, elaborate watchdogs have been created, to protect consumers. And some prices have been rounded down: the cost of public transport in the capital Sofia is due to fall slightly.The design on the reverse side of the new eurocoins was chosen to overcome worries that Bulgaria is losing its sovereignty. St Ivan of Rila is on the €1 coin, Paisius of Hilendar, an 18th Century monk and champion of the national revival, is on the €2 coin. The smaller denomination eurocents carry an image of the Madara rider, a symbol of early Bulgarian statehood, based on an 8th Century rock relief.Just how the new currency will impact Bulgaria as a whole, concerns everyone. The lessons from other countries offer two versions - the successful \"Baltic model\" followed by Estonia, Latvia and Lithuania, which combined the euro with reforms to streamline administration, encourage investment and combat corruption. And the \"Italian model\", where years of stagnation followed.\"I'm afraid we'll be more like Italy,\" Ognian Enev predicted.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bulgaria joins the euro after rocky path to new currency",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e3c6/live/b35440d0-e654-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-31T22:05:03.000Z",
      "dateModified": "2025-12-31T22:05:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Children from struggling families to be offered jabs at home",
    "url": "https://www.bbc.com/news/articles/cn407dyx24go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/16f9/live/d0471cf0-e657-11f0-a8f2-d9e8fba7dc3b.jpg",
    "tag": "Trending",
    "date": "2026-01-01T00:04:41.000Z",
    "description": "8 hours agoPhilippa RoxbyHealth reporterYoung children from struggling families in some parts of England will be offered vaccinations at home to prote",
    "body": "8 hours agoPhilippa RoxbyHealth reporterYoung children from struggling families in some parts of England will be offered vaccinations at home to protect them from preventable diseases, the health secretary has said.The pilot scheme, announced on Thursday as part of a drive to increase vaccine uptake, will see health visitors trained to spend more time with small numbers of families who could fall through the cracks of the NHS.Wes Streeting told the BBC that children's healthcare had not been given the priority it deserved.The Royal College of Paediatrics and Child Health said it was \"a national scandal\" that more than half a million children faced long waits to access health services in England.In an interview with BBC Radio 4's Today programme, Streeting said he was \"shocked\" by what he described as a lack of focus on children's health when he was in opposition.\"As human beings, it is in our nature to prioritise children. You talk to the overwhelming majority of parents, good parents, they will take bullets for their children,\" the health secretary said.\"There is that kind of innate sense of 'I will do everything I can to protect my child'. I don't think that's reflected sufficiently in the state,\" he added.The pilot scheme was part of that aim, he said, targeting families who are not signed up to a GP surgery or face language barriers, travel costs or childcare issues which stop them getting to a doctor.Uptake of childhood vaccines has declined over the past 10 years - no jabs met the 95% coverage target for children aged five and below, according to the latest data.Twelve areas in London, the Midlands, the North East and Yorkshire, the North West, and South West will test the approach over the next year.The government said all other families should continue to have children vaccinated at their local surgery.Streeting said there had been a decline in the number of health visitors and community nursing over a number of years, and that government was developing a workforce plan to address recruitment.Health visitors are registered nurses or midwives who have additional training in community public health nursing. They work with families with a child aged five and under to identify health needs.In response to Streeting's comments, the Conservatives accused Labour of having \"no plan for children's health or the health service as a whole\". \"Labour are trying to distract from their dismal failures by pointing the finger at the last government,\" shadow health secretary Stuart Andrew said.Professor Steve Turner, President of the Royal College of Paediatrics and Child Health, welcomed the plan and called on the health secretary to \"right the wrongs of the past\".Addressing NHS waiting times, he said it was now a \"matter of routine\" that children were not being seen by health professionals within the NHS's 18-week target, adding that he was \"particularly astounded\" that a quarter of children wait more than a year for community treatment, compared with just 1% of adults.\"Long waits for community and elective care are unacceptable at any age, but this is especially true for children where delays can cause irreversible and lifelong harm if care isn't provided during critical developmental windows,\" Prof Turner said.He added that the unequal treatment of adults and children \"must end\" by tackling obesity, protecting mental health, reducing exposure to nicotine and boosting vaccinations in children.Children up to the age of six across the UK are to be offered vaccine protection against chickenpox free on the NHS from January 2026.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Children from struggling families to be offered jabs at home",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/16f9/live/d0471cf0-e657-11f0-a8f2-d9e8fba7dc3b.jpg"
      ],
      "datePublished": "2026-01-01T00:04:41.000Z",
      "dateModified": "2026-01-01T00:04:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Archers: Radio 4 drama's cast recreate first episode for 75th anniversary",
    "url": "https://www.bbc.com/news/articles/cy5g1z6lx9ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9f45/live/744f3f50-e25a-11f0-9cc8-5f4006175918.jpg",
    "tag": "Trending",
    "date": "2026-01-01T00:07:26.000Z",
    "description": "8 hours agoSteven McIntoshEntertainment reporterBBCClockwise from top: Current voice actors Wilf Scolding, Ben Norris, Felicity Finch, Timothy Bentinc",
    "body": "8 hours agoSteven McIntoshEntertainment reporterBBCClockwise from top: Current voice actors Wilf Scolding, Ben Norris, Felicity Finch, Timothy Bentinck and Daisy BadgerThe cast of The Archers have re-enacted the opening scene from the first ever episode to celebrate the 75th anniversary of the BBC Radio 4 drama.The Archers launched on 1 January 1951, but the original recording of the first episode did not survive.The current cast have recreated the opening scene, stepping into the shoes of their original counterparts, as part of a day of special programming on Radio 4 to mark the show's birthday.The Archers' editor Jeremy Howe praised the soap's \"timeless appeal\", adding: \"We look forward to seeing what the next 75 years will bring!\"The series, which is recorded in Birmingham, is the world's longest-running radio soap opera.Despite its vintage, The Archers has a considerable following among young audiences and often tops the list of most popular programmes on BBC Sounds for listeners under 35.  To mark the show's birthday, a 45-minute special called The Archers: Truth and Lies will be broadcast in instalments throughout New Year's Day, before being played in full at 19:15.The Archers Podcast, which is hosted by Emma Freud and launched in 2024, will also air on Radio 4 for the first time.Meanwhile, New Year's Day editions of Woman's Hour and This Week in History will celebrate the enduring appeal of Ambridge, the show's fictional village.Guest actors over the years have included Rylan Clark, who appeared on a Eurovision-themed episode in 2023As part of the celebrations, the current cast re-recorded the opening scene from the first ever episodeIn a statement, Howe said: \"The first baby born in the show, Tony Archer, has lived his whole life in The Archers – as have many of our listeners, who have tuned in for the whole of their lives. \"What is brilliant is that the programme continues to attract new listeners and appeal to a whole new generation. That ability to connect with listeners is what makes The Archers so special.\"It has timeless appeal, and yet it manages to speak to the times we live in today.\"The recreation of the opening scene from the original episode will star actors Timothy Bentinck, Felicity Finch, Daisy Badger, Ben Norris and Wilf Scolding.They play Dan, Doris, Grace, Philip and Jack Archer, who gather in the kitchen of Brookfield Farm to ring in the New Year. The re-enactment will be available on Radio 4's social channels and also feature in The Archers Podcast.Back in the current Archers timeline, fans were left on tenterhooks by the cliffhanger broadcast on New Year's Eve, when a dramatic attack shook the village. Radio 4 has promised Thursday evening's episode will delve deeper into the mystery, with the search for the culprit now under way.Princess Margaret (pictured with Sara Coward and Arnold Peters) appeared in an episode in 1984The Archers was originally conceived to educate farmers and the public about modern agricultural methods. It has evolved over its 75 years on air, but still aims to reflect contemporary rural life in England.In recent years, it has tackled topical issues such as domestic abuse, climate change, economic challenges in farming, alcoholism and modern slavery. Radio 4 controller Mohit Bakaya described The Archers as \"one of the cornerstones of British broadcasting\".\"The world today is very different to when it was first broadcast in 1951, and I'm delighted that the programme continues to be such a huge hit with audiences of all ages,\" he said.To mark the anniversary, Radio 4 has also announced that episodes of The Archers will now be available on BBC Sounds for five years after broadcast, an increase from the previous 30-day window.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Archers: Radio 4 drama's cast recreate first episode for 75th anniversary",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9f45/live/744f3f50-e25a-11f0-9cc8-5f4006175918.jpg"
      ],
      "datePublished": "2026-01-01T00:07:26.000Z",
      "dateModified": "2026-01-01T00:07:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Intriguing finds could solve mystery of women in medieval cemetery",
    "url": "https://www.bbc.com/news/articles/cpd65wp8z9zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7113/live/b0058900-e66a-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2026-01-01T00:34:29.000Z",
    "description": "8 hours agoRebecca Morelle,Science EditorandAlison Francis,Senior Science JournalistKevin Church/BBC NewsThese tiny beads could have been stitched ont",
    "body": "8 hours agoRebecca Morelle,Science EditorandAlison Francis,Senior Science JournalistKevin Church/BBC NewsThese tiny beads could have been stitched onto clothing or attached to jewellery Intriguing new discoveries in a medieval cemetery in Wales have brought archaeologists closer to solving the mystery surrounding the women buried there.They've found what appears to be a small building and have unearthed domestic and decorative artefacts, including exquisite coloured glass beads.So far 58 skeletons, dating to the 6th or 7th Century, have been uncovered at the site. What's unusual is that nearly all belonged to women.The new finds add to growing evidence that the burial ground was part of an early female religious community.Kevin Church/BBC NewsThe 1,500-year-old skeletons are intact and well preserved For the last four years, archaeologists have been excavating the site in the grounds of Fonmon Castle, close to the end of the runway at Cardiff airport.The skeletons are buried in shallow graves cut into the limestone bedrock. While their bones and teeth show they lived hard lives, objects found amongst the graves suggest wealth and luxury.The team have been scratching their heads trying to work out who these women were.Now the latest dig has provided a major clue: the outline of what could possibly be a small building.\"It's producing fragments of building stone, so it might be structural. We might be thinking of a small shrine or a chapel,\" says Dr Andy Seaman, from Cardiff University, who is leading the dig.\"I do think that we have a site which may be an early religious community.\"Kevin Church/BBC NewsGraves are clustered around the possible building, which is highlighted in pinkThe potential building is located in the centre of the cemetery and graves are clustered around it. It seems that people wanted to be buried as close to this feature as possible.So close in fact, says Cardiff University archaeologist Tudur Davies, that some of these graves have several people in them.\"It's a highly desired location for people to be buried in,\" he says.\"Sometimes two, three, four individuals have been buried on the same spot, again and again. There doesn't appear to be as much of a taboo over putting bodies in the same place and just moving those still there to one side.\"Artefacts found at the site are revealing more about the people buried here. Kevin Church/BBC NewsItems include a copper brooch, a decorated bone pin and a comb carved from antler The objects have been taken to Cardiff University's lab. Conservator Clare Emerson is painstakingly removing the dirt of the dig from an ornate copper brooch.\"We'd have to do some more analysis, but it's probably bronze,\" she says.  \"Also we think it was possibly gilded, which would be a coating of gold over the top.\"The ends, she explains, were covered in green enamel.\"This would have been a very decorative brooch.  I think it's a very special find for the site.\"Alongside this piece of medieval bling, the team have also unearthed a pin made from bone with a detailed pattern and a comb intricately carved from antler.And there are some exquisite, multicoloured glass beads. Measuring about 3mm across, each one is a miniature delight. They were possibly stitched onto clothing or attached to a piece of jewellery.Kevin Church/BBC NewsFragments of glassware were found amongst the graves But the domestic items found at the site tell us a lot too.\"We have a quern stone for grinding flour for bread. We've got pottery and glass for eating and drinking\" says Dr Andy Seaman.\"It's clearly not just a place for the dead. There's a living community here as well.\"He thinks that the community was enclosed, living right next door to the cemetery, separated from the rest of society.Kevin Church/BBC NewsLittle is known about early religious communities from this areaThe pieces of this medieval puzzle are starting to come together.  But there are still some questions.The remains of a few men have been found - who were they?  And some children too -  were they related to any of the women?And while most of the people at the cemetery were buried with great care, two women were tossed in a ditch - one with her hands and feet tied. What had they done to deserve that?Kevin Church/BBC NewsThe excavations will continue at the site in 2026  The team are now trying to work out if this could be an example of very early Christianity.\"It's a period where the history is not yet written,\" says Dr Seaman.\"We don't really understand early church sites...  how they functioned, what they looked like, how they were organised.\"We know that very well from later periods, but in this very formative period of history, it's not very well understood. So it's a really exciting opportunity.\"The archaeologists will continue their excavations later this year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Intriguing finds could solve mystery of women in medieval cemetery",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7113/live/b0058900-e66a-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2026-01-01T00:34:29.000Z",
      "dateModified": "2026-01-01T00:34:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Roberto Carlos: Brazil legend 'recovering well' in hospital after procedure",
    "url": "https://www.bbc.com/sport/football/articles/cqxyrj9dv5go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3971/live/1c16acc0-e6e6-11f0-9bc9-6567eb1afae2.jpg",
    "tag": "Trending",
    "date": "2026-01-01T08:12:00.000Z",
    "description": "Brazil and Real Madrid legend Roberto Carlos is \"recovering well\" after undergoing what he described as \"a preventative medical procedure\".The former ",
    "body": "Brazil and Real Madrid legend Roberto Carlos is \"recovering well\" after undergoing what he described as \"a preventative medical procedure\".The former left-back, 52, updated fans on his condition via his Instagram page, which included a picture of him smiling in a hospital bed.He also denied rumours that he had suffered a heart attack.\"I would like to clarify recent information that has been circling,\" he wrote.\"I recently underwent a preventative medical procedure, planned in advance with my medical team. The procedure was successful, and I am well. I did not suffer a heart attack.\"I am recovering well, and looking forward to returning to full fitness and resuming my professional and personal commitments soon.\"I sincerely thank everyone for the messages of support, care, and concern. I would like to reassure everyone that there is no cause for concern.\"My heartfelt thanks go to the entire medical team who took care of me.\"Carlos won four La Liga titles and three Champions Leagues across 527 appearances for Real Madrid, and lifted the World Cup with Brazil in 2002.Renowned as a free-kick specialist, his other clubs included Palmeiras, Inter Milan, Fenerbahce and Corinthians.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Roberto Carlos: Brazil legend 'recovering well' in hospital after procedure",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3971/live/1c16acc0-e6e6-11f0-9bc9-6567eb1afae2.jpg"
      ],
      "datePublished": "2026-01-01T08:12:00.000Z",
      "dateModified": "2026-01-01T08:12:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]