[
  {
    "title": "Former Aberdeen and Arsenal footballer Willie Young dies age 73",
    "url": "https://www.bbc.com/news/articles/c9d666e12l5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cdfc/live/29eee8b0-b713-11f0-81a4-f76cd66ce716.jpg",
    "tag": "Trending",
    "date": "2025-11-01T11:37:58.000Z",
    "description": "44 minutes agoJames DelaneyBBC ScotlandSNSWillie Young, who won the FA Cup with Arsenal, has died aged 73The former Aberdeen and Arsenal defender Will",
    "body": "44 minutes agoJames DelaneyBBC ScotlandSNSWillie Young, who won the FA Cup with Arsenal, has died aged 73The former Aberdeen and Arsenal defender Willie Young has died at the age of 73.Young played more than 180 games for the Dons before going on to lift the FA Cup with the Gunners in 1979.He is perhaps best remembered for forcing a change in the laws of the game and the creation of the \"professional foul\" following his tackle on West Ham forward Paul Allen in the 1980 final of the competition.In a statement, Arsenal said his \"physicality and commitment made him a cult figure\" with the club's supporters.They added: \"Reliable, dominant in the air and fearless, his immense contribution to a successful period means he will always be remembered fondly by those who saw his colossal frame repelling attacks and causing havoc to opposition defences at set pieces.\"Posting on X, Aberdeen said the club was \"saddened\" to learn of his passing.SNSYoung began his career at AberdeenBorn in Edinburgh, Young grew up in the village of Heriot in Midlothian and began his career at Aberdeen in 1970.He spent five years at the club before joining Tottenham Hotspur in 1975.He made a controversial move across North London to Arsenal two years later, linking up with his former manager at Spurs, Terry Neill.With his towering 6ft 3in frame and trademark ginger hair, he formed a formidable defensive partnership with Irish centre back David O'Leary, reaching three straight FA Cup finals between 1978 and 1980.He earned a winners' medal in the 3-2 defeat of Manchester United in the \"five-minute final\" of 1979.Getty ImagesYoung in the back row with his arms outstretched following Arsenal's FA Cup final win over Manchester United in 1979But it was his scything down of a then-17-year-old Allen in the 1-0 defeat to West Ham the following year which etched his name in the history of the game.With the forward bearing down on goal in the dying stages, Young cynically hacked him down on the edge of the area, preventing a near-certain goal.He received a yellow card for the incident, but it prompted a national debate on the need for a specific law governing professional fouls.Automatic red cards for \"denial of a clear goalscoring opportunity\" were introduced two years later.Young also played in Arsenal's 1980 Cup Winners' Cup final defeat to Valencia in Brussels.Scotland banDespite his success at club level, Young never made a senior appearance for Scotland due to a lifetime ban incurred following an altercation at a Danish nightclub.The \"Copenhagen five,\" Young, Joe Harper, Arthur Graham, Billy Bremner and Pat McCluskey, were all excommunicated from the national set-up over the incident.Harper and Graham were later reinstated after being cleared of any wrongdoing but Young was never allowed to pull on the dark blue jersey.He departed Arsenal in 1981 after 237 appearances, joining Brian Clough's Nottingham Forest.Young retired in 1984 due to injuries following short spells at Norwich City, Brighton and Hove Albion and Darlington.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former Aberdeen and Arsenal footballer Willie Young dies age 73",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cdfc/live/29eee8b0-b713-11f0-81a4-f76cd66ce716.jpg"
      ],
      "datePublished": "2025-11-01T11:37:58.000Z",
      "dateModified": "2025-11-01T11:37:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Campari shares worth €1.3bn seized by police over alleged tax evasion",
    "url": "https://www.bbc.com/news/articles/cpq11v5d1rno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/14c4/live/17bb4860-b703-11f0-ba75-093eca1ac29b.jpg",
    "tag": "Trending",
    "date": "2025-11-01T11:27:16.000Z",
    "description": "Shares worth €1.3bn (£1.1bn; $1.5bn) have been seized from the company that controls the manufacturer of Campari over alleged tax evasion, Italian pol",
    "body": "Shares worth €1.3bn (£1.1bn; $1.5bn) have been seized from the company that controls the manufacturer of Campari over alleged tax evasion, Italian police have said.Officials ordered the confiscation of the Campari Group shares from Luxembourg-based Lagfin as part of a year-long investigation into how it absorbed its Italian arm.It is accused of failing to pay a similar figure to that of the shares seized in taxes during that merger. The company said it had always acted according to tax laws.Campari - which also produces alcohol brands including Aperol, Grand Marnier and Courvoisier - said neither it nor its subsidiaries were involved in the case. However, chair Luca Garavoglia is among those under investigation, local media reports.Lagfin - which owns more than 50% of Campari shares and has 80% of voting rights - told the BBC in a statement that it had \"always acted in the most scrupulous respect of any applicable laws and regulations, including any Italian tax laws\".Prosecutors in Milan launched a probe into the company last year. Financial police said on Friday that they allegedly found €5.3bn of undeclared capital gains between 2018 and 2020 on which it had not paid a so-called \"exit tax\", levied on firms that transfer their headquarters abroad.It is also accused of transferring its Italian assets into foreign ownership solely for tax purposes, according to Italian financial newspaper Il Sole 24 Ore.Mr Garavoglia, the billionaire who inherited ownership of Campari from his late mother, is implicated alongside Giovanni Berto, the head of Campari's Italian branch, local media reports.Lagfin said it will \"defend itself vigorously\" in the matter, which it characterised as a \"tax dispute\".The company stressed that Campari had never been involved \"in any manner whatsoever\" in the matter, adding that, as it held 80% of Campari's voting rights, the seizure was \"absolutely unable to affect the position of Lagfin as controlling shareholder of Campari\".One of the largest global producers of spirits, Campari is valued at around €7bn on the Milan Stock Exchange.The company has its roots in 1860, when Gaspare Campari's homemade bitter liqueur became a popular tipple among patrons of his Milan bar. It became so successful that, in 1904, his family began manufacturing it commercially, and from the 1990s onwards the firm began acquiring other alcohol brands.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Campari shares worth €1.3bn seized by police over alleged tax evasion",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/14c4/live/17bb4860-b703-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-11-01T11:27:16.000Z",
      "dateModified": "2025-11-01T11:27:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cruise cancelled following death of woman left behind on island",
    "url": "https://www.bbc.com/news/articles/c5y44ly3vg2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c1af/live/9b3657f0-b6d3-11f0-ba75-093eca1ac29b.jpg",
    "tag": "Trending",
    "date": "2025-11-01T05:29:58.000Z",
    "description": "7 hours agoTabby WilsonAFP via Getty ImagesLizard Island is about 250km (155 miles) north of CairnsA 60-day cruise around Australia has been cancelled",
    "body": "7 hours agoTabby WilsonAFP via Getty ImagesLizard Island is about 250km (155 miles) north of CairnsA 60-day cruise around Australia has been cancelled days after the death of an elderly female passenger who was left behind by the ship on a remote island.Suzanne Rees had been hiking on Lizard Island with fellow passengers from the Coral Adventurer, but broke off from the group for a rest. The ship left without her and returned several hours later after the crew realised the woman was missing.A major search operation found her body the following day.The Australian Maritime Safety Authority (Amsa) is investigating the incident, alongside Queensland Police and the state coroner.The CEO of the cruise operator Coral Expeditions, Mark Fifield, said on Saturday that passengers and crew on the Coral Adventurer were told on Wednesday that the remainder of the voyage had been cancelled due to the \"tragic passing of Suzanne Rees and previous mechanical issues\".He added in a statement that passengers would be issued a full refund, and said Coral Expeditions was working \"to co-ordinate the return journeys of the passengers via chartered flights\".Amsa also released an updated statement on Saturday, saying it had \"issued a notice to the Master of Coral Adventurer\" prohibiting any new passengers from boarding the ship.The spokesperson said that officials would attend the vessel in Cairns upon its return.The ship initially left the north-western city on 24 October, and was just two days into the voyage at the time of the 80-year-old's death. Lizard Island was the first stop on the journey.Passengers aboard - who typically pay tens of thousands of dollars to join the cruise - were transported there for a day trip with the option of hiking or snorkelling.Suzanne Rees' daughter, Katherine Rees, said on Thursday that her family was \"shocked and saddened that the Coral Adventurer left Lizard Island after an organised excursion without my mum\".She described her mother as an \"active 80-year-old\" who was a member of a bushwalking group.\"From the little we have been told, it seems that there was a failure of care and common sense.\"Ms Rees added that she hoped the coroner's inquiry would be able to pinpoint what \"the company should have done that might have saved mum's life\".\"We understand from the police that it was a very hot day, and mum fell ill on the hill climb,\" she said.\"She was asked to head down, unescorted. Then the ship left, apparently without doing a passenger count.\"At some stage in that sequence, or shortly after, mum died, alone.\"Earlier this week, Mr Fifield confirmed that Coral Expeditions was \"working closely with Queensland Police and other authorities to support their investigation\".He said that the company was \"deeply sorry that this has occurred\" and had offered its full support to the Rees family.The Coral Adventurer caters for up to 120 guests with 46 crew, according to the company's website. It was purpose-built to access remote areas of Australia's coast and is equipped with \"tenders\" - small boats used to take passengers on day excursions.Incidents like this are rare, and cruise ships have systems to record which passengers are embarking or disembarking, Harriet Mallinson, cruise editor of travel website Sailawaze, told the BBC.\"Sneaking ashore or [back] on board just isn't an option,\" she said.Cruise lines take these procedures very seriously and have \"clever tech in place to prevent such incidents from happening\", Ms Mallinson added. \"This is most likely a shocking - and tragic - one-off.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cruise cancelled following death of woman left behind on island",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c1af/live/9b3657f0-b6d3-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-11-01T05:29:58.000Z",
      "dateModified": "2025-11-01T05:29:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Andrew should answer Jeffrey Epstein questions in US, Democrats say",
    "url": "https://www.bbc.com/news/articles/c3dnnpvjkjvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e7dc/live/b2907750-b70f-11f0-9b61-4945b5734f3e.jpg",
    "tag": "Trending",
    "date": "2025-11-01T10:49:44.000Z",
    "description": "2 hours agoMaia DaviesGetty ImagesAndrew was stripped of his title as a prince on ThursdayMembers of a US congressional committee investigating the Je",
    "body": "2 hours agoMaia DaviesGetty ImagesAndrew was stripped of his title as a prince on ThursdayMembers of a US congressional committee investigating the Jeffrey Epstein case have intensified their calls for Andrew Mountbatten Windsor to answer questions about his links to the late sex offender.King Charles stripped his brother of his \"prince\" title on Thursday, following months of pressure over Andrew's ties to Epstein. Andrew has always denied wrongdoing.At least four Democrat members of the House Oversight Committee have since renewed their calls for Andrew to testify - although the panel is controlled by Republicans, who have not indicated they would support the move.Congressman Suhas Subramanyam told the BBC: \"If he wants to clear his name, if he wants to do right by the victims, he will come forward\".Andrew could appear remotely, have a lawyer present and could speak to the panel privately, Subramanyam said.\"Frankly, Andrew's name has come up many times from the victims,\" he told Radio 4's Today programme on Saturday. \"So he clearly has knowledge of what happened and we just want him to come forward and tell us what he knows.\"He added: \"No matter who it is - American or not - everyone should be looked at.\"Fellow committee member Raja Krishnamoorthi told BBC Newsnight he would be willing to formally summon Andrew with a subpoena - although he conceded this would be difficult to enforce while he was outside of the US. Everything we know about Andrew losing titles and Windsor mansionVirginia Giuffre's family speak to BBC: \"She'd be so proud\"Read the King's statement in fullWatch: Question Time audience reacts to newsIs this finally rock bottom for Andrew Mountbatten Windsor?Why Sarah Ferguson, Beatrice and Eugenie can't escape the taint of family scandalWhere does the King get his money?He said on Friday: \"However, if Andrew wishes to come to the United States or he's here, then he's subject to the jurisdiction of the US Congress, and I would expect him to testify.\"He added: \"At the end of the day, we want to know exactly what happened, not just to give justice to the survivors, but to prevent this from ever happening again.\"\"Come clean. Come before the US Congress, voluntarily testify. Don't wait for a subpoena. Come and testify and tell us what you know.\"Congressman Stephen Lynch also told the BBC hearing from Andrew \"might be helpful in getting justice for these survivors\" but said the committee would be unable to subpoena him \"as the situation stands\".Meanwhile, Liz Stein - one of Epstein's accusers - said Andrew should \"take some initiative\" and help US investigators.She told BBC Breakfast on Saturday: \"A lot of us are curious as to why he's unwilling to cooperate and be questioned about his involvement with Epstein.\"\"If he has nothing to hide, then why is he hiding?\"\"We know he had a longstanding friendship with Epstein and that he was in his social circle - so he may have seen things during his involvement with Epstein that he could speak to.\"Another of Epstein's accusers, Anouska De Georgiou, likewise told Newsnight Andrew should appear before Congress, saying \"it would be appropriate for him to be treated the same as anybody else would be treated\".Getty ImagesLiz Stein said Andrew should step in and help investigators It comes after UK trade minister Chris Bryant told the BBC Andrew should go to the US to answer questions about Epstein's crimes if invited, \"just as with any ordinary member of the public\".Meanwhile, the police watchdog said it had approached the Metropolitan Police to ask whether there are matters it should be looking into, in light of media reports about Andrew.The Independent Office for Police Conduct said it had contacted Scotland Yard's Directorate of Professional Standards last week - which oversees internal investigations into misconduct - and had not yet received any referrals.Reports emerged in mid-October that Andrew sought to obtain personal information about his accuser Virginia Giuffre through his police protection in 2011. He has not commented on the reports, while the Metropolitan Police previously said it was \"actively\" looking into them.Separately, new court documents published in the US on Friday showed that Andrew wrote in an email in 2010 that it would be \"good to catch up in person\" with Epstein, after he was released from prison for soliciting prostitution from a minor.The pair were then pictured together in Central Park in New York in December 2010, in a meeting that Andrew later told the BBC was to break off their friendship.Andrew's ties to Epstein were at the centre of Thursday's decision, with the Palace announcement stating: \"These censures are deemed necessary, notwithstanding the fact that he continues to deny the allegations against him.\"\"Their Majesties wish to make clear that their thoughts and utmost sympathies have been, and will remain with, the victims and survivors of any and all forms of abuse.\"In recent weeks, pressure had increased on the monarchy to resolve the issue of Charles's brother.In early October, emails which re-emerged from 2011 showed Andrew in contact with Epstein months after he claimed their friendship had ended.A posthumous memoir by Virginia Giuffre was also released - repeating allegations that, as a teenager, she was forced to have sex with Andrew on three separate occasions, claims he has always denied.And earlier this week, the King was heckled about the matter.Although Andrew denies the accusations, the Royal Family considers there have been \"serious lapses of judgement\" in his behaviour.As well as losing his titles and honours, he was ordered to move out of his Windsor mansion - Royal Lodge - and into a property on the King's Norfolk estate, paid for by the monarch.The BBC understands that he will not have to move out immediately, and could move to Sandringham as late as the new year.On Saturday, a black Land Rover with a number plate ending DOY was seen leaving Bishops Gate near Royal Lodge just before 08:00 GMT.Only a driver was in the vehicle as it left the grounds of Windsor Great Park. Andrew has previously been pictured driving a vehicle with the same private number plate.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Andrew should answer Jeffrey Epstein questions in US, Democrats say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e7dc/live/b2907750-b70f-11f0-9b61-4945b5734f3e.jpg"
      ],
      "datePublished": "2025-11-01T10:49:44.000Z",
      "dateModified": "2025-11-01T10:49:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why young people are being encourage to write a will ",
    "url": "https://www.bbc.com/news/articles/ce3xqq4np40o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/02cc/live/5e6a4530-b015-11f0-8317-a7963fdcfd4f.jpg",
    "tag": "Trending",
    "date": "2025-11-01T01:59:53.000Z",
    "description": "'Plan your exit like a celebrity' - why young people are being encouraged to write wills10 hours agoHannah KarpelLondonBBCKate and her father Mark use",
    "body": "'Plan your exit like a celebrity' - why young people are being encouraged to write wills10 hours agoHannah KarpelLondonBBCKate and her father Mark used to watch football matches togetherAt the start of Will Aid, an annual charity campaign where solicitors waive their fee to draft a basic will in return for a donation, young people are being encouraged to write down their final wishes - even if the prospect of death seems a long way off.Dinner parties, love letters and secret recipes - perhaps not the first things that come to mind when you think about writing a will.But for a growing number of young professionals, these personal touches are taking priority as they plan what will happen after they die.\"I've left little notes for my loved ones and I've gifted a great dress to my best friend,\" says Londoner Kate Davis, 31, who began writing her will after reading Atul Gawande's book, Being Mortal, about end of life care.However it wasn't until her father Mark died last year that Kate returned to the document to add more personal touches. \"Sudden death was definitely the trigger to think about those extra things,\" she said.\"I wanted a chance to tell people how much I love them, even from beyond the grave.\"The risks of failing to write a willWhy should I get a will?This sentiment is becoming increasingly common, as more young people have conversations about protecting their assets and making arrangements for after their death.Youngsters increasingly include digital assets, such as cryptocurrency, social media accounts and online businesses in their wills, according to Emily Deane from the Society of Trust and Estate Practitioners.One in four people claim they do not know how to write one and others feel like their estate is too simple to even warrant a will in the first place, a National Wills Report found.Sam Grice, founder of Octopus Legacy, has been seeking to change this by encouraging more young people to draft their will after his mother Jeanette died in a car crash when he was 27.Sam GriceSam Grice, founder of Octopus Legacy with his mother Jeanette\"My mum had a will, but it wasn't up to date and that caused a lot of friction,\" he said.As a result, Sam and his family had no idea what to do when it came to the funeral. \"This was really tough trying to do her justice without having a clear idea of her wishes,\" he says describing family tensions and disputes.As for Jeanette's financial affairs and closing her bank accounts, Sam admits they did not know where to start and \"called up a long list of potential accounts and were waiting on hold, only to find out she's closed the account years ago\".Years later, Sam says his family kept finding other accounts in his mother's name that had not been closed down properly.Martin Lewis: Why is a will so important?Having seen first hand how families like his own have struggled to navigate the death of a loved one without a will, Sam says millennials who rent and do not have children are one of the forgotten groups. \"Ultimately, no one's been having that conversation with them properly,\" he says highlighting how it is important they protect their liabilities too.Interestingly, he notes how younger generations approach the process of will writing differently. Even if they do not have traditional assets such as property, many of the wills feature personal items, from family recipes to farewell messages. And, significantly, about 40% of 30 to 39-year-olds using his service leave a gift to charity.\"The most valuable thing I have from my mum is her voice and videos with her,\" he says. \"What would I pay to have another video with her? It's priceless.\"'Netflix and will'One of the most concerning findings in the National Wills Report is that up to 29% of people with a will have not told anyone where they store it.Lily Aaron from the Money and Pensions service says: \"For young people life can change quickly – whether that's moving in with a partner, adopting a pet, or starting a family, and having a will is an essential way to make sure your wishes are respected.\"Sophia Maslin, founder of the online DIY will service Morby added: \"I think a few factors have made death more palatable to young people. \"Covid is one, and we've also become very desensitised to death through social media.\"  DIY will services have become popular online for their affordability and ease but, to be legally binding, it must be properly written and signed by the testator in the presence of two independent witnesses who are over the age of 18.Morby has recently drawn attention towards will-writing on TikTok for their grabby marketing that uses a tongue-in-cheek tone to spark conversations. Campaigns feature slogans such as \"Wanna Netflix and will?\" and \"plan your exit like a celebrity\" have been well received. As more young people take an interest in writing their wills, a task once seen as a \"laborious, morbid document\" is gradually being redefined as part of everyday financial wellbeing - a way for under-35s to take control of their future planning.Emily Deane from the Society of Trust and Estate Practitioners, says every adult should have a will - even a simple one.\"As a solicitor, the general advice is to review it every three to five years, or after major life events such as a birth, death, inheritance or starting a business,\" she says.Her key steps include:List your assets and liabilities: Include property, bank accounts, pensions, life insurance and personal belongings. Some may hold sentimental rather than financial value.Appoint an executor: This person will carry out the instructions in your will. It could be a solicitor or trusted family member - but always check for potential fees.Name your beneficiaries: Decide who inherits your possessions - family, friends or charities. If you have children under 18, appoint guardians.Record your burial wishes: Specify whether you prefer burial or cremation, or if you wish to be interred in a family plot.Keep it safe: The original will must be stored securely, as copies are not legally valid. If only a copy is found, your estate may be divided under intestacy laws instead.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why young people are being encourage to write a will ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/02cc/live/5e6a4530-b015-11f0-8317-a7963fdcfd4f.jpg"
      ],
      "datePublished": "2025-11-01T01:59:53.000Z",
      "dateModified": "2025-11-01T01:59:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Halloween",
    "url": "https://www.bbc.co.uk/iplayer/episode/b007494k/halloween?at_mid=qEfkBIXM8b&at_campaign=Halloween&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=b007494k&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Halloween&at_bbc_team=BBC&at_creation=Film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0lbcf22.jpg",
    "tag": "Trending",
    "date": "2025-05-15T05:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeHalloweenHalloweenContains some violence and disturbing scenes.Horror starring Jamie Lee Curtis and Donald Pleasence. Fifteen years after murdering his sister, Michael Myers escapes from an asylum and returns to the small town of Haddenfield. Duration1h 26mFirst shown1978Available for over a yearWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesThe OthersSooner or later, they'll find you… Nicole Kidman stars in a tense supernatural thriller1h 38mCarrieYou're invited to the ultimate prom... Sissy Spacek stars in Stephen King's iconic horror1h 34mGhost StoriesBe careful what you believe in. A supernatural skeptic faces a trio of terrifying tales1h 31mThe HauntingSceptic or believer? You may not believe in ghosts... but you can't deny terror1h 47mCat PeopleA woman's mysterious origins hide a curse which threatens to destroy those close to her.1h 10mLet It SnowThey were warned. A thrill-seeking couple fight for survival against nature and a killer1h 21mHorror ExpressA frozen creature runs amok onboard the Trans-Siberian Express.1h 24mHis HouseWhen ghosts follow, they never leave. A refugee couple are tormented by a sinister force1h 25mScreamDo you like scary movies? The Wes Craven's franchise that redefined horror1h 42mScream 3Obey the rules of the trilogy or die, because the killer always has one final secret...1h 48mScream 2A sequel to die for. A copycat killer is on the loose, sparking a new wave of terror1h 51mThe Blair Witch ProjectEverything you've heard is true. A legend becomes a living nightmare for three filmmakers1h 16m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Halloween",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0lbcf22.jpg"
      ],
      "datePublished": "2025-05-15T05:00:00.000Z",
      "dateModified": "2025-05-15T05:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Strictly Come Dancing: Stars gear up for Halloween week",
    "url": "https://www.bbc.com/news/articles/c2lp72n0p0vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f444/live/89146950-b65f-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-11-01T00:29:03.000Z",
    "description": "Strictly pros transform into ghouls for Halloween week - and a Celebrity Traitor guest stars12 hours agoNoor NanjiCulture reporterBBCThe show's profes",
    "body": "Strictly pros transform into ghouls for Halloween week - and a Celebrity Traitor guest stars12 hours agoNoor NanjiCulture reporterBBCThe show's professional dancers will perform a special Halloween-themed routine this weekendIt's fright night in the Strictly Come Dancing ballroom!Stars are gearing up for the contest's annual Halloween Week on Saturday evening, with songs by Charli XCX, Lady Gaga and Benson Boone in the mix.It's one of a number of themed weeks that happen every year - the others are Movies, Blackpool, Musicals and Icons.It comes as speculation continues to mount over who will replace presenters Tess Daly and Claudia Winkleman, after their announcement last week that they will be leaving at the end of the current series. BBC/PA WireAmber Davies and Nikita Kuzmin threw themselves into a tricky Cha Cha Cha to Ariana Grande during last week's showFans outside Elstree Studios in Hertfordshire suggested names including Alesha Dixon, Zoe Ball and Alison Hammond as possible new hosts.This year's Strictly grand finale is on 20 December, and the BBC said Winkleman and Daly's final appearance would be the Christmas Day special.During last week's show, the duo nodded to the news of their departure, as they thanked audiences for their \"beautiful messages\".This weekend will also see a special performance from Celebrity Traitors star Cat Burns, who will appear during Sunday night's results show.Here's who is dancing on Saturday night - and to what:Sunday night's results show will see a special, spooky Monsters' Ball danceAlex and Johannes - Salsa to Horny by Mousse T feat. Hot 'n' JuicyAmber and Nikita - Viennese Waltz to I See Red by Everybody Loves an OutlawBalvinder and Julian - Samba to Stay by Shakespears SisterEllie and Vito - Tango to Abracadabra by Lady GagaGeorge and Alexis - Cha Cha Cha to Apple by Charli XCXHarry and Karen - American Smooth to Mystical Magical by Benson BooneKaren and Carlos - Argentine Tango to Red Right Hand by Nick Cave & The Bad SeedsLa Voix and Aljaž - Paso Doble to Beethoven's 5thLewis and Katya - Couple's Choice to Creep by RadioheadVicky and Kai - American Smooth to Total Eclipse of The Heart by Bonnie TylerStop reading now if you want to avoid spoilers from last Saturday's Icons WeekThe professional dancers' Halloween routine was pre-recorded earlier this weekLast week, Emmerdale star Lewis Cope and his dance partner Katya Jones led the pack with 34 points, after their Johnny Cash Quickstep impressed the judges.La Voix brought the laughs - belting out Cher's Believe before diving into a Salsa to Strong Enough. The judges noted there was room for improvement, but La Voix's charisma on the dancefloor was lauded.Other highlights included a mood-boosting dance by Ellie Goldstein and her partner Vito Coppola, who packed a punch with a dynamic Salsa to a Spice Girls medley. Goldstein even got a heart-warming video message from her favourite Spice Girl, Baby.Despite some impressively garish trousers, YouTuber George Clarke hit a bum note with his Jive to Harry Styles' As It Was. Craig Revel Horwood, acerbic as ever, called it \"flat footed\", and Clarke and his partner Alexis Warr crashed out with the lowest score this evening - at 27.BBC/PA WireLewis Cope and and Katya Jones bagged a score of 34 last Saturday, the highest of the nightBut in the end, it was Jimmy Floyd Hasselbaink and his partner Lauren Oakley who left the competition follow a dance off against Amber Davies and Nikita Kuzmin.This Saturday night, the remaining couples will undergo terrifying transformations as they perform routines they hope will win over the judges and audiences at home.We can expect judges Shirley Ballas, Craig Revel Horwood, Motsi Mabuse and Anton Du Beke to embrace the Halloween spirit too - with all eyes on what costumes they might opt for.Halloween week is also a milestone, as week six is almost halfway through the competition.Fans can expect to enjoy plenty of tricks and treats from the vampires, zombies and skeletons.But as always - the couple whose performance doesn't quite cast a spell will be banished during Sunday night's results show.Strictly Come Dancing is broadcast live at 18:35 on BBC One and on BBC iPlayer.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Strictly Come Dancing: Stars gear up for Halloween week",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f444/live/89146950-b65f-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-11-01T00:29:03.000Z",
      "dateModified": "2025-11-01T00:29:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tanzania election: Samia Suluhu Hassan wins vote as hundreds feared dead in unrest",
    "url": "https://www.bbc.com/news/articles/cm2ww0e0jewo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/79ba/live/230fab30-b6e9-11f0-8541-9720c7d6d108.jpg",
    "tag": "Trending",
    "date": "2025-11-01T09:45:38.000Z",
    "description": "President Samia Suluhu Hassan has been declared the winner of Tanzania's presidential election, securing another term in office amid days of unrest ac",
    "body": "President Samia Suluhu Hassan has been declared the winner of Tanzania's presidential election, securing another term in office amid days of unrest across the country.According to the electoral commission, Samia won 98% of the votes, nearly sweeping the 32 million ballots cast in Wednesday's election.International observers have expressed concern over the lack of transparency and widespread turmoil that has reportedly left hundreds people dead and hundreds injured.The nationwide internet shutdown is making it difficult to verify the death toll. The government has sought to play down the scale of the violence - and authorities have extended a curfew in a bid to quell the unrest.\"I hereby announce Samia Suluhu Hassan as the winner of the presidential election under the Chama Cha Mapinduzi (CCM) party,\" Jacobs Mwambegele, the electoral chief, said while announcing the results on Saturday morning.Samia secured about 31.9 million votes, or 97.66% of the total, with turnout nearing 87% of the country's 37.6 million registered voters, the electoral chief said. In Tanzania's semi-autonomous archipelago of Zanzibar - which elects its own government and leader - CCM's Hussein Mwinyi, who is the incumbent president, won with nearly 80% of the vote.The opposition in Zanzibar said there had been \"massive fraud\", the AP news agency reported.Mwinyi's swearing-in ceremony is under way at Amaan Complex stadium in Zanzibar. Tanzania's first female president faces little oppositionWhy elections are a time of fear for albino TanzaniansHow Samia's hesitant reforms are fuelling Tanzanian political angerProtests continued on Friday, as demonstrators in the port city of Dar es Salaam and other cities took to the streets, tearing down Samia's posters and attacking police and polling stations despite warnings from the army chief to end the unrest.No protests were reported on Saturday morning, but tension remained high in Dar es Salaam, where security forces manned roadblocks across the city.The demonstrations are mostly led by young protesters, who have denounced the election as unfair.They accuse the government of undermining democracy by suppressing the main opposition leaders - one is in jail and another was excluded on technical grounds.A spokesperson from the opposition Chadema party on Friday told AFP news agency that \"around 700\" people had been killed in clashes with security forces, while a diplomatic source in Tanzania told the BBC there was credible evidence that at least 500 people had died.Foreign Minister Mahmoud Kombo Thabit has described the violence as a \"few isolated pockets of incidents here and there\" and said \"security forces acted very swiftly and decisively to address the situation\".In a statement, the UN chief Antonio Guterres said he was  \"deeply concerned\" about the situation in Tanzania, \"including reports of deaths and injuries during the demonstrations\". He urged all parties involved to \"prevent further escalation\".The UK, Canada and Norway have expressed similar concerns, citing \"credible reports of a large number of fatalities and significant injuries, as a result of the security response to protests\".There were two main opposition contenders - Tundu Lissu, who is being held on treason charges, which he denies, and Luhaga Mpina of the ACT-Wazalendo party - but he was excluded on legal technicalities.Sixteen fringe parties, none of whom have historically had significant public support, were allowed to run.Samia's ruling party, CCM, and its predecessor Tanu, have dominated the country's politics and have never lost an election since independence.Ahead of the election, rights groups condemned government repression, with Amnesty International citing a \"wave of terror\" involving enforced disappearances, torture, and extrajudicial killings of opposition figures.The government rejected the claims, and officials said the election would be free and fair.Samia came into office in 2021 as Tanzania's first female president following the death of President John Magufuli.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tanzania election: Samia Suluhu Hassan wins vote as hundreds feared dead in unrest",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/79ba/live/230fab30-b6e9-11f0-8541-9720c7d6d108.jpg"
      ],
      "datePublished": "2025-11-01T09:45:38.000Z",
      "dateModified": "2025-11-01T09:45:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Egypt's Grand Museum opens, displaying Tutankhamun tomb in full for first time",
    "url": "https://www.bbc.com/news/articles/ckg4q403rpzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4234/live/32740f10-b66e-11f0-bb84-5d792dcc8544.jpg",
    "tag": "Trending",
    "date": "2025-11-01T01:19:28.000Z",
    "description": "11 hours agoYolande Knell,Middle East correspondent, in Cairo, and Wael Hussein,in CairoGetty ImagesThe new museum will show all of the artefacts disc",
    "body": "11 hours agoYolande Knell,Middle East correspondent, in Cairo, and Wael Hussein,in CairoGetty ImagesThe new museum will show all of the artefacts discovered by Howard Carter and his team in the tomb of Tutankhamun Near one of the Seven Wonders of the Ancient World - the Great Pyramid of Khufu at Giza - Egypt is officially opening what it intends as a cultural highlight of the modern age.The Grand Egyptian Museum (GEM), described as the world's largest archaeological museum, is packed with some 100,000 artefacts covering some seven millennia of the country's history from pre-dynastic times to the Greek and Roman eras.Prominent Egyptologists argue that its establishment strengthens their demand for key Egyptian antiquities held in other countries to be returned – including the famed Rosetta Stone displayed at the British Museum.A main draw of the GEM will be the entire contents of the intact tomb of the boy king Tutankhamun, displayed together for the first time since it was found by British Egyptologist Howard Carter. They include Tutankhamun's spectacular gold mask, throne and chariots.ReutersThe museum is packed with some 100,000 artefacts, including a statue of King Ramses II\"I had to think, how can we show him in a different way, because since the discovery of the tomb in 1922, about 1,800 pieces from a total of over 5,500 that were inside the tomb were on display,\" says Dr Tarek Tawfik, president of the International Association of Egyptologists and former head of the GEM.\"I had the idea of displaying the complete tomb, which means nothing remains in storage, nothing remains in other museums, and you get to have the complete experience, the way Howard Carter had it over a hundred years ago.\"Costing some $1.2bn (£910m; €1.1bn), the vast museum complex is expected to attract up to 8m visitors a year, giving a huge boost to Egyptian tourism which has been hit by regional crises.\"We hope the Grand Egyptian Museum will usher in a new golden age of Egyptology and cultural tourism,\" says Ahmed Seddik, a guide and aspiring Egyptologist by the pyramids on the Giza Plateau.Apart from the Tutankhamun exhibit and a new display of the spectacular, 4,500-year-old funerary boat of Khufu - one of the oldest and best-preserved vessels from antiquity - most of the galleries at the site have been opened to the public since last year.\"I've been organising so many tours to the museum even though it was partially open,\" Ahmed continues. \"Now it will be at the pinnacle of its glory. When the Tutankhamun collection opens, then you can imagine the whole world will come back, because this is an iconic Pharoah, the most famous king of all antiquity.\"\"It's an absolute must-see,\" says Spanish tourist, Raúl, who is awaiting the full public opening on 4 November. \"We're just waiting to go and check out all of the Egyptian artefacts,\" says Sam from London, who is on an Egypt tour. \"It's a once in a lifetime opportunity.\"Getty ImagesThe majority of the museum, including the Grand Staircase, has been open to the public since last yearAnother British tourist says she previously saw the Tutankhamun exhibits on display at the neoclassical Egyptian Museum in bustling Tahrir Square. \"The old museum was pretty chaotic, and it was a bit confusing,\" she comments. \"Hopefully the Grand Museum will be a lot easier to take in and I think you will just get more out of it.\"The new museum is colossal, spanning 500,000 square metres (5.4m sq ft) – about the size of 70 football pitches. The exterior is covered in hieroglyphs and translucent alabaster cut into triangles with a pyramid shaped entrance.Among the GEM showstoppers are a 3,200-year-old, 16m-long suspended obelisk of the powerful pharaoh, Ramesses II, and his massive 11m-high statue. The imposing statue was moved from close to the Cairo railway station in 2006, in a complex operation in preparation for the new institution.A giant staircase is lined with the statues of other ancient kings and queens and on an upper floor a huge window offers a perfectly framed view of the Giza pyramids.The museum was first proposed in 1992, during the rule of President Hosni Mubarak, and construction began in 2005.  It has now taken nearly as long to complete as the Great Pyramid, according to estimates.ReutersThe vast complex is expected to attract up to eight million visitors a yearThe project was hit by financial crises, the 2011 Arab Spring – which deposed Mubarak and led to years of turmoil - the Covid-19 pandemic, and regional wars.\"It was my dream. I'm really happy to see this museum is finally opened!\" Dr Zahi Hawass, Egypt's former long-time minister of tourism and antiquities, tells the BBC. The veteran archaeologist says it shows that Egyptians are equals of foreign Egyptologists when it comes to excavations, preservation of monuments and curating museums.\"Now I want two things: number one, museums to stop buying stolen artefacts and number two, I need three objects to come back: the Rosetta Stone from the British Museum, the Zodiac from the Louvre and the Bust of Nefertiti from Berlin.\"Dr Hawass has set up online petitions – attracting hundreds of thousands of signatures – calling for all three items to be repatriated.The Rosetta Stone, found in 1799, provided the key to deciphering hieroglyphics. It was discovered by the French army and was seized by the British as war booty.  A French team cut the Dendera Zodiac, an ancient Egyptian celestial map, from the Temple of Hathor in Upper Egypt in 1821. Egypt accuses German archaeologists of smuggling the colourfully painted bust of Nefertiti, wife of Egyptian pharaoh Akhenaten, out of the country more than a century ago.\"We need the three objects to come as a good feeling from these three countries, as a gift, as Egypt gave the world many gifts,\" Dr Hawass says.Getty ImagesThe Dendera Zodiac is currently in the Louvre but the opening of the Grand Egyptian Museum has renewed calls for it to be returnedAnother leading Egyptologist, Dr Monica Hanna, names the same objects, \"taken under a colonialist pretext\", as ones which must be repatriated. She adds: \"The GEM gives this message that Egypt has done its homework very well to officially ask for the objects.\"The British Museum told the BBC that it had received \"no formal requests for either the return or the loan of the Rosetta Stone from the Egyptian Government\".Egyptian Egyptologists voice their excitement about the new museum becoming a centre for academic research, driving new discoveries.Already, Egyptian conservators based there have painstakingly restored items belonging to Tutankhamun, including his impressive armour made of textiles and leather. According to Egyptian law, such restorations can only be done by Egyptians.\"Colleagues from around the world have been in awe of the fantastic conservation work that has been done,\" says Dr Tawfik, adding that the entire project is a source of great national pride. \"As well as ancient Egyptian history, we are also showcasing modern Egypt because it's Egypt that built this museum.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Egypt's Grand Museum opens, displaying Tutankhamun tomb in full for first time",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4234/live/32740f10-b66e-11f0-bb84-5d792dcc8544.jpg"
      ],
      "datePublished": "2025-11-01T01:19:28.000Z",
      "dateModified": "2025-11-01T01:19:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Houses without lounges are a reality for renters",
    "url": "https://www.bbc.com/news/articles/c93063q2lzeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ce32/live/5b113cc0-b684-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-11-01T01:02:51.000Z",
    "description": "11 hours agoKevin PeacheyCost of living correspondentElla MurrayElla (left) with flatmate Maisy, says socialising is often done at the kitchen tableHo",
    "body": "11 hours agoKevin PeacheyCost of living correspondentElla MurrayElla (left) with flatmate Maisy, says socialising is often done at the kitchen tableHomes without lounges are becoming a reality for renters on tight budgets faced with a lack of available lets.Nearly a third of homes advertised on flat-sharing website SpareRoom in the first half of the year had no living room.Ella Murray, aged 22, who shares with three other people in London, said: \"At this stage in my life I'm not willing to sacrifice money for more space.\"Landlords say turning a lounge into a bedroom helps them cover their higher mortgages and other extra costs, while meeting demand from tenants.But a lack of communal space means many renters are living and working in one bedroom putting them at risk of social isolation.Some also point out the \"false economy\" of being forced to go out to socialise which can cost more than a night in with friends.Cost-of-living pressuresStudents living away from home might expect to rent in a property where the front room has been converted into a bedroom.But these latest figures suggest this is a reality for young professionals renting in their 20s and 30s.Analysis by SpareRoom, shared with the BBC, shows:Some 30% of adverts for a room posted on the platform in the first half of the year were for places without a living roomThat proportion was higher in London, at 41%Birmingham saw an increase from 16% to 22% of adverts with no living room in the five years from 2020The data covers flat or house shares only, and does not include any studio, or one-bedroom listings.Official figures show average UK monthly private rents increased by 5.5%, to £1,354, in the year to September.As costs rise, there are 10 prospective tenants on average chasing every available rental property, according to the latest Rightmove data.A landlord turning a lounge into a bedroom provides an extra place for a tenant. It could also mean lower rent payments for each tenant but potentially more rent overall for landlords covering higher mortgage repayments seen in recent years.Ella and her three housemates split the rent of £3,000 a month according to the size of their bedrooms, but their home does not have a living room.\"We have a decent-sized kitchen with a dining table which is where we hang out instead. We would definitely socialise more if we had a living room,\" she said.She said the rent was cheaper as a result, and - living in London - it was the norm among her friends in other rental properties in the city.She works in musical theatre, and said she would be more inclined to rent somewhere with a living room were her wage to increase and were she to move in with a partner.Hannah CarneyHannah and her flatmate Emma usually socialise in the kitchenHannah Carney, 26, also shares a property without a lounge and says none of the places she had rented since she was 18 had a living room.She says she misses having a \"chill place that is social\" and it means she and her flatmates probably spend more on going out for dinner and drinks.\"I'd love to say that all properties should have a communal area. I wish that was the norm, but I know it's not realistic,\" she said.The best she and her flatmate could do, she says, is to have movie nights in a box room that they also use to hang their washing.Matt Hutchinson, director of SpareRoom said: \"We've had so many messages from people who met their best friends and partners in flatshares, who've raised families or started businesses together.\"Those kinds of stories will become rarer if communal, sociable spaces within homes are not protected. Sadly, loneliness is alarmingly common.\"With rents as unaffordable as they are now, it's understandable people are looking for ways to cut the cost of living.\"Chris Norris, chief policy officer at the National Residential Landlords Association (NRLA) said the \"root of the challenges\" was too few rental homes to meet demand.The NRLA said some landlords, facing a difficult outlook, were moving into offering multi-occupancy homes so their businesses remained viable enough to carry on.\"With rising costs and the expectation of smaller margins to contend with, some landlords will certainly be looking at how to use their investments most efficiently and meet demand effectively whilst delivering high-quality private rented homes,\" Mr Norris said.At the more extreme end of the scale, the BBC has previously uncovered illegal house-sharing in multi-occupancy homes.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Houses without lounges are a reality for renters",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ce32/live/5b113cc0-b684-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-11-01T01:02:51.000Z",
      "dateModified": "2025-11-01T01:02:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Microsoft's Halo series heading to rival PlayStation",
    "url": "https://www.bbc.com/news/articles/ckg14442r73o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5c84/live/f564b960-b17e-11f0-a628-fdce540967b8.jpg",
    "tag": "Trending",
    "date": "2025-10-25T09:48:56.000Z",
    "description": "7 days agoAndrew RogersBBC NewsbeatMicrosoftThe Halo series has gone to new worlds, and now it's going to new consoles tooMicrosoft is taking one of i",
    "body": "7 days agoAndrew RogersBBC NewsbeatMicrosoftThe Halo series has gone to new worlds, and now it's going to new consoles tooMicrosoft is taking one of its most popular and recognisable game series to a rival console for the first time.Halo, a sci-fi shooter fronted by the armour-clad Master Chief, is heading to PlayStation 5 next year, something that would have been unthinkable for gaming fans when the title first launched in 2001.A remake of the first game Halo: Combat Evolved has been announced for Microsoft's own Xbox hardware, as well as for Sony's PS5, under the name Halo: Campaign Evolved.It will also launch on PC, and will be playable on mobile phones and tablets through Microsoft's cloud streaming technology.It's the latest sign Microsoft is moving away from the traditional approach of console makers keeping their own franchises and characters as exclusives.The end of console wars?Halo is often credited with helping Microsoft first break into the gaming market with its original Xbox, despite arriving after consoles from Nintendo and Sony were already popular.But while Microsoft has rapidly expanded its presence in the industry, buying up several rival studios - including Call of Duty maker Activision for $69bn (£56bn) - it's struggled to convince gamers to buy its latest consoles.Globally, the PlayStation 5 has reportedly outsold Microsoft's Xbox Series S and X consoles by more than two to one. Nintendo's hybrid Switch console has been even more successful.Microsoft has instead been pushing a strategy of being able to play its games in more places, including on PCs, tablets, phones, and its new handheld console, the ROG Xbox Ally.This has included promoting its subscription service Game Pass, where a monthly charge gets players access to a library of games, similar in style to services like Netflix and Disney+.Increasing the Halo: ReachWhile there's long been rivalry between PlayStation and Xbox players, some fans of the Halo series are happy to see it reach more people. YouTuber Kara, who streams under the name @Eldeeable, tells BBC Newsbeat that Halo's been a big part of her life. \"Combat Evolved was one of the first games I ever played on Xbox,\" she says. \"I played it with my little brother split-screen and I loved it.\" She says the announcement is \"massive\" and \"broke the internet a little bit\". @EldeeableKara, 29, says Halo has been a big part of her life, growing up as an \"Xbox girly\"Some Xbox owners have criticised Microsoft for not keeping Halo as an exclusive game, but it reflects a broader move away from exclusivity - with PlayStation releasing games from its The Last Of Us and Horizon series on PC, and even Nintendo making some games with its characters available on mobile phones.For Kara, this shouldn't be seen as a bad thing.\"I know there's a bit of controversy about it coming to PlayStation, but I don't see any reason why it should be like that at all\", she says. \"I just think it's a win for all gamers.\" The game's executive producer Damon Conn agrees, promising that the remake will appeal to old and new fans.\"At its heart, Halo is about connection, we're thrilled to meet a new generation of players on their platforms of choice to fall in love with Halo the same way we did,\" he says.\"We're not trying to rewrite Halo's legacy - we're trying to immerse you in it like never before.\"Additional reporting by Georgia Levy-Collins and Peter Gillibrand.Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here.Related topics ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Microsoft's Halo series heading to rival PlayStation",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5c84/live/f564b960-b17e-11f0-a628-fdce540967b8.jpg"
      ],
      "datePublished": "2025-10-25T09:48:56.000Z",
      "dateModified": "2025-10-25T09:48:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jordan Pickford: Everton goalkeeper talks about his career, World Cup dream and love of motocross",
    "url": "https://www.bbc.com/sport/football/articles/clyk1nwg0wdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6a0a/live/eba1ff70-b640-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-11-01T06:13:56.000Z",
    "description": "Pickford on England records, World Cup dream & love of motocrossThe Football Interview is a new series in which the biggest names in sport and enterta",
    "body": "Pickford on England records, World Cup dream & love of motocrossThe Football Interview is a new series in which the biggest names in sport and entertainment join host Kelly Somers for bold and in-depth conversations about the nation's favourite sport.We'll explore mindset and motivation, and talk about defining moments, career highs and personal reflections. The Football Interview brings you the person behind the player.Interviews will drop on Saturdays across BBC iPlayer, BBC Sounds and the BBC Sport website. This week it will be shown on BBC One at 23:55 GMT (and after Sportscene in Scotland).———————————————————Jordan Pickford is Everton and England's number one and, fresh from signing a new contract at the Toffees, it will be something he hopes to remain for years to come.The 31-year-old started his career at his boyhood club Sunderland and had spells on loan at several lower-league clubs before making the move to Merseyside in 2017.Since then Pickford has only gone from strength to strength, making more than 300 appearances for Everton and has won their player of the year award four times, including the past three seasons.More recently, he set a new England record for consecutive clean sheets, which he extended to nine matches after the win against Latvia earlier in October.Before Monday's return to Sunderland in the Premier League, Pickford sat down with Kelly Somers to talk about his childhood, taking his son to football training and a love of motocross.Media caption, 'I'm praying I get a good reception' - Pickford awaits Stadium of Light returnKelly Somers: Let's start with football, what does it mean to you?Jordan Pickford: It is all I know really. As a young kid I played since I was five years old, so I grew up being a football fan and I had the opportunity to be a footballer which is every kid's dream. There are only so many people who can achieve that dream so it is a massive honour really and I take a lot of pride that I became a footballer.Kelly: Did you always think you would be a goalkeeper?Jordan: I was always in goal, my first memory was being in goal. I remember playing with my brother and his mates in the street and I was in the goal on the concrete. When my brother was playing for the district at the time there was a team training who needed a goalkeeper so I went in goal and that was pretty much the start of me.Kelly: A goalkeeper playing on concrete as well?Jordan: I'm daft aren't I?Kelly: Who was your childhood idol?Jordan: When I was watching football it was Kevin Phillips and Thomas Sorensen at Sunderland when I was young, but when I got older it was Wazza [Wayne Rooney] and Joe Hart.Kelly: So you always had the attacking player you liked but the goalkeeper too?Jordan: Wazza is a legend isn't he? I was a bit too young for Gazza [Paul Gascoigne].Kelly: What was it like when you first joined Sunderland, because you were a boyhood fan?Jordan: I was at Sunderland from the development squad at seven or eight and got my first contract at under-nine and then you had to do well every year to keep getting another year. Once I joined and was going to games and played every Sunday for them it was mint, but it is probably when you are a bit older at 14 or 15 that you realise you have an opportunity.Image source, @Jpickford1Image caption, Jordan Pickford started his career at SunderlandKelly: Was there ever a moment you thought, 'I could make this here?'Jordan: It starts at a younger age now but when I was growing up you used to get day release one day a week on a Tuesday, so you had the full day at training. At 14 or 15 I got invited to train on Thursday morning at Sunderland and train with the youth team, so I used to have a day and a half off school so that was when I thought that I was sticking it properly then.Kelly: You didn't have it easy all the time at Sunderland going on a lot of loans, but then you did make it here to Everton. What was that move like for you?Jordan: The loans I would say now if any goalkeeper can have an opportunity to go on loan and play in the lower leagues it will be more beneficial than youth team football. You are playing a proper game, there's a lot more pressure that you thrive off and you learn and mature more as a goalkeeper. It is probably the best thing that happened to me going on all those loans. I'll never forget when I was on loan at Preston, I was doing really well and big Sam [Allardyce] called me back and gave me a new contract and I made my debut in the FA Cup against Arsenal in the same week. A week later I made my Premier League debut, I was sat on the bench for the rest of the season but it was another good experience as well. The year after Vito Mannone got injured and that is where I grabbed the opportunity with both hands.Kelly: It feels like there's a lot of excitement around the club but there's also a lot of hype around you. You are often linked to other clubs. Why was this the right time to sign a new deal?Jordan: When I first signed we were in Europe and that was the driver then and that is where Everton should be. We had the two or three years that were a bit of a rollercoaster ride, weathered those storms and now it is all looking positive and the club is going in the right direction. You see with the signings the club has made and the drive we have this season to improve, it comes from the top of the club. I think we will see a lot more positive results and us pushing higher up the table. You want to be playing in the Premier League and I have that opportunity with Everton.Kelly: What are the ambitions of Everton this season?Jordan: I'll never look at the end of the season and say, 'I want to do this', I always take it game by game.Kelly: But when you sign a new contract you must have an idea where you want Everton to go?Jordan: We want to be pushing that top half of the table. The manager is driving us to be in the top half and try to get into Europe. I think getting into the top half and sustaining that momentum in the top half and not dropping down and keep putting us as players that pressure, to go get more results and keep improving, is definitely a drive. I think if we do that and, with the squad we have, we can push for Europe. We never know if it will be Champions League, Europa League, Conference League, but if we are in that bracket then we have had a good season.Image source, AFP via Getty ImagesImage caption, Jordan Pickford had several loan spells while at Sunderland before joining Everton permanently in 2017Kelly: As for England that is not going too badly too - qualifying for the World Cup and keeping nine successive clean sheets for you as well, surpassing Gordan Banks' record. What does that mean to you?Jordan: I don't take all the credit. It is a great honour to break a record like that because Banksy is an absolute legend of the game but I always say it is a team effort - we win together, lose together and keep clean sheets together. I know Harry Kane keeps scoring goals week in and week out, but the lads are there to provide service and I am there to help the lads when I am needed to make a save and be called upon, that is what I feel like I do. I am always in the moment as a goalkeeper because them games I probably have not had that much to do, but when called upon and making saves I am making the right decisions, playing out from the back. So there's a lot more to it than just clean sheets because it is not as if I am having seven or eight saves to make in a game, there's the concentration element to it. I take credit for that in terms of staying in the game and the moment but I'll never take the credit for keeping a clean sheet.Kelly: How do you stay in the moment when you are not busy?Jordan: You have to stay mentally prepared. Every goalkeeper is different. For me it will be if the ball is in the other half of the pitch I will always be on the right side, always mirroring the pitch and making sure I feel if it is breaking down I am in the right position to maybe get a through-ball or make a save. Communication as well, I feel like just being connected is key.Kelly: It has been a remarkable career for you so far and you still have a fair few years left, but when you reflect on it all has there been a turning point or a moment where you think, 'if that hadn't happened, maybe I wouldn't have achieved what I have?'Jordan: I think I have always had that mentality that I want to improve myself. I don't want to think that because I've got 80 caps for England or played 330 times for Everton that I've made it, I am always striving for more for myself. When my son Arlo was born that was a big change where there was an unknown to the family. It was new to me and Megan and that was a big change. That was when I had a bit of a dip of form and that is when I started using psychologists, rough with the smooth.Kelly: There's been some interesting quotes from your team-mates where they have talked about your personality. I've heard James Tarkowski say you bark at him and you have had arguments on the pitch. Kyle Walker has described you in various ways, Declan Rice - I've read some of the quotes - but basically they are all just saying you are a bit bonkers!Jordan: There is probably a line where sometimes I go too much that way. That is something I am trying to adapt. There has got to be a balance. When I put a football shirt on, if I am doing small-sided games with the lads in training I hate losing. It gets me right up. I think it shows the passion I have for wanting to win.Kelly: We know how your team-mates describe you, how would your best friend or family describe you?Jordan: I think they will say I am caring and that I look out for people like my mates and I always want the best for everybody. I think it is one thing I am good at.Kelly: What are you like as a football dad? Do you try to blend in or are you shouting at your boy?Jordan: If I am behind the goal, but the last few times he has switched on because I had a little discussion with him where I told him he'd enjoy football more if he was concentrating. I went to one game and he wasn't interacting and getting involved as much but he is only six. He took it so much on board and me and Meg went the next week, he was playing against Stoke's academy and it was when there was a storm and it was freezing but he was amazing. I didn't say anything to him then because he had taken it on board and it was amazing to see him enjoying it. I asked him if he was enjoying it and he said yes and I felt mint then. He played again at the weekend and he was really good again. I wouldn't shout at him, if he is lacking concentration I will just say \"switch on\".Image source, @Jpickford1Image caption, Jordan Pickford and his wife Megan have three childrenKelly: What was it like growing up in your house?Jordan: Mad. That was mad. My parents brought me and my brother up really well. They were strict but not too strict. They let us do a lot of what we wanted to do. Times have changed now, you don't see kids out on the street as much now and I feel like we've lost that way a bit. I was out on the street and my mam was shouting, 'get in Jordan, you have school tomorrow'. I wanted to be out all the time,Kelly: Were you a bit of a naughty kid, maybe?Jordan: I think so. My mam would describe me as something else!Kelly: I read a quote from you the other day that even when you get an England call-up now your mum still texts you congratulations so you are obviously very close.Jordan: I will ring her every morning and on the way home from training every day. She will text me before every call-up and text me saying good luck before every game and would text me after saying well done whether I've had a good game or a bad game.Kelly: Tell me one thing about yourself that would surprise me.Jordan: I am not allowed to do it as a footballer but I would love to be able to do motocross. I grew up going to watch it every week with my mates, and my best best mate now rides in the British Championships. If I could I would go every week to watch as much as I can. I would do it if I could but there are strict rules in our contracts where we are not allowed to do activities like that. That is probably one thing in my life I would have love to have done.Kelly: Is that a big passion of yours?Jordan: Yes as I went from such a young age and we would stay in motorhomes and caravans at the racetrack as kids and it was mint. The adrenaline I get from watching my mates on the start line and the gate drops, then get to the first corner... the adrenaline I get if they get a good start and I am properly leaning over and cheering them on.Kelly: Do you get spotted there?Jordan: Yeah I get spotted but it doesn't bother me, I am leaning over the fence to push them on to try to do better. It gives me proper adrenaline and it is one of the things I love.Kelly: If you could only achieve one more thing for the rest of your career what would it be?Jordan: Win the World Cup.Kelly: Next summer?Jordan: Yep. That would do me. It is what the whole nation is waiting for.Kelly: Do you feel like you've got the best opportunity now?Jordan: Yes we've had some great opportunities. The more experiences you have in tournament football and see the lads winning cups and Champions League then you can lean on that. I think, for me, to lift that World Cup or a major trophy for England would be number one and if I could ever get silverware at Everton that would be number two. It has been that long since England has won something and to be a part of that would be amazing. We have to believe in ourselves, we have that opportunity and we have to take it with both hands but you are playing the best nations in the world and you have to play your best in each game and that's what takes you so far.Kelly: What are you proudest of?Jordan: As a young kid growing up, getting that opportunity to become a footballer, you might make your debut for Sunderland and it might become a dream but it is that sustainability for doing it for so many years and keep progressing and keep getting better that I think I am proud of myself for - and to keep putting the dedication I put in.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jordan Pickford: Everton goalkeeper talks about his career, World Cup dream and love of motocross",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6a0a/live/eba1ff70-b640-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-11-01T06:13:56.000Z",
      "dateModified": "2025-11-01T06:13:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hand of Moscow? The men jailed for vandalism in French hybrid warfare case",
    "url": "https://www.bbc.com/news/articles/c891d43l8pyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0e68/live/bffead20-b66b-11f0-bb84-5d792dcc8544.jpg",
    "tag": "Trending",
    "date": "2025-11-01T00:36:56.000Z",
    "description": "12 hours agoAndrew HardingParis correspondent, ParisThis week's trial of three undercover operatives, accused of helping the Kremlin to wage a hybrid ",
    "body": "12 hours agoAndrew HardingParis correspondent, ParisThis week's trial of three undercover operatives, accused of helping the Kremlin to wage a hybrid warfare campaign to \"destabilise\" France, sounds like a surefire recipe for drama, sophistication, and intrigue.If only.Over the course of three days, in a spacious, pine-panelled courtroom on the northern edge of Paris, the case against three seemingly unremarkable Bulgarian men, seated behind glass and shadowed by three police officers who seemed absorbed with their own mobile phones, unfolded with all the panache and excitement of a half-whispered lecture in a library.\"I had absolutely no idea where we were.\"\"I did it for the money.\"\"In the future I plan to get involved in charity work.\"These few lines from the men's testimony may help convey the general tone.All three were jailed on Friday for two to four years.But to bemoan the barely audible banality of it all – the dull motives, the mumbled attempts to shift blame, the sullen complaints about prison life and unsatisfactory psychiatric evaluations - is to miss the truth.The banality is the whole point.Like the cheap drones that both Russia and Ukraine now use to patrol their front lines, the three men on trial in courtroom 2.01 at the Palais de Justice in Paris represent a low-budget evolution of modern hybrid warfare.Improvised and startlingly effective.Rising in turn inside their glass cage, Georgi Filipov, Nikolay Ivanov and Kiril Milushev admitted carrying out the acts, but denied working for a foreign power as well as antisemitism.Early one morning in May 2024, on the banks of the River Seine in the heart of Paris, the three men conspired to spray red paint - and filmed themselves doing so - on the Wall of the Righteous, a monument to those who saved French Jews from the Holocaust during World War Two. Thirty-five red handprints were left on the Shoah memorial. Five hundred more were painted elsewhere.It was the first in a series of symbolic attacks in France: pigs' heads placed outside mosques (an act blamed on a group of Serbians); coffins left ominously by the Eiffel Tower; Stars of David painted around the capital.News of each event was swiftly broadcast around the world – not just by regular media outlets, but by the automated army of Russian social media trolls which, according to the French agency monitoring such activity, routinely seeks to weaponise each sliver of news that might raise doubts about the stability of French society, and the strength of Europe's democracies, its institutions, and its values.France is seen as a particularly tempting target for the Kremlin, given its current political and social divisions, its often ambiguous attitude to Nato, its large Muslim and Jewish populations, the increasing popularity of the far right, and a history of close ties to Moscow on both extremes of the political spectrum.In another era, the Kremlin might have used its own deep undercover agents to carry out acts of sabotage or vandalism. But – to make the drone warfare comparison again – why rely solely on valuable assets like highly trained spies, giant ballistic missiles, or submarines used to cut undersea cables, when for a few thousand euros you can, through discreet and easily deniable channels, recruit your own disaffected army of petty criminals, or unemployed wannabe fascists?\"I had absolutely no idea where we were,\" said Georgi Filipov, as he tried to play down his alleged role in the \"red hands\" operation, arguing that he had travelled from Bulgaria simply to make a little money to help with child support payments for his nine-year-old son. He was allegedly paid €1,000 (£875) plus travel expenses.In the dock, Filipov, 36, cut a gaunt but muscular figure, twitching slightly like a boxer before a fight as he attempted to defuse awkward questions about his tattoos. In particular, the swastika on his chest and the social media photos showing him giving a Nazi salute and wearing a t-shirt that claimed Hitler \"was right\".\"I made bad choices in the past,\" Filipov explained, and pointed out that he had already removed several tattoos. The Paris criminal court sentenced him to two years in jail.Having been successfully extradited from Bulgaria and Croatia to face trial in France, the men all sought to place the blame on a fourth man, Mircho Angelov, who remains at large but is alleged to have links to a Russian intelligence officer. He was given a three-year term in absentia.The second defendant, Kiril Milushev, 28, said he had only come to France because he had broken up with his partner, was struggling with a bipolar disorder, and wanted to keep his friend, Mircho, company. He was given two years.Seated beside Milushev, Nikolay Ivanov creased his forehead as he denied any links with Russia. He spoke of his grandparents' role in saving Jews during World War Two and said his ambition now was to obtain a master's degree in law, and to be reunited with his girlfriend - if she'd still have him, when all this was over.Considered the mastermind behind the plot, he was given the heaviest jail term of four years.As for Russia's alleged role in the red-hands affair, even the defence lawyers openly admitted that \"we suspect\" Moscow's hand. But they insisted, as did their clients, that they were unwitting pawns, proxies – one might even say \"drones\" – in a shadow war against the West.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hand of Moscow? The men jailed for vandalism in French hybrid warfare case",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0e68/live/bffead20-b66b-11f0-bb84-5d792dcc8544.jpg"
      ],
      "datePublished": "2025-11-01T00:36:56.000Z",
      "dateModified": "2025-11-01T00:36:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Where might Andrew live on the Sandringham estate?",
    "url": "https://www.bbc.com/news/articles/c201zvrpvw9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6fce/live/3373ccd0-b663-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-31T16:46:11.000Z",
    "description": "20 hours agoBen Hatton & Maia DaviesGetty Images, York Cottage, Alamy, Oliver's TravelsAnmer Hall, York Cottage, Park House and Gardens House are all ",
    "body": "20 hours agoBen Hatton & Maia DaviesGetty Images, York Cottage, Alamy, Oliver's TravelsAnmer Hall, York Cottage, Park House and Gardens House are all on the estate - but not all of them are available Newly stripped of his \"prince\" title, Andrew is moving from his Windsor mansion, Royal Lodge, to the Sandringham estate in Norfolk, it is understood.Formal notice was given to surrender the lease at the Royal Lodge on Thursday, and the move will take place as soon as possible.The historic, sprawling estate spans approximately 31 sq miles (80 sq km) of gardens - making it around the same size as Nottingham or Brighton and Hove.It was bought as a private country retreat for the future Edward VII when he was Albert, Prince of Wales in 1862, and has since been passed down from monarch to monarch.The estate itself covers several residential villages and hamlets, and includes 15 sq miles (40 sq km) of farmland.The main building - Sandringham House - is thought to have more than a hundred rooms, including a ballroom.It remains a country retreat for the Royal Family and is where they traditionally gather at Christmas.Andrew will be moving some 140 miles (225km) north-east of his Windsor mansion - and away from senior royals like King Charles III and Queen Camilla, who reside in London, and the Prince and Princess of Wales in Windsor.Some assumed Andrew would move from Royal Lodge to another property on the Windsor estate, Frogmore Cottage for example, royal biographer Robert Hardman told the BBC.\"But no,\" he said, \"he's off the estate, he's out of Windsor, he's out of royal Berkshire - he's been sent up the M11 to the royal equivalent of Siberia to sit in Sandringham for the rest of his life.\"\"This is - some might say brutal, others might say definitive.\"Sandringham is a private estate - not an official royal residence - and it is understood the King will be privately funding Andrew's accommodation there, and that it will not be directly funded by the taxpayer.The Palace has not yet said exactly where on the estate Andrew will live, or when he could move.But royal sources have said it will not be immediate, and instead be \"as soon as possible and practicable\". Here is a look at some of the options on the estate.York CottageAlamyOriginally known as Bachelor's Cottage, York Cottage is about a quarter of a mile from the main house.It has its own set of stables and kennel buildings, according to Historic England, and overlooks one of two man-made lakes on the estate.There were reports ahead of Prince Harry's marriage to the Duchess of Sussex that the pair might have been gifted the use of York Cottage by Elizabeth II for use as a country home, but no such plan was ever confirmed and the move never materialised.It has reportedly been used as an office and accommodation for staff in recent years.Everything we know about Andrew losing titles and Windsor mansionVirginia Giuffre's family speak to BBC: \"She'd be so proudWhere does the King get his money?Park HouseBrendan Beirne/ShutterstockThe birthplace of Diana, Princess of Wales and her childhood home, Park House was rented by the Spencer family for many years.In 1983 it was gifted to Leonard Cheshire, a disability charity, which used it to run a 16-bedroom hotel for the disabled, their carers and family.The charity planned a £2.3m refurbishment before the pandemic hit, but announced in 2020 it would not go ahead with the proposal and said instead that it was working with the Sandringham estate to exit the lease.Gardens HouseOliver's TravelsGardens House was put on the market as a holiday let over the summerAnother option is the Gardens House, which was once the residence of the head gardener on the Sandringham estate.The Edwardian house has six bedrooms and three bathrooms, is dog-friendly and is one of two properties on the estate available to the general public as a holiday let.Its grounds hold a working sawmill and organic farm.It was put on the market in July at a weekly price of £4,110. It is not unusual for royal residences to rent out property to holidaymakers - with eight cottages and lodges available for hire at Balmoral Castle in Scotland.The FollyAnother possibility is The Folly - a three-bedroom, two-bathroom lodge built in the 1800s.Complete with a turret and a wraparound balcony, it has been used as a hunting lodge and a place to take afternoon tea.Also listed as a holiday let to the public, it is said to have room for six guests - a change from the 30-room Windsor mansion Andrew will be vacating.Given the lodge's \"grandeur\", Majesty Magazine's managing editor Joe Little told the BBC earlier this year, there is a \"a heightened awareness that the privately owned royal estates are actively striving to bolster\" the Royal Family's revenue streams.Wood FarmShutterstockThis is one option that is understood to have been ruled out.The farmhouse, described as \"small and intimate\" by former housekeeper Teresa Thompson, has strong associations with Andrew's parents.His father, the late Duke of Edinburgh, chose the secluded property as his permanent home when he retired from public life in 2017.He and the late Queen already regularly stayed there in preference to opening up Sandringham House when it was just the two of them.Anmer HallGetty ImagesAnmer Hall was gifted to the Prince of Wales and Catherine, Princess of Wales as a wedding present by the late queen in 2013 - so this may be an unlikely choice.They spend much of the school holidays in the 10-bedroom, Grade II*-listed house, which is about 2 miles (3km) east of the main Sandringham house.The Georgian property dates back to about 1802, but some parts are much older - and it has formed part of the Sandringham estate since 1898.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Where might Andrew live on the Sandringham estate?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6fce/live/3373ccd0-b663-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-31T16:46:11.000Z",
      "dateModified": "2025-10-31T16:46:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Andrew: Why Sarah Ferguson, Beatrice and Eugenie can't escape the taint of family scandal",
    "url": "https://www.bbc.com/news/articles/cy8vrzpgxnro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4edd/live/2b3161c0-b679-11f0-8e54-b35e49a65740.jpg",
    "tag": "Trending",
    "date": "2025-11-01T09:13:32.000Z",
    "description": "3 hours agoNoor NanjiCulture reporterGetty ImagesThe scandal that has engulfed Andrew is of his own making, but it has had a profound impact on his im",
    "body": "3 hours agoNoor NanjiCulture reporterGetty ImagesThe scandal that has engulfed Andrew is of his own making, but it has had a profound impact on his immediate family: his ex-wife Sarah Ferguson, and their two daughters.Ms Ferguson, 66, has been haunted by her own links with convicted sex offender Jeffrey Epstein.She will now move out of Royal Lodge and will make her own living arrangements, although it's believed she won't be moving to Sandringham in Norfolk with Andrew.Princesses Beatrice, 37, and Eugenie, 35, will retain their titles, as they are the daughters of the son of a Sovereign.But questions have also been raised about whether they can disentangle themselves from their parents' mess.Getty ImagesSarah Ferguson and Andrew were divorced in 1996 but live together at Royal LodgeMs Ferguson, who lost her duchess title when Andrew gave up his Duke of York title a few weeks ago, had, until recently, sidestepped the firing line of the controversy around Epstein.But in September, several charities dropped her as patron or ambassador after the emergence of an email from 2011 in which she called Epstein her \"supreme friend\" and seemed to apologise for her public criticism of him.The only charity she is still linked with is her own foundation, Sarah's Trust.It used to have a \"duchess collection\" - a range of products including tea and biscuit sets to raise funds for the charity - but the website for that is no longer active.Its causes include supporting vulnerable communities, including \"forgotten women\" globally.BBC News has made multiple attempts to contact the charity to ask if such a cause is appropriate given Ms Ferguson's ties to Epstein. But the phone number listed is not recognised, and emails bounced back.We raised this with the Charity Commission, who said one of its team has been in touch with the charity reminding it to keep their contact details up to date.Follow live updates on this storyEverything we know about Andrew losing titles and Windsor mansionVirginia Giuffre's family speak to BBC: \"She'd be so proud\"Watch: Question Time audience reacts to newsIs this finally rock bottom for Andrew Mountbatten Windsor?Away from her philanthropy, Ms Ferguson has various business ventures, and has written several children's books, non-fiction about Queen Victoria, and her own memoirs.Her latest children's book, which was due to be published on 9 October according to a press release in Bookseller, is now showing as available from 28 November on Amazon.Waterstones bookstores told BBC News that the publication date for Flora And Fern: Kindness Along The Way, had \"moved\" and that they didn't have a new publication date.Her publisher, New Frontier Publishing, has not responded to a request for comment.However, one industry source told the BBC that \"it would be an entirely sensible decision\" to delay publication.Ms Ferguson's other publishers have remained tight-lipped when asked whether they plan to sever links with her.Harper Collins, which has published two of her titles, the most recent being A Most Intriguing Lady which came out in 2023, declined to comment but pointed to the fact that both her books remain in print and available.\"Publishers don't tend to drop authors, they just quietly don't renew contracts,\" said Neill Denny, editor of the book trade news website Book Brunch.He said that while there has been speculation that Ms Ferguson, or indeed Andrew, could write a tell-all memoir, \"I think the publishers would be wary of taking on the ex Duchess of York's story.\"Noor Nanji explains what will happen to Andrew's family now he's no longer a prince.As for Beatrice and Eugenie, they have kept their princess title - which will be a small victory for Andrew, who will have wanted to protect his daughters, even at his own expense.Both appear to have escaped the UK this week.Beatrice was pictured at an investment summit in Saudi Arabia. Her family have long-held links to the Middle East and she also recently appeared in a promotional picture for a UAE bank.Meanwhile, Eugenie was pictured in Paris with friends.And while there has been some sympathy for the princesses, they also haven't been able to completely avoid the scandals around their parents.Earlier this week, a picture resurfaced showing Epstein, Ghislaine Maxwell and Harvey Weinstein at Beatrice's 18th birthday party in Windsor.The Telegraph also reported a leaked email from Epstein to his UK-based lawyer that suggested Ms Ferguson and the princesses visited Epstein in New York after he was released from prison in 2009.A source close to Ms Ferguson insisted that neither she nor her daughters had any recollection of such a visit, according to the newspaper.X/@SunilSharmaUKPrincess Beatrice was spotted in attendance at the Future Investment Initiative in Riyadh this weekIn 2018, Beatrice told British Vogue in a joint interview with her sister: \"We are young women trying to build careers and have personal lives, and we're also princesses and doing all of this in the public eye.\"The princesses are not working royals, and both have jobs - Beatrice founded advisory firm BY-Eq, while Eugenie works at the gallery Hauser & Wirth.Both are married with children, with Beatrice splitting her time between her Cotswolds property and an apartment in St James' Palace. Eugenie lives between Portugal and a property in the grounds of Kensington Palace.On Friday night, royal sources said the late Queen's corgis are still going to be looked after by Andrew, Sarah and their daughters - although it's uncertain whose home they will reside in.Both princesses also have their philanthropic endeavours. Eugenie set up the anti-slavery collective, a charity whose focus includes victims of sex trafficking. According to the most recently available accounts, it has raised £1.5m in donations last year but has so far distributed very little, with £1.3m carried forward.BBC News approached the charity to ask for a comment in light of the latest controversy surrounding Andrew and Epstein, but it has not responded.Getty ImagesThe princesses pictured with their father at the wedding of Harry and Meghan in 2018At the end of this tumultuous week, there are still many unanswered questions.Family time will clearly be harder now. Andrew is moving to Norfolk, which means he is no longer close by to his daughters and grandchildren. Ms Ferguson - who maintained a close relationship with Andrew and lived at Royal Lodge with him, despite their divorce in 1996 - will also now move home.On Saturday, The Times reported that Andrew \"finally\" agreed to leave his Windsor mansion, after it became apparent his ex-wife was going to move out.Ms Ferguson's representatives declined to comment when asked by BBC News.For now, it is unclear where she will move to. She recently sold her Belgravia flat, which she purchased for £4.2m. It is still listed in her name on Land Registry records, but her spokesperson confirmed to BBC News that the sale has gone through.And then there's a question mark over Christmas.It's been previously announced that Andrew would be excluded from the traditional royal family gathering which takes place in Sandringham at Christmas.Where Ms Ferguson will be is also not clear.But either way, the princesses will face a choice, whether to spend it with their parents, their in-laws, or the wider Royal Family.What they decide may be telling. With the York brand now tainted beyond repair, who they choose to celebrate with may be a sign of who they will align with in future.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Andrew: Why Sarah Ferguson, Beatrice and Eugenie can't escape the taint of family scandal",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4edd/live/2b3161c0-b679-11f0-8e54-b35e49a65740.jpg"
      ],
      "datePublished": "2025-11-01T09:13:32.000Z",
      "dateModified": "2025-11-01T09:13:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]