[
  {
    "title": "Wild London",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002hzg7?at_mid=UpOeB35B7u&at_campaign=Wild_London&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002hzg7&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Wild_London&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mnqm2q.jpg",
    "tag": "Trending",
    "date": "2026-01-01T06:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeWild LondonWild LondonSir David Attenborough explores the wildlife of his London hometown, from urban deer to rooftop peregrines and many others, revealing how nature thrives in the world’s greenest major city. Duration58 minsFirst shown6:30pm 1 Jan 2026Available for 11 monthsWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesKingdomSome will rise, others will fall… but who will rule this shared Zambian paradise?CountryfileOn the Sound of Mull, Hamza celebrates the success story of the white-tailed eagle54 minsThe KingHis Majesty King Charles III's message to the nation and Commonwealth10 minsInside the FactoryChocolate Seashells. How Belgian chocolate went from a festive treat to a global success59 minsMake It at MarketCan leatherworker Dani and calligraphy artist Masooma grow their creative businesses?29 minsReindeer Family and MeGordon Buchanan meets the Sami people and the animals they hold so close - reindeer.59 minsWinter's Weirdest EventsChris Packham embarks on a gripping journey to explain some of winter's weirdest events.29 minsPolicing ParadiseKeep palm and carry on with Bermuda's island-hopping, crime-stopping police forceLandwardBluetongue virus, midges and the spread. And roll over Beechgrove, beauty of no mow May28 minsPlanet Earth IIIBecome a voice for nature. Schoolkids from across the UK mark Earth Day58 minsHercules the Bear - A Love StoryGrizzly superstar and the Scottish couple who raised him, in never-seen-before home video58 minsHamza: Strictly Birds of PreyAn incredible journey from coast to city. Hamza searches for his favourite birds of prey57 mins",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wild London",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mnqm2q.jpg"
      ],
      "datePublished": "2026-01-01T06:00:00.000Z",
      "dateModified": "2026-01-01T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - How did a YouTuber stop federal funding to Minnesota? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mrt4yz?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-01-02T18:50:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·02 Jan 2026,·29 minsHow did a YouTuber stop federal funding to Minnesota?AmericastAvailable for over a yearThe Trump administration has frozen child care payments for the state of Minnesota after the conservative YouTuber, Nick Shirley, alleged that several centres run by Somali immigrants were taking public money without providing care. The video has received significant attention from figures like JD Vance and Elon Musk since being uploaded, prompting the Department of Health and Human Services (HHS) to declare the agency would target \"blatant fraud that seems to be rampant in Minnesota\".\nDespite the administration’s response to the story, some mainstream media outlets have not found evidence of fraud, while some conservatives feel the story has not had enough attention in the wider media. What’s the truth behind Nick Shirley’s claims and what does it mean for Minnesota and its Somali community?\nAnd, Zohran Mamdani has been sworn in as New York mayor. He delivered a speech outside City Hall promising to show the world that America’s political Left can govern. What are the obstacles he’ll face in that journey as mayor, and how much will it hinge upon his relationship with Donald Trump?\nHOSTS:\n• Justin Webb, Radio 4 presenter\n• Anthony Zurcher, North America Correspondent\nGET IN TOUCH:\n• Join our online community: https://discord.gg/qSrxqNcmRB\n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast\nThis episode was made by George Dabby with Grace Reeve. The technical producer was Michael Regaard. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app.\nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155\nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - How did a YouTuber stop federal funding to Minnesota? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-01-02T18:50:00.000Z",
      "dateModified": "2026-01-02T18:50:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Trump strikes Venezuela, captures the President, and says the US will take over - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mrykq0?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-03T20:53:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·03 Jan 2026,·32 minsTrump strikes Venezuela, captures the President, and says the US will take overNewscastAvailable for over a yearToday, the United States dropped bombs on Venezuela and captured its president, before Donald Trump announced that the US will “run” the country until “safe transition can take place”.\nHe also said US oil companies will fix Venezuela's \"broken infrastructure\" and \"start making money for the country\".\nChief international correspondent Lyse Doucet joins Laura and Paddy to talk through how and why Trump took the action. They also discuss what could happen next, and what it means for the rest of the world.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers.\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenters were Laura Kuenssberg and Paddy O’Connell. The weekend series producer is Chris Flynn. The social producer was Gabriel Purcell-Davis. The technical producer was Dafydd Evans. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Trump strikes Venezuela, captures the President, and says the US will take over - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-03T20:53:00.000Z",
      "dateModified": "2026-01-03T20:53:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Junk food advert ban set to come into force",
    "url": "https://www.bbc.com/news/articles/cq5y2vzlyldo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/86bc/live/98770590-e983-11f0-9d55-758d47cc7ae3.jpg",
    "tag": "Trending",
    "date": "2026-01-04T15:45:59.000Z",
    "description": "31 minutes agoArchie MitchellBusiness reporterPA MediaJunk food adverts will be banned on television and online from Monday as part of a drive to tack",
    "body": "31 minutes agoArchie MitchellBusiness reporterPA MediaJunk food adverts will be banned on television and online from Monday as part of a drive to tackle childhood obesity.  The UK-wide ban will stop food and drinks high in fat, salt and sugar (HFSS) being advertised on TV before 21:00 and at any time online.It applies to products considered to be the biggest drivers of childhood obesity, including soft drinks, chocolates and sweets, pizzas and ice creams.The Food and Drink Federation (FDF) said it is committed to helping people eat healthily and has been voluntarily abiding by the new restrictions since October.As well as more obviously unhealthy foods, the ban will also cover some breakfast cereals and porridges, sweetened bread products, and main meals and sandwiches.Decisions over which products fall under the ban will be based on a scoring tool, balancing their nutrient levels against whether they are high in saturated fat, salt, or sugar.Plain oats and most porridge, muesli and granola will not be banned under the crackdown, but some versions with added sugar, chocolate or syrup could be affected.Firms can still promote healthier versions of banned products, which the government hopes will lead to food makers developing healthier recipes.The ban only covers adverts in which unhealthy products can be seen by viewers, meaning fast-food firms will still be able to advertise using their brand name.Previously, HFSS food and drink adverts were banned on any platform where more than a quarter of the audience was under 16.Firms that do not comply with the new rules risk action by the Advertising Standards Authority (ASA).NHS data shows almost one in 10 (9.2%) reception-aged children are now living with obesity, while one in five children have tooth decay by the age of five.It is estimated obesity costs the NHS more than £11bn every year.Evidence shows children's exposure to ads for unhealthy food can influence what they eat from a young age, in turn putting them at greater risk of becoming overweight or obese.The government estimates the ad ban will prevent around 20,000 cases of childhood obesity.Katherine Brown, professor of behaviour change in health at the University of Hertfordshire, said the ban was \"long overdue and a move in the right direction\".She said: \"Children are highly susceptible to aggressive marketing of unhealthy foods and exposure to them puts them at greater risk of developing obesity and associated chronic diseases.\"Ms Brown called for the government to make nutritious options \"more affordable, accessible and appealing\".The FDF said manufacturers are \"committed to working in partnership with the government and others to help people make healthier choices\".It added: \"Investing in developing healthier products has been a key priority for food and drink manufacturers for many years and as a result, our members' products now have a third of the salt and sugar and a quarter of the calories than they did ten years ago.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Junk food advert ban set to come into force",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/86bc/live/98770590-e983-11f0-9d55-758d47cc7ae3.jpg"
      ],
      "datePublished": "2026-01-04T15:45:59.000Z",
      "dateModified": "2026-01-04T15:45:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Snow and ice warnings issued ahead of Monday return to work",
    "url": "https://www.bbc.com/weather/articles/c89qvjwdk7jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/a729/live/abb946a0-e95a-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2026-01-04T12:40:29.000Z",
    "description": "Image source, Getty ImagesImage caption, A lone walker trudges through the snow in this scene from NorthumberlandByMatt TaylorLead Weather PresenterTh",
    "body": "Image source, Getty ImagesImage caption, A lone walker trudges through the snow in this scene from NorthumberlandByMatt TaylorLead Weather PresenterThe Met Office is warning of disruption to travel on Monday morning as many people return to work and school following the Christmas break.Amber warnings for more snow have been issued in northern Scotland after several days of heavy snow.New snowfalls are also possible across England and Wales through the coming week, despite temperatures lifting a little.Later in the week strong winds and heavy rain could bring an additional hazard as a deep area of low pressure sweeps across the UK. Image source, BBC Weather Watchers/ chrisx30Image caption, Locals in Llanberis, Gwynedd, north west Wales, woke up to a deep covering of snow on SundayStrong winds causing driftingMet Office amber weather warnings have been issued for snow across Shetland, Orkney and parts of northern mainland Scotland from 1800 on Sunday until 1000 on Monday.Heavy snowfall over recent days has resulted in over 40cm reported in parts of Moray already. Strong winds have been causing drifting, with Network Rail Scotland reporting snow drifts up to 1.2m (4ft) on the line between Aberdeen and Dundee. As the snow showers become heavier and more frequent during Sunday night, the Met Office is warning for the potential of another 20 to 30cm of snow.Further road and rail closures are also possible and disruption to power is likely in some areas too.Image caption, Most areas of the UK are covered by Met Office snow and ice warnings on MondayNumerous yellow weather warnings for snow and ice have also been issued in each of the four nations, with the Met Office highlighting the risk of longer journey times by road and rail on Monday morning, as well as the potential for slips and falls on pavements and cycle routes.Most parts of the UK will be fairly sunny by day, but light snow flurries will affect the far north of Scotland, west Wales and some eastern counties of England.Image source, BBC Weather Watchers / frazmanscoopImage caption, There were no signs of drivers on this snow-covered country road in OrkneyHow long will cold weather last?Clear skies on Saturday night brought plunging temperatures as England and Wales registered their coldest night of winter so far.  The mercury dropped to minus 9.3C at Benson in Oxfordshire and minus 7.3C at Sennybridge in Powys.Sunday night into Monday morning could be even colder as temperatures are forecast to drop to minus 10 or minus 11C in some rural parts of Scotland and Wales.Although temperatures will slowly lift through the rest of this week, cold health alerts from the UK Health Security Agency remain in place across all of England until Friday. The HSA warns that the prolonged cold spell could lead a rise in deaths, particularly amongst the elderly or those with underlying health conditions.Image source, BBC Weather Watchers / silver surferImage caption, Houses in Whitby, North Yorkshire, provided a splash of colour amid the snowfallWill snow, sleet or rain fall?Atlantic weather fronts are likely to bring more snow through this week. The difficulty for forecasters will be pinpointing the fine temperature boundaries that dictate where snow, sleet or rain falls.The coldest air is likely to persist over the northern half of the UK and bands of snow of varying intensity could cause disruption.Image caption, The position of a low pressure system later this week will be key to where we will see snow, sleet or heavy rain Towards the end of the week, a greater temperature contrast is expected across the UK as a deep area of low pressure swings in, fired up by an active jet stream overhead.It is too early to say exactly when and where this area of low pressure will cross the UK, however. The track will be crucial as there is likely to be a spell of heavy snow on the northern edge of the low and heavy rain to the south. Strong winds may also bring some disruption too.Keep up to date with the latest BBC Weather forecasts on the app and online.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Snow and ice warnings issued ahead of Monday return to work",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/a729/live/abb946a0-e95a-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2026-01-04T12:40:29.000Z",
      "dateModified": "2026-01-04T12:40:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man who died after Withernsea sea rescue named",
    "url": "https://www.bbc.com/news/articles/cy05lkr9pzjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1e72/live/0cc93870-e973-11f0-8d69-9f0dae13c5ba.jpg",
    "tag": "Trending",
    "date": "2026-01-04T14:38:41.000Z",
    "description": "Man who died trying to save people from sea named2 hours agoEmma PetrieEast Yorkshire and LincolnshireFamily handoutMark Ratcliffe was pulled unconsci",
    "body": "Man who died trying to save people from sea named2 hours agoEmma PetrieEast Yorkshire and LincolnshireFamily handoutMark Ratcliffe was pulled unconscious from the sea on FridayA man who died trying to save two people from the sea in East Yorkshire has been named as Mark Ratcliffe.In a tribute, his family said the 67-year-old was \"a true selfless hero with a heart of gold, who was so cruelly taken trying to save others\".Mr Ratcliffe was pulled unconscious from the water and died at the scene at Withernsea on Friday, Humberside Police said.Police said another body recovered on Friday evening was that of a 45-year-old woman. Officers are continuing to search for one remaining missing person.BBC/Joe BiltonThe search for the third person still missing continued on SundayMr Ratcliffe's family said: \"So many lives are now shattered that you're gone. You were loved by so many people, and we will all miss you forever.\"A loving husband, father, son, brother and the best grandad anybody could ever wish for. Sleep tight, we love you, we miss you.\"Mr Ratcliffe's son, in a Facebook post, thanked the RNLI, HM coastguards and the emergency services who had done \"all they could\" and worked tirelessly and relentlessly in awful weather conditions.\"Bye Dad, I miss you and I will never forget the true hero and role model you were,\" he wrote.BBC/Becki BowdenFloral tributes have been placed close to the scene on the promenadeAt 15:10 GMT on Friday, the coastguard responded to reports of \"a number of people in difficulty\" in the water.Eyewitnesses said they had seen people rushing into the sea to rescue a young woman who had fallen in.What followed was a huge search and rescue operation involving about 100 emergency workers, a rescue helicopter, air ambulance and RNLI crews from Withernsea, Bridlington and Hornsea Inshore Rescue.The search was paused at about 00:30 on Saturday and resumed at first light but was stood down at 16:00.The RNLI thanked members of the public who they said had \"assisted and supported\" the emergency services.\"This is a very tragic incident and our thoughts are with the families, friends and all those impacted,\" they said in a statement on Sunday.Services took place at Withernsea Methodist Church earlier to allow people to reflect on what had happened and light candles for those who had died.People have also placed flowers on the promenade.  Janice Holgate, who travelled from Hull, said it had been \"absolutely devastating\" to hear what had happened.\"I had to pay my respects just to let the families know that people are thinking about them,\" she said.Download the BBC News app from the App Store for iPhone and iPad or Google Play for Android devicesMore on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man who died after Withernsea sea rescue named",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1e72/live/0cc93870-e973-11f0-8d69-9f0dae13c5ba.jpg"
      ],
      "datePublished": "2026-01-04T14:38:41.000Z",
      "dateModified": "2026-01-04T14:38:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Withernsea sea deaths leaves 'happy little town' reeling",
    "url": "https://www.bbc.com/news/articles/cx2g8x74vzyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4c7c/live/169c0190-e8db-11f0-9ca9-bb676ea60a08.jpg",
    "tag": "Trending",
    "date": "2026-01-04T13:45:02.000Z",
    "description": "The 'happy little town' left reeling from sea deaths3 hours agoKevin Shoesmithin WithernseaKevin Shoesmith/BBCThe Reverend Clive Hall says Withernsea ",
    "body": "The 'happy little town' left reeling from sea deaths3 hours agoKevin Shoesmithin WithernseaKevin Shoesmith/BBCThe Reverend Clive Hall says Withernsea is pulling together following Friday's sea tragedyAfter a sea tragedy which left two people dead, with a third still missing, the small East Yorkshire resort of Withernsea is a community in mourning. Residents speak of their pain but also of their resolve to support one another and the families affected.The contrast is as stark as the wind driving snow into the faces of rescuers - wrapped-up families carrying buckets and spades heading to the beach to build snowmen, as weary coastguard officials in blue overalls and hi-vis jackets search for a missing person.On Friday, two people died after being pulled from the water at Withernsea - a town with a population of just 6,500.The victims were 67-year-old Mark Ratcliffe, who died trying to save the others, and a 45-year-old woman.A third person remains missing, although HM Coastguard confirmed the huge search for them was called off at 16:00 GMT on Saturday.Kevin Shoesmith/BBCFamilies trudge through snow on Withernsea's promenade From our vantage point next to the castellated entrance to a former pier, which was  destroyed by storms and ship collisions in the late 19th Century, the Reverend Clive Hall, from the town's St Matthew's Church, also spots the families on the promenade. \"Withernsea is a fun place,\" he says.\"It's a place people come to enjoy themselves, even in winter. It's a lot smaller and quieter than Bridlington further up the coast.\"We are very close-knit here. But now we have tears and heartbreak. The mood is sombre.\"Kevin Shoesmith/BBCThe tragedy is said to have happened near to The Towers, a local landmark in WithernseaMr Hall tells me how the town's five churches have come together, with clergy converging on Withernsea Methodist Church, which has become the focus for prayers.On Sunday, services will reflect the town's loss.\"People are already talking about a special service. That will be something to consider at a later point,\" Mr Hall says.Angie Smith, 51, from Hull, is walking with her family. She too associates Withernsea with happy memories.\"It's always been a happy little seaside town,\" she says.\"What an awful start to the year this is.\"Like us, those people [those who died] will have gone to the seaside for a walk and then this happened.Kevin Shoesmith/BBCCoastguard officials search the beach in a snowstorm for the missing person Darrin Stevens' photographs showing the initial search and rescue efforts have been  widely published.Now, he stands - without a camera - on the promenade, reflecting on events, as a woman lays a bouquet of flowers. \"The balcony of my home overlooks the sea,\" he says, pointing to it.\"Within minutes, all I could see was a wall of flashing blue lights.\"Mr Stevens did not see anyone in the water, with the seawall saving him from witnessing the tragedy.Like Mr Hall, he describes a town that supports each other.\"So many people came down on to the promenade on Friday evening,\" he says.\"They weren't there taking pictures for social media; they were there to show support.\"My neighbours brought coffees and teas for the rescuers. People just wanted to help in any way they could. It was remarkable for all the wrong reasons.\"Kevin Shoesmith/BBCWithernsea-based photographer Darrin Stevens captured the initial emergency response to the tragedyJason Catlin, 45, who lives opposite the town's RNLI station, agrees with those sentiments.\"Even though something like this does not directly affect everyone, everyone feels it,\" he says.\"It feels really sombre.\"Kevin Shoesmith/BBCJason Catlin says the town \"feels sombre\"Friends David Lewis, 69, and Neil Finn, 63, know this stretch of coastline well, and they tell of the dangers.Gesturing to the road that runs parallel to the promenade, a good distance from the sea, Mr Lewis says: \"I used to be a road sweep for the council and I'd often find pebbles and wood, thrown up by the sea, scattered all along here after a storm.\" Mr Finn adds: \"I've seen the sea come up over the towers before.\"The sea can be very dangerous.\"Kevin Shoesmith/BBCNeil Finn and David Lewis say the sea can be perilous even to those walking on the promenadeDownload the BBC News app from the App Store for iPhone and iPad or Google Play for Android devicesMore on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Withernsea sea deaths leaves 'happy little town' reeling",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4c7c/live/169c0190-e8db-11f0-9ca9-bb676ea60a08.jpg"
      ],
      "datePublished": "2026-01-04T13:45:02.000Z",
      "dateModified": "2026-01-04T13:45:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Greece: Thousands stranded across Europe as air space disrupted",
    "url": "https://www.bbc.com/news/articles/cgezjlzwz1do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a327/live/d85d0ed0-e978-11f0-b67b-690eb873de1b.jpg",
    "tag": "Trending",
    "date": "2026-01-04T14:36:13.000Z",
    "description": "2 hours agoAleks PhillipsandNikos PapanikolaouGetty ImagesThessaloniki Airport closed entirely after air traffic communication was knock outThousands ",
    "body": "2 hours agoAleks PhillipsandNikos PapanikolaouGetty ImagesThessaloniki Airport closed entirely after air traffic communication was knock outThousands of passengers are stranded across Europe after a communications failure forced Greece to close its airspace, causing widespread cancellations and delays.Officials are working to understand why radio communications were disrupted on Sunday morning, prompting the temporary suspension of arrivals and departures.Some departures have since been allowed to resume - though inbound flights are still being told to divert or return to their point of origin. Athens' main airport is among the worst affected, while Thessaloniki airport has closed entirely.The timing of the disruption has raised fears that travellers will not be able to get home before the start of the working week.\"I was supposed to fly to London, via Stockholm, with SAS,\" one passenger at Athens International Airport told Greek broadcaster Mega TV. \"I'm working on Newport Hospital tomorrow morning. I'm not going to be there on time, I don't know what else to say. \"Who is going to pay for the additional cost this travel will cost me? We still don't know if and when we're going to leave, no one is telling us anything.\"More than 90 flights have been affected in and out of Athens airport alone - though some flights have since been able to resume.A member of staff in the airport told the BBC that 35 aircraft an hour were now being allowed to take off, but it was still unable to take inbound flights.Flights departing from Dublin, Barcelona and Paris were earlier ordered to return to their airports of origin, while services from Copenhagen and Malta were cancelled altogether. Other arrivals into Athens were placed on standby, while flights in and out of other Greek airports have also been affected. Three flights out of Heraklion airport on the island of Crete, including one to Munich, have been delayed, according to public broadcaster ERT.Most inbound flights are being diverted to Turkey if not cancelled outright, it reports.Reuters / Flightradar24Greek airspace was nearly empty earlier on Sunday due to the technical faultThe disruption comes at a busy time for air travel in and out of Athens, which typically sees more than 600 scheduled flights per day, as people return from winter holidays.In the chaos, some passengers have complained of a lack of information. One told news site Flash: \"We have no updates. They told us that we will be able to leave but I don't think this is true. On the departures board I can't see my flight, and I'm supposed to leave shortly.\"Another, who had been on a flight to Rhodes when it turned around and headed back to Athens, told news agency Reuters: \"From that moment until now we have no information whatsoever.\"Domestic travellers may have the option of getting home on Greece's rail network, but this would take significantly longer.The issue that caused the disruption is thought to concern the radio system used by air traffic controllers to communicate with planes in their airspace.Panagiotis Psarros, chair of the Association of Greek Air Traffic Controllers, told ERT that all frequencies were \"suddenly lost\", adding: \"We could not communicate with aircraft in the sky.\"The broadcaster later reported than an initial investigation by the Greek security services suggested the problem may be due to the failure of an antenna in the Gerania Mountains near Athens. Italy, Turkey and Cyprus are assisting Greece in managing the situation.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Greece: Thousands stranded across Europe as air space disrupted",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a327/live/d85d0ed0-e978-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2026-01-04T14:36:13.000Z",
      "dateModified": "2026-01-04T14:36:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jesy Nelson: Former Little Mix star told twin baby daughters may never walk",
    "url": "https://www.bbc.com/news/articles/cql4rwee5p3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f58b/live/ab2d60b0-e962-11f0-b67b-690eb873de1b.jpg",
    "tag": "Trending",
    "date": "2026-01-04T12:09:08.000Z",
    "description": "4 hours agoNoor NanjiCulture correspondentBBCFormer Little Mix star Jesy Nelson has revealed that her twin baby daughters have been diagnosed with a r",
    "body": "4 hours agoNoor NanjiCulture correspondentBBCFormer Little Mix star Jesy Nelson has revealed that her twin baby daughters have been diagnosed with a rare genetic condition which means they will \"probably never walk\".The singer gave birth to Ocean Jade and Story Monroe Nelson-Foster prematurely last May with musician Zion Foster.On Sunday, Nelson said in an Instagram video that the girls have Spinal Muscular Atrophy (SMA), which she described as the \"most severe muscular disease\".\"It does affect every muscle in the body, down to legs, arms, breathing, swallowing,\" she said.In the video, she explained that her daughters had not been showing as much movement in their legs as they should be, and were struggling to feed properly.\"After the most gruelling three, four months, and endless appointments, the girls have now been diagnosed with a severe muscular disease called SMA type 1,\" she said.\"Essentially, what it does is, over time, it kills the muscles to the body, and if it's not treated in time, your baby's life expectancy will not make it past the age of two.\"Nelson said that the girls were assessed at Great Ormond Street Hospital in London.There, she said, she was told that her daughters were \"probably never going to be able to walk. They probably will never regain their neck strength, so they will be disabled\".She added that they have since had treatment, which she was \"so grateful for\".\"Because if they don't have it, they will die.\"Nelson said she had to act as a nurse and put her daughter on \"breathing machines\" since the diagnosis.\"The reason I wanted to make this video was because the last three months have honestly been the most heartbreaking time of my life. I literally feel like my whole life has done a 360.\"But she said she believed her daughters would \"defy all the odds\" and that with the right help, \"they will fight this\".She added that she wanted to share the diagnosis to help other children to get diagnosed as fast as possible.After resharing Nelson's story, partner Foster posted a smiling image of the twins with the caption: \"Still smiling through all the challenges. Daddy loves you so much.\"Getty ImagesThe singer wants to help other children get a diagnosis as fast as possibleNelson, 34, gave birth to her twins prematurely at 31 weeks, having previously revealed she had experienced rare complications during the pregnancy.In an Instagram post in October, she said she had \"never felt prouder\" of her body following the birth of her girls, adding that becoming a mother made her \"realise how incredible my body actually is\".Nelson left Little Mix in December 2020, and has since released music as a solo artist, including the single, Boyz, featuring Nicki Minaj, in 2021.SMA is a progressive muscle-wasting disease that can cause death within two years if untreated.In 2021, a life-changing gene therapy drug called Zolgensma was approved by the NHS to treat babies with the disease.According to SMA UK, the drug delivers a healthy copy of the affected gene to the body, but timing is critical because irreversible damage may have already occurred in the nervous system.At present, screening for SMA is only carried out on those who have a sibling with the condition.SMA UK wants the disease to be added to a blood spot test that already checks newborn babies for 10 rare but serious conditions.According to the charity, an estimated 47 babies were born with the condition in the UK in 2024, although about one in 40 people carry the altered gene that can cause the disease.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jesy Nelson: Former Little Mix star told twin baby daughters may never walk",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f58b/live/ab2d60b0-e962-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2026-01-04T12:09:08.000Z",
      "dateModified": "2026-01-04T12:09:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hunt for two prisoners continues as a third escapee is charged",
    "url": "https://www.bbc.com/news/articles/ce8gy39rezzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f3d9/live/d11a9130-e8d6-11f0-b67b-690eb873de1b.png",
    "tag": "Trending",
    "date": "2026-01-04T13:57:22.000Z",
    "description": "2 hours agoLeigh BoobyerandJasmine Ketibuah-Foley,West of EnglandAvon and Somerset PoliceMatthew Armstrong (left) and Daniel Washbourne absconded from",
    "body": "2 hours agoLeigh BoobyerandJasmine Ketibuah-Foley,West of EnglandAvon and Somerset PoliceMatthew Armstrong (left) and Daniel Washbourne absconded from prison on ThursdayA man who absconded from a prison on New Year's Day with two other inmates has now been charged with escaping from lawful custody. Aaron Thomas, 39, had been arrested in Bristol on Saturday, after leaving HMP Leyhill in South Gloucestershire with convicted murderer Matthew Armstrong and Daniel Washbourne – who are still on the run. Thomas is due to appear at Bristol Magistrates' Court on Monday. Avon and Somerset Police said inquiries to locate the two missing men are ongoing. The force urged the public not to approach the men but to call 999 immediately if they are spotted.Police handoutArmstrong was last seen on New Year's Day wearing a burgundy or orange coatThe men left the open prison on 1 January between 17:00 and 20:00 GMT, police said.Armstrong was 18 when he was jailed for life in 2009 with a minimum term of 19 years for the murder of 54-year-old Paul Smith in Rugby town centre.Mr Smith, a grandfather, had been returning home from the pub when he was attacked by Armstrong and his 14-year-old accomplice, who beat him around the head with a brick.The pair then robbed him of his phone and wallet and left him on the pavement in a pool of blood.CCTV footageOpen prisons have \"minimal security and allow eligible prisoners to spend most of their day away from the prison on licence to carry out work, education or for other resettlement purposes\", according to the Ministry of Justice.HMP Leyhill has an operational capacity of about 825 inmates.Police have released CCTV footage showing what the men were wearing on New Year's Day.Armstrong, now 35, was last seen wearing a burgundy or orange coat, grey cap, grey tracksuit suit bottoms with blue on the side, and black boots.He is described as white, male, about 5ft 9ins, with ginger hair and scars on his forehead.Police said he has known links to Warwickshire.Police handoutWashbourne was last seen wearing a cream fleeceWashbourne, 40, is described as white, male, about 5ft 6ins, slim, with brown hair and clean shaven.He was last seen wearing a cream-coloured fleece, blue tracksuit bottoms, blue hat and black trainers. He has known links to Herefordshire.Police said officers understand he has previous convictions for violence against a person and false imprisonment.HMP Leyhill reported the absconders to the force on Thursday evening, and police attended the prison at about 21:45 GMT to start carrying out inquiries.\"Urgent actions\" have been completed, police said, \"including circulating the men as wanted via national police systems\". Intelligence work to trace the men's movements is ongoing and other police forces have checked linked addresses but not found them.A Prison Service spokesperson said: \"Absconding is a serious criminal offence, and any prisoner who commits this crime could face longer behind bars.\"The police are working urgently to recapture these individuals, and we urge anyone with information to go to the police.\"Related internet links ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hunt for two prisoners continues as a third escapee is charged",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f3d9/live/d11a9130-e8d6-11f0-b67b-690eb873de1b.png"
      ],
      "datePublished": "2026-01-04T13:57:22.000Z",
      "dateModified": "2026-01-04T13:57:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anthony Joshua posts update for first time since car crash",
    "url": "https://www.bbc.com/sport/boxing/articles/cx2klm8yzzjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d02f/live/3f2d5ae0-e95e-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2026-01-04T13:33:37.000Z",
    "description": "Anthony Joshua has posted on social media for the first time since he was injured in a car crash that killed two of his close friends in Nigeria.The B",
    "body": "Anthony Joshua has posted on social media for the first time since he was injured in a car crash that killed two of his close friends in Nigeria.The British boxer, 36, was a passenger in a Lexus SUV that collided with a stationary truck on a major expressway near Lagos.His close friends and team members Sina Ghami and Latif 'Latz' Ayodele died in the crash. Their funerals took place at a London mosque on Sunday.The former two-time heavyweight champion was taken to hospital and discharged on Wednesday before returning to the UK this weekend.On Sunday morning he posted two pictures on Instagram, one showing him sitting alongside his mother and family members of the victims including the mothers of Ghami and Ayodele, with one holding a photograph of Ghami.The post has the caption: \"My Brothers Keeper.\"Driver Adeniyi Mobolaji Kayode, 46, was charged at Sagamu Magistrates' Court on Friday. Police sources told the BBC the charges included causing death by dangerous driving.The defendant was granted bail of 5m naira (£2,578) and remanded pending his bail conditions being met. The case has been adjourned until 20 January.Joshua, who was born in Watford, has family roots in Sagamu - a town in Ogun state, near the crash site.The 2012 Olympic champion was on his way to visit relatives for new year celebrations in the town at the time of the collision, a family member told the BBC.The boxer had been spending time in Nigeria after his recent victory over American YouTuber-turned-boxer Jake Paul on 19 December.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anthony Joshua posts update for first time since car crash",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d02f/live/3f2d5ae0-e95e-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2026-01-04T13:33:37.000Z",
      "dateModified": "2026-01-04T13:33:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Starmer ready for closer alignment with the EU 'in the national interest'",
    "url": "https://www.bbc.com/news/articles/cn56wdlw094o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3116/live/06555300-e961-11f0-b870-5bc7219b84d6.png",
    "tag": "Trending",
    "date": "2026-01-04T15:46:00.000Z",
    "description": "29 minutes agoLaura Kuenssberg,Sunday with Laura KuenssbergandJennifer McKiernanJeff Overs/BBC/PA WireSir Keir Starmer has said the UK should move tow",
    "body": "29 minutes agoLaura Kuenssberg,Sunday with Laura KuenssbergandJennifer McKiernanJeff Overs/BBC/PA WireSir Keir Starmer has said the UK should move towards closer alignment with EU markets \"if it's in our national interest\".The prime minister told the BBC's Laura Kuenssberg it would be \"better looking to the single market rather than the customs union for our further alignment\", in order to protect trade deals with India and the US.But he ruled out revisiting manifesto promises not to rejoin the EU single market or customs union, or to end freedom of movement.The comments are the clearest indication yet that Sir Keir wants to pursue a closer relationship with Europe in a broader number of areas.The Conservatives said the PM was using Brexit as an excuse for the UK's economic struggles.The UK is already lining up with Brussels on some rules around food and agriculture to allow access to the economic European trading zone known as the single market.Sir Keir told Laura Kuenssberg: \"I think we should get closer, and if it's in our national interest to have even closer alignment with the single market, then we should consider that, we should go that far.\"I think it's in our national interest to go further.\"He added: \"I actually think that now we've done deals with the US, which are in our national interest, now we've done deals with India which are in our national interest, we are better looking to the single market rather than the customs union for our further alignment. And it wouldn't be in our interest now to give up.\"Stressing that building closer economic ties was a \"sovereign decision\", the prime minister said that doing so had led to the best relationship with the EU \"for 10 years\".  \"What I'm saying is, there are other areas where we should consider whether it's in our interest to do the same and align with the single market,\" he said.  \"Now, that needs to be considered on an issue-by-issue, sector-by-sector basis, but we've already done it with food and agriculture and that will be implemented this year.\"Sir Keir's comments follow pressure from within the Labour movement to go further on a customs union, with 13 backbenchers backing proposals that would pave the way for such an arrangement in a Commons vote in December.Reminded of his promise that \"Brexit is safe in my hands\", the prime minster insisted this was not an attempt to reverse it - because nobody wanted to be \"picking over the bones of Brexit\" but rather \"looking forward\" at what was in the national interest. Elsewhere, concerns have been raised that current negotiations around a youth mobility scheme for British and EU students could end up requiring the UK to sign up to the free movement of EU citizens.Sir Keir said: \"That is not the return to freedom of movement, we're not going back to freedom of movement.  \"But I personally think that young people having that opportunity is a very good thing. \"And when we announced just recently that we're going back to the Erasmus scheme so that young people can study, exchange, research can be done in a much better way than it is now - that was widely welcomed.\"Conservative shadow foreign secretary Priti Patel said Labour's \"Brexit betrayal\" was becoming clearer, and said Sir Keir would be \"surrendering our freedom to cut regulation and strike our own trade deals\" by pursuing closer alignment with the single market.Speaking to BBC News, she also said: \"He's unpicking and unravelling Brexit and this is another excuse for him, rather than fixing the fundamental problems that he has created and his government and his chancellor have created in the UK economy.\"Appearing on Sunday with Laura Kuenssberg, Liberal Democrat foreign affairs spokesperson Layla Moran welcomed Sir Keir's \"warm language\" on EU alignment, and said her party had \"long argued this is the direction we should be moving in\".She said the government needed to be \"shifting the big dials\" on the economy, but said the Lib Dems would prioritise the customs union over the single market, as they felt the UK could not re-enter the latter without allowing free movement.At the end of last year, the UK's most senior trade unionist, Paul Nowak, told the BBC \"the closest possible economic and political relationship with the European Union\" was \"essential\" to boost economic growth.Deputy prime minister David Lammy also told the News Agents podcast last month that rejoining the EU's customs union was \"not currently our policy\" - but highlighted that Turkey had seen growth as a result of its own cooperation with the bloc.Turkey's deal does not apply to agricultural goods or services but removes point of origin checks, which have proved troublesome for the post-Brexit UK, and has been suggested as an alternative for the UK.Sign up for our Politics Essential newsletter to read top political analysis, gain insight from across the UK and stay up to speed with the big moments. It'll be delivered straight to your inbox every weekday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Starmer ready for closer alignment with the EU 'in the national interest'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3116/live/06555300-e961-11f0-b870-5bc7219b84d6.png"
      ],
      "datePublished": "2026-01-04T15:46:00.000Z",
      "dateModified": "2026-01-04T15:46:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LNER worker sacked for serving binned sausage rolls to passengers",
    "url": "https://www.bbc.com/news/articles/ce8gyml5m3lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7026/live/996f9f90-e945-11f0-b67b-690eb873de1b.jpg",
    "tag": "Trending",
    "date": "2026-01-04T08:55:30.000Z",
    "description": "7 hours agoGetty ImagesThe passengers were served the food on an LNER train from YorkA train worker who was sacked after first class passengers were s",
    "body": "7 hours agoGetty ImagesThe passengers were served the food on an LNER train from YorkA train worker who was sacked after first class passengers were served sausage rolls from a bin has said he was going \"over and beyond for the customer\".Peter Duffy, who worked for London North Eastern Railway (LNER), was accused of preparing sausage rolls he had \"retrieved from a bin\", which were then served to passengers by a colleague.Another member of train crew reported hearing laughter from the kitchen before the food was served and made a complaint after noticing sausage rolls that were in the bin had disappeared.Mr Duffy was sacked by the rail firm, but later claimed unfair dismissal and discrimination. However, at a tribunal in Newcastle, a judge concluded LNER had acted reasonably.On 7 May 2023, Mr Duffy and a fellow train crew member were working on an LNER service departing York when two passengers in first class requested sausage rolls.Another member of staff who reported the incident said: \"Myself and a host from standard class had been in the kitchen to get ourselves food when the host who was cooking told us the sausage rolls had just gone in the bin.\"Later, the member of staff reported hearing \"lots of laughing\" from inside the kitchen where Mr Duffy and his colleague were based.Mr Duffy was told CCTV footage appeared to show him retrieving items of food from a bin.The footage suggested the food was plated and re-heated by Mr Duffy and served to customers by his colleague.Both were suspended pending an investigation into the alleged breach of food hygiene standards.'Gone too far'At an investigatory meeting on 17 May 2023, Mr Duffy said he was \"a person who goes over and beyond for the customer\".He said: \"I clearly took them out as there were none left for people in first class, but they were wrapped in foil.,\"We had totally run out. I have just gone too far for the customer in my mind.\"Mr Duffy was found to have committed gross misconduct and was dismissed in July 2023.He claimed at the tribunal in August that he had suffered from anxiety and depression, while a union representative said he \"had suffered from a recognised condition that day, known as transient global amnesia\".Transient global amnesia is a sudden, temporary interruption of short-term memory.In reasons published on Wednesday to support the tribunal's judgment, the judge said Mr Duffy's actions were not something that arose in consequence of his disability.Related stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LNER worker sacked for serving binned sausage rolls to passengers",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7026/live/996f9f90-e945-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2026-01-04T08:55:30.000Z",
      "dateModified": "2026-01-04T08:55:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Syria: UK and France airstrikes hit underground IS arms bunker near Palmyra",
    "url": "https://www.bbc.com/news/articles/c1m7l8keyexo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/54e0/live/33a60730-e936-11f0-acd8-8729a70af322.jpg",
    "tag": "Trending",
    "date": "2026-01-04T07:22:04.000Z",
    "description": "9 hours agoTom McArthurandLaurence PeterEPA/ShutterstockRoyal Air Force Typhoon jets have joined French aircraft in a joint strike on an underground a",
    "body": "9 hours agoTom McArthurandLaurence PeterEPA/ShutterstockRoyal Air Force Typhoon jets have joined French aircraft in a joint strike on an underground arms cache in Syria used by the Islamic State group (IS), the UK Ministry of Defence says.\"Careful\" intelligence analysis led officials to believe the facility was storing arms and explosives, the statement said, and was in mountains just north of Palmyra, an ancient site in central Syria.\"Our aircraft used Paveway IV guided bombs to target a number of access tunnels down to the facility... initial indications are that the target was engaged successfully,\" the MoD said.There was no sign of any harm to civilians in the strike late on Saturday and all the aircraft returned safely, the MoD added.Detailed assessment of the strikes is under way but officials believe \"the target was engaged successfully\".The Typhoon FGR4s were supported by a Voyager refuelling tanker.  IS imposed jihadist rule over parts of Syria and Iraq until 2019.\"This action shows our UK leadership, and determination to stand shoulder to shoulder with our allies, to stamp out any resurgence of Daesh and their dangerous and violent ideologies in the Middle East,\" UK Defence Secretary John Healey said.EPA/ShutterstockThe MoD said no civilians were harmed in the strikesRAF aircraft have carried out patrols over Syria to \"prevent any attempted resurgence\" of IS following its defeat at the battle of Baghuz in 2019, the ministry said.\"I want to thank all the members of our armed forces involved in this operation for their professionalism and their courage,\" Healey said.\"They were among thousands of British personnel deployed over Christmas and New Year. This operation, to eliminate dangerous terrorists who threaten our way of life, shows how our armed forces are ready to step up, all year round, keeping Britain secure at home and strong abroad.\" The RAF has been using aerial drones and manned aircraft to strike IS fighters and targets as part of the international coalition since 2014. The United Nations says IS still has between 5,000 and 7,000 fighters in Syria and Iraq.In November, Syria - under the leadership of new President Ahmed al-Sharaa - became the 90th country to join a US-led coalition to combat the group.The coalition, officials say, is aimed at eliminating remaining elements of the so-called Islamic State and stemming the flow of foreign militants to the Middle East.Last month, the US military carried out what it called a \"massive strike\" against IS targets in Syria, following an ambush that killed two American soldiers and a civilian interpreter in Palmyra.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Syria: UK and France airstrikes hit underground IS arms bunker near Palmyra",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/54e0/live/33a60730-e936-11f0-acd8-8729a70af322.jpg"
      ],
      "datePublished": "2026-01-04T07:22:04.000Z",
      "dateModified": "2026-01-04T07:22:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]