[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Budget: What To Watch Out For - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mjs5rr?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-11-25T19:33:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·25 Nov 2025,·33 minsThe Budget: What To Watch Out ForNewscastAvailable for over a yearToday,  with rumours circulating about the budget, what are the changes that could impact you?\nOn the eve of the budget it has confirmed that more drinks will be included in the so called “sugar tax” and there will be an increase in the minimum + living wage. But what other changes could happen? \nWill there be changes to the way you can save into an ISA? Could a “tourist tax” be introduced in some cities? And, will there be changes to council tax?\nAdam and Chris are joined by Claer Barrett, consumer editor at the FT.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Anna Harris and Shiler Mahmoudi. The social producer was Joe Wilkinson. The technical producer was Dafydd Evans. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Budget: What To Watch Out For - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-11-25T19:33:00.000Z",
      "dateModified": "2025-11-25T19:33:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Americanswers… on 5 Live! What’s really going on with Trump’s peace plan for Ukraine? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mjk24n?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-11-24T19:34:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·24 Nov 2025,·31 minsAmericanswers… on 5 Live! What’s really going on with Trump’s peace plan for Ukraine?AmericastAvailable for over a yearDonald Trump has posted on social media that ‘something good just may be happening’ when it comes to negotiating an end to the war in Ukraine, after overnight talks in Geneva.\nEuropean leaders criticised a 28-point US peace plan when it emerged last week, saying it was too favourable to Russia. A new plan has been promised, but President Zelensky has played down Trump’s hopes of progress.\nSarah, Anthony and Marianna join Matt Chorley on 5 Live to answer your questions. We look at who’s actually involved in putting the plan together? And what does Donald Trump stand to gain from the proposed deal?\nPlus, the MAGA icon and Republican Congresswoman Marjorie Taylor Greene says she will resign from Congress following her bitter feud with the president last week. Could we start to see power shifts within the MAGA movement following her departure? And why did Trump say the behaviour of some Democrats was “punishable by death”?\nPlus, what happened when the mayor-elect of New York City, Zohran Mamdani, met Donald Trump in the White House on Friday? Clips of the meeting quickly went viral, with users commenting on the warmth between the two leaders. Is this the start of a fruitful friendship between Trump and Mamdani - or is it all just for show?\nHOSTS:\n- Sarah Smith, North America Editor\n- Anthony Zurcher, North America correspondent\n- Marianna Spring, Social Media Investigations correspondent\nGET IN TOUCH:\n- Join our online community: https://discord.gg/qSrxqNcmRB\n- Send us a message or voice note via WhatsApp to +44 330 123 9480\n- Email Americast@bbc.co.uk\n- Or use #Americast\nThis episode was made by Rufus Gray with Grace Reeve. The technical producer was Dafydd Evans. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app.\nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155\nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Americanswers… on 5 Live! What’s really going on with Trump’s peace plan for Ukraine? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-11-24T19:34:00.000Z",
      "dateModified": "2025-11-24T19:34:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sir Richard Branson 'heartbroken' as wife Joan dies aged 80",
    "url": "https://www.bbc.com/news/articles/ce3z1gp2574o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/293f/live/e3dfcbd0-ca29-11f0-8509-37d18cd138a9.jpg",
    "tag": "Trending",
    "date": "2025-11-25T19:00:34.000Z",
    "description": "Sir Richard Branson has said he is \"heartbroken\" over the death of his wife Joan aged 80. The pair, who married in 1989, had three children and five g",
    "body": "Sir Richard Branson has said he is \"heartbroken\" over the death of his wife Joan aged 80. The pair, who married in 1989, had three children and five grandchildren.In a post on Instagram, the Virgin Group founder said his wife was his \"best friend\" and \"guiding light\". \"She was the most wonderful mum and grandmum our kids and grandkids could have ever wished for,\" the 75-year-old wrote. The entrepreneur did not say what caused her death. In his post, Sir Richard wrote: \"Heartbroken to share that Joan, my wife and partner for 50 years, has passed away.\"He added: \"She was my best friend, my rock, my guiding light, my world. Love you forever, Joan x.\"The couple married on Necker island, owned by Sir Richard, in the Caribbean and had three children, Holly, Sam, and Clare Sarah, who died after four days. In 2018, Holly wrote in a blog that her mother was raised in the centre of Glasgow and worked in a pawnbroker's shop, and, later, at a London bric-a-brac store in Portobello Road in west London. She said it was there that her father first fell in love with Lady Branson and \"turned up at the shop every day for months, buying stuff he didn't want or need.\"Holly described her mother as \"a stay-at-home mum who was (and still is) always there with a hug, inspiring words of wisdom, and a beautiful, welcoming smile.\"In a blog to celebrate their wedding anniversary five years ago, Sir Richard said he \"fell for Joan almost from the moment I saw her\".\"Joan has always been a steady source of wisdom and has played no small part in some of my better life decisions,\" he added. Sir Richard is one of the UK's most successful businessmen.He founded Virgin Records in the 1970s, before his group expanded into other industries including air travel, broadband and space tourism.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sir Richard Branson 'heartbroken' as wife Joan dies aged 80",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/293f/live/e3dfcbd0-ca29-11f0-8509-37d18cd138a9.jpg"
      ],
      "datePublished": "2025-11-25T19:00:34.000Z",
      "dateModified": "2025-11-25T19:00:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Starmer apologises for leading pupils in 6-7 dance",
    "url": "https://www.bbc.com/news/articles/cgexj5271l1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7cf2/live/f8277750-c9f2-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-11-25T12:04:31.000Z",
    "description": "8 hours agoRuth ComerfordWatch: Keir Starmer does '6-7' hands meme with Peterborough school childrenThe prime minister has said sorry to a headteacher",
    "body": "8 hours agoRuth ComerfordWatch: Keir Starmer does '6-7' hands meme with Peterborough school childrenThe prime minister has said sorry to a headteacher after leading primary school children in a version of the viral 6-7 dance meme.Sir Keir Starmer visited Welland Academy in Peterborough with Education Secretary Bridget Phillipson on Monday to promote the expansion of the free school meals programme.During the visit, Sir Keir was reading with pupils when one pointed out they were on page 6 and 7. The prime minister made the juggling hand gesture that accompanies the reference, prompting class-wide hilarity.\"You know children get into trouble for saying that in our school,\" a teacher told him afterwards.  \"We are not over that yet, the 6-7, it's still very much a thing.\"As he left the room, Sir Keir told headteacher Jo Anderson it had been a \"bit wild\" in the class, only to be told the dance was banned at the school.He then said sorry to the head, insisting: \"I didn't start it, Miss.\"The prime minister uploaded a video of his antics to Instagram, with the caption: \"I think I just got myself put in detention...\"ReutersThe phrase \"6-7\", which first gained popularity with Generation Alpha, has gone on to become a viral internet sensation and was even named Dictionary.com's Word of the Year for 2025. The catchy phrase and its accompanying dance has gripped classrooms across the UK, much to the bafflement and annoyance of some parents and teachers. According to Dictonary.com, the phrase is thought to have originated from a song called Doot Doot (67) by US rapper Skrilla.The song went viral on TikTok and on other social media videos to describe the height of basketball players.Earlier this year, teenager Maverick Trevillian became known as \"the 6-7 kid\" after a viral video showed him yelling the phrase at a basketball game while performing the accompanying hand gesture.The video on YouTube has been viewed more than 7.8 million times.Its actual meaning is unclear, though some say it means \"so-so\" or \"maybe this, maybe that\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Starmer apologises for leading pupils in 6-7 dance",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7cf2/live/f8277750-c9f2-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-25T12:04:31.000Z",
      "dateModified": "2025-11-25T12:04:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Will it be a white Christmas in the UK this year?",
    "url": "https://www.bbc.com/weather/articles/cly1ppd03rzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/7589/live/a9449180-be36-11f0-991b-61406f5bba70.jpg",
    "tag": "Trending",
    "date": "2025-11-25T01:35:09.000Z",
    "description": "Are we going to have a white Christmas this year?Image source, Getty ImagesBySarah Keith-LucasLead Weather Presenter As the nights draw in and festive",
    "body": "Are we going to have a white Christmas this year?Image source, Getty ImagesBySarah Keith-LucasLead Weather Presenter As the nights draw in and festive lights are getting strung up, some of us might start to hope - or dream - of seeing some Christmas snowfall.Christmas cards often depict scenes blanketed in snow. While this is a rare sight in much of the UK, a 'white Christmas' is more common than you might think.More than half of all Christmas Days in the UK have seen snow falling somewhere.So, although the odds are technically stacked in favour of a white Christmas, the detailed festive forecast for this year won't be confirmed for a while yet. At this early stage, what do we actually know about the chances of this Christmas being 'white'?What defines a 'white Christmas'?For a Christmas to be officially considered 'white', the snow doesn't need to be 'deep and crisp and even.'In fact, just a single snowflake has to be recorded falling at any point during the 24 hours of 25 December at any of the Met Office's network of around 300 observing stations.The definition has changed over the years and has been broadened to include data from automated weather-recording stations as well as manned or manual sites.Snow already lying on the ground on Christmas Day may make things look merry and bright, but it does not count under the official definition of a white Christmas.When will we know for sure that we'll have a white Christmas?Image caption, In December 2010, the UK experienced very low temperatures and significant snowfalls. Lying snow was reported in many places on Christmas Day It's still too early to know for sure. The festive forecast will become much clearer about five days before Christmas, so keep an eye on the BBC Weather app or website for the latest updates. You can also read our thoughts further ahead in our monthly outlook.Forecasting snow in the UK is notoriously difficult because, as an island nation, it is most frequently influenced by mild Atlantic weather patterns.However, longer-range weather forecasting models are beginning to show possible trends for the Christmas period, influenced by wider teleconnections - large-scale interactions in which weather patterns in distant regions create atmospheric waves and flows that affect conditions thousands of miles away.One such potential influence to our winter weather is a 'warm blob' in the Pacific Ocean which could favour higher pressure and colder conditions developing in Europe.Meteorologists are also keeping an eye on the development of a potential La Niña event over the coming months - the colder phase of the El Nino Southern Oscillation (ENSO) cycle. Whilst the link between La Niña and UK weather isn't clear cut, the Met Office suggests that historically it promotes high pressure to develop in the Atlantic in early winter.  This could mean a higher than average chance of colder weather to start December.Overall most computer models are hinting at a trend towards slightly calmer and colder conditions developing towards 25 December, so perhaps there's a chance of seeing something white on the big day! When was the last white Christmas in the UK?The last time the UK saw a widespread white Christmas was back in 2010, when snow fell at 19% of weather stations, and very unusually, 83% of stations reported snow lying on the ground.Since 2020, every year except 2024 has officially been a white Christmas. However, in each of these years, very few places reported any snow actually settling on the ground.What are the \"white Christmas\" odds?The chances of festive snowfall vary a lot in different locations, with much better odds the further north and the higher up you venture. The places most likely to get a white Christmas Day are northern and eastern Scotland, northern England, north Wales and the north-west Midlands.Image caption, Christmas Eve snow is now less likely in much of Europe, some parts of the UK have seen an upward trend in recent yearsAs our climate warms, winters in the UK are becoming milder and wetter. A rise in land and sea temperatures has generally reduced the chances of a white Christmas, especially when compared to the 18th and 19th centuries. Will it be a White Christmas?Join BBC Weather’s Carol Kirkwood, Matt Taylor and Barra Best, along with famous faces Jeremy Vine and Lucy Porter, to explore where our fascination with a white Christmas comes from.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Will it be a white Christmas in the UK this year?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/7589/live/a9449180-be36-11f0-991b-61406f5bba70.jpg"
      ],
      "datePublished": "2025-11-25T01:35:09.000Z",
      "dateModified": "2025-11-25T01:35:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israel receives coffin that Hamas says contains Gaza hostage's body",
    "url": "https://www.bbc.com/news/articles/c17x0xjqj21o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/230c/live/910d9160-ca08-11f0-88a5-11238e952b75.jpg",
    "tag": "Trending",
    "date": "2025-11-25T17:32:46.000Z",
    "description": "Israel has received, via the Red Cross, a coffin that Hamas and Palestinian Islamic Jihad (PIJ) say contains the body of one of the last three decease",
    "body": "Israel has received, via the Red Cross, a coffin that Hamas and Palestinian Islamic Jihad (PIJ) say contains the body of one of the last three deceased hostages still in Gaza, according to the Israeli prime minister's office.Israeli forces will now transfer the body to Israel's National Centre of Forensic Medicine in Tel Aviv for identification.Earlier, PIJ and Hamas announced that the body of an Israeli hostage had been found in central Gaza on Monday.Prime Minister Benjamin Netanyahu's office warned that it viewed \"with severity the delay in the immediate transfer\" of the body, saying it constituted a \"further violation\" of the six-week-old Gaza ceasefire agreement.Following the handover in central Gaza on Tuesday afternoon, the office announced that the families of the three dead hostages had been updated accordingly.\"Our hearts are with them in this difficult hour,\" it added. \"The effort to return our hostages is ongoing and will not cease until the last hostage is returned.\"Under the first phase of the US-brokered ceasefire deal, which took effect on 10 October, Hamas agreed to return the 20 living Israeli hostages and the bodies of the 28 dead Israeli and foreign hostages still in Gaza within 72 hours.All the living hostages were released on 13 October in exchange for 250 Palestinian prisoners and 1,718 detainees from Gaza.So far, the remains of 22 dead Israeli hostages have been handed over, along with those of three foreign hostages – one of them Thai, one Nepalese and one Tanzanian.In exchange, Israel has handed over the bodies of 330 Palestinians killed during the war.Two of the three remaining dead hostages are Israelis - Ran Gvili, 24, and Dror Or, 48 - and one is Thai - Suthisak Rintalak, 43.Israel has accused Hamas of deliberately delaying the recovery of the bodies, while Hamas has insisted it is struggling to find them under rubble.The slow progress has meant there has been no advance on the second phase of President Donald Trump's Gaza peace plan. This includes plans for the governance of Gaza, the withdrawal of Israeli troops, the disarmament of Hamas and reconstruction.The dead hostages still in Gaza were among the 251 people abducted during the Hamas-led attack on Israel on 7 October 2023, during which about 1,200 other people were killed.Israel responded by launching a military campaign in Gaza, during which more than 69,770 people have been killed, according to the territory's Hamas-run health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israel receives coffin that Hamas says contains Gaza hostage's body",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/230c/live/910d9160-ca08-11f0-88a5-11238e952b75.jpg"
      ],
      "datePublished": "2025-11-25T17:32:46.000Z",
      "dateModified": "2025-11-25T17:32:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rivals and Ludwig win International Emmys as UK triumphs in New York",
    "url": "https://www.bbc.com/news/articles/cn0kd91xdqyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1b40/live/22abf0e0-ca30-11f0-8509-37d18cd138a9.jpg",
    "tag": "Trending",
    "date": "2025-11-25T11:36:06.000Z",
    "description": "9 hours agoPete AllisonCulture reporterGetty ImagesAnna Maxwell-Martin was named best actress for her role in ITV series Until I Kill YouUK TV series ",
    "body": "9 hours agoPete AllisonCulture reporterGetty ImagesAnna Maxwell-Martin was named best actress for her role in ITV series Until I Kill YouUK TV series Rivals and Ludwig have scooped two of the top prizes at the International Emmy Awards.Rivals, adapted from Dame Jilly Cooper's 1988 novel, was named best drama at the ceremony in New York.Starring David Tennant, Danny Dyer and Emily Atack, the Disney+ story follows scandals among the rich and powerful in the fictional English county of Rutshire.Detective comedy-drama Ludwig, starring Anna Maxwell-Martin and David Mitchell, was named best comedy. It was a big night for Maxwell-Martin, also named best actress for her performance in ITV true crime series Until I Kill You.The awards recognise the best TV programmes produced and originally aired outside of the US.Oriol Pla picked up best actor for Spanish drama Yo, Adicto, a Disney+ series about a man seeking professional help with addiction issues.Rivals' worldwide success comes as it prepares for its second series, with Rupert Everett and Hayley Atwell joining the cast.Maxwell-Martin's win was for her performance in an adaptation of Delia Balmer's autobiography, about her relationship with a serial killer.BBC series Ludwig, which is also getting a follow-up, was a hit with viewers in late 2024.Disney+David Tennant plays Lord Tony Baddingham in Disney+'s Rivals, which is filming its second seriesIt tells the story of Mitchell's puzzle-writing misfit John Taylor, who agrees to impersonate his missing twin James in order to help his wife Lucy solve the mystery of his disappearance.Other UK-made productions to win awards include BBC Two's Hell Jumper, named best documentary for its first-person storytelling by a group of volunteers in Ukraine.Channel 4's Dispatches was honoured too, winning in the current affairs category for its Kill Zone: Inside Gaza episode, looking at Palestinian people impacted by Israeli military attacks.Lost Boys and Fairies, a BBC production telling the story of a gay couple going through the process of adopting, won the TV movie/mini series award.Completing a strong night for the UK was Apple TV's Fallen, which won in the children's live action category.It follows 17-year-old Lucinda Price as she adapts to life in a rehab facility alongside other young people.Elsewhere, Australian-made Bluey, which will be familiar to many parents around the world, won in the children's animation category.The award for non-scripted entertainment went to Danish reality TV series Shaolin Heroes, which follows contestants leaving their conventional lives behind to pursue martial arts.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rivals and Ludwig win International Emmys as UK triumphs in New York",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1b40/live/22abf0e0-ca30-11f0-8509-37d18cd138a9.jpg"
      ],
      "datePublished": "2025-11-25T11:36:06.000Z",
      "dateModified": "2025-11-25T11:36:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Four pivotal ages in your brain's development revealed in new scientific study",
    "url": "https://www.bbc.com/news/articles/cgl6klez226o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e13e/live/946c4170-c973-11f0-a3b5-9d87f9d0b765.jpg",
    "tag": "Trending",
    "date": "2025-11-25T10:11:12.000Z",
    "description": "Adolescence lasts into 30s - new study shows four pivotal ages for your brain10 hours agoJames GallagherHealth and science correspondentMonty Rakusen/",
    "body": "Adolescence lasts into 30s - new study shows four pivotal ages for your brain10 hours agoJames GallagherHealth and science correspondentMonty Rakusen/GettyThe brain goes through five distinct phases in life, with key turning points at ages nine, 32, 66 and 83, scientists have revealed.Around 4,000 people up to the age of 90 had scans to reveal the connections between their brain cells.Researchers at the University of Cambridge showed that the brain stays in the adolescent phase until our early thirties when we \"peak\".They say the results could help us understand why the risk of mental health disorders and dementia varies through life.The brain is constantly changing in response to new knowledge and experience – but the research shows this is not one smooth pattern from birth to death.Instead, these are the five brain phases:Childhood - from birth to age nineAdolescence - from nine to 32Adulthood - from 32 to 66Early ageing - from 66 to 83Late ageing - from 83 onwards\"The brain rewires across the lifespan. It's always strengthening and weakening connections and it's not one steady pattern - there are fluctuations and phases of brain rewiring,\" the lead author of the research, Dr Alexa Mousley, told the BBC.Some people will reach these landmarks earlier or later than others – but the researchers said it was striking how clearly these ages stood out in the data. These patterns have only now been revealed due to the quantity of brain scans available in the study, which was published in the journal Nature Communications.The five brain phasesChildhood - The first period is when the brain is rapidly increasing in size but also thinning out the overabundance of connections between brain cells, called synapses, created at the start of life.The brain gets less efficient during this stage. It works like a child meandering around a park, going wherever takes their fancy, rather than heading straight from A to B.Adolescence - That changes abruptly from the age of nine when the connections in the brain go through a period of ruthless efficiency. \"It's a huge shift,\" said Dr Mousley, describing the most profound change between brain phases.This is also the time when there is the greatest risk of mental health disorders beginning.Unsurprisingly adolescence starts around the onset of puberty, but this is the latest evidence suggesting it ends much later than we assumed. It was once thought to be confined to the teenage years, before neuroscience suggested it continued into your 20s and now early 30s.This phase is the brain's only period when its network of neurons gets more efficient. Dr Mousely said this backs up many measures of brain function suggesting it peaks in your early thirties, but added it was \"very interesting\" that the brain stays in the same phase between nine and 32.Adulthood - Next comes a period of stability for the brain as it enters its longest era, lasting three decades.Change is slower during this time compared with the fireworks before, but here we see the improvements in brain efficiency flip into reverse.Dr Mousely said this \"aligns with a plateau of intelligence and personality\" that many of us will have witnessed or experienced.Early ageing - This kicks in at 66, but it is not an abrupt and sudden decline. Instead there are shifts in the patterns of connections in the brain.Instead of coordinating as one whole brain, the organ becomes increasingly separated into regions that work tightly together - like band members starting their own solo projects.Although the study looked at healthy brains, this is also the age at which dementia and high blood pressure, which affects brain health, are starting to show.Late ageing - Then, at the age of 83, we enter the final stage. There is less data than for the other groups as finding healthy brains to scan was more challenging. The brain changes are similar to early ageing, but even more pronounced.Dr Mousely said what really surprised her was how well the different \"ages align with a lot of important milestones\" such as puberty, health concerns later in life and even the pretty big social shifts in your early 30s such as parenthood.'A very cool study'The study did not look at men and women separately, but there will be questions such as the impact of menopause.Duncan Astle, professor of neuroinformatics at the University of Cambridge and part of the team responsible for the research, said: \"Many neurodevelopmental, mental health and neurological conditions are linked to the way the brain is wired. Indeed, differences in brain wiring predict difficulties with attention, language, memory, and a whole host of different behaviours.\"The director of the centre for discovery brain sciences at the University of Edinburgh, Prof Tara Spires-Jones, who did not work on the research paper, said: \"This is a very cool study highlighting how much our brains change over our lifetimes.\"She said the results \"fit well\" with our understanding of brain ageing, but cautioned \"not everyone will experience these network changes at exactly the same ages\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Four pivotal ages in your brain's development revealed in new scientific study",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e13e/live/946c4170-c973-11f0-a3b5-9d87f9d0b765.jpg"
      ],
      "datePublished": "2025-11-25T10:11:12.000Z",
      "dateModified": "2025-11-25T10:11:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Historian Rutger Bregman criticises BBC for removing Donald Trump line from Radio 4's Reith Lecture",
    "url": "https://www.bbc.com/news/articles/cpvdzdnnp8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/df0c/live/b449b190-c9fe-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-11-25T18:40:33.000Z",
    "description": "2 hours agoLauren TurnerCulture reporterA historian and author says he is \"genuinely dismayed\" after a comment about Donald Trump was removed from a l",
    "body": "2 hours agoLauren TurnerCulture reporterA historian and author says he is \"genuinely dismayed\" after a comment about Donald Trump was removed from a lecture he delivered on BBC Radio 4.Rutger Bregman, who is presenting this year's Reith Lectures, said he included the line in a section discussing US politics, but that it was removed prior to its broadcast.The Dutch historian wrote on social media that the decision had come \"from the highest levels within the BBC\".A BBC spokesperson said the corporation had \"made the decision to remove one sentence from the lecture on legal advice\". BBC News is not repeating the line in question on the same legal advice.The US president recently threatened to sue the BBC for up to $5bn over the editing of an episode of Panorama.The BBC has apologised for the Panorama edit, acknowledging it gave \"the mistaken impression that President Trump made a direct call for violent action\" on 6 January 2021, the day of the riot at the US Capitol.BBC director general Tim Davie and CEO of BBC News Deborah Turness both resigned in the wake of the outcry over the edited programme.Bregman, who is known for books including Humankind and Utopia for Realists, posted after his first lecture was broadcast on Tuesday, saying the BBC had \"decided to censor\" it.\"This sentence was taken out of a lecture they commissioned, reviewed through the full editorial process, and recorded four weeks ago in front of 500 people in the BBC Radio Theatre,\" he wrote.\"I was told the decision came from the highest levels within the BBC. This has happened against my wishes, and I'm genuinely dismayed by it.\" He said this dismay was \"not because people can't disagree with my words, but because self-censorship driven by fear (Trump threatening to sue the BBC) should concern all of us\".Bregman added it was \"ironic\" that the line had been removed \"because the lecture is exactly about the 'paralysing cowardice' of today's elites\", saying he was sharing his experience in the hope \"that transparency helps strengthen, not weaken, our democratic culture\".Bregman also shared an excerpt of his speech online, in which he referred to Trump as a \"convicted reality star\" just before the short sentence that was edited out.He went on to describe Trump as a \"modern-day Caligula\", saying: \"He surrounds himself with loyalists, grifters and sycophants.\"A BBC spokesperson said: \"All of our programmes are required to comply with the BBC's editorial guidelines, and we made the decision to remove one sentence from the lecture on legal advice.\"When Bregman was announced as the 2025 Reith Lecturer, the BBC said his series, titled Moral Revolution, would \"delve into the current 'age of immorality', exploring a growing trend for unseriousness among elites\".His three further lectures will be released in coming weeks. They are broadcast on BBC Radio 4 in the UK and the BBC World Service internationally, and are also available on BBC Sounds.Previous Reith lecturers include Stephen Hawking, Hilary Mantel, Chimamanda Ngozi Adichie, Bertrand Russell and King Charles III, when he was Prince Charles.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Historian Rutger Bregman criticises BBC for removing Donald Trump line from Radio 4's Reith Lecture",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/df0c/live/b449b190-c9fe-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-25T18:40:33.000Z",
      "dateModified": "2025-11-25T18:40:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ex-wife of Dubai royal says she fears arrest as custody battle escalates",
    "url": "https://www.bbc.com/news/articles/cj01j710rmmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8004/live/74cbb160-c9e7-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-11-25T17:40:57.000Z",
    "description": "3 hours agoSebastian UsherGlobal affairs reporterBBCZeynab Javadli divorced Sheikh Saeed bin Maktoum bin Rashid Al Maktoum in 2019The former wife of a",
    "body": "3 hours agoSebastian UsherGlobal affairs reporterBBCZeynab Javadli divorced Sheikh Saeed bin Maktoum bin Rashid Al Maktoum in 2019The former wife of a member of Dubai's ruling family has expressed concern that she could be arrested as her ex-husband has lodged a criminal complaint with local police, accusing her of kidnapping their three young daughters.Since their divorce in 2019, Zeynab Javadli has been involved in a bitter custody battle with her ex-husband Sheikh Saeed bin Maktoum bin Rashid Al Maktoum, who is the nephew of the ruler of Dubai.It has come to a head in recent weeks as the children have changed hands between the parents several times, with each accusing the other of kidnapping them.Ms Javadli also potentially faces arrest for e-crimes - online offences - after she livestreamed the latest showdown.In going public, she says she realised that she was taking a big risk.\"I knew that it was the last chance to be with my children as they would never let me see them again.  I genuinely believed that it was my last chance, so I just opened a livestream and called for help,\" she said in a video message to her British lawyer, David Haigh.Ms Javadli was speaking from her house in Dubai, where she claims that she and her three daughters have essentially once again been isolated since she took them back with her after they'd been with their father for several weeks. Up until then, Ms Javadli had had effective custody of the children under a deal she says was agreed with the ruler of Dubai, Sheikh Mohammed bin Rashid Al Maktoum, in 2022. That agreement, she says, guaranteed her custody of the children until they were 18 years old, as well as a house and other assistance. Their schooling has been paid for by their father.In return, David Haigh says she had to sign papers saying that she would - among other things - not speak to the media again about her situation, nor would she do any more livestreaming.A subsequent court ruling granted custody to Sheikh Saeed, but Ms Javadli says she received assurances from those involved in her case that the deal with Dubai's ruler would not be affected.That remained the situation until two months ago.That was when - during one of the regular visitations of the children with Sheikh Saeed - that Ms Javadli says she received a message from him through Dubai police telling her there was no need to wait as they would not be returned to her that day.She heard nothing from them for several weeks. She was finally granted a visitation for three hours at a child protection centre and headed there with her driver on 8 November. She says that when she entered the centre, her children were not there. As she was coming out of the building, she saw them. She says they rushed towards her.She says they were shouting \"Mama, take us from here!\" She told her driver to lock the doors and drive them home.But she claims their way was blocked by cars belonging to people working for her ex-husband. That was when she decided to open a livestream and plead for help. In doing so, she knew that she risked breaking the deal she had signed with the authorities in the UAE and that she could face arrest for doing so, but she insists that it was her only recourse.She has been at home with her children since then and says she does not dare to go out for fear of arrest. The three girls - aged nine, seven and six - have not been going to school.The BBC has contacted a number of officials in the UAE, who are involved in the case, for comment, but has received no reply so far. However, the perspective of Sheikh Saeed is clear from court depositions.The most recent gives a very different version of what happened on 8 November, accusing Ms Javadli of forcibly placing the children into her car with the help of her driver and then kidnapping them. It also accuses Ms Javadli of posting videos on social media in which \"she insulted and slandered\" her former husband as well as defaming the state and violating state laws.Previously, lawyers acting for Sheikh Saeed had claimed in court that Ms Javadli was an unfit mother, who had failed to send her daughters to school, was living in a place unsuitable for the children when she was in a hotel, and that she had put the health of the youngest girl at risk.Ms Javadli rejected the accusations and her Emirati legal team submitted evidence to the contrary in court.David Haigh says that there've been other similar cases involving former wives of members of Dubai's royal family or other female members of the family. He himself has been involved in campaigning for several of the women. None of these cases involve Sheikh Saaed.Princess Haya - the ex-wife of Sheikh Mohammed bin Rashid Al Maktoum - fled the UAE in 2019, saying that she feared for her life. Three years later, the princess won a custody battle that played out in the highest court in the UK, which gave her sole custody of their two children.The most sensational saga was that of one of the daughters of Dubai's ruler, Princess Latifa, who mounted a bid for freedom in 2018 from what at the time she claimed was her family's coercive control.The boat on which she was making her escape was intercepted in the Indian Ocean and she was forcibly returned to Dubai. She then claimed that she was being held captive in secret videos. She has since re-emerged to a limited extent in public, saying she that she was well and living as she wished.Ms Javadli and David Haigh say that Dubai portrays itself as promoting women's rights and encouraging women - whether from the UAE or from outside - to lead fulfilling lives, both professionally and personally. For many, this is no doubt the case.But they claim that Ms Javadli's case shows that beneath the glittering surface of Dubai, for some women the situation can be more complicated and more uncomfortable.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ex-wife of Dubai royal says she fears arrest as custody battle escalates",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8004/live/74cbb160-c9e7-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-25T17:40:57.000Z",
      "dateModified": "2025-11-25T17:40:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "English mayors will get new powers to  levy tourist taxes ",
    "url": "https://www.bbc.com/news/articles/c62d9nv1pp4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6d34/live/9ef43c60-ca31-11f0-8509-37d18cd138a9.jpg",
    "tag": "Trending",
    "date": "2025-11-25T19:07:53.000Z",
    "description": "1 hour agoJennifer McKiernanPolitical reporterEnglish regional mayors will be given the power to charge tourists a tax for staying overnight in their ",
    "body": "1 hour agoJennifer McKiernanPolitical reporterEnglish regional mayors will be given the power to charge tourists a tax for staying overnight in their towns and cities, Local Government Secretary Steve Reed has said. Speaking ahead of Wednesday's Budget, Reed said the levy aims to empower locally-elected mayors to \"unlock growth through investment\", such as putting on events or improving public transport systems.London's Labour Mayor Sir Sadiq Khan and Greater Manchester's Andy Burnham said the new powers were good news for their cities.But Tees Valley's Conservative mayor Lord Houchen said he would not be introducing the new levy - and the trade body for the hospitality industry warned the cost would be passed on to consumers.The move would bring England into line with Scotland and Wales, which will both bring in a tourist tax next year, of £1.30 per night for Wales and 5% for Scotland.New York, Paris and Milan are among those that already charge a tourist tax, with research showing that reasonable fees have minimal impact on visitor numbers.Reed said: \"Mayors and other local leaders know their local history, local culture and the unique attributes of their places that draw visitors in. \"But they need powers and funding to enable them to harness England's potential and unlock growth through investment.\"Research suggests a levy of £1 per day in London could raise £91m a year for the capital.The money raised could fund investments such as revamping Oxford Street in London or funding late night buses and trams in Manchester, the government says.Sir Sadiq said the levy would be \"great news for London,\" with the extra funding helping to \"cement our reputation as a global tourism and business destination\".Burnham said nearly two million people visited Greater Manchester each year, contributing about £9bn to the local economy.He said: \"The levy will allow us to invest in the infrastructure these visitors need, like keeping our streets clean and enhancing our public transport system through later running buses and trams, making sure every experience is a positive and memorable one.\"However, Lord Houchen dismissed the levy on principle, saying: \"I won't be using this power.\"There will be no tourist tax in Teesside, Darlington and Hartlepool for as long as I'm mayor. Thanks, but no thanks.\"Kate Nicholls, chairwoman of industry body UKHospitality, warned the \"damaging holiday tax\" could cost the public up to £518m.She said: \"Make no mistake – this cost will be passed directly on to consumers, drive inflation and undermine the government's aim to reduce the cost of living.\"There were also signs of potential tension between council leaders and mayors, with Westminster City Council leader Adam Hug, Labour, calling for revenues from the tax to be shared with councils rather than kept by mayors.Cllr Hug, whose council includes some of central London's major attractions, said: \"While this scheme as drafted will allow mayoral combined authorities to charge and collect the overnight levy, it is essential the government ensures mayors split the revenue with the local councils in their area to support these services, without which economic growth will suffer.\"The plans will be subject to a consultation running until February 18, which will consider issues including whether there should be a cap on the size of the levy.Sign up for our Politics Essential newsletter to read top political analysis, gain insight from across the UK and stay up to speed with the big moments. It'll be delivered straight to your inbox every weekday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "English mayors will get new powers to  levy tourist taxes ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6d34/live/9ef43c60-ca31-11f0-8509-37d18cd138a9.jpg"
      ],
      "datePublished": "2025-11-25T19:07:53.000Z",
      "dateModified": "2025-11-25T19:07:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sheffield shooting: Boy, 15, arrested as teen critical in hospital",
    "url": "https://www.bbc.com/news/articles/c0kd8edxyvlo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/08e8/live/154d7290-ca10-11f0-b881-37f4ac070994.jpg",
    "tag": "Trending",
    "date": "2025-11-25T17:13:35.000Z",
    "description": "3 hours agoOliver WrightYorkshireBBC/Tom IngallPolice have been carrying out investigations at the scene of Monday's shootingA 15-year-old boy has bee",
    "body": "3 hours agoOliver WrightYorkshireBBC/Tom IngallPolice have been carrying out investigations at the scene of Monday's shootingA 15-year-old boy has been arrested on suspicion of conspiracy to commit murder after a 16-year-old boy was left \"fighting for his life\" following a shooting in Sheffield.South Yorkshire Police said the 16-year-old had been found injured in London Road at about 17:15 GMT on Monday and taken to hospital where he remains in a critical condition.In a statement, the force said the 15-year old was being held in police custody.Supt Martin Simcock said: \"Gun crime, and violent crime has no place in South Yorkshire, and the fact that a young boy is fighting for his life is appalling and will not be tolerated.\"He added: \"Detectives, officers and forensics have been in the area today to secure evidence, but we need your help.\"I urge you to get in touch, no matter how small you believe your information to be, it could be the missing piece that we need.\"This boy and his family deserve answers, and we are committed to getting them.\"Watch: South Yorkshire Police issue update after Sheffield shootingLondon Road was closed between the junction of Sitwell Place and the Crowther Place turn-off but reopened on Tuesday afternoon.Earlier, officers were seen carrying out searches of the area, with a large police cordon in place.The force has said extra patrols will be in place in the area over the coming days.Police have appealed for information about Monday's shooting Speaking to the BBC, one restaurant owner described his shock, with a number of premises forced to close while forensic investigations continue.Dari Saleh, who owns Marmaris Turkish restaurant, said: \"We work here all day and evening and then something like this happens, we're scared, our customers, our business, you don't feel safe.\"Meanwhile, Abtisam Mohamed, Labour MP for Sheffield Central, said she was \"deeply shocked and saddened\".\"My thoughts are with him, his family and all those affected as they face what must be an unimaginably difficult time,\" she said.\"I urge anyone with information to contact South Yorkshire Police and help bring clarity to this incident.\"More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sheffield shooting: Boy, 15, arrested as teen critical in hospital",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/08e8/live/154d7290-ca10-11f0-b881-37f4ac070994.jpg"
      ],
      "datePublished": "2025-11-25T17:13:35.000Z",
      "dateModified": "2025-11-25T17:13:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Help to Save scheme to be offered to more people",
    "url": "https://www.bbc.com/news/articles/cwyv9g27myxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7a89/live/a13a4250-ca11-11f0-b881-37f4ac070994.jpg",
    "tag": "Trending",
    "date": "2025-11-25T16:00:14.000Z",
    "description": "4 hours agoKevin PeacheyCost of living correspondentGetty ImagesMore people on low incomes will be encouraged to save through a scheme that offers a l",
    "body": "4 hours agoKevin PeacheyCost of living correspondentGetty ImagesMore people on low incomes will be encouraged to save through a scheme that offers a large government bonus, the Treasury has announced.About three million people on universal credit are currently eligible for the scheme, which sees the government add 50p for every pound saved after two and four years.An extra 1.5 million parents and carers will become eligible from 2028 and the scheme, which was due to end in 2027, will be made permanent.The change, to be formally announced in the Budget, comes as Chancellor Rachel Reeves is expected to reduce the amount people can save in cash Isas (Individual Savings Accounts). Reports also suggest the chancellor will not cut VAT on energy bills, which had been the source of much speculation.How the scheme worksHelp to Save is widely regarded as a key incentive for people on low incomes to set money aside for emergencies and to develop a savings habit.To be eligible to open an account, savers need to be on universal credit and have take-home pay of £1 or more in the last monthly assessment period.Up to £50 a month can be saved, which is £2,400 over four years. Bonuses are paid after two and four years, straight into the saver's bank account. So the maximum bonus after four years would be £1,200. The account closes after four years and no more can be opened.The bonus relates to 50% of the highest amount saved over the first two years, then the second two years. That is designed to prevent people keeping money in the account when it would be better used making a emergency, or debt, payment.The scheme will be expanded to an extra 1.5 million savers in 2028 to include universal credit claimants that have children in education or carers that provide 35 hours of care to someone with a disability.Isa changes expectedSeparately, the amount of money that can be saved tax-free each year in a cash Isa  is likely to be cut in the Budget.The annual allowance is expected to be reduced from £20,000 to £12,000, as the Treasury wants to encourage people to invest instead.That could help boost growth, a key objective for the government. But there are questions over whether people would naturally put their money into stocks and shares Isas as a result of the less generous tax break on cash Isas.About a quarter of those who save money into a cash Isa currently save more than £12,000 a year.Robin Fieth, chief executive of the Building Societies Association, which has campaigned against a cut, said: \"A cut to £12,000 will not encourage more people to invest but will add unnecessary complexity, particularly around Isa transfers, and risks damaging the overall Isa brand. \"This may also deter people from saving and investing. The best way to build a culture of investing is on a strong culture of savings.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Help to Save scheme to be offered to more people",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7a89/live/a13a4250-ca11-11f0-b881-37f4ac070994.jpg"
      ],
      "datePublished": "2025-11-25T16:00:14.000Z",
      "dateModified": "2025-11-25T16:00:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man arrested over Oxfordshire waste mountain",
    "url": "https://www.bbc.com/news/articles/cvg1k15xwl0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0256/live/e8b4c060-ca11-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-11-25T14:01:08.000Z",
    "description": "Man arrested over fly-tipped mountain of waste6 hours agoDan KerinsSouth of EnglandDrone video captured the scale of the wasteA man has been arrested ",
    "body": "Man arrested over fly-tipped mountain of waste6 hours agoDan KerinsSouth of EnglandDrone video captured the scale of the wasteA man has been arrested over the huge pile of fly-tipped waste dumped in a field in Oxfordshire.The Environment Agency (EA) said a 39-year-old man from the Guildford area had been held in connection with the pile of rubbish in a field near Kidlington.The EA previously declared a critical incident over the situation. Prime Minister Sir Keir Starmer said during Prime Minister's Questions that \"all available powers\" would be used to make those responsible pay for the clean-up.The heap, which is up to 150m (490ft) long and 6m (20ft) high, appeared on a field between the River Cherwell and the A34.Billy BurnellThe site has been called an \"environmental catastrophe\".BBC reporter Jamie Morris visited the scene and said the mound appeared to be \"20ft high at least\".Anna Burns, the Environment Agency's area director for The Thames, said: \"The appalling illegal waste dump in Kidlington has rightly provoked outrage over the potential consequences for the community and environment.\"We have been working round the clock with the South East Regional Organised Crime Unit to bring the perpetrators to justice and make them pay for this offence. \"Our investigative efforts have secured an arrest today, which will be the first step in delivering justice for residents and punishing those responsible.\"The agency has said it is conducting a major investigation and coordinating with Oxfordshire County Council, Thames Valley Police, and National Highways.In a statement, the Environment Agency said: \"After officers became aware of continued criminal activity on site in October, a court order was sought and granted to close the site. \"Since this was granted on 23 October, no further tipping has taken place. \"For both safety reasons and because the site is now a live crime scene, members of the public should avoid entering the site.\"The Environment Agency said it had specialist teams at the siteFly-tippers are thought to have started building up the mound of waste in the summer. The Environment Agency said it became aware of it in July.The landowner of the neighbouring site said he saw truckloads of rubbish dumped there every night for months.The rubbish itself is made up of what appears to be processed domestic waste, shredded plastics, polystyrene, tyres, and other household items.Phil Davies, head of the Joint Unit for Waste Crime, said: \"We would ask that the public and media do not speculate about the identity of any other individuals who may be connected with the offending at this location, or interfere with the waste on site as we continue to treat it as an active crime scene.\"The Environment Agency is continuing its work to protect the community and environment from the impacts of this crime, conducting rigorous assessments of risks to the River Cherwell and monitoring any impacts on the ground.\"Getty ImagesThe heap of waste was described as \"appalling\" by the Prime Minister The Environment Agency says water quality testing has been taking place in the area and there has been no evidence of waste breakdown.The site remains closed to the public and media to protect the investigation and prevent environmental risks.A recent House of Lords report found efforts to tackle serious waste crime have been \"critically under-prioritised\" despite the problem becoming bigger and more sophisticated.The Environment and Climate Change Committee recommended an independent \"root and branch\" inquiry into how \"endemic\" waste crime is tackled.Local Lib Dem MP Calum Miller has called for the government to issue a directive similar to the one used for the huge amount of waste illegally dumped at Hoads Wood near Ashford, Kent, which told the EA to clear up the site.It was estimated that the heap of waste in Kent could take up to a year to remove.More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man arrested over Oxfordshire waste mountain",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0256/live/e8b4c060-ca11-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-25T14:01:08.000Z",
      "dateModified": "2025-11-25T14:01:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]