[
  {
    "title": "Saltburn",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002f1vy?at_mid=5dhF4rgAGg&at_campaign=Saltburn&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002f1vy&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Saltburn&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0lkj2gp.jpg",
    "tag": "Trending",
    "date": "2026-02-02T00:03:27.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeSaltburnSaltburnContains very strong language, explicit sexual content and some upsetting scenes.Deals with suicideBlack comedy thriller. A student at University finds himself drawn into the world of a charming, aristocratic classmate. Duration2h 2mFirst shown2023Available for 10 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesThe Souvenir Part IIHonor Swinton Byrne stars in a film about life and the return of old friends and lovers1h 40mThe Night ManagerStylish. Devilish. Deadly. John le Carré's twisted spy thriller with Tom HiddlestonThe NotebookYou never forget first love. A sweeping love story with Ryan Gosling and Rachel McAdams1h 55mLord of the FliesWhen the rules vanish, the beast within awakens. A bold retelling of a dystopian classicBirdBarry Keoghan stars in Andrea Arnold's empathetic tale of life on the fringes of society1h 54mAfireSelf-centred Leon is driven to distraction by some unwelcome housemates on holiday1h 37mIndustryProve your worth. Colleagues, turned lovers, turned enemies...CrossingIs Lia on the path to inner peace? A tender tale of a connection that transcends borders1h 38mRetreatNo neighbours. No help. No escape. Tense thriller with Cillian Murphy and Thandie Newton1h 25mSilent WitnessThe forensics team who will stop at nothing to get answers for the deadThe Last Letter from Your LoverFelicity Jones stars in a romance for the ages. Some love stories deserve a second chance1h 41mWould I Lie to You?Tall tales, faithless fibs with Kate Garraway, Jonathan Ross, JB Gill and Michelle Wolf29 mins",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Saltburn",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0lkj2gp.jpg"
      ],
      "datePublished": "2026-02-02T00:03:27.000Z",
      "dateModified": "2026-02-02T00:03:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Week: Andrew Arrested, New Cabinet Secretary & Jenrick Economics - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n27ny4?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-02-20T09:51:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·20 Feb 2026,·40 minsThe Week: Andrew Arrested, New Cabinet Secretary & Jenrick EconomicsNewscastAvailable for over a yearToday Adam, Alex Forsyth, Joe Pike and pollster Luke Tryl look back at the week in Westminster; starting with Thursday morning's news that the King’s brother, Andrew Mountbatten-Windsor, had been arrested on suspicion of misconduct in a public office.\nPlus, they discuss the appointment of Antonia Romeo to the role of cabinet secretary and our first look at Reform UK’s new economic policy.  \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Joe Wilkinson. The social producer was Beth Pritchard. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Week: Andrew Arrested, New Cabinet Secretary & Jenrick Economics - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-02-20T09:51:00.000Z",
      "dateModified": "2026-02-20T09:51:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential ch",
    "body": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Trump's Tariffs... Trump attacks the Supreme Court over tariff ban - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n2d11v?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-02-20T20:08:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·20 Feb 2026,·21 minsTrump's Tariffs... Trump attacks the Supreme Court over tariff banAmericastAvailable for over a yearDonald Trump has called the Supreme Court’s ruling blocking many of his sweeping tariffs ‘deeply disappointing’ and has announced a new 10 per cent tariff on global imports.\nJustin, Sarah and Anthony jumped into action following the President’s press conference to unpack the day’s drama: starting with the US Supreme Court decision to block global tariffs and ending with the President’s withering attack on some of the justices for their decision. \nThe president spoke a few hours after the US Supreme court struck down the legal justification for a large portion of Trump's sweeping global tariffs in a major blow to the president's economic agenda.\nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Anthony Zurcher, North America Correspondent\nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray, Miranda Slade, Grace Reeve and Kris Jalowiecki. The technical producer was Mike Regaard. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Trump's Tariffs... Trump attacks the Supreme Court over tariff ban - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-02-20T20:08:00.000Z",
      "dateModified": "2026-02-20T20:08:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Winter Olympics 2026: Four men, one aim - to end 102-year wait for curling gold",
    "url": "https://www.bbc.com/sport/articles/ce3gqz1yyyyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b251/live/a9c57ac0-0e9a-11f1-801d-ed3cff6bf876.jpg",
    "tag": "Trending",
    "date": "2026-02-20T17:30:20.000Z",
    "description": "Image source, Andy HoneByRichard WintonBBC Sport in CortinaIt's a Thursday night in November. A pub in Glasgow's Merchant City. Four men, all about th",
    "body": "Image source, Andy HoneByRichard WintonBBC Sport in CortinaIt's a Thursday night in November. A pub in Glasgow's Merchant City. Four men, all about the age of 30, are squeezed around a small table, eating and talking about what the next few months might bring. Nobody recognises them.That same pub three months later. Screens showing a Celtic game are changed so the patrons can watch the curling. Almost everyone is anxiously staring at the TVs, willing those same four men to reach a Winter Olympic final.Chances are they will be doing the same on Saturday (18:05 GMT), when Team GB's Bruce Mouat, Grant Hardie, Hammy McMillan and Bobby Lammie take on Canada with a gold medal at stake.\"Our gold medal,\" as Mouat referred to it after the epic semi-final win over Switzerland in northern Italy on Thursday - a contest which drew 3.4million viewers to the BBC at its peak.And fulfilling what they believe to be their destiny - by upgrading their silver medal from Beijing four years ago - is what these four Scots have travelled to Cortina to do.Since that 2022 near miss, Team Mouat have come to dominate men's curling, winning two World Championships and adding another couple of European crowns, as well as a record 12 Grand Slam titles. At times, they have been unbeatable.That cloak of invincibility slipped during the round-robin stages here - leaving qualification out of their hands - but that fright has now been forgotten, replaced with the return of a clear-eyed focus on the task in hand.But who are these four young men who have now caught the country's attention? And what makes them more than the sum of their parts?Nine years that changed face of curlingTo understand the dynamic between the quartet, you have to go back almost nine years to when they first came together as a team.With the world of curling being as small as it is, they weren't strangers to each other. Hardie and McMillan are 33-year-old cousins from south-west Scotland. Lammie, 29,  hails from there, too, and played in a rink previously with 31-year-old Mouat, who knew the others from their shared school days in Edinburgh.Approaches were made, conversations had, culminating in a meeting. \"That first time we met, the thing we wrote at the top of our list of goals was to win Olympic gold,\" Mouat told BBC Sport.After that, the die was cast. The boys told British Curling they were only willing to join the elite programme as a unit and not individually. Their ultimatum was accepted, success has followed, and now they are considered the best in the world.Mouat is thought to be among the greatest skips to have played the game. Hardie has a reputation as a high-grade tactician and shot maker, while McMillan and Lammie are credited with reinventing the role of a sweeper.Once just 'the lads with the brushes', their physicality has evolved the position to the extent that the curling cognoscenti consider it to now be \"a sweeping game\" rather than a throwing one.Media caption, Semi-final victory 'hardest fought win we've ever had' - GB men's curling teamWill GB quartet make history?But it is the coalescence of their personalities that amplifies all that sporting talent. And underpinning the team are two key things - total honesty and trust.As McMillan puts it \"if one of us is in the wrong, the rest can say so\", while the more-measured Mouat describes it as \"knowing the different things to say to get the best out of each other\".Individually, they are all very different. McMillan is lively enough for all four of them; Hardie is the logic guy, an engineer by trade; Mouat is thoughtful, reflective and calm; and Lammie is the quiet, reliable presence in the background.It might be labelled as 'Team Mouat' - as per the convention of naming a rink after the skip - but this is very much a collective. In fact, Mouat is keen to share the spotlight.\"Bruce is so compassionate and calm and he's very different from a lot of skips,\" explains BBC Sport pundit and 2022 gold medallist Vicky Wright. \"A lot of them are clearly the leader but the GB team operates so well because they function on a level playing field.\"The dynamic they've got works so well because they all bring a different aspect to the table and they all respect that. That's a massive part of why they're so successful.\"Media caption, GB will go for gold after beating Swiss to reach men's curling finalIt's instructive to see how comfortable the four of them are in each other's company and with the position they find themselves in.All four - and alternate Kyle Waddell - have been right in among it in Cortina this week, be it stopping for a chat in the street or in restaurants, meeting friends and relatives, watching other British athletes compete. Or - in Mouat's case - going pillowcase shopping and \"spending far too much money\" on the morning of the semi-final.Even in the moments before that crucial match, there was a relaxed focus about them. McMillan and Hardie were sharing a laugh, Mouat picking out familiar faces in the crowd for a smile and a wave, and Lammie was casually studying the Swiss warming up.All of that will culminate on Saturday night in the quirky Cortina Curling Stadium, first built as an open-air venue to host the 1956 Games.In a place where history looks down from the wooden bleachers, these four will attempt to make their own by becoming the first GB men's rink in 102 years to win Olympic gold.Achieve that, and maybe the next time they go into that Glasgow pub they might just draw a few glances of recognition.Winter Olympics 20266-22 FebruaryMilan-CortinaWatch two live streams and highlights on BBC iPlayer (UK only), updates on BBC Radio 5 Live and live text commentary and video highlights on the BBC Sport website and app. CurlingWinter SportsWinter Olympics",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winter Olympics 2026: Four men, one aim - to end 102-year wait for curling gold",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b251/live/a9c57ac0-0e9a-11f1-801d-ed3cff6bf876.jpg"
      ],
      "datePublished": "2026-02-20T17:30:20.000Z",
      "dateModified": "2026-02-20T17:30:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Penguins delight residents in Nottinghamshire care home visit",
    "url": "https://www.bbc.com/news/articles/cvg31kv2435o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e9fb/live/27d6dfc0-0c26-11f1-b639-2bb91f8e49a9.jpg",
    "tag": "Trending",
    "date": "2026-02-18T06:08:50.000Z",
    "description": "3 days agoAsh GeaneyNottinghamBBCResident Les Clarkstone, 89, holding a penguin for the first time in his life A pair of penguins waddled into a care ",
    "body": "3 days agoAsh GeaneyNottinghamBBCResident Les Clarkstone, 89, holding a penguin for the first time in his life A pair of penguins waddled into a care home in Nottinghamshire to spread some cheer to residents.Pringle and Widget were the stars as they made their appearance at The Grand Care Home in West Bridgford.Residents were able to stroke and hold the Humboldt penguins as part of an animal-assisted therapy exercise.Les Clarkstone, 89, said: \"It was very comfortable and never murmured, so it was quite nice. I enjoyed it.\"Residents were able to stroke and hold Pringle and WidgetThe medium-sized birds are based at Heythrop Zoological Gardens in Oxfordshire, a privately-owned zoo, which aims to educate on animal welfare. They visit care homes and hospices across the country.Luke Fillary, head bird keeper, was on hand at the home to provide instructions on how to interact with the birds to keep them and the residents safe.The 21-year-old handler said Pringle and Widget had been trained their entire lives to become therapy penguins.\"They both have been born at our zoo, so they have been in training their whole life,\" he said.\"Officially, they have been doing it for the past six years. Both are very well behaved.\"Jackie Kirkham visited her 91-year-old dad Derek when the penguins arrivedResidents of the care home also had the opportunity to invite their families along to meet the penguins.Jackie Kirkham, from Clifton in Nottingham, came to visit her 91-year-old dad Derek.She said: \"It's just something new for them, something that they probably won't be doing. He enjoys it and we do - it's comforting.\"The care home invites other therapy animals for residents to encounter.Bridget Peck, wellbeing coordinator at the home, said she had seen the benefit in bringing animals to the residents.\"I think animals play an important role for everybody's wellbeing,\" she said.\"Not just dogs - we have donkeys, ponies, every Easter we have the ducks and chickens come in. So penguins, why not? It was great.\"Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Penguins delight residents in Nottinghamshire care home visit",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e9fb/live/27d6dfc0-0c26-11f1-b639-2bb91f8e49a9.jpg"
      ],
      "datePublished": "2026-02-18T06:08:50.000Z",
      "dateModified": "2026-02-18T06:08:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Two found dead on Yr Wyddfa in search for missing men",
    "url": "https://www.bbc.com/news/articles/c5y6k450247o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/18a6/live/23b075e0-0f0b-11f1-b048-c9424b2cf5fd.png",
    "tag": "Trending",
    "date": "2026-02-21T10:22:13.000Z",
    "description": "Two men aged 19 and 20 die after going missing on Yr Wyddfa2 hours agoNicholas BourneBBC WalesGetty ImagesLibrary photo: Rescuers described conditions",
    "body": "Two men aged 19 and 20 die after going missing on Yr Wyddfa2 hours agoNicholas BourneBBC WalesGetty ImagesLibrary photo: Rescuers described conditions as \"challenging\" due to snow and iceThe bodies of two men, aged 19 and 20, have been recovered on Yr Wyddfa, also known as Snowdon, after they were reported missing.Mountain rescuers and HM Coastguard crews were called in to help in the search after concerns were raised about the welfare of the pair on Wednesday.North Wales Police said the two bodies were discovered on Thursday. They have both been formally identified, and their families have been informed. The coroner has been notified.The force asked that the privacy of both families is respected at this difficult time.Jurgen Dissmann, chairman of Llanberis Mountain Rescue Team, said: \"I would like to extend our most heartfelt condolences to the families and loved ones of the two men who have tragically lost their lives.\"The team were tasked by North Wales Police and launched an extensive multi-agency operation in full winter conditions.\"Dissmann said volunteers searched across challenging mountain terrain in snow and ice, working long hours through the night in difficult weather to try and find the pair. \"Despite the determined and sustained commitment of everyone involved, we are deeply saddened that, despite all efforts, the outcome was not what we had hoped for.\"Aberglaslyn Mountain Rescue Team also took part in the search, along with RAF Mountain Rescue Team among others.More top stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two found dead on Yr Wyddfa in search for missing men",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/18a6/live/23b075e0-0f0b-11f1-b048-c9424b2cf5fd.png"
      ],
      "datePublished": "2026-02-21T10:22:13.000Z",
      "dateModified": "2026-02-21T10:22:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Avalanches kill five in Austrian Alps, officials say",
    "url": "https://www.bbc.com/news/articles/c5yqgz2q58lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d5ff/live/6ae4c100-0efc-11f1-b564-8f2b66f9878a.jpg",
    "tag": "Trending",
    "date": "2026-02-21T08:46:40.000Z",
    "description": "4 hours agoReutersA major rescue operation was launched at St Anton after five skiers were caught in an avalanche some 450m wideFive people were kille",
    "body": "4 hours agoReutersA major rescue operation was launched at St Anton after five skiers were caught in an avalanche some 450m wideFive people were killed in a series of avalanches in the Austrian Alps as heavy snowfall hit the region on Friday.A 42-year-old German man, caught in an avalanche with his 16-year-old son, was among the victims, police said. The teenager was airlifted to hospital from the slope in Nauders near the Swiss-Italian border.Three other skiers were killed in an avalanche near the popular St Anton resort, while a snowboarder died after being buried in the neighbouring Vorarlberg region.Austria has now seen at least 21 avalanche-related deaths this winter, while dozens of fatalities have been recorded across the Alps.The avalanche risk remains high in parts of Tyrol - meaning avalanches can be expected - where two fatal avalanches occurred on Friday in off-piste areas.Police told Austrian media the avalanche near St Anton am Arlberg, which killed three men, appeared to have been triggered by the skiers themselves.Two were American and Polish nationals, public broadcaster ORF reported, while the third was a 21-year-old Austrian who died in hospital.Two other men were recovered from the scene with injuries after a major operation involving four mountain rescue teams, three helicopters, as well as emergency services.Elsewhere, a 53-year-old man died after being crushed by a snow plough in the northern city of Linz.The vehicle slid down a set of stairs where the man had been clearing snow, ORF reported. He died at the scene.The significant snowfall in the region also caused power outages and transport chaos on Friday, particularly in the south-east.The Red Cross was deployed to help those stuck in traffic jams in the state of Styria, where a motoring organisation described the roads as \"virtually inaccessible to private vehicles\".Vienna International Airport temporarily closed in the morning, and afternoon services were \"disrupted\".The avalanche death toll in the Alps has been higher than usual this year, and includes three Britons killed in France's La Grave earlier this month.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Avalanches kill five in Austrian Alps, officials say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d5ff/live/6ae4c100-0efc-11f1-b564-8f2b66f9878a.jpg"
      ],
      "datePublished": "2026-02-21T08:46:40.000Z",
      "dateModified": "2026-02-21T08:46:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tumbler Ridge suspect's ChatGPT account banned before shooting",
    "url": "https://www.bbc.com/news/articles/cn4gq352w89o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a351/live/7d4bfed0-0ee8-11f1-8f36-05719114a367.jpg",
    "tag": "Trending",
    "date": "2026-02-21T07:30:32.000Z",
    "description": "5 hours agoOttilie MitchellReutersEight people were killed in a mass shooting in Tumbler Ridge, British Columbia earlier in FebruaryOpenAI banned a Ch",
    "body": "5 hours agoOttilie MitchellReutersEight people were killed in a mass shooting in Tumbler Ridge, British Columbia earlier in FebruaryOpenAI banned a ChatGPT account owned by the suspect of a mass shooting in British Columbia more than half a year before the attack took place.The AI company said they had identified an account owned by Jesse Van Rootselaar in June 2025 under abuse and enforcement detection, which includes identifying accounts being used to further violence.OpenAI said it did not alert authorities to the account because its usage did not meet its threshold of a credible or imminent plan for serious physical harm to others.It said its thoughts were with everyone affected by the tragedy and that following the attack it had \"proactively\" contacted Canadian police with information on the suspect.Van Rootselaar is suspected of having shot and killed eight people in rural Tumbler Ridge on 12 February in one of the deadliest attacks in Canada's history. According to the Wall Street Journal, which first reported the story, \"about a dozen staffers debated whether to take action on Van Rootselaar's posts.\"Some had identified the suspect's usage of the AI tool as an indication of real world violence and encouraged leaders to alert authorities, the US outlet reported. But, it said, leaders of the company decided not to do so.In a statement, a spokesperson for OpenAI said: \"In June 2025, we proactively identified an account associated with this individual [Jesse Van Rootselaar] via our abuse detection and enforcement efforts, which include automated tools and human investigations to identify misuses of our models in furtherance of violent activities.\"They said the company would continue to support the police's investigation.The BBC has contacted the Royal Canadian Mounted Police for comment.OpenAI has said it will uphold its policy of alerting authorities only in cases of imminent risk because alerting them too broadly could cause unintended harm. It has also said that it trains ChatGPT to discourage imminent real-world harm when it identifies a dangerous situation and to refuse to help people that are attempting to use the service for illegal activities.The company added that it is constantly reviewing its referral criteria with experts and that it is reviewing the case for improvements. The deadly attack on Tumbler Ridge Secondary School saw a further 27 people injured.Van Rootselaar was found dead from a self-inflicted gunshot wound at the school. Police said the suspect was born a biological male but identified as a woman.Van Rootselaars's mother and step-brother were among the victims of the shooting. Both were found dead at a local residence, police said.The motive for the attack is not yet known.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tumbler Ridge suspect's ChatGPT account banned before shooting",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a351/live/7d4bfed0-0ee8-11f1-8f36-05719114a367.jpg"
      ],
      "datePublished": "2026-02-21T07:30:32.000Z",
      "dateModified": "2026-02-21T07:30:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Blood test for 50 cancers fails key goal in NHS trial",
    "url": "https://www.bbc.com/news/articles/cwyx7580xvyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e2f4/live/21ab3a00-0e9d-11f1-b716-3303ea8d981c.jpg",
    "tag": "Trending",
    "date": "2026-02-21T04:23:11.000Z",
    "description": "Multi-cancer blood test missed key goal in NHS trial8 hours agoJames GallagherHealth and science correspondentGetty ImagesA blood test which looks for",
    "body": "Multi-cancer blood test missed key goal in NHS trial8 hours agoJames GallagherHealth and science correspondentGetty ImagesA blood test which looks for multiple types of cancer has failed to achieve its key objective in a major NHS trial, the company has announced.The Galleri blood test is being trialled on 142,000 NHS patients with the goal of finding cancers early and saving lives.However, the company behind the test, Grail, said there were still positive signs in the data that some of the most aggressive cancers could be prevented.But researchers said any benefits of the test \"remain speculative\" until it was proven to save lives and the NHS said it was looking at the results \"carefully\".The blood test searches for fragments of DNA – or genetic code – that have escaped from tumours and entered the bloodstream.The vision is to detect up to 50 types of cancer before the person has any symptoms.At the start of the clinical trial, NHS England described the test as \"the beginning of a revolution\".The trial was designed to see if screening people's blood would reduce the number of cancers being diagnosed at later stages when they may be harder to treat.Stage three cancers are when a tumour has started to spread locally, stage four is when they have spread to distant organs in the body too.The full data from the three-year NHS trial has not been published, but Grail has issued an update to investors.It said: \"While there was a trend towards reduction in combined stage three and four [cancers], the trial did not meet the primary endpoint.\"Grail, a US pharmaceutical company, halved in value after the announcement taking its share price back to levels seen at the end of the summer.However, a further analysis looking at stage four cancers alone showed they fell by around a fifth in the study, suggesting the most deadly cancers were being detected at an earlier stage.How much attention should be paid to this result, when it was not the main focus of the trial, has become a major debating point.Prof Charles Swanton, who is running the trials within the NHS, told the BBC he was \"genuinely very excited\" about the reduction in stage four cancers.\"I've been working in oncology for 20 years and the key, in my mind, is to reduce stage four because these are the cancers we cannot cure,\" he said.However, other experts say the focus has to be on the primary endpoint as that is what the trial was designed to test.Prof Richard Houlston, from the Institute of Cancer Research, said: \"Without mortality data and a transparent account of harms, including false positives, unnecessary procedures, and opportunity cost, claims of population benefit from multi-cancer early detection remain speculative,\" he said.The full data is due to be presented at a meeting of the American Society of Clinical Oncology later this year.An NHS spokesperson said: \"This evidence is an important step and the NHS will carefully study the full results from this major trial in the coming months to help determine how blood tests like this could be used in the future.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Blood test for 50 cancers fails key goal in NHS trial",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e2f4/live/21ab3a00-0e9d-11f1-b716-3303ea8d981c.jpg"
      ],
      "datePublished": "2026-02-21T04:23:11.000Z",
      "dateModified": "2026-02-21T04:23:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Devon sculptor comes second in Italian snow carving competition",
    "url": "https://www.bbc.com/news/articles/c204gpj7222o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2868/live/8bdd5860-0a95-11f1-bcc6-0d256631bfbc.jpg",
    "tag": "Trending",
    "date": "2026-02-16T11:31:31.000Z",
    "description": "Devon snow carver comes second in Italian contest5 days agoEmma Ruminski,South West arts reporterandJake Wallace,DevonPippa Unwin and GB Snow Sculptin",
    "body": "Devon snow carver comes second in Italian contest5 days agoEmma Ruminski,South West arts reporterandJake Wallace,DevonPippa Unwin and GB Snow Sculpting teamPippa Unwin and her snow carving team mates Patrick and Dave came second in the competitionA Devon sculptor competing for the GB Snow Carving Team helped the squad finish second in an Italian competition.The event formed part of the 2026 Winter Olympics cultural programme, with teams tasked with carving Olympic Fair Play-themed sculptures from snow.Unwin said she was \"delighted\" to come second place with her team's depiction of five athletes bursting through the Olympic Rings.Pippa Unwin and GB Snow Sculpting teamThe team's design includes a skater, snowboarder, skier, slider and curlerThe carvers were given three days to sculpt a 3m-cubed (106ft-cubed) block of snow using only tools, more snow and water. Teams were tasked with illustrating the theme of fair play and Unwin said the sculpture she designed was \"ridiculously complicated\".She said: \"It was so difficult to work it out but we did actually do it.\"At about four o'clock on the last day, I was sort of thinking: 'I don't know if it's going to work,' but it did. \"It was a bit rough around the edges, but it was snowing quite a bit, so it covered up the mistakes.\"She added: \"We came second which is just very exciting because there were some really good ones.\"Living in Devon she is unable to practice with snow but, as a stone sculptor by trade, she said carving both was a similar practice. \"Stone is obviously harder and, generally, I'm working much smaller, but it's taking stuff off to create the sculpture, so it's very much the same technique.\"More on this storyRelated internet links ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Devon sculptor comes second in Italian snow carving competition",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2868/live/8bdd5860-0a95-11f1-bcc6-0d256631bfbc.jpg"
      ],
      "datePublished": "2026-02-16T11:31:31.000Z",
      "dateModified": "2026-02-16T11:31:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Team GB face uphill task for Olympic medal in four-man bobsleigh",
    "url": "https://www.bbc.com/sport/articles/c4g265jn0w7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d189/live/5338b070-0f15-11f1-a977-6da7ae3308ca.jpg",
    "tag": "Trending",
    "date": "2026-02-21T12:23:38.000Z",
    "description": "Team GB face an uphill task to win an Olympic medal in the four-man bobsleigh as they sit seventh at the halfway point.Pilot Brad Hall had showcased w",
    "body": "Team GB face an uphill task to win an Olympic medal in the four-man bobsleigh as they sit seventh at the halfway point.Pilot Brad Hall had showcased why the British team are medal contenders in Cortina with a brilliant first run of 54.39 seconds, which left them in third place.But they dropped off the pace in the second, clocking 55.04secs - the 12th-quickest time in heat two - to lose four places in the standings before Sunday's medal-deciding heats.The three German teams remain the ones to beat and they occupy the top three spots with Johannes Lochner, who won two-man gold earlier this week, leading the charge with an overall time of 1:48:61. There was a long delay to competition at the Cortina sliding track after Austria suffered a crash during heat two, with one of the athletes treated for a lengthy period on the ice before being stretchered off.Action resumed after about a 20-minute delay but, with the track now slower because of the rising temperature, the British team were unable to find the speed of their first run and currently sit on 1:49:43.More to follow.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Team GB face uphill task for Olympic medal in four-man bobsleigh",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d189/live/5338b070-0f15-11f1-a977-6da7ae3308ca.jpg"
      ],
      "datePublished": "2026-02-21T12:23:38.000Z",
      "dateModified": "2026-02-21T12:23:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Winter Olympics 2026: Six skaters crash in speed skating semi-final",
    "url": "https://www.bbc.com/sport/videos/cq574067y5do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/405c/live/26be66b0-0e9e-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-20T21:14:25.000Z",
    "description": "An \"extraordinary\" women's 1500m speed skating semi-final at the 2026 Winter Olympics sees six of the seven skaters crash, with China's Yang Jingru - ",
    "body": "An \"extraordinary\" women's 1500m speed skating semi-final at the 2026 Winter Olympics sees six of the seven skaters crash, with China's Yang Jingru - the only athlete not to fall - finishing first.WATCH MORE: Winter Olympics VideoAvailable to UK users only.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winter Olympics 2026: Six skaters crash in speed skating semi-final",
      "image": [
        "https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/405c/live/26be66b0-0e9e-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-20T21:14:25.000Z",
      "dateModified": "2026-02-20T21:14:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump 'considering' limited military strike on Iran",
    "url": "https://www.bbc.com/news/articles/cdxzk4gvzp0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1a63/live/ac7525e0-0ea4-11f1-8fa9-a78fde43271a.jpg",
    "tag": "Trending",
    "date": "2026-02-20T22:38:45.000Z",
    "description": "14 hours agoBernd Debusmann Jr,White House reporterandCachella SmithGetty ImagesIran's Foreign Minister Abbas Araghchi has said a proposal for an agre",
    "body": "14 hours agoBernd Debusmann Jr,White House reporterandCachella SmithGetty ImagesIran's Foreign Minister Abbas Araghchi has said a proposal for an agreement with the US will be ready in daysUS President Donald Trump has said he is considering a limited military strike on Iran in order to pressure its leaders to agree a deal to curb the nuclear programme.The president made the remark in response to a question from a journalist hours after officials had suggested the possibility of a strike.On Thursday, Trump said the world would find out \"over the next, probably, 10 days\" whether a deal would be reached or the US would take military action. The US has been increasing its military presence in the region in recent weeks.The US and its European allies suspect that Iran is moving towards the development of a nuclear weapon, something Iran has always denied.  US and Iranian officials have met over the issue in Switzerland and said progress has been made in the talks.Speaking on Friday, Iran's Foreign Minister Abbas Araghchi said Iran was preparing \"a draft of a possible agreement\" and would hand it over to US Special Envoy Steve Witkoff in the next few days.The talks in Geneva were held as American forces continued ramping up their presence in the vicinity of Iran.The deployment includes the world's largest warship, USS Gerald R Ford, appearing to be heading towards the region.USS Abraham Lincoln aircraft carrier is also being deployed, joining an increase of destroyers, combat ships and fighter jets.Satellite images have also shown that Iran has reinforced military facilities, and the country's Supreme Leader, Ayatollah Ali Khamanei, has posted messages to social media threatening US forces.\"The US President constantly says that the US has sent a warship toward Iran. Of course, a warship is a dangerous piece of military hardware,\" one of Khamenei's posts read.Trump takes questions from journalists several times a week - often in lengthy sessions in the Oval Office or on Air Force One - but his comments do not necessarily always translate into concrete actions, and often contradict each other.He is fond of reminding reporters that he prefers to keep his intentions to himself and a small circle of insiders to avoid potential adversaries knowing his next moves.\"I'm not going to talk to you about that,\" he snapped at a reporter on Thursday when asked about potential military action. \"We're going to make a deal or get a deal one way or the other.\"Even if an operation is carried out, Trump has so far yet to specify what the precise military objective would be, with US officials having reportedly presented him with a wide range of options for what could be a weeks-long campaign.In the past, Trump has also used deadlines to achieve an element of surprise.At the time of Operation Midnight Hammer in July last year - which saw US forces strike Iranian nuclear facilities - White House officials were still publicly discussing the possibility of successful talks.The day before US missiles and bombs struck the facility, White House Press Secretary Karoline Leavitt read a statement from Trump in which he said that because \"negotiations may or may not take place with Iran in the near future, I will make my decision whether or not to go within the next two weeks\".Any strikes in the near future would come at a challenging time domestically for the Trump administration, with polls showing that a growing number of Americans disapprove of Trump's handling of immigration and the economy.Unlike the one-day strike in Iran last year and the quick operation to capture Nicolás Maduro in January, a protracted, multi-week conflict with Iran threatens alienating parts of Trump's Maga base which were drawn to his campaign promise of an end to messy foreign entanglements.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump 'considering' limited military strike on Iran",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1a63/live/ac7525e0-0ea4-11f1-8fa9-a78fde43271a.jpg"
      ],
      "datePublished": "2026-02-20T22:38:45.000Z",
      "dateModified": "2026-02-20T22:38:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cootamundra: Welcome to Australia's hottest beach event - nowhere near the sea",
    "url": "https://www.bbc.com/news/articles/crrx792qk81o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/82c7/live/f14c41f0-0ea7-11f1-801d-ed3cff6bf876.jpg",
    "tag": "Trending",
    "date": "2026-02-20T22:16:49.000Z",
    "description": "14 hours agoLana LamCootamundraBBC goes inside the beach volleyball contest hours from the nearest coastLike many wild and wacky ideas, it all started",
    "body": "14 hours agoLana LamCootamundraBBC goes inside the beach volleyball contest hours from the nearest coastLike many wild and wacky ideas, it all started down at the pub.\"I was literally looking out the window at that intersection and thought, 'What if we put in a beach volleyball court and play a competition?'\"On a tar road. In the middle of a town 400km from the nearest beach,\" Simon Sutherland, 51, says.He wanted to bring the party vibe of Bali's Kuta – a popular island holiday spot for many Australians – to his hometown of Cootamundra.And so that night he went home and drew up plans for Australia's own \"Coota Beach\" and its now famous annual volleyball tournament.Twenty-five years on, it's grown from a single day of play into a three-day festival – a cultural and sporting highlight in the town's calendar, delighting locals, attracting thousands of tourists and bringing in an estimated $2m in revenue.\"In a way, I think it's bigger than Christmas,\" 86-year-old grandmother Pat Roberts, who tells the BBC she has made cheering on her children and grandchildren a summer tradition.\"I've loved it every year, I've never missed one.\"From one court to tenIt's Saturday afternoon and the tournament resembles a beach bash in full swing, costumed bodies heaving under the blazing sun.\"Mine!\" calls out one singlet-clad player to her teammates, making it to a volleyball just in time. Loud pop and rock music blares down the entire block, punctuated by the odd cheer and whoop from spectators.Over on one court, a team of minions – complete with yellow-painted faces, oversized googles and beach-styled overalls – are jumping excitedly much like their animated namesake.Many teams play in fancy dress like this team of minions from the animated film.Elsewhere, teams like Holy Blockamole and Itsy Bitsy Spiker are dropping shots like it's hot, diving to make saves and drinking like it's the last days of summer.There's plenty of laughs as teams of six serve, spike and block during the 20-minute matches, with rules that are a mix of indoor and beach volleyball.Suncream's being slathered on, high-fives are flowing as freely as the cold drinks. In between matches, hard-working staff are hosing down the courts to cool the sand.It's a stark contrast to the first Coota Beach event in 2001 – when 16 teams played a couple dozen matches on a single court in one day. This year's event had almost 200 teams playing over three days. Demand was so high, 40 teams were turned away.Sutherland remembers the early years clearly.\"We used to get up at 1am and start setting up on the Saturday morning, ready to go for games at 8am,\" he recalls, shaking his head in mild disbelief as he glances over the ten courts at this year's event.Kaktus ScotWhat started as a one-day event is now a three-day tournamentThese days, transforming the asphalt landscape into a sandy oasis takes about a week, with almost 900 tonnes of sand – that's about six blue whales or 70 double-decker buses – trucked in.James Graham, owner of the quarry where the sand is sourced from, says the town's order is the strangest request he's ever had: \"Who am I to tell people what to do with it?,\" he jokes.Council workers then flatten the huge mounds of sand to create an inland beach, ready for the first games on Friday.Hours after the finals wrap up on Sunday and all the eskies have been packed away, workers and volunteers try to scoop up every last grain of sand, which is either sold or donated to the community, turning up in local parks, sporting grounds or construction sites.Within two days, the road – buffed and cleaned - returns to its usual form, lined with parked cars and locals going about their daily errands.Costumes and camaraderieKaktus ScotTeams of six play 20-minute matches with crowds cheering from the sidelinesOrganiser Lee-Anne Hogan estimates the town's usual population of 7,000 swells by about 3,000 over the weekend. \"It's enormous - the town actually books out in every way\".While, in the early days, there were fears from some businesses that closing a street might mean fewer customers, those worries have disappeared.A No Vacancy sign out the front of his Southern Comfort Motor Inn, Dylan O'Neill says: \"It's clear that every hospitality business in town benefits significantly from the event.\"Among those who have flocked to Cootamundra for the weekend are British couple Guy Wilkinson and Lizzie Ellison, both 30, who moved to Sydney two years ago and have driven four hours to compete.It's a \"true rural experience,\" that feels \"uniquely Australian\", Ellison says.\"It's a super fun, friendly vibe,\" Wilkinson adds.Their team – all dressed in tasselled cowboy outfits – have nabbed the prize for best-dressed, tying with another team decked out in pink nighties and platinum blonde wigs.Kaktus ScotYee-haw! This group of cowboys and cowgirls came tied in the best dressed award...Kaktus Scot... with this team looking pretty in pink.\"We've had people come here from Manly in Sydney saying that these are better courts to play on than the ones at the beaches there,\" Sutherland brags, \"I don't think we can get a better wrap than that.\"Whether you're a long-time local or new to Coota, the weekend is an opportunity to cultivate a sense of community.Sia Lesa speaks to the BBC as she is about to step onto court eight for her third and final match of the day.She recently moved to town from her native Samoa as part of a visa scheme that has seen hundreds of Pacific Islanders relocate to Australia for jobs.\"I arrived in 2024, right on the day of the tournament,\" she says. \"I arrived in the early morning and I played in the afternoon, no kidding.\"Sia, who moved from Samoa a few years ago, enjoys the community spirit of the eventFor Lesa, the social aspect of the weekend is a rare chance to feel part of a community that often feels closed off to her.\"Coota is very small and [this is] something different for us, because normally we work at the abattoir and straight after we finish work, we go home and stay there.\"It's certainly a homely affair for James Dunk, who has played every year for about a decade and always enters a team made up of three sets of neighbours.Last year, his son joined the team as he had just turned 14 – the minimum age to participate. \"It's almost a rite of passage before they ditch you and go and have more fun with their friends,\" he jokes.Founder Simon Sutherland and his son Eamon, 14, who got to play for the first time this yearThat's exactly the case for Sutherland's son Eamon, 14, who finally had a chance to join in, after years of watching from the sidelines.\"It's so exciting to get to play,\" he smiles, his team's name – Spiked and Served – emblazoned on his singlet.As the sun sets and players dust off their sandy feet, Sutherland says he has big plans to expand the shoreline of Coota Beach.\"I want it to be as big as the Elvis Festival in Parkes,\" he says, referring to the week-long celebrations in another regional Australian town that draws tens of thousands of fans every January to celebrate the King of Rock.\"The more people we can bring into the Coota sphere, the better - people that would rarely go to a country town. Come and see what we've got to offer.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cootamundra: Welcome to Australia's hottest beach event - nowhere near the sea",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/82c7/live/f14c41f0-0ea7-11f1-801d-ed3cff6bf876.jpg"
      ],
      "datePublished": "2026-02-20T22:16:49.000Z",
      "dateModified": "2026-02-20T22:16:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]