[
  {
    "title": "Newscast - Trump’s Tariff Threats Over Greenland - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mvqbpz?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-18T13:34:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·18 Jan 2026,·41 minsTrump’s Tariff Threats Over GreenlandNewscastAvailable for over a yearToday we look at President Donald Trump’s plans to impose further tariffs on European countries, including the UK, because of their oppostition to the US taking over Greenland.\nAs well as the UK, Trump announced a 10% tariff on goods from Denmark, Norway, Sweden, France, Germany, the Netherlands and Finland. They would come into force on 1 February, but could later rise to 25% - and would last until a deal was reached.\nLaura and Paddy are joined by chief politial correspondent Henry Zeffman and The Sun on Sunday’s political editor Kate Ferguson to talk through what it all means, and what it might do to Keir Starmer’s ‘the special relationship’ with Trump. \nThey also talk about why the news might be a bit awkward for Nigel Farage and his Reform Party.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers.\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC.\nThe presenters were Laura Kuenssberg and Paddy O’Connell. It was made by Chris Flynn with Jem Westgate. The social producer was Sophie Millward. The technical producer was James Piper. The weekend series producer is Chris Flynn. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Trump’s Tariff Threats Over Greenland - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-18T13:34:00.000Z",
      "dateModified": "2026-01-18T13:34:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Global Story - The post-World War II era is over. What comes next? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct715c?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mvc3rj.jpg",
    "tag": "Trending",
    "date": "2026-01-16T10:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search Sounds              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu   BBC SoundsSounds home pageHomeMusicPodcastsMy SoundsUse BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·16 Jan 2026,·28 minsThe post-World War II era is over. What comes next?The Global StoryAvailable for over a yearFor most of the years since World War Two, many global powers said they adhered to a rules-based international order. Since Donald Trump returned to the White House that idea is falling away. But did it ever exist in reality? And what’s the alternative now?  \nThe BBC’s International Editor Jeremy Bowen wraps up our week of special coverage. \nProducers: Cat Farnsworth and Xandra Ellin \nMix: Travis Evans \nSenior news editor: China Collins \n(Photo: Presidents Putin, Trump and Xi as Russian dolls. Credit: Yuri Kochetkov. EFE/REX/Shutterstock)Programme WebsiteMore episodesCymraegGaeilgeGàidhligBBC Sounds HelpContacts, Privacy and InformationHelp with Signing InNewsletter",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Global Story - The post-World War II era is over. What comes next? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mvc3rj.jpg"
      ],
      "datePublished": "2026-01-16T10:00:00.000Z",
      "dateModified": "2026-01-16T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zootropolis 2 becomes Hollywood's biggest animated film ever",
    "url": "https://www.bbc.com/news/articles/ckgx499y2gyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/79de/live/7ca18b20-f517-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-19T10:30:44.000Z",
    "description": "6 hours agoSteven McIntoshEntertainment reporterDisneyZootropolis 2, also known as Zootopia 2, is now the ninth highest-grossing film everZootropolis ",
    "body": "6 hours agoSteven McIntoshEntertainment reporterDisneyZootropolis 2, also known as Zootopia 2, is now the ninth highest-grossing film everZootropolis 2 has become Hollywood's highest-grossing animated film of all time, after taking $1.7bn (£1.3bn) at the box office globally.The film, known as Zootopia 2 in some countries, has overtaken previous record holder Inside Out 2, which made $1.69bn after its release in 2024.Zootropolis 2 is now the ninth most successful film in global box office history, behind films such as Avatar, Titanic, Avengers: Endgame and Star Wars: The Force Awakens.However, although Zootroplis 2 is a Hollywood record breaker, the highest-grossing animated movie overall remains China's Ne Zha 2, which made $2.2bn (£1.65bn) last year.Zootropolis 2, which was released in November and had an estimated budget of $150m (£112m), is the sequel to 2016's Zootropolis.Zootopia or Zootropolis? Four times things had different names in the UKIt sees rabbit police officer Judy Hopps (voiced by Ginnifer Goodwin) reunite with con artist fox Nick Wilde (Jason Bateman) to pursue a mysterious new reptilian resident Gary De'Snake (Ke Huy Quan). \"This milestone belongs first and foremost to the fans around the world whose enthusiasm made it possible,\" Disney Entertainment co-chairman Alan Bergman said in a statement. \"We're incredibly proud of our filmmakers... Zootopia 2 is an extraordinary achievement, and we're grateful to everyone who helped bring it to life.\"Getty ImagesNe Zha 2 made the bulk of its $2.21bn (£1.65bn) box office takings in ChinaZootropolis 2 had already achieved the biggest opening weekend for an animated film when it was released to coincide with Thanksgiving in the US.It went on to become the fastest animated Hollywood film to reach the $1bn (£750m) mark globally. Fantasy adventure film Ne Zha 2 is still comfortably ahead, having made most of its $2.2bn takings in China.The highest grossing films of all timeAvatar (2009) - $2.92bnAvengers: Endgame (2019) - $2.79bnAvatar: The Way of Water (2022) - $2.25bnTitanic (1997) - $2.26bnNe Zha 2 (2025) - $2.21bnStar Wars: The Force Awakens (2015) - $2.07bnAvengers: Infinity War (2018) $2.05bnSpider-Man: No Way Home (2021) - $1.92bnZootopia 2 (2025) - $1.70bnInside Out 2 (2024) - $1.69bn",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zootropolis 2 becomes Hollywood's biggest animated film ever",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/79de/live/7ca18b20-f517-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-19T10:30:44.000Z",
      "dateModified": "2026-01-19T10:30:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sydney shark attack: Man seriously injured in Sydney's third shark attack in two days",
    "url": "https://www.bbc.com/news/articles/c8013p5v2yvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0ccb/live/519b4280-f54a-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-19T09:38:09.000Z",
    "description": "Three shark attacks have been reported in Sydney in a little over 24 hours, leaving at least two people seriously injured, according to local authorit",
    "body": "Three shark attacks have been reported in Sydney in a little over 24 hours, leaving at least two people seriously injured, according to local authorities.A man was taken to hospital in critical condition after being injured at Manly beach on Monday evening, New South Wales Police said in a statement.Hours earlier, an 11-year-old surfer had to be assisted off Sydney's Dee Why Beach after a suspected shark bit his surfboard, with the local council urging swimmers and surfers to be cautious.The first incident saw a 12-year-old boy taken to hospital with critical injuries after he was attacked by a large shark while swimming in Sydney Harbour on Sunday afternoon, police said.The boy and his group of friends were jumping off a six-metre rock ledge at Shark Beach, in the Sydney suburb of Vaucluse, when the attack happened on Sunday.Despite its name, shark attacks are rare at Shark Beach, a popular swimming spot.The boy was pulled out of the water by his friends before rescuers arrived. Police said it was their actions that had given him a shot at survival, local media reported. He is currently in intensive care.\"The actions of his mates... have been nothing but brave. [It was] a gallant recovery,\" said Joseph McNulty, who leads the state of New South Wales' marine area command.\"Very confronting injuries for those boys to see, but I suppose that's mateship.\"Marine police arrived to a \"horrendous scene\", McNulty told reporters. They pulled the boy onto a police speedboat and used tourniquets to try and stop the bleeding from his legs. They also tried to resuscitate the boy as the boat made its way to an ambulance waiting by a wharf.Authorities believe the boy was attacked by a bull shark, an aggressive species found in warm, shallow waters. Many experts consider bull sharks among the most dangerous sharks in the world.McNulty believes heavy rainfall over the weekend and brackish water conditions could have created a \"perfect storm environment\" for Sunday's attack. Rain flushes nutrients into the rivers and oceans which can draw sharks closer to shore. The final attack, in Sydney's Northern Beaches, prompted police to close all beaches in the area until further notice.According to police, emergency services were alerted to the third attack after a surfer was pulled from the water at North Steyne Beach, Manly, at 18:20 local time (07:20 GMT). He had suffered serious injuries to his legs, and was rushed to hospital.Australia, which is home to some of the world's best beaches, is also one of the deadliest places for shark attacks. There were at least five fatal shark attacks in the country last year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sydney shark attack: Man seriously injured in Sydney's third shark attack in two days",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0ccb/live/519b4280-f54a-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-19T09:38:09.000Z",
      "dateModified": "2026-01-19T09:38:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Swiss deadly fire bar owners' lawyers condemn 'vindictiveness'",
    "url": "https://www.bbc.com/news/articles/c5yvl4x3nqeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2cd6/live/0eadac20-f535-11f0-a985-d16c4530bb3a.jpg",
    "tag": "Trending",
    "date": "2026-01-19T14:53:42.000Z",
    "description": "The lawyers of the owners of a Swiss bar where a deadly fire broke out on New Year's Eve killing 40 people and injuring 116 have broken their silence ",
    "body": "The lawyers of the owners of a Swiss bar where a deadly fire broke out on New Year's Eve killing 40 people and injuring 116 have broken their silence to criticise \"lies\" about their clients. Jessica and Jacques Moretti were  \"devastated\", the lawyers told local media, but denied being aware of any dangers at their venue.\"There is a sort of public vindictiveness directed against them,\" one of the three lawyers, Yaël Hayat, said.Initial findings from the investigation suggest the fire began as sparklers attached to champagne bottles ignited soundproof foaming that lined the ceiling of the basement of Le Constellation bar in the popular ski resort of Crans-Montana. Authorities have acknowledged that the bar had not undergone safety checks for five years.Most of the victims of the fire were young - eight were under the age of 16 - and many are being treated in hospital for severe burns.Many stories about the couple, the venue they managed, as well as their past have circulated in the local media since the fire, increasing pressure on the authorities as they investigate the accident and prosecute the owners.In an interview with Tribune de Geneve, the lawyers said the couple wanted to \"restore the truth\".Hayat said reports her client Jessica had left the burning building with cash from the register were a lie, telling BFMTV: \"In no way did she leave the scene in a hurry; she stayed there to help and support the injured.\"Patrick Michod, representing Jacques Moretti, said: \"When you run an establishment and a tragedy like this occurs, you feel responsible. Now, the major question in this case is the question of criminal responsibility, which is obviously not the same thing as the feelings one may have as the operator.\"Asked about the foam in the ceiling, Michod said his client obtained the material from a \"major construction retailer\" which did not disclose that it was flammable. \"He did not want to install a highly flammable foam. He wanted to install acoustic foam,\" he said. Lawyers representing the family of Cyane Panine, a staff member at Le Constellation who died in the blaze, said she had received no safety training and was unaware of the danger posed by the ceiling that caught fire. Hayat described Panine as a close friend of the couple, and pulled out a postcard she said had been written by her to the Morettis, Tribune de Geneve reported. \"I hope I will continue to grow alongside you and that we will spend many more New Year's Eves together [...] you are like my second family,\" the postcard said.The Moretti couple have been accused by authorities of manslaughter by negligence, bodily harm by negligence and arson by negligence.Last week, a Swiss court imposed a travel ban on Jessica Moretti as an alternative to pre-trial detention. She has had to surrender her passport and must report to police every day.She previously told reporters that she was sorry about the \"unthinkable tragedy\".Jacques Moretti is being held in custody for an initial period of 90 days. Prosecutors have also argued the couple present a flight risk and have asked judges to impose a 400,000-franc bail ($500,000; £374,000)as a condition for their release - 200,000 for each.Michod said that he had filed a request to release Jacques Moretti. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Swiss deadly fire bar owners' lawyers condemn 'vindictiveness'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2cd6/live/0eadac20-f535-11f0-a985-d16c4530bb3a.jpg"
      ],
      "datePublished": "2026-01-19T14:53:42.000Z",
      "dateModified": "2026-01-19T14:53:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Andrew Rosindell quits Tories and defects to Reform UK",
    "url": "https://www.bbc.com/news/articles/c98jn1wywdyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/23b4/live/eff55670-f52a-11f0-8a8b-43feb804a831.jpg",
    "tag": "Trending",
    "date": "2026-01-19T12:26:05.000Z",
    "description": "Andrew Rosindell has resigned from the Conservative Party and defected to Reform UK.The former shadow minister and MP for Romford said the Tories were",
    "body": "Andrew Rosindell has resigned from the Conservative Party and defected to Reform UK.The former shadow minister and MP for Romford said the Tories were \"irreparably bound to the mistakes of previous governments\" and not willing to take \"meaningful accountability\" for poor decisions. He said he had spoken to Nigel Farage on Sunday evening before agreeing to join his party. The Reform UK leader called him \"a great patriot\" who \"will be a great addition to our team\".A Conservative source said Rosindell's departure was a prime example of Farage doing the \"spring cleaning\" of Tory leader Kemi Badenoch, and Reform was \"welcome\" to him.Rosindell's move comes after Robert Jenrick joined Reform on Thursday, hours after being sacked from the shadow cabinet by Badenoch, who had accused him of plotting to defect.The 59-year-old, who was a shadow foreign minister before his resignation, said in a statement on X that the \"views and concerns of constituents such as mine in Romford have been consistently ignored for far too long\".\"Our country has endured a generation of managed decline,\" he added. \"Radical action is now required to reverse the damaging decisions of the past and to forge a new course for Britain.\"Rosindell becomes Reform's seventh MP and the third sitting Conservative MP to join the party, following Danny Kruger and Jenrick.This week's defections mean that - putting aside independent MPs, who do not vote in a block - Reform UK now has the joint fifth biggest party grouping in the Commons, alongside Sinn Fein which does not send any of its seven MPs to Westminster. It is two MPs behind the fourth biggest party, the SNP.About 20 former Tory MPs have switched their allegiance to Reform UK, including former Chancellor Nadhim Zahawi, who did so a week ago.Speaking to BBC Breakfast, Jenrick said it was \"great news\" Rosindell had joined Reform adding: \"If there are other members of Parliament who are in the same situation, then I'm sure Nigel [Farage] and the party would welcome them in.\"But he has said very clearly, that you need to make up your mind quickly because Reform is growing fast.\"Shadow Welsh Secretary Mims Davies told BBC Radio 4's Westminster Hour that Conservative MPs defecting to Reform were \"self-serving and completely wrong\".\"I do find this very confusing that these people who are saying they want to put things right, want to be right-wing, but ultimately there's a lot in Reform which is very left-wing and obviously populist,\" she said.\"I really don't think that arguing that Britain is failing helps people. People want to know, yes things are wrong but the people they've elected are willing to roll up their sleeves and get themselves up to what needs to be fixing rather than looking self-serving.\"Rosindell has held the Romford seat in east London since 2001, although his majority was cut from 17,893 to just 1,463 at the last general election.After switching to Reform, he cited the Labour government's decision to hand the Chagos Islands to Mauritius and the \"failure of the Conservative Party both when in government and more recently in opposition to actively hold the government to account on the issue\" as among the reasons for his defection.Negotiations to transfer sovereignty of the islands began under the Conservatives in late 2022. However, under Kemi Badenoch, the Tories have criticised the handover deal struck by the Starmer government last year.Speaking to reporters on Monday, Rosindell described the Chagos handover as \"one of the reasons\" for his defection, whilst also saying his old party was \"not radical enough\" to offer answers to challenges facing Britain. Also speaking to reporters, Farage insisted his party would not become a \"lifeboat\" for Conservative MPs, or \"Tory Party 2.0\".The Reform leader has said his party would not accept further defections after elections to the Scottish and Welsh parliaments, and a series of local elections in England, due on 7 May.A Conservative source said Rosindell had been \"threatening to defect for months, denying it was happening as recently as Saturday\". They added: \"We're not going to be distracted from holding this disastrous Labour government to account.\"The Labour Party chair Anna Turley said: \"The stench of a failed and dying Tory Party now engulfs Reform.\"Nigel Farage is now unconditionally trying to rehabilitate their disastrous record,\" she added. \"The public won't be fooled: the Tories failed Britain and Reform want to do it all over again.\"A Liberal Democrat source said the defection was \"a change of rosette for a career politician worried about getting a P45\", adding: \"The public are fed up hearing about how Britain is broken from the very same people who broke it.\"Jenrick told a news conference where he announced his defection to Reform that the Tories \"broke\" the country and had \"betrayed its voters\", with the UK now \"in decline\". He later told the BBC's Laura Kuenssberg that the country needed a \"new and exciting\" leader \"who hasn't been part of that failed consensus\".Badenoch called it a \"good day\" for the Conservatives and said Jenrick was \"now Nigel Farage's problem\".She wrote in the Telegraph that Reform was destined to fail as it welcomed \"toxic people\" who \"destroy organisations\".\"A movement built on grievance and serial disloyalty is doomed to fail, and they will be at each other's throats soon enough,\" she said.Correction - an earlier, breaking news version of this story incorrectly stated that Rosindell was the seventh Conservative MP to defect to Reform UK. He is actually the third sitting Conservative to switch allegiance, and takes the number of Reform UK MPs to seven.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Andrew Rosindell quits Tories and defects to Reform UK",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/23b4/live/eff55670-f52a-11f0-8a8b-43feb804a831.jpg"
      ],
      "datePublished": "2026-01-19T12:26:05.000Z",
      "dateModified": "2026-01-19T12:26:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chips washing up on Eastbourne beach sparks action from locals",
    "url": "https://www.bbc.com/news/articles/c1m738pyvxjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/aaa6/live/7750f470-f45f-11f0-9d3e-19fc3cce7a2f.jpg",
    "tag": "Trending",
    "date": "2026-01-19T12:57:39.000Z",
    "description": "Volunteers clear washed-up bags of chips from beach3 hours agoJoel BonniciThe chips were found on the beach near Beachy Head on SaturdayTrisha Barros,",
    "body": "Volunteers clear washed-up bags of chips from beach3 hours agoJoel BonniciThe chips were found on the beach near Beachy Head on SaturdayTrisha Barros, who was helping to clear the bags, told BBC Radio Sussex when she saw the beach on Saturday it was \"just a sea of chips, it was a bit insane\".She said that the bags, which went \"as far as the eye can see\", were stacked about 1.5ft (0.5m) on top of each other.Barros said she cleared \"a couple hundred bags\" on the first day with her partner, but others started to help after a call for volunteers was put on social media.Barros, a veterinary nurse, explained that she also had concerns about the impact the chips and bags could have on local wildlife.\"That is a massive concern that this might affect the wildlife,\" she said.\"Chips, onions, plastic, all of these are toxic to them.\"Barros also raised concerns that animals, including seals, could eat the clear plastic bags.Eddie MitchellA container has also washed up on the beach at the foot of Beachy HeadTrevor Weeks, founding director of East Sussex Wildlife Rescue and Ambulance Service, said the primary risk would be to the water quality due to the decomposition of the potatoes.He said: \"This can lead to localised oxygen depletion which can affect fish, crustaceans, and other small organism, especially in sheltered areas or tidal pools.\"There is a risk to scavengers as the high starch loads can cause gut fermentation, cause diarrhoea, vomiting, regurgitation, dehydration, [and] bloat.\"Chip wreck! Thousands of chips wash up on beachThe chips came ashore in Falling Sands, which is near Beachy Head cliffs, after three shipping containers washed up at Seaford on Tuesday.A spokesperson for the HM Coastguard said a container off Littlehampton, West Sussex, was also recovered, along with debris off Beachy Head.\"An aircraft was sent to survey the area on Friday and no further containers were spotted offshore,\" they added.They said containers which had previously washed up at Selsey, Eastbourne, Newhaven, Rustington, Rottingdean and Beachy Head were being monitored.They came ashore a month after 16 containers fell from the cargo vessel Baltic Klipper near the Isle of Wight and days after several containers fell from two more ships off the island during Storm Goretti.Joel BonniciVolunteers have been clearing up the plastic bags.East Sussex County Council has urged members of the public to take extra care if they are visiting the coastline.The council said it had been communicating with maritime salvage specialists Brand Marine.More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chips washing up on Eastbourne beach sparks action from locals",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/aaa6/live/7750f470-f45f-11f0-9d3e-19fc3cce7a2f.jpg"
      ],
      "datePublished": "2026-01-19T12:57:39.000Z",
      "dateModified": "2026-01-19T12:57:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gold and silver prices hit high after tariff threat",
    "url": "https://www.bbc.com/news/articles/cx2yppj4lg4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9d72/live/3eff27c0-f50b-11f0-911d-fd8fe3b7d549.jpg",
    "tag": "Trending",
    "date": "2026-01-19T14:27:50.000Z",
    "description": "2 hours agoNick EdserBusiness reporterGold and silver prices hit record highs but share prices fell on Monday as investors reacted to the threat by US",
    "body": "2 hours agoNick EdserBusiness reporterGold and silver prices hit record highs but share prices fell on Monday as investors reacted to the threat by US President Donald Trump to impose fresh tariffs on eight European countries opposed to his proposed takeover of Greenland.The price of gold touched $4,689.39 (£3,499) an ounce on Monday, while silver rose to a peak of $94.08 an ounce.Precious metals are seen as safer assets to hold in times of uncertainty, and the prices of both gold and silver have soared over the past year.But stock markets in Europe fell as investors worried over the latest increase in geopolitical tensions. On Saturday, Trump announced a 10% tariff on goods from Denmark, Norway, Sweden, France, Germany, the UK, the Netherlands and Finland would come into force on 1 February, but could later rise to 25% - and would last until a deal on Greenland was reached.Reports have suggested the EU is considering responding with a €93bn (£80bn) package of tariffs on US imports.Worries over the Greenland spat triggered another rise in gold and silver prices as investors headed for \"safe haven\" assets.Last year, the price of gold soared by more than 60%, partly due to concerns about global tensions and economic uncertainty.However, there are other factors behind the rise, including expectations of more interest rate cuts, central banks adding hundreds of tonnes of gold to their reserves and - in regard to silver - China announcing restrictions on exports of the metal.\"Gold has hit fresh record highs on its glittering run upwards,\" said Susannah Streeter, chief investment strategist at Wealth Club.\"The precious metal is holding even more allure as a safe haven as worries spread about the repercussions of the US aggressive trade and geopolitical policies.\"But while gold and silver were continuing their recent strong runs, shares were on the back foot.London's FTSE 100 index fell 0.4%, while the FTSE 250 - which has a greater number of domestically focused companies - was down 0.8%. A mixture of financial firms and industrial stocks were lower, but shares in gold miners Fresnillo and Endeavour rose following the latest increase in precious metal prices.Across Europe shares in carmakers, tech and luxury goods firms saw sharp falls.In Germany, the Dax index fell 1% with car companies BMW, Mercedes-Benz and VW all down by about 3-4%.In France, the Cac 40 index was down 1.4%, with luxury brands LVMH and Hermes among the biggest losers.However, European defence stocks rose, with Germany's Rheinmetall and France's Thales both trading higher.Markets in the US are closed on Monday for a public holiday.Dan Coatsworth, head of markets at AJ Bell, said Trump's latest tariff threat \"turns up the heat to max\".However, he noted that \"while we've seen a red day for European shares in general, it's not panic time\".\"What needs to be watched closely is how markets behave over the near term. A 1% to 1.5% decline every day over a series of weeks adds up to trouble, and that's what investors are keen to avoid happening.\"Trade tensions are one of the main risks to global economic growth, according to the latest forecast from the International Monetary Fund (IMF).In its latest world economic outlook - prepared before the latest tariff threat emerged - it described the global economy as \"steady\", but said risks to growth included an end to the AI boom and a \"flare up\" in trade tensions.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gold and silver prices hit high after tariff threat",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9d72/live/3eff27c0-f50b-11f0-911d-fd8fe3b7d549.jpg"
      ],
      "datePublished": "2026-01-19T14:27:50.000Z",
      "dateModified": "2026-01-19T14:27:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China's birth rate hits record low as population continues to shrink",
    "url": "https://www.bbc.com/news/articles/c79r7v7qr53o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cc3b/live/a4e454e0-f50e-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-19T07:12:01.000Z",
    "description": "China's birth rates sunk to a record low in 2025, despite the government rolling out a spate of incentives to boost it, as the country's population fe",
    "body": "China's birth rates sunk to a record low in 2025, despite the government rolling out a spate of incentives to boost it, as the country's population fell for the fourth straight year.Government data on Monday showed that the country's birth rate fell to 5.63 per 1,000 people – a record low since the Communist Party took power in 1949 – while its death rate rose to 8.04 per 1,000 people, the highest since 1968.Its population fell 3.39 million to reach 1.4 billion by the end of 2025, marking a quicker decline than the previous year.Faced with an ageing population and sluggish economy, Beijing has been trying hard to encourage more young people to marry and have children.In 2016, it scrapped its longstanding one-child policy and replaced it with a two-child limit. When that did not lead to a sustained upsurge in births, authorities announced that they would allow up to three children per couple in 2021.More recently, China has offered parents 3,600 yuan (£375; $500) per each of their children under the age of three. Certain provinces are also dishing out their own baby bonuses, including additional payouts and extended maternity leave.Some of these incentives have stirred controversy. For instance, a new 13% tax on contraceptives - including condoms, birth control pills and devices - has sparked concern about unwanted pregnancies and HIV rates.China has one of the lowest fertility rates in the world, at around one birth per woman, below the replacement rate of 2.1. Other economies in the region, such as South Korea, Singapore and Taiwan, have similarly low fertility rates.China is also one of the most expensive countries in which to raise a child, according to a 2024 report by the YuWa Population Research Institute in Beijing.But some Chinese people have told the BBC they are hindered by other factors - including the desire for a carefree life without constantly worrying about their children.\"I have very few peers who have children, and if they do, they're obsessed about getting the best nanny or enrolling the kids in the best schools. It sounds exhausting,\" a Beijing resident told the BBC in 2021.Experts at the United Nations believe China's population will continue on a downward trajectory, estimating that the nation will lose more than half of its current population by 2100.A shrinking population has economic and social implications for the world's second-largest economy: exacerbating an already declining workforce and weak consumer sentiment. With many young people moving away from their parents, there is also a growing number of seniors who are being left to look after themselves or rely on government payments.But the pension pot is running dry, according to the state-run Chinese Academy of Social Sciences - and the country is running out of time to build enough funds to care for its growing elderly population.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China's birth rate hits record low as population continues to shrink",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cc3b/live/a4e454e0-f50e-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-19T07:12:01.000Z",
      "dateModified": "2026-01-19T07:12:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Five easy ways to find joy in January",
    "url": "https://www.bbc.com/news/articles/cql4e2yele4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9b59/live/c0c01150-f535-11f0-a985-d16c4530bb3a.jpg",
    "tag": "Trending",
    "date": "2026-01-19T12:54:22.000Z",
    "description": "3 hours agoLucy HookerBBC News reporterGetty ImagesThere is a reason it is called Blue Monday. Slap-bang in the middle of a month that is all about fr",
    "body": "3 hours agoLucy HookerBBC News reporterGetty ImagesThere is a reason it is called Blue Monday. Slap-bang in the middle of a month that is all about freezing drizzle and self-denial, the third Monday in January is notoriously the gloomiest day of the year.But some of us are fighting back.Here are some ways to find joy among the January gloom.1. Enjoy everyday things\"I love music. I absolutely love music,\" says Paddy Merritt.Like a lot of people, the 24-year-old finds switching on a favourite tune can completely change his mood.And while a festival or gig is \"true bliss\" even just switching it on in the kitchen can be great, especially with friends.\"There is joy to be found in lots of everyday things,\" he says.That harmonises with David Larbi's philosophy.The poet and online content creator urges his followers to be on the lookout for small wins.\"On the average day, you can have a little smile at four or five things that might seem minute, but bring you a happy feeling,\" he says.\"This morning, it was very cold, and I put my socks on. My feet were a little bit warmer.\"That moment of joy made me feel a lot better.\"Paddy MerrittPaddy Merritt also gets joy from performing his musical comedy2. Be interestedSophie Scott, professor of cognitive neuroscience at University College London, told What's Up Docs on BBC Radio 4, a huge range of things can bring joy.What marks it out is that joy is often quite intense, she says. There is a sense of being \"overwhelmed with the emotion\" in contrast to other forms of happiness, such as comfort or contentment.For many people the experience of getting up on stage might be as far from joy as they can imagine, but Paddy says that is how he gets the really intense, adrenaline-fuelled, joy - from performing musical comedy. Sophie, who has dabbled in stand-up herself says however you do it, just watching comedy or hanging out with friends, do something where there's a chance you'll have one of those \"laughing 'til your face hurts\" moments.But don't panic if joy doesn't happen right on cue. If you want birds to come to your garden you don't march around it shouting \"come on birds\", she points out. You make the garden beautiful and wait.\"Let yourself be enthusiastic about things. Let yourself be interested in things and interested in people,\" she says.3. Dinner with friendsAna CassAna meets her friends at the sauna for the double benefit of the warmth and the chatAna Cass says seeing other people is definitely a source of joy for her. The 27-year-old data scientist struggles with seasonal affective disorder, meaning January can be tough, but she has found ways to counter it.\"What has helped the most is having dinner with friends.\"We take turns hosting. We hang out. We chat. That's the best thing I've done all winter.\"At the weekend, instead of cafes, she and her friends often choose to meet at the sauna and plunge pool, with the added buzz that offers.\"That rush makes you forget that January is miserable and cold.\"4. Move - skip, dance or walkThere is often a physical aspect to joy, says Sophie Scott.\"Almost all expressions of joy involve jumping, running, movement.\"There's even the phrase \"jumping for joy\".David Larbi reckons even a tiny moment of joy can put a spring in his step. \"Today, the sun was out, and I left early. \"I was listening to the right music - Stevie Wonder,\" he says.\"So I had a little skip.\"Dancing and listening to music you love are both great ways to give yourself an \"endorphin bump,\" says Scott. Even a short walk will leave you feeling a bit better, she says.David LarbiDavid Larbi says joy doesn't have to be about big eventsAna recommends salsa classes, something she has been doing for a decade, as another thing that brings her joy.Dancing, she says, allows the kind of casual social interactions that are no longer as common in our work-from-home, shop-online environment, and a physical closeness.\"When you dance close, you touch. That human aspect feels good.\"Getty Images5. Remember, winter isn't out to get youDavid Larbi says the more you look for ways to find joy, the more obvious they become.\"The good thing about doing that is, the more of those small moments you notice, the happier you are, and the more likely you are to notice them.\"He shares his upbeat philosophy on social media, and has published a book, Frequently Happy, encouraging people to look for uplifting moments in the everyday.And if sometimes in the middle of January, it feels as though winter is out to get you, with its biting winds and long nights, he says, remember, it is nothing personal.\"Winter is not actively malicious,\" he says. \"It is just the earth doing what it has to do.\"Get our flagship newsletter with all the headlines you need to start the day. Sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Five easy ways to find joy in January",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9b59/live/c0c01150-f535-11f0-a985-d16c4530bb3a.jpg"
      ],
      "datePublished": "2026-01-19T12:54:22.000Z",
      "dateModified": "2026-01-19T12:54:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Greenland: How could Europe respond to Trump's tariffs threat?",
    "url": "https://www.bbc.com/news/articles/cgk8z8xxpgmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/114e/live/f3239150-f53d-11f0-882c-db1e330b50d4.jpg",
    "tag": "Trending",
    "date": "2026-01-19T14:13:10.000Z",
    "description": "2 hours agoDearbail Jordan,Theo LeggettandJonathan Josephs,BBC Business News Getty ImagesEC President Ursula von der Leyen struck a deal with Donald T",
    "body": "2 hours agoDearbail Jordan,Theo LeggettandJonathan Josephs,BBC Business News Getty ImagesEC President Ursula von der Leyen struck a deal with Donald Trump last yearDonald Trump's threat on Saturday to impose tariffs on eight European countries unless they support his plan to buy Greenland came as a shock. The US president said he would introduce a 10% levy on imports into the US on 1 February, rising to 25% from the summer if no deal is done.  It is unclear whether these tariffs would be added to existing levies.France and Germany - part of the group of eight which includes the UK, Denmark, Norway, Sweden, the Netherlands and Finland - have said the European Union (EU) should be ready to act if Trump goes ahead with the taxes.But what options does Europe have to respond to the US? Could Europe hit back with tariffs?Less than six months ago, the US and the EU agreed a deal that was supposed to stabilise transatlantic trade and provide certainty to businesses and consumers.European Commission President Ursula von der Leyen came away from President Trump's golf course in Scotland with tariffs of 15% on everything the EU sells to the US - far better than the 30% America had threatened.Along the way, Brussels also prepared a package of tariffs that would come into force if it was unable to reach an agreement with the US.It included tariffs on everything from livestock to aircraft parts to whiskey, totalling €93bn (£80bn; $108bn) worth of goods that the US sells to the EU.The high-level agreement meant those taxes were suspended while details were worked out, and the European Parliament was set to ratify the EU-US trade deal next week.  But within hours of Trump's threat, influential German MEP Manfred Weber said approval was \"not possible at this stage\".Without the EU signing off on last year's deal or extending the suspension, the tariffs on billions of euros worth of American goods will kick in on 7 February.That risks a political backlash in the US for Trump from companies that export to Europe.As for his threats of tariffs on some but not all EU countries, the commission said while it was technically possible, it would be very difficult to implement given the number of times goods cross EU borders before they are exported to the US.European Commission spokesperson Olof Gill said Brussels would do \"everything necessary to protect EU economic interests\" - but ultimately, tariffs would only serve to harm businesses and consumers on both sides of the Atlantic.What is the EU's 'trade bazooka'?The so-called \"trade bazooka\", officially known as the Anti-Coercion Instrument (ACI), is a law that allows the European Union to respond to economic blackmail from non-EU countries.It threatens very severe consequences if they attempt to impose their will on the EU or its members. Specifically, it targets trade and investment measures by countries who are seen to interfere in the \"legitimate, sovereign choices\" of the EU or its member states.This response can include a vast swathe of trade measures such as tariffs, import and export restrictions, curbs on trade in services as well as reduced access to banking and capital markets.Ultimately, it allows the EU to block access to most of the single market while ignoring existing international treaties.However, this is the nuclear option.The real purpose of the bazooka is to bring other countries to the negotiating table. Actually deploying it could cause serious economic damage within the EU itself, so it is seen very much as a last resort.It is also not a rapid response measure.Under the current rules, the European Commission can spend up to four months investigating any alleged coercion. Another six months can be spent negotiating with the country concerned and deciding whether there is a case for retaliation. Then, the EU's member states have up to 10 weeks to authorise any action.So even if the commission were to pull the trigger now, it could be a year before the bazooka is actually fired.What about the UK? Prime Minister Sir Keir Starmer has made it clear he wants to avoid a trade war with Trump, more or less ruling out immediate retaliatory tariffs against the US in a speech on Monday.While he said Trump should not be using the threat of trade taxes \"against allies in this way\", Sir Keir also said: \"A tariff war is in nobody's interests.\"He continued: \"We have not got to that stage and my focus therefore is making sure that we don't get to that stage.\" There are other levers the government could use if the UK, the EU and the US are unable to reach an accord over Greenland.The UK could, for example, increase the Digital Services Tax, potentially affecting some of the US's largest tech companies like Amazon and Meta, the owner of Instagram, WhatsApp and Facebook.The tax rate is currently 2% and is charged against tech giants with sales of £500m worldwide and £25m in the UK.But at this stage, so much is unclear including the legality of some Trump tariffs. The US Supreme Court is set to rule on whether the president overstepped his authority by imposing taxes using the International Emergency Economic Powers Act.That includes the so-called \"retaliatory\" tariffs Trump introduced last year under which American businesses importing a range of British goods have to pay a 10% tax when they reach US shores.   ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Greenland: How could Europe respond to Trump's tariffs threat?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/114e/live/f3239150-f53d-11f0-882c-db1e330b50d4.jpg"
      ],
      "datePublished": "2026-01-19T14:13:10.000Z",
      "dateModified": "2026-01-19T14:13:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Abergele teenager diagnosed with rare allergy to cold temperatures",
    "url": "https://www.bbc.com/news/articles/c4grjn8e147o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b52f/live/a1a19cb0-f4b0-11f0-b385-5f48925de19a.png",
    "tag": "Trending",
    "date": "2026-01-19T06:31:59.000Z",
    "description": "I'm allergic to cold - anything below 12C and I break out in hives10 hours agoPaul PigottBBC WalesPA MediaCold temperatures cause 16-year-old Amber to",
    "body": "I'm allergic to cold - anything below 12C and I break out in hives10 hours agoPaul PigottBBC WalesPA MediaCold temperatures cause 16-year-old Amber to break out in red, itchy hives\"I just want to be able to do normal things and have a normal life and not have to worry.\"A 16-year-old girl from north Wales says she is \"always scared\" of having an allergic reaction after being diagnosed with a rare condition which sees her experience hives and swelling triggered by cold temperatures.Amber Woodward said it has happened since 2022, whenever the temperature falls below 12C (53F).She has cold urticaria, a rare allergy which can cause her to have a reaction to as little as a gust of cool wind in summer.The A-level student hopes new antihistamine injections every four weeks will improve her symptoms, which cause her to miss out on plans with friends and leave her feeling self-conscious.Amber, from Abergele, Conwy county, said: \"There is no cure and I'm always scared because there's a lot of people [with the condition] who have said that they get anaphylactic shock.\"She has to wear leggings under her clothes almost all the time and said she often felt as though \"everyone is looking\" at her.Cold urticaria can be triggered by swimming or other water activities, as well as touching or eating cold foods and drinks, according to Anaphylaxis UK.The charity said the underlying cause was unknown and the condition was often difficult to diagnose and manage because symptoms varied widely.PA MediaAmber feels self-conscious when she breaks out in hives due to cold temperaturesAmber, who has a part-time job as a waitress, said she was walking back from work the first time she had a breakout.\"I had bumps and was red all over my face, ears, legs and arms and was itchy,\" she said.\"I thought it might have been the food I'd eaten, so I didn't eat anything at home and I got another rash.\"When the symptoms later returned, she went to her GP who suggested her skin was reacting to pollution and did not prescribe any medication.With Amber having an almost daily reaction, her mum, Dawn, became \"very worried\".\"She always made me wear double layers and she was always scared of what could happen because obviously we didn't know much about it,\" Amber said.Amber did some research herself and when she came across cold urticaria, she was referred to a dermatologist. She said she was initially shocked by the diagnosis in 2023, because the condition was so rare.\"But I was kind of relieved that I had support, I was happy that someone actually believed me,\" she added.However, Amber's symptoms have not improved with medication.She also develops hives and a rash when coming out of water, whether from a swimming pool, the shower, or the sea, regardless of the outside temperature.PA MediaMedication has not helped Amber's symptoms and she continues to struggle to manage the conditionAmber said she often arrived at work and school with redness and hives, and has had to turn down plans with friends.\"When I go out, I always have a reaction - I walk about 20 minutes to the bus stop and I get a reaction,\" she said.\"My friends are always out, and they're always inviting me out, and I can't really go out because of it, so I feel left out.\"We have to plan around where we go. If it's somewhere inside or at someone's house that's fine, but if it's outside, then I can't do it.\"But Amber remains hopeful about the future.\"I'm hoping there's going to be a lot more research going into this and hopefully there's more medication out there for me.\"I just want to be able to go about my everyday things that other people can do.\"More top stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Abergele teenager diagnosed with rare allergy to cold temperatures",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b52f/live/a1a19cb0-f4b0-11f0-b385-5f48925de19a.png"
      ],
      "datePublished": "2026-01-19T06:31:59.000Z",
      "dateModified": "2026-01-19T06:31:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Australian Open 2026 results: Novak Djokovic beats Pedro Martinez for 100th win at tournament",
    "url": "https://www.bbc.com/sport/tennis/articles/cr57ee6mr30o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7319/live/9d398960-f539-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-19T13:31:00.000Z",
    "description": "Novak Djokovic delivered a serving masterclass as he registered his 100th victory at the Australian Open with a straight-set win over Spain's Pedro Ma",
    "body": "Novak Djokovic delivered a serving masterclass as he registered his 100th victory at the Australian Open with a straight-set win over Spain's Pedro Martinez.The world number four, who is bidding for a standalone record 25th Grand Slam singles title, only dropped five points out of 57 on serve across a two-hour exhibition of serving excellence.The 38-year-old produced eight holds to love, only lost one point in each of the second and third sets and won 93% of points behind his first serve - all while maintaining a first-serve percentage of 77%.The 10-time champion fittingly closed out the win with his 14th ace of the night, triumphing 6-3 6-2 6-2.Mark Woodforde, a 17-time Grand Slam doubles champion, hailed Djokovic's serving as \"supreme\" and \"exceptional\" on BBC Radio 5 Sports Extra but the Serb offered a more understated assessment of his performance.\"Tonight's performance was great, I can't complain about anything. I served very well,\" said Djokovic.\"It's always a challenge to kick-start the tournament on the right note and send the right signal not only to yourself but your opponents watching you play.\"I have a couple of days without a match to recover my body. I'm using every hour to get in shape for the next challenge.\"After notching up a century of wins in Melbourne - a feat he has also achieved at Wimbledon (102) and Roland Garros (101) - Djokovic was treated to video highlights from his 2005 main-draw debut during his post-match interview.Djokovic, in understandably jovial spirits, played down this period of reflection, insisting he will not get caught up in his career achievements until he has \"put the racquet aside [and is] sipping some nice cocktail on the beach\". Djokovic, who will face Italian qualifier Francesco Maestrelli in the second round, continued: \"It's a nice feeling to be a centurion.\"History-making is great motivation. Particularly in the last five or 10 years of my career, once I got myself in a position where I could eventually create history, I was even more inspired to play the best tennis.\"I was fortunate early in my career to encounter people who guided me to play the long shot with my career, not to burn out too quickly, and take care of my body and my mind.\"I'm blessed to be playing at this level and another win is a dream come true.\"Sixth seed Alex de Minaur believes he has the ability to be a serious contender for major honours and become the first Australian to win the men's singles title at his home Grand Slam since Mark Edmondson in 1976.The 26-year-old, who has reached the quarter-finals at each of the four majors, began his campaign with a dominant 6-2 6-2 6-2 win over lucky loser Mackenzie McDonald but insisted he has more to prove.\"I've got to the stage where I'm not just another number in the draw,\" De Minaur said. \"I'm playing to win it, to be one of the guys in contention. Ultimately, that's the goal. It's not about being satisfied [with this performance].\"Elsewhere, 13th seed Andrey Rublev beat Italian Matteo Arnaldi in straight sets while three-time Grand Slam finalist Casper Ruud, the 12th seed, lost just seven games en route to victory over Mattia Bellucci.Spanish 14th seed Alejandro Davidovich Fokina and American 19th seed Tommy Paul came through unscathed against Filip Misolic and Aleksandar Kovacevic respectively.However, there was a surprise early exit for Czech 17th seed Jiri Lehecka, who fell to Arthur Gea in straight sets. The Frenchman, who came through qualifying, will face 40-year-old former champion Stan Wawrinka in round two.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australian Open 2026 results: Novak Djokovic beats Pedro Martinez for 100th win at tournament",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7319/live/9d398960-f539-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-19T13:31:00.000Z",
      "dateModified": "2026-01-19T13:31:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Teachers on supply list for years or leaving country due to job shortages",
    "url": "https://www.bbc.com/news/articles/cpdyjg27nnwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dddf/live/b861b3a0-f2f7-11f0-b4d0-a5f4a003a8e3.jpg",
    "tag": "Trending",
    "date": "2026-01-19T09:49:28.000Z",
    "description": "7 hours agoGabrielle WilliamsonandCatherine Lyst,BBC ScotlandLouise FraserLouise Fraser wants to move back to Scotland but is worried she will be unab",
    "body": "7 hours agoGabrielle WilliamsonandCatherine Lyst,BBC ScotlandLouise FraserLouise Fraser wants to move back to Scotland but is worried she will be unable to find a jobSome teachers in Scotland are spending years on the supply list or leaving the country due to a lack of permanent jobs, BBC Scotland has learned. Analysis of Scottish government figures shows that most newly qualified teachers in Scotland are no longer getting permanent jobs, especially in primary schools, despite schools saying they are under pressure.Louise Fraser, 24, moved to Dubai for job security because she struggled to find stable work in a Scottish primary while another teacher has been on the supply list for nine-and-a-half years.Education Secretary Jenny Gilruth said pay rises for teachers had made employing them more expensive, but that progress was being made on teacher numbers.Louise, from Ayrshire, graduated in 2022 but after her probation year could not find a teaching job.She told BBC Radio Scotland Breakfast she moved to Dubai for more security and a better quality of life.\"I didn't just to move to Dubai for the lifestyle, I moved because I needed the job security,\" she said.Louise now wants to move back to Scotland but is worried she may no longer be able to work as a teacher.\"I am now engaged and want to move back to Scotland to be with my family but I am so scared about coming home and having to re-enter this dire job crisis,\" she said.\"I don't know if I will be able to still be a teacher. I am having to save so much money at the moment, as I am fearing what I am going to have to return home to.\"Louise Fraser told BBC Radio Scotland Breakfast she moved to Dubai for more job security and a better quality of life.Another teacher, who did not wish to be named, is a qualified modern studies teacher who has been on the supply list for nine-and-a-half years.He said his situation became so bad that he got into £50,000 of debt and tried to take his own life last year.\"I have been working contract to contract,\" he said. \"It has been so stressful, and has left me with bills I have been unable to pay. \"I have wracked up £50,000 in debt and almost had to file for bankruptcy in April last year.\"He said that on two occasions he was told he had been successful in job interviews, only to then receive emails from the council saying they had decided to fill the post using a probationer instead.\"The council do this to save money as the government pays for probationers,\" he said.\"It means it leaves people like me unable to secure work.\"I got myself in such a bad place last year I tried to take my own life.\"I'm lucky I have a partner that has helped me battle these demons, but I never thought a vocation - something I love - would push me to this.\"It has been five years since the Scottish government made its 2021 manifesto promise to tackle excessive levels of teacher workload by employing 3,500 additional teachers and reducing teachers' maximum class contact time commitment to 21 hours per week.Scottish government figures for 2024/25 show that 2,294 newly qualified teachers completed their probation year (the Teacher Induction Scheme). This is the route every new teacher takes after university.Only 568 (25%) of those teachers secured a permanent post - one in four.Of the remaining 75%, 1,015 are in temporary or fixed-term contracts and 711 are in \"other\"' roles - mainly supply teaching, or not working in teaching at all.Primary teachers are most affected.In the first year after probation, only about 11–12% of primary teachers had a permanent job.Nearly nine in 10 primary teachers are temporary, on supply or without a permanent post.Stories you may have missedThe EIS teaching union said Scotland was 4,310 teachers down on the level promised in the 2021 SNP Manifesto pledge.General secretary Andrea Bradley told Radio Scotland Breakfast a significant number of qualified teachers were \"limping from one temporary contract to another\".She said: \"We receive regular correspondence from people in that situation in utter despair. \"They are unable to secure permanent jobs, it impacts on them financially but it also impacts on them emotionally and psychologically as well. \"It's really concerning the number of them who talk about having to leave the profession entirely because they cannot afford to live their lives in that insecure way.\" She said, at the same time, teachers with permanent positions were so overworked they were having to work on average a \"day-and-a-half extra unpaid\".Louise FraserLouise Fraser moved to Dubai as she could not find a teaching job in ScotlandShe added that while funds had been given to local authorities to employ extra teachers, a \"large number\" of councils had not used the money for that purpose because \"they argue they are otherwise incredibly strapped for cash\". \"There's a real funding crisis here and a lack of strong enough collaboration  between national and local government to solve problems like this one,\" she added.The Scottish government said it was providing £186.5m to local authorities in 2025-26 with the aim of restoring teacher numbers to 2023 levels.Education Secretary Jenny Gilruth told the programme she recognised the challenges but said figures from December had shown a rise in teacher numbers of 63, the first increase since 2022.\"We do need to remember that teachers are now much more expensive to employ than they were back in 2021,\" she told Radio Scotland Breakfast.\"We do think meeting demands in terms of the teaching unions' expectations on pay was the right thing to do, but it has cost the government in excess of £800m.\"Gilruth said it was not a \"flat picture\" across regions and subjects. \"We are desperate for maths teachers,\" she said.She said extra posts created in response to Covid may have allowed people to get jobs locally, but that teachers may now have to travel further afield.\"I wonder to what extent people are opting not to travel to jobs, in ways that they might have previously, because for example we created those posts during the pandemic,\" she said.\"You're not guaranteed a job on qualification - you have to go out there and look for one, you have to apply to a range of different local authorities.\"Gilruth accepted the current situation was \"not good enough\" and said the government and local authorities had to work together to fix it. Cosla, the body which represents councils, said: \"Currently councils are experiencing recruitment challenges for specific subjects (e.g. maths, physics and others) and in specific geographical areas.\"In areas where there are more teachers seeking employment than there are permanent teacher vacancies there may be only temporary roles (eg maternity cover) or supply work (eg cover for sickness absence) available, however, we offer permanent employment when permanent vacancies arise.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Teachers on supply list for years or leaving country due to job shortages",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dddf/live/b861b3a0-f2f7-11f0-b4d0-a5f4a003a8e3.jpg"
      ],
      "datePublished": "2026-01-19T09:49:28.000Z",
      "dateModified": "2026-01-19T09:49:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]