[
  {
    "title": "F1 Q&A: Norris and Tsunoda incident, Hamilton, Verstappen, Red Bull and overtaking",
    "url": "https://www.bbc.com/sport/formula1/articles/ckgdjw10rz1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d242/live/0ff79f40-d4de-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-09T12:06:29.000Z",
    "description": "Hamilton's struggles and ranking Verstappen's 2025 - Q&AMcLaren's Lando Norris is the 2025 world champion after he finished third at the Abu Dhabi Gra",
    "body": "Hamilton's struggles and ranking Verstappen's 2025 - Q&AMcLaren's Lando Norris is the 2025 world champion after he finished third at the Abu Dhabi Grand Prix.The 26-year-old is the 11th British world champion in Formula 1.Max Verstappen won the race but finished two points behind Norris in the standings, while Oscar Piastri finished second at the Yas Marina Circuit and ended his season in third overall. After the season finale, BBC F1 correspondent Andrew Benson answers your latest questions.Is Lewis Hamilton staying in F1 too long and damaging his reputation, just like Michael Schumacher did when returning with Mercedes? - MartinHamilton has had a very difficult season for Ferrari, however you look at it.He has been comprehensively out-performed by team-mate Charles Leclerc in both qualifying and races, and he has failed to score a podium finish for the first time in his career.Most observers felt that Hamilton might find it difficult to adapt to Ferrari, and that Leclerc would provide a stiff challenge. But few will have expected Hamilton to struggle the way he has.Hamilton's belief seems to be that the issue is a combination of the difficulty of adapting to an unfamiliar car in a new environment in a unique team, and the fundamental disconnect he has felt with the generation of cars that is now consigned to the bin.The 2026 cars promise to be different in many ways, especially in terms of power-units and energy management, but in one potentially important factor they are a return to the cars in which Hamilton excelled.The fundamental aerodynamic philosophy is a return to so-called 'step-plane' cars, with a flat bottom either side of the central chassis reference plane, with a diffuser at the back.This type of car gelled much more naturally with Hamilton's driving style, which is to brake late and use the change in aerodynamic pressure to help rotate the car into the corner.Few - if any - were as good as him at balancing extreme braking with corner entry speed without compromising the exit.So, yes, there are inevitable and justifiable questions as to whether Hamilton's struggles to adapt have anything to do with age - he is 40, after all. But it would be unfair and unwise not to wait until next season before jumping to conclusions.Was it virtually impossible for the stewards to give any kind of penalty to Lando Norris for the Yuki Tsunoda incident in Abu Dhabi? - Danny The stewards at the Abu Dhabi Grand Prix were clear in their reasoning for penalising Tsunoda and not penalising Norris in the incident in which the Briton's McLaren went off track in passing the Red Bull.It was all applied according to the rules.Tsunoda was penalised for making more than one move in defence - weaving, as it is known.And while Norris technically broke the rule that forbids overtaking off track, he was deemed to have been forced there by Tsunoda.The stewards' report said that he had ended up there because Tsunoda \"made multiple moves defending his position\".It added: \"Had (Tsunoda) not made those moves, (Norris) would have overtaken without going off track, but (he) moved off track to avoid contact\".The FIA driving standards guidelines \"provide that if a car is 'forced off' (which was effectively what occurred here) it is not considered to have exceeded track limits\".It has to be said that Tsunoda did not do an especially good job, from the perspective of Red Bull, of holding up Norris.Such was the tyre offset between the two cars, Norris was always going to find passing on the straight relatively easy.But if Tsunoda had driven with more calculation, he could have measured his pace to ensure Norris caught him at the start of the final part of the track around the marina, where overtaking is impossible.Doing that, he could have delayed Norris a significant amount through that section before being passed.Media caption, 'Winning made everything worth it' - Norris on F1 title and what's to come in the futureWhile we were talking about McLaren almost throwing away the drivers' championship for different reasons, surely by Red Bull not having a decent number two driver, who would have taken points off both McLaren drivers, you could argue that this cost Max Verstappen the title. - BillIt's a fair point, but also a debatable one.Red Bull are in a difficult position.In Max Verstappen, they have someone who many - if not most - regard as the best racing driver in the world. Certainly, that's what Red Bull think.So they are probably working from the principle that whoever they signed alongside him is unlikely to be able to beat him over a season, and would not find it easy to get close to him.Daniel Ricciardo left the team at the end of 2018 because he felt things had swung too much towards Verstappen. Partly in terms of the way the team operated. But also, almost certainly, because he could see the trend line of performance between the two of them was only going one way.Since then, Red Bull have been looking for a driver of a similar sort of level.Pierre Gasly and Alex Albon fell short at the team, but have gone on to have very solid careers elsewhere.Sergio Perez's status was pretty much established before he even got into a Red Bull, so it was no surprise he could not get close to matching Verstappen.He proved handy in the Abu Dhabi showdown in 2021, by delaying Lewis Hamilton enough that when the critical late safety car came out, Hamilton did not have a gap large enough to pit for fresh tyres without losing the lead.But Perez would likely have been of no significant help this season, judging by his average performance deficit to Verstappen over his time at Red Bull and the gaps between the front-running cars.Then you're looking at the next level of driver up. Red Bull could have signed Carlos Sainz for this season, for example. They chose not to because they felt it would disrupt the team dynamic.And as much as a driver of that calibre would likely have got in the mix with the McLarens, he would also likely have taken points away from Verstappen, in the same way the McLaren drivers took points from each other.On top of that, the Red Bull has been a difficult car this season, and perhaps only a very few drivers other than Verstappen could have got a tune out of it.Joining Stirling Moss, Jim Clark, Alain Prost and Lewis Hamilton in being a driver with the most victories in a season without winning the championship, where does Max Verstappen's 2025 performance rank in terms of seasons without winning the title? - AlanAny topic like this is always going to be subjective.There are a number of examples of drivers who arguably, on merit, should have won the title but didn't.Stirling Moss in 1958, Niki Lauda in 1976, Gilles Villeneuve in 1979, Ayrton Senna in 1989 and Lewis Hamilton in 2007 are just some of the years up for discussion.Arguably the peak example of this was Fernando Alonso in 2012, when he drove a season of remarkable consistency and excellence to keep a Ferrari that was on average the fourth fastest car in the title fight until the final race.He ended up losing out to Red Bull's Sebastian Vettel. But had only one of two incidents for which he was entirely blameless not happened, he would easily have been champion.He was taken out by the cartwheeling Lotus of Romain Grosjean at the start in Belgium, and his tyre was punctured by the other Lotus driver Kimi Raikkonen into the first corner in Japan.There is no doubting Verstappen's excellence this season. How his year has compared with Alonso's then is a matter for debate, but his Red Bull was certainly more competitive than that Ferrari.As for Verstappen himself, he says he has \"no regrets\" about his season.\"I've hated this car at times,\" he said in Abu Dhabi, \"but I've also loved it at times. I always tried to extract the most from it, even in the difficult weekends that we've had.\"Luckily, the last, I would say, eight, nine rounds in general have been a lot more enjoyable. And also, in the team, we have a great atmosphere. We're really on a roll - positive energy, belief, confidence - and that's exactly what you want heading into next year.\"Of course, shame to miss out on the title, but at the same time, for a long period of time I was not even thinking about the title. I never felt like I was in it until a few rounds ago. That's pretty crazy.\"You take your pride in different ways. I'm happy with myself, and going into next year I'm not in a state of having to worry about my skills or whatever.\"Media caption, 'That's life' - Verstappen and Piastri react to missing out on F1 titleThe phrase \"it's difficult to overtake at xxxx race track\" seems to be getting more and more common. Should F1 be dropping the worst tracks or incentivising tracks to amend their layouts to provide overtaking opportunities? - SteveWith a few exceptions, it is primarily the nature of the cars that has restricted overtaking in recent years rather than circuits.When the regulation cycle that ends this year was introduced, the aim was to make overtaking easier and racing closer.The field has definitely closed up, but any effect on overtaking has been negligible. Drivers agree that it was marginally better in the first year of the regulations, 2022, but has become increasingly worse ever since.That's because the cars have become more sophisticated, and have developed more and more downforce. And the more downforce, the more disruption from the car in front.The theory behind this set of rules - that controlling the wake created by a car and trying to direct it away from cars behind will make it easier to follow - has, at best, not been proven. At worst, it has been debunked.Another factor in overtaking is tyres. Pirelli's rubber has improved significantly this year in terms of durability, but the tyres are still prone to overheating when drivers follow other cars closely. And once they overheat, they lose grip, and bang goes the chance of overtaking.There's also the question of whether governing body the FIA has always made the right calculations about the length of the zones in which drivers can use the DRS overtaking aid. Which some would say has not always been the case.Will next year's cars be better?They have a push-to-pass button that actives extra electrical energy instead of DRS, because both the front and rear wings will be moveable to decrease drag on straights.But there are so many questions about how next year will be that it's impossible to know the answer.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "F1 Q&A: Norris and Tsunoda incident, Hamilton, Verstappen, Red Bull and overtaking",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d242/live/0ff79f40-d4de-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-09T12:06:29.000Z",
      "dateModified": "2025-12-09T12:06:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Poison Water",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002mshv?at_mid=hccWjMbQd4&at_campaign=Poison_Water&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002mshv&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Poison_Water&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mgrl3w.jpg",
    "tag": "Trending",
    "date": "2025-11-26T06:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomePoison WaterPoison WaterWhen tap water turns toxic in Cornwall, a public health disaster leads to accusations of a cover-up and the search for the truth. The story of Britain’s biggest mass poisoning. Duration1h 18mFirst shown9pm 26 Nov 2025Available for 11 monthsWatchlistAudio DescribedSign Language",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Poison Water",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mgrl3w.jpg"
      ],
      "datePublished": "2025-11-26T06:00:00.000Z",
      "dateModified": "2025-11-26T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fake Friend: The Ticket Scammer",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002mqln?at_mid=9pXmYM2YdU&at_campaign=Fake_Friend_The_Ticket_Scammer&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002mqln&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Fake_Friend_The_Ticket_Scammer&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mglzv5.jpg",
    "tag": "Trending",
    "date": "2025-11-23T06:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeFake Friend: The Ticket ScammerFake Friend: The Ticket ScammerContains strong language.How a Somerset high-flyer turned his charm and connections into tools of deception – conning his school friends and hundreds of others while living a life of glamour himself. Duration59 minsFirst shown23 Nov 2025Available for over a yearWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesThe Man in the Mask: An Orkney MurderFull of jaw-dropping twists. A waiter, shot dead. The suspect, a schoolboy. Did he do it?Matthew Perry and the Ketamine QueenFrom fame to fatal addiction. A shocking death, and the woman at the centre of the case59 minsBehind Bars: Sex, Bribes and MurderInside an illicit prison economy – fuelled by coercion and contrabandDating Apps: The Inside StorySeduced or snared by the swipe? Digital dating's big business, but what's the human cost?57 minsConfessions of a Teenage FraudsterThe story of Elliot Castro, a call centre worker who started a five-year crime wave at 16The Black SwanWho's lying to who? A lawyer with ties to the criminal underworld becomes a moleEye InvestigationsWho is flooding West Africa with dangerous opioids? BBC Eye goes undercover to find out.49 minsBlackmailed: The Sextortion KillersA sinister online underworld, and the devastating impact on its victims and families1hMen of the ManosphereAdvice and inspiration, or spite and scorn? How online communities are shaping real lives58 minsLorry Crime ExposedAn investigation into the organised gangs targeting goods transported by lorry.29 minsCrimewatch CaughtI Thought Mum Was Safe. The quest to find justice after the tragic murder of a mother29 minsThe Holiday SwindlerThe trick of a lifetime. The travel agent whose dream holidays turned into a nightmare23 mins",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fake Friend: The Ticket Scammer",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mglzv5.jpg"
      ],
      "datePublished": "2025-11-23T06:00:00.000Z",
      "dateModified": "2025-11-23T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Has Trump just made the US/Europe breakup official? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mmd6pc?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-12-08T20:43:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·08 Dec 2025,·34 minsHas Trump just made the US/Europe breakup official?AmericastAvailable for over a yearHas the Trump administration just said the quiet part out loud? After months of speculation about what the U.S. really thinks about Europe, the Trump administration has published an excoriating 33-page National Security Strategy. It warns Europe faces \"civilisational erasure\" over migration and EU integration policies, \nand questions whether certain nations can remain reliable allies.  Sarah, Anthony and Justin analyse its significance and what it means for Europe.   \nAlso, Anthony was with Trump in the Oval Office on Saturday night - he tells us why and who else was there.   \nSecretary of War Pete Hegseth has doubled down on the administration's strikes against alleged drug boats in the Caribbean Sea, likening them to Al Qaeda. \nPlus, what’s been the reaction to Donald Trump becoming  the first ever recipient of the FIFA peace prize? Americast unpacks what ordinary Americans think.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Has Trump just made the US/Europe breakup official? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-12-08T20:43:00.000Z",
      "dateModified": "2025-12-08T20:43:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Trump v Europe? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mmctzz?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-08T19:26:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·08 Dec 2025,·38 minsAvailable for over a yearToday, we discuss President Trump’s new vision for global security, one that is creating a lot of criticism in Europe.\nThe 33-page document called the National Security Strategy suggests Europe is facing \"civilisational erasure\" and does not cast Russia as a threat to the US. Russia says the strategy is “largely consistent” with their vision.\nSecurity correspondent Frank Gardner and former UK ambassador to the US Lord Kim Darroch join Adam to discuss what this means for Europe.\nPlus, we discuss what has happened in Syria a year after former President Bashar al-Assad was overthrown. Adam chats with Mina Al-Lami from BBC Monitoring.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Adam Chowdhury. The social producer was Gabriel Purcell-Davis. The technical producer was Dafydd Evans. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Trump v Europe? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-08T19:26:00.000Z",
      "dateModified": "2025-12-08T19:26:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Covid scheme fraud hit £10.9bn but much 'beyond recovery', report says",
    "url": "https://www.bbc.com/news/articles/c075vjxyx3no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/314b/live/19734010-d4e8-11f0-8201-6f38778c63b1.jpg",
    "tag": "Trending",
    "date": "2025-12-09T12:16:53.000Z",
    "description": "11 minutes agoNick EdserBusiness reporterMuch of the £10.9bn in taxpayer money lost to fraud and error in Covid support schemes is now \"beyond recover",
    "body": "11 minutes agoNick EdserBusiness reporterMuch of the £10.9bn in taxpayer money lost to fraud and error in Covid support schemes is now \"beyond recovery\", a report has said.The response to the pandemic had led to \"enormous outlays of public money which exposed it to the risk of fraud and error\" with many organisations unprepared, the Covid Counter Fraud Commissioner, Tom Hayhoe, said.Employment support schemes set up by the previous Conservative government, including furlough and help for the self-employed, suffered £5bn of fraud, the report found.Many of the support measures were credited with propping up the economy throughout the Covid lockdowns. However, Mr Hayhoe said the \"outrage\" at fraud, abuse and error was  \"undiminished\".Mr Hayhoe had been asked by Chancellor Rachel Reeves to investigate the amount of public money lost to fraud given his experience in procurement as the former chair of an NHS trust.Of the total estimated amount lost to fraud and error, the report said £1.8bn had been recovered, although: \"Much of the shortfall is now beyond recovery.\"However, it added that there were still areas \"where investing in recovering money paid out incorrectly is worthwhile and work should continue\".The report said weak accountability, bad quality data and poor contracting were among the main reasons for the losses.Most public bodies were unprepared for \"a crisis that required spending on such a scale and with such urgency\".\"Consequently, some measures to protect against potential fraud were inadequate.\"This applied to the procurement of Personal Protective Equipment (PPE) where the volume of orders \"overwhelmed the newly created supply chain and involved measures that invited mistrust, opportunism and profiteering\".It found £13.6bn was spent on PPE procurement, with 38 billion items purchased - although 11 billion were unused by 2024. Losses were estimated at £10bn from over-ordering and £324m of fraud.The support for small businesses was also criticised, where \"lending relied on self-certification with inadequate checks to prevent abuse\".It said the design of the Bounce Back Loan Scheme \"created specific vulnerabilities to fraud and error\", with the programme estimated to have incurred fraud and error losses of up to £2.8bn.The report noted that the need to design and implement support quickly for businesses came with risks.\"It was accepted in many schemes that the rapid design entailed accepting a high level of fraud risk, without plans for managing or mitigating this risk.\"Responding to the report, Chancellor Rachel Reeves said: \"Leaving the front door wide open to fraud has cost the British taxpayer £10.9bn - money that should have been funding our public services, supporting families, and strengthening our economy.\"We have started returning this money to the British people and we will leave no stone unturned in rooting out the fraudsters who profited from pandemic negligence.\"In September the government launched a voluntary repayment scheme for people and businesses to return pandemic scheme money with no questions asked until the end of December.A previous report from Mr Hayhoe had found that pandemic-era PPE contracts cost the British taxpayer £1.4bn on undelivered contracts and unusable gowns, masks and gloves. Only a small fraction of that - £400m - has been recovered.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Covid scheme fraud hit £10.9bn but much 'beyond recovery', report says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/314b/live/19734010-d4e8-11f0-8201-6f38778c63b1.jpg"
      ],
      "datePublished": "2025-12-09T12:16:53.000Z",
      "dateModified": "2025-12-09T12:16:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Two charged over Heathrow Airport 'pepper spray' attack",
    "url": "https://www.bbc.com/news/articles/cdxeql929dgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8100/live/cbb976c0-d4f9-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-12-09T11:21:33.000Z",
    "description": "1 hour agoJess WarrenLondonPA MediaThe incident resulted in the partial closure of the Central Terminal Area tunnel and the Terminal 3 car parkTwo men",
    "body": "1 hour agoJess WarrenLondonPA MediaThe incident resulted in the partial closure of the Central Terminal Area tunnel and the Terminal 3 car parkTwo men have been charged in connection with a suitcase robbery where what is thought to be pepper spray caused injuries at London's Heathrow Airport.Tyrone Richards, 31, and Anton Clarke-Butcher, 24, have both been charged with two counts of robbery and two counts of administering a noxious substance, HM Courts and Tribunal Service staff said.The charges follow an investigation into an assault at the multi-storey car park at Terminal 3 on Sunday. Prior to the attack, two women were robbed of their suitcases after getting out of a car park lift, police said.A three-year-old girl was among those injured during the incident. Five people went to hospital for treatment and were later discharged.Mr Richards, of no fixed address, and Mr Clarke-Butcher, of Mantlet Close, Streatham, are due to appear at Uxbridge Magistrates' Court on Tuesday.On Monday, the Met Police said it had also arrested a woman, 23, on suspicion of conspiracy to commit robbery. She was later released on bail pending further inquiries. A second woman, 57, was arrested on suspicion of conspiracy to commit robbery. She was subsequently released under investigation.Another man, 31, was arrested on Monday on suspicion of affray. He remains in custody, police said.The incident - which the Met said was isolated and not being treated as terrorism - resulted in train delays and the partial closure of the Central Terminal Area tunnel and the Terminal 3 car park for a short time.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two charged over Heathrow Airport 'pepper spray' attack",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8100/live/cbb976c0-d4f9-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-12-09T11:21:33.000Z",
      "dateModified": "2025-12-09T11:21:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Philadelphia Eagles Jalen Hurts loses ball twice on same play in defeat by LA Chargers",
    "url": "https://www.bbc.com/sport/american-football/articles/cqlkzk49774o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e63/live/cfdbf3f0-d4d0-11f0-869b-9329731c64cd.jpg",
    "tag": "Trending",
    "date": "2025-12-09T06:51:34.000Z",
    "description": "Philadelphia Eagles quarterback Jalen Hurts bizarrely lost the ball twice during the same play as the reigning Super Bowl champions slumped to a third",
    "body": "Philadelphia Eagles quarterback Jalen Hurts bizarrely lost the ball twice during the same play as the reigning Super Bowl champions slumped to a third successive defeat on Monday. The incident happened in the second quarter when Hurts was intercepted by the Los Angeles Chargers' Da'Shawn Hand. The defensive linesman then fumbled the ball and Hurts gathered it up, only to then lose the ball again when he was tackled.Reports from the US indicate it is the first time since records of this nature began in 1978 that a player has turned the ball over twice on the same play.It was a chastening game for Hurts who threw a career-high four interceptions at the SoFi Stadium in California, the final one coming when Tony Jefferson picked off a pass at the one-yard line to end the game in overtime.Cameron Dicker had earlier kicked what turned out to be the game-winning 54-yard field goal in the extra period - matching his career-high five field goals in a single game - as the Chargers won 22-19.Chargers quarterback Justin Herbert, who played after undergoing surgery on a fractured hand on 1 December, completed 12 of 26 passes for 139 yards.A fifth victory in their past six outings leaves the Chargers second in the AFC West, while the Eagles remain top of the NFC East.Both sides return to action on 14 December at 20:00 GMT, with the Chargers travelling to the Kansas City Chiefs and the Eagles hosting the Las Vegas Raiders.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Philadelphia Eagles Jalen Hurts loses ball twice on same play in defeat by LA Chargers",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e63/live/cfdbf3f0-d4d0-11f0-869b-9329731c64cd.jpg"
      ],
      "datePublished": "2025-12-09T06:51:34.000Z",
      "dateModified": "2025-12-09T06:51:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "EU investigates Google over AI-generated summaries in search results",
    "url": "https://www.bbc.com/news/articles/crl95eg33k1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1308/live/968a9a60-d4f4-11f0-ad89-6340086573f4.jpg",
    "tag": "Trending",
    "date": "2025-12-09T11:48:37.000Z",
    "description": "40 minutes agoLiv McMahonTechnology reporterThe EU has opened an investigation into Google over its artificial intelligence (AI) summaries which appea",
    "body": "40 minutes agoLiv McMahonTechnology reporterThe EU has opened an investigation into Google over its artificial intelligence (AI) summaries which appear above search results.The European Commission said it would examine whether the firm used data from websites to provide this service - and if it failed to offer \"appropriate compensation\" to publishers.It is also investigating how YouTube videos may have been used to improve its broader AI systems, and whether content creators were able to opt-out.A Google spokesperson said the probe \"risks stifling innovation in a market that is more competitive than ever\".\"Europeans deserve to benefit from the latest technologies and we will continue to work closely with the news and creative industries as they transition to the AI era,\" they said.The EU's investigation will also cover Google's AI Mode, which gives people an answer in a conversational style with some links to other pages.It is in addition to the tech giant's existing search platform - providing an experience similar to its rivals such as ChatGPT.What is AI and how does it work?Google's introduction of its AI Overview summaries was met with concerns it could result in fewer visitors to websites.Without people clicking on web pages, sites generate less money from advertising.The Daily Mail previously claimed the number of people who clicked its links from Google search results fell by around 50% since Google introduced its AI Overview feature.The Commission said it was concerned both web publishers and YouTube video creators were not being compensated or given the opportunity to opt-out of their content being used to train the company's AI models.Ed Newton-Rex from AI fairness campaigners Fairly Trained said it was \"career suicide\" for people to not publish their work on YouTube or online.He told the BBC Google \"essentially makes it a condition\" of online publishing that the firm can \"use your work to build AI that competes with you\".\"This investigation could not come at a more critical time for creators around the world,\" he said.The Commission's investigation comes down to whether Google has used the work of other people published online to build its own AI tools which it can profit from.Its generative AI systems are capable of producing text, images and video in seconds, in response to simple text prompts.Many firms can now do this - and they have used huge volumes of online web content to train their underlying systems.But creatives have voiced concern their work may have formed the basis for big tech's AI products and outputs, at the expense of their own rights or livelihoods.\"A free and democratic society depends on diverse media, open access to information, and a vibrant creative landscape,\" said Commission executive vice-president Teresa Ribera.She said AI was ushering in \"remarkable innovation\" and \"many benefits for people and businesses\" - but its growth should not come at the cost of the EU's values.But the Commission's recent enforcement of its tough digital rules - which can see tech companies face huge fines if they found to be breaching them - has been met with outrage from US lawmakers.Elon Musk's platform X axed the Commission's account for placing adverts on the site, after the EU brandished a €120m (£105m) fine over its blue verification badges.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "EU investigates Google over AI-generated summaries in search results",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1308/live/968a9a60-d4f4-11f0-ad89-6340086573f4.jpg"
      ],
      "datePublished": "2025-12-09T11:48:37.000Z",
      "dateModified": "2025-12-09T11:48:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Parking fines issued after disabled bay painted around car",
    "url": "https://www.bbc.com/news/articles/c1dzqpyqegeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/07cd/live/e4b20f80-d467-11f0-a892-01d657345866.png",
    "tag": "Trending",
    "date": "2025-12-09T01:23:30.000Z",
    "description": "11 hours agoWatch: PCNs issued after disabled bay painted around carA man received four parking tickets when a disabled bay was painted around his leg",
    "body": "11 hours agoWatch: PCNs issued after disabled bay painted around carA man received four parking tickets when a disabled bay was painted around his legally parked car while he was away on holiday.CCTV footage shared on social media shows a contractor measuring and painting the bay, after the owner, who did not wish to be named, had left his car on an unrestricted road outside his home.A total of four penalty charge notices (PCNs) were placed on the car between 22 and 26 November following the construction of the bay on 17 November in New Addington, south London.Croydon Council \"apologised for the confusion\" and confirmed that \"the tickets were cancelled a week before the video was uploaded to social media\".'No prior notification'The vehicle owner told BBC London: \"It really put a damper on my holiday because I kept checking [the camera] to see what was wrong and there was nothing I could do.\"I didn't want to go out and do the things I wanted to do because I was worried about the amount of tickets I was accumulating.\"After he got back from his travels, he saw he had two tickets on his windscreen and that a further two had been removed by an unknown individual.The disabled bay was put in place in response to a request from a resident.While the owner agrees the disabled bay itself is important, he criticised the council's lack of notification before its creation, saying: \"It's the same as doing an extension or any other road work - you let people know.\"Without any communication with your community, that's the wrong way to do it.\"'Snowball of wrongdoing'The video shows the contractor photographing the car after the painting is complete to alert the council not to issue a fine.However, a parking attendant later placed tickets on the vehicle on separate days, as she was not made aware of the situation.The man decided to share the footage on social media after facing a backlash on Facebook from residents who believed he had parked in the bay knowing he was not supposed to.He said: \"It really upset me. I just thought, 'Why are you looking at me as the bad guy?' \"But I do understand, somebody obviously didn't know that I parked there before the bay was drawn.\"He added that he had never had direct confirmation from the council that the PCNs in relation to the new bay were cancelled.\"Nothing in writing. Only a comment from them on the video,\" he said.\"I think the issue here is because there was no communication in the beginning, there has been a snowball effect of wrongdoing.\"'Online abuse'The council said contractors painting the bay around the car was \"standard practice\" to avoid delays, explaining: \"Otherwise they would have to wait for the space to be free, which may have taken weeks.\"A council spokesperson said: \"Unfortunately one of our parking attendants was not informed and issued parking tickets. \"However, these were not processed into fines because we had a note on the system from our contractor.\"The council added that its car parking attendant had suffered abuse online after the video and asked that \"residents with concerns contact us directly and not abuse staff carrying out their duties\".More related to this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Parking fines issued after disabled bay painted around car",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/07cd/live/e4b20f80-d467-11f0-a892-01d657345866.png"
      ],
      "datePublished": "2025-12-09T01:23:30.000Z",
      "dateModified": "2025-12-09T01:23:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man, 28, accused of raping two teenage girls in Bolton",
    "url": "https://www.bbc.com/news/articles/cd9zygpn81jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6d9e/live/438ffc20-d4ee-11f0-9abd-ef7d7ff2dab9.png",
    "tag": "Trending",
    "date": "2025-12-09T11:08:15.000Z",
    "description": "A man has been charged with the rape of two teenage girls in Bolton over the weekend.Sultani Bakatash, 28, is due before Manchester and Salford Magist",
    "body": "A man has been charged with the rape of two teenage girls in Bolton over the weekend.Sultani Bakatash, 28, is due before Manchester and Salford Magistrates' Court accused of sexual offences against two 14-year-old girls.Greater Manchester Police (GMP) said the man was an Afghan national and had been arrested in the early hours of Sunday following a report of rape at a flat in Middle Hulton.Under national guidelines police can release details about nationality, but GMP did not specify a reason for doing so in this case.The force said the defendant had self-defined their ethnicity as 'any other'. It added criminal proceedings were active and urged the public not to speculate while investigations continued.GMP said the suspect had been charged with two counts of rape of a girl aged under 16, one count of sexual assault and one count of assault by penetration.It is alleged the suspect had previously been in online contact with the girls before meeting them.Both are being supported by specialist teams as officers continue to investigate the full circumstances.GMP said it was not looking for anyone else in connection with this incident.Ch Supt Helen Critchley, Bolton district commander, said: \"This is a deeply concerning report, and our priority is supporting the two young girls and their families at this traumatic time.\"We have acted quickly since this was reported to us in the last 48 hours, and we've been using all available resources to understand what has happened and help this case progress through court.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man, 28, accused of raping two teenage girls in Bolton",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6d9e/live/438ffc20-d4ee-11f0-9abd-ef7d7ff2dab9.png"
      ],
      "datePublished": "2025-12-09T11:08:15.000Z",
      "dateModified": "2025-12-09T11:08:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celtic legend John 'Dixie' Deans dies aged 79",
    "url": "https://www.bbc.com/sport/football/articles/cy5g01yr6qeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dda0/live/d08a9690-d4e8-11f0-8201-6f38778c63b1.jpg",
    "tag": "Trending",
    "date": "2025-12-09T11:20:58.000Z",
    "description": "Celtic legend John 'Dixie' Deans has died aged 79.Capped twice by Scotland, Deans was a prolific goalscorer for both Motherwell and Celtic in the 1960",
    "body": "Celtic legend John 'Dixie' Deans has died aged 79.Capped twice by Scotland, Deans was a prolific goalscorer for both Motherwell and Celtic in the 1960s and 1970s, winning six major honours with the latter.He started his career with Neilston Juniors and was nicknamed after former Everton and England striker Dixie Dean for his scoring feats, which included 60 in one season.A move to Motherwell followed in 1965, where he continued to find the back of the net regularly - 89 times in 198 appearances - and won the Second Division title in 1968-69.He picked up several red cards during his time at Fir Park, but Celtic boss Jock Stein was not deterred from bringing Deans to Celtic in 1971, following the surprise 4-1 League Cup final defeat by Partick Thistle.His discipline improved, but the scoring streak remained as Deans combined with fellow forward Kenny Dalglish to great effect.He scored a hat-trick in the 1972 Scottish Cup final and the 1974 League Cup final, both in victories against Hibernian, but is also remembered for missing the crucial penalty in Celtic's 1972 European Cup semi-final shootout loss against Inter Milan.Deans moved to Luton Town in 1976, having scored 124 goals in 184 appearances in green and white.Further spells with Adelaide United, Carlisle United and Partick Thistle followed before he retired from playing in 1980.In a statement, Motherwell said: \"Deans will be remembered fondly for his exquisite goalscoring form at Fir Park. \"He passes away aged 79 years old, and our thoughts are with his family and friends during this incredibly sad time.\"Rest in peace, Dixie.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celtic legend John 'Dixie' Deans dies aged 79",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dda0/live/d08a9690-d4e8-11f0-8201-6f38778c63b1.jpg"
      ],
      "datePublished": "2025-12-09T11:20:58.000Z",
      "dateModified": "2025-12-09T11:20:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UN environment report 'hijacked' over fossil fuels - top scientist",
    "url": "https://www.bbc.com/news/articles/c1w9ge93w9po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2687/live/dbd59910-d456-11f0-9aed-598bbb04d197.jpg",
    "tag": "Trending",
    "date": "2025-12-09T09:00:09.000Z",
    "description": "UN environment report 'hijacked' by US and others over fossil fuels, top scientist says3 hours agoMatt McGrathEnvironment correspondentGetty ImagesA k",
    "body": "UN environment report 'hijacked' by US and others over fossil fuels, top scientist says3 hours agoMatt McGrathEnvironment correspondentGetty ImagesA key UN report on the state of the global environment has been \"hijacked\" by the United States and other countries who were unwilling to go along with the scientific findings, the co-chair has told the BBC.The Global Environment Outlook, the result of six years' work, connects climate change, nature loss and pollution to unsustainable consumption by people living in wealthy and emerging economies.It warns of a \"dire future\" for millions unless there's a rapid move away from coal, oil and gas and fossil fuel subsidies.But at a meeting with government representatives to agree the findings, the US and allies said they could not go along with a summary of the report's conclusions.As the scientists were unwilling to water down or change their findings, the report has now been published without the summary and without the support of governments, weakening its impact.Researchers say the objections to this new report reflect similar concerns expressed by countries at the recent COP30 talks.The BBC has approached the relevant US government departments for comment.Issued every six or seven years, the Global Environment Outlook is a significant scientific analysis of the major threats to the planet.Developed under the auspices of the UN, the normal practice for studies like this is to have the key conclusions and recommendations agreed word by word with governments and published as a \"summary for policymakers\".These summaries are seen as critical because they show that governments agree with the science and are prepared to put the findings into action.But this new version of the Global Environment Outlook does not have this type of summary, as the authors and the political representatives of around 70 countries could not agree one at a \"stormy\" meeting in Nairobi in October.Compiled by nearly 300 scientists worldwide, the report argues that the food we eat, the clothes we wear, and the energy we consume all involve the extraction of resources in a highly unsustainable manner.To solve the connected issues of climate change, pollution, nature and biodiversity loss, the report has many recommendations including a rapid move away from coal, oil and gas and a massive reduction in subsidies for farming and fossil fuels.The authors acknowledge this type of action will drive-up prices for consumers.But that short term pain will bring long term economic benefits for the whole world, the report says.These strong measures, especially on fossil fuels and plastics, were too much for the United States, Saudi Arabia and Russia among others at the approval meeting, which usually work by consensus.Getty ImagesSir Robert Watson is co-chair of the report\"A small number of countries basically just hijacked the process, to be quite honest,\" Prof Sir Robert Watson told BBC News.\"The US decided not to attend the meeting at all. At the very end they joined by teleconference and basically made a statement that they could not agree with most of the report, which means they didn't agree with anything we said on climate change, biodiversity, fossil fuels, plastics and subsidies.\"Sir Robert is one of the world's most respected scientific voices. He's a former chief scientist for the UK's department of the environment and has also been chair of the Intergovernmental Panel on Climate Change (IPCC), as well as working for the World Bank and Nasa.However he has had rows with the US in the past, criticising their decision to leave an earlier climate treaty, the Kyoto Protocol, when he was head of the IPCC. He was ousted from that role in 2002 after lobbying by the administration of President George W. Bush.Others present at the meeting agreed that the actions of the US and other countries \"derailed\" the process.\"I thought we had gone beyond the point of recognizing that when you burn oil, this big, thick black stuff comes up, and it probably isn't good, especially when you try and breathe it in,\" said Dr David Broadstock, with the Lantau Group, and one of the report's lead authors.\"It's kind of pretty obvious, and yet we're still seeing parties wanting to pursue the increasing scale of production of such things,\" he told BBC News.Since taking office President Trump has sought to boost fossil fuel production and roll back US commitments to fight climate change, calling for the country to be a global energy superpower with cheap and reliable resources. He has also sought to get the US courts to overturn the idea that carbon dioxide is a danger to public health.  His government has also followed up with efforts to restrict or limit the efforts of international bodies that set out to tackle warming.This year has seen efforts at international plastics negotiations, at the international maritime organisation and during COP30 to strike out language that states that climate change is a major issue requiring the world to move away rapidly from fossil fuels.The disagreement over the Global Environment Outlook report will raise concerns about future negotiations for the Intergovernmental Panel on Climate Change reports as these studies are seen as the bedrock of global efforts to limit global warming.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UN environment report 'hijacked' over fossil fuels - top scientist",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2687/live/dbd59910-d456-11f0-9aed-598bbb04d197.jpg"
      ],
      "datePublished": "2025-12-09T09:00:09.000Z",
      "dateModified": "2025-12-09T09:00:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bad H3N2 flu season: Should I buy a vaccine this year?",
    "url": "https://www.bbc.com/news/articles/crk7j8nxlr6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/537e/live/37987b50-d4e3-11f0-ad0f-1bf8c30d15bc.jpg",
    "tag": "Trending",
    "date": "2025-12-09T09:55:41.000Z",
    "description": "Flu season has come early - should you buy a vaccine this year?3 hours agoMichelle RobertsDigital health editorGetty ImagesFlu has come early this yea",
    "body": "Flu season has come early - should you buy a vaccine this year?3 hours agoMichelle RobertsDigital health editorGetty ImagesFlu has come early this year and experts predict it could be a particularly nasty season because a new strain of the virus is circulating. The H3N2 \"subclade K\" variant is a mutated strain of the seasonal influenza A virus and people have not encountered much of it in recent years. That means there is less built up immunity against it.The NHS has already sent out a \"flu jab SOS\" to vulnerable people. So, how bad might this winter be, and should you buy a flu jab even if you are generally fit and have to pay for it?Who needs a flu jab?The NHS offers a free flu vaccine to people who need it most, including: anyone aged 65 or overthose have certain long-term health conditionspregnant womencare home residentscarers for older or disabled people, or those who receive a carer's allowancepeople who live with someone who has a weakened immune systemFrontline health and social care workers can also get a flu vaccine through their employer. A nasal spray version of the flu vaccine is also offered to children aged 2 to 3 years as well as school-aged children (reception to year 11). Children can catch and spread flu easily. Vaccinating them also helps protect others who are at higher risk of getting seriously ill from flu.Everyone else has to buy one.Even if you are healthy, you might still want to buy a flu vaccine this winter. Vaccines still work against the drifted influenza A(H3N2) strain that some are calling \"super flu\".High street chemists sell the vaccine for around £20.It's best to get vaccinated sooner to protect yourself during winter.How long does it take for the vaccine to work?The vaccine usually takes up to 14 days to work.During this period, you're still vulnerable to catching the virus. Some people mistakenly think the vaccine has given them flu, but the vaccine does not cause flu - instead, it gives your body the instructions it needs to fight off an infection should you catch it.  There's still a chance you might get flu after getting vaccinated, but it's likely to be milder and not last as long.Protection decreases over time which is why a vaccine is offered every year. The vaccine is frequently updated to best match the strain or version of flu that experts expect will be circulating. Is it a cold, 'super flu' or Covid?There are lots of coughs and colds doing the rounds. So how do you know if you have flu rather than something else? Your symptoms can give a clue. ColdsSymptoms appear graduallyMostly affect nose and throatEarly sign - pressure in your earsChestier, mucus coughFluComes on suddenlyFeel wiped outFever, muscle aches, exhaustionNeed bed restDry coughCovidTypical flu symptomsLoss of taste or smellDiarrhoea or tummy upsetWhat else can I do to protect myself?If you're meeting people indoors, open a window for fresh air.Practise good hygiene:cough into your bent elbow, or use a tissue and dispose of it afterwards in the nearest binwash your hands frequently with warm water and soapclean your surroundings often, especially areas that are touched frequently such as door handlesIf you are unwell but must go out, consider wearing a face mask to help protect others. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bad H3N2 flu season: Should I buy a vaccine this year?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/537e/live/37987b50-d4e3-11f0-ad0f-1bf8c30d15bc.jpg"
      ],
      "datePublished": "2025-12-09T09:55:41.000Z",
      "dateModified": "2025-12-09T09:55:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]