[
  {
    "title": "Murder and MI5: the extraordinary battle over what stays secret",
    "url": "https://www.bbc.com/news/articles/c1w94v205y2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/121e/live/0b789990-faab-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-26T00:25:19.000Z",
    "description": "Murder and MI5: How an extraordinary battle erupted over what the state keeps secret16 hours agoDaniel De SimoneInvestigations correspondent BBCListen",
    "body": "Murder and MI5: How an extraordinary battle erupted over what the state keeps secret16 hours agoDaniel De SimoneInvestigations correspondent BBCListen to Daniel read this storyPaul Thompson was shot dead while being driven home in a taxi through Belfast in April 1994. He was murdered in a sectarian attack by loyalist paramilitaries who had set out to kill Catholics.The taxi driver was a friend who was collecting a fare at another address in the Springfield Park area in the west of the city. But no one at the address had rung the taxi firm. The call is suspected to have been a deliberate decoy by the killers who wanted to lure a taxi as prey. Paul was not specifically targeted. They could not have known he would ask for a lift or be in the area.One resident described hearing a heavy burst of gunfire after 23:00, running to the car and finding Paul.Members of a banned loyalist terror group, the Ulster Defence Association, using the cover name Ulster Freedom Fighters, claimed responsibility for the killing. During the Troubles in Northern Ireland, the group repeatedly murdered Catholic civilians like Paul.Family Handout/PA WireMembers of a banned loyalist terror group, the Ulster Defence Association, using the cover name Ulster Freedom Fighters, claimed responsibility for killing Paul, who was nicknamed TopperOn the morning of the day that Paul was killed, locals had told police about a hole in a barrier – known as the 'Peace Line' – which separated the largely Catholic Springfield Park area from a largely Protestant neighbouring area. The residents were concerned the breach could give loyalist paramilitaries access to launch an attack.The hole was not fixed. After the murder, those responsible escaped through it.An inquest into Paul's death was opened in 1995 but never concluded. No-one has ever been held to account. There has never been a full investigation.Left by themselves to fight for answers, his mother Margaret and brother Eugene, both now dead, came to suspect collusion between British security forces and informants – meaning state agents - in the group responsible.In 2024, a coroner decided to release to the family a summary of secret information held by the police. This was said by the coroner to be of central relevance to the case and the police supported the move. But the British government and MI5 argued this would prejudice national security and mounted a legal challenge.PA MediaPaul Thompson was killed by the UDA, which used the cover name of the Ulster Freedom FightersThe case, which centred on who had the power to decide to release the information, reached the Supreme Court last summer, with Paul Thompson's brother, Eugene, tuning in to hearings from a hospice, as he neared death from cancer.The case is widely viewed as a major test of the state's policy of neither confirming nor denying (NCND) information involving national security.Who decides what is secret?The NCND policy is a position adopted by the government and security services when responding to questions about sensitive matters. It means there will be no confirmation, no denial, and no acknowledgement that the information requested is true, false, or even exists.Eugene Thompson's barrister, Monye Anyadike-Danes KC, said the family had concluded the murder happened because the authorities were colluding with the \"very group that actually perpetrated the killing\". She said Eugene was \"trying to find out why his younger brother was murdered\" and felt a \"deep responsibility\".PA MediaEugene Thompson, who has since died, spent years trying to find out the truth about his brother's deathEugene, she added, believed the public should be able to trust that those who kill will be held accountable, especially when they are agents of the state. She asked the judges not to let the NCND policy be used to \"conceal the involvement of state parties in the killing of an ordinary citizen\".Just before Christmas, the court ruled that the government's assessment of damage to national security \"should have been accepted by the coroner\" unless it was plainly irrational or there was no supporting evidence.The justices found the coroner had failed to understand it was \"solely\" for the government to make submissions on national security, not the chief constable of the Police Service of Northern Ireland (PSNI), Jon Boutcher, who had argued for the release of the summary of police files.PA WireJon Boutcher argued for the release of the summary of police filesPaul Thompson's case is part of a battle over the truth and whether it can be told. The battle concerns official secrets, often connected to state agents, and it pits bereaved families and senior police officers against the government and the security service, MI5.It raises a profound question: can the state, especially when it is implicated in killing, be trusted as the arbiter of what should remain secret?The spycatcher who was himself a spyOther cases in the coming months will force these issues further into the spotlight – and they come at a time when MI5's integrity is under significant scrutiny.Yet the Supreme Court's ruling in the Thompson case creates a precedent that says the government and MI5 can withhold information from bereaved families, for national security reasons, even when the police want it to be disclosed.Grainne Teggart, from Amnesty International, described it as a \"grim day for truth\" and part of a pattern of \"national security being used as a shield to cover up and conceal the state's role in very serious crimes such as murder and other serious human rights violations.\"The government, by contrast, welcomed the court's \"unanimous judgment\".\"This is a highly complex case with wide-ranging implications,\" it said. \"The government will therefore take time to fully consider all aspects of this judgment.\"The Supreme Court's ruling in the Thompson case has created a precedentDuring the Troubles, the state made widespread use of informants, otherwise known as agents, who were tasked with carrying out actions and often paid. Agents existed in the IRA and in loyalist paramilitary groups. They were run by the police, the army, and MI5.The former Met Police chief Lord Stevens, who led UK government-commissioned investigations into collusion in Northern Ireland between the 1980s and 2000s, once said that of 210 people arrested during his enquiries, only three were not state agents.Collusion occurred in a number of ways, he said, ranging from the state withholding intelligence and evidence from investigators, to state agents being involved in murder. In some cases agents told the authorities in advance about planned attacks but nothing was done to stop them.One of the most notorious agents was codenamed Stakeknife. It has been publicly known for more than 20 years that Stakeknife was a man called Freddie Scappaticci. He died under MI5 protection in 2023 having never been charged with any of the many murders and other crimes to which he is linked.Pacemaker Press/ PAFreddie Scappaticci, or Stakeknife, died under MI5 protection in 2023Scappaticci was a senior figure in the IRA's internal security unit, which was tasked by IRA leaders with identifying and killing British agents in the organisation. But, with the spycatcher himself a spy, the result was one British agent killing other agents, or people accused of being agents, and the state repeatedly not intervening to save them.Intelligence agencies and historic wrongdoingA long-running police investigation into Stakeknife, Operation Kenova, was forbidden from officially naming Scappaticci in its final report, published in December, despite the fact that his identity was widely known.The head of the Kenova team, Sir Iain Livingstone, pleaded with Northern Ireland Secretary Hilary Benn for the right to name Scappaticci in his report, but Benn said he would decide after the Supreme Court ruling in the Paul Thompson case, which came later in December.That ruling has, in effect, strengthened Benn's power to stop him being named. If permission is granted, a revised version of the Kenova report can be published.Jon Boutcher, who was Livingstone's predecessor leading the Kenova investigation, has described the situation preventing Scappaticci being named as a \"pantomime\". It leads to the truth being \"suppressed,\" he argues, with \"profound and severe adverse impacts on victims and families, legitimate public discussion and debate, media freedom, open justice and public confidence in state agencies and the criminal justice system\".PA WireThe integrity of MI5, which is currently led by Sir Ken McCallum, is under scrutinyBoutcher, the PSNI chief constable, is involved in a significant and extraordinary stand-off with the government and MI5 over NCND.He has called for reform of the policy, a principle he fully supports but believes is being wrongly applied and has become a dogma that can be used to conceal wrongdoing.He has recommended the policy is reviewed to ensure it is applied proportionately and only where genuinely necessary for the protection of life or national security. The government has not yet responded to the call for a review of the policy.Boutcher has directly asked whether NCND's continued application on Stakeknife amounts to it being used as a tool for covering up things that should never have happened.\"I question whether this decision protects agents, or rather does it actually protect the government and intelligence agencies from accountability for historical wrongdoing.\"More from InDepthIn the Paul Thompson case he argued that he, as chief constable, rather than the government, had the right to allow the coroner to release a summary of police files. The high court and court of appeal backed his position before it was ultimately rejected by the Supreme Court.During the hearings, government barrister Sir James Eadie KC said Boutcher was being \"thoroughly disingenuous\" and that \"politics is being played with national security\". He argued the government is best placed to make assessments on national security, as only it has access to the full range of necessary advice. The principal advice, in this context, is from MI5.The argument the government is best informed seemed somewhat at odds with the fact the MI5 officer whose sworn statement was provided to support the case had not read the relevant underlying material.For the chief constable of Northern Ireland to be at loggerheads with MI5 is \"unprecedented\" says veteran investigative journalist, John Ware, who has reported on the Troubles since the 1970s.\"If anybody had told me even 10 years ago that there would come a time when the chief constable of the PSNI and the Security Service were at loggerheads, I would have fallen off my stool,\" he says.Trust, state secrecy and the publicBoutcher has a raised a stark question: can the authorities who played a role in the events, including MI5, be trusted to decide whether to tell the public about what happened, when doing so could leave them exposed?He has also indirectly raised this question about the legal system itself - due to its own role in the Stakeknife case.Scappaticci helped create a legal precedent on state secrecy that is routinely cited by the government to this day.In 2003, he sought a judicial review over the then government's refusal to publicly deny media reports that he was Stakeknife.But Scappaticci was bluffing and did not actually want to succeed, since if the government was ordered to tell the truth, he would have been confirmed as Stakeknife. Scappaticci was engaged in a pretence to help shore up his reputation: publicly fighting a legal case, while hoping – and expecting – he would lose.VCG via Getty ImagesMany families of those killed or injured in the Troubles are still fighting through the courtsHowever, the government feared Scappaticci would win because a judge would assume he was not Stakeknife and force ministers to be honest.Jon Boutcher has now confirmed an extraordinary fact: the judge who heard the case did so after being secretly briefed on the real identity of Stakeknife.That judge, the then Lord Chief Justice of Northern Ireland, Lord Carswell, ultimately allowed the government to maintain NCND, creating the legal precedent on the policy.\"The full facts about this and the government's explanation will never be known while it is able to hide behind the shield of NCND,\" Boutcher has said.There is a second extraordinary fact: the government barrister who did the secret briefing was Philip Sales, who as Lord Sales was one of the Supreme Court justices in the Paul Thompson case. This fact was uncovered by the journalist John Ware.This is an issue because it is Lord Sales' ruling in the Thompson case which has a central bearing over whether Scappaticci can be named and more details revealed about what went on, including Lord Sales' own role.I asked the Supreme Court whether, given Lord Sales' role in the Scappaticci matter, if it was appropriate for him to have heard the Thompson case.In a statement, the court said: \"Great care is taken in the selection of the panels which will hear a case at the UK Supreme Court.\"A Justice will not deal with a case where it is considered there is a conflict of interest and individual Justices are careful to ensure that they have none.\"The cases of Seamus Dillon and Sean BrownTwo further cases that touch on the potential release of information about the role of the state during the Troubles are also before the Supreme Court.Troubles-related inquests were shut down in 2024 with the passing of the Legacy Act, which created a new body called the Independent Commission for Reconciliation and Information Recovery (ICRIR) to examine relevant cases, including those being investigated by police.The families of four men who were either killed or injured during the Troubles won a further legal victory, when the Northern Ireland Court of Appeal ruled the government has too much veto power over the disclosure of material by the ICRIR.Lady Chief Justice Siobhan Keegan said that the provision in the Act giving the Northern Ireland secretary \"the final say\" on disclosure of sensitive national security information by the ICRIR would risk undermining public confidence in the body.The UK government's appeal will be ruled on by the Supreme Court in the coming months. The lead respondent in the case is Martina Dillon, whose husband Seamus was killed in 1997.PA WireMartina Dillon's husband Seamus was killed in 1997 by the paramilitary Loyalist Volunteer Force (LVF)The paramilitary Loyalist Volunteer Force (LVF) claimed responsibility. A coroner had opened an inquest on the basis there was evidence of collusion by state authorities, but the inquest was halted by the Legacy Act. No-one has ever been held accountable.The government has also registered an appeal in another key case.Sean Brown was also murdered in 1997 by members of the LVF. The 61-year-old father-of-six was abducted as he locked the gates at a sports club in County Londonderry. There were investigative failures by police and no-one has been brought to justice.PA MediaSean Brown, a father of six, was abducted as he locked the gates at a sports clubDecades later, a coroner issued a summary of secret material stating that \"a number of the individuals linked through intelligence to the murder were agents of the state.\" Sean's family want a public inquiry, and have won judgments over the past two years at the High Court and Court of Appeal. The government, which was found to have acted unlawfully by refusing a public inquiry, has registered an appeal to the Supreme Court on the basis the issue has constitutional significance regarding who should order inquiries.'The state viewed itself as above the law'At its heart, this vast battle over secrecy centres on two core claims by the state: that only the government and MI5 can ultimately be fully trusted on national security, and that their decisions on what information to release are solely about protecting the public.But these claims have been undermined by MI5's actions and omissions in several recent cases, all during the leadership of MI5's current director general, Sir Ken McCallum.A public inquiry into the 2017 Manchester Arena bombing, which killed 22 people, concluded that MI5 had not given an \"accurate picture\" of the key intelligence it held about the suicide bomber who carried out the attack. The inquiry chairman only uncovered what MI5 had done through his own persistent investigations during secret evidence sessions.The government has been resisting calls by families bereaved by the Manchester Arena attack for MI5 officers to be fully included in planned new legislation - known as the Hillsborough Law - that's designed to stop cover-ups and enforce truth-telling by public officials.Getty ImagesA public inquiry into the Manchester Arena bombing concluded that MI5 had not given an \"accurate picture\" of key intelligence it heldAnother ongoing case is an example of how MI5's evidence cannot always be taken at face value: MI5 gave false evidence to three courts about having maintained its NCND secrecy policy in relation to an abusive neo-Nazi agent who attacked his girlfriend with a machete. But MI5 had in fact told me the man was an agent when attempting to prevent me from investigating him. After MI5 apologised, we then showed that inquiries into what happened by MI5 and the government were deficient and unreliable, with further falsehoods provided to the court. This prompted the most senior judge in England and Wales to dismiss MI5's explanations and led the prime minister to order a new investigation, which will report this year.In the Stakeknife investigation, MI5 disclosed key documents years after enquiries began, aer Scappaticci had died and charging decisions had been made, and at a point when the Legacy Act banned police from investigating further. The new material revealed MI5 had greater and earlier knowledge of Stakeknife than detectives had previously been told, including that MI5 had been involved in tasking him. The lead detective said it was a \"significant failure on the part of MI5\". A review commissioned by MI5 found no deliberate wrongdoing.Cover-ups and failures to disclose information have a long history in Northern Ireland. Lord Stevens, recalling his investigations, has said: \"I was misled deliberately, I was criminally obstructed from doing my job by the Royal Ulster Constabulary and military, whilst MI5 failed to disclose information.\"Judge Pomerance, who was senior counsel on another major investigation, concluded bluntly: \"The state viewed itself as above the law\".The battle of bereaved familiesLast July, days before Eugene Thompson died, Jon Boutcher delivered a letter of apology on behalf of PSNI. He apologised for the police's failure to take action that may have prevented Paul Thompson's murder, and for failures in the investigation, including not properly pursuing suspects.Mark Thompson from Relatives for Justice (no relation of Paul and Eugene Thompson) says the apology was \"important\" but that Eugene was by this stage \"very ill\".Thompson familyJust before he died, Eugene Thompson (right) received an apology for police failings over the murder of his brother Paul (left). Their mother Margaret is also picturedMark had watched the Supreme Court hearings with Eugene on a laptop in his hospice and describes the experience as \"tough\". Eugene was \"praying and hoping that before he died the judgment could be made\", Mark says.Bereaved families caught up in these cases have had to battle for decades, trying to fill voids left by the lack of proper investigations by the state.\"You became an investigator, tracking down witnesses. You became an expert in the law in that field. And you fought your own case tooth and nail.\"Eugene Thompson became an \"accidental lawyer and expert in his own case\", he says, as he campaigned for answers about why his brother Paul was murdered.\"I think if we take anything from the legacy of him, it's the example of never giving up.\"Top image credit: PA MediaEmail: security.investigations@bbc.co.ukSignal: @investigation.56Click here to learn how to use SecureDrop, an anonymous whistleblowing tool that works only in the Tor browser and follow the advice to stay secure.BBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. You can now sign up for notifications that will alert you whenever an InDepth story is published - click here to find out how",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Murder and MI5: the extraordinary battle over what stays secret",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/121e/live/0b789990-faab-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-26T00:25:19.000Z",
      "dateModified": "2026-01-26T00:25:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Labour Block Andy Burnham From Standing - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mx4v36?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-25T21:33:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·25 Jan 2026,·15 minsLabour Block Andy Burnham From StandingNewscastAvailable for over a yearToday, Andy Burnham has said he is \"disappointed\" after being blocked from standing as a candidate for the upcoming parliamentary by-election in Gorton and Denton by Labour's ruling body.\nAs a directly elected mayor, Burnham had to get approval from Labour's national executive committee (NEC), after he applied to be a candidate on Saturday.\nBut Labour said the party had decided to deny him permission to stand to \"avoid an unnecessary mayoral election, which would use substantial amounts of taxpayers' money and resources\".\nAdam and Chris are here to discuss what it means and what might happen next. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers.\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nThe presenters were Adam Fleming and Chris. It was made by Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Labour Block Andy Burnham From Standing - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-25T21:33:00.000Z",
      "dateModified": "2026-01-25T21:33:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Are ICE immigration agents acting outside the law? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct8bz1?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-01-23T16:16:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·23 Jan 2026,·30 minsAre ICE immigration agents acting outside the law?AmericastAvailable for over a yearDonald Trump came into power with a promise to carry out the “largest mass deportation programme in history”.  One year on, ICE (Immigration and Customs Enforcement) raids in US cities are one of biggest political issues dividing America right now, with questions over how ICE agents are behaving and who they are targeting.\nIn this episode, Anthony, Marianna and Justin look at whether ICE agents are going beyond their remit, and is public opinion starting to turn against the president? \nWe focus on Minneapolis after the killing of 37 year old Renee Nicole Good two weeks ago, who was shot dead by an ICE officer.  Anti-ICE protests have been ongoing within the city, and this week, the Vice President JD Vance who was visiting Minneapolis called for Democrats to co-operate with the Trump agenda.  \nJustin talks to John Sandweg, former Acting Director of ICE under President Obama who gives us his insight into how ICE agents are being vetted and recruited, plus the wider impact of diverting billions of dollars into Trump’s enforcement operations.  \nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Anthony Zurcher, North America Correspondent\n• Marianna Spring, Social Media Investigations Senior Correspondent \nGUEST: \nJohn Sandweg, former Acting Director of ICE under President Obama \nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Purvee Pattni and Laura Cain. The technical producer was Mike Regaard. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Are ICE immigration agents acting outside the law? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-01-23T16:16:00.000Z",
      "dateModified": "2026-01-23T16:16:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Heatwave warnings across Australia as millions celebrate national day",
    "url": "https://www.bbc.com/news/articles/cz6y7nxx5jvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c467/live/fe7a5a50-faa3-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-26T07:15:24.000Z",
    "description": "Australian authorities have issued heatwave warnings for most of the country as millions mark the national holiday, Australia Day.Temperatures are exp",
    "body": "Australian authorities have issued heatwave warnings for most of the country as millions mark the national holiday, Australia Day.Temperatures are expected to peak on Tuesday, reaching the \"high forties\" Celsius in the southern states of Victoria and South Australia, the Bureau of Meteorology said.On Sunday, South Australia recorded temperatures as high as 48.5C, the bureau reported. Fire danger warnings are in place across the country.Some Australia Day events on Monday were cancelled out of safety concerns.In Adelaide, a parade and light show were cancelled because of the extreme heat forecast.\"While this is deeply disappointing for the community, performers and partners, community safety and wellbeing must come first,\" organisers said.Australia Day - 26 January - is the anniversary of the 1788 landing of Britain's First Fleet, which began the era of colonisation.But to many people, especially Indigenous Australians, the occasion is a reminder of their cultural destruction under European settlers - referring to the occasion as \"Invasion Day\". Across the country on Monday, huge crowds gathered for rallies in support of Indigenous Australians.Aside from Victoria and South Australia, heatwave warnings have also been issued in New South Wales, Queensland, Tasmania, Northern Territory and the Australian Capital Territory.Many of these warnings will remain in place until Wednesday.\"We haven't seen heatwave conditions like this in Victoria for almost 20 years,\" Tim Wiebusch, Victoria's emergency management commissioner, told ABC.\"It was 2009 ahead of the bushfires where we saw those prevailing conditions and so we are indicating to all Victorians that this is a very serious set of weather conditions.\"On Monday, the Bureau of Meteorology warned of \"extreme fire dangers\" across parts of South Australia and much of south-western Victoria \"due to very hot and dry weather combined with moderate to gusty winds\".Firefighters in Victoria are working to combat several fires across the state, which have prompted evacuations and threatened properties.The heat has also affected the Australian Open at Melbourne Park. Tennis player Jannik Sinner was seen suffering from cramps on the court on Saturday, before play was temporarily suspended in the rising heat. Nearly 80,000 fans were warned to take care under the scorching sun. Meanwhile, parts of Western Australia were pummelled by Tropical Cyclone Luana over the weekend. The storm damaged homes and a popular beach resort before weakening as it moved inland. The meteorological bureau has advised people to find places to keep cool, like their homes, libraries, community centres or shopping centres. It also told people to close their windows and draw the curtains to keep heat out of their homes.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Heatwave warnings across Australia as millions celebrate national day",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c467/live/fe7a5a50-faa3-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-26T07:15:24.000Z",
      "dateModified": "2026-01-26T07:15:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ex-Tory Home Secretary Suella Braverman defects to Reform UK",
    "url": "https://www.bbc.com/news/articles/c1evq263e49o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5bb7/live/5336e750-fabf-11f0-b385-5f48925de19a.gif",
    "tag": "Trending",
    "date": "2026-01-26T15:41:24.000Z",
    "description": "41 minutes agoPaul SeddonPolitical reporter Former Home Secretary Suella Braverman has become the latest Conservative MP to defect to Reform UK.She be",
    "body": "41 minutes agoPaul SeddonPolitical reporter Former Home Secretary Suella Braverman has become the latest Conservative MP to defect to Reform UK.She becomes the third sitting Tory MP to join Nigel Farage's party in the last eleven days, and takes Reform's tally of MPs to eight.Unveiled at a rally in London, Braverman told Reform supporters she had also resigned her Tory membership of 30 years, adding: \"I feel like I've come home.\"Her defection comes hot on the heels of Robert Jenrick and Andrew Rosindell, who also left the Conservatives earlier this month. A major figure on the right of the party under the last government, Braverman has long been seen as a potential Reform defector at Westminster. But her unveiling as Reform's latest recruit came as a surprise announcement by Farage during an event to launch a party group for military veterans in London.An MP since 2015, Braverman was attorney general under Boris Johnson and became home secretary under Liz Truss in September 2022.She was forced to step down from the role a month later, after it emerged she had sent an official document to a Tory colleague using her personal email.Rishi Sunak re-appointed her to the position just six days later upon entering Downing Street, but sacked her the following year, over an article accusing the Metropolitan Police of bias in the policing of pro-Palestinian protests in London. Speaking at the Reform rally, Braverman told supporters that Britain was \"broken\" and immigration was \"out of control\".\"We can either continue down this route of managed decline to weakness and surrender. Or we can fix our country, reclaim our power, rediscover our strength,\" she told the crowd.Farage said he had been talking to Braverman for \"just over a year\" about the possibility of defecting and that she had \"reached the view that actually the centre-right of British politics needs to unify around Reform\".He said she had been part of a government that was \"a failure\" but that \"she's now prepared to put her hand up and say, we got it wrong\". The Conservative Party said it was \"always a matter of when, not if, Suella would defect\". \"There are some people who are MPs because they care about their communities and want to deliver a better country. There are others who do it for their personal ambition,\" a spokesman added.\"Suella stood for leader of the Conservatives in 2022 and came sixth, behind Kemi and Tom Tugendhat. In 2024 she could not even muster enough supporters to get on the ballot. \"She has now decided to try her luck with Nigel Farage, who said last year he didn't want her in Reform.\"In addition to the four sitting Conservative MPs that have now switched to Reform, around 20 former Tory MPs have made the move since the general election, including former ministers Nadhim Zahawi, Nadine Dorries and Jake Berry. Henry Smith - one of those ex-MPs to make the switch - said Braverman had tried to \"steer the last government in a Conservative direction\" but had been \"very much stopped in her tracks\". Speaking to Matt Chorley on BBC Radio 5 Live, the former Crawley MP said that while the Conservative leadership \"might be making noises to the right,\" many Conservative MPs were \"quite frankly more comfortable in a much more Liberal Democrat position\".Appearing on the same programme, Conservative MP Sir Bernard Jenkin said: \"People like Suella and Rob Jenrick are leaving the Conservative Party just at the time when Kemi is sorting all these things out, and she's beginning to pull us up in the polls. \"Maybe it's because she's doing better that they're leaving.\"Labour Party chair Anna Turley said: \"Nigel Farage is stuffing his party full of the failed Tories responsible for the chaos and decline that held Britain back for 14 years.\"Liberal Democrat deputy leader Daisy Cooper said \"Farage has recruited yet another Conservative minister with selective amnesia - one who complains about broken Britain while conveniently forgetting they helped break it.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ex-Tory Home Secretary Suella Braverman defects to Reform UK",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5bb7/live/5336e750-fabf-11f0-b385-5f48925de19a.gif"
      ],
      "datePublished": "2026-01-26T15:41:24.000Z",
      "dateModified": "2026-01-26T15:41:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK loses measles elimination status",
    "url": "https://www.bbc.com/news/articles/cgjw0xegxglo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bc61/live/c0e563a0-fac7-11f0-9951-335577236554.jpg",
    "tag": "Trending",
    "date": "2026-01-26T15:04:44.000Z",
    "description": "1 hour agoNick TriggleHealth correspondentThe UK has lost its measles elimination status, the World Health Organization has announced.The move was bas",
    "body": "1 hour agoNick TriggleHealth correspondentThe UK has lost its measles elimination status, the World Health Organization has announced.The move was based on the spread of cases in 2024 when there were 3,600 suspected cases.Elimination status means there is no sustained transmission so this decision was largely expected, given the scale of the outbreaks in 2024.There were more than 1,000 cases last year as well. The move is also a reflection of the fact vaccination rates are below the 95% threshold required to achieve herd immunity - when enough people in a community are vaccinated against a disease, making it hard for the pathogen to spread.The UK was first declared measles-free in 2017, but lost the status two years later, before regaining it after spread of the virus was almost halted completely in 2021 - although that was mainly because social distancing during the pandemic.Outbreaks in late 2023 meant measles started spreading more quickly again, leading to the surge in cases in 2024.Vaccination uptake at the end of 2024 was 92% for the first dose and just below 85% for the second dose.Dr Vanessa Saliba, consultant epidemiologist at UKHSA, said: \"Infections can return quickly when childhood vaccine uptake falls - measles elimination is only possible if all eligible children receive two MMRV doses before school.\"The NHS is making vaccination easier, including offering the second MMRV dose earlier at a new 18-month appointment to boost uptake and support elimination goals.\"She said older children and adults could still get vaccinated as the NHS offered catch-up jabs.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK loses measles elimination status",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bc61/live/c0e563a0-fac7-11f0-9951-335577236554.jpg"
      ],
      "datePublished": "2026-01-26T15:04:44.000Z",
      "dateModified": "2026-01-26T15:04:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nigella Lawson to replace Prue Leith on The Great British Bake Off",
    "url": "https://www.bbc.com/news/articles/cgk80pzxkexo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f381/live/7d93baa0-faba-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-26T13:10:34.000Z",
    "description": "3 hours agoSteven McIntoshEntertainment reporterTV chef Nigella Lawson will replace Dame Prue Leith on The Great British Bake Off, broadcaster Channel",
    "body": "3 hours agoSteven McIntoshEntertainment reporterTV chef Nigella Lawson will replace Dame Prue Leith on The Great British Bake Off, broadcaster Channel 4 has confirmed.Dame Prue has been a judge on the reality baking competition since 2017, but announced last week that she would leave the series adding: \"Now feels like the right time to step back\".Lawson, who will join Paul Hollywood as a judge, said in a statement: \"I'm uncharacteristically rather lost for words right now.\"Of course it's daunting to be following in the footsteps of Prue Leith and Mary Berry before her, great dames both, but I'm also bubbling with excitement.\"She added: \"The Great British Bake Off is more than a television programme, it's a National Treasure – and it's a huge honour to be entrusted with it.\"I'm just thrilled to be joining the team and all the new bakers to come, I wish the marvellous Prue all the best, and am giddily grateful for the opportunity!\"Dame Prue said she was \"thrilled\" that Nigella would be taking over her role in the tent. \"She's sassy, fun and she knows her onions - and her croissants, cake and crumble,\" Dame Prue added.Channel 4 controller Ian Katz said the broadcaster was \"incredibly excited about the marriage of two great British icons: Bake Off and Nigella\".Dame Prue was hired for Bake Off after the series jumped from the BBC to Channel 4 in 2016.She replaced Dame Mary, who left the show along with presenters Mel Giedroyc and Sue Perkins after the move.The programme will return for its 17th series later this year, with Lawson and Hollywood alongside current hosts Alison Hammond and Noel Fielding.Writing after Lawson's appointment was rumoured last week, the Guardian's Stuart Heritage said that The Great British Bake Off has \"lost its way\" and \"become slightly long in the tooth over the last half decade or so\".He added Lawson would give the show a shot in the arm, writing: \"She is spectacularly British, and manages to balance the sort of familiarity that will reassure existing viewers with a level of international first-name recognition that might even end up growing the audience.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nigella Lawson to replace Prue Leith on The Great British Bake Off",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f381/live/7d93baa0-faba-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-26T13:10:34.000Z",
      "dateModified": "2026-01-26T13:10:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israel says it has retrieved remains of final Gaza hostage Ran Gvili",
    "url": "https://www.bbc.com/news/articles/c5ydvz7nz4mo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ccaa/live/8e6eb450-fac0-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-26T15:47:12.000Z",
    "description": "The Israeli military says it has retrieved the body of the last hostage in Gaza, paving the way for the next phase of US President Donald Trump's peac",
    "body": "The Israeli military says it has retrieved the body of the last hostage in Gaza, paving the way for the next phase of US President Donald Trump's peace plan to get under way.It had been searching for Master Sgt Ran Gvili since the ceasefire with Hamas began in October.Israeli Prime Minister Benjamin Netanyahu called Gvili's return \"an extraordinary achievement\".The Israeli military began a new operation to find Gvili on Sunday. Earlier, Hamas's armed wing said it had provided mediators with \"all the details and information\" about Gvili's location.Netanyahu's office said Israel would reopen Gaza's key border crossing with Egypt once the operation to find and return Gvili was complete.Netanyahu hailed the return of Gvili's body, saying: \"We promised - and I promised - to bring everyone back. We brought them all back, down to the very last captive,\" he said.The Israeli military said the clarification of existing intelligence over the weekend had enabled the search of a cemetery near Gaza City.Hamas spokesman Hazem Qassem said the discovery of the body \"confirms Hamas's commitment to all the requirements of the ceasefire agreement\".The retrieval of Gvili adds fresh impetus to Trump's plan to end the war in Gaza. Israel had resisted moving forward until Gvili was found.Phase two is meant to involve the reconstruction and full demilitarisation of Gaza, including the disarmament of Hamas and other Palestinian groups. The plan is also meant to see the deployment of an as-yet unconstituted International Stabilization Force (ISF) and the progressive withdrawal of Israeli forces from Gaza.The Israel Defense Forces (IDF) announced Gvili's retrieval in a statement, saying: \"According to the information and intelligence available to us, Sgt Maj (res) Ran Gvili... a Yamam commando fighter, aged 24 at the time of his death, fell in battle on the morning of October 7, 2023, and his body was abducted to the Gaza Strip.\"The IDF shares in the family's grief. The IDF will continue to accompany the families and the returned hostages and to act to strengthen the security of Israel's citizens.\"With this, all of the hostages from the Gaza Strip area have been returned.\"Hamas was meant to return all hostages, alive and dead, within 72 hours of the ceasefire taking effect. Twenty living Israeli hostages and the bodies of 27 dead Israeli and foreign hostages were handed over, leaving only Gvili missing.The policeman was one of 251 hostages taken in the Hamas-led attack on Israel on 7 October 2023 in which about 1,200 people were killed. Most of the hostages were released alive over the course of the next two years in exchange for 250 Palestinian prisoners and 1,718 detainees from Gaza.Israel's military campaign in Gaza, launched in response to the attack, has killed 71,660 Palestinians, the Hamas-run health ministry has said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israel says it has retrieved remains of final Gaza hostage Ran Gvili",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ccaa/live/8e6eb450-fac0-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-26T15:47:12.000Z",
      "dateModified": "2026-01-26T15:47:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Suella Braverman: Another big beast defection shows momentum is with Reform",
    "url": "https://www.bbc.com/news/articles/c5yv97e7j5lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/19e2/live/902de1c0-fac6-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-26T13:30:17.000Z",
    "description": "3 hours agoChris MasonPolitical editorWhile anyone drawing up a list of potential Conservative defectors to Reform UK would have put Suella Braverman ",
    "body": "3 hours agoChris MasonPolitical editorWhile anyone drawing up a list of potential Conservative defectors to Reform UK would have put Suella Braverman near the top, this is still a big moment.Braverman is a former Conservative home secretary, a big beast of recent Tory history.And her switch emphasises the momentum Reform are showing in draining the Conservative Party.She is the fourth sitting Tory MP to join the party since the last election, and the third this month.The week before last it was Robert Jenrick, a week ago it was Andrew Rosindell, now Braverman.At just the point Kemi Badenoch has been attracting warmer reviews from her colleagues, another senior Conservative leaves the flock.On stage at her defection, Braverman shared Reform's diagnosis that Britain in broken, a label the Conservatives have shied away from using and disagree with.Like Jenrick before her, she offered a devastating critique on her former party's recent governing record.Again, like Jenrick, a government of which she was a part.She said she was \"calling time on Tory betrayal and lies\".I was also struck how emotional she was.I have known Braverman for more than 25 years – being a Conservative has always been part of her DNA.But as of today, no longer. Not a capital C conservative anyway. It is a huge personal moment for her.The question now for Nigel Farage is how he puts his growing team to good use and avoids fall outs.The question now for Badenoch is who on earth might run away next? Can the tide be stemmed?Some think there may be half a dozen or so more Conservative MPs who are weighing up making the leap themselves.Meanwhile, for Labour, after all the questions for them over the weekend about the machinations involving the prime minister and Andy Burnham, a chance to reflect on rows on the Right of politics.There is a controlling thought that unites both stories: the primacy of Farage in our national political conversation.Labour is squabbling over whether Burnham was their best bet to beat Reform in the forthcoming by election in Gorton and Denton, and whether him deserting the Greater Manchester mayorality would open up that role to Reform.Meanwhile, the Conservatives are considering, yet again, whether they face near oblivion.For both of Westminster's political mega brands, so many roads lead back to the rise of Reform UK.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Suella Braverman: Another big beast defection shows momentum is with Reform",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/19e2/live/902de1c0-fac6-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-26T13:30:17.000Z",
      "dateModified": "2026-01-26T13:30:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Traitors moves from TV to theatre with 'bold' West End show",
    "url": "https://www.bbc.com/news/articles/c0r4jwkl2vqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/52c1/live/76ab8960-fac5-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-26T08:00:07.000Z",
    "description": "8 hours agoPaul GlynnandIan Youngs,Culture reportersBBC/Studio LambertThe makers of The Traitors are creating a stage version, in the hope that the TV",
    "body": "8 hours agoPaul GlynnandIan Youngs,Culture reportersBBC/Studio LambertThe makers of The Traitors are creating a stage version, in the hope that the TV show's dramatic twists and huge popularity will translate into a theatre hit.The play will tell a new story inspired by the programme's format, in which a group of faithfuls try to root out the traitors in their ranks, and will be staged at an unnamed London venue next year.It is being created by Studio Lambert, which makes the BBC TV series, and Neal Street Productions, which was co-founded by Oscar winner Sam Mendes and is behind shows and films like Call the Midwife and Hamnet.Studio Lambert chief executive Stephen Lambert said they would \"reimagine the show as a bold and surprising theatrical performance\".The contestants' roundtable discussions are packed with high dramaHe went on to say that taking it from the screen to stage \"is a hugely exciting next step for this much-loved brand\".\"Faithful fans should expect an intense, joyful night out as we reveal a thrilling new hunting ground for our Traitors,\" he said.The play will be written by John Finnemore, known for TV's Good Omens and radio series Cabin Pressure. It will be directed by Olivier Award winner Rob Hastie, who staged shows like Operation Mincemeat and Standing at the Sky's Edge, and is deputy artistic director of London's National Theatre.The announcement follows Friday's conclusion of series four of the murder mystery reality TV show, which is presented by Claudia Winkleman.It places secret saboteurs among a group of faithful contestants in a grand castle in Scotland, all fighting it out to win a cash prize.The final of the celebrity edition of the show was the UK's most-watched TV event of 2025, with about 15 million people tuning in to see traitorous comic Alan Carr become king of the castle.Caro Newling, co-founder of Neal Street Productions, said they had \"curated a team of brilliant faithful theatre-makers\", led by Hastie and Finnemore, \"to bring a bold, structural twist to the format that only the live medium can provide\".Stage adaptations of small screen hits have ranged from Stranger Things: The First Shadow, which has been running in the West End for more than two years, to The Great British Bake Off Musical, which ran in the capital for three months.More from the BBC",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Traitors moves from TV to theatre with 'bold' West End show",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/52c1/live/76ab8960-fac5-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-26T08:00:07.000Z",
      "dateModified": "2026-01-26T08:00:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Body found believed to be missing Devon antiques dealer ",
    "url": "https://www.bbc.com/news/articles/cn7j8k012kxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b5e1/live/e22251e0-fa90-11f0-a15a-cda6c2562e5f.jpg",
    "tag": "Trending",
    "date": "2026-01-26T06:51:46.000Z",
    "description": "10 hours agoSocial mediaA body recovered from the sea is believed to be missing antiques dealer Matthew UphamThe body of a man recovered from the sea ",
    "body": "10 hours agoSocial mediaA body recovered from the sea is believed to be missing antiques dealer Matthew UphamThe body of a man recovered from the sea is thought to be antiques shop owner Matthew Upham, one of two swimmers who went missing on Christmas Day.Devon and Cornwall Police said emergency services were called to Exmouth Beach in Devon just before 15:00 GMT on Sunday following a report of a body seen near the shore.Formal identification is yet to be carried out, but officers said the family of a 64-year-old man from Budleigh Salterton had been informed.The body of a 47-year-old man, thought to be the other swimmer who went missing,  was recovered on Tuesday.Flowers were placed along the edge of the beach at Budleigh SaltertonEmergency services were called to Budleigh Salterton shortly after 10:25 GMT on 25 December after two men could not be located. The coastguard search operation was called off at about 17:00.RNLI crews as well as coastguard helicopters carried out extensive shoreline and offshore searches and a number of people were safely brought back to shore.They were checked either by paramedics at the scene or taken to hospital as a precaution.Organisers of some Christmas and Boxing Day swims in Devon and Cornwall had postponed or cancelled events due to a yellow weather warning for wind.More on this storyRelated internet linksMore from the BBC",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Body found believed to be missing Devon antiques dealer ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b5e1/live/e22251e0-fa90-11f0-a15a-cda6c2562e5f.jpg"
      ],
      "datePublished": "2026-01-26T06:51:46.000Z",
      "dateModified": "2026-01-26T06:51:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "France debates under-15s social media ban endorsed by Macron",
    "url": "https://www.bbc.com/news/articles/c07x003vx0yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/053a/live/4c7fd700-fab0-11f0-91f4-a739ab96be22.jpg",
    "tag": "Trending",
    "date": "2026-01-26T12:14:43.000Z",
    "description": "France is on course to follow Australia in banning social media to younger teenagers, as debate on a new law opens in the National Assembly.The law wo",
    "body": "France is on course to follow Australia in banning social media to younger teenagers, as debate on a new law opens in the National Assembly.The law would block access for under 15-year-olds to networks such as Snapchat, Instagram and Tiktok. President Emmanuel Macron has said he wants the ban in place by the start of the school year in September.The French move is part of a worldwide trend towards restricting social networks for children, triggered by growing evidence of the damage they can cause to mental health.\"We cannot leave the mental and emotional health of our children in the hands of people whose sole purpose is to make money out of them,\" Macron said last month.Under the new text, the state media regulator would draw up a list of social media networks that are deemed harmful. These would be simply banned for under 15-year-olds.A separate list of supposedly less harmful sites would be accessible, but only with explicit parental approval.The bill is believed to have a good chance of passing, with pro-Macron parties likely to be joined by the centre-right Republicans (LR) as well as the populist right-wing National Rally (RN).Another clause would ban the use of mobile telephones in senior schools (lycées).  The ban is already in effect in junior and middle schools.If the law is passed, France will need to agree on the mechanism for for age-verification. A system is already in place that requires over 18 year-olds to prove their age when accessing online pornography.In Europe, Denmark, Greece, Spain and Ireland are also considering following the Australian example. Earlier this month, the UK government launched a consultation on banning social media for under 16s.The basis of the proposed French law is a text drawn up late last year by deputy Laure Miller, who chaired a parliamentary committee enquiry into the psychological effects of TikTok and other networks.Separately, the government was told to draw up its own legislation, after Macron decided to make the issue a centrepiece of his last year in office.The president has been sidelined from domestic politics since the Assembly elections which he called in 2024 resulted in a hung parliament, and the social media ban has been a rare chance to court public favour.For a time the cause risked falling victim to bickering between Macron and his one-time prime minister Gabriel Attal (Miller is an MP from Attal's party). But in the end the government appears to have rallied behind the Miller bill.If the text is approved on Monday, it will pass before the upper house, the Senate, in the next month. Macron said he had asked the government of Prime Minister Sébastien Lecornu to use a fast-track procedure to get the legislation on the books by September.Without resort to the fast-track (which permits a single reading as opposed to two in each of the two houses), the law would have little chance of getting past the legislative backlog created by Lecornu's difficulties in passing a budget.The bill has already had to be redrafted to take account of questions raised by the Council of State, the body which previews draft legislation to ensure it conforms with French and European law.A 2023 law which proposed a similar ban on social media for young teenagers proved inoperable after courts decided it broke European law.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "France debates under-15s social media ban endorsed by Macron",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/053a/live/4c7fd700-fab0-11f0-91f4-a739ab96be22.jpg"
      ],
      "datePublished": "2026-01-26T12:14:43.000Z",
      "dateModified": "2026-01-26T12:14:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tammy Abraham transfer news: Aston Villa set to sign £18m striker after Besiktas pay £11.2m",
    "url": "https://www.bbc.com/sport/football/articles/c301ry162d4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1866/live/5894e660-fac5-11f0-9951-335577236554.jpg",
    "tag": "Trending",
    "date": "2026-01-26T15:07:26.000Z",
    "description": "Besiktas have paid £11.2m to Roma for Tammy Abraham - as the Turkish club prepare to sell him to Aston Villa.The striker had a medical on Saturday hav",
    "body": "Besiktas have paid £11.2m to Roma for Tammy Abraham - as the Turkish club prepare to sell him to Aston Villa.The striker had a medical on Saturday having travelled to the UK on Friday after Villa agreed an £18m deal with the Super Lig side. Besiktas had an obligation to buy in the loan deal which took Abraham from Roma last summer and did not want to sell him, but are reluctantly allowing Abraham to return to England. Abraham, who has 11 England caps, scored 12 goals in 24 games for Besiktas.\"The conditions in the transfer contract of Kevin Oghenetega Tamaraebi Bakumo-Abraham have been fulfilled and the provision for the permanent transfer of the player has come into effect,\" said Besiktas.\"In this context, a transfer fee of 13m euros will be paid to AS Roma.\"The 28-year-old joined Roma from Chelsea for £34m in 2021 and scored 39 goals in 120 games for the Serie A club, winning the Europa Conference League in 2022.He also spent 2024-25 on loan at AC Milan, scoring 10 times in 44 appearances. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tammy Abraham transfer news: Aston Villa set to sign £18m striker after Besiktas pay £11.2m",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1866/live/5894e660-fac5-11f0-9951-335577236554.jpg"
      ],
      "datePublished": "2026-01-26T15:07:26.000Z",
      "dateModified": "2026-01-26T15:07:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Storm Chandra: UK braces for wind and rain as weather warnings issued",
    "url": "https://www.bbc.com/weather/articles/c5y2l538dw5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/689f/live/39a15f70-fa9a-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-26T12:10:19.000Z",
    "description": "Image source, BBC Weather Watchers/MattFaceyByHelen WillettsLead Weather Presenter, BBC WeatherUpdated 4 hours agoSevere weather warnings for wind and",
    "body": "Image source, BBC Weather Watchers/MattFaceyByHelen WillettsLead Weather Presenter, BBC WeatherUpdated 4 hours agoSevere weather warnings for wind and rain have been issued ahead of the expected arrival of Storm Chandra.Chandra has been named by the UK Met Office and is due to hit the UK on Tuesday.  It is the third major storm to hit the UK this month after Goretti and Ingrid, which caused significant damage and disruption. Chandra will be accompanied by multiple hazards, widely heavy and persistent rain, and gales or even severe gales in exposed areas.Severe weather warnings issuedImage caption, An amber wind warning comes into force in the early hours of TuesdayThe Met Office has issued an amber wind warning for Northern Ireland to accompany Storm Chandra, external.The warning is in place for eastern parts of Northern Ireland, from 05:00 on Tuesday until 21:00.Winds will escalate with coastal gales, even severe gales and damaging gusts of up to 75mph (120km/h). These sort of wind speeds will lead to large coastal waves which are likely to overtop the sea walls and promenades.Image caption, An amber warning for rain comes into force on MondayIt has also issued an amber warning for heavy rain from 17:00 Monday until 09:00 Tuesday for south-west England. 30-50mm rainfall is likely widely, with 60-80mm across some higher ground, especially south Dartmoor.These areas have already had a large amount of rain, so there is a risk of flooding as more rain falls on ground that is currently saturated.Further warnings issuedImage caption, Storm Chandra is an area of low pressure approaching the UKYellow warnings - the least severe level of warning - are more numerous:Northern Ireland, valid from 12:00 Monday until 18:00, for persistent rain and flood risk with 10 to 20mm widely, up to 40mm over the hills.South-west England, Wales and parts of central southern England valid from 13:00 Monday until 10:00 Tuesday, for 20 to 30mm widely, but as much as 80mm over Dartmoor, Exmoor and Bannau Brycheiniog (Brecon Beacons).London and south-east England, valid from midnight Tuesday until midday and mentions 15 to 25mm of rain widely, with twice as much over higher ground such as the Chilterns.Northern Ireland, valid Tuesday 00:00 until 23:59, for damaging winds, gusts in exposed parts up to 70mph (113km/h) accompanied by another 20 to 30mm of rain widely, 50 to 70mm over the hills.South-west England and West Wales, valid 05:00 Tuesday until 16:00 for very strong winds.Hilly areas of central and northern England, southern Scotland, valid Tuesday from midnight until 17:00 for heavy rain, 20 to 30mm widely and more in a few spots.  This rain will turn to snow over the hills, up to 5cm on hills around 300 metres and more on higher routes. Drifting is likely with the brisk winds. South-west Scotland, Lothian Borders and Strathclyde, valid Tuesday 05:00 until 23:59 for strong winds causing disruption.Parts of Scotland valid Tuesday from 06:00 until 23:59 for heavy rain and hill snow, rainfall amounts of 20 to 35 mm widely and more in some places. 2 to 5cm of snow for hills around 300 metres and 10 to 20cm above 500 metres. The brisk southeast winds will also blow the snow around reducing visibility.Much of this wet weather comes on after some very wet weather in recent days and weeks and so there is a high chance we will see significant impacts, such as:Air, sea and rail delays or cancellationsSpray and flooding on roadsInterruption or damage to power suppliesFlooding of some homes and businessA few communities might be cut off by flooded roadsTrees could be damaged or blown down, especially where vulnerable following recent stormy weatherLandslides are also possible in prone locationsIs flooding likely?Image caption, Chandra is expected to bring more rain to end a very wet JanuaryStorm Chandra is hitting hot on the heels of Goretti and Ingrid, bringing more soaking rains with little time between for the water to flow away and the rivers fully recover. This continuing rain really heightens the flood risk.  The wind will also be a threat, as strong winds from Goretti and Ingrid have already battered parts of the UK this month, notably in south-west England.  As a result, many structures may have been weakened, trees may have been left vulnerable as well as power lines.Why has the storm been named Chandra?Image source, BBC / Getty imagesImage caption, Wind is the main factor for naming a storm, but sometimes rain or snow are taken in to account as part of the processIn the UK, the Met Office work with Ireland's Met Éireann or the Netherlands' KNMI in naming a storm when they are forecast to cause \"medium\" or \"high\" impacts.The list of storm names is announced on 1 September each year and runs in alphabetical order.The season started with Amy in October, followed by Bram in early December 2025.Next names on our list will be Dave, Eddie and Fionnuala.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Storm Chandra: UK braces for wind and rain as weather warnings issued",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/689f/live/39a15f70-fa9a-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-26T12:10:19.000Z",
      "dateModified": "2026-01-26T12:10:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]