[
  {
    "title": "F1 Q&A: Piastri-Antonelli collision, Hamilton and Ferrari, Verstappen's Sao Paulo drive and McLaren beating Mercedes",
    "url": "https://www.bbc.com/sport/formula1/articles/cy0y28l1510o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/284a/live/0ef689d0-bdaf-11f0-8669-5560f5c90fbe.png",
    "tag": "Trending",
    "date": "2025-11-11T08:00:23.000Z",
    "description": "Piastri's penalty and Hamilton's future - F1 Q&AImage source, BBC SportLando Norris executed a perfect weekend at the Sao Paulo Grand Prix on Sunday t",
    "body": "Piastri's penalty and Hamilton's future - F1 Q&AImage source, BBC SportLando Norris executed a perfect weekend at the Sao Paulo Grand Prix on Sunday to extend his title lead over McLaren team-mate Oscar Piastri to 24 points. The Briton took 33 points in total at Interlagos by winning both the sprint race and grand prix, while Australian Piastri failed to make the main podium for the fifth weekend in a row and finished fifth. Max Verstappen's third place after starting from the pit lane also caught the eye, but the four-time title winner is now 49 points behind leader Norris. With only three races and one sprint event left of the 2025 season, BBC F1 correspondent Andrew Benson answers your latest questions.Do you think the stewards were being harsh on Oscar Piastri in giving him a 10-second penalty for his part in the collision with Kimi Antonelli and Charles Leclerc, when most other people thought it was a racing incident? - AndrewIt's easy to see why Piastri was penalised for the incident, when you read the FIA's driving standards guidelines.They say that to be entitled to be given room when overtaking on the inside, the overtaking car must:\"Have its front axle at least alongside the mirror of the other car prior to and at the apex; and be driven in a fully controlled manner particularly from entry to apex, and not have 'dived in'.\"Although Piastri was almost fully alongside Antonelli on the pit straight and entering the braking zone, his front axle was no longer alongside the mirror of Antonelli's car at the apex.He also locked up his front left tyre, which presumably gave the stewards the impression that he was not \"fully controlled\".The stewards report said Piastri \"did not establish the required overlap prior to and at the apex\" and \"locked the brakes as he attempted to avoid contact by slowing, but was unable to do so and made contact\". They concluded that Piastri was \"therefore wholly responsible for the collision\".So, yes, the guidelines say the penalty was justified.But was it right?Image source, Getty ImagesImage caption, Behind leader Lando Norris, the Mercedes of Kimi Antonelli has just been knocked off line after contact with Oscar PiastriThe problem with the guidelines is that they are being applied to the letter, without what some would consider giving proper consideration to the reality of racing.If a driver is almost fully alongside another car heading to the braking zone, they are absolutely entitled to make the move. And the guidelines imply that, too.On the inside, a driver has to brake earlier because of their narrow trajectory, so the relative position of the cars will change on corner entry. This is especially the case if the track is still slightly damp after rain.Should that mean the driver is not entitled to be given room? Should they be required to back out at this point? Is that even feasible? Should it mean the driver should not go for the move in the first place?There is an argument that Antonelli knew Piastri was on the inside, and would have been wise to give him more space, rather than cut in towards the apex so much and risk contact.In this case, Charles Leclerc, who was taken out by Antonelli after the collision between Piastri and the Italian, said: \"Oscar was optimistic, but Kimi knew that Oscar was on the inside, I think, and he kind of did the corner like Oscar was never there.\"For me, the blame is not all on Oscar. It was optimistic, but this could have been avoided. I wouldn't go as far to say it's all of Oscar's fault. I don't think it is.\"Piastri said: \"I had a very clear opportunity up the inside, went for it. Yes, there was a lock-up, but I was firmly on the apex, on the white line. I couldn't go any further left, and I can't just disappear.\"Antonelli said: \"I found myself in a very difficult position because I had one car on the outside and one car on the inside. I tried to brake late, not too late. The problem is I didn't see the car next to me any more. I still tried to do a decent line for the position I was in. And, yeah, ended up getting hit.\"Ultimately, these are subjective questions on which opinions will vary.What can be said for certain is the drivers, as a general overview, are not that happy with the guidelines, or the manner in which they are being applied. This has come up time and again this year. It does seem like some kind of review is required.Could the new 2026 regulations be Lewis Hamilton's saving grace? And if Ferrari get the car wrong again, what's the risk of Charles Leclerc and Hamilton moving on to different teams? - LauraLewis Hamilton had another difficult race in Brazil.He qualified 13th while team-mate Charles Leclerc was third. Hamilton was hit by Carlos Sainz at the first corner, damaging his car, and then misjudged a passing move on Franco Colapinto's Alpine at the start of the next lap and took off his own front wing.After what has undoubtedly been a difficult maiden season at Ferrari, it's little wonder that he said afterwards: \"This is a nightmare, and I have been living it for a while.\" Hamilton went on to say: \"I believe there is something extraordinary up ahead in my life and in my destiny. I truly still believe in this team and what we can achieve together.\"In terms of his overall form, there is no question that Hamilton has improved as the season has gone on - since the summer break, he is down only 0.099 seconds on average on Leclerc in qualifying. That number is 0.128secs for the year.At the same time, Hamilton has made no secret of the fact that he does not really get on with the current era of cars. They don't suit the way he likes to brake late and pitch the car into the corner, and he hopes the 2026 cars, following the introduction of new rules, will be better suited to him.As for his future, Ferrari have not said how long his contract is. But I have been hearing for a while that Hamilton is on a firm three-year deal at Ferrari - ie, to the end of 2027 - and an exchange he had with the media in Brazil did seem to confirm this.He was asked when he expected to start negotiations on a new contract, and he replied: \"I have a pretty long contract. Normally, when you do a contract, it's usually the year before (it ends) you start to talk about it. I'm a little bit far from that right now.\"He was asked whether that meant he would be doing so next year, and he replied: \"No.\"The length of Leclerc's contract has not been officially revealed by Ferrari, but it is said to run until 2029. Of course, there may be options in there that could see him leave earlier. Max Verstappen's drive in Sao Paulo was quite reminiscent of Lewis Hamilton in 2021, the common theme being they had a new engine. Is Brazil a track where this has a greater impact than others? Should other drivers consider it as an out-there strategy call, or was it only possible because of the huge talent of those two drivers? - TomIt's extremely rare that a driver can achieve this sort of a result after starting from the pit lane. Verstappen's achievement in Brazil matched those of Jarno Trulli in Australia in 2009, Sebastian Vettel in Abu Dhabi in 2012 and Lewis Hamilton in Hungary in 2014.A new engine definitely gives a small performance advantage, but Verstappen's drive on Sunday was much less to do with that than two other things - Red Bull's change to the car's set-up, and Verstappen's own genius.The fact that he did it after being dropped to the back again by his pit stop for a puncture on lap six, having already climbed to 13th, was all the more impressive.Having said that, it's not all that rare for a driver who has qualified badly to make a pit-lane start, as it means changes can be made to the car with the intention of making it faster in the race.That's exactly the strategy Red Bull employed in Sao Paulo.But the difficulty of overtaking in F1, and the fact that very few drivers could have achieved what Verstappen did, means it's highly unlikely to become a strategic option outside those specific circumstances.A Mercedes customer team has comprehensively beaten the works team for two years in a row. If McLaren start next season still ahead of Mercedes, at what point does it start to be a real problem for the works team? - James Mercedes obviously don't ever want to be beaten by McLaren, and certainly don't want it to keep happening. They want to win themselves.But motorsport director and F1 team principal Toto Wolff always says when asked about this that if Mercedes can't win, the next team he would want to do so would be a Mercedes customer, because at least then Mercedes are still winning.McLaren's success has helped ensure Mercedes-powered cars have won all but two of the constructors' titles since the start of the hybrid era in 2014, missing out only in 2022 and 2023, when Red Bull-Honda were at their most dominant.McLaren beating the works team can't make Wolff's life that comfortable, but Mercedes do not give the impression that this is an existential question for them.Their presence in F1 is based on the fact that they believe the investment is rewarded by the publicity value of having a competitive team, in concert with the technological benefits for the whole company of being at the forefront of motorsport.It's also worth saying that supplying engines to customers makes money for Mercedes and helps offset the research and development costs of their F1 engine programme. In total, it made them about £90m last year, taking into account fees for engines and dividends.Mercedes have been in F1 for more than 30 years, regardless of whether you pick their formal works entry with McLaren in 1995 or their \"concept by Mercedes\" branding with Sauber in 1993 as their starting point. And they are in it for the long haul.Get in touchSend us your question for F1 correspondent Andrew Benson",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "F1 Q&A: Piastri-Antonelli collision, Hamilton and Ferrari, Verstappen's Sao Paulo drive and McLaren beating Mercedes",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/284a/live/0ef689d0-bdaf-11f0-8669-5560f5c90fbe.png"
      ],
      "datePublished": "2025-11-11T08:00:23.000Z",
      "dateModified": "2025-11-11T08:00:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reinventing Football: Which laws should change? Handball? Offside? Penalties?",
    "url": "https://www.bbc.com/sport/football/articles/ckgk1vglkepo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10c2/live/8d887350-bec5-11f0-8669-5560f5c90fbe.jpg",
    "tag": "Trending",
    "date": "2025-11-11T06:08:23.000Z",
    "description": "Reinventing Football - what do we do with handball, penalties and VAR?Media caption, What if pundits could change one thing about football...ByDale Jo",
    "body": "Reinventing Football - what do we do with handball, penalties and VAR?Media caption, What if pundits could change one thing about football...ByDale JohnsonFootball issues correspondentImagine a world in which you could reinvent football.It's a dream, of course. Just a bit of fun. But stick with us.What if you had the power to change any of the game's laws and potentially bring to an end countless hours of discussion about handball, offside, video assistant referees, or anything else you want to?In that spirit, we asked players, pundits and even referees what football could look like if we ripped up the rulebook and started afresh.Think of it as a manifesto for reinventing the game so many of us love. Here's what we came up with...Penalties: Make the punishment fit the crimeThink here about that relatively innocuous trip as an attacker is moving away from goal - or a handball decision when there's no immediate likelihood of a goal.The result? A penalty - and a very high chance of a goal (historically, Opta says, 78%) when no such opportunity existed.Is it fair, for example, that Brentford were given such a high chance of scoring when Liverpool defender Virgil van Dijk tapped the boot of Dango Ouattara right on the edge of the 18-yard area last month?Is a shot from 12 yards with only the goalkeeper to beat a just punishment? We already define an obvious goalscoring opportunity for a red card, so we'd only have to tweak this to any kind of scoring chance for a penalty. If it's a foul with no clear attacking impact, why not a free-kick?Could this incentivise defenders to bring opponents down in areas where a penalty would not be the result? Any deliberate or cynical act would still result in a spot-kick.Penalties: One and done - no more reboundsImage source, Getty ImagesImage caption, Goals scored from rebounds on penalties have produced exhilarating, match-defining moments   Imagine when a penalty is saved or hits the woodwork and bounces back into play that the game is stopped and the ball given to the goalkeeper.Pierluigi Collina - perhaps the most famous football referee of all time, and now head of Fifa's referees' committee - is already on board.Collina argues that if the attacking team have squandered such a big chance of scoring, why should they be allowed a second or even third opportunity?In recent campaigns an average of just under three goals a season have been scored in such circumstances, so is it really that important?And would we want to risk losing some of the game's most memorable moments?Think Chloe Kelly's 119th-minute goal for England against Italy in the semi-final of Euro 2025. Or Liverpool's Xabi Alonso netting at the second attempt against AC Milan in their dramatic comeback in the second half of the 2005 Champions League final. Or Harry Kane's winning goal for England against Denmark at Euro 2020.If this adaptation was made, the look of the pitch could change, too - because the 'D' at the edge of the penalty area to keep players 10 yards away from the ball at a spot-kick would no longer be needed.VAR: Bring in a challenge systemImage source, Getty ImagesImage caption, Football Video Support - a Fifa-trialled challenge system - gives each team two chances to request a review of a referee's decisionWill VAR ever be accepted? Perhaps not in its current form, so how about adapting it to a challenge system? You might not have heard of Fifa's Football Video Support (FVS), which is being trialled in several leagues including Liga F - the top flight of the women's game in Spain.Under FVS, a coach is given two challenges per game. When they are activated, the on-field referee goes to the monitor to watch the incident back and make a decision. There isn't a VAR poring over the footage, just a replay operator to show the incident to the referee.Everton and England goalkeeper Jordan Pickford likes the theory.\"With VAR involved, I'd do it like cricket,\" Pickford said. \"They've got two decisions and the captain has got to make sure they review at the right time, in so many seconds. I think that would keep the speed of the game up, and keep it flowing.\"Sound good? It has its merits. The assumption is there will be better final outcomes, though trials have shown that's not always the case, and mistakes are still made by a referee at the screen.Match of the Day presenter Gabby Logan thinks there's a different way of doing it.\"It's to have a time limit on VAR,\" she said. \"We all agree now it's here to stay, and it often does good things, but the time it can take is tiresome. It stops the game. People get angry with it.\"If it was 90 seconds only, I think we'd sort a lot of that out because if it's not clear and obvious in 90 seconds, it's not clear and obvious.\"But for former England defender Stephen Warnock, the solution is simpler - get rid of VAR.\"I'm fed up of players not celebrating goals, the fans not knowing what's going on in the stadium, and there's far too many inconsistencies with it and it's down to human error which is still a massive problem,\" he said.Reinventing FootballTuesday 11 November from 21:30 GMTVAR offsides: Lose the microscopic techImage source, Getty ImagesImage caption, In Major League Soccer, offside decisions are made with the naked eye. In the Premier League, fans are shown an image which is often unclearThe concept of offside is very different from its first iteration in 1863 when - a little bit like rugby - you were offside if you were in front of the ball.Three years after its introduction, the law changed to consider the position of the defenders closest to their own goal, and it hasn't altered much since. But the initial idea surely wasn't that players should be penalised for having a toe in front of the 'offside line'? After all, you only had the judgement of the assistant.We're told VAR tech is uber-reliable, but we're in the hands of AI and a VAR who has to manually confirm a frame that might not be the exact point the ball has been played anyway. And how confusing can those animations be?So, how about ditching the microscopic tech, and just relying on a TV picture with no lines or funky graphics and an official's eye?That's how it's done in Major League Soccer - largely because of problems with wildly differing stadium configurations.The VAR looks at the images and decides if it's possible the assistant has got the decision wrong. If so, the referee is sent to the monitor to look. In other words, MLS judges offside at the clear and obvious threshold and not to millimetres.Would TV companies still draw their own lines? Probably, which would undoutedly mean the controversy around offside decisions would not dissipate.Premier League referee Anthony Taylor had a more radical suggestion.\"One of the best tournaments I refereed in was a prison officer tournament and we had no offside... and we had so many goals it was unbelievable,\" he said. \"So maybe scrapping offside might be the answer.\"Handball: Make it like it used to beIf you asked a football fan to define handball a decade ago, you'd get a simple answer, like: \"Ball to hand isn't a penalty.\"Put that question to them today, and they probably wouldn't know where to start.Former England captain Alan Shearer pointed to some of the phraseology that has come into the football lexicon around handball as he called for change.\"Proximity... obvious position... not in an obvious position... natural,\" he said. \"For me, it's pretty simple - is it deliberate handball or not?\"Some of the confusion has come from a big rewrite of the lawbook in 2019, when the considerations for handball went from just three lines to an entire page. Referees were served with a whole menu of reasons to give handball.The aim was to give a \"clearer and more consistent definition and interpretation\". What it brought was consistently more penalties, because there were many more reasons to give one.The micro-definition of handball has left people guessing, so how about getting back to basics? Let the referee make handball decisions how they used to - on instinct.Stop the clock when the ball goes outThis idea has been kicking around for many years, with the intention that if the watch is stopped, teams can't waste time.The plan could be for each half to last 30 minutes, with the clock halted when the ball isn't in play. That guarantees 60 minutes of effective playing time, and means much of the incentive to take vital seconds out of the match is removed.Fans would actually gain rather than lose out, too, with the average ball-in-play time this season 55 minutes 05 seconds - 114 seconds down from last season.It's not a magic bullet, because teams who are looking to see out a lead - or hold on to a draw - could still go slowly to break up the momentum of the opposition.And if the clock is going to stop, how long will it take to play 60 minutes? There's no clear footprint for the match. The average 60-minute NFL game takes more than three hours to complete.Introduce tactical timeoutsFor this, we turn to former Wales captain Ashley Williams.\"I would give each team at least one timeout per half, and you can use that whenever you want,\" he said.\"It might be before a corner, before a free-kick, if someone's injured. If the manager needs to get hold of their team and change something, I'd let them have a timeout like they do in other sports.\"The modern trend seems to be for teams to secure themselves an 'unofficial' tactical timeout by telling a goalkeeper to go down injured, though we should point out - for the avoidance of doubt - that sometimes goalkeeper injuries are genuine!As the physio runs on, all of the outfield players head over to the technical area for a team talk. When the manager has passed on his key messages, the goalkeeper is often fine to play on.This little interlude can change the direction of a game, and adversely impact the opposition. While they have the chance to speak to their manager too, it often is the case that they don't need to change anything, so any team talk has less impact.Would an allocated tactical timeout stop this? In some cases, but not all.So how about banning players from going over to the touchline as a group? Or if a goalkeeper needs attention from a physio, their team has to nominate an outfield player to go off for 30 seconds instead?Bring in bonus points - and punish 0-0 drawsArsene Wenger, when he was manager of Arsenal, often spoke about giving teams extra points to award attacking play.It never caught on widely, though he did get his way in the pre-season Emirates Cup in the summer of 2009. There, clubs were awarded three points for a win plus an extra point for every goal scored.Former Manchester City defender Nedum Onuoha is thinking along the same lines.  \"I like the idea of a bonus point for every time you score two goals,\" he said. \"Instead of just getting three points, you score two goals and that's four points. You score four goals, that's five points. \"From an attacking perspective, you can really start to climb the ladder. You'll see more goals in the league, which means fans would be more entertained.\"There's another option.Former Barcelona and Manchester United defender Gerard Pique flipped the logic earlier this year by suggesting teams should get zero points if a match ends 0-0.Pique believes boring games would explode into life for the final 20 minutes because a 0-0 draw would give teams as many points as a 1-0 defeat.The counterpoint is there could times it would be more advantageous to take the same points as the opposition - even if that's zero - rather take a risk and be three worse off.Let players take quick free-kicks to themselvesConsider these two scenarios:  a player is breaking forward and is brought down by a tactical foul, or a goalkeeper comes out of his area and boots the ball into the crowd.Play often can't restart instantly, because a team needs to set up. But what if a player could take a free-kick, throw-in or corner to themselves and run with the ball?It might seem a little out there, but it would make the game faster and might even bring more goals.Former England midfielder Danny Murphy said: \"It's your advantage, you've got the ball, so why do you have to pass it to somebody else so you can get the game going quickly?\"Murphy also had a more radical suggestion, saying if anyone is caught cheating or diving, the other team should be awarded an automatic penalty.Make the goals biggerImage source, Getty ImagesImage caption, At 6ft 9in, Kjell Scherpen set a record as the tallest goalkeeper to play in the Premier League when he was at Brighton  In 1996, former Fifa president Sepp Blatter wanted to increase the size of football goals by 50cm in width and 25cm in height, but didn't have enough support.Is it time to look again?The size of the goals - 24ft wide and 8ft high – hasn't changed in 150 years.But the average height of people has increased in that time, which would suggest goalkeepers are now at an advantage.There are two sides to this, though.In 1875, footballs were made of hand-stitched leather, often weighed down by the rain. Today they are lightweight and made of synthetic leather and designed to aid movement through the air.Goalkeepers would argue that any advantage they have is only matched by the evolution of the ball and the athleticism of outfield players. Do attackers really need more goal to aim at?",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reinventing Football: Which laws should change? Handball? Offside? Penalties?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10c2/live/8d887350-bec5-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-11T06:08:23.000Z",
      "dateModified": "2025-11-11T06:08:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mr Burton",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002m3tl/mr-burton?at_mid=FCqiGdjR3M&at_campaign=Mr_Burton&at_medium=display_ad&at_campaign_type=owned&at_nation=WLS&at_audience_id=SS&at_product=iplayer&at_brand=m002m3tl&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Mr_Burton&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mcr9fp.jpg",
    "tag": "Trending",
    "date": "2025-11-10T06:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeMr BurtonMr BurtonFilm biopic about the power of an inspirational teacher and how talent can sometimes transcend the circumstances in which it is found. Duration1h 59mFirst shown2025Available for over a yearWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesHarrietBe free or die trying. An extraordinary true story of courage, sacrifice and freedom1h 56mThe Tommy Steele StoryThe sensational success story of Britain's first rock 'n' roll teen idol1h 18mThe Life and Death of Peter SellersNever judge a man by his cover. The comedic genius who could play anyone - except himself1h 54mHattieWhat a carry on. How actress Hattie Jacques' home life was shattered by a secret affair1h 25mSelmaOne dream can change the world. Oscar-winning biopic of Martin Luther King's 1965 march1h 59mHero: The Extraordinary Life of Mr Ulric CrossThe rise of a hero. Biopic inspired by the world-changing Trinidadian freedom fighter1h 46mBlinded by the LightFor anyone with dreams. A feel-good true story with words and music of Bruce Springsteen1h 49mOdetteAnna Neagle stars in a stirring spy drama based on a wartime heroine's true story1h 52mBurton and TaylorHollywood's glamorous, fiery stars - the celebrity 'it' couple, together one last time1h 22mA Song for JennyLove, tragedy and grief. A mother's story of losing her daughter in a terrorist attack1h 17mBabsFrom cockney kid to queen of soap, the inspiring, heartwarming story of Barbara Windsor1h 28mFear of FannyJulia Davis stars as the culinary icon who whisked up a storm with her food and fashion1h 19m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mr Burton",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mcr9fp.jpg"
      ],
      "datePublished": "2025-11-10T06:00:00.000Z",
      "dateModified": "2025-11-10T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why War? The Einstein-Freud Letters - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/m001tr2s?at_mid=1gnEePe6cS&at_campaign=Why_War_The_Einstein_Fraud_Letters&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=sounds&at_brand=m001tr2s&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Why_War_The_Einstein_Fraud_Letters&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0h22621.jpg",
    "tag": "Trending",
    "date": "2023-12-29T17:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·29 Dec 2023,·28 minsWhy War? The Einstein-Freud LettersAvailable for over a yearIn 1932 the world-famous physicist Albert Einstein wrote a public letter to the founder of psychoanalysis, Sigmund Freud. Einstein, a keen advocate of the League of Nations and peace campaigner, asked Freud if he thought war and aggression was forever tied to human psychology and the course of international relations: could we ever secure a lasting world peace? \nEinstein’s letter is deeply prescient, as is Freud’s extraordinary response. The exchange was titled ‘Why War?’. The two thinkers explore the nature of war and peace in politics and in all human life; they think about human nature, the history of warfare and human aggression and the hope represented by the foundation of the League of Nations (precursor to the UN) and its promise of global security and a new architecture of international law. \nAt the time of their exchange, Freud is in the last great phase of his career and has already introduced psychoanalysis into the field of politics and society. Einstein, the younger of the two, is using his huge international profile as a physicist for political and pacifist intervention.\nFor Einstein, future world security means a shared moral understanding across the global order - that humankind rise above the ‘state of nature’ never to devolve into total war again. He wrote to Freud, as 'a citizen of the world…immune to nationalist bias...I greatly admire your passion to ascertain the truth. You have shown how the aggressive and destructive instincts are bound up in the human psyche with those of love and the lust for life. At the same time, you make manifest your devotion to the goal of liberation from the evils of war...’ Is it possible, Einstein asks Freud, to make us 'proof against the psychoses of hate and destructiveness?'. Freud's answer is fascinating and quite unexpected.  \nThe exchange of letters was sponsored by the International Institute of Intellectual Cooperation, an organisation promoting global security by using prominent thinkers, drawing on multiple fields of knowledge (from science to psychology, politics and law) to achieve a new language for international peace, following the lessons learned from the Great War of 1914-18. \nBut even as Einstein wrote to Freud in the summer of 1932, the Nazi party became the largest political party in the German Reichstag. Both men felt a sense of apprehension about what was coming; both were pacifist, both Jewish, both would be driven into exile (both Einsteinian physics and Freudian psychoanalysis were denounced by the new regime). The letters were finally published in 1933 when Hitler came to power, suppressed in Germany, and as a result never achieved the circulation intended for them. \nFeaturing readings from the Einstein–Freud letters and contributions from historians of warfare and psychoanalysis, war journalism and global security, this feature showcases the little-known exchange between two of the 20th century’s greatest thinkers, ‘Why War?’ – a question just as relevant in today’s world.\nContributors include historian of war and peace Margaret MacMillan, BBC chief international correspondent Lyse Doucet, defence and security expert Mark Galeotti, historian of international relations Patrick O Cohrs, author Lisa Appignanesi, who has written on Freud and the history of psychoanalysis, and Faisal Devji, historian of conflict and political violence in India and the Middle East. \nReadings are by Elliot Levey (Einstein) and Henry Goodman (Freud) \nProduced by Simon Hollis\nA Brook Lapping production for BBC Radio 4Programme Website",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why War? The Einstein-Freud Letters - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0h22621.jpg"
      ],
      "datePublished": "2023-12-29T17:00:00.000Z",
      "dateModified": "2023-12-29T17:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Americanswers on 5 Live! Why is Donald Trump threatening to sue the BBC for $1 billion? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mfxsk5?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-11-10T20:07:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·10 Nov 2025,·33 minsAmericanswers on 5 Live! Why is Donald Trump threatening to sue the BBC for $1 billion?AmericastAvailable for over a yearPresident Donald Trump has threatened to sue the BBC for $1 billion over how the editing of his speech in a Panorama documentary, calling it \"false and defamatory\". The BBC chair Samir Shah has apologised for an \"error of judgement\" over the edit, and said the BBC was considering how to respond to Trump.\nMatt Chorley, Justin, Anthony and Marianna discuss what Trump actually said in his January 6th speech, Trump’s long battle with the mainstream media, and what this could mean for the BBC.\nWe also look at the US government shutdown, Elon Musk launching a rival to Wikipedia, and whether a return of Barack Obama to politics could be possible.  \nHOSTS:\n* Justin Webb, Radio 4 presenter\n* Anthony Zurcher, North America correspondent\n* Marianna Spring, Social Media Investigations correspondent \nGET IN TOUCH:\n* Join our online community: https://discord.gg/qSrxqNcmRB\n* Send us a message or voice note via WhatsApp to +44 330 123 9480\n* Email Americast@bbc.co.uk\n* Or use #Americast\nThis episode was made by Rufus Gray with Alix Pickles and Grace Reeve. The technical producer was Ben Andrews. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app.\nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155\nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Americanswers on 5 Live! Why is Donald Trump threatening to sue the BBC for $1 billion? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-11-10T20:07:00.000Z",
      "dateModified": "2025-11-10T20:07:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Trump Threatens To Sue BBC For One Billion Dollars - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mfxvp7?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-11-10T20:40:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·10 Nov 2025,·32 minsTrump Threatens To Sue BBC For One Billion DollarsNewscastAvailable for over a yearToday, President Trump has threatened to sue the BBC for $1bn. \nIn a latter to the corporation Trump’s legal team demands the BBC “immediately retract” a Panorama programme which edited a speech he made calling it “false and defamatory”.\nIt comes as BBC chair Samir Shah apologised for an \"error of judgement\" over the edit, and said the BBC was considering how to respond to Trump.\nBBC director general Tim Davie and CEO of BBC news Deborah Turness resigned on Sunday night, after a leaked memo criticised a 2024 Panorama programme about the US president.\nAdam and Chris are joined by Chief Washington Presenter Caitriona Perry and Media and Culture Editor Katie Razzall. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren. The social producer was Sophie Millward. The technical producer was Phil Bull. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Trump Threatens To Sue BBC For One Billion Dollars - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-11-10T20:40:00.000Z",
      "dateModified": "2025-11-10T20:40:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Epping hotel can continue housing asylum seekers, judge rules",
    "url": "https://www.bbc.com/news/articles/c8x1wz8jz0yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0f2c/live/60f697b0-1203-11ef-82e8-cd354766a224.png",
    "tag": "Trending",
    "date": "2025-11-11T12:21:35.000Z",
    "description": "Just nowBBCAsylum seekers can continue living at an Essex hotel after a council lost a landmark legal battle to remove them at the High Court.Epping F",
    "body": "Just nowBBCAsylum seekers can continue living at an Essex hotel after a council lost a landmark legal battle to remove them at the High Court.Epping Forest District Council sought to block migrants lodging at The Bell Hotel in Epping by arguing its owner had flouted planning rules.Mr Justice Mould dismissed the claim on Tuesday, ruling an injunction was \"not an appropriate means of enforcing planning control\".A wave of protests were staged outside the hotel in the summer, following the arrest of an asylum seeker living there who was later jailed for sexual offences.The judge said he accepted \"the criminal behaviour of a small number of individual asylum seekers\" housed at the hotel had \"raised the fear of crime\" among locals.But he rejected the idea that hotel owner Somani Hotels had shown a \"flagrant or persistent abuse of planning control\".It was also said there was a \"continuing need\" to house asylum seekers with pending asylum claims, \"so that the Home Secretary can fulfil her statutory duties\".This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version.You can receive Breaking News on a smartphone or tablet via the BBC News App. You can also follow @BBCBreaking on X to get the latest alerts.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Epping hotel can continue housing asylum seekers, judge rules",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0f2c/live/60f697b0-1203-11ef-82e8-cd354766a224.png"
      ],
      "datePublished": "2025-11-11T12:21:35.000Z",
      "dateModified": "2025-11-11T12:21:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-11-11T07:07:10.000Z",
    "description": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and p",
    "body": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-11-11T07:07:10.000Z",
      "dateModified": "2025-11-11T07:07:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kate and Queen lay Armistice Day wreaths as nation pays tribute",
    "url": "https://www.bbc.com/news/articles/cj41g5w0vgno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/842f/live/9cf37ac0-bef6-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "Trending",
    "date": "2025-11-11T12:18:04.000Z",
    "description": "The Princess of Wales and the Queen have joined services to mark Armistice Day in the UK as events took place around the world.Catherine stood at the ",
    "body": "The Princess of Wales and the Queen have joined services to mark Armistice Day in the UK as events took place around the world.Catherine stood at the ceremony at the National Memorial Arboretum in Staffordshire, where the Last Post signalled the start of a national two-minute silence at 11:00 GMT to mark the end of World War One.Queen Camilla was at Paddington Station in London for the wreath-laying ceremony, having travelled by train.The Prince of Wales has also delivered a video message to young people, sharing his views on the importance of wearing a red poppy and to say that \"remembrance is for everyone\".It was the first time Catherine had attended the service at the National Memorial Arboretum.She laid a wreath in the centre of the armed forces memorial, watched by a crowd which included veterans and their families.Catherine appeared to take a moment of reflection before returning to her seat where she bowed her head as the crowd prayed for those who had been affected by conflict.The Prince of Wales' message was a virtual event for children between nine and 14 in the UK.In it he says: \"When we remember, we connect with service in a personal way.\"We learn from the courage of others, and we carry their stories forward, so they are not forgotten.\"It's not just about the past - it's about shaping who we become in the future.\"Remembrance teaches us empathy, resilience and responsibility.\"And when we wear a red poppy or take a moment of silence, we are saying, 'Thank you. We have not forgotten, and we will not forget'.\"Meanwhile, the service in Staffordshire featured the reading of a specially- commissioned poem by the arboretum's poet in residence, Arji Manuelpillai.\"A Sonnet For Us All captures the stories etched into the hundreds of memorials within the National Memorial Arboretum, it invites people to listen, reflect and consider the emotion that was the inspiration for these sculptures,\" Mr Manuelpillai said.\"These human connections, and the gentle responsibility to carry love forward, are themes that resonate not only with me, but also with HRH The Princess of Wales, for whom the importance of service and compassion lies especially close to the heart.\"Queen Camilla joined commuters on the 09:28 train from Chippenham in Wiltshire to Paddington where a service was held for service personnel and their families.Later on Tuesday, William will join the King and Queen at Windsor Castle where a reception will honour veterans who served in the Pacific during the Second World War.The event, which the Duke of Edinburgh and the Duchess of Gloucester will also attend, continues the commemorations for the 80th anniversary of VJ Day - or Victory over Japan Day.Elsewhere around the world French President Emmanuel Macron attended a wreath-laying ceremony in the Champs-Elysees in Paris to mark the signing of the armistice at the 11th hour of the 11th day of the 11th month.Meanwhile the Princess Royal is in Australia, visiting Brisbane's Galipolli Barracks where she laid a wreath.Along with her husband, Sir Timothy Laurence, Princess Anne also met current and former armed forces and their families.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kate and Queen lay Armistice Day wreaths as nation pays tribute",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/842f/live/9cf37ac0-bef6-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-11T12:18:04.000Z",
      "dateModified": "2025-11-11T12:18:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Three easy ways to help you beat the winter blues",
    "url": "https://www.bbc.com/news/articles/c051mdgd1ddo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a78b/live/b2f4e990-bed2-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "Trending",
    "date": "2025-11-11T04:06:31.000Z",
    "description": "8 hours agoEmily HoltBBC NewsGetty ImagesNow the clocks have gone back and the evenings are darker, many of us are trudging to work and back in the da",
    "body": "8 hours agoEmily HoltBBC NewsGetty ImagesNow the clocks have gone back and the evenings are darker, many of us are trudging to work and back in the dark and sometimes our mood is lower as well.We can feel more tired than normal, lack energy or find it difficult to concentrate. Seasonal Affective Disorder (SAD), or \"winter depression\" can affect anyone. For those struggling to stick to their normal daily activites, the NHS advises contacting their local GP. For those with milder symptoms, here are three ways to help you manage the darker days and even embrace them.1. Focus on what you can do Getty ImagesPsychologist Kari Leibowitz says growing up in the US in a summer-centric town meant she used to view winter as limiting and uncomfortable, but travelling to Norway where some places get almost no daylight in the depths of winter changed her mindset.She found that instead of people succumbing to a darker mood, they embraced their circumstances, finding different hobbies from snow sports to knitting and cooking. \"They're looking at winter as a time of year that's full of opportunities,\" she says. Kari said it taught her that changing your approach to focus on what you can do during this time, rather than what you can't, was surprisingly effective.This could include winter walks, movie nights, cooking a new meal or ice skating.\"So often we only focus on the things that are harder to do in the winter when really there's a whole world of seasonal activities that feel better when it's cold out.\" 2. Accept you need more restGetty ImagesWith our work and social calendars ticking along as normal, we may wonder why we feel so tired but Kari says we need to accept our bodies need more rest in winter.\"It's actually good not to be as productive or active as you would be during the summer months because our bodies are biologically hardwired for rest during winter,\" she says. Just like animals and plants, she says we should be slowing down and changing our behaviour.Dr Em May Armstrong, a plant researcher, says the key is finding the balance between resting more and becoming too lethargic. She suggests so called \"active dormancy\" - mixing a slower restful lifestyle with activities that still keep us mentally engaged. This could include activities such as knitting, repairing clothes or practices that help get you ready for the year ahead. \"And while that's not as active as, say, travelling or camping, it's just as active in a more restorative way.\"3. Make plansGetty ImagesWhile resting more is natural, it is still important to make time for the things that make us happy and to mix with other people, according to GP Gavin Francis.\"We're very social animals, even the most solitary human being doesn't live completely alone. We all depend on others.\"He suggests planning activities in advance, focusing on spending time with those who make you feel good, and activities which can boost your mood.Doing this means you're committed, and a low mood nearer the time won't be able to stop you.\"You can then start planning in your diary to do more things with these people over winter,\" he says. Simple practical things to improve your mood, such as making sure you get a good night's sleep, avoiding too much alcohol or late night parties and maintaining a healthy diet are also important, he says.\"These things are not rocket science, but they're really fundamental to having a good, healthy circadian rhythm and a good healthy physiology through the winter.\"  Other stories you may enjoy",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Three easy ways to help you beat the winter blues",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a78b/live/b2f4e990-bed2-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-11T04:06:31.000Z",
      "dateModified": "2025-11-11T04:06:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Government sets out plan to phase out animal experiments ",
    "url": "https://www.bbc.com/news/articles/cm2lpekjeg9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d273/live/6c5d1150-be38-11f0-9e99-d1007b558636.jpg",
    "tag": "Trending",
    "date": "2025-11-11T08:34:24.000Z",
    "description": "4 hours agoPallab GhoshScience CorrespondentGettyDrug tests on rabbits could end by the end of the yearThe government has detailed for the first time ",
    "body": "4 hours agoPallab GhoshScience CorrespondentGettyDrug tests on rabbits could end by the end of the yearThe government has detailed for the first time how it aims to fulfil its manifesto pledge to work toward phasing out animal testing.The new plans include replacing animal testing for some major safety tests by the end of this year and cutting the use of dogs and non-human primates in tests for human medicines by at least 35% by 2030. The Labour Party said in its manifesto that it would \"partner with scientists, industry, and civil society as we work towards the phasing out of animal testing\".Science Minister Lord Vallance told BBC News that he could imagine a day where the use of animals in science was almost completely phased out but acknowledged that it would take time.Animal experiments in the UK peaked at 4.14 million in 2015 driven mainly by a big increase then in genetic modification experiments – mostly on mice and fishBy 2020, the number had fallen sharply to 2.88 million as alternative methods were developed. But since then that decline has plateaued. Lord Vallance told BBC News that he wants to re-ignite the fast downward trend by replacing animal testing with experiments on animal tissues grown from stem cells, AI, and computer simulations.Asked by BBC News if he could envisage a world where animal tests were \"near zero\", he said: \"I think that is possible, it's not possible anytime soon, the idea that we can eliminate animal use in the foreseeable future, I don't think is there.\"Can we get very close to it? I think we can. Can we push faster than we have been? I think we can. Should we? We absolutely should.\"\"This is a moment to really grasp that and drive these alternative approaches,\" he said.According to the government's newly detailed plans, by the end of 2025, scientists will stop using animals for some major safety tests and switch to newer lab methods that use human cells instead.As a former government chief scientific advisor and former head of research for a major pharmaceutical company, he will know that many scientists believe reaching \"near zero\" tests on animals will be extremely difficult, even in the longer term. That includes those who are the greatest advocates of non-animal methods.\"I very strongly believe that that is not possible for reasons of safety,\" said Prof Frances Balkwill, of Barts Cancer Institute, Queen Mary University of London.Prof Balkwill is working on finding ways stop ovarian cancer recurring, using mice as well as non-animal approaches, of which she is a huge fan.\"These non-animal methods will never replace the complexity that we can see when we have a tumour growing in a whole organism, such as a mouse,\" she said.Kevin Church/BBC NewsThis organ on a chip can hold small amounts of human cells from different organs and be used in place of animals for some types of experimentsOne of the world's leading centres for developing alternatives to animal testing is the Centre for Predictive in vitro Models (CPM) at Queen Mary University of London.Researchers here are developing the extraordinarily sounding \"organ-on-a-chip\" technology, conjuring up alarming images of throbbing brains and beating hearts sitting on top of electronic circuits.The reality, though, is far less sci-fi.Some small pieces of glassware containing tiny samples of human cells from different organs from the body, such as the liver or brain, are connected to electrodes which send information to a computer. What is amazing, said the CPM's co-director, Prof Hazel Screen, is that cells from various parts of the body can be connected together to mimic how different organs work together.\"In theory, you can build any organ on a chip. Then I can use it to test a new drug,\" she said.\"And because we're taking human cells, we should be able to do better quality science.\"The safety tests that the government says will no longer use animals by the end of this year include the practice of giving rabbits a small dose of a new drug – called the pyrogen test. It says this will be replaced by a test using human immune cells in a dish.All tests that used animals to check for dangerous germs in medicine will also be done with cell and gene technologies, the government says.Between 2026 and 2035, the government plans to speed up the use of non-animal techniques, including the organ-on-a-chip devices and artificial intelligence.The proposals group animal tests into two main groups: those which could be immediately replaced because safe and effective alternatives already exist and simply need laws or guidelines to be updated; and others, where alternatives exist, but still need work to prove that they are reliable enough to be widely used.To speed up the latter, the government plans to set up a Centre for the Validation of Alternative Methods. Ministers also promise to give an unspecified increase in funding and investment for developing new alternatives, including £30m for a research hub and more grants to support innovative methods and training.The RSPCA has cautiously welcomed the plan, describing it as a \"significant step forward\",  but has urged the government to deliver.Some scientists working with animal experiments, such as Prof Robin Lovell-Badge, are deeply concerned about what they fear may be a premature push toward alternatives, and its potential negative consequences for science and medicine.\"How about the brain and behaviour? How can you study behaviour in a petri dish? You just can't,\" he says.\"With complex areas of biology where no current non-animal model gets anything close to the real biology, how is forcibly pushing this strategy going to help?\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Government sets out plan to phase out animal experiments ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d273/live/6c5d1150-be38-11f0-9e99-d1007b558636.jpg"
      ],
      "datePublished": "2025-11-11T08:34:24.000Z",
      "dateModified": "2025-11-11T08:34:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "O Yeong-Su: Squid Game star acquitted of sexual misconduct charge",
    "url": "https://www.bbc.com/news/articles/c0qpy1y09qwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ea0e/live/964b3cb0-bed5-11f0-be2d-cdcc797438e5.jpg",
    "tag": "Trending",
    "date": "2025-11-11T09:17:18.000Z",
    "description": "3 hours agoYvette Tan,Singapore and Hosu Lee,SeoulSquid Game star O Yeong-Su has been acquitted of sexual misconduct charges by a court in South Korea",
    "body": "3 hours agoYvette Tan,Singapore and Hosu Lee,SeoulSquid Game star O Yeong-Su has been acquitted of sexual misconduct charges by a court in South Korea. The 81-year-old was charged in 2022 with sexually assaulting a woman twice.  The allegations said that he hugged the woman and kissed her on the cheek against her will.Mr O was found guilty in 2024 and given an eight-month suspended prison sentence, but said he would appeal against the verdict. On Tuesday, a court overturned his sentence, saying he had undergone classes on sexual violence and suggesting that the alleged victim's memory may have been \"distorted\", considering how long ago the incident occurred. The alleged assaults took place in 2017 when Mr O was staying in a rural area for a theatre performance. The alleged victim filed a complaint against Mr O in 2021, but the case was closed in April the same year. The prosecution later reopened the investigation \"at the request of the victim\", according to Yonhap agency. In a statement reported by local media outlets, the Suwon District Court said there was \"doubt\" as to whether Mr O had committed the assault. \"There is a possibility that the victim's memory has been distorted over time, and when there is doubt... the defendant must be given the benefit of the doubt\".However, the statement also went on to say that it was possible Mr O had committed assault, as he had apologised to the victim.The alleged victim later spoke out against the verdict, saying it would not \"invalidate the truth or erase the pain I have suffered\".\"Despite today's ruling, I will continue to speak the truth to the very end,\" she said in a statement released through women's rights organisation Womenlink. Womenlink also criticised the ruling, saying they were \"outraged by a ruling that once again conceals sexual violence in the theatre world\". It is not yet clear if the prosecution will appeal.Speaking to local media outlets after the court ruling, Mr O said he had \"gratitude to the court for its wise judgement\".Mr O rose to international fame after starring in Squid Game, a dystopian drama which sees people competing in deadly versions of traditional children's games.In 2022, he became the first South Korean actor to win a Golden Globe award for best supporting actor in a series, after his performance in the first season of the chart-topping Netflix thriller.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "O Yeong-Su: Squid Game star acquitted of sexual misconduct charge",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ea0e/live/964b3cb0-bed5-11f0-be2d-cdcc797438e5.jpg"
      ],
      "datePublished": "2025-11-11T09:17:18.000Z",
      "dateModified": "2025-11-11T09:17:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Vinted users lash out over sizing changes",
    "url": "https://www.bbc.com/news/articles/c87421v7lzro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/acb8/live/6dd4d670-bef7-11f0-8669-5560f5c90fbe.jpg",
    "tag": "Trending",
    "date": "2025-11-11T12:00:28.000Z",
    "description": "27 minutes agoEmer MoreauBusiness reporterVinted users have been reacting angrily after an update resulted in items being listed as the wrong size.The",
    "body": "27 minutes agoEmer MoreauBusiness reporterVinted users have been reacting angrily after an update resulted in items being listed as the wrong size.The second-hand shopping app has revised its sizing categories for women's and children's clothes but did not contact all users about the change.Many shoppers and sellers have taken to social media saying Vinted listings now show a different size category than originally posted because of the remapping.The company said in a post on its website that the new system was more in line with other platforms. It has advised users to check their listings and manually change the size if necessary, which has left users frustrated.Vinted said in a statement on its website that it was changing the sizing system to make shopping on the app \"easier than ever\".The company said: \"Now, the sizes you see on these listings will be more accurate, especially for items purchased from other countries or international brands.Before the change, the sizes had both a single numeric size and a letter, for instance S/8 or M/10.The new system has a letter and a range such as S/UK 8-10.In some cases, the sizing has been recategorised - for example a size L used to be a 12 but is now a UK 16-18.There are also different numeric size ranges, for instance a XXL/16 size has been changed to XXL/UK 24-26.Stephanie Gallen, from Glasgow, said garments she listed on Vinted with size 14 labels were appearing on the platform as size 20–22.She told BBC News she contacted the firm to clarify whether this was an error but is yet to receive a response.\"If anyone [who is] size 20-22 buys them they're going to be very disappointed,\" she said.Vinted said on its site the new size range \"is more consistent with the sizing you're used to seeing on other platforms\".Charlotte Lunn, from Derby, said she had been left angered by the change as she had to manually change the sizes on \"every single listing\".\"For me this is particularly frustrating, as I'm chronically ill and selling on Vinted has been paramount for me since losing part of my income,\" she said.BBC News has contacted Vinted for comment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Vinted users lash out over sizing changes",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/acb8/live/6dd4d670-bef7-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-11T12:00:28.000Z",
      "dateModified": "2025-11-11T12:00:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Suicide bombing in Islamabad kills 12, says Pakistan's interior minister",
    "url": "https://www.bbc.com/news/articles/cp3x6102p3ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7e22/live/ba59cfa0-beed-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-11T12:09:53.000Z",
    "description": "16 minutes agoCaroline Davies,Pakistan correspondent, Islamabad and Dearbail JordanA suicide attack outside a court in Pakistan's capital Islamabad ha",
    "body": "16 minutes agoCaroline Davies,Pakistan correspondent, Islamabad and Dearbail JordanA suicide attack outside a court in Pakistan's capital Islamabad has killed 12 people and injured at least 27 more, the country's interior minister said.Mohsin Naqvi said a bomber was planning to attack the district courthouse but was unable to get inside.Naqvi said authorities would prioritise identifying the bomber, and that those involved would be brought to justice.Suicide blasts in Islamabad have been rare in recent years. Footage from the scene on Tuesday showed the remains of a burnt out car and a police cordon in place.The 27 people injured are receiving medical treatment, Naqvi said.He added that the attacker detonated the bomb close to a police car after waiting for up to 15 minutes. Footage of the aftermath showed plumes of smoke rising from a charred vehicle behind a security barrier. The incident occurred at 12:39 local time (07:39 GMT).Pakistani President Asif Ali Zardari said he \"strongly condemned the suicide blast\". A lawyer who said he was parking his car outside the court at the time described hearing a \"loud bang\".Rustam Malik told AFP news agency \"it was complete chaos\".\"Lawyers and people were running inside the complex,\" he added. \"I saw two dead bodies lying on the gate and several cars were on fire.\"No-one has claimed responsibility for Tuesday's attack. Pakistani Prime Minister Shehbaz Sharif has claimed that extremist groups \"actively backed by India\" were involved.In a statement, he said that \"terrorist attacks on unarmed citizens of Pakistan by India's terrorist proxies are condemnable\".Delhi has not responded to the accusations. It has previously denied such claims.In a separate incident on Monday, a car exploded in India's capital Delhi, killing eight people and injuring a number of others. The Indian government has not called the incident a terror attack, although the case has been referred to the country's anti-terror body.Indian Prime Minister Narendra Modi said following the attack: \"The conspirators behind this heinous act will not be spared. All those responsible will be brought to justice, no matter how deep the conspiracy runs.\"There is, however, no official word yet on what led to the blast.The last time Pakistan's capital was targeted by a suicide bombing was three years ago when a police officer was killed and several others injured.There have been suicide attacks in other parts of the country in the years since but not in Islamabad. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Suicide bombing in Islamabad kills 12, says Pakistan's interior minister",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7e22/live/ba59cfa0-beed-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-11T12:09:53.000Z",
      "dateModified": "2025-11-11T12:09:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]