[
  {
    "title": "Pirates of the Caribbean: Salazar's Revenge",
    "url": "https://www.bbc.co.uk/iplayer/episode/m000ryd0/pirates-of-the-caribbean-salazars-revenge?at_mid=Ucl6fIUx1a&at_campaign=Pirates_of_the_Caribbean_Salazars_Revenge&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m000ryd0&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Pirates_of_the_Caribbean_Salazars_Revenge&at_bbc_team=BBC&at_creation=Film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p095js24.jpg",
    "tag": "Trending",
    "date": "2025-12-03T01:40:25.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomePirates of the Caribbean: Salazar's RevengePirates of the Caribbean: Salazar's RevengeContains moderate violence.Young Henry Turner promises his father that he will break the curse that binds him to his ship. Henry then seeks out Jack Sparrow to help him locate Poseidon's trident. Duration1h 58mFirst shown2017Available for 26 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesLara Croft: Tomb RaiderShe's all action. The daredevil heroine races against time to recover an ancient relic1h 34mGringoIt’s the business trip from hell for Harold - from law-abiding citizen to wanted criminal1h 41mThe ImpossibleA true story of survival in the Boxing Day tsunami, with Ewan McGregor and Tom Holland1h 41mTell Me LiesThe one you'll never forget. Toxic love, desire and betrayal. Love is a dangerous gameLast ChristmasYou gotta have faith. Kate's life takes an optimistic turn, is it too good to be true?1h 36mEverestThe real-life story of an awe-inspiring expedition that became an epic fight for survival1h 51mAbsolutely Fabulous: The MovieThis season's most wanted. Eddy and Patsy flee to France after a run-in with Kate Moss1h 24mThe MaskStanley Ipkiss is not the man he used to be. The action-packed comedy starring Jim Carrey1h 33mThe Idea of YouFeel everything. The last thing a single mum expected becomes the only thing she wants1h 48mP.S. I Love YouTrue love never dies. Holly can't imagine life without her husband - until she has to1h 58mGladiatorA hero will rise. Russell Crowe and Joaquin Phoenix in Ridley Scott's Oscar-winning epic2h 24mThe MercyThe true story of Donald Crowhurst's bid to sail around the world. Stars Colin Firth1h 35m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pirates of the Caribbean: Salazar's Revenge",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p095js24.jpg"
      ],
      "datePublished": "2025-12-03T01:40:25.000Z",
      "dateModified": "2025-12-03T01:40:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "World Cup 2026 draw: Haaland v Mbappe, Trump & YMCA - best of draw",
    "url": "https://www.bbc.com/sport/football/articles/c3e0n00p205o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f394/live/72125de0-d223-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-12-05T22:20:57.000Z",
    "description": "Haaland v Mbappe, dream ties and YMCA - the best of the World Cup drawImage source, Getty ImagesImage caption, US President Donald Trump was on his fe",
    "body": "Haaland v Mbappe, dream ties and YMCA - the best of the World Cup drawImage source, Getty ImagesImage caption, US President Donald Trump was on his feet dancing along to the Village People's rendition of YMCA at the end of the World Cup drawByBrendon MitchellBBC Sport journalistNext summer's World Cup, at long last, is starting to feel very real.But, while fans of the home nations can finally start marking their calendars and plotting routes through the tournament, Friday's draw in Washington DC was not short of other major talking points.Long before the Village People took to the stage to sing us out with a rendition of YMCA, we were left picking the bones out of a group stage which will see two of the world's best strikers go head-to-head and a knockout stage which could produce a truly mouthwatering meeting between two greats of the game.Are you excited yet?BBC Sport talks you through the best - and worst - of a World Cup draw which went on, and on, and on...The draw that seemed like it may never endMany people tuned into the BBC's coverage bang on 17:00 GMT, eager to find out who their teams would be playing in the group stage of next year's tournament.But, even though supporters should, by now, be well accustomed to these draws taking some time to get going... this was extraordinary.After performances by Robbie Williams and former Pussycat Dolls singer Nicole Scherzinger, speeches from US President Donald Trump and Fifa counterpart Gianni Infantino, plus numerous montages, cutaways and interviews, it finally seemed to get going at 17:55 GMT. Or so we thought.Mexico President Claudia Sheinbaum and Canada Prime Minister Mark Carney joined Trump on stage to pick their respective countries, as co-hosts, out of the hat. But this was not new news.Cue more interviews and performances, before the actual draw eventually began at 18:27 GMT - nearly an hour and a half after the star-studded show first kicked off.The draw itself then took 59 minutes to complete, with BBC commentator Jonathan Pearce even quipping at one point that everything was taking so long to get through, the tournament would be upon us by the time the ceremony had been wrapped up.Media caption, Donald Trump receives inaugural Fifa Peace PrizeOn to the actual football...Next summer's World Cup will the biggest in the competition's history, with a record 48 teams taking part and a round of 32 being introduced for the first time.But this has perhaps led to the group stage - with 12 groups each containing four teams - being slightly diluted in quality.There are very few matches between the major nations. England's game against Croatia - a repeat of the 2018 semi-final - is the most significant on paper.That is the only group fixture which will see two teams ranked in the top 10 in the world come up against one another.Brazil (fifth) v Morocco (11th) in Group C is the next best. Netherlands have the toughest group in terms of Fifa world rankings, drawn against Japan, Tunisia and one of the play-off winners, while Germany - grouped with Ecuador, Ivory Coast and Curacao - have the weakest.But that doesn't mean there aren't still some interesting matches to look forward.Media caption, Tuchel reacts to England's 'difficult' World Cup groupTwo goal machines go head-to-headGenerational goalgetter Erling Haaland will get a crack at his first major tournament next summer.The Manchester City and Norway striker scored 16 times in eight World Cup qualifiers to drag his country to their first appearance in the competition since 1998.And 'drag' is no exaggeration - no player, across any continent, scored more in qualifying than Haaland. No wonder one Norwegian journalist went as far as suggesting \"there's already a case to be made that he's our greatest ever player\".Few have managed to even come close to the 25-year-old's ridiculous goalscoring feats in recent seasons - but someone who has is set to come up against him in the final round of group games.Along with Senegal and one of the play-off winners, Norway have been drawn against Kylian Mbappe's France in Group I.It means the top marksmen in the Premier League and La Liga will go head-to-head for the first time in international football.Mbappe, just two goals away from becoming France's record scorer at the age of 26, has scored 16 times in 15 league games this season for Real Madrid. Haaland, already Norway's record scorer and a whopping 22 goals clear of the next best, has scored 15 in 14 for City.\"It will be a great duel,\" France coach Didier Deschamps said.\"Kylian and Haaland are two players recognised around the world and they will be two of the contenders to be the top scorer.\"Expect goals. Lots of goals.We meet againMexico will take on South Africa at Estadio Azteca in the opening match of next summer's World Cup - and not for the first time.The two teams also opened the 2010 edition, which was hosted by South Africa - the first time the competition had been held in the continent.The game, which ended 1-1, is best remembered for Siphiwe Tshabalala's rasping second-half strike to put Bafana Bafana in front. It was an iconic World Cup goal.Another eye-catching group game will see France again come up against Senegal, who stunned the then-world champions in 2002 in one of the tournament's most famous shocks.On the opening night in Seoul, South Korea, future Fulham midfielder Papa Bouba Diop upstaged France's cast of star names to score the decisive first goal of the tournament after 30 minutes.France never recovered, failing to win any of their games and finishing bottom of the group.Dream ties for the debutantsUzbekistan, Cape Verde, Jordan and Curacao have all taken advantage of the expanded World Cup by qualifying for the finals for the first time.But standing in their way are former world champions, European champions and champions of South America.In Group E Curacao, the tiny Caribbean island who will become the smallest nation to play at a World Cup, will take on four-time World Cup winners Germany in their first-ever finals match.With a population of around 600,000, Cape Verde may well have been pinching themselves when they were drawn alongside European champions and World Cup winners Spain in Group H. They will take on the 2010 winners in their opening game.Jordan took part in qualifying for the first time 40 years ago and their reward for reaching their first World Cup is a tie with defending champions Argentina and Lionel Messi in Group J.And, in Group K, Italy's 2006 World Cup winner Fabio Cannavaro will guide Uzbekistan into their first finals, where they will face Cristiano Ronaldo's Portugal.What about the knockout stage?Image source, Getty ImagesImage caption, Could Cristiano Ronaldo and Lionel Messi - pictured here before a friendly between Portugal and Argentina in 2014 - meet on the international stage again?Assuming all the top teams make it safely through their groups - a dangerous assumption, admittedly - we shouldn't have to wait too long for some of the big hitters to collide.It is in the last 16 where things could get really tasty, most notably with a potential tie between former champions Germany and France.The pair last met in a World Cup at the quarter-final stage in 2014, with Mats Hummels' early header enough to send the Germans through.If Germany come out on top again they would have to contend with the Netherlands and Spain if they are to reach the final - a very tough run having ended up in the most straightforward group.On the other side of the draw, eyes will instantly be drawn to the quarter-final stage, with old rivals Messi and Ronaldo set for a possible showdown.It would depend on both Argentina and Portugal finishing top of their respective groups and then squeezing through the last 32 and 16 but, if they are able to do that, it would be a remarkable way to mark the pair's final World Cups.If England get off to a great start against Croatia and go on to win their group, they would play a third-placed team in the last 32, although working out their exact opponents is somewhat complicated.If Scotland top their group Japan or Tunisia could be waiting for them in what would be their first-ever World Cup knockout game. Media caption, 'Bring it on' - Clarke releshing chance at World Cup after draw",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "World Cup 2026 draw: Haaland v Mbappe, Trump & YMCA - best of draw",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f394/live/72125de0-d223-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-05T22:20:57.000Z",
      "dateModified": "2025-12-05T22:20:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "World Cup 2026 draw: England open against Croatia, Scotland drawn with Brazil",
    "url": "https://www.bbc.com/sport/football/articles/c7vmr1mmve3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/19f2/live/58bc11d0-d212-11f0-bd15-e5c6de83b2f6.jpg",
    "tag": "Trending",
    "date": "2025-12-05T19:16:19.000Z",
    "description": "Image source, Getty ImagesImage caption, The World Cup has been increased from 32 to 48 teams for 2026ByHarry PooleBBC Sport journalistEngland will be",
    "body": "Image source, Getty ImagesImage caption, The World Cup has been increased from 32 to 48 teams for 2026ByHarry PooleBBC Sport journalistEngland will begin their World Cup 2026 campaign against Croatia, while Scotland have been drawn alongside Brazil at next summer's tournament.Thomas Tuchel's England will open their tournament in Dallas or Toronto on Wednesday, 17 June, before also facing Ghana and Panama in Group L.Scotland's first match at the men's World Cup for 28 years will be against Haiti on Saturday, 13 June, in Boston or New York, followed by matches against Morocco and Brazil in Group C.Wales or Northern Ireland would join Canada, Qatar and Switzerland in Group B, should either come through two rounds of Uefa play-off matches in March.The Republic of Ireland could meet Mexico, South Africa and South Korea if they qualify.The first-ever 48-team World Cup will be held in Canada, Mexico and the United States between 11 June and 19 July 2026.World Cup 2026 draw in full*Uefa play-off A: Italy, Wales, Bosnia-Herzegovina or Northern Ireland*Uefa play-off B: Ukraine, Poland, Albania or Sweden*Uefa play-off C: Turkey, Slovakia, Kosovo or Romania*Uefa play-off D: Denmark, Czech Republic, Republic of Ireland or North Macedonia*Fifa play-off 1: DR Congo, Jamaica or New Caledonia*Fifa play-off 2: Iraq, Bolivia or SurinameWhere and when each nation will play their matches will be confirmed in a separate draw on Saturday at 17:00 GMT, but there is some certainty at this stage.After their opener against Croatia - which comes six days after the tournament gets under way - England will play Ghana on Tuesday, 23 June in Toronto or Boston, before their final group game against Panama on Saturday, 27 June in Philadelphia or New York.Following their first men's World Cup match since 1998 against Haiti, Scotland face Morocco on Friday, 19 June in Boston or Philadelphia, while their meeting with Brazil takes place on Wednesday, 24 June in Atlanta or Miami.Mexico will take on South Africa at Estadio Azteca in the opening match of the expanded tournament, which will involve 104 matches across 16 cities.Media caption, What happened when Scotland last played at the men's World CupIn a major change to the draw, the top four nations in the Fifa world rankings - Spain, Argentina, France and England - have been awarded special seedings which ensure they cannot meet until the semi-finals, assuming each wins their group.England, the Euro 2024 runners-up, could meet the winner of Brazil's group in the quarter-finals.If they win Group L, the Three Lions will face one of the eight best-performing third-placed sides in the first round of knockout matches.Drawn from pot three, Scotland must play Fifa's fifth and 11th best-ranked nations in Brazil - who they will face for a fifth time at a World Cup - and Morocco as they bid to reach the knockout stage.There will be 12 groups of four teams at next summer's tournament. The groups were drawn from four pots, into which teams had been placed based on their position in Fifa's rankings.The top two teams in each group will qualify for the knockout stages, along with the eight best third-placed teams.England verdict: 'Difficult group, difficult opener'Media caption, Tuchel reacts to England's 'difficult' World Cup groupEngland head coach Tuchel oversaw a flawless World Cup qualifying campaign, his team winning all their eight matches without conceding a goal.Speaking to BBC Sport after the draw, the German said: \"Difficult group, difficult opener. Croatia and Ghana [are] two regulars in World Cups and two proud and strong nations. Panama I don't know much about at the moment, but we will before the tournament starts.\"For me, I've only experienced group football in Champions League formats and the way to approach it was to always give it the biggest respect and to put all the focus into winning the group. It always seems difficult, like our group now, but we are confident and we will be well prepared when we arrive.\"Croatia were the highest-ranked nation England could have drawn from pot two, and they are the side England lost to in the semi-finals of the 2018 World Cup.In the group stage at that same tournament, England defeated Panama 6-1.\"Nobody should be underestimated. Of course Croatia is the standout nation but Ghana is always full of talent, can always surprise and has a big history in World Cup football,\" Tuchel said. \"Panama will try to make the most of their underdog role. No-one can be underestimated, everyone deserves the fullest respect.\"Media caption, How Croatia beat England in the 2018 World Cup semi-finalsScotland verdict: 'We'll bring a little bit of magic'Scotland stunned Denmark with two stoppage-time goals as they secured World Cup qualification in a dramatic winner-takes-all final group game last month.Nearly three decades after their most recent men's World Cup appearance, they will meet two of the nations they faced at France 98 in Brazil and Morocco, plus the lesser-known quantity of Haiti.Scotland boss Steve Clarke told BBC Sport: \"The draw is fantastic. One of the big things in my head was no European teams, so we're playing three top sides from three different continents of the world and that's what the World Cup is about.\"Looking ahead to facing record five-time champions Brazil, Clarke said: \"We are going to bring a little bit of magic as well, hopefully.\"It's great to play them. To go back to 1998, when Brazil and Morocco were in the group, that's a little bit of fate.\"Media caption, 'Bring it on' - Clarke releshing chance at World Cup after drawA World Cup of '104 Super Bowls'US President Donald Trump was awarded the new Fifa Peace Prize during a star-studded draw ceremony which lasted for more than two hours in Washington DC.Trump was presented with a trophy, medal and certificate by Fifa president Gianni Infantino and said the award, introduced to recognise an individual's actions for peace and unity, was \"one of the great honours of my life\".Fifa president Infantino described the 2026 World Cup for American viewers as equivalent to watching \"104 Super Bowls in one month\".The event was presented by comedian Kevin Hart, model Heidi Klum and actor Danny Ramirez, and featured live music performances by Andrea Bocelli, Robbie Williams, Nicole Scherzinger and Lauryn Hill.Former England and Manchester United player Rio Ferdinand conducted the draw, accompanied by American sporting greats Tom Brady, Aaron Judge and Shaquille O'Neal, and Canadian ice hockey legend Wayne Gretzky.Co-hosts Mexico, Canada and the United States had pre-determined group positions to ensure they will contest all group matches in their own countries.But Trump, Canadian Prime Minister Mark Carney and Mexican President Claudia Sheinbaum each drew their own nation's ball to begin proceedings.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "World Cup 2026 draw: England open against Croatia, Scotland drawn with Brazil",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/19f2/live/58bc11d0-d212-11f0-bd15-e5c6de83b2f6.jpg"
      ],
      "datePublished": "2025-12-05T19:16:19.000Z",
      "dateModified": "2025-12-05T19:16:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Radical with Amol Rajan - Porn and Masculinity: How to Teach Kids about Sex and Relationships (Jordan Stephens) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/m002mz6w?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg",
    "tag": "Trending",
    "date": "2025-12-04T06:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·04 Dec 2025,·61 mins,·Available for over a yearHow is online porn affecting sex and relationships? In this episode, musician and campaigner Jordan Stephens calls for a new approach to sex education and a modern redefinition of masculinity. \nFrom Paris Hilton to Bonnie Blue and AI generated porn he discusses how sexual content is evolving and the impact it is having on young people’s lives. \nJordan also explains how his childhood and the whirlwind fame he found with Rizzle Kicks led to heartbreak and addiction. \nAnd how that led him to become an advocate for boys and men. \n(00:02:30) Why Jordan became an advocate for boys and men? \n(00:08:30) Jordan’s childhood \n(00:12:17) Reflections on fame \n(00:13:36) How he learned about healthy relationships \n(00:15:30) Is there a crisis of masculinity? \n(00:20:25) The reality of pornography \n(00:28:50) How he would design the sex education curriculum? \n(00:31:26) AI and pornography \n(00:38:25) Thoughts on Bonnie Blue \n(00:42:30) Legalisation of sex work and drugs \n(00:45:25) What his partner, the popstar Jade Thirwall, has taught him about relationships \n(00:47:30) Politics and young people \n(00:54:50) Amol’s reflections \nGET IN TOUCH \n* WhatsApp: 0330 123 9480 \n* Email: radical@bbc.co.uk \nEpisodes of Radical with Amol Rajan are released every Thursday and you can also watch them on BBC iPlayer: https://www.bbc.co.uk/iplayer/episodes/m002f1d0/radical-with-amol-rajan \nAmol Rajan is a presenter of the Today programme on BBC Radio 4. He is also the host of University Challenge on BBC One. Before that, Amol was media editor at the BBC and editor at The Independent. \nRadical with Amol Rajan is a Today Podcast. It was made by Lewis Vickers with Anna Budd. Digital production was by Gabriel Purcell-Davis. Technical production was by Ricardo McCarthy. The editor is Sam Bonham. The executive producer is Owenna Griffiths.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radical with Amol Rajan - Porn and Masculinity: How to Teach Kids about Sex and Relationships (Jordan Stephens) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg"
      ],
      "datePublished": "2025-12-04T06:00:00.000Z",
      "dateModified": "2025-12-04T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Is Russia Really Ready For War With Europe? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mldzp8?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-03T19:13:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·03 Dec 2025,·44 minsIs Russia Really Ready For War With Europe?NewscastAvailable for over a yearToday, NATO ministers have been meeting to discuss the US’s 28-point plan for peace between Russia and Ukraine after Russia rejected the plan and said it was “ready” for war with Europe.\nAdam is joined by Europe editor, Katya Adler and the Economist’s defence editor, Shashank Joshi to discuss what President Putin’s statement means for a divided NATO.\nPlus Faisal Islam, BBC Economics Editor, joins the conversation to discuss the UK’s possible involvement in a new European defence fund and the government’s latest suggestions it could be looking to get closer to the EU again. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Kris Jalowiecki. The social producer was Joe Wilkinson. The technical producer was Dafydd Evans. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Is Russia Really Ready For War With Europe? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-03T19:13:00.000Z",
      "dateModified": "2025-12-03T19:13:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meghan reaches out to estranged father Thomas after amputation reports, spokesman says",
    "url": "https://www.bbc.com/news/articles/c0je4v8j0vzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4f01/live/36e37940-d21c-11f0-be90-7bfb24e8b1c8.jpg",
    "tag": "Trending",
    "date": "2025-12-05T21:29:42.000Z",
    "description": "11 hours agoDaniela Relph,Royal correspondentandAmy WalkerThe Duchess of Sussex has attempted to contact her estranged father, Thomas Markle, who is r",
    "body": "11 hours agoDaniela Relph,Royal correspondentandAmy WalkerThe Duchess of Sussex has attempted to contact her estranged father, Thomas Markle, who is reported to be seriously ill in hospital in the Philippines.A spokesman for Meghan said: \"I can confirm she has reached out to her father.\"Mr Markle is reported to have had his leg amputated during surgery. The BBC understands that Meghan tried to contact him earlier today, but it is not clear whether the attempt was successful. The relationship between Meghan and her father broke down in the run-up to her wedding to Prince Harry in 2018.During the couple's engagement, the media interest in Thomas Markle and his family was intense. Mr Markle was found to have colluded with photographers who paid him for photos appearing to show the father of the bride preparing for the wedding.The fallout saw him pull out of his daughter's wedding just days before the ceremony in Windsor, citing health problems.King Charles III - who was then the Prince of Wales - walked Meghan down the aisle instead.It is not clear if Meghan ever resumed any proper relationship with her father following her marriage. Thomas Markle is not believed to have met Harry and Meghan's children, Prince Archie and Princess Lilibet.He was critical of his daughter and son-in-law's decision to step back from public duty in the UK and criticise the royal family. In one media interview he said: \"I think they're both turning into lost souls at this point.\"\"I don't know what they're looking for,\" he added. \"I don't think they know what they're looking for.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meghan reaches out to estranged father Thomas after amputation reports, spokesman says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4f01/live/36e37940-d21c-11f0-be90-7bfb24e8b1c8.jpg"
      ],
      "datePublished": "2025-12-05T21:29:42.000Z",
      "dateModified": "2025-12-05T21:29:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New clashes break out between Pakistan and Afghanistan",
    "url": "https://www.bbc.com/news/articles/cn09zp87pz8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c186/live/8b28ec90-d25a-11f0-a3ed-031197c916c2.jpg",
    "tag": "Trending",
    "date": "2025-12-06T04:58:43.000Z",
    "description": "Fresh deadly border clashes have broken out between Pakistan and Afghanistan's Taliban forces, with both sides accusing each other of breaking a fragi",
    "body": "Fresh deadly border clashes have broken out between Pakistan and Afghanistan's Taliban forces, with both sides accusing each other of breaking a fragile ceasefire.Residents fled the Afghan city of Spin Boldak overnight, which lies along the 1,600-mile (2,574 km) border the two countries share.A medical source in the nearby city of Kandahar told BBC Pashto a local hospital had received the bodies of four people. Three injuries have been reported in Pakistan.Sporadic fighting has repeatedly broken out between the two in recent months, while Afghanistan's Taliban government has also accused Pakistan of carrying out air strikes inside the country.Both sides have confirmed they exchanged fire overnight but each blamed the other for beginning the four hours of fighting. Mosharraf Zaidi, a spokesperson for Pakistan's Prime Minister Shehbaz Sharif, accused the Taliban of \"unprovoked firing\".A statement continued: \"An immediate, befitting & intense response has been given by our armed forces. Pakistan remains fully alert & committed to ensuring its territorial integrity & the safety our citizens.\"Meanwhile, a Taliban spokesperson said Pakistan had \"once again initiated attacks\" and said it was forced to respond.Footage from the area showed a large number of Afghans fleeing on foot and in vehicles, with people in neighbouring towns also leaving in fear of the renewed fighting spreading. The overnight clashes came less than two months after both sides agreed to a ceasefire mediated by Qatar and Turkey.It ended the worst fighting between Pakistan and the Taliban since the group returned to power in 2021, though tensions have remained high.The government in Islamabad has long accused Afghanistan's ruling Taliban of giving shelter to armed groups which carry out attacks in Pakistan.The Taliban government in Afghanistan denies the accusation and has accused Pakistan of blaming others for their \"own security failures\".Last week delegations from both sides met in Saudi Arabia for a fourth round of negotiations on a wider peace settlement, but did not reach an agreement.Sources familiar with the talks told BBC News that both sides had agreed to continue with the ceasefire.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New clashes break out between Pakistan and Afghanistan",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c186/live/8b28ec90-d25a-11f0-a3ed-031197c916c2.jpg"
      ],
      "datePublished": "2025-12-06T04:58:43.000Z",
      "dateModified": "2025-12-06T04:58:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Strictly Come Dancing: Stars gear up for Musicals week as final looms",
    "url": "https://www.bbc.com/news/articles/c8r3pe81v0xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/de80/live/f038a510-d20c-11f0-936b-f537e2f59ee5.jpg",
    "tag": "Trending",
    "date": "2025-12-06T03:25:53.000Z",
    "description": "5 hours agoNoor NanjiCulture reporterIt's just two weeks to go until the final of Strictly Come Dancing 2025, and things are heating up on the ballroo",
    "body": "5 hours agoNoor NanjiCulture reporterIt's just two weeks to go until the final of Strictly Come Dancing 2025, and things are heating up on the ballroom floor.Saturday night sees the return of Musicals week, which will feature songs from The Phantom of the Opera and Guys and Dolls, among others.There will also be a new dance relay performance to open the show, which will see all of the remaining couples take to the floor.Musicals week will also see some special guest appearances, from Paddington Bear to the cast of hit West End show Titanique.Last Saturday, Lewis and Katya made Strictly history by winning the first-ever Instant Dance challenge.Before the challenge, Karen and Amber both scored perfect 40s - it was Karen's first of the series.It was another strong week for George and Alexis, with judge Craig Revel Horwood telling the pair their Quickstep was \"a joy to watch\".But Alex and Johannes didn't fare as well on the leaderboard with their Cha Cha Cha.Two celebrities ended up in Sunday night's dance off - Balvinder Sopal and Alex Kingston.And in the end, the judges decided to save Balvinder, meaning Alex became the latest star to exit the contest.This year's Strictly has seen a number of new challenges that are shaking up the format of the show.Hot on the heels of last week's Instant Dance challenge, there's another new addition to this week's show.This time, it's a \"dance relay\", which will take place at the start of Saturday night's show.The five-minute challenge will see each pair take to the floor as part of a celebration of musicals.Songs from shows including My Fair Lady, Oliver!, Chitty Chitty Bang Bang and Mary Poppins Returns will all feature, as the remaining couples battle for viewers' votes.Musicals Week will also see the professionals perform Cell Block Tango from Chicago, as well as performances from former Strictly contestant Tom Fletcher alongside Paddington Bear who is making his Strictly debut.It's approaching crunch time in the show, with the grand final taking place on 20 December.At this stage, things can get very unpredictable. Even a decent score can land you in the bottom half of the leaderboard, and with so few couples remaining, there's everything to play for.And on Sunday night, two more couples will face the dreaded dance-off, with another set to be sent home.Strictly Come Dancing is on Saturday at 18:50 on BBC One and BBC iPlayer.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Strictly Come Dancing: Stars gear up for Musicals week as final looms",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/de80/live/f038a510-d20c-11f0-936b-f537e2f59ee5.jpg"
      ],
      "datePublished": "2025-12-06T03:25:53.000Z",
      "dateModified": "2025-12-06T03:25:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Failed Sarah Ferguson-backed app took £1m taxpayers' money",
    "url": "https://www.bbc.com/news/articles/cgl6zejp75wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/66ba/live/3e7ecdb0-d1ec-11f0-9fc3-51ad94ee6fea.jpg",
    "tag": "Trending",
    "date": "2025-12-06T00:01:16.000Z",
    "description": "8 hours agoBen KingBusiness reporterA lifestyle app backed by Sarah Ferguson received more than £1m of taxpayers' money but collapsed without ever lau",
    "body": "8 hours agoBen KingBusiness reporterA lifestyle app backed by Sarah Ferguson received more than £1m of taxpayers' money but collapsed without ever launching a product, according to documents filed this week.vVoosh was founded by Manuel Fernandez, a close friend of Ms Ferguson, who once described herself as an \"ambassador\" for the company and was an investor.It promised to give users \"the power to Find, Plan, Share, Live, and Remember all the things you love to do - and those you're yet to try.\"Ms Ferguson and Mr Fernandez did not respond to requests for comment.vVoosh was put into administration last month - and its failure will raise further questions about the judgement of the former duchess and the business relationships she pursued.Over the years the company raised approximately £9m, including more than £1m from the UK government through research and development tax credits, according to documents filed by the administrator.It paid teams in the UK and then India to work on the app, but never launched it, and so had no income to fund further development.Progress on the app stopped when the Indian contractor threatened legal action.The administrator's report describes a \"breakdown in communication between the current directors/major creditors and the founder [Mr Fernandez], who ceased communication following [his] resignation as a director earlier in the year\".The report says that the company is owed £324,609 by a former director. This is believed to be Mr Fernandez, who is the only director to leave the company since 2019.Last summer he sold his house in North London for £1.3m, according to Land Registry documents, and is believed to have left the UK.Meanwhile, vVoosh owes £50,000 to one of Ms Ferguson's companies, La Luna Investments, which also held just under 1% of the company's shares.Ms Ferguson, 66, lost her duchess title when her former husband, Andrew Mountbatten-Windsor, relinquished use of his Duke of York title over his links with Epstein. He has since been stripped of the title of prince as well. Documents show the firm had more than 60 other small shareholders - many with addresses in Essex and London, though a few American addresses also appear.The administrators said that there was \"significant uncertainty\" over how much money the company's creditors would get back once the company was wound up.One of the firm's American backers, Mark Guzy, has put more than £400,000 into the company to preserve \"certain essential services\" and protect the value of its software platform, which is the company's main remaining asset.vVoosh originally intended to share 10% of its profits with a charitable foundation.The BBC understands that the Charity Commission has now begun the process of removing vVoosh Charitable Foundation from the register of charities, on the basis that it does not operate.It is more than four-and-a-half years overdue with its reporting. Its last accounts, from 2019, show that it had £1.28m gross income, but spent only £18,240 on charitable activities.HMRC declined to respond to questions about the tax credits. Mr Guzy and the other directors of vVoosh declined to comment.Earlier this month Mr Fernandez denied taking money out of the firm, according to the Times.He told the newspaper that allegation would be \"disproven in the course of legal proceedings\".Ms Ferguson's relationships and business dealings have come under recent scrutiny.Last month it emerged that a crypto-currency mining firm had agreed to pay her up to £1.4m for acting as a \"brand ambassador\" - that firm also failed, allegedly costing investors millions. Its co-founder denied misconduct and said he was working to repay backers. In September, a number of charities dropped her as a patron or ambassador after an email from 2011 revealed that she called sex offender Jeffrey Epstein her \"supreme friend\" and seemed to apologise for her public criticism of him. Mr Fernandez went to school at Billericay in Essex, and was a soldier in the Royal Anglian Regiment, according to his LinkedIn profile. He then held senior sales roles at a number of tech companies before founding vVoosh in 2010.He was regularly photographed with the then duchess in 2015 and 2016, and they attended Sir Bob Geldof's wedding together, but she denied rumours they were a couple, saying they were just \"good friends\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Failed Sarah Ferguson-backed app took £1m taxpayers' money",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/66ba/live/3e7ecdb0-d1ec-11f0-9fc3-51ad94ee6fea.jpg"
      ],
      "datePublished": "2025-12-06T00:01:16.000Z",
      "dateModified": "2025-12-06T00:01:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Devon woman transforms entire house into a work of art",
    "url": "https://www.bbc.com/news/articles/c9qe0yyj19zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1544/live/b500bab0-d08f-11f0-9508-4b2ee64d533f.jpg",
    "tag": "Trending",
    "date": "2025-12-05T06:24:26.000Z",
    "description": "'I let loose' - artist transforms her entire house1 day agoEmma RuminskiDevonBBCEmily Powell hand-painted every inch of her home with vibrant pictures",
    "body": "'I let loose' - artist transforms her entire house1 day agoEmma RuminskiDevonBBCEmily Powell hand-painted every inch of her home with vibrant pictures of things that are important to her familyA terraced family home has been turned into a lived-in work of art with paintings spanning from floor to ceiling in every room.It is the work of Devon artist Emily Powell, who is known for vibrant and colourful canvases.She said she \"suddenly let loose\" after beginning the work a decade ago, hand-painting everything inside the property, from light switches to the fridge and even the toilet.Her Brixham home and the artwork, which is called The Art of the Living, was opened to a small number of ticketholders this week.Powell has had two solo shows at London's Portland Gallery and last week gave a talk about her artistic style at the Royal Academy of Arts, also in London.Local exhibitions have included showing a body of work from her residency in the Isles of Scilly and work she painted in the Arctic, which she put on display at her studio on Dartmoor at Ullacombe Farm.Alun CallenderThe dining room features paintings of Delftware pottery on the walls and table, a reminder of Powell's time in HollandPowell painted the living room red because she wanted it to feel cosy and warmHer open house is very different to a gallery experience.It is immersive and features a circus full of animals in party hats in her daughter's playroom, while Dutch-influenced cups and plates are painted on the walls as well as the front of the kitchen fridge.A fig tree adorns the ceiling in the hallway and birds fly up the stairs along the walls.Showing visitors around, Powell explained every room was designed to bring out different emotions.\"It's all about the colour,\" she said.\"So I chose the colour to balance out how I'm feeling and how I want the family to feel in certain rooms.\"Hundreds of people have booked tickets to see the houseThe paintings merge and flow into one another as you progress through the house.Guests walk from a skyline of Paris apartment buildings in the hallway, to a field of Scottish flowers in the master bedroom.Powell said: \"It started off as just trying out things in the new house that I'd bought.\"It was our first house, we were out of rented accommodation.\"So I could suddenly let loose.\"It grew and grew and grew and now it's out of hand.\"The house is an antidote to minimalist interiors but, as her husband Jack Powell explains, sometimes the painted floor makes it hard to see his daughter's toys.He also said there was always the risk of leaning against a new design still wet with paint.\"I don't think there's an item of clothing that doesn't have paint on it,\" he said.\"Someone came in and said, 'You've got paint on your toothbrushes - do you know that?'.\"The open house ends on 7 December and is sold out with a waiting list of 500 people.Powell said visitors with tickets had come from as far as the United States to see what she had created.She has now run out of surfaces to paint in this house, so plans to sell up and start a new chapter in her creativity all over again.More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Devon woman transforms entire house into a work of art",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1544/live/b500bab0-d08f-11f0-9508-4b2ee64d533f.jpg"
      ],
      "datePublished": "2025-12-05T06:24:26.000Z",
      "dateModified": "2025-12-05T06:24:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ashes: Jofra Archer criticised by Matthew Hayden for bringing pillow to Gabba",
    "url": "https://www.bbc.com/sport/cricket/articles/c0q58yj40z2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/30b7/live/adce1760-d265-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-12-06T06:22:37.000Z",
    "description": "Jofra Archer has been criticised by former Australia opener Matthew Hayden for the \"shocking look\" of arriving for the third day of the second Ashes T",
    "body": "Jofra Archer has been criticised by former Australia opener Matthew Hayden for the \"shocking look\" of arriving for the third day of the second Ashes Test with a pillow.With England needing four wickets to wrap up the Australia first innings in order to keep their Ashes hopes alive, fast bowler Archer was seen before play at the Gabba with a pillow tucked under his arm.And the 30-year-old was made to wait for his rest as Australia frustrated England throughout the entire opening session.Though the hosts lost two wickets, they moved to 450-8 by the interval, leading by 116 runs.Only twice before have England overturned a first-innings deficit of more than 100 to win a Test in Australia. The last time was at the Sydney Cricket Ground in 1979.\"I'm sorry, but that's a shocking look,\" Hayden, who played 103 Tests, said on Channel 7.\"If I was a batsman, I tell you what I'd be doing, I'd be digging in. Forever.\"It would be exactly what you need as a batsman, I can tell you. You'd be looking over and thinking 'you are never going to sleep on that'.\"Not any part of this day are you going to see that. Not even in the night are you going to see that.\"After Australia resumed on 378-6, England captain Ben Stokes had Michael Neser caught behind for 16.England took the second new ball at 80 overs, with Gus Atkinson taking the edge of Alex Carey for 63.Archer shared the new ball with Atkinson, bowling five wicketless overs and conceding 13 runs.And England could not find a way to part ninth-wicket partnership Mitchell Starc and Scott Boland. The pair added 34 runs in 16 overs in the run-up to the break. Starc had moved to 46 and Boland seven.The extra time spent batting in daylight is vital for Australia. It means England will be facing a newer ball when they bat under floodlights later on Saturday.England's deflating opening to the third day came after an error-strewn performance on Friday, when the tourists missed five chances in the field.Former captain Michael Vaughan questioned their preparedness for this Ashes series, saying England looked \"jaded\".Archer returned to Test cricket in the home summer after a four-year lay-off because of a string of serious injuries.The Sussex man had bowled 25 overs by the first interval on the third day in Brisbane, his second-most in a Test innings since 2019 – beaten by the 26.1 he bowled in the first innings of the fourth Test against India at Old Trafford, the second match of his comeback.On Friday, Archer bowled a seven-over spell immediately after the first interval – his longest uninterrupted spell in Test cricket for five years.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ashes: Jofra Archer criticised by Matthew Hayden for bringing pillow to Gabba",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/30b7/live/adce1760-d265-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-06T06:22:37.000Z",
      "dateModified": "2025-12-06T06:22:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Frank Gehry: Legendary US architect dies aged 96",
    "url": "https://www.bbc.com/news/articles/c5y2p22z9gno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1b2b/live/ca170da0-d215-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-06T02:04:36.000Z",
    "description": "6 hours agoSakshi Venkatraman,US reporterandHarry SekulichREUTERS/Mike Blake/File PhotoFrank Gehry, one of the most influential architects of the last",
    "body": "6 hours agoSakshi Venkatraman,US reporterandHarry SekulichREUTERS/Mike Blake/File PhotoFrank Gehry, one of the most influential architects of the last century, has died aged 96.Gehry was acclaimed for his avant garde, experimental style of architecture. His titanium-covered design of the Guggenheim Museum in Bilbao, Spain, catapulted him to fame in 1997. His breakthrough in the architectural world came years earlier when he redesigned his own home in Santa Monica, California, using materials like chain-link fencing, plywood, and corrugated steel.His death was confirmed by his chief of staff Meaghan Lloyd. He is survived by two daughters from his first marriage, Leslie and Brina, as well as his wife, Berta Isabel Aguilera, and their two sons, Alejandro and Samuel.Getty ImagesThe Guggenheim Museum Bilbao, one of Gehry's most famous worksBorn in Toronto in 1929, Gehry moved to Los Angeles as a teenager to study architecture at the University of Southern California, before completing further study at the Harvard Graduate School of Design in 1956 and 1957.After starting his own firm, he broke from traditional architectural principles of symmetry, using unconventional geometric shapes and unfinished materials in a style now known as deconstructivism. Through blending unexpected materials and sheathing buildings in stainless steel to create curvy exteriors, Gehry created buildings that took on arresting sculptural shapes.Later in his career, Gehry used 3D modelling similar to that used by aerospace engineers to shape windy buildings, a practice largely avoided by other architects because of the complexity and costliness of construction.In 1989, at the age of 60, Gehry was awarded the industry's top accolade, the Pritzker Architecture prize, for lifetime achievement.The Pritzker jury said his work possessed a \"highly refined, sophisticated and adventurous aesthetic\".\"His designs, if compared to American music, could best be likened to Jazz, replete with improvisation and a lively unpredictable spirit,\" the panel said at the time.Gehry's international breakthrough with the Guggenheim transformed the city of Bilbao, boosting tourism to the city and the local economy. Crafted out of titanium sheets, limestone, and glass, the museum was instantly celebrated as a modern marvel.Architect Philip Johnson, Gehry's American contemporary, described the structure as \"the greatest building of our time\". Other cities tried to replicate its success, branded the \"Bilbao effect\", where investment in daring art could revitalise ailing economies.The cultural phenomenon was parodied in a 2005 episode of The Simpsons, in which the fictional town of Springfield invites Gehry, who voiced himself in the cartoon TV show, to design a new concert hall. In the episode, the shape of the concert hall is jokingly inspired by a letter Gehry had scrunched up.The guest appearance later \"haunted\" Gehry, who told the Observer in 2011 that people sincerely believed his real-life designs were inspired by crumpled paper instead of complex computations.'Pushing the envelope'His work in Bilbao put him in high demand, and he went on to design iconic structures in cities all over the world: the Jay Pritzker Pavilion in Chicago's Millennium Park, the Gehry Tower in Germany, and the Louis Vuitton Foundation in Paris. \"He bestowed upon Paris and upon France his greatest masterpiece,\" said Bernard Arnault, the CEO of LVMH, the worlds largest luxury goods company which owns Louis Vuitton.With a largely unpredictable style, no two of his works look the same. Prague's Dancing House, finished in 1996, looks like a glass building folding in on itself; his Hotel Marques in Spain, built in 2006, features thin sheets of wavy, multicoloured metal; his design for a business school in Sydney looks like a brown paper bag.Gehry also designed the Walt Disney Concert Hall in Los Angeles, layered in metal resembling sails billowing in the wind. After it opened in 2003, critics described it as a \"pile of broken crockery\", a \"fortune cookie gone berserk\" and an \"emptied waste basket\".In a 2007 interview with the New Yorker, Gehry shrugged off the concert hall's critics: \"At least they're looking!\" he quipped. Tributes are celebrating his eagerness to discard convention - and forge his own creative legacy.Paul Goldberger, author of Building Art: The Life and Work of Frank Gehry, came to know Gehry closely, and said he wanted to work \"until the day he died\".\"He was one of the very few architects of our time to engage people emotionally,\" Goldberger told BBC Radio 4's The World Tonight.\"He was all about pushing the envelope... wanting to use the most advanced technology to do the most adventurous things.\"In a statement, Canadian Prime Minister Mark Carney extended his \"deepest condolences\" to Gehry's family and the \"many admirers of his work\". He added: \"His unmistakable vision lives on in iconic buildings around the world.\"Bilbao's Guggenheim Museum posted a video tribute to Gehry.\"We will be forever grateful,\" the museum wrote on Instagram, \"his spirit and legacy will always remain connected to Bilbao\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Frank Gehry: Legendary US architect dies aged 96",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1b2b/live/ca170da0-d215-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-06T02:04:36.000Z",
      "dateModified": "2025-12-06T02:04:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Golden Balls: Wigan's controversial 30ft nude gladiator returns",
    "url": "https://www.bbc.com/news/articles/cx2pel4qd08o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b9bc/live/a0ce1e10-d027-11f0-a0e2-816fae62ea61.jpg",
    "tag": "Trending",
    "date": "2025-12-03T12:02:06.000Z",
    "description": "3 days agoGeorgie DockerNorth WestBBCWigan's warrior makes a valiant return, three years after a council banA giant golden statue of a naked Roman gla",
    "body": "3 days agoGeorgie DockerNorth WestBBCWigan's warrior makes a valiant return, three years after a council banA giant golden statue of a naked Roman gladiator dubbed Golden Balls by local people has been returned to a town after a dispute with the local council led to him being banned.The 30ft (9m) figure - used to advertise the 2000 blockbuster movie Gladiator starring Russell Crowe - was once a landmark feature outside an antique shop in Wigan.Beloved by some, but offensive to others, it was removed at the request of Wigan Council in October 2022 - but, three years later, owner Grant Adamson, 60, has decided to bring it back to spread some \"Christmas cheer\".The council said it was aware a \"large statue\" had been brought onto the site and it was \"assessing whether any consent is needed\".Owner Grant Adamson, of Grant's Bulldog Forge antique shop, said a \"toga\" or \"underpants\" could be fashioned for the statue if neededMr Adamson said: \"It's just something different isn't it, a bit of a landmark.\"There's not another one of him.\"He said Golden Balls would be good for local business, attracting customers to the area.Artwork or offensive?Local residents also appeared positive about the reappearance of the Roman warrior. \"It's quite a sight when you come up the road, and it's a great addition to have it back here at the forge,\" Anne Fowler, 67, said.\"It certainly puts a smile on my face, I don't think you can help it not to - it's quite a thing.\"Another resident said the fact the statue was was naked did not matter to her. \"It's good to have artwork out and about on show,\" she said. \"It shouldn't be hidden.\" And one man, who can see the statue from his home, said he thought it was \"beautiful\", adding it \"made the place special\".The return of the statue \"certainly puts a smile on my face\" said resident Anne FowlerHowever, Mr Adamson said there had been some dissenting voices on social media about the appropriateness of the statue.But if nudity was the concern, Mr Adamson suggested a solution - perhaps a \"toga\" or a \"pair of underpants\" could be fashioned for the gladiator.\"If Santa Claus is watching, the gladiator would like a nice new pair of blue underpants for Christmas please,\" he joked. Mr Adamson told the BBC he expected the council might ask him to remove it again - but said he remained hopeful there could be a discussion, should they get in touch.More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Golden Balls: Wigan's controversial 30ft nude gladiator returns",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b9bc/live/a0ce1e10-d027-11f0-a0e2-816fae62ea61.jpg"
      ],
      "datePublished": "2025-12-03T12:02:06.000Z",
      "dateModified": "2025-12-03T12:02:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Giant purple dinosaur caught fly-tipping on CCTV in Southend",
    "url": "https://www.bbc.com/news/videos/c8r3pgr5jdxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a0ba/live/11f7fd00-d1c6-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-05T10:37:04.000Z",
    "description": "A fly-tipper dressed as a giant purple T. rex has been caught on camera dumping rubbish in a street. The brightly coloured rogue raptor was spotted ch",
    "body": "A fly-tipper dressed as a giant purple T. rex has been caught on camera dumping rubbish in a street. The brightly coloured rogue raptor was spotted checking for traffic before crossing a road in Southend, Essex. The prehistoric predator then looks around before slinging two black bin bags to the ground next to large black bin. Footage of the incident, first reported by Your Southend, was captured on a resident's CCTV just before 21:30 GMT on Tuesday. The city council told the BBC it had not received any reports of fly-tipping in relation to the incident. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Giant purple dinosaur caught fly-tipping on CCTV in Southend",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a0ba/live/11f7fd00-d1c6-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-05T10:37:04.000Z",
      "dateModified": "2025-12-05T10:37:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]