[
  {
    "title": "Suspected fake officer at Llandudno Remembrance event investigated",
    "url": "https://www.bbc.com/news/articles/ckgy42yjn1xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e61c/live/fbd072f0-c0ae-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "Trending",
    "date": "2025-11-14T07:49:42.000Z",
    "description": "Man suspected of being fake high-ranking admiral at Remembrance event investigated23 minutes agoChris DeardenBBC WalesTerry StewartMembers of the Roya",
    "body": "Man suspected of being fake high-ranking admiral at Remembrance event investigated23 minutes agoChris DeardenBBC WalesTerry StewartMembers of the Royal Naval Association in Llandudno spotted a man wearing an unusual uniformOfficials are looking into whether a man who took part in a Remembrance Sunday ceremony dressed as a high-ranking navy officer was a fake.The man was involved in the wreath laying in Llandudno, Conwy county, on Sunday, and saluted the war memorial before marching away with a colleague.Serving and former service personnel became suspicious when they saw him dressed as a rear admiral and wearing the rare Distinguished Service Order medal.The Ministry of Defence said it was taking it very seriously, adding that impersonating a naval officer can be considered a criminal offence.Hundreds of people were on the seafront in Llandudno to mark Remembrance Sunday last weekend for the traditional period of silence and the laying of poppy wreaths.But members of the town's Royal Naval Association spotted a man wearing an unusual uniform among the ranks of serving and former servicemen and women.The man was wearing the epaulettes and sleeve lace of a rear admiral, a two-star position that is one of the highest ranks in the Royal Navy.He also had an array of medals on his left chest, including the Distinguished Service Order (DSO), which is awarded for highly successful command and leadership during active operations, and which very few have been awarded since 1979.Hundreds of people were on the seafront in Llandudno to mark Remembrance Sunday last weekend.Several veterans and serving officers have said on social media that they are concerned that the man may not have been a rear admiral, and may not have earned all the medals he was wearing.Llandudno Town Council, which organised the event, confirmed that no-one of that rank was due to be at the ceremony.Greg Robbins, chair of the council's civic sub-committee, said: \"The man was challenged by the parade marshal, but stated that he was of a certain rank, and that he was representing the Lord Lieutenant's office.\"The parade marshal was left with little choice but to accommodate him in the wreath laying ceremony.\"The most important thing with Remembrance Sunday ceremonies is that they are suitably dignified, as this one was.\"This individual did not disrupt the ceremony, but we are keen to know who he was, and will be working with the Ministry of Defence on its investigation.\"The man was seen walking in formation to the war memorial with a colleague, also dressed in a khaki uniform.The colleague laid a wreath before the pair saluted and walked away together.A spokesperson for the Ministry of Defence said: \"Impersonating a Naval officer is insulting to anyone connected to the service and can be considered a criminal offence.\"Nothing should detract from the poignancy of Remembrance Sunday which can be a sombre time for members of the Royal Navy family and an opportunity for people in communities across the country to pay their respects to people who have or are serving their country.\"More top stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Suspected fake officer at Llandudno Remembrance event investigated",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e61c/live/fbd072f0-c0ae-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-14T07:49:42.000Z",
      "dateModified": "2025-11-14T07:49:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Resident doctors begin 13th strike as pay dispute in England conitnues",
    "url": "https://www.bbc.com/news/articles/cm2lg8pgjymo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/264f/live/144791e0-c129-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-14T08:00:14.000Z",
    "description": "Doctors begin five-day walkout in England14 minutes agoNick TriggleHealth correspondentGetty ImagesResident doctors were striking as recently as July,",
    "body": "Doctors begin five-day walkout in England14 minutes agoNick TriggleHealth correspondentGetty ImagesResident doctors were striking as recently as July, when there was a five-day walkout over the longstanding pay disputeNHS bosses are aiming to keep nearly all services running as resident doctors begin a five-day walkout in England.The strike – the 13th by British Medical Association members in the long-running pay dispute – began at 07:00 GMT and lasts until 07:00 Wednesday.Resident doctors – the new name for junior doctors – will walk out of both emergency and non-urgent care.Hospitals will come under the most strain, with resident doctors making up about half the medical workforce. But NHS England said patients should still attend appointments unless advised otherwise.It said it wanted to keep 95% of non-urgent work, such as hip and knee operations, going.The NHS aims to do this by re-deploying and offering overtime to consultants and and other senior doctors as well as relying on those not striking – around a third of resident doctors are not BMA members.But this will come at significant cost with the NHS estimating the five-day walkout is costing £240m to cover.'I'm furious'OtherDespite the attempt to keep services going, patients like Colette Houlihan, 68, have still had to face postponements.She was due to have a pre-surgery appointment on Monday, but this has now been pushed back to late December.Ms Houlihan, from Cambridgeshire, who is waiting for a benign tumour in her neck to be removed, said she had had to put up with two cancellations already, but could understand those as she was told patients who were higher priorities needed to be seen.\"They could have had cancer. I didn't mind that, but this is different.\"I am furious. By striking they ignore the Hippocratic Oath - first and foremost do no harm.\"Striking causes harm by way of delaying procedures, taking senior doctors from their posts and causing chaos  within the system,\" she said.ChallengingNHS England medical director Prof Meghana Pandit said it was frustrating and disappointing that there was another round of industrial action at a challenging time for the NHS, with flu cases rising earlier than usual.\"Despite this, staff across the NHS are working extremely hard to maintain care and limit disruption,\" he added.But BMA leader Dr Tom Dolphin said keeping most services running would be \"challenging\".He said doctors had a legal right to strike and should not be \"bullied or coerced\" into working.And he warned his members would only leave the picket line if there was a major emergency – such as a mass casualty event.The latest walkout comes after Health Secretary Wes Streeting launched arguably his strongest attack on the BMA.Addressing a conference of health managers this week, he called the union \"morally reprehensible\" and accused it of acting like a cartel, attempting to hold the public and government to ransom.He said doctors had received generous pay rises over the past three years – worth nearly 30%, bringing average basic salaries to just over £54,000.Talks between him and the union broke down last week after the BMA turned down a fresh offer to end the dispute.Streeting has maintained throughout the year that he could not negotiate on pay, but he proposed a deal that would see out-of-pocket expenses like exam fees and membership fees covered, along with a boost in speciality training places.But the BMA has argued that, despite the pay rises, resident doctors' pay is still a fifth lower than it was in 2008, once inflation is taken into account.The union has also warned doctors are struggling to find jobs at a key stage of their training – between years two and three when they start speciality training.This year there were more than 30,000 applicants for 10,000 jobs at this stage, although some will have been doctors from abroad.\"We need a solution for the jobs crisis, that bottleneck for doctors who are out of permanent work or out of consistent work,\" Dr Emma Runswick, deputy chair of the BMA Council, told the BBC.\"Then we need to be able to retain those doctors throughout their careers by paying them appropriately, and that means restoration of pay.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Resident doctors begin 13th strike as pay dispute in England conitnues",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/264f/live/144791e0-c129-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-14T08:00:14.000Z",
      "dateModified": "2025-11-14T08:00:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC apologises to Trump over Panorama edit but refuses to pay compensation",
    "url": "https://www.bbc.com/news/articles/c874nw4g2zzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/49e0/live/b162e9a0-c11c-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-14T08:06:54.000Z",
    "description": "11 minutes agoNoor NanjiCulture reporterReuters / AFP via Getty ImagesThe BBC has apologised to US President Donald Trump for a Panorama episode that ",
    "body": "11 minutes agoNoor NanjiCulture reporterReuters / AFP via Getty ImagesThe BBC has apologised to US President Donald Trump for a Panorama episode that spliced parts of his 6 January 2021 speech together, but rejected his demands for compensation.The corporation said the edit had given \"the mistaken impression that President Trump had made a direct call for violent action\" and said it would not show the 2024 programme again.Lawyers for Trump have threatened to sue the BBC for $1bn (£759m) in damages unless the corporation issues a retraction, apologises and compensates him. The culture secretary told the BBC she was confident the corporation was \"gripping this with the seriousness that it demands\", adding her role was to ensure \"the highest standards are upheld\".Lisa Nandy, highlighting the BBC's independence from government, said she was talking daily to the corporation's chair, the director general and senior leadership.The fallout from the scandal led to the resignations of BBC director general Tim Davie and head of news Deborah Turness on Sunday.BBC News has approached the White House for comment.The apology comes hours after a second similarly edited clip, broadcast on Newsnight in 2022, was revealed by the Daily Telegraph.In its Corrections and Clarifications section, published on Thursday evening, the BBC said the Panorama programme had been reviewed after criticism of how Trump's speech had been edited.The BBC had been given a deadline of 22:00 GMT (17:00 EST) on Friday to respond. \"We accept that our edit unintentionally created the impression that we were showing a single continuous section of the speech, rather than excerpts from different points in the speech, and that this gave the mistaken impression that President Trump had made a direct call for violent action,\" the statement said.Lawyers for the BBC have written to President Trump's legal team in response to a letter received on Sunday, a BBC spokesperson said. \"BBC chair Samir Shah has separately sent a personal letter to the White House making clear to President Trump that he and the corporation are sorry for the edit of the president's speech on 6 January 2021, which featured in the programme,\" they said.They added: \"While the BBC sincerely regrets the manner in which the video clip was edited, we strongly disagree there is a basis for a defamation claim.\"Why is Donald Trump threatening to sue the BBC?Trump vs the BBC: What hurdles might the president's legal argument face?In Trump's speech he said: \"We're going to walk down to the Capitol, and we're going to cheer on our brave senators and congressmen and women.\"More than 50 minutes later in the speech, he said: \"And we fight. We fight like hell.\"In the Panorama programme the clip shows him as saying: \"We're going to walk down to the Capitol... and I'll be there with you. And we fight. We fight like hell.\"Speaking to Fox News, Trump said his speech had been \"butchered\" and the way it was presented had \"defrauded\" viewers.The BBC received the letter from Trump's lawyers on Sunday. It demands a \"full and fair retraction\" of the documentary, an apology, and that the BBC \"appropriately compensate President Trump for the harm caused\".Watch: How the BBC works... in under two minutesIn its letter to Trump's legal team, the BBC sets out five main arguments for why it does not think it has a case to answerFirst it says the BBC did not have the rights to, and did not, distribute the Panorama episode on its US channels.When the documentary was available on BBC iPlayer, it was restricted to viewers in the UK.Secondly, it says the documentary did not cause Trump harm, as he was re-elected shortly after.Thirdly, it says the clip was not designed to mislead, but just to shorten a long speech, and that the edit was not done with malice.Fourthly, it says the clip was never meant to be considered in isolation. Rather, it was 12 seconds within an hour-long programme, which also contained lots of voices in support of Trump.Finally, an opinion on a matter of public concern and political speech is heavily protected under defamation laws in the US.A BBC insider said that internally, there is a strong belief in the case the corporation has put forward, and in its defence.BBC News approached the Department for Culture, Media and Sport for comment, which said they would not be issuing a statement.Liberal Democrats leader Sir Ed Davey urged the prime minister to \"get on the phone to Trump\" to put a stop to his lawsuit threat and \"defend the impartiality and independence of the BBC\".Fresh claim of misleading editEarlier on Thursday, the BBC was accused of another misleading edit of Trump's 6 January 2021 speech, two years before the Panorama sequence aired.On a Newsnight programme from 2022, the edit is a little different from Panorama.Trump is shown as saying: \"We're going to walk down to the Capitol. And we're going to cheer on our brave senators and congressmen and women. And we fight. We fight like hell. And if you don't fight like hell, you're not gonna have a country anymore.\"This was followed by a voiceover from presenter Kirsty Wark saying \"and fight they did\" over footage from the Capitol riots.Responding to the clip on the same programme, former White House chief of staff Mick Mulvaney, who quit a diplomatic post and became a critic of Trump after describing the 6 January riots as an \"attempted coup\", said the video had \"spliced together\" Trump's speech.\"That line about 'we fight and fight like hell' is actually later in the speech and yet your video makes it look like those two things came together,\" he said.In response to Thursday's story in the Telegraph, a BBC spokesperson said the BBC holds itself to the \"highest editorial standards\" and the matter was being looked into.A spokesman for Trump's legal team told the Telegraph it was \"now clear that BBC engaged in a pattern of defamation against President Trump\".Concerns over the Trump Panorama documentary emerged when a leaked internal memo, written by a former independent external adviser to the corporation's editorial standards committee, was published by the Telegraph newspaper. Among other things, the document also criticised the BBC's reporting of trans issues, and BBC Arabic's coverage of the Israel-Gaza war.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC apologises to Trump over Panorama edit but refuses to pay compensation",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/49e0/live/b162e9a0-c11c-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-14T08:06:54.000Z",
      "dateModified": "2025-11-14T08:06:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Renters’ Rights Act: No-fault evictions banned from May 2026",
    "url": "https://www.bbc.com/news/articles/c8x1n9rv809o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f3d8/live/9ed13120-c0c7-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-13T22:31:51.000Z",
    "description": "No-fault evictions to be banned in England from May10 hours agoTarah Welsh,housing reporter and Tara MewawallaGetty ImagesNo-fault evictions will be o",
    "body": "No-fault evictions to be banned in England from May10 hours agoTarah Welsh,housing reporter and Tara MewawallaGetty ImagesNo-fault evictions will be outlawed in England from 1 May, the government confirmed, as it set out the timeline for sweeping renters' reforms.The changes also see the end of fixed-term tenancy contracts, as renters move onto so-called \"rolling\" agreements, as well as an end to \"bidding wars\" and clearer rules on having pets.Landlords have said the reforms would increase the screening of prospective tenants and have spoken of nervousness around what happens when tenancies go wrong.Housing Secretary Steve Reed said the government was \"calling time\" on \"rogue landlords\" by initiating a raft of measures in the Renters' Rights Act.\"We're now on a countdown of just months to that law coming in - so good landlords can get ready and bad landlords should clean up their act,\" he added.Shadow housing secretary Sir James Cleverly said the reforms \"will drive landlords from the market, reduce supply and send prices up for tenants\".He said that, \"with a start date of May 2026, we are now set for a six-month fire sale with tenants forced out at short notice\".Approximately 4.4m households in England rented from a private landlord between 2021 to 2023. The new rules will affect more than 11 million people.The Renters' Rights Act - described as the biggest shake-up to renting in England for more than 30 years - was formally approved at the end of October.While many renters welcomed the introduction of the timeline, some landlords expressed concern about the speed of the changes.Deadline to implement changes is 'not enough'Ben Beadle, chief executive of the National Residential Landlords Association, said the deadline alone to implement the changes is \"not enough\".He added: \"We have argued consistently that landlords and property businesses need at least six months from the publication of regulations to ensure the sector is properly prepared for the biggest changes it has faced for over 40 years.\"From May, properties will be rented on a \"periodic\" or rolling basis, rather than under a fixed 12 or 24-month contract.Tenants who want to leave can give two months' notice, which the government says will prevent tenants paying rent for substandard properties.Landlords will no longer be able to evict tenants for complaining about poor conditions.More than 11,000 households in England had their homes repossessed by bailiffs following a section 21 eviction in the year to June.Victoria, 25, had to suspend studying for her degree after she received a section 21 eviction notice in March.She was living in Durham while studying at the University of Northumbria and believes the eviction was partly due to complaints about the property's condition.\"I ended up having no choice but to move back in with my parents and I was devastated.\"'Your safety net can be pulled away on a whim of the landlord'Kerrie became homeless after reporting significant mould in her flatKerrie, 27, became homeless after reporting significant mold in her Cambridgeshire flat to environmental health in 2020.The council placed her in temporary accommodation while the landlord was told to address the issue, but she was still stuck paying rent.She said: \"I think it's outrageous that the landlord continued to charge me full rent... ultimately, he didn't really face any obstacles.\"A few weeks after she moved back in, she was given a section 21 notice, making her homeless. She would nap in public bathrooms, sleep on long bus routes and shower at her gym.\"I think it's so ridiculous that your whole safety net and foundation can be pulled away on a whim of the landlord,\" Kerrie said.The mold was reported to Kerrie's landlordTen households in Hackney, east London, in houses that are all owned by the same landlord, said they had recently been issued with section 21 notices without reason.One of the affected tenants, who did not want to give her name, said she was \"really panicking\".\"We were looking for a place this time last year and it took us three to four months to find one,\" she said.The government confirmed that all section 21 notices issued before May will stand, but it said landlords must begin court repossession proceedings by 31 July 2026.The overhaul of the current system means that, from 1 May, landlords will only be able to evict tenants in certain circumstances: if tenants damage a property, commit antisocial behaviour, or fall significantly behind paying the rent.'Anti-landlord' legislationMaureen Treadwell contacted BBC News with concerns about the new law. Her family rent out 10 properties in Hampshire.\"There are draconian fines if you get things wrong, so the whole thing feels anti-landlord,\" she said. She raised her fears that, without reforms to the court system making it quicker to evict bad tenants, there will be an exodus of people who want to let their homes.\"Is it worth letting your house and then having a court fight to recover it, or a one-year delay? It's not worth it. So it will end up making the housing crisis worse.\"Maureen Treadwell's family rent out 10 properties in HampshireReed told the BBC he was \"working with the Ministry of Justice to look at how we can ensure that there are not undue delays\" in situations where a landlord wanted to evict a tenant who was misbehaving.In addition, landlords will be able to evict tenants if they want to sell or move into the property but not in the first 12 months after a tenancy begins.The new laws also include banning bidding wars and discrimination of parents and those on benefits, as well as setting out a clearer process for those renting with pets.Many renters' groups have welcomed the changes. The Renters Reform Coalition - which includes Shelter, Generation Rent and Citizens Advice - says section 21 is \"a huge issue\".\"It is not the prospect of giving renters these vital rights that is fuelling record homelessness, but the gross injustice of no-fault evictions,\" said Shelter's Mairi MacRae.The Renters' Rights Act applies to England. Scotland abolished no-fault evictions in 2017, but Wales and Northern Ireland still have no-fault evictions under something similar to section 21. In 2022, Wales increased the notice period for these to six months.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Renters’ Rights Act: No-fault evictions banned from May 2026",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f3d8/live/9ed13120-c0c7-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-13T22:31:51.000Z",
      "dateModified": "2025-11-13T22:31:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Russia launches wave of deadly strikes across Kyiv, officials say",
    "url": "https://www.bbc.com/news/articles/cn4jn94gyllo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/622d/live/e33074c0-c130-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-14T06:58:35.000Z",
    "description": "Three people have died and at least 26 others injured in a wave of Russian drone and missile strikes on Kyiv, Ukrainian officials say.Mayor Vitaliy Kl",
    "body": "Three people have died and at least 26 others injured in a wave of Russian drone and missile strikes on Kyiv, Ukrainian officials say.Mayor Vitaliy Klitschko described strikes, which caused explosions and fires in residential buildings across the city, as \"massive\". Kyiv's energy infrastructure was also damaged, leaving some buildings in the north-east without heat, he said. Ukraine's air force reported several other regions across the country were also being targeted.Russia's defence ministry said it had downed or intercepted 216 Ukrainian drones that had targeted its industrial facilities and disrupted air travel, according to Reuters news agency. In Kyiv, residential buildings came under attack \"in practically every district\", the head of the city's military administration Tymur Tkachenko said on Telegram.He issued a warning to take shelter a minute after midnight local time on Friday (22:01 GMT), writing \"it's loud in Kyiv\".Falling debris and fires have damaged multiple high-rise apartment buildings, a hospital, school and administrative buildings, according to emergency services. More than 40 people have been rescued, they added, including 14 from a fire in a residential building in Desnayanskyi district where one person died.Another person was rescued in the building after being pulled from beneath rubble, they said.Medical teams were deployed to all fires, officials said, while Klitschko said nine people were being treated in hospital with one man in an \"extremely serious condition\".Parts of the Ukrainian capital's heating network were also damaged in the attack, the mayor noted, adding that the city's electricity and water supplies may have been disrupted. Ukraine's air force warned drones and guided bombs had been targeting several other regions, including Sumy.The overnight strikes follow the deaths of six people in another Russian offensive less than a week ago that also damaged residential buildings and energy infrastructure. Russia says its attacks on energy targets, now a familiar part of the war, are aimed at the Ukrainian military. Those attacks prompted Ukrainian President Volodymyr Zelensky to call for \"no exceptions\" to Western sanctions on Russian energy - shortly after the US granted Hungary one such exemption. US President Donald Trump had initially announced the sanctions on Russian oil after saying ceasefire talks with Russian President Vladimir were not progressing. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Russia launches wave of deadly strikes across Kyiv, officials say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/622d/live/e33074c0-c130-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-14T06:58:35.000Z",
      "dateModified": "2025-11-14T06:58:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I could hardly walk - the issue that affects 1 in 5 mums",
    "url": "https://www.bbc.com/news/articles/c0mxk3w9277o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e3db/live/126fd750-ba68-11f0-ba8c-5f7067df6bdc.jpg",
    "tag": "Trending",
    "date": "2025-11-14T01:21:48.000Z",
    "description": "7 hours agoEmily HoltRebecca MiddletonWhen Rebecca Middleton became pregnant, she had no idea that she would end up in a wheelchair for the final thre",
    "body": "7 hours agoEmily HoltRebecca MiddletonWhen Rebecca Middleton became pregnant, she had no idea that she would end up in a wheelchair for the final three months before she gave birth. Rebecca had had a difficult first trimester dealing with nausea and sickness, and began to develop pelvic pain four months into her pregnancy. \"I could hardly walk, I'd always had some problems with lower back pain in my life. But nothing that significant and it escalated quite quickly,\" she says. After complaining about the pain, she was referred to an NHS physio, and eventually diagnosed with an extreme case of pelvic girdle pain (PGP), also known as symphysis pubic dysfunction.Problems with your pelvic joints are a common symptom of pregnancy, affecting one in five expectant mothers to some degree.\"I was terrified, would I ever walk again? How would I have my baby, how would I care for it?\"Rebecca MiddletonRebecca now helps raise awareness of the issueAfter giving birth, Rebecca was in less pain, but she still struggled with basic things like walking, lifting her son or pushing a pram. \"I was disabled for seven months and had to have someone helping me all the time,\" she says. \"I just couldn't do the things that you should be able to do in looking after a baby, it was a really challenging time.\"Prior to becoming pregnant, it was an issue Rebecca was unaware of and since her experience she volunteers for The Pelvic Partnership, a charity which helps raise awareness and support women with this condition.It says the condition is treatable with the right action. As soon as your symptoms start, the charity advises you get hands-on individualised treatment, including manual therapy, and ask for a referral for NHS physiotherapy from your GP or midwife.If you aren't offered this support initially, the charity suggests going back to your GP or midwife and asking for a second opinion.They can also refer you to maternal mental health support to help you manage the emotional impacts of living with PGP.Dr Nighat Arif, a women's health specialist, says higher awareness and early assessment could prevent patients like Rebecca needing wheelchairs or crutches.\"Without that early identification based on a really good understanding of the female body, we leave some of these women with negative effects for life,\" she says.Gynaecologist Dr Christine Ekechi says the lack of research around the condition means it is less likely to be identified and suitably treated, particularly post birth.\"We don't necessarily see them unless they then come back into a gynaecology clinic presenting with pain.\"So we don't have a great understanding as to the proportion of women that have persisting pain that has started off during pregnancy.\"Victoria RobertonVictoria says her second pregnancy was much easier to manageVictoria Roberton, co-ordinator at the Pelvic Partnership, is an example of how awareness can help. Like Rebecca, she didn't know what PGP was when she began experiencing the condition during her first pregnancy. She tried to stay as active as possible as advised and was referred to NHS physio sessions online and by phone, but found the pain worsening as her pregnancy progressed. \"They gave us exercises, stretches to do. By this point I couldn't do any of them. It was too painful,\" she says. It got to the point where even sitting became uncomfortable for Victoria, and she was largely homebound until her baby was born. The pain lessened after the birth of her daughter, but she began experiencing the same problem when she became pregnant with her second child. It's not an option for many mothers, but Victoria said given her medical history she decided to pay for a private physio as the NHS wait for referral was long.The physio gave her a full assessment and hands-on treatment including joint mobilisation, and taught her different ways to move her body to not aggravate her hip joints, which helped ease the pain. Victoria still struggles with a degree of PGP today, four years on, but her second pregnancy was much easier to manage because she understood her condition and how to handle it.   Rebecca's second pregnancy has been similarly a much more positive experience. This time round she knew she was at risk of PGP and was able to have it treated throughout her pregnancy before it became debilitating.She has made a full recovery from PGP, just two months post birth compared to  two years for her first child. \"I'm probably in better shape now than I was before either of my children because I now know what caused that pelvic girdle pain, and have had it fully treated and resolved with manual therapy,\" she says.  \"It was five years of hell because of the pain I was in because of a lack of knowledge and understanding about the subject.\"  Other stories you may enjoy",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I could hardly walk - the issue that affects 1 in 5 mums",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e3db/live/126fd750-ba68-11f0-ba8c-5f7067df6bdc.jpg"
      ],
      "datePublished": "2025-11-14T01:21:48.000Z",
      "dateModified": "2025-11-14T01:21:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Max Klymenko wins TikTok creator of the year for career ladder series",
    "url": "https://www.bbc.com/news/articles/c17p1z5ppq8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4d7f/live/3fdf6b50-c126-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "Trending",
    "date": "2025-11-14T01:11:12.000Z",
    "description": "TikTok award winner Max: 'It takes me hours to make the content you scroll on the toilet'7 hours agoYasmin RufoMagazine LondonGetty ImagesMax Klymenko",
    "body": "TikTok award winner Max: 'It takes me hours to make the content you scroll on the toilet'7 hours agoYasmin RufoMagazine LondonGetty ImagesMax Klymenko took home the coveted prize of creator of the yearA transport enthusiast, a beauty advocate and a mum teaching people how to raise an autistic child were among the winners of the second annual TikTok awards. Hosted by TV presenter Aj Odudu at Magazine London, awards were handed out in  12 categories including fashion, travel, food and education. And taking home the coveted prize of creator of the year was Max Klymenko, who is best known for his career ladder series, which he says is the most popular non-animated show in the world.In case you've not seen it, Max sets up his stepladder in various public spaces and invites passers-by to join him standing on the ladder while he tries to guess their career with a series of yes/no questions. Max came to the UK from Ukraine 14 years ago and said the reason he started creating content was because he found it impossible to get a job to get his own career going. \"I had a lot of anxiety and stress around finding a job so I created videos helping people know what jobs were available to them.\" Gold ladder in hand, Max, who has 8.5 million followers on TikTok, dedicated his award to his grandma in Ukraine who \"has no electricity to follow along\". \"I'm calling her right after this,\" he said, explaining that she used to log-in from different TikTok accounts when he first started creating content so it looked like he had more views. The 29-year-old, who accepted his award from last year's winner Kyra-Mae Turner added that he was grateful his content was being recognised because \"everything you see when you scroll on the toilet or in bed takes hours to make\".The nominees have a combined follower count of more than 83 million and the winners were voted for by five million people on the app. Winning the award for video of the year was Bemi Orojuogun, better known as bus aunty. Often seen smiling silently on TikToks as she stands at the side of a road or a depot – while a passing double-decker appears to narrowly miss hitting her – Orojuogun has turned her lifelong love of the London's transport network into a viral celebration of city life.Getty ImagesBemi thanked Transport for London, Stormzy and god for her award tonight Her winning video has been viewed almost 50 million times and she now has collaborations with Burberry and Ikea.The mental health nurse has become one of TikTok's most unexpected success stories and she admitted: \"It's slightly overwhelming that everyone recognises me,\" but said is she is proud of what she's achieved.She thanked Transport for London and Stormzy, saying that he propelled her to fame after re-posting one of her videos. The 56-year-old grandma had a wonderful night making friends - including Nikki Lilly, the winner of the fashion and beauty creator of the year.Nikki, who has 10 million TikTok followers, told the BBC that fashion, beauty and lifestyle content can be seen as \"skin deep\" but her content challenges those perceptions. \"I don't want to only make my social media a highlights reel,\" the 21-year-old said. \"It's also me having surgeries, a chronic illness and me having a facial difference.\"Third wheeling a new friendship... Bemi and Nikki have found a best friend in each other After being diagnosed with an arteriovenous malformation, a rare life-threatening medical condition, at age six, she has used her platform to raise awareness and inspire others.\"As someone with a facial condition, I've never felt fully embraced in this space,\" she said while accepting her award. But she added, she has now found \"so much safety\" in the TikTok beauty world. Another advocate creator is Tola and Kevin who won the \"voice for change\" award. Getty ImagesTola's content about raising an autistic child has seen her build up a global following Tola and Kevin are a mother-son duo behind an account that posts candid videos of what it's like to raise a young adult with autism, striving to create content that raises awareness and promotes acceptance.In tears, Tola said she was so grateful for the award and explained she started the account because she felt isolated when her son was first diagnosed with autism 16 years ago.She's since built an \"amazing community who love and support Kevin\" which has helped the both of them immensely. One of the most recognisable winners of the night was Charley Marlowe, a Radio 1 presenter, who won entertainment creator of the year. Getty ImagesCharley's celebrity interviews and presenting work earned her the award for entertainment creator of the year If you don't know her, you're likely to know her famous cackle which has become her trademark. On the red carpet earlier in the night she told me \"Win or lose, we're on the booze, so I'm having a good night anyway.\" She was in shock to have won the award and dedicated it to \"every northern, working-class diva.\" Full list of winnersCreator of the year - Max KlymenkoEntertainment creator of the year - Charley MarloweFood creator of the year - Kieran MonlouisSport creator of the year - Lissie MackintoshFashion and beauty creator of the year - Nikki LillyTravel creator of the year -  Phil CarrBooks & learning creator of the year - Gabriel AstorgaVoice for change creator of the year - Tola and KevinStoryteller of the year - Morgan M James Rising star creator of the year - Joy AnokwuruVideo of the year award - Bemi OrojuogunArtist of the year - Olivia Dean",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Max Klymenko wins TikTok creator of the year for career ladder series",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4d7f/live/3fdf6b50-c126-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-14T01:11:12.000Z",
      "dateModified": "2025-11-14T01:11:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'BBC apologises to Trump' and stricter 'Denmark-style' migrant laws",
    "url": "https://www.bbc.com/news/articles/c0mx7ywg898o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b7e9/live/37fb8050-c102-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "Trending",
    "date": "2025-11-14T05:42:00.000Z",
    "description": "'BBC's apology to Trump' and '84 in, 113 out' on migrants deal3 hours agoIssued one day before the deadline set by the US president, the BBC's officia",
    "body": "'BBC's apology to Trump' and '84 in, 113 out' on migrants deal3 hours agoIssued one day before the deadline set by the US president, the BBC's official apology to Donald Trump leads the way on the front page of the Guardian. Under the headline \"BBC apologises to Trump over Panorama, but rejects $1bn claim\" the paper quotes the BBC's public statement that \"sincerely regrets\" how it edited a clip of his speech in a Panorama documentary, but strongly disagrees there is a basis for Trump's defamation claim.The Daily Telegraph, which originally broke the story about Panorama, has a new angle involving another big BBC show. It says that Newsnight also misleadingly edited a Trump clip from the same speech, for a programme in 2022, two years prior to Panorama. The paper says the \"spliced footage\" appeared to suggest that Trump was encouraging his supporters to riot. In response, a BBC spokesperson said: \"The BBC holds itself to the highest editorial standards. This matter has been brought to our attention and we are now looking into it.\"Meanwhile, Metro turns its attention to the long-standing debate on how politicians can deal with asylum seekers arriving in the UK on small boats. Its headline \"84 in... 113 out\" collates the latest total in the government's recently-introduced one-in-one-out strategy. That would be encouraging news for Home Secretary Shabana Mahmood but the paper argues that figure is \"dwarfed\" by the total of more than 8,000 people who have arrived on small boats since the deal began.In a further effort to crack down on illegal migration methods, the i Paper reports that Mahmood will reveal tougher \"Denmark-style\" laws which include deporting 95% of failed asylum seekers and creating barriers to family reunions. The move aims to deter new arrivals and restrict refugees to a temporary stay in the country, the paper says. Those new measures, expected to be announced next week, would be \"the most radical asylum reforms since the Second World War\" says the Times. The home secretary hopes the stricter rules will help tackle the \"pull factors\" that have made the country Europe's destination for \"asylum shoppers\", the paper says.The fallout from newly released Jeffrey Epstein emails continues to dominate the news agenda for the Daily Mirror. The paper focuses on allegations from accuser Virginia Giuffre that Andrew Mountbatten-Windsor was aware of the late sex offender's conduct. \"Andrew 'knew Epstein abused girls'\" is the headline, featured alongside the infamous photo of Andrew and Epstein walking in New York's Central Park from 2010. Andrew has consistently denied Ms Giuffre's allegations.Andrew's ex-wife Sarah Ferguson is also caught up in the Epstein fallout as the Daily Star reports she is planning to move to her daughter Princess Eugenie's villa in Portugal to escape the media storm. \"Ferg off... and don't come back\" is the paper blunt send-off.The Daily Mail shifts its focus to revelations from an independent review of the Sara Sharif case which identified multiple failings from agencies before her murder in Surrey in 2023, after years of abuse by her parents. The paper highlights a finding that revealed neighbours of the Sharif family heard things that worried them but were hesitant to raise concerns for \"fear of being seen as racist\".\"Sara failed by officials 'afraid to cause offence'\" echoes the Daily Express, as it says the \"damning review\" found that social workers did not fully question why Sara wore a hijab - which hid her injuries - because they were \"too scared of being branded racist\". The Independent leads with another damning report, one conducted by cross-party MPs who warn that Afghans who served with UK forces remain vulnerable after the Ministry of Defence failed to implement safeguards following multiple data breaches. Also gracing the front page is a photo of Sir David Beckham giving a thumps up, as the paper says the former footballer is backing its campaign to launch a lifeline for missing children.Meanwhile in Europe, a \"call to arms\" in Germany provides the lead for the Financial Times. Berlin has ruled that all 18-year-old German men must have medical inspections to see if they are fit enough to serve in the military as part of a recruitment drive, the paper reports.Finally, the Sun splashes with another \"Ramsay wedding feud exclusive\". The paper reports that Adam Peaty's brother has been arrested over allegations he sent threats to the Olympian during his stag-do, ahead of the swimmer's wedding to social media influencer Holly Ramsay . James Peaty was questioned by police and later released on conditional bail.The Financial Times' main story online suggests the chancellor, Rachel Reeves, has ditched plans to increase income tax rates in this month's Budget. The report quotes unnamed officials, who say the idea - which contradicts a Labour manifesto pledge - has been shelved due to fears it would anger voters.The Guardian leads on the BBC's apology to Donald Trump for the edited video clip on Panorama, and its rejection of demands for compensation. The corporation has been advised it has a strong legal case, according to the report. The paper notes it remains to be seen how Trump will respond.The i Paper focuses on the changes to UK immigration law due to be announced by the home secretary next week. The paper says Shabana Mahmood is seeking to change European human rights laws, specifically migrants' use of Article 8 - a right to family life - to halt deportations. The new model is based on Danish laws, with the report noting that 95% of failed asylum seekers into Denmark are deported.\"Andrew knew Epstein abused girls\" reads the Daily Mirror's headline. The paper leads on the thousands of documents released by US lawmakers related to the convicted sex offender, including testimony from the ex-prince's accuser, Virginia Giuffre. Andrew Mountbatten-Windsor has always denied knowledge of or involvement in Epstein's crimes.The Daily Mail leads on a report into the murder of the 10-year-old schoolgirl, Sara Sharif. It said officials were scared to speak out due to fears they would be seen as racist.The Daily Express also highlights the story. \"Sara failed by officials afraid to cause offence\" reads its headline.Animal rights campaigners are warning that hundreds of pigs in the New Forest are under siege from \"smartphone-brandishing piggy tourists\", according to a report in the Times.The paper quotes one campaigner who has criticised local businesses for encouraging people to crowd, chase and photograph the wild pigs when they come out to feed.Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'BBC apologises to Trump' and stricter 'Denmark-style' migrant laws",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b7e9/live/37fb8050-c102-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-14T05:42:00.000Z",
      "dateModified": "2025-11-14T05:42:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC News quiz of the week: Who did Alan Carr give his Celebrity Traitors prize to?",
    "url": "https://www.bbc.com/news/articles/cn4jn8zmdrdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1a66/live/f8c91bd0-c0ad-11f0-8456-eff94716b162.jpg",
    "tag": "Trending",
    "date": "2025-11-13T18:30:38.000Z",
    "description": "10 mins agoBBC apologises to Trump over Panorama edit but refuses to pay compensationLawyers for the US president have threatened to sue the corporati",
    "body": "10 mins agoBBC apologises to Trump over Panorama edit but refuses to pay compensationLawyers for the US president have threatened to sue the corporation for $1bn (£759m).10 mins ago2 hrs ago'Wee firecracker' doing Derry proud in Big Brother, mum saysJenny Baird, a 20-year-old makeup artist from Londonderry is a fan favourite in the Big Brother house.2 hrs ago11 hrs agoPat Butcher to return to EastEnders in episode focused on dementiaThe beloved character, played by Pam St Clement, returns next month in Nigel's  memories from the 90s.11 hrs ago21 hrs agoThe TV hit that sparked the Korean drama boomA decade ago, Reply 1988 launched. An emotional and nostalgic show about life in 1980s Seoul, it paved the way for other Korean global hits like Squid Game.21 hrs ago23 hrs ago'Not an easy job' - why would anyone want to be the new BBC director general?As the BBC searches for a new chief, who are the potential candidates and is it a poisoned chalice?23 hrs ago",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC News quiz of the week: Who did Alan Carr give his Celebrity Traitors prize to?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1a66/live/f8c91bd0-c0ad-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-13T18:30:38.000Z",
      "dateModified": "2025-11-13T18:30:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Peers suggest over 900 changes to assisted dying bill",
    "url": "https://www.bbc.com/news/articles/c2drk17p942o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/345e/live/a4721120-c0c3-11f0-9de8-edd64aee3552.png",
    "tag": "Trending",
    "date": "2025-11-13T19:05:44.000Z",
    "description": "13 hours agoJennifer McKiernan,Political reporter and Harry Farley,Political correspondentMembers of the House of Lords have put forward more than 900",
    "body": "13 hours agoJennifer McKiernan,Political reporter and Harry Farley,Political correspondentMembers of the House of Lords have put forward more than 900 proposed changes to the law to deliver assisted dying, ahead of a debate on Friday.Experts believe the number of amendments, which is understood to be 942, is  unprecedented, but opponents say significant alterations are needed to ensure any scheme can operate safely.The volume of amendments has sparked a letter from 65 supportive peers to their colleagues in the Lords, raising concern about possible delaying tactics.Those opposing the bill have been urged not to \"frustrate\" the passage of the legislation, which has already gained the approval of MPs. The House of Commons passed the Terminally Ill Adults (End of Life) Bill in June, and it passed its first stage in the Lords in September.An amendment by Labour's Baroness Berger was approved to allow a committee of peers to scrutinise the legislation further.The wider House of Lords will now carry out line-by-line examination of the bill.Parliament heard officials worked into the early hours of Thursday morning to compile the suggested changes to the bill that flooded in ahead of the next scrutiny stage, known as committee stage, which begins on Friday. There appear to be seven opponents to the bill who have submitted 579 amendments between them.According to the parliamentary authorities, while some bills have had more amendments tabled in total at committee stage, it sets a possible record for the number submitted in the first full list of suggested changes.They say it is almost certainly unprecedented for the committee stage of this type of bill, known as a private member's bill, which has been put forward by backbench Labour MP Kim Leadbeater rather than the government.Experts including Matthew England, a researcher at the Hansard Society, said the number of amendments \"does appear to be a record, at least in the recent past\".Others drew comparisons to the bill to take the UK out of the European Union, which had 820 amendments in total. A peer in favour of the legislation told the BBC that the number of amendments \"looks like a delaying tactic to me... It's obviously not a coincidence.\"Defending the volume of amendments,  Baroness Luciana Berger, who opposes assisted dying, told the BBC that evidence to the select committee \"strongly refuted any suggestion this bill is either safe or workable\".\"This bill is full of holes which vulnerable people will fall through and be harmed if peers don't act to change and amend it,\" she added.However, signatories to the letter highlighted how the bill had \"already undergone unprecedented scrutiny\" and \"offers dying people the choice of a safe, dignified end while strengthening protections for the vulnerable\".Former Royal College of Nursing president Baroness Rafferty was among the 65 peers to have signed, and she was joined by scientist and broadcaster Lord Winston, former Labour leader Lord Kinnock and former Whitehall chief Lord O'Donnell.They urged opponents to focus on refining the bill to find where \"genuine improvements can be made, while respecting both the will of the Commons and the overwhelming support of the public\".In response to the letter, a source close to peers who are concerned about the bill said: \"This letter is making claims directly contradicted by the evidence provided in the last few weeks at the Lords select committee by the royal colleges, professionals and independent statutory bodies. \"Evidence and facts are vital when crafting good legislation.\"The bill is being treated by parties as a matter of conscience, meaning they will not instruct their MPs or peers how to vote. The bill will become law in England and Wales only if both the House of Commons and House of Lords agree on the final drafting of the legislation - with approval needed before spring next year, when the current session of Parliament ends.If it does pass into law, the government has four years in which to get an assisted dying service into place, meaning it could be 2029/30 before the first assisted death happens.The legislation proposes allowing terminally ill adults with fewer than six months to live to apply for an assisted death.This would be subject to approval by two doctors and a panel featuring a social worker, a senior legal figure and a psychiatrist. Sign up for our Politics Essential newsletter to read top political analysis, gain insight from across the UK and stay up to speed with the big moments. It'll be delivered straight to your inbox every weekday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Peers suggest over 900 changes to assisted dying bill",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/345e/live/a4721120-c0c3-11f0-9de8-edd64aee3552.png"
      ],
      "datePublished": "2025-11-13T19:05:44.000Z",
      "dateModified": "2025-11-13T19:05:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pam St Clement to return to EastEnders as Pat Butcher in dementia episode",
    "url": "https://www.bbc.com/news/articles/cvgvwx7qwnvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9e6c/live/1367e810-c0ac-11f0-a18a-95a39ab23d99.jpg",
    "tag": "Trending",
    "date": "2025-11-13T21:00:05.000Z",
    "description": "11 hours agoIan YoungsCulture reporterBBCPat will return when Nigel's \"memories and altered reality take him back to the 1990s\"EastEnders favourite Pa",
    "body": "11 hours agoIan YoungsCulture reporterBBCPat will return when Nigel's \"memories and altered reality take him back to the 1990s\"EastEnders favourite Pat Evans, formerly Pat Butcher, is to return to the BBC soap for a one-off comeback episode over the Christmas period.The character, played by Pam St Clement, was beloved by viewers for more than 25 years for her no-nonsense personality and memorable taste in earrings.Pat died in 2012, but was later seen on-screen again with Dame Barbara Windsor, when she returned as a figment of the dying Peggy's imagination in 2016.She will now similarly come back, acting alongside Paul Bradley as Nigel, whose memories take him back to the 90s, as part of a storyline about his dementia next month. 'Coming home'\"I was both surprised and excited to be asked back to tread the streets of Walford once again and to be involved in Nigel's touching dementia storyline,\" St Clement, 83, said.\"It was lovely to be welcomed back by those with whom I had worked for so long. It was just like coming home.\"Pat returns to help Nigel when his dementia symptoms intensify, following an emotional evening at his festive film screening.St Clement first appeared in EastEnders in 1986 and was at the heart of the drama in Albert Square until her character's death.EastEnders executive producer Ben Wadey said: \"It's an honour and a privilege to welcome Pam St Clement back to EastEnders for a special episode in Nigel's ongoing dementia storyline.\"Pat Evans is one of the most cherished and iconic characters to have graced the streets of Walford, and I know I speak on behalf of everyone when I say what a delight it was to see Pat and Pam back in The Queen Vic, as she helps Nigel in his time of need.\"Pat is one of a number of classic characters who have made a return to Walford.Anita Dobson's Queen Vic landlady Angie Watts made a surprise return to visit her daughter Sharon, as she drifted in and out of consciousness in the show's 40th anniversary episode in February.Cindy Beale (Michelle Collins) and Zoe Slater (Michelle Ryan) are back in the Square, while Grant Mitchell (Ross Kemp) and Chrissie Watts (Tracy-Ann Oberman) made recent short-term comebacks.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pam St Clement to return to EastEnders as Pat Butcher in dementia episode",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9e6c/live/1367e810-c0ac-11f0-a18a-95a39ab23d99.jpg"
      ],
      "datePublished": "2025-11-13T21:00:05.000Z",
      "dateModified": "2025-11-13T21:00:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK weather: Met Office amber rainfall warnings for Friday ahead of Storm Claudia",
    "url": "https://www.bbc.com/weather/articles/cj0e3y6yy99o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/003a/live/b44752a0-c121-11f0-8b03-8dbd258435ad.jpg",
    "tag": "Trending",
    "date": "2025-11-14T07:56:04.000Z",
    "description": "Amber warnings have been issued by the Met Office as Storm Claudia brings heavy rain to parts of the United Kingdom.With rain persisting for much of F",
    "body": "Amber warnings have been issued by the Met Office as Storm Claudia brings heavy rain to parts of the United Kingdom.With rain persisting for much of Friday and into Saturday morning, some areas may get near to their whole months worth of rain. Flooding and difficult travelling conditions are likely with a strong easterly wind also developing.The warnings come after recent rain and flooding has already affected many areas such as south Wales last week.Storm Claudia - named by the Spanish Meteorological Agency (AEMET) - has already brought heavy rain and strong winds to Spain and Portugal.But rain associated with this storm has spread across England and Wales where it stalls and continues for most of the day on Friday.A large Met Office yellow severe weather warning is in force across most of England and Wales and will be valid until Saturday at 06:00 GMT.Around 30-50mm (1.2-2.9in) of rain is expected quite widely which may bring some localised flooding and transport disruption.But, more severe Met Office Amber warnings, issued for parts of south-east Wales will be in force from 12:00 to 23:59 GMT where up to 150mm of rain - nearly 6 inches - is possible over high ground.An additional amber warning will also come in to effect for the same time across parts of east Wales, the Midlands and towards eastern England.Here around 40-60mm (1.6-3in) of rain is likely, with some places seeing up to 80mm (3.2in).The average rainfall for the whole of November across central England and south Wales is between 60-100mm (3-4in), so there is a good possibility some places will see close to their whole months rain in 24 hours.Flooding is likely, especially within the Amber warning areas. With flood warnings in place in some parts of the country already, Ben Lukey, Flood Duty Manager at the Environment Agency, said:\"Storm Claudia will bring heavy prolonged rainfall across parts of England, with significant surface water flooding probable across parts of central England on Friday, while significant river flooding impacts are also possible, and into Saturday.\"There will also be some difficult driving conditions with transport disruption.RAC breakdown spokesperson Alice Simpson said: \"We urge drivers to take the amber weather warnings associated with Storm Claudia extremely seriously, as they indicate roads are likely to become flooded and therefore represent a risk to life.\"\"Drivers may wish to consider delaying their journeys until the worst of the impacts are over, especially in areas that are hardest hit this weekend\".Strong easterly winds will accompany the rain.Additional yellow warnings for the wind have been issued for the far north-west of Wales and the Pennines.Gusts up to 50-70mph (80-113km/h) could bring some minor damage and disruption.While a typical named storm in the UK might sweep in from the North Atlantic bringing strong and damaging winds,  Storm Claudia is more notable for the rainfall.Named by AEMET earlier this week for the impacts it has brought to Spain, the storm is moving up the western side of Portugal and France and approaching the UK from the south-west.And while it will turn quite windy with gusts up to 70mph (113km/h) in north-west Wales and the Pennines, the winds are not its most notable feature.Once one meteorological agency takes the decision to name a storm, there is agreement that all nations use the same name to allow consistency and clearer communication of the impacts.Claudia does not replace any of the names in the UK's list of named storms. So we can still expect the next named weather event christened by either the Met office, Met Eirean in Ireland or KNMI in the Netherlands to be Bram.Rain has featured a lot so far this November with some areas seeing over their November average in the first thirteen days.Shap and Carlisle in Cumbria for example have recorded more than their November rainfall already; 226mm and 95mm compared to the averages of 205mm and 85mm respectively.Other sites on higher ground such as Honister in the Lake District has recorded over 500mm of rain.Bannau Brycheiniog - known as the Brecon Beacons - in south Wales, has also been particularly wet with many Natural Resources Wales rainfall stations recording over 200mm of rain so far.The heavy rainfall in south Wales has also led to some significant flooding in previous weeks.A business owner who had to close his shop in Carmarthen due to the floods described it as \"the worst in living memory\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK weather: Met Office amber rainfall warnings for Friday ahead of Storm Claudia",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/003a/live/b44752a0-c121-11f0-8b03-8dbd258435ad.jpg"
      ],
      "datePublished": "2025-11-14T07:56:04.000Z",
      "dateModified": "2025-11-14T07:56:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US justice department sues California after redistricting ",
    "url": "https://www.bbc.com/news/articles/cvgwlze7ex2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7612/live/2bfbc620-c0cb-11f0-a532-d129af550177.jpg",
    "tag": "Trending",
    "date": "2025-11-14T01:59:21.000Z",
    "description": "The US justice department is filing a lawsuit against California over new congressional maps that voters approved in an election last week. The new ma",
    "body": "The US justice department is filing a lawsuit against California over new congressional maps that voters approved in an election last week. The new maps favour Democrats and aim to cancel out gains made by Republicans through recently redrawn voting districts in Texas. Attorney General Pam Bondi accused California Governor Gavin Newsom of a \"brazen\" power grab using racially gerrymandered maps. California voters overwhelmingly approved the redistricting bill known as Proposition 50, giving Democrats an advantage in five new congressional districts.\"These losers lost at the ballot box and soon they will also lose in court,\" a spokesperson for Newsom said in a statement to BBC News. Bondi accused Newsom of attempting \"to entrench one-party rule and silence millions of Californians\" by pushing the new congressional district boundaries.\"Newsom should be concerned about keeping Californians safe and shutting down Antifa violence, not rigging his state for political gain,\" she said.The justice department filed the complaint in a California federal court on Thursday,  aiming to block the new maps. Federal prosecutors accuse the Democratic governor and Secretary of State Shirley Weber of mandating \"racially gerrymandered congressional districts\" - a violation of the Equal Protection Clause of the 14th Amendment to the US Constitution.Gerrymandering - the redrawing of congressional districts to give a party an electoral advantage - is legal in the US but unconstitutional if it is based on race.The justice department cited \"substantial evidence\" that California legislature created a new map in which Latino demographics and racial considerations were predominant. \"Race cannot be used as a proxy to advance political interests, but that is precisely what the California General Assembly did with Prop 50,\" said Jesus A Osete, Principal Deputy Assistant Attorney General for Civil Rights in a statement.\"Californians were sold an illegal, racially gerrymandered map, but the U.S. Constitution prohibits its use in 2026 and beyond.\"The maps are part of nationwide redistricting efforts initiated by President Donald Trump in order to tip the scales of the 2026 midterm elections in favour of his Republican Party to ensure their majority control of the US House of Representatives.Newsom launched a campaign in August to suspend California's independently drawn maps in order to \"fight fire with fire\" as Republicans in Texas worked to change their maps at Trump's urging. California's top lawyer, Attorney General Rob Bonta, defended Newsom and the ballot initiative, noting that several legal challenges had already been brought against Proposition 50 and none had prevailed. \"Californians spoke loud and clear\" in the election, Bonta said in a statement. \"They are sick and tired of Trump's lawlessness, of his lies, and of his inability to make life more affordable for all Americans. Their voices must be honored.\"The California Republican Party and others filed a lawsuit last week challenging Proposition 50 and Bonta accused the federal justice department of \"seeking to intervene\" in that litigation.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US justice department sues California after redistricting ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7612/live/2bfbc620-c0cb-11f0-a532-d129af550177.jpg"
      ],
      "datePublished": "2025-11-14T01:59:21.000Z",
      "dateModified": "2025-11-14T01:59:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Blue Origin rocket successfully lands booster during launch",
    "url": "https://www.bbc.com/news/videos/c5yd0zd6eddo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cef1/live/22775f30-c123-11f0-8669-5560f5c90fbe.jpg",
    "tag": "Trending",
    "date": "2025-11-14T04:32:06.000Z",
    "description": "Blue Origin, the space company owned by Jeff Bezos, has successfully launched its New Glenn rocket from Florida. The rocket was carrying two Nasa spac",
    "body": "Blue Origin, the space company owned by Jeff Bezos, has successfully launched its New Glenn rocket from Florida. The rocket was carrying two Nasa spacecraft deployed towards Mars. The Escapade satellites will take 22 months to reach Mars and will orbit the planet to measure its atmosphere and magnetic field.The reusable booster powering New Glenn also separated from the rocket's upper stage and touched down on a floating landing pad in the Atlantic Ocean, in a successful first for Blue Origin.Elon Musk's SpaceX had been the only to accomplish this feat until now.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Blue Origin rocket successfully lands booster during launch",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cef1/live/22775f30-c123-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-14T04:32:06.000Z",
      "dateModified": "2025-11-14T04:32:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]