[
  {
    "title": "Latest twist in Trump diplomacy brings relief for Starmer",
    "url": "https://www.bbc.com/news/articles/c62wwre0jrro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/20c9/live/886d0110-f71e-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-21T23:01:41.000Z",
    "description": "9 hours agoChris MasonPolitical editorHurtling into view, noisily and quickly, comes another twist in the rollercoaster that is diplomacy in the era o",
    "body": "9 hours agoChris MasonPolitical editorHurtling into view, noisily and quickly, comes another twist in the rollercoaster that is diplomacy in the era of President Trump.Splenetic social media posts, bold claims in front of the cameras and provocative and to some deeply offensive AI-generated images of an American-owned Greenland.And now, so many of America's allies allow themselves a deep breath and an expression of relief.Just as so many of the furious rows begin on social media under this US president, this latest one has cooled considerably via social media too - with another post on his platform Truth Social.Within the government here in the UK, there is a quiet pride that Britain made its contribution to the welter of diplomacy European neighbours and others have been doing in recent days.I hear that the British diplomatic machine cranked up at every level: involving ministers, officials and embassies.The prime minister insisted on what he saw as the merits of \"calm discussion\" - but had to judge how to calibrate his response, both publicly and privately.At the core of this row, there was a fundamental public disagreement between Downing Street and the White House, something Sir Keir Starmer has sought to avoid where possible.But for him the integrity of a state - with Greenland's future being for Greenlanders and Denmark to decide - was a non-negotiable bottom line.In the 48 hours or so since spelling that out explicitly, in front of the cameras, on Monday morning, risk hung in the air - could the carefully cultivated relationship with President Trump be uprooted before our eyes?By Tuesday morning, it looked like the answer could be yes, with the president sounding off in capital letters about the government's deal to hand the Chagos Islands to Mauritius, an arrangement he had previously endorsed.What might come next? Again Downing Street held its breath, before deciding to notch up its critique in the Commons on Wednesday.The prime minister told MPs he would \"not yield\" over his support for Greenland, despite the threat of tariffs. His team knew this wasn't without risk.Now, almost as quickly as the row accelerated, President Trump has hit the brakes.A deal has been done, the threat of tariffs and reality of tub thumping language has gone.And yes, we have heard this album before.The president makes a provocative and to many outrageous suggestion, reaction around the world scatters in multiple directions, the White House has seized the agenda.The world, or at least the West, splutters, frets, contorts and argues – and a solution is arrived at, but not before so many are brutally reminded of America's brute force, when led by a man happy to be brutish in his approach.And America's friends and foes, catching their breath, ponder what will prompt the next diplomatic grenade from the Oval Office.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Latest twist in Trump diplomacy brings relief for Starmer",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/20c9/live/886d0110-f71e-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-21T23:01:41.000Z",
      "dateModified": "2026-01-21T23:01:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Weather warnings issued for heavy rain and flooding risk in parts of the UK",
    "url": "https://www.bbc.com/weather/articles/cn821qp029po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f831/live/e84a6ce0-f763-11f0-b840-39f43255a61a.jpg",
    "tag": "Trending",
    "date": "2026-01-22T07:56:25.000Z",
    "description": "Met Office weather warnings - including a more severe amber warning - have been issued for rain in parts of the UK.Heavy rain in eastern Scotland, Nor",
    "body": "Met Office weather warnings - including a more severe amber warning - have been issued for rain in parts of the UK.Heavy rain in eastern Scotland, Northern Ireland and parts of England and Wales will bring significant rainfall totals and the risk of flooding.Strong winds will accompany the rain, particularly in north-east Scotland.Into Friday, Storm Ingrid - named by the Portuguese weather service - will bring rain and strengthening winds into south-western areas of England and Wales.Heavy rain and strong winds have continued in eastern Scotland, where there is a Met Office amber warning in force for Grampian, Angus, and Perth and Kinross until 18:00 GMT.Rainfall accumulations of 60-80mm are likely, with as much as 100-120mm over high ground. Totals since Wednesday evening may exceed 150 mm in a few places. This is expected to lead to some surface water and river flooding across the area.There is also a wider yellow warning across the rest of eastern Scotland where rainfall accumulations of 30-60mm will be seen widely.The Met Office warns that with the ground already saturated from recent rain and and snow thaw, this may lead to some flooding in places.A strong south-easterly wind in north-east Scotland will also make it feel particularly unpleasant.Additional yellow warnings are in force on Thursday across south-east Wales, Somerset and Devon from 08:00 to 16:00 and Northern Ireland from 10:00 to 23:59.Persistent and heavy rain in these areas through the day falling on saturated ground could lead to some flooding and transport disruption.On Thursday morning there were nearly 160 flood warnings in force across England, Scotland and Wales.Weather warningsFlood warningsElsewhere, the weather remains generally cloudy and breezy, with rain and drizzle.On Friday, the UK will be impacted by Storm Ingrid, which was named by the Portuguese weather service due to the impacts expected there from strong winds and heavy rain.The centre of Ingrid will move close to the south-west of England and north-west France. Winds in the UK will strengthen on Friday, with gusts up to 65mph expected.While not as powerful or dangerous as the near 100mph winds experienced in south-west England during Storm Goretti, there could still be some impacts.It will likely stay windy through Saturday as the centre of Ingrid stalls to the south-west.The rest of the UK will avoid any impacts associated with Storm Ingrid, but the rain in eastern Scotland will continue, with some snow over higher ground.While Storm Ingrid will affect south-western parts of England, for the rest of the UK, we will start to see a brisk south-east to easterly wind.Drawing in colder air from north-east Europe, temperatures will start to drop over the weekend and next week with a cold snap.By Monday, temperatures will fall to 4 to 6C below the average for the end of January.The easterly wind will also likely bring occasional wintry showers, with snow for some parts of the UK.Where exactly, and how much snow, is not yet certain, but wintry hazards are likely.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Weather warnings issued for heavy rain and flooding risk in parts of the UK",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f831/live/e84a6ce0-f763-11f0-b840-39f43255a61a.jpg"
      ],
      "datePublished": "2026-01-22T07:56:25.000Z",
      "dateModified": "2026-01-22T07:56:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Government borrowing falls by more than a third in December",
    "url": "https://www.bbc.com/news/articles/clymd1pj887o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2031/live/52aca130-f768-11f0-af48-6d1cea94f702.jpg",
    "tag": "Trending",
    "date": "2026-01-22T08:14:08.000Z",
    "description": "7 minutes agoJemma CrewBusiness reporterUK government borrowing was significantly lower last month, due to an increase in tax income outweighing spend",
    "body": "7 minutes agoJemma CrewBusiness reporterUK government borrowing was significantly lower last month, due to an increase in tax income outweighing spending, official figures show.In December government borrowing - the difference between public spending and tax income - was £11.6bn, the Office for National Statistics (ONS) said.It is down £7.1bn - 38% - from the previous December, and lower than what many economists had predicted.Tom Davies, Deputy Director for the ONS public service division, said the fall was a result of \"receipts being up strongly on last year whereas spending is only modestly higher\".Despite the annual fall, the December 2025 figure was the tenth highest for the month since records began in 1993, without adjusting for inflation.And it remains higher than December 2023, when borrowing stood at £8.1bn.The figures show the government received £7.7bn more – an 8.9% rise - in taxes in December 2025 than it did in the same month in 2024.This comprised increases in income tax, corporation tax, VAT and National Insurance contributions (NIC), the ONS said – with changes to the rate of NIC paid by employers coming into effect in April last year.According to provisional estimates, borrowing over the financial year to December totalled £140.4bn, about £300m lower than the same period in 2024, the ONS said.The borrowing figure was estimated as 4.6% of GDP - 0.2 percentage points down from the same period last year. It was the third-highest level of borrowing over April-December on record, after those in 2020 and 2024. Chief Secretary to the Treasury, James Murray, said the government was \"stabilising the economy, reducing borrowing, rooting out waste in the public sector\".He said: \"Last year we doubled our headroom and we are forecast to cut borrowing more than any other G7 country with borrowing set to be the lowest this year since before the pandemic.\"Ruth Gregory, deputy chief UK economist at Capital Economics, said public finances were \"finally showing signs of improvement in recent months\".\"What's more, a further improvement in January is on the way. Those figures will probably show a bumper set of self-assessment tax and capital gains tax (CGT) receipts reflecting the freeze on income tax thresholds and a disposal of assets due to the speculation that Reeves would raise CGT.\"But she said the \"big picture is that the pace of deficit reduction remains very slow\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Government borrowing falls by more than a third in December",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2031/live/52aca130-f768-11f0-af48-6d1cea94f702.jpg"
      ],
      "datePublished": "2026-01-22T08:14:08.000Z",
      "dateModified": "2026-01-22T08:14:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I was a hostage negotiator for 10 years - this is what it taught me about parenting",
    "url": "https://www.bbc.com/news/articles/cx2yd455rd0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9ac8/live/0f5c9b50-f75a-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-22T00:43:18.000Z",
    "description": "8 hours agoAlex TaylorBBC NewsBBCNicky spent 10 years as a hostage negotiator for the Metropolitan PoliceBeing a parent and working as a hostage negot",
    "body": "8 hours agoAlex TaylorBBC NewsBBCNicky spent 10 years as a hostage negotiator for the Metropolitan PoliceBeing a parent and working as a hostage negotiator don't immediately appear to have a lot in common, but someone who has been both says tricks she learnt in her profession can help you at home.Nicky Perfect spent over 30 years as a Metropolitan Police officer, including 10 years as an international hostage and crisis negotiator, in the elite New Scotland Yard Hostage and Crisis Negotiation Unit.At times, she says, knowing what to do or say as a parent, can feel high-stakes - the difference between keeping the peace and a full-on meltdown or argument.Here are the three techniques from her high-pressure career which will help you stay calm and in control as a parent, she told the BBC's Parenting Download podcast, 1. Give them a 'no choice choice'Getty ImagesKids regularly push boundaries and often want to do the opposite of what you ask them.In situations like these rather than asserting your authority and using the \"because I said so\" phrase, try the \"no choice choice\", trick, says NIcky.This means reframing the situation by continuing to enforce one choice, but doing so in a manner that still gives your child a sense of control and influence. So, asking a child whether they want to put their coat on in the house or when they go outside, for example, can help them feel heard, respected and involved - all while leading to the same outcome.Another example could be giving a child that is refusing to eat vegetables the option between broccoli or sprouts.This may not work every time, but it can help limit immediate resistance.2. Wait 90 seconds before respondingGetty ImagesWhen dealing with sensitive topics, Nicky advises not responding for 90 seconds to  stop you responding emotionally.As an FBI agent once told her: \"your job in life is not to change people… you can't… the only thing you can choose is how to respond.\"It is important to remember this choice exists even when emotions threaten to overwhelm the logical side of our brain.\"The response might just be, 'do you know what? I'm being quite emotional now. I need to go away and think about this',\" says Nicky. \"Or it might be you just don't say anything, and you listen to what they've got to say.\"As a co-parent, she had to put this into practice herself when her stepdaughter admitted she wanted to spend Christmas Day with her dad and siblings after they moved further away.Internally, Nicky desperately wanted her to stay. But, she says, \"somewhere along the line you have to press the pause button... and say this is your Christmas. It's a day in my life. What do you want?\"Accepting this made it easier for her to decide how to spend the day herself - as well as plan a new way of celebrating together with her stepdaughter, either before or after.3. See their perspective Getty ImagesSeeing the world from the other person's point of view, be they big or small, is key, says Nicky.This way you can sell the benefits of your outcome to the other person, while also making them feel heard.\"It's called the 'power of' negotiation, because if you give people reasons why something should or shouldn't happen, they're more likely to accept it,\" says Nicky.\"It's about recognising it and being really honest with people. People are far more receptive to your honesty than you think they're going to be,\" she says.Take the common problem of tantrums over bedtime. Children can often struggle with the loss of autonomy that a sudden bedtime announcement brings.A solution, says Nicky, is to consider how the child feels in that moment, rather than view it as an adult.  If they're enjoying playing and then you suddenly say it's time to go to bed, this can feel abrupt and naturally upset them.Instead, her suggestion is to prepare the child as soon as they get home - weaving the night time routine naturally into the conversation and reinforcing it regularly throughout the evening. Something like \"we'll have dinner, then watch some TV and then it's bedtime\" acts as a good framework.The child then feels more involved and aware of what is coming, even if they don't necessarily like it - meaning hopefully fewer tantrums.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I was a hostage negotiator for 10 years - this is what it taught me about parenting",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9ac8/live/0f5c9b50-f75a-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-22T00:43:18.000Z",
      "dateModified": "2026-01-22T00:43:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bezos' Blue Origin announces satellite rival to Musk's Starlink",
    "url": "https://www.bbc.com/news/articles/cn0yydwe89jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/73aa/live/c94863d0-f734-11f0-ab85-cdd1a514d36d.jpg",
    "tag": "Trending",
    "date": "2026-01-22T03:15:27.000Z",
    "description": "Blue Origin, the rocket company owned by Amazon founder Jeff Bezos, says it will launch more than 5,400 satellites to create a new communications netw",
    "body": "Blue Origin, the rocket company owned by Amazon founder Jeff Bezos, says it will launch more than 5,400 satellites to create a new communications network.Named TeraWave, it will offer continuous internet access around the world, with the ability to move large amounts of data much more quickly than rival services.But even after launching thousands of satellites, Blue Origin would still have far fewer in orbit than Elon Musk's Starlink, which currently dominates the satellite internet market.Starlink - part of Musk's rocket firm SpaceX - also offers internet and phone services to individual customers, while Blue Origin says TeraWave will be focused on data centres, businesses and governments.Blue Origin said its network, at its fastest, would allow upload and download speeds of as much as 6 terabits per second, much faster than rival commercial satellite services currently offer.Another competitor to TeraWave is Amazon, the technology giant that made Bezos a multi-billionaire. He is still Amazon's executive chairman after stepping down in 2021 as its chief executive.Amazon's satellite venture is called Leo. While it currently has around 180 satellites in orbit, having launched dozens more just last week, it plans to have more than 3,000 in orbit.Like Starlink, Amazon is also more focused on the general public than businesses and governments, pitching Leo as a way to offer high-speed internet access globally. It has not said when all of the Leo satellites will be in orbit.Blue Origin said it will start launching its TeraWave satellites by the end of 2027.In November, the company successfully landed a rocket booster on a floating platform for the first time.Only SpaceX had previously accomplished this feat.In April, Blue Origin launched an 11-minute space flight with an all-female crew, including Bezos' now-wife Lauren Sánchez, singer Katie Perry and CBS presenter Gayle King.But some commentators said it was \"tone deaf\" for celebrities to be taking part in such a fleeting and expensive trip at a time of economic struggle.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bezos' Blue Origin announces satellite rival to Musk's Starlink",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/73aa/live/c94863d0-f734-11f0-ab85-cdd1a514d36d.jpg"
      ],
      "datePublished": "2026-01-22T03:15:27.000Z",
      "dateModified": "2026-01-22T03:15:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why Sydney is preserving thousands of flowers after deadly Bondi attack",
    "url": "https://www.bbc.com/news/articles/c70l9531pd1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/932c/live/f15adff0-f695-11f0-a096-99c1f7341c2b.jpg",
    "tag": "Trending",
    "date": "2026-01-21T19:54:14.000Z",
    "description": "12 hours agoKaty WatsonAustralia correspondentReutersA makeshift memorial was created after the 14 December attack at Bondi Beach From the outside, th",
    "body": "12 hours agoKaty WatsonAustralia correspondentReutersA makeshift memorial was created after the 14 December attack at Bondi Beach From the outside, the vacant shop on the corner of a busy avenue in central Sydney looks abandoned. Plastic sheeting is taped across all the windows and there's a large padlock hanging on the door handle.Step inside, though, and you're greeted by cuddly toys, candles, trinkets and messages of hope scribbled on large sheets.All of them come from a makeshift memorial that was created after the 14 December attack at Bondi Beach that killed 15 people.So when the Sydney Jewish Museum and the Australian Jewish Historical Society heard that the memorial would be removed by the local council, they sprang into action to ensure everything contained within it could live on.BBC/Katy WatsonA pair of shoes from Matilda Bee - the youngest victim of the attack - are among the items which will be used in a permanent memorialMany of the items now live in neat squares made out of masking tape on the shop floor. One says \"bees\" - within it are dozens of knitted and cuddly insects - a nod to 10-year-old Matilda Bee, the youngest victim of the attack. Another has a heap of deflated foil balloons – again, mostly bees. There's also a box of stones – Jewish mourners traditionally place a stone on a grave instead of flowers – as well as flags, books, Christmas decorations and even a Barbie cracker. Some families who were unable to go to any of the vigils in Bondi have also paid a visit to the spaces housing the tributes.\"It was too overwhelming to be in Bondi, but in this space it was very quiet. And I think to see everything laid out and the amount, they found it really moving and meaningful,\" said Shannon Biederman, the senior curator at the Sydney Jewish Museum.Families also came to the flower space and were given flower pressing to do, while artists and community members joined in too.For Shannon, memorialising the items is a deeply personal task.Her family were regular attendees of Chanukah by the Sea - the festival targeted by the alleged gunmen. They had bought tickets to go but at the last minute, they changed their mind.They also knew the family of Rabbi Eli Schlanger, one of the 15 victims.\"I do work in a Holocaust museum, so the murder of Jews isn't something that I'm not used to, and I've learned to compartmentalise,\" she says. \"But it's different because I'm used to working with history and this is now, and we are a museum of memory, but we're still very much live in [this].BBC/Katy WatsonShannon Biederman and her family were regular attendees of Chanukah by the SeaAustralian Prime Minister Anthony Albanese was among the first to lay a bouquet in front of the Bondi Pavilion the morning after the attack. Over the course of a week, the tributes spread like a wave across the forecourt.The massacre at Bondi was Australia's worst mass shooting in nearly three decades and left the country reeling. It also saw people pointing the blame at the government for letting something like this happen to a community that had been repeatedly warning authorities about a rise in antisemitism in recent years.But the conversation is now trying to focus on bringing people together - a sentiment the community wants to see continued in a permanent memorial to the dead.On Thursday, landmarks across the country will also be lit up and a minute's silence held in honour of the victims. Australians are also being asked to perform a mitzvah – an everyday act of kindness such as checking in on a neighbour or a donation - a Jewish tradition and a way to bring people together after last month's attack.How the memorial will live on is still unclear – several artists have come forward, keen to work with some of the material but a committee will make the final decisions.'I started with a lot of anger' And while the toys and trinkets were catalogued - there was the greater challenge of dealing with the  flowers that had been left behind. Volunteers helped to preserve the three tonnes of bouquets and wreaths that were loaded into black bags and taken to a separate warehouse in North Sydney.The process was confronting, says Nina Sanadze, a Jewish artist from Melbourne, whose idea it was to save all the flowers and oversaw the operation.\"When they brought them here, they looked like 100 bodies,\" Nina says. \"It was shocking again.\"Once at the warehouse, dozens of volunteers began the slow process of hanging them up on metal fences that had also been sourced in haste.They also had to wear masks to protect themselves from the large amount of pollen circulating. Instagram/@picciesforpotatoWorkers wrapping up floral tributes in massive black sheets of plasticShannon also feared that the sheer quantity of flowers and the gases they were emitting could create a compost fire, so volunteers had to monitor temperatures carefully and brought in fans.\"The smell and the moisture here in the warehouse was overwhelming,\" says Nina. \"It was like being inside a perfume shop.\"Meanwhile the flowers kept on coming.\"After the council made decision to clean up this big collection of flowers, people continued to bring them,\" explains Nina. \"We had volunteers to go at night and collect them otherwise they'd get thrown away.\"BBC/Katy WatsonCardboard boxes full of flower bouquets sit in the warehouse waiting to be sortedThe stalks have been saved for compost – which Nina says she's considering turned into some kind of furniture.Some of the rose buds had also started to rot, but she's dried them out and made a resin artwork scattered with the salvageable petals.\"There's a lot of decay and sadness as well as beauty,\" she says of her improvised creation. \"[It] takes it straight into the storytelling of what happened - it's not a thing of perfect beauty but it's a story, it's a heartbreak and love all together.\"Though a heavy task, for many of the volunteers, helping preserve the mountain of tributes left at the site is a form of therapy. And while the concept for the memorial is still germinating, Nina has already pinned down the title.\"Petal by Petal,\" she says confidently. It speaks to the way volunteers have had to methodically go about preserving the material, and symbolises her own slow processing of the attack.\"I started with a lot of anger coming here,\" Nina admits. \"I feel like I'm leaving in better spirits.\"She hopes the resulting artworks and memorials can help the community do the same.\"It can soften hearts, it can communicate,\" she says. \"And one of the things with flowers is not only they speak of the fragility of humans, but also they have no language, everybody understands flowers.\"BBC/Katy WatsonNina Sanadze and a team of volunteers are memorialising the flowers ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Sydney is preserving thousands of flowers after deadly Bondi attack",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/932c/live/f15adff0-f695-11f0-a096-99c1f7341c2b.jpg"
      ],
      "datePublished": "2026-01-21T19:54:14.000Z",
      "dateModified": "2026-01-21T19:54:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oldest cave painting could rewrite origins of human creativity",
    "url": "https://www.bbc.com/news/articles/czx1pnlzer5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c974/live/49574100-f635-11f0-b385-5f48925de19a.png",
    "tag": "Trending",
    "date": "2026-01-21T16:00:07.000Z",
    "description": "Oldest cave painting of red claw hand could rewrite human creativity timeline16 hours agoPallab GhoshScience CorrespondentA stencilled outline of a ha",
    "body": "Oldest cave painting of red claw hand could rewrite human creativity timeline16 hours agoPallab GhoshScience CorrespondentA stencilled outline of a hand found on the Indonesian island of Sulawesi is the world's oldest known cave painting, researchers say.It shows a red outline of a hand whose fingers were reworked, researchers say, to create a claw-like motif which indicates an early leap in symbolic imagination.The painting has been dated to at least 67,800 years ago – around 1,100 years before the previous record, a controversial hand stencil in Spain.The find also strengthens the argument that our species, Homo sapiens, had reached the wider Australia–New Guinea landmass, known as Sahul, by around 15,000 years earlier than some researchers argue.Over the past decade, a series of discoveries on Sulawesi has overturned the old idea that art and abstract thinking in our species burst suddenly into life in Ice Age Europe and spread from there.Cave art is seen as a key marker of when humans began to think in truly abstract, symbolic ways – the kind of imagination that underpins language, religion and science.Early paintings and engravings show people not just reacting to the world, but representing it, sharing stories and identities in a way no other species is known to have done.Professor Adam Brumm of Griffiths University in Australia, who co-led the project, told BBC News, that the latest discovery, published in the journal Nature, adds to the emerging view that there was no awakening for humanity in Europe. Instead, creativity was innate to our species, the evidence for which stretches back to Africa, where we evolved.\"When I went to university in the mid to late 90s, that's what we were taught – the creative explosion in humans occurred in a small part of Europe. But now we're seeing traits of modern human behaviour, including narrative art in Indonesia, which makes that Eurocentric argument very hard to sustain\".The oldest Spanish cave art is a red hand stencil in Maltravieso cave in Western Spain, dated to be at least 66,700 years old - though this is controversial and some experts don't think it to be that old. In 2014, hand stencils and animal figures dating back at least 40,000 years were found in Sulawesi, followed by a hunting scene that is at least 44,000 year old, and then a narrative pig and human painting dated to at least 51,200 years ago. Each step pushed sophisticated image making further back in time, according to Professor Maxime Aubert of Griffiths University.\"We started with minimum ages of at least 40,000 years, the same time as in Europe, but by getting closer to the pigment we've pushed the rock art in Sulawesi back by at least another 28,000 years\".The latest discovery is from a limestone cave called Liang Metanduno on Muna, a small island off south eastern Sulawesi. It has been spray-painted: an ancient graffiti artist pressed their hand flat against the cave wall, then blew or spat a mouthful of pigment around it so that, when they pulled the hand away, a negative outline was left behind on the rock.One fragmentary hand stencil there is overlain by thin mineral crusts that, when analysed, was found to have a minimum age of 67,800 years, making it the oldest reliably dated cave art anywhere in the world.Crucially, the artist did more than simply spray pigment around a hand pressed to the wall, the researchers say.Ahdi Agus OktavianaMore recent elongated hand stencils found elsewhere in Suluwesi shows how prevalent the red claw image was among these ancient artists.After the original stencil was made, the outlines of the fingers were carefully altered – narrowed and elongated to make it look more claw-like; a creative transformation that Brumm argues is \"a very us thing to do\".  He notes that there was no evidence of that experimentation in any of the art produced by our sister species, Neanderthals, in their cave paintings in Spain around 64,000 years ago. Even that is hotly contested because some researchers question the dating method.Until this latest discovery on Muna, all the paintings in Sulawesi had come from the Maros Pangkep karst in the island's south west. The fact that this much older stencil turns up on the opposite side of Sulawesi, on a separate satellite island, suggests that making images on cave walls was not a local experiment but deeply embedded in the cultures that spread across the region.Brumm says years of fieldwork by Indonesian colleagues have revealed \"hundreds of new rock art sites\" across remote areas, with some caves used repeatedly over tens of thousands of years. At Liang Metanduno, other, much younger paintings on the same panel – some produced as late as about 20,000 years ago – show that this single cave was a focus for artistic activity stretching over at least 35,000 years.Because Sulawesi lies on the northern sea route between mainland Asia and ancient Sahul, the dates have direct implications for assessing when the ancestors of Aboriginal Australians first arrived.For years, the mainstream view – based largely on DNA studies and most archaeological sites – was that Homo sapiens first reached the ancient Australia–New Guinea landmass, Sahul, about 50,000 years ago. But with firm evidence that Homo sapiens were settled on Sulawesi and making complex symbolic art at least 67,800 years ago, it makes it much more likely that controversial archaeological evidence for humans in northern Australia by about 65,000 years is correct, according to Adhi Agus Oktaviana, of the Indonesia's national research and innovation Agency (BRIN).\"It is very likely that the people who made these paintings in Sulawesi were part of the broader population that would later spread through the region and ultimately reach Australia.\"Many archaeologists once argued for a European \"big bang\" of the mind because cave paintings, carvings, ornaments and new stone tools all seem to appear together in France and Spain about 40,000 years ago, soon after Homo sapiens arrived there. Spectacular Ice Age cave art in places like Altamira and El Castillo encouraged the idea that symbolism and art switched on almost overnight in Ice Age Europe. Since then, engraved ochre, beads and abstract marks from South African sites such as Blombos Cave, some 70,000–100,000 years old, have shown that symbolic behaviour was already established in Africa long before.Along with very old figurative and narrative paintings from Sulawesi, a new consensus is being shaped; that there was a much deeper and more widespread story of creativity, Aubert told BBC News.\"What it suggests is that humans would have had that capacity for a very long time, at least when they left Africa – but probably before that\".Get our flagship newsletter with all the headlines you need to start the day. Sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oldest cave painting could rewrite origins of human creativity",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c974/live/49574100-f635-11f0-b385-5f48925de19a.png"
      ],
      "datePublished": "2026-01-21T16:00:07.000Z",
      "dateModified": "2026-01-21T16:00:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'Trump hails Greenland deal' and 'All I want is a piece of ice'",
    "url": "https://www.bbc.com/news/articles/cly99w1zx4lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3b14/live/5b8e2be0-f725-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-22T05:33:23.000Z",
    "description": "3 hours agoDonald Trump's announcement that he has reached an agreement with Nato allies on Greenland dominates Thursday's papers. The Times leads wit",
    "body": "3 hours agoDonald Trump's announcement that he has reached an agreement with Nato allies on Greenland dominates Thursday's papers. The Times leads with the US president announcing a \"framework deal\" has been reached after talks with Nato secretary-general Mark Rutte, saying it \"gives us everything we needed to get\".The Financial Times says the US president signalled there would be \"additional discussions\" on Greenland's role in the Golden Dome, a planned missile defence system to protect the US from all missile attacks.In light of the deal, the Guardian says Donald Trump is stepping back from his threat to impose tariffs on European allies who opposed his acquisition of Greenland.As a result of Donald Trump's climbdown from his tariff threat, markets in the US have rallied, with stocks surging back on Wednesday, reports the Daily Mail. Elsewhere, the paper continues to tease more details from the Beckham family row.\"It's a Don deal\" says the Daily Star, as it calls the Greenland saga \"manbaby mayhem\".Despite the easing of tensions, the i Paper quotes a senior Nato official warning that \"if we don't give Greenland to the US they will stop supporting Ukraine\".The Daily Telegraph fills its front page with a picture of a smiling Donald Trump in its coverage. Elsewhere, the paper highlights one of the US president's jibes at the audience during his speech at the World Economic Forum: \"You'd all be speaking German if it wasn't for us.\"The Independent follows with more details of the US president's speech in Davos, where he insisted the US must own Arctic territory in order for its national security. The paper sums up his remarks with the headline: \"All I want is a piece of ice.\" The Daily Mirror describes Donald Trump's Davos speech as a \"delusional rant\" during which he insisted that European leaders \"loved him\" before his Greenland ambitions. The paper also dubs him \"Daddy fool\", a play on the Boney M 1970s hit.Moving to news closer to home, the Daily Express reports that Chancellor Rachel Reeves has been criticised by the Tories for costing the UK jobs after it emerged that pubs will face \"years of huge tax rises\". The party is accusing Reeves of \"shutting up shop\" in the nation's High Streets after the Treasury said tax relief to help landlords cope with increases to business rates will \"slowly unwind\" over the next three years.The Metro carries a report from an ongoing court case in London where a jury heard that a friend of Donald Trump's son Barron said he saved her life during an attack. The paper says the US president's youngest son called police after seeing his friend being assaulted by her former boyfriend during a FaceTime call.Finally, in the wake of Prue Leith stepping down as judge of The Great British Bake Off, the Sun reports that Nigella Lawson is a \"choux-in\" for her replacement.The majority of the front pages focus on Donald Trump's announcement of a framework deal for Greenland, including the Guardian which says the US president \"abruptly stepped back\" from threats to impose tariffs on European allies as leverage \"after weeks of rhetoric that risked the deepest rupture in transatlantic relations in decades\". The Times reports a sense of \"palpable relief\" in European capitals at the development, while the Daily Express suggests it proves Western nations \"should not panic\" every time Mr Trump \"tries a new gambit\".The lack of details about the framework deal prompts several papers to speculate what could be involved. Sources have told the Daily Telegraph it stops short of the sale of Greenland, but would instead allow the US to have sovereign control of its military bases on the island. According to the Daily Mail, Trump is mulling making the 57,000 residents of the territory an offer of $1m each if they vote to join the US. Nato officials have told the i Paper they fear the President could \"demand Greenland as the price of support for Ukraine\".The Daily Mirror is highly critical of Trump's appearance at the World Economic Forum in Davos, saying he delivered an \"unhinged and rambling\" speech to an audience of \"aghast\" world leaders. The Daily Star notes the president repeatedly confused Greenland with Iceland, while the Daily Telegraph argues it was \"not so much a speech as a comedy special, with bitchy anecdotes and savage impersonations\". The paper describes Trump's parody of his French counterpart as involving an accent \"that many European states would prosecute as a hate crime\".The main news for the Sun is the decision by Dame Prue Leith to leave the Great British Bake Off after almost a decade as a judge on the show.  It claims she will be replaced by Nigella Lawson, with the telly cook said to be \"ready to sign on the dotted line\" ahead of the start of filming for the new series in April. The paper's headline plays on a well-known type of pastry, saying \"Nigella's a choux-in\".Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'Trump hails Greenland deal' and 'All I want is a piece of ice'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3b14/live/5b8e2be0-f725-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-22T05:33:23.000Z",
      "dateModified": "2026-01-22T05:33:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Austria's biggest spy trial for decades puts ex-intelligence officer in the dock",
    "url": "https://www.bbc.com/news/articles/cz0pnjv1zy5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a193/live/5ac52770-f6e1-11f0-a4dd-a5af35a571cb.jpg",
    "tag": "Trending",
    "date": "2026-01-22T01:00:06.000Z",
    "description": "7 hours agoBethany BellVienna correspondentReutersEgisto Ott is accused of collecting large amounts of data and handing information to Russian intelli",
    "body": "7 hours agoBethany BellVienna correspondentReutersEgisto Ott is accused of collecting large amounts of data and handing information to Russian intelligenceFormer intelligence official Egisto Ott goes on trial in Vienna on Thursday, accused of spying for Russia in what is being dubbed Austria's biggest spy trial in years.Egisto Ott, 63, is charged with having handed over information to Russian intelligence officers and to Jan Marsalek, the fugitive executive of collapsed German payments firm Wirecard.Ott denies the charges.Jan Marsalek, who is also an Austrian citizen, is wanted by German police for alleged fraud and is currently believed to be in Moscow, having fled via Austria in 2020.The subject of an Interpol Red Notice, he is alleged to be an intelligence asset for the FSB, Russia's secretive security service.The spy scandal has revived fears that Austria remains a hotbed of Russian espionage activity and observers will also be watching closely for details that could emerge about Marsalek.Prosecutors in Vienna say Egisto Ott \"abused his authority\" as an Austrian intelligence official by collecting large amounts of personal data, such as locations, vehicle registration numbers, or travel movements.They say he did this between 2015 and 2020 without authorisation, often using national and international police databases.Prosecutors also charge him with supporting \"a secret intelligence service of the Russian Federation to the detriment of the Republic of Austria\" by collecting secret facts and a large amount of personal data from police databases between 2017 and 2021.They say Egisto Ott gave this information to Jan Marsalek and unknown representatives of the Russian intelligence service, and received payment in return.In 2022, prosecutors say, Jan Marsalek commissioned him to obtain a laptop containing secret electronic security hardware used by EU states for secure electronic communication. The laptop, they say, was handed over to the Russian intelligence service.He is also suspected, reports say, of having passed phone data from senior Austrian interior ministry officials to Russia.Austria's Standard newspaper says Egisto Ott apparently obtained the work phones after they accidentally fell into the River Danube on an interior ministry boating trip. He is alleged to have copied their contents and passed them on to Jan Marsalek, and Moscow.Egisto Ott is charged with abuse of authority and corruption and espionage against Austria and faces up to five years in prison, if he is found guilty.When he was arrested in 2024, Austria's then Chancellor, Karl Nehammer, described the case as \"a threat to democracy and our country's national security\".Munich PoliceJan Marsalek, former executive at Wirecard, is believed to have escaped to MoscowIn a separate development, prosecutors in the Austrian town of Wiener Neustadt have told the BBC that a former MP, Thomas Schellenbacher, has been charged with helping Marsalek to escape following the collapse of the Wirecard company in 2020, when it emerged that €1.9bn was missing from its accounts.Schellenbacher is alleged to have helped Jan Marsalek fly to Belarus, from Bad Vöslau in Austria, in June 2020.Schellenbacher was an MP for the far-right Freedom Party (FPÖ), which has been accused by Austria's Green Party, now in opposition, of enabling Russian espionage, of acting as \"an extension of Russia's arm\" in Austria.The FPÖ and its leader Herbert Kickl have denied the allegations - and have not faced any legal action in connection with any of them.Marsalek, who was the Wirecard's Chief Operating Officer, has since been charged with fraud and embezzlement, suspected of having inflated company's balance sheet total and sales volume.He is also believed to have been the controller of a group of Bulgarians who were convicted in London in 2025, of spying for Russia.Messages from that trial reveal Marsalek has had plastic surgery to alter his appearance as well as details of his life as a fugitive.\"I'm off to bed. Had another cosmetic surgery, trying to look differently, and I am dead tired and my head hurts,\" he wrote to one of the Bulgarians, Roussev, on Telegram in February 2022.In another, dated 11 May 2021, Roussev congratulated Marsalek for learning Russian.\"Well I am trying to improve my skills on a few fronts. Languages is one of them,\" the Austrian responded.\"In my new role as an international fugitive I must outperform James Bond.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Austria's biggest spy trial for decades puts ex-intelligence officer in the dock",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a193/live/5ac52770-f6e1-11f0-a4dd-a5af35a571cb.jpg"
      ],
      "datePublished": "2026-01-22T01:00:06.000Z",
      "dateModified": "2026-01-22T01:00:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ghislaine Maxwell to testify before Congress in Epstein probe",
    "url": "https://www.bbc.com/news/articles/cr7jlylp5keo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7fac/live/8ac48f00-f705-11f0-a665-fb6bca5a5e3d.jpg",
    "tag": "Trending",
    "date": "2026-01-22T05:14:56.000Z",
    "description": "Ghislaine Maxwell, the jailed associate of convicted sex offender Jeffrey Epstein, has agreed to testify under oath before the congressional committee",
    "body": "Ghislaine Maxwell, the jailed associate of convicted sex offender Jeffrey Epstein, has agreed to testify under oath before the congressional committee investigating the federal government's handling of the Epstein files.Committee chairman James Comer, who is leading the investigation, says Maxwell will depose virtually on 9 February. Maxwell's legal team has previously said she would decline to answer questions under her constitutional right to remain silent unless she is granted legal immunity. Comer, previewing the deposition, said, \"her lawyers have been saying she is going to plead the Fifth,\" referring to the US Fifth Amendment right to decline to speak to authorities.The announcement from the House Oversight and Government Reform Committee comes as the Trump administration continues to face fierce scrutiny for its handling of the Epstein case.Maxwell is currently serving a 20-year prison sentence for recruiting and trafficking  teenage girls for sexual abuse by Epstein.  In July, the committee declined to offer Maxwell legal immunity in exchange for her testimony.In August, the committee issued legal summons to Maxwell, requiring her to submit evidence under oath. Maxwell's legal team said that requiring her to both testify from jail, and without any legal immunity, were \"non-starters\".The lawyers said she \"cannot risk further criminal exposure in a politically charged environment without formal immunity\" as speaking from prison \"creates real security risks and undermines the integrity of the process\".House lawmakers cannot force Maxwell to waive her Fifth Amendment protections.On Tuesday, Maxwell's legal team said in a letter to the committee that she would continue to refuse to testify.\"Put plainly, proceeding under these circumstances would serve no other purpose than pure political theater and a complete waste of taxpayer monies,\" the attorneys wrote. \"The Committee would obtain no testimony, no answers, and no new facts.\"Maxwell, who was convicted in 2021, had appealed against the conviction to the  Supreme Court last October but the top court declined to hear the former British socialite's appeal.Her only route to leave prison early would be a presidential pardon, unless she is able to persuade a federal judge in New York to vacate or amend her sentence. The White House has denied that Trump is considering granting her clemency, however, Trump has also said he has not ruled it out.Separately, the Department of Justice faced a deadline of 19 December last year to release all remaining Epstein files in its possession. So far only a fraction of them have been made public.The department has faced criticism from lawmakers on both sides of the aisle over the number of redactions in the files, which the law permits only to protect victims' identities and active criminal investigations.Meanwhile, the Republican-led House Oversight Committee voted to hold former President Bill Clinton and his wife, former Secretary of State Hillary Clinton, in contempt of Congress over their refusal to comply with subpoenas in its Epstein investigation.The committee had summoned both Clintons to testify about Epstein, with whom Bill Clinton has appeared in photographs in the 1990s and early 2000s.Bill Clinton has never been accused of wrongdoing by survivors of Epstein's abuse, and has denied knowledge of his sex offending.Lawyers for the Clintons had called the Oversight Committee subpoenas \"unenforceable\", and said they had already provided the \"limited information\" they had about Epstein.The committee approved the measure with the support of several Democrats. If it passes the full House of Representatives, the matter will be referred to the justice department.Get our flagship newsletter with all the headlines you need to start the day. Sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ghislaine Maxwell to testify before Congress in Epstein probe",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7fac/live/8ac48f00-f705-11f0-a665-fb6bca5a5e3d.jpg"
      ],
      "datePublished": "2026-01-22T05:14:56.000Z",
      "dateModified": "2026-01-22T05:14:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Greenland: US allies won't forget Trump Greenland crisis",
    "url": "https://www.bbc.com/news/articles/cj3vv1kv1rdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b934/live/f4b1acd0-f729-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-22T01:52:28.000Z",
    "description": "6 hours agoPaul AdamsDiplomatic correspondentGetty ImagesWhat on earth has the last fortnight been all about?In the wake of a successful military oper",
    "body": "6 hours agoPaul AdamsDiplomatic correspondentGetty ImagesWhat on earth has the last fortnight been all about?In the wake of a successful military operation in Venezuela earlier this month, a buoyed-up Donald Trump started to ratchet up the rhetoric on Greenland.Day after day, the world was treated to claims of ownership, threats of military action and tariffs against traditional allies in Europe.Now, in an apparent puff of smoke, it may all have gone.Nato Secretary General Mark Rutte, arguably the Trump whisperer-in-chief, seems to have talked the president down from his dangerously high hobby horse.Watch: Trump takes aim at world leaders in Davos speechThe ground may have been laid last week during a visit to Washington by the foreign ministers of Denmark and Greenland. The visit concluded with agreement on a \"working group\" to discuss Greenland's future.But Rutte appears to have finessed an issue that had threatened to shatter the north Atlantic alliance.We don't yet know the details of the deal, but many will wonder why it needed a frenetic two-week crisis to get here.Denmark had long said that it was only too happy to see an increased American military presence on Greenland.If Nato has now pledged to up its presence on and around the island, then that will go some way towards reassuring Donald Trump that the alliance is finally paying proper attention to Greenland.The New York Times quotes anonymous officials as saying one idea under discussion is for Denmark to cede sovereignty over small areas of Greenland where the US would build military bases - similar to the arrangement by which the UK maintains sovereign bases on Cyprus.Watch: How was Trump's Davos speech received?Trump said the deal would involve access to Greenland's mineral resources.Neither Denmark nor Nato has confirmed these or any other reports.Nato said discussions would \"focus on ensuring Arctic security through the collective efforts, especially the seven Arctic Allies\" (the US, Canada, Denmark, Norway, Sweden, Finland and Iceland) and aimed to prevent Russia and China from gaining a foothold, economic or military, in Greenland.It won't be long before details of the deal emerge. But the fact that Donald Trump triggered a fortnight of high drama and a sense of existential crisis within Nato to get here will not easily be forgotten.Canada's Prime Minister Mark Carney called it a \"rupture\", saying the old order was \"not coming back.\"EU Commission President Ursula von der Leyen spoke of \"seismic change\" and urged greater European independence.It's hard to see a quick return to business as usual.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Greenland: US allies won't forget Trump Greenland crisis",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b934/live/f4b1acd0-f729-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-22T01:52:28.000Z",
      "dateModified": "2026-01-22T01:52:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Prince Harry: Emotional exchanges as duke gives evidence",
    "url": "https://www.bbc.com/news/articles/c07x53vjegvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cfd2/live/8a447670-f6ed-11f0-9c4a-e59460e06bbd.jpg",
    "tag": "Trending",
    "date": "2026-01-21T17:59:51.000Z",
    "description": "14 hours agoSean CoughlanRoyal correspondent, High CourtThis was quite possibly the last time we'll ever see Prince Harry entering the witness box, af",
    "body": "14 hours agoSean CoughlanRoyal correspondent, High CourtThis was quite possibly the last time we'll ever see Prince Harry entering the witness box, after many years of his high-profile court battles with the press.And after the tetchy, scratchy, emotional exchanges in the High Court, it's not something that you think he'll miss.It's been a \"horrible experience\", he said about this latest court case, now up against Associated Newspapers in his third set-piece legal dispute with a newspaper group.Towards the end of two hours of questions, he railed against the \"disgusting\" sense that he wasn't entitled to a private life, and talked of the emotional toll of alleged press intrusion on him and his family.\"They've made my wife's life an absolute misery,\" he said, voice cracking, in what could be his last ever words in a UK courtroom.A tall, lean figure, in a dark suit and tie, Prince Harry gave his evidence about what he sees as a lifetime of hounding by the media, which he claimed used unlawful means of gathering information.His manner showed how personal this was to him, delivering terse and sometimes tense answers, about a series of stories that he said had \"commercialised\" his private life and those close to him.It was something that he wanted the court to understand, that he'd been driven to \"paranoia\" by the constant attention surrounding him and his relationships.At one point, the judge Mr Justice Nicklin intervened to tell Prince Harry that he needed to just answer the questions and not argue back.Harry was painstakingly polite, but in the way people are when they're actively trying not to shout back.It is not clear whether his witness box had the same plastic signs that were on other desks with the reminder: \"Please address the judge as my lord/my lady.\"Prince Harry painted a picture of a private life being surrounded by anxieties about leaks and intrusions, creating distrust and suspicion about those around him.He batted away suggestions that some of the journalists who had written these stories were part of his friendship circle. When it was suggested one went to the same night clubs as him, he snapped back: \"Good for her.\"Harry presented the court with the big picture view of the distress caused by being hunted down by the press, with accusations that it was a pursuit that had relied on illegal methods.Opposing him was the patient, emotionless approach of Associated Newspapers' barrister, Antony White, who offered an alternative explanation for the source of stories, making the case for how they were legitimately obtained.While Prince Harry gave the emotion, the opposing barrister seemed to want to focus on the forensic detail. It was the broadsword versus the laser. Harry at times sounded more defensive than the defence.As a spectacle, it wasn't how a courtroom drama might be expected to appear.Although Prince Harry was in the \"witness box\", it really meant he was sitting in a kind of raised wooden area, behind a computer screen and an array of microphones.The court wasn't one of those historic rooms with lots of mahogany and Victorian furnishings. It was more like a university lecture room kitted out by Ikea, with rows of lawyers surrounded by boxes of folders and papers.In fact the style of the courtroom seemed more modern than many of the newspaper stories being discussed. Because so much of this case seemed to revolve around stories written many years ago, in an entirely different era for the tabloid press.In the public imagination, Harry is perhaps thought of as being forever young, the younger brother and son. But here he was in court, now in his forties, going over stories from all those years ago.This case has many more weeks to run, and both sides will keep arguing their corner.But from Harry's perspective, he will have survived this moment in court, getting across his sense of moral outrage, while having avoided saying anything that will set new stories running about his family.After his appearance, Prince Harry said: \"Today we reminded the Mail group who is on trial and why.\"Both sides will claim to be ahead on points - but so far neither side has really delivered a knock-out blow.It was once bombshell news that a royal was considering facing questions in court, it was something that hadn't happened in modern times.For Harry, after so many years of legal action and the visible stress of such court appearances, this might finally be a chapter closing.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Prince Harry: Emotional exchanges as duke gives evidence",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cfd2/live/8a447670-f6ed-11f0-9c4a-e59460e06bbd.jpg"
      ],
      "datePublished": "2026-01-21T17:59:51.000Z",
      "dateModified": "2026-01-21T17:59:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What it was like inside the room with Donald Trump at Davos",
    "url": "https://www.bbc.com/news/articles/cm24vjvy3n1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/00f4/live/db51d8c0-f6f5-11f0-bb31-83eb955a217a.jpg",
    "tag": "Trending",
    "date": "2026-01-21T19:22:59.000Z",
    "description": "13 hours agoFaisal IslamEconomics editorGetty ImagesI was in the room when President Donald Trump entered and it's fair to say he got a good welcome f",
    "body": "13 hours agoFaisal IslamEconomics editorGetty ImagesI was in the room when President Donald Trump entered and it's fair to say he got a good welcome from the crowd, certainly at the beginning. A standing ovation.On top of that, there was an astonishing scrum to try to get in, with many turned away - even heads of state.The security was unbelievable, not letting even some of the most famous attendees in or out of the hall.Minutes into the speech, Trump was keeping his cool - even dropping in phrases about wanting the UK \"to do great\".What some thought would be the day on which the US president laid down the laws of his new global economy was filled more with grandfatherly advice.It was far from the mildly menacing tone of his social media posts claiming that Greenland will be America's.But which one is the real Donald Trump? Has he heard how badly some of his rhetoric has gone down?As I entered, I was told of an astonishing event last night where Trump's Commerce Secretary Howard Lutnick told the audience that, in terms of Europe's economy, \"you're dead\".There was a walkout. Might there have been one today? He seemed to be trying to avoid that.Live coverageRos Atkins on... Trump's Davos speech claimsThe Speech goes rather darkAt first, I thought Trump was trying on a diplomatic front, perhaps having heard some of the significant criticism levelled against him and trying to sound mellow.He talked in friendly terms about the western allies that had been most perturbed by his social media posts.He even acknowledged that he probably shouldn't speak about the controversial issue of Greenland - which he has repeatedly vowed to take over.But, almost as though he could not help it, the speech seemed to take a dark turn.First he described America's role helping Greenland in the past, including being friendly to Denmark.But he then insulted Europe's biggest economy, saying everyone in the hall \"would be speaking German\" if it wasn't for the US. And then it came. He announced he was seeking immediate negotiations for the USA to acquire Greenland.A negotiated settlement, he said. No force required. But the US needed \"full title\".\"We want this land\" to build the \"greatest Golden Dome ever built\", he said.And he warned Canadian Prime Minister Mark Carney about his words a day earlier, though stressing that he would also use Greenland to defend Canada.\"I'm asking for a piece of ice... it's a very small ask.\"It was incredible to see this said out loud.Mixed reactions in the roomThere was high security, high stakes and high tension in the Alps for the arrival of the would-be sheriff of the world, brandishing his new rules.The reaction in the room ranged.The president's attempts at charm seemed to win him polite applause. But as he went from rigged elections to his annoyance at other leaders' Davos speeches, some sat in disbelief.Even though he promised not to invade Greenland, many were stunned by his attempts to persuade Europe to hand over the territory.Gavin Newsom, the Democratic governor of California said the speech was \"TACO\" Tuesday, a reference to the \"Trump always chickens out\" catchphrase used to mock the president.He argued Trump had backed down after robust pushback from leaders Emmanuel Macron and Mark Carney.A key Republican senator, Thomas Tillis, said the president's pursuit of Greenland, even a negotiated annexation, would not have the backing of Congress.So while Trump attempted to dial down tensions, he still criticised allies - including personal attacks on leaders.And while he promised not to invade Greenland, he still said it will be part of the new America - and that the world should thank him for it.The speech may have eventually come to an end, but we will be talking about it for a long time to come.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What it was like inside the room with Donald Trump at Davos",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/00f4/live/db51d8c0-f6f5-11f0-bb31-83eb955a217a.jpg"
      ],
      "datePublished": "2026-01-21T19:22:59.000Z",
      "dateModified": "2026-01-21T19:22:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "We were lied to and smeared, say hospital inquiry families",
    "url": "https://www.bbc.com/news/articles/c4g4e17g7yyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/531e/live/38512880-f496-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-22T06:52:39.000Z",
    "description": "1 hour agoKaty ScottBBC ScotlandBBCThe Queen Elizabeth University Hospital replaced three older hospitals when it opened in 2015Families of patients w",
    "body": "1 hour agoKaty ScottBBC ScotlandBBCThe Queen Elizabeth University Hospital replaced three older hospitals when it opened in 2015Families of patients who suffered or died after they caught infections in Scotland's largest hospital say they were \"lied to\", \"demeaned\" and \"smeared\".The Queen Elizabeth University Hospital (QEUH) complex opened in Glasgow in 2015, but NHS Greater Glasgow and Clyde (NHSGGC) has since said that it opened too early and faced design flaws.It admitted infections of some cancer patients were probably linked to issues with the hospital water system.NHSGGC offered a \"sincere and unreserved\" apology to the patients and families affected, and said the hospital was now safe.In closing submissions to the Scottish Hospitals Inquiry, NHSGGC said it was likely there was a \"causal connection\" between infections suffered by patients and \"the hospital environment, in particular the water system\".But it stressed that there was no definite link between the hospital environment and specific individual cases of infection.Maureen Dynes’ husband Tony contracted two infections during his cancer treatment at the QEUH and died in 2021Thompsons Solicitors represents the majority of the affected families and issued a statement from them.They said that major flaws in the water and ventilation system at the hospital \"killed and poisoned our loved ones\".The statement goes on: \"We were all lied to by GGCH [Greater Glasgow and Clyde Health Board]. We were all disbelieved by GGCH. \"We were all demeaned and smeared by GGCH. We have all had our families devastated and our lives traumatised by GGCH.\"It adds: \"We cannot overstate the level of deceit and conniving cowardice displayed by GGCH during the whole unfolding of this awful scandal.\"As men, women and children fell ill and died, we were all told there is nothing to see here.\"Kimberly DarrochMilly Main died after contracting an infection at the Royal Hospital for Children, which is part of the QEUH campusThe families called for \"those past and present who have presided over this despicable incompetence\" to be held to account and stripped of their pensions accrued during their time at the hospital.They have also urged political leaders to act.\"The QEUH is not a safe hospital,\" they said. \"The current leadership of GGCH cannot be trusted to make it safe.\"The families thanked the \"many brave and decent clinicians and staff\" who tried to speak out but were \"silenced\" by the health board. \"We will never forget that they stood with us,\" they added.In response, the health board said: \"Comprehensive steps have been taken to address past physical defects in the building and a significant programme of maintenance and monitoring is in place. \"Our staff are committed to providing safe, high-quality care.\"The Scottish Hospitals Inquiry, which has been looking at the planning, design, construction and maintenance of hospitals, is hearing final submissions before publishing a report later this year.It was prompted by concern about patient safety following a series of infections and several deaths, including that of 10-year-old Milly Main.The inquiry will hear closing statements from the families later on Thursday.On Wednesday, the chair of the inquiry, Lord Brodie, asked why the health board had changed its position after alleging unprofessionalism and malevolence on the part of the medics who raised concerns.The health board's lawyer, Peter Gray, acknowledged that several criticisms made about the whistleblowers were neither helpful nor fair. He said the people running the hospital should not be criticised as the failure to listen to the whistleblowers was an organisational failure, adding that changes have since been made.Earlier this week, Scottish Labour leader Anas Sarwar called for First Minister John Swinney and former First Minister Nicola Sturgeon to be investigated over failures at the hospital.  NHSGGC has already been named by prosecutors in a corporate homicide probe which is looking into the deaths of Milly Main, two other children and a 73-year-old woman at the hospital campus.The death of Molly Cuddihy last year is also being investigated by the Crown Office.The Glasgow hospital campus, which includes the QEUH and the Royal Hospital for Children, opened to patients in 2015.It had been built at a cost of £840m and replaced three older hospitals in the city.But within a few years, a number of patient deaths and infections led to concerns about the water and ventilation systems.Former Health Secretary Jeane Freeman ordered a public inquiry in 2019, with its remit also including problems at Edinburgh's Royal Hospital for Children and Young People (RHCYP).The opening of the Edinburgh site had been delayed at the last minute over safety concerns about its ventilation system.The public inquiry's interim report on the RHCYP has already been issued, saying a spreadsheet error by the health board led to the system being wrongly specified.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "We were lied to and smeared, say hospital inquiry families",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/531e/live/38512880-f496-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-22T06:52:39.000Z",
      "dateModified": "2026-01-22T06:52:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Seven more countries agree to join Trump's Board of Peace",
    "url": "https://www.bbc.com/news/articles/cn8jek4vv8ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7ddd/live/45bde730-f6f1-11f0-9c4a-e59460e06bbd.jpg",
    "tag": "Trending",
    "date": "2026-01-21T20:55:33.000Z",
    "description": "11 hours agoDavid GrittenandRachel HaganEPASaudi Crown Prince Mohammed bin Salman visited the White House in NovemberSeven countries including Saudi A",
    "body": "11 hours agoDavid GrittenandRachel HaganEPASaudi Crown Prince Mohammed bin Salman visited the White House in NovemberSeven countries including Saudi Arabia, Turkey and Egypt say they will join US president Donald Trump's Board of Peace, according to a joint statement.They will join Israel, which also publicly confirmed its participation earlier.On Wednesday evening Trump said Vladimir Putin had also agreed to join - but the Russian president said his country was still studying the invitation. The board was originally thought to be aimed at helping end the two-year war between Israel and Hamas in Gaza and oversee reconstruction. But its proposed charter does not mention the Palestinian territory and appears to be designed to supplant functions of the UN.However Saudi Arabia said that the group of Muslim-majority countries - Saudi Arabia, Turkey, Egypt, Jordan, Indonesia, Pakistan and Qatar - endorsed the aim of consolidating a permanent ceasefire in Gaza, supporting reconstruction and advancing what they described as a \"just and lasting peace\".At the World Economic Forum in Switzerland, Trump told reporters that Putin had accepted his invitation to join. \"He was invited, he's accepted. Many people have accepted,\" Trump said.Putin responded quickly, saying the invitation was under consideration, Reuters reported. He said Russia was prepared to provide $1bn from frozen Russian assets and that he viewed the board as primarily relevant to the Middle East.It is not clear how many countries have been invited to join Trump's new body - Canada and the UK are among them, but have not yet publicly responded. The UAE, Bahrain, Albania, Armenia, Azerbaijan, Belarus, Hungary, Kazakhstan, Morocco and Vietnam have already signed up.On Wednesday the Vatican also confirmed Pope Leo has received an invitation. Speaking to reporters on Wednesday, the Vatican's Secretary of State, Cardinal Pietro Parolin, said the Pope would need time to consider whether to take part.However Slovenia's Prime Minister Robert Golob said he had declined the invitation because the body \"dangerously interferes with the broader international order\".A leaked document says the Board of Peace's charter will enter into force once three states formally agree to be bound by it, with member states given renewable three-year terms and permanent seats available to those contributing $1bn (£740m), it said. The charter declared the body as an international organisation mandated to carry out peace-building functions under international law, with Trump serving as chairman - and separately as the US representative - and holding authority to appoint executive board members and create or dissolve subsidiary bodies.Last Friday, the White House named seven members of the founding Executive Board, including US Secretary of State Marco Rubio, Middle East envoy Steve Witkoff, Trump's son-in-law Jared Kushner and former UK prime minister Tony Blair. Former UN Middle East envoy Nickolay Mladenov was appointed as the board's representative in Gaza during a second phase of the plan, which includes reconstruction and demilitarisation, with the board authorised by a UN Security Council resolution running until the end of 2027.On Saturday, Netanyahu's office said the Gaza Executive Board's composition \"was not coordinated with Israel and runs contrary to its policy\".Israeli media said the decision to include representatives of Turkey and Qatar - which both helped broker the ceasefire that took effect in October, along with Egypt and the US - had happened \"over Israel's head\".Under phase one of the peace plan, Hamas and Israel agreed to the ceasefire, an exchange of living and dead Israeli hostages in Gaza for Palestinian prisoners in Israeli jails, a partial Israeli withdrawal, and a surge in deliveries of humanitarian aid.Israel has said it can only move into the second phase after Hamas hands over the body of the last dead hostage.Phase two faces major challenges, with Hamas having previously refused to give up its weapons without the creation of an independent Palestinian state, and Israel having not committed to fully withdrawing from Gaza.ReutersHumanitarian conditions for Palestinians in Gaza remain dire despite the ceasefire and aid surgeThe ceasefire is also fragile. More than 460 Palestinians killed in Israeli strikes since it came into force, according to Gaza's Hamas-run health ministry, while the Israeli military says three of its soldiers have been killed in Palestinian attacks during the same period.The war was triggered by the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.Israel responded to the attack by launching a military campaign in Gaza, during which more than 71,550 people have been killed, according to the territory's health ministry.Get our flagship newsletter with all the headlines you need to start the day. Sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Seven more countries agree to join Trump's Board of Peace",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7ddd/live/45bde730-f6f1-11f0-9c4a-e59460e06bbd.jpg"
      ],
      "datePublished": "2026-01-21T20:55:33.000Z",
      "dateModified": "2026-01-21T20:55:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]