[
  {
    "title": "Banned in the 80s: Moments That Shook Music",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002k85n?at_mid=XZLfF6kcDM&at_campaign=Banned_in_the_80s_Moments_That_Shook_Music&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002k85n&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Banned_in_the_80s_Moments_That_Shook_Music&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0m3w047.jpg",
    "tag": "Trending",
    "date": "2025-09-27T21:22:31.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistBanned in the 80s: Moments That Shook MusicContains very strong language.Contains discriminatory languageDocumentary revealing the untold stories behind the most controversial music of the 1980s, featuring Frankie Goes to Hollywood, Queen, George Michael, N.W.A, Madonna and others. Duration55 minsFirst shown27 Sep 2025Available for 11 monthsWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesWhen Bruce Springsteen Came to BritainBorn in the USA, made in the UK. The Boss explains why Britain is so special to him59 minsSimple Minds: Everything Is PossibleDaring to dream. The inspirational story of Scotland's biggest band1h 27mSimon & Garfunkel: The Harmony GameInspiration – and separation. The stormy relationship that created beautiful music1h 11mWham!: Last Christmas Unwrapped40 years a festive favourite. Andrew, Pepsi and Shirlie revisit Wham!’s winter wonderland59 minsWhen Tina Turner Came to BritainLet’s stay together. From 60s starlet to 80s comeback queen, a career built in Britain59 minsDionne Warwick: Don't Make Me OverWhat the world needs now... How a sublime voice found a second life as a call for change1h 32mBryan Ferry and Roxy Music: A Musical HistoryDocumentary exploring the music of rock band Roxy Music and its frontman Bryan Ferry.58 minsCarole King and James Taylor: Just Call Out My NameLong ago and far away. Two sensational solo artists created the perfect partnership1h 33mLive Aid at 40: When Rock ’n’ Roll Took on the WorldNot just for one day. The creation and legacy of a concert that changed everythingSharon & Ozzy Osbourne: Coming HomeRock legend Ozzy's final chapter as Birmingham’s favourite son - and family - return home59 minsMr Blue Sky: The Story of Jeff Lynne and ELOThe pioneer of progressive pop – from the Brum beat scene to huge hits all over the world57 minsSince Yesterday: The Untold Story of Scotland's Girl BandsPopstars, punks and pioneers. Defiant trailblazers who rocked a mostly male music world1h 30m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Banned in the 80s: Moments That Shook Music",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0m3w047.jpg"
      ],
      "datePublished": "2025-09-27T21:22:31.000Z",
      "dateModified": "2025-09-27T21:22:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Carrie",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002jwvv/carrie?at_mid=zdATYedJiY&at_campaign=Carrie&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002jwvv&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Carrie&at_bbc_team=BBC&at_creation=film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0m2h3nr.jpg",
    "tag": "Trending",
    "date": "2025-09-21T22:38:19.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistCarrieContains some strong language, some violence and some upsetting scenes.Sensitive teen Carrie is repressed by her mother and bullied by her classmates. But unbeknown to them, Carrie has special powers. Horror based on Stephen King's novel. Duration1h 34mFirst shown1976Available for 1 monthWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesGhost StoriesBe careful what you believe in. A supernatural skeptic faces a trio of terrifying tales1h 31mHalloweenThe trick is to stay alive. Jamie Lee Curtis stars in John Carpenter's iconic horror1h 26mMiseryShe's his number-one fan. Adaptation of Stephen King's terrifying tale, stars Kathy Bates1h 42mLet It SnowThey were warned. A thrill-seeking couple fight for survival against nature and a killer1h 21mHis HouseWhen ghosts follow, they never leave. A refugee couple are tormented by a sinister force1h 25mCat PeopleA woman's mysterious origins hide a curse which threatens to destroy those close to her.1h 10mHorror ExpressA frozen creature runs amok onboard the Trans-Siberian Express.1h 24mBram Stoker's DraculaLove never dies. Francis Ford Coppola's opulent Oscar-winning take of an undying legend1h 58mScreamDo you like scary movies? The Wes Craven's franchise that redefined horror1h 42mScary Stories to Tell in the DarkThey're not just stories anymore. A group of teens find a sinister book written in blood1h 38mScream 2A sequel to die for. A copycat killer is on the loose, sparking a new wave of terror1h 51mThe TurningKeep an eye on the children. A nanny of two orphans fears they are hiding dark secrets1h 28m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Carrie",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0m2h3nr.jpg"
      ],
      "datePublished": "2025-09-21T22:38:19.000Z",
      "dateModified": "2025-09-21T22:38:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-10-15T04:14:45.000Z",
    "description": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and p",
    "body": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-10-15T04:14:45.000Z",
      "dateModified": "2025-10-15T04:14:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hull Funeral director admits 36 offences and denies others",
    "url": "https://www.bbc.com/news/articles/cwyplw17897o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/208c/live/f92571e0-a9de-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-15T15:56:24.000Z",
    "description": "17 minutes agoKevin Shoesmith andStuart HarrattEast Yorkshire and LincolnshirePA MediaRobert Bush leaving Hull Crown CourtA former funeral director ha",
    "body": "17 minutes agoKevin Shoesmith andStuart HarrattEast Yorkshire and LincolnshirePA MediaRobert Bush leaving Hull Crown CourtA former funeral director has pleaded guilty to 36 charges of fraud after a major investigation into human remains found at his premises, including four babies lost in pregnancy. Robert Bush, 47, admitted 35 offences of fraud by false representation and another of fraudulently running a business, Hull-based Legacy Independent Funeral Directors relating to the sale of funeral plans.He also denied 30 counts of preventing lawful and decent burials and one charge of stealing money from charity collection boxes, during a hearing at Hull Crown Court.Bush, formerly of Kirk Ella, East Yorkshire and now living in West Yorkshire, will face a trial at Sheffield Crown Court on 5 October 2026.Humberside Police began its inquiry into Legacy Independent Funeral Directors following a report of \"concern for care of the deceased\" in March 2024.The force said four of the fraud by false representation counts related to \"ashes provided to families following loss in pregnancy\".It took the court clerk 22 minutes to put all 67 charges to Bush, who wore a grey three-piece suit, a white shirt and purple tie.There were gasps from the packed public gallery each time a not guilty plea was entered.A woman heckled Bush from the gallery as he was ushered out of the courtroom at the end of the hearing. Bush was bailed until his next court appearance.Listen to highlights from Hull and East Yorkshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here.Download the BBC News app from the App Store for iPhone and iPad or Google Play for Android devices",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hull Funeral director admits 36 offences and denies others",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/208c/live/f92571e0-a9de-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-15T15:56:24.000Z",
      "dateModified": "2025-10-15T15:56:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Celebrity Traitors: Which one are you? Take our quiz to find out",
    "url": "https://www.bbc.com/news/articles/cx20545pdedo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f2a8/live/489d99d0-a919-11f0-b741-177e3e2c2fc7.jpg",
    "tag": "Trending",
    "date": "2025-10-14T23:29:36.000Z",
    "description": "17 hours agoThe Celebrity Traitors have begun their murder spree, as the faithfuls endeavour to uncover them. Many of us like to think we could handle",
    "body": "17 hours agoThe Celebrity Traitors have begun their murder spree, as the faithfuls endeavour to uncover them. Many of us like to think we could handle the pressure of being a Traitor, but which celebrity Traitor are you?Spoiler alert: the quiz will reveal who the celebrity traitors are.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Celebrity Traitors: Which one are you? Take our quiz to find out",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f2a8/live/489d99d0-a919-11f0-b741-177e3e2c2fc7.jpg"
      ],
      "datePublished": "2025-10-14T23:29:36.000Z",
      "dateModified": "2025-10-14T23:29:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oxford student arrested after chanting about putting Zionists 'in the ground'",
    "url": "https://www.bbc.com/news/articles/ce8gdelw79po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8157/live/530681c0-a9dc-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-15T15:40:01.000Z",
    "description": "A University of Oxford student filmed allegedly chanting for Gaza to \"put the Zios in the ground\" at a pro-Palestinian march has been arrested.Officer",
    "body": "A University of Oxford student filmed allegedly chanting for Gaza to \"put the Zios in the ground\" at a pro-Palestinian march has been arrested.Officers investigating chants at a Palestine Coalition demonstration in central London on Saturday arrested a 20-year-old-man on suspicion of inciting racial hatred, the Metropolitan Police said. Videos appeared to show a man, who has been widely named as Samuel Williams, telling demonstrators that the chant had been \"workshopped\" in Oxford.The University of Oxford said a student had been arrested in the early hours of Wednesday, but said it had not been told why. It is understood the student has been suspended by the university. The man was arrested at an address in Oxford, police said, and remains in custody. The force did not name the man. In videos he appears to tell the crowd: \"A steadfast and noble resistance in Palestine and in Gaza to look to, to be inspired by and - I don't want to yap for too long - but a chant that we've been workshopping in Oxford that maybe you guys want to join in.\"It goes 'Gaza, Gaza make us proud, put the Zios in the ground'.\"A university spokesperson said: \"An Oxford University student was arrested in the early hours of Wednesday, 15 October.\"The precise basis for the arrest has not yet been disclosed to the university.\"While the university cannot comment on individual student cases, it has the power to take immediate and proportionate action including, as appropriate, suspending a student from membership of the University, whenever serious concerns are raised.\"Oxford University is unequivocal: there is no place for hatred, antisemitism or discrimination within our community, and we will always act to protect the safety and dignity of our students.\"Last week, the prime minister said the government could consider pursuing more curbs on protest laws, including targeting some of the chants used at pro-Palestinian demonstrations.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oxford student arrested after chanting about putting Zionists 'in the ground'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8157/live/530681c0-a9dc-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-15T15:40:01.000Z",
      "dateModified": "2025-10-15T15:40:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Daniel Day-Lewis has not been inundated with scripts since return with Anemone",
    "url": "https://www.bbc.com/news/articles/c5y9jg5rx5eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f7b0/live/09106c40-a9a3-11f0-928c-71dbb8619e94.png",
    "tag": "Trending",
    "date": "2025-10-15T08:12:54.000Z",
    "description": "'I never used the word retirement' - Daniel Day-Lewis is back on screen after a seven-year break8 hours agoLizo MzimbaEntertainment correspondent, the",
    "body": "'I never used the word retirement' - Daniel Day-Lewis is back on screen after a seven-year break8 hours agoLizo MzimbaEntertainment correspondent, the London Film FestivalPA MediaDaniel Day-Lewis at the premiere of his new film AnemoneDaniel Day-Lewis may have returned to acting after a seven-year absence, but the actor has said he has not been inundated with new scripts.The 68-year-old was last seen on film in 2017's Phantom Thread, after which his agent released a statement saying he \"will no longer be working as an actor\".But he was tempted back to the screen by the opportunity to work with his son Ronan, who directed and co-wrote his new film Anemone.Asked if he had been swamped with new scripts now that he's returned, Day-Lewis told BBC News: \"No, there's been no inundation. I'm definitely open to the idea of working. \"And just to put the record straight, I never used the word retirement. People have happily used it on my behalf. \"But I felt I needed to work at something else for a while, which I did. I'm glad to be back doing this, and I'm certainly open to doing it again.\"Before stepping back from acting in 2017, Day-Lewis was one of cinema's most sought-after actors, having won three Oscars and starred in films such as Gangs of New York, There Will Be Blood and Lincoln.The actor and his son Ronan, 27, co-wrote the script for Anemone, which premiered at the London Film Festival on Tuesday.Universal PicturesDaniel Day-Lewis and director Ronan Day-Lewis discussing a sceneDay-Lewis plays Ray, a former soldier living in isolation in the woods, who is sought out by his brother during a family crisis.\"It was just the idea of working with Ronan,\" the actor said. \"We just thought we'd find a way of doing something together. So it was a very open and unspecific impulse that started it.\"Daniel says he and Ronan quickly found that their ideas were well aligned early in the writing process.\"We very soon found our way into some common ground. The idea of a story about brothers, and it went on from there.\"'Brotherly love'The film sees the three-time Oscar winner's character Ray dealing with his difficult past in the military by cutting himself off from society. Years later, his brother finds him, and tries to persuade him to come home to reunite with his ex-wife and son, who is in trouble after assaulting another young man.That kind of fraternal family dynamic was something that Ronan Day-Lewis was keen to explore, when writing the script with his father.\"I have two brothers,\" he explains. \"And for a few years before we had started working together on anything, I'd had the vague idea of wanting to find a way into that, as a kind of archetype in the story.\"Once we both locked into that and realised that we independently had that interest. It was really just a matter of finding these characters and then just following them into the dark.\"Universal PicturesSean Bean and Daniel Day-Lewis in AnemoneRay's brother Jem is played by Game of Thrones and Lord of the Rings star Sean Bean. The British actor says it was a pleasure acting opposite someone of the calibre of Day-Lewis, whom he matches beat for beat in some of the film's most intense scenes.\"Yeah, I was alright,\" laughs Bean. \"He's great to work with. He's very welcoming, he's very generous. \"He's very focused, obviously. We all know his approach to acting, which is admirable. And I just felt very comfortable with that relationship we had together.\"'New themes and emotions'Throughout his career, Day-Lewis has demonstrated his range with a wide variety of roles. Did this one have new themes or emotions that he hadn't tackled before?\"That's a really interesting question,\" he says, pausing to consider it for a few moments. \"I'd say yes, for sure. I think what happened inadvertently was it also became an exploration about the generations of relationships between fathers and sons.\"And that's something, for my own personal reasons, has preoccupied me since childhood. And so I think that certainly became something that was really new and interesting to me.\"Anemone is released in UK cinemas on 7 November.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Daniel Day-Lewis has not been inundated with scripts since return with Anemone",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f7b0/live/09106c40-a9a3-11f0-928c-71dbb8619e94.png"
      ],
      "datePublished": "2025-10-15T08:12:54.000Z",
      "dateModified": "2025-10-15T08:12:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Row over bringing back military service splits German government",
    "url": "https://www.bbc.com/news/articles/cdrzjnrdd2ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3a13/live/bcf984e0-a9b1-11f0-a923-ff705558ae00.jpg",
    "tag": "Trending",
    "date": "2025-10-15T14:33:42.000Z",
    "description": "2 hours agoJessica ParkerBerlin correspondentNurPhoto via Getty ImagesUnder the plans, it will be compulsory for men to fill out a questionnaire at th",
    "body": "2 hours agoJessica ParkerBerlin correspondentNurPhoto via Getty ImagesUnder the plans, it will be compulsory for men to fill out a questionnaire at the age of 18, but optional for womenPlans to re-introduce military service in Germany have been thrown into chaos because of an 11th hour row amongst the governing parties.A compromise, which was set to include the possibility of some mandatory conscription, has been shot down.Chancellor Friedrich Merz has said he wants Germany to have the strongest conventional army in Europe.But on Tuesday night, a press conference to announce the proposals was abruptly cancelled, ahead of a draft bill going before parliament on Thursday. Defence Minister Boris Pistorius has denied accusations of \"torpedoing\" the plans.Despite being the EU's largest economy, Germany's military has been poorly funded for decades following the end of the Cold War.Berlin is now rushing to boost spending and personnel, with warnings that members of the Western Nato alliance must prepare for a possible Russian attack within four years.However, military service remains a politically sensitive issue.A significant section of German society remains deeply wary of conscription and re-armament given the catastrophic consequences of remilitarising in the 20th Century.Nevertheless, a recent Forsa survey for Stern suggested that 54% of people favoured compulsory service while 41% opposed it.Opposition rose to 63% among 18 to 29-year-olds.Germany wants to expand its armed forces from the current 183,000 active servicemen and women to 260,000 by 2035 – plus 200,000 reservists.Under draft plans announced this summer, 18-year-olds will be asked to fill out an online questionnaire about their background and willingness to serve for at least six months.It will be compulsory for men to fill out the questionnaire but optional for women.TOBIAS SCHWARZ/AFPThere is resistance within the junior partner in the coalition, the SPD, to any element of compulsory serviceThe government, made up of Merz's conservative CDU/CSU and the centre-left Social Democrat SPD, agreed in their coalition treaty to reintroduce military service which would be voluntary \"to start with\".However, CDU politicians – including Chancellor Merz – have increasingly aired concerns that a purely voluntary system will not be sufficient.This week, negotiators from the two coalition parties hammered out a complicated compromise which, according to German media, would have involved a multi-stage process.Details are not entirely clear but reports suggested that, if not enough school-leavers volunteered, then a lottery system could be used.A selection of young men could be summoned for a medical or even mandatory service, if required, should recruitment targets be missed.However, there is resistance within the SPD's ranks to any form of compulsory service.SPD Defence Minister Boris Pistorius is strongly behind ambitions for a beefed-up military, but believes the latest plans are impractical.Rather than a lottery, he has backed proposals for all eligible young men to undergo a medical from July 2027, so the Bundeswehr has a clear snapshot of available manpower.Pistorius has played down the political impasse and insisted that a new law will still be steered through in time for it to take effect from next year.His original proposals, which focus on voluntary recruitment, are now expected to be tabled on Thursday – but will likely be subject to further fierce debate.Germany's defence ministry faces a gargantuan logistical challenge in building the infrastructure that will be required to match its expanded military ambitions.Conscription was suspended in Germany in 2011. Young men were able to choose either to serve or, if they were conscientious objectors, opt for social work.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Row over bringing back military service splits German government",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3a13/live/bcf984e0-a9b1-11f0-a923-ff705558ae00.jpg"
      ],
      "datePublished": "2025-10-15T14:33:42.000Z",
      "dateModified": "2025-10-15T14:33:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK sanctions Russia's oil giants over Ukraine war",
    "url": "https://www.bbc.com/news/articles/cew418r5rxdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7372/live/2dd55f70-a9d2-11f0-aa31-b1f6905de5c6.jpg",
    "tag": "Trending",
    "date": "2025-10-15T16:11:56.000Z",
    "description": "2 hours agoPritti MistryBusiness reporter andFaisal IslamEconomics editorBritain is targeting Russia's largest oil companies and the country's \"shadow",
    "body": "2 hours agoPritti MistryBusiness reporter andFaisal IslamEconomics editorBritain is targeting Russia's largest oil companies and the country's \"shadow fleet\" of oil tankers in a bid to cut off Vladimir Putin's ability to fund the war in Ukraine.The UK government is also pursuing a major Indian oil refinery and four Chinese oil terminals in a package of 90 new sanctions.Chancellor Rachel Reeves said the move was expected to have a significant impact on Russia's economy and its ability to sustain military operations in Ukraine.\"We are sending a clear signal: Russian oil is off the market,\" she said ahead of a meeting in Washington DC with global counterparts to discuss Russian sanctions.Reeves said the government was \"significantly stepping up the pressure on Russia and Vladimir Putin's war effort.\"Russia's two largest oil companies - Lukoil and Rosneft - will be hit with sanctions, Reeves said on the sidelines of the International Monetary Fund's (IMF) annual meeting.\"At the same time, we are ramping up pressure on companies in third countries, including India and China, that continue to facilitate getting Russian oil onto global markets,\" she said.\"There is no place for Russian oil on global markets and we will take whatever actions are necessary to destroy the capability of the Russian government to continue this illegal war in Ukraine.\"The government was also sanctioning 44 tankers that operate in Russia's \"shadow fleet\" transporting oil around the world, Reeves said in a joint statement with the Foreign Secretary Yvette Cooper.The two Russian oil firms export 3.1 million barrels of oil per day. Rosneft is responsible for nearly half of all Russian oil production, which makes up 6% of the global output, according to the government.Also on the sanction list is India's Nayara Energy Limited, which the government said imported 100 million barrels of Russian crude oil worth more than $5bn (£3.75bn) in 2024 alone.Cooper said: \"Today's action is another step towards a just and lasting peace in Ukraine, and towards a more secure United Kingdom.\"The announcement comes as the G7, a grouping of some of the world's most advanced economies, prepares to consider a plan to effectively seize hundreds of billions from the proceeds of Russian investments, frozen since the invasion of Ukraine.A vast bulk of Russia's assets are held as cash at the European Central Bank, after its underlying bond investments matured.The European Union (EU), where the bulk of funds are held, had been reluctant to pursue the wider plan, but appears to be developing a way round legal concerns. It will be considered at an EU summit next week.Ukraine has significant funding needs as the war continues, both in arms and reconstruction.Earlier this year, the UK joined the US in directly sanctioning energy companies Gazprom Neft and Surgutneftegas.At the time the then Foreign Secretary, David Lammy, had said it would \"drain Russia's war chest – and every ruble we take from Putin's hands helps save Ukrainian lives\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK sanctions Russia's oil giants over Ukraine war",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7372/live/2dd55f70-a9d2-11f0-aa31-b1f6905de5c6.jpg"
      ],
      "datePublished": "2025-10-15T16:11:56.000Z",
      "dateModified": "2025-10-15T16:11:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Adolescence star Stephen Graham launches fathers and sons book",
    "url": "https://www.bbc.com/news/articles/cn40yyl8nvyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e276/live/d0cc4690-a90e-11f0-b5e8-25b94b51d777.jpg",
    "tag": "Trending",
    "date": "2025-10-15T09:01:19.000Z",
    "description": "Stephen Graham hopes father-son book will 'continue the message of Adolescence'7 hours agoEmma SaundersCulture reporterJoseph SinclairNetflix's hit TV",
    "body": "Stephen Graham hopes father-son book will 'continue the message of Adolescence'7 hours agoEmma SaundersCulture reporterJoseph SinclairNetflix's hit TV series Adolescence explored toxic masculinity and the impact of mobile phones and social media on teenagers and family life.Graham, whose letter to his own son will be included in the book, told the BBC: \"My hope for this book is that it will be a continuation of the message of Adolescence and a tool for fathers to start more conversations with their sons.\"The Bloomsbury book will be made up of a collection of letters from fathers from all walks of life, with submissions open from 15 October until 12 January. In a press statement, Graham added: \"After the huge impact of Adolescence, I realised there was a greater need for communication between fathers and sons. \"There is arguably an even bigger disconnect than ever before, and I would love to help create more opportunity for fathers to reach out to their sons and carry on the conversation.\"We want to hear from men of all ages, first-time fathers, absent fathers, fathers who've been there but never truly been there, fathers who've lost and fathers who just want to find a way to say I love you, to tell their sons what they mean to them and to talk openly about what it means to be a man.\"The book will be published in October 2026.Graham is working on the project with psychology lecturer Orly Klein. The pair will make a donation for every letter published to the charity ManUp? and social enterprise Dad La Soul, two organisations that support young men struggling with mental health. Bloomsbury will also make a donation to ManUp?Getty ImagesOwen Cooper and Stephen Graham were the stars of AdolescenceFor several weeks earlier this year, Adolescence dominated the news agenda, and eventually went on to become Netflix's second most watched English-language series ever (after the first season of Wednesday).The UK government supported Netflix's proposal to make the drama available to schools. Prime Minister Sir Keir Starmer said there was a need to tackle the \"emerging and growing problem\" the show raised.Many critics shared the sentiment in their reviews. \"If you're a parent to a school-age boy... it will chill your blood,\" said the Telegraph's Anita Singh.\"It is a drama so quietly devastating that I won't forget it for a very long time.\"The show went on to win several Emmy awards in the US. Its young star, Owen Cooper, 15, was named best supporting actor in a limited series for his portrayal of a schoolboy accused of murdering a classmate.The four-part drama also won best limited series, as well as prizes for its directing and writing, and acting prizes for Stephen Graham and Erin Doherty.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Adolescence star Stephen Graham launches fathers and sons book",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e276/live/d0cc4690-a90e-11f0-b5e8-25b94b51d777.jpg"
      ],
      "datePublished": "2025-10-15T09:01:19.000Z",
      "dateModified": "2025-10-15T09:01:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Basketball: Fiba suspends BBF and British men's team barred from international competition",
    "url": "https://www.bbc.com/sport/basketball/articles/cpwv5n9dpzgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fd94/live/0905fd70-a9ce-11f0-a5c2-cb318711a6b0.jpg",
    "tag": "Trending",
    "date": "2025-10-15T14:40:55.000Z",
    "description": "Basketball's world governing body Fiba has suspended the British Basketball Federation (BBF) and barred the men's team from international competition ",
    "body": "Basketball's world governing body Fiba has suspended the British Basketball Federation (BBF) and barred the men's team from international competition because of governance issues.A Fiba taskforce was set up in August to investigate \"regulatory non-compliance\" within British basketball.In April, the BBF awarded a 15-year licence to run a new professional men's competition - the Great Britain Basketball League - to GBB League Ltd (GBBL).The BBF said GBBL, a consortium led by the American businessman Marshall Glickman, would provide £15m funding in the first two years.However, the existing nine Super League Basketball [SLB] clubs claimed the tender process run by the governing body was \"illegal and unjust\" and refused to join the new league.The clubs launched legal action against the BBF in the high court, while UK sports minister Stephanie Peacock reportedly asked the government body responsible for elite funding, UK Sport, to investigate the allegations.In a statement, Fiba said it had completed a \"comprehensive review of the situation, including interviews and meetings with basketball stakeholders\".Under the terms of the suspension, the BBF will not be permitted to licence or recognise national men's competitions, or field a men's national team in Fiba senior competitions.The taskforce will now \"engage directly with basketball stakeholders and the UK government to explore and propose an interim operational framework for the top-tier men's national competitions\".The statement added: \"These measures aim to restore regulatory integrity and promote sustainable governance of men's basketball in Great Britain as soon as possible.\"On Sunday, the BBF announced the resignation of chairman Chris Grant after three years because of \"personal reasons\".BBC Sport has contacted the BBF for comment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Basketball: Fiba suspends BBF and British men's team barred from international competition",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fd94/live/0905fd70-a9ce-11f0-a5c2-cb318711a6b0.jpg"
      ],
      "datePublished": "2025-10-15T14:40:55.000Z",
      "dateModified": "2025-10-15T14:40:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Afghan Taliban and Pakistan agree short truce after deadly clashes",
    "url": "https://www.bbc.com/news/articles/c3dnvnjdg1ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6576/live/b711b100-a9da-11f0-b142-c350b61cfbce.jpg",
    "tag": "Trending",
    "date": "2025-10-15T15:27:06.000Z",
    "description": "46 minutes agoHafizullah MaroofBBC Afghan,Mahfouz ZubaideBBC producer,Carrie DaviesPakistan correspondent andKoh EwePakistan and Afghanistan's Taliban",
    "body": "46 minutes agoHafizullah MaroofBBC Afghan,Mahfouz ZubaideBBC producer,Carrie DaviesPakistan correspondent andKoh EwePakistan and Afghanistan's Taliban government say they have agreed a temporary ceasefire after fresh border clashes and reported Pakistani air strikes on Kabul and Kandahar.Both sides claimed the other requested the 48-hour ceasefire, which Pakistan said took effect from 13:00 GMT on Wednesday.Earlier a Taliban spokesman said 12 civilians had been killed and more than 100 wounded by Pakistani firing. Both sides claimed the other suffered heavy casualties. None of the deaths could be independently confirmed.Violence has flared since explosions rocked Afghanistan last week, which Kabul blamed on Islamabad. The Taliban deny claims they are harbouring militants targeting Pakistan.Wednesday started with each side accusing the other of initiating deadly clashes.Pakistan's military said its forces had killed \"15-20 Afghan Taliban\" and injured many in Spin Boldak border district. The Taliban government spokesman said numerous Pakistani soldiers had been killed.Then, later in the day explosions in Kabul and Kandahar ratcheted up tensions. Pakistani state media reported they were air strikes by the armed forces on targets in Kandahar province and Kabul.There has been no public acknowledgement from the Pakistani military and no confirmation from the Taliban government, whose spokesman said an oil tanker and a generator had exploded, without linking the blasts to fighting with Pakistan.The spokesman said Afghan forces had been instructed to respect the ceasefire \"as long as no one commits aggression\".The two sides are not only fighting for the upper hand on the border, but on social media, trying to convince the public that their side is inflicting more damage.The latest fighting comes after intense border clashes over the weekend, when the Taliban claimed to have killed 58 members of the Pakistani military and Islamabad said it killed 200 \"Taliban and affiliated terrorists\". The BBC was unable to independently verify the death tolls provided by each side.Wednesday's fighting shattered several days of fragile peace.Videos purportedly of the fighting and its aftermath have been shared online and on messaging groups, including footage claiming to be of those killed and grainy shots from night vision cameras claiming to be of check posts destroyed. The videos have not been verified by the BBC.A source in Spin Boldak in Afghanistan told the BBC that clashes broke out on around 04:00 local time (23:30 GMT on Tuesday). Another local in Spin Boldak, who lives about one kilometre away from the border crossing, told BBC the \"very heavy clashes continued for almost five hours\". \"I see drones and jets flying over us, some of our relatives are wounded,\" they said.A doctor in one of the hospitals in Spin Boldak told the BBC that he counted \"seven bodies and 36 injured brought to the hospital\", including men, women and children.The situation was \"tense\" and more casualties were being taken to hospital, he said.A local Taliban official in Spin Boldak told the BBC that \"hundreds of families have been displaced since last night due to the heavy clashes\". He said they were on \"high alert\" after a few Taliban posts were attacked by Pakistani jets. He added that they had the bodies of two Pakistani military members.In a separate overnight clash on Pakistan's north-western border, the Pakistani military said that 25 to 30 Taliban and Pakistani Taliban fighters were \"suspected\" to have been killed. The clashes have prompted calls for de-escalation from other countries including China and Russia, as well as a suggestion from US President Donald Trump that he could step in to broker peace.On Wednesday, Richard Bennett, UN special rapporteur on the situation of human rights in Afghanistan, wrote on X that he was \"deeply concerned\" by reports of civilian casualties and displacement because of the clashes.\"I urge all parties to exercise maximum restraint, protect civilians, and abide by international law,\" he wrote.Pakistan has long accused the Afghan Taliban of permitting the Pakistan Taliban to operate from their land and fight against the Islamabad government in an attempt to enforce a strict Islamic-led system of governance.The Afghan Taliban government has always denied this.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Afghan Taliban and Pakistan agree short truce after deadly clashes",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6576/live/b711b100-a9da-11f0-b142-c350b61cfbce.jpg"
      ],
      "datePublished": "2025-10-15T15:27:06.000Z",
      "dateModified": "2025-10-15T15:27:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gaza experts work to identify bodies of 90 Palestinians returned by Israel",
    "url": "https://www.bbc.com/news/articles/c5ypwqwlnn2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7ca7/live/eb30fb80-a9c6-11f0-8da2-811fba9518ff.jpg",
    "tag": "Trending",
    "date": "2025-10-15T16:05:01.000Z",
    "description": "9 minutes agoDavid GrittenBBCIt is difficult to identify bodies with just codes and numbers attached to the bags, Palestinian officials sayA health of",
    "body": "9 minutes agoDavid GrittenBBCIt is difficult to identify bodies with just codes and numbers attached to the bags, Palestinian officials sayA health official in Gaza says a specialist committee is working to identify the bodies of 90 Palestinians handed over by Israel in exchange for dead hostages held by Hamas.If they were unsuccessful, photos would be posted online so families could search for relatives, said Dr Mohammed Zaqout, director general of hospitals for the Hamas-run health ministry.It is not clear whether the bodies - stored at Nasser hospital in Khan Younis - belong to Palestinians who died in Gaza or in Israeli custody. Footage filmed by a freelance journalist working for the BBC at Nasser's mortuary appeared to show the body of a blindfolded man. Another body seemed to have a marks around the wrists and ankles.The BBC has asked the Israeli military and justice ministry for comment. They have previously rejected accusations of widespread ill-treatment and torture of detainees.Under last week's ceasefire agreement with Hamas, Israel has agreed to hand over the bodies of 15 Palestinians in return for every deceased Israeli hostage.So far, the Israeli military has said the remains of six Israeli hostages have been returned.The body of another hostage - a Nepalese national - has also been returned from Gaza, along with the remains of another person who was not a hostage.Israel has called on Hamas to \"make all necessary efforts\" to recover the bodies of the remaining 21 deceased hostages as agreed.The last 20 living hostages were also handed over by Hamas on Monday in exchange for 250 Palestinian prisoners in Israeli jails and 1,718 detainees from Gaza.Latest updatesHostage families confirm identities of three of four bodies handed over by HamasTrump demands Hamas disarm, as group moves against 'collaborators' in GazaBowen: Trump's role in Gaza ceasefire was decisive, but not a roadmap to peaceIsraeli authorities handed over 45 Palestinians' bodies to the International Committee of the Red Cross (ICRC) on Monday - with another 45 on Wednesday. The remains were transferred by the ICRC to Nasser hospital.Speaking outside the facility on Tuesday, Dr Zaqout said the first group of bodies had been kept by Israeli authorities in refrigerators, and that \"some are clearly recognisable, while others are difficult to identify\".\"Once confirmed, we will publish the names for the families so they can come forward to identify and bury their loved ones.\"However, Dr Zaqout said health officials had so far received no information to assist them, such as names or the circumstances of death.\"What we received are bodies with codes and numbers. However, we were promised that... we would be provided with the names. We are awaiting further clarification from our colleagues at the International Committee of the Red Cross.\"If we receive the names from [Israel], we will publish them. If not, we will be forced to create a link where photos of the identifiable martyrs will be posted.\"Gaza's health system has been devastated by the two-year war between Israel and Hamas, and lacks the specialist equipment needed for the identification of bodies, such as DNA testing.Rasmieh Qdeih said she was searching for her son, Fadi, who has been missing since the start of the warAlso outside Nasser hospital was Rasmieh Qdeih from Khuzaa, a town east of Khan Younis.She was searching for her son Fadi, 36, who has been missing since 7 October 2023, when the Israeli military launched a campaign in Gaza in response to a Hamas-led attack on southern Israel in which about 1,200 people were killed and 251 were taken hostage.At least 67,938 people have been killed by Israeli attacks in Gaza since then, according to the territory's health ministry, whose figures are seen by the UN as reliable.\"I don't know whether he was imprisoned or martyred. I contacted everyone; no-one told me anything,\" Ms Qdeih said.\"Every time a prisoner is released, I ask them - have you seen Fadi?... Is he a prisoner, a martyr, or missing? They say 'no'. Everyone in Negev prison says they haven't heard that name. Each one tells me something different.\"She said the wait to learn her son's fate was the most difficult she had ever experienced.\"I'm not upset... I just want to know if my son is among them. If not, if they don't find my son among these martyrs, I will be shocked.\"\"If there's anything, I'll recognise him - my son's leg is amputated, and he has vitiligo... His hair is white. I'd know him,\" she added.It is not clear how many bodies of Palestinians from Gaza are being held by Israel.The National Campaign for the Recovery of Martyrs' Bodies, a non-governmental Palestinian campaign group, said last week the remains of at least 735 people, 99 of them from Gaza, were being held by Israel in its mortuaries or cemeteries.It also cited Israeli media reports from last year as saying Israel was holding the bodies of approximately 1,500 Hamas fighters at the Sde Teiman military base.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gaza experts work to identify bodies of 90 Palestinians returned by Israel",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7ca7/live/eb30fb80-a9c6-11f0-8da2-811fba9518ff.jpg"
      ],
      "datePublished": "2025-10-15T16:05:01.000Z",
      "dateModified": "2025-10-15T16:05:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israeli couple kidnapped at Nova music festival renunited after 738 days",
    "url": "https://www.bbc.com/news/articles/c5yp0j0l3glo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4117/live/051d2a50-a9a9-11f0-b741-177e3e2c2fc7.jpg",
    "tag": "Trending",
    "date": "2025-10-15T12:15:17.000Z",
    "description": "An Israeli couple who were abducted during the 7 October 2023 Hamas attacks have been reunited, two years after they were violently split up.Noa Argam",
    "body": "An Israeli couple who were abducted during the 7 October 2023 Hamas attacks have been reunited, two years after they were violently split up.Noa Argamani and Avinatan Or were seized at the Nova music festival. Video of Ms Argamani being dragged away in terror on the back of a motorbike became one of the most widely recognised images of the attacks.She was rescued by Israeli commandos on 8 June 2024. Mr Or, who was held separately in central Gaza, was released on Monday - one of 20 living hostages to be returned as part of the ceasefire brokered by US President Donald Trump.In a post on Instagram, Ms Argamani said the couple could now begin \"healing together\".After reuniting, Israeli media said the pair shared their \"first cigarette together after two years\".A day after her partner's release, Ms Argamani shared an emotional Instagram post alongside their first photos together since 2023.\"Two years since the last moment I saw Avinatan, my love. Two years since terrorists kidnapped us, put me on a motorcycle, and tore us apart in front of the whole world,\" she wrote.She said she had been held with other women and children inside houses during her captivity, \"while Avinatan was only in the tunnels\". \"Hamas released videos and signs of life from me, while there was no information at all about Avinatan,\" the post, in Hebrew, continued.She said the pair could now begin their recovery. \"We won our personal war and the whole world's fight with us to get to this moment, and now it's time for us to begin our shared journey together,\" the post said.Ms Argamani also thanked Trump for his part in bringing the hostages home and helping them \"overcome the darkness\".Mr Or's father told Israeli media about the conditions his son had been kept in - food supplies which were \"meagre\" and a lot of time alone, chained up in tunnels and small enclosures during his 738 days in captivity.He said his son - who is around 2m (6ft 5in) tall - was held at one point in a space just 1.8m high, and just slightly longer than the mattress he slept on.\"He's extremely thin,\" Yaron Or told reporters, adding that his son had had \"no books, no human contact - nothing\", but was given a Rubik's Cube at one point.He was given very little information about the outside world, including the whereabouts of his girlfriend or the full scope of the Hamas attacks and subsequent Israeli offensive.\"Around him were guards whose relatives had been killed in IDF [Israel Defense Forces] strikes, I think it's simply a miracle they didn't harm him, except for one time he tried to escape,\" the senior Mr Or said.Avinatan Or reportedly tried to escape whilst being moved through a tunnel but was captured and beaten for the attempt. \"He's sharing things gradually, we're not asking directly,\" his father said.\"Physically, he still needs to recover,\" he continued. \"But mentally, thank God, he's the same Avinatan - same humour, same strength.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israeli couple kidnapped at Nova music festival renunited after 738 days",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4117/live/051d2a50-a9a9-11f0-b741-177e3e2c2fc7.jpg"
      ],
      "datePublished": "2025-10-15T12:15:17.000Z",
      "dateModified": "2025-10-15T12:15:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]