[
  {
    "title": "What Trump's vision of the new world order means for Europe",
    "url": "https://www.bbc.com/news/articles/c041n3ng03no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cdd1/live/eb492840-ec7e-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-09T12:11:35.000Z",
    "description": "Trump's grand plan to reshape the world order leaves Europe with a difficult choice to make18 minutes agoAllan LittleSenior correspondentBBCFor 80 yea",
    "body": "Trump's grand plan to reshape the world order leaves Europe with a difficult choice to make18 minutes agoAllan LittleSenior correspondentBBCFor 80 years, what bound the United States to Europe was a shared commitment to defence and a common set of values: a commitment to defend democracy, human rights and the rule of law.That era was inaugurated in March 1947 in an 18-minute speech by President Harry Truman, in which he pledged US support to defend Europe against further expansion by the Soviet Union.America led the creation of Nato, the World Bank, the IMF and the United Nations. And it bound itself into what became known as the \"rules-based international order\", in which nation states committed to a series of mutual obligations and shared burdens, designed to defend the democratic world against hostile authoritarian powers.Now, the new US National Security Strategy (NSS), published in December, signals that, for the White House, that shared endeavour has ended; that much of what the world has taken for granted about America's role is over.The review refers to the \"so-called 'rules-based international order'\", putting the latter phrase in inverted commas: a kind of delegitimisation by punctuation mark.AFP via Getty ImagesJD Vance said that the real threat to Europe did not come from Russia but from within Vice-President JD Vance warned America's European allies that this was coming in a speech at the Munich Security Conference in February 2025.He told them bluntly that the real threat to Europe did not come from Russia but from within - from those censoring free speech, suppressing political opposition and therefore undermining European democracy. And he was damning about the \"leftist liberal network\".The French newspaper Le Monde said the speech was a declaration of \"ideological war\" against Europe.Last month's NSS codifies Vance's remarks, and, in black and white, elevates them to the status of doctrine.\"Certainly America is no longer the country that promoted the global values that have been in place since the end of the Second World War,\" says Karin von Hippel, who previously held senior positions in the US State Department and is a former Director of the Royal United Services Institute (Rusi), a Whitehall think tank.\"It is shifting to a very different place.\"So, if the world is indeed moving away from that order, what is it moving towards? And what does it mean for the rest of the world and in particular for Europe?'We have a different world today'\"International institutions, notably the United Nations, have been marked by dramatically anti-American sentiment, and have not served our or any other particular purpose,\" says Victoria Coates, a vice-president at The Heritage Foundation, a prominent right-wing think tank in Washington.In the eyes of Coates - who was previously the Deputy National Security Adviser to US President Donald Trump - change to the international order is inevitable in a changing world.\"The other issue we face here is that when that so-called rules-based international order was established after the Second World War, 80 short years ago, China wasn't a major concern.\"We just have a different world today.\"Getty ImagesPresident Truman watches on as a US representative signs the United Nations Charter in 1945This rules-based international order, built in the years after World War Two, was created by a generation that had come of age during an era of Great Power geopolitics, and had seen that system descend, twice, into catastrophic global conflict.That international order, flawed and incomplete though it undoubtedly was, was the legacy of that experience.But the NSS directly argues that American strategy went astray in the years since - and it blames what it calls \"American foreign policy elites\".\"They lashed American policy to a network of international institutions, some of which are driven by outright anti-Americanism and many by a transnationalism that explicitly seeks to dissolve individual state sovereignty,\" it says.It suggests that in future, the US will seek to roll back the influence of supranational bodies. Anadolu via Getty ImagesThe National Security Strategy says: 'We stand for the sovereign rights of nations, against the sovereignty-sapping incursions of the most intrusive transnational organizations'\"The world's fundamental political unit is and will remain the nation-state… We stand for the sovereign rights of nations, against the sovereignty-sapping incursions of the most intrusive transnational organizations…\"Elsewhere in the document, reflecting on the \"balance of power\", it states: \"The outsized influence of larger, richer, and stronger nations is a timeless truth of international relations.\"The Kremlin responded to the review with praise, saying much of it aligned with Moscow's own thinking.\"I think Trump, Xi, Putin and their more authoritarian acolytes are seeking to return us to an era of Great Power politics,\" says Field Marshal Lord Richards, who, as General Sir David Richards, was the head of the UK's armed forces from 2010 till 2013.Yet Sir Lawrence Freedman, Emeritus Professor of War Studies at King's College London, believes the new Security Strategy is not as radical a break with the past as it may appear.AFP via Getty ImagesThe Kremlin said much of the review aligned with Moscow's own thinking\"We need to be careful about the rules-based international order, which is a term that came into general use in the last decade or so,\" he argues.\"Look back and you find plenty of violations of the rules, Vietnam for example. So there's a sort of rosy glow about the past at times and everyone should be careful about nostalgia for what was a complex past.\"Muscular reassertion of the Monroe doctrineWashington's military operation in the Venezuelan capital Caracas that led to the capture of the country's leader Nicolas Maduro and his wife, Cilia Flores, is an early example of this more muscular assertion of sovereign unilateralism.Some international law experts have questioned the legality of the Trump administration's actions, and argued the US may have violated international statutes governing the use of force. The US maintains its actions were legally justified.\"Under American law it certainly was [legal]\" Robert Wilkie, who served as an Undersecretary of Defense in the first Trump administration, has previously told the BBC.\"Maduro - most of our European partners have not recognised his regime so he is an illegitimate figure. Because of that he is stripped of the normal protections that heads of state would have [...]particularly when were are looking at constitutional provisions that exist in the United States, that would supersede anything the UN says.\"AFP via Getty ImagesThe military operation in the Venezuelan capital Caracas led to the capture of Nicolas Maduro and his wife, Cilia FloresThe NSS claims, for the United States, the right to be the pre-eminent power in the Western Hemisphere, and to bend its Latin American and Caribbean neighbours into alignment with Washington's interests.This is a muscular reassertion of the 1823 Monroe Doctrine and its promise of US supremacy in the Western hemisphere.Colombia, Panama and Cuba are all also in the President's sights.\"This starts primarily with the Panama Canal,\" says Victoria Coates. \"The degree to which control of the canal is necessary to the United States cannot be overstated.\"China is now Latin America's biggest trading partner and a major infrastructure investor there. The NSS aims to roll back Chinese influence in Washington's backyard.When the canal was handed over to Panama, in 1999, by President George HW Bush, says Coates, \"we were in the assumption that China was a reasonable actor… That turned out not to be true…\"So making sure that the United States retains a prime position over the canal is critical, and I think Panama is for the first time getting that message from the United States.\"But Sir Lawrence Freedman is among those who argue that the US's ability to control its neighbours is not unlimited.\"The Strategy Review might say this is our hemisphere and we can do what we want, but there are still constraints. They may have extricated Maduro and his wife, but they're still dealing with the old regime.\"They're not running the country, despite what Trump says.\"Under the new strategy, the United States will no longer pressure authoritarian regimes to improve their human rights records.In a phrase taken from the US Declaration of Independence of 1776, the review declares, \"All nations are entitled by 'the laws of nature and nature's God' to a 'separate and equal station' with respect to one another.\"Getty ImagesXi Jinping and Nicolas Maduro pictured in 2015 in Beijing, ChinaIn the Middle East, for example, the US says it will abandon the \"misguided experiment with hectoring these nations - especially the Gulf monarchies - into abandoning their traditions and historic forms of government\".\"The key to successful relations with the Middle East,\" it adds, \"is accepting the region, its leaders, and its nations as they are while working together on areas of common interest.\"But it seems the same level of respect for traditions and historic forms of government is not extended to the democratic and allied nations of Europe.Whilst it refers to an American sentimental attachment to the European continent - and to Britain and Ireland - what's striking about this paper is that it seeks to redefine what is worth defending in the Western world.This review is civilisational in its reach, and argues for a civilisation that is no longer built on the shared values of the Truman Doctrine, but instead on the primacy of the sovereign nation-state.Where does this leave Europe?The review is damning about Europe's \"current trajectory\" and raises questions about whether some European nations can be regarded as dependable allies in the future.It talks about \"economic decline\" but adds that this is \"eclipsed by the real and more stark prospect of civilizational erasure\".Elsewhere in the document, it states: \"It is more than plausible that within a few decades at the latest, certain Nato members will become majority non-European,\" which raises doubts about their viability as long-term security partners, the strategy suggests.\"It's a very nativist document,\" argues Karin von Hippel. \"It's very ideological. The underlying message is that the Christian white male is no longer running many of the countries [in the West] and we're seeing a threat to the dominance that the Christian white male has had in the United States and Europe.\"They're very careful not to say any of that explicitly but I think that's what's implied.\"Getty ImagesThe new US National Security Strategy, which was published in December, is damning about Europe's 'current trajectory'But Victoria Coates argues that, in her view, the \"larger struggle we find ourselves in\" is indeed civilisational.\"Sovereignty is also a critical issue,\" she says. \"Looking at the European Union project, especially after Brexit, I think a lot of countries are wondering if subverting the national interest to Brussels is a winning strategy.\"I do think that is one of the institutions that the NSS does call into question.\"This chimes with the interests of the American tech giants that oppose EU efforts to regulate their activities on the European continent.Last month Elon Musk posted on X that the European Union should be abolished and sovereignty returned to the individual nation states.'Cultivating resistance to Europe's trajectory'The review is clear about how Europe can regain its \"self-confidence\".It says: \"The growing influence of patriotic European parties indeed gives cause for great optimism. Our goal should be to help Europe correct its current trajectory. We will need a strong Europe to help us successfully compete.\"And one of its policies for doing this is by \"cultivating resistance to Europe's current trajectory within European nations\".What is meant precisely by \"cultivating resistance\" raises many questions.In Europe, some have already concluded that the USA may no longer be a reliable ally, at a time when Russia poses a growing threat. After Vice-President Vance's speech in Munich, Germany's Chancellor, Friedrich Merz, said Europe would need to \"achieve independence\" from America with a reshaped Nato.But this takes time.\"It's not achievable in the short term,\" says Sir Lawrence. \"The Europeans have become very dependent upon the United States, and this was a matter of choice: it was cheaper and simpler.\"Though in practice it would be desirable to be able to act without the Americans… in practice it's going to take years to disentangle ourselves. And it'll be extremely expensive.\"So Europe has a difficulty: it can't rely on the Americans, but it can't operate easily without them.\"AFP via Getty ImagesFriedrich Merz has said Europe would need to \"achieve independence\" As to the pressing question of what it means for Europe - and the EU - in the near future, Lord Richards issues a stark warning: \"[It] risks falling between the cracks.\"\"The EU cannot be a Great Power, nor can any of its constituent nations,\" he argues. \"[So] the UK/EU must decide under whose sphere of influence they should shelter?\"The answer is they are likely to remain in the USA's - and within a reshaped Nato.\"'A popular revolt against the establishment'But Lord Richards also believes that increased spending commitment is long overdue.\"European nations are going to have to spend much more on their own defence. This has long been coming but in the UK it is not yet translating into any fresh money. Indeed this year the armed forces are being required to save money rather than spend more.\"The US has been pushing Europe to increase defence spending for years, notes Sir Lawrence.\"The message that Europe needs to do more for its own defence has been around a long time. It was pushed by both Obama and Biden.\"Last year Trump secured from the European allies a commitment to increase defence spending to 5% of GDP - and in doing so may have done Europe a security favour, by pushing it, in the long term, towards greater operational independence from Washington.\"Spending has gone up quite significantly,\" says Sir Lawrence. \"The Germans have been making quite impressive strides. So there is movement, not as fast as many would wish, but it's happening.\"The review is clear about how America thinks it can \"help\" Europe. \"We want to work with aligned countries that want to restore their former greatness,\" it says.Getty ImagesVictoria Coates says: \"International institutions, notably the United Nations, have been marked by dramatically anti-American sentiment...\"Ultimately, what the report reveals is not so much an ideological divide that separates the US and Europe, but one that slices through both continents.Both sides of the Atlantic have certain concerns in common, argues Victor Mallet, a Paris-based journalist and author of a forthcoming book, Far Right France: Le Pen, Bardella and the Future of Europe.\"Concerns about immigration, concerns about the economy… and there's an extraordinary cultural gulf between supporters of people like Donald Trump, the National Rally in France, the AfD in Germany, and the intellectual, metropolitan, educated liberal elite.\"It's definitely a popular revolt against the establishment.\"He believes that one of the problems is inequality. \"America has, on average, the richest group of consumers the world has ever seen and yet many ordinary Americans find it hard to make ends meet and the same applies in Western Europe.\"More from InDepthIn the NSS, the US commits to scrapping certain practices, such as Diversity, Equity and Inclusion, that are derided by many in Trump's base.In this document, the culture wars that shape America's bitter public discourse now to a degree also shape its in foreign policy, and - by extension, affect the security of the Western world.Russia is not mentioned as a hostile power, despite its invasion of Ukraine, a Western ally. For in the culture wars, some in Trump's Maga base see in Vladimir Putin not a foe but a natural ally in the defence of white, Christian nationalist civilisation: a man who proudly defends his country, its traditions and identity - the very attributes, after all, that they value and admire in Donald Trump.Top picture credit: AFP / Getty ImagesBBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. You can now sign up for notifications that will alert you whenever an InDepth story is published - click here to find out how.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What Trump's vision of the new world order means for Europe",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cdd1/live/eb492840-ec7e-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-09T12:11:35.000Z",
      "dateModified": "2026-01-09T12:11:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oppenheimer",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002p1fr?at_mid=8PiucSontB&at_campaign=Oppenheimer&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002p1fr&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Oppenheimer&at_bbc_team=BBC&at_creation=Film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mlb4dr.jpg",
    "tag": "Trending",
    "date": "2025-12-21T23:52:18.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeOppenheimerOppenheimerContains some strong language and some sexual content.Deals with SuicideThe life of J Robert Oppenheimer, the physicist appointed by the US in the race to develop the atomic bomb before the Nazis. But winning that race comes at a cost. Duration2h 49mFirst shown2023Available for 11 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesCrimes of the FutureA new world is revealed. Viggo Mortensen stars in David Cronenberg's gory body-horror1h 38mOperation MincemeatDeception - the greatest weapon in war. True story of a daring plan that changed history1h 58mA Ghost Story for ChristmasNothing is what it seems… Mark Gatiss adaptation of MR James' spine-tingling tale29 minsUnforgivenThe acclaimed Oscar-winner with Gene Hackman. A retired gunslinger takes on one last job2h 2mElvisAustin Butler and Tom Hanks star in Baz Luhrmann's exhilarating portrait of an icon2h 26mThe Great EscaperLove, loyalty and spirit never grow old. Based on a true tale that captivated the world1h 30mFuneral in BerlinMichael Caine stars. Harry is in Berlin, with a wall between him and his next assignment1h 38mRaging BullRobert De Niro stars in Martin Scorsese's acclaimed brutal biopic of boxer Jake LaMotta2h 2mThe GodfatherA movie masterpiece. Al Pacino, Marlon Brando and one of the most acclaimed films ever2h 47mThe Godfather Part IIKeep your enemies closer. Betrayal complicates the family business for Michael Corleone3h 9mJawsYou'll never go in the water again... Steven Spielberg's iconic blockbuster with bite1h 59mHell or High WaterJustice isn't a crime. Two Texan brothers resort to dangerous measures to save the ranch1h 36m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oppenheimer",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mlb4dr.jpg"
      ],
      "datePublished": "2025-12-21T23:52:18.000Z",
      "dateModified": "2025-12-21T23:52:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Everything We Know About The Minneapolis ICE Shooting…So Far - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0msylv4?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-08T20:12:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·08 Jan 2026,·28 mins,·Everything We Know About The Minneapolis ICE Shooting…So FarNewscastAvailable for over a yearProtests are taking place in Minneapolis after a woman was fatally shot by a US ICE agent.\nAccounts of what exactly happened are conflicting, with the Trump Administration citing self-defence whilst law makers in the city and state of Minnesota are calling it a brazen act of force.\nAdam is joined by BBC North America correspondent, Anthony Zurcher, and BBC North America reporter, Madeline Halpert, who is on the ground and at the scene in Minneapolis.\nIn studio is BBC business editor Simon Jack, who got the scoop on the government’s latest change of heart about business rates for English pubs.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Shiler Mahmoudi and Chloe Scannapieco. The social producer was Beth Pritchard. The technical producer was Rohan Madison. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Everything We Know About The Minneapolis ICE Shooting…So Far - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-08T20:12:00.000Z",
      "dateModified": "2026-01-08T20:12:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - The fatal Minneapolis ICE shooting - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0msxs2k?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-01-08T18:19:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·08 Jan 2026,·29 minsAvailable for over a yearProtests have broken out in Minneapolis after a US immigration agent shot dead a 37-year-old woman in the city. \nVideos posted on social media show the moment of the shooting, in which ICE agents approach a car in the middle of a residential street. As it attempts to drive off, one of the agents points his gun at the driver and at least two shots are heard. \nWith the Trump administration characterising the incident as “domestic terrorism”, alleging Renee Good had “harassed” officers all day prior to the shooting, the mayor of Minneapolis has labelled this account “bullshit” and called on immigration officers to get out of the city. The governor of Minnesota, Tim Walz, is calling for a full investigation but says a fair outcome will be difficult because \"people in positions of power\" - naming Trump, Vice President JD Vance and Homeland Security Secretary Kristi Noem - have \"already passed judgement\". Walz says they've shared information that he says is \"verifiably false\" and \"inaccurate\" and made assumptions about Renee Good's character and actions ahead of the shooting.\nIn today’s episode, Justin, Sarah and Marianna discuss the reasons why Americans can’t agree on what happened in the videos posted to social media, and reflect on whether the shooting has the capacity to lead to a larger protest movement across the nation. And, as recent polling suggests more Americans are growing dissatisfied with some of the tactics used by ICE, we ask what it would take to change Donald Trump’s mind on his flagship deportations policy.\nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Marianna Spring, Social Media Investigations Senior Correspondent \nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by George Dabby with Alix Pickles. The technical producer was Rohan Madison. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - The fatal Minneapolis ICE shooting - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-01-08T18:19:00.000Z",
      "dateModified": "2026-01-08T18:19:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC News quiz of the week: Which sport helped Timothée Chalamet win a Best Actor award?",
    "url": "https://www.bbc.com/news/articles/c74w3qx4j5no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3328/live/716fc2a0-ecb9-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-08T18:45:01.000Z",
    "description": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationHealthCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch L",
    "body": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationHealthCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch Live18 hours agoThis week, the US shocked the world by seizing Venezuelan leader Nicolás Maduro in a raid on his home, high street retailer Claire's financial troubles continued, and actress Ashley Tisdale spoke out against \"toxic mom groups\".But how much attention did you pay to what else happened in the world over the past seven days?Quiz collated by Ben Fell.Fancy some more? Test your memory of 2025 with our quiz of the year, try last week's quiz, or have a go at something from the archives.FilmUnited States",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC News quiz of the week: Which sport helped Timothée Chalamet win a Best Actor award?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3328/live/716fc2a0-ecb9-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-08T18:45:01.000Z",
      "dateModified": "2026-01-08T18:45:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Philippines: One dead, dozens trapped after giant landfill collapses in Cebu",
    "url": "https://www.bbc.com/news/articles/c17zqz5pprwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3519/live/84246970-ed2f-11f0-b984-81fd88ec25bf.jpg",
    "tag": "Trending",
    "date": "2026-01-09T08:26:05.000Z",
    "description": "A mountain of rubbish collapsed at a landfill in the central Philippines on Thursday, killing a 22-year-old woman and leaving more than 30 people miss",
    "body": "A mountain of rubbish collapsed at a landfill in the central Philippines on Thursday, killing a 22-year-old woman and leaving more than 30 people missing, authorities have said.Rescuers pulled 12 injured sanitation workers from debris at the Binaliw Landfill in Cebu City, who were later hospitalised.Many of the missing are believed to be workers at the landfill. The mayor of Cebu told news outlet ABS-CBN that it may be difficult to reach survivors because of the potential for further collapse. The cause of the collapse is still unclear, but Cebu City councillor Joel Garganera said it was likely the result of poor waste management practices. Some 300 people from various government agencies and civilian groups have been deployed to the privately-owned landfill. Several excavators, ambulances and fire trucks have also been seen on site.\"All response teams remain fully engaged in search and retrieval efforts to locate the remaining missing persons,\" Cebu Mayor Nestor Archival said in a Facebook post on Friday.\"This is not like other landslides that you can just excavate. If you pull from the top, the bottom is soft. Let's say there is a person there, when you get the debris, it might get worse,\" he said, ABS-CBN reported.Cebu City councillor Joel Garganera said the incident may have happened suddenly, but was likely a result of poor waste management practices.Operators had been cutting into the mountain, mining the soil, and then piling garbage to form another mountain of waste, Garganera told local newspaper The Freeman.\"It's not a sanitary landfill. It's already an open dumpsite,\" he said.Families are waiting for updates on their loved ones trapped in the debris.One Binaliw resident, Belen Antigua, told Rappler that her son had survived the landslide but she was still waiting for her other relatives to be found. Another said that families had been gathered at the landfill to look for their children since Friday morning.\"I could not understand my emotions. They said those trapped are calling for help, so there is a possibility that my brother is still there,\" Michelle Lumapas, whose brother works at the landfill, told ABS-CBN.The Binaliw landfill is about 15 hectares (37 acres).Landfills are common in major Philippine cities like Cebu, which is the trading centre and transportation gateway of the Visayas, the archipelago nation's central islands.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Philippines: One dead, dozens trapped after giant landfill collapses in Cebu",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3519/live/84246970-ed2f-11f0-b984-81fd88ec25bf.jpg"
      ],
      "datePublished": "2026-01-09T08:26:05.000Z",
      "dateModified": "2026-01-09T08:26:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Elon Musk's Grok AI image editing limited to paid users after deepfakes",
    "url": "https://www.bbc.com/news/articles/c99kn52nx9do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3fa6/live/1942dce0-ed34-11f0-b984-81fd88ec25bf.jpg",
    "tag": "Trending",
    "date": "2026-01-09T10:46:15.000Z",
    "description": "2 hours agoLiv McMahonandLaura Cress,Technology reportersElon Musk's platform X has limited image editing with its AI tool Grok to paying users, after",
    "body": "2 hours agoLiv McMahonandLaura Cress,Technology reportersElon Musk's platform X has limited image editing with its AI tool Grok to paying users, after it came under fire for allowing people to make sexualised deepfakes.There has been a significant backlash after the chatbot honoured requests from users to digitally alter images of other people by undressing them without their consent.But Grok is now telling people asking it to make such material that only paid subscribers would be able to do so - meaning their name and payment information must be on file.The BBC has approached X for comment.Those who do not subscribe can still use Grok to edit images on its separate app and website.\"Musk has thrown his toys out of the pram in protest at being held to account for the tsunami of abuse,\" said Professor Clare McGlynn, an expert in the legal regulation of pornography, sexual violence and online abuse.\"Instead of taking the responsible steps to ensure Grok could not be used for abusive purposes, it has withdrawn access for the vast majority of users.\"And Hannah Swirsky, head of policy at the Internet Watch Foundation, said it \"does not undo the harm which has been done\".\"We do not believe it is good enough to simply limit access to a tool which should never have had the capacity to create the kind of imagery we have seen in recent days,\" she said.,The charity previously said its analysts had discovered \"criminal imagery\" of girls aged between 11 and 13 which \"appeared to have been created\" using Grok.\"Sitting and waiting for unsafe products to be abused before taking action is unacceptable,\" Swirsky said.It comes after the government urged regulator Ofcom to use all its powers – up to and including an effective ban – against X over concerns about unlawful AI images created on the site.Addressing concerns that sexualised images of adults and children had been generated by Grok, Prime Minister Sir Keir Starmer said it was \"disgraceful\" and \"disgusting\".He said Ofcom had the government's \"full support\" to act on the content.\"It's unlawful. We're not going to tolerate it. I've asked for all options to be on the table,\" he said in an interview with Greatest Hits Radio.Government sources told BBC News: \"We would expect Ofcom to use all powers at its disposal in regard to Grok and X.\"Ofcom's powers under the Online Safety Act include being able to seek a court order to prevent third parties from helping the Elon Musk-owned platform raise money or be accessed in the UK.The BBC has approached the regulator for comment.Grok is a free tool which users can tag directly in posts or replies under other users' posts to ask it for a particular response.But the feature has also allowed people to request it to edit images - and ask it to digitally strip people of most of their clothing.Grok has fulfilled many user requests asking it to edit images of women to show them in bikinis or little clothing - something those subject to such requests have told the BBC left them feeling \"humiliated\" and \"dehumanised\".However as of Friday morning, Grok has told users asking it to alter images uploaded to X that \"image generation and editing are currently limited to paying subscribers\".It adds users \"can subscribe to unlock these features\".Some posts on the platform seen by BBC News suggest only those with a blue tick \"verified\" mark - exclusive to X's paid subscriber tier - were able to successfully request image edits to Grok.Dr Daisy Dixon, a female X user who said she had seen an increase in people using Grok to undress her, welcomed the change but said it felt \"like a sticking plaster\".\"Grok needs to be totally redesigned and have built-in ethical guardrails to prevent this from ever happening again,\" she told the BBC.\"Elon Musk also needs to acknowledge this for what it is - yet another instance of gender-based violation.\"Prof McGlynn said X's move echoed its approach to pornographic Taylor Swift deepfakes on the platform last year - where it blocked searches for sexualised material generated of the popstar using a Grok AI video feature.\"He is doing this to stoke free speech arguments,\" she added. \"He will claim regulation is stifling people's use of this technology. But, all the regulation requires is that he takes necessary precautions to reduce harm.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elon Musk's Grok AI image editing limited to paid users after deepfakes",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3fa6/live/1942dce0-ed34-11f0-b984-81fd88ec25bf.jpg"
      ],
      "datePublished": "2026-01-09T10:46:15.000Z",
      "dateModified": "2026-01-09T10:46:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Two people wounded in shooting involving federal agents in Portland",
    "url": "https://www.bbc.com/news/articles/ckgn1y1zygxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c03b/live/c4d2bdd0-ecfa-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-09T02:51:30.000Z",
    "description": "Two people have been wounded in a shooting involving US federal agents in Portland, Oregon, say officials.The city's police department said in a state",
    "body": "Two people have been wounded in a shooting involving US federal agents in Portland, Oregon, say officials.The city's police department said in a statement that a man and woman had been taken to hospital and their conditions were unknown. The Department of Homeland Security (DHS) said the incident happened at 14:19 local time (22:19 GMT) with the traffic stop of a Venezuelan gang member, who \"attempted to run over\" agents with his car.The incident comes a day after a federal agent fatally shot a woman in Minneapolis, triggering protests around the US against federal law enforcement operations in US cities.\"The passenger of the vehicle and target is a Venezuelan illegal alien affiliated with the transnational Tren de Aragua prostitution ring and involved in a recent shooting in Portland,\" DHS said in a statement posted on X.\"When agents identified themselves to the vehicle occupants, the driver weaponized his vehicle and attempted to run over the law enforcement agents.\"Fearing for his life and safety, an agent fired a defensive shot. The driver drove off with the passenger, fleeing the scene.\"Portland Police said in their own statement that their officers were not involved in the incident, and were called after receiving reports of a shooting. The two people who were shot have not been identified, and police say they were discovered several blocks from the scene of the shooting.\"Officers applied a tourniquet and summoned emergency medical personnel,\" before they were taken to hospital, the statement said, adding that \"their conditions are unknown\".US media has cited police sources as saying the man and woman who were shot were a married couple. Portland District Attorney Nathan Vasquez, speaking from the scene of the shooting, told reporters he was there \"to monitor, to assist, and to make sure that there's a thorough and complete investigation\".He pledged to ensure \"that evidence is fully preserved and that - we're certainly hoping - that we can get all of the facts about what transpired here today\".His comments come after officials in Minnesota announced that the FBI would not include local investigators in their probe of the death on Wednesday of Renee Nicole Good, who was shot after officers alleged she attempted to run over agents. \"We are still in the early stages of this incident,\" said Portland Police Chief Bob Day on Thursday.\"We understand the heightened emotion and tension many are feeling in the wake of the shooting in Minneapolis, but I am asking the community to remain calm as we work to learn more.\"He told a news conference later the investigation into the incident in the Hazelwood neighbourhood was being led by the FBI.Portland Mayor Keith Wilson, a Democrat, called on Immigration and Customs Enforcement (ICE) to halt all operations in the city pending the investigation.\"We know what the federal government says happened here,\" he said. \"There was a time when we could take them at their word. That time is long past.\"He added: \"The administration is trying to divide us, to pit communities against each other. Portland, this is a moment to hold each other close.\"Portland has been the site of large anti-Trump protests in the past. On Wednesday night, Portland police arrested one protester who was charged with menacing after officers found him allegedly threatening another person with a knife.Lew Frederick, a Democratic state senator, told the BBC that local officials must be involved in the investigation into Thursday's shooting otherwise \"the community isn't going to trust that those results aren't impartial\".\"It's been clear for many weeks that there has been tensions increasing, and tense situations on the street,\" he said, referring to ongoing protests in the city against the Trump administration.\"And unfortunately, I do think, the, the resulting tragedy that occurred was foreseeable.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two people wounded in shooting involving federal agents in Portland",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c03b/live/c4d2bdd0-ecfa-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-09T02:51:30.000Z",
      "dateModified": "2026-01-09T02:51:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Catherine marks birthday with message on healing power of nature",
    "url": "https://www.bbc.com/news/articles/c394vykk4dgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f319/live/68e86210-ed4d-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-09T11:57:50.000Z",
    "description": "31 minutes agoSean CoughlanRoyal correspondentThe Princess of Wales has marked her 44th birthday with a personal video on social media about the heali",
    "body": "31 minutes agoSean CoughlanRoyal correspondentThe Princess of Wales has marked her 44th birthday with a personal video on social media about the healing power of nature and the seasons.\"Even in the coldest, darkest season, winter has a way of bringing us stillness, patience and quiet consideration,\" said Catherine.This is the concluding video in a four-part series, which has seen Catherine reflecting on the importance of nature to her, at a time when she has been recovering after cancer treatment.\"To be at one with nature, a quiet teacher and a soft voice that guides... Helping us to heal,\" she says, appearing wrapped up in a coat and hat in the winter scenes.The video series, which began in the spring, has carried Catherine's personal and poetic thoughts on the positive impact of the natural world, over images of the changing seasons.This latest video shows winter scenes around the UK, in woodlands, mountains and a murmuration of starlings over the sea.\"I find myself reflecting on how deeply grateful I am,\" says Catherine, who is shown walking in woods and putting her hand in a stream, in a video filmed in Berkshire, Cumbria, Gloucestershire, East Sussex and the Cotswolds.In the wake of her recovery from cancer, the princess has spoken about the importance of kindness, calm and limiting the overuse of social media and mobile phones in a digital world.She has also talked about nature's role in improving people's sense of wellbeing, both mentally and physically. This sense of connection with nature has been framed in almost spiritual and mystical terms. \"For the rivers within us flow with ease, fears washed away, cleanse and purify. Come to peace with our tears and discover what it means to be alive,\" she says.Catherine, in a social media post, described the video project on the seasons as a \"deeply personal, creative reflection on how nature has helped me heal\". \"But it is also a story about the power of nature and creativity in collective healing\", she wrote.\"There is so much we can learn from mother nature, as we look to build a happier, healthier world.\"On the theme of health, Catherine visited Charing Cross Hospital on Thursday, along with her husband Prince William, where they showed support for the efforts of NHS staff.In a conversation with the volunteers, who were from Imperial Health Charity, Catherine spoke about how their work can sometimes go \"unrecognised\".She said: \"Sometimes the skills, the soft skills, the empathy and compassion, the kindness, goes beyond any job description.\"And it makes such a difference to patients and it often goes unrecognised.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Catherine marks birthday with message on healing power of nature",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f319/live/68e86210-ed4d-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-09T11:57:50.000Z",
      "dateModified": "2026-01-09T11:57:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oreshnik ballistic missile fired in fresh strikes on Ukraine",
    "url": "https://www.bbc.com/news/articles/cgqe9kv9xxvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0600/live/5d755580-ed2c-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-09T11:26:38.000Z",
    "description": "Russia hits Ukraine with rarely used Oreshnik missile in fresh strikes1 hour agoLaura GozziKyivReutersFour people were killed in Kyiv and 25 others in",
    "body": "Russia hits Ukraine with rarely used Oreshnik missile in fresh strikes1 hour agoLaura GozziKyivReutersFour people were killed in Kyiv and 25 others injured, authorities saidRussia has used the Oreshnik ballistic missile as part of a massive overnight strike on Ukraine.Four people were killed and 25 others injured in Kyiv on Thursday night, where loud booms could be heard for several hours, setting the sky alight with explosions.It is only the second time that Moscow has used the Oreshnik, which was first deployed to hit the central city of Dnipro in November 2024.Russia's defence ministry said the strike was a response to a Ukrainian drone attack targeting Vladimir Putin's residence in late December, which Kyiv denies carrying out.While the ministry did not specify what had been the Oreshnik's target, shortly before midnight (22:00 GMT) videos began circulating on social media showing numerous explosions on the outskirts of the western city of Lviv.President Volodymyr Zelensky and Ukrainian authorities confirmed that a ballistic missile had struck infrastructure in Lviv, about 60km (40 miles) from the Polish border.The Oreshnik is an intermediate-range, hypersonic ballistic missile, meaning it can potentially reach up to 5,500km (3,417 miles). It is thought to have a warhead that deliberately fragments during its final descent into several, independently targeted inert projectiles, causing distinctive repeated explosions moments apart.\"Such a strike close to EU and Nato border is a grave threat to the security on the European continent and a test for the transatlantic community,\" Ukrainian foreign minister Andrii Sybiha said. The strike was launched \"in response to [Putin's] own hallucinations,\" he added, referring to the alleged drone attack on the president's residence in December. The EU had immediately cast serious doubt on whether the drone strike ever happened, and last week Donald Trump said he did not think any such attack had taken place.On Friday EU foreign policy chief Kaja Kallas said Russia's Oreshnik strike was meant as a warning to Europe and the US. \"Putin doesn't want peace, Russia's reply to diplomacy is more missiles and destruction. This deadly pattern of recurring major Russian strikes will repeat itself until we help Ukraine break it,\" she wrote on X.Zelensky said in addition to the Oreshnik, 13 ballistic missiles targeted energy facilities and civilian infrastructure overnight, along with 22 cruise missiles and 242 drones.One damaged a building at the Qatari embassy, he added.He accused the attacks of aiming \"against the normal life of ordinary people\" during a cold spell and added everything possible was being done to restore heating and electricity.As Lviv and other western regions were targeted on Thursday night, more than a dozen missiles and hundreds of drones were deployed during the attack on Kyiv.A paramedic was among those killed while arriving at a damaged apartment in Kyiv. The capital's mayor, Vitali Klitschko, and Zelensky said it had been a \"double-tap\" hit – in which the first strike is followed by a second, killing rescuers who have arrived to help the injured.Two apartment buildings along the east bank of the Dnipro River and a high-rise building in the city's central district were also targeted.The power supply was disrupted in several of the city's neighbourhoods in the middle of a particularly harsh winter and as Kyiv braces for -15C (5F) temperatures this weekend.On Friday Klitschko urged Kyiv residents to leave temporarily if they were able to, and find warmth. \"Half of Kyiv's apartment buildings - nearly 6,000 - are currently without heat due to damage to the capital's critical infrastructure caused by a massive enemy attack,\" he wrote on social media.\"I also appeal to residents of the capital who have the opportunity to temporarily leave the city for places with alternative sources of power and heat to do so.\"The targeting of power plants has become a constant feature of this war, with Ukraine increasingly responding in kind to Russia's sustained attacks on energy infrastructure that regularly leave millions without access to electricity or heating.On Thursday night, as Moscow's attack on Ukraine was ongoing, half a million people in the Russian region of Belgorod were left without power following Ukrainian shelling of infrastructure, the local governor said. Authorities also said that a Ukrainian strike on a Russian power plant in the city of Oryol, further north, affected the water and heating systems. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oreshnik ballistic missile fired in fresh strikes on Ukraine",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0600/live/5d755580-ed2c-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-09T11:26:38.000Z",
      "dateModified": "2026-01-09T11:26:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tonteg woman who got stuck in shop shutters in viral TikTok clip dies",
    "url": "https://www.bbc.com/news/articles/c39pry4wzrvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/095d/live/1d5c3c10-ed3c-11f0-b5f7-49f0357294ff.png",
    "tag": "Trending",
    "date": "2026-01-09T06:14:40.000Z",
    "description": "When Anne Hughes arrived for her cleaning shift at the Best One store in Tonteg, Rhondda Cynon Taf, in March 2024, the last thing she expected was to ",
    "body": "When Anne Hughes arrived for her cleaning shift at the Best One store in Tonteg, Rhondda Cynon Taf, in March 2024, the last thing she expected was to find fame.But when CCTV captured her being hoisted into thin air by the shop's shutters, TikTok went into overdrive - and Anne, then aged 72, was thrust into the limelight.As a reporter sent to cover the story, I was lucky enough to strike up a great relationship with Anne. She was kind, warm, funny and a reluctant star. In the end, the BBC was the only news organisation she agreed to speak to on camera, and she and I kept in touch.When I received a message from her granddaughter to say that Anne - a mother and grandmother - had died, I was shocked and saddened.The 31-second clip of Anne, showing her being hoisted into the air by her coat while still clutching her shopping trolley, was initially shared on the shop's TikTok account where it was viewed millions of times.I tracked Anne down in the days that followed. Initially she did not want to be interviewed but did allow me to make an audio recording on my phone that I could take some notes from.She told me: \"When I realised my coat had caught and I was going up, I thought I'm going up and I went right up. I was screaming the owner of the shop's name, but he couldn't hear me.\"Thank goodness he finally heard me.\"\"I'll never hear the end of it,\" she added, laughing: \"My grandchildren ask me why I am holding on to my trolley and I say I just don't know.\"Thankfully, after a nice chat, Anne agreed that we could use the recording on the BBC.The interview, and the famous CCTV, ended up not just on the Welsh news but on the network news too. The Instagram video alone has been viewed at least 50 million times.I was worried about the impact this attention might have had on Anne and went to see her a few days later to give her a thank you card which had \"you're a star\" printed on the front.Anne loved it - if not the fame.Ten days later, street artist Tee2Sugars curated a mural of the viral CCTV moment on the very same shop shutters, describing it as an opportunity \"too good to pass up\".Anne then agreed to appear on camera for me one final time, this time next to the shutters.\"Only because I like you, and don't forget my Christmas and birthday cards from now on,\" she said to me.Anne described the mural as \"beautiful\", with a wry smile on her face.I last went to see her at Easter, to present her with some flowers and to tell her that I'd been nominated for an award for the coverage of her viral moment.We didn't win, but Anne was more impressed with the flowers.Just before Christmas, Anne's granddaughter Lily contacted BBC Wales with the sad news of Anne's death.Lily told me and my colleagues in a message: \"Thank you for making her smile.\"Anne managed to bring a smile and a laugh to millions, and I'm glad I managed to make her smile too.I've written this piece, and re-shared Anne's viral CCTV moment, with the blessing of her family.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tonteg woman who got stuck in shop shutters in viral TikTok clip dies",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/095d/live/1d5c3c10-ed3c-11f0-b5f7-49f0357294ff.png"
      ],
      "datePublished": "2026-01-09T06:14:40.000Z",
      "dateModified": "2026-01-09T06:14:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dylan Thomas 'plagiarised other poets' repeatedly as schoolboy",
    "url": "https://www.bbc.com/news/articles/czejdpy81k0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/98be/live/9af16940-ec95-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-09T06:12:32.000Z",
    "description": "6 hours agoSteve DuffyBBC WalesGetty Images/Hulton ArchiveDylan Thomas, whose most famous works include Under Milk Wood, died in 1953Dylan Thomas copi",
    "body": "6 hours agoSteve DuffyBBC WalesGetty Images/Hulton ArchiveDylan Thomas, whose most famous works include Under Milk Wood, died in 1953Dylan Thomas copied other poets' work and published it under his own name as a schoolboy, according to an author and publicist who has delved into the iconic Welsh poet's earliest works.Alessandro Gallenzi made the shock plagiarism discovery, which he described as \"wholesale\", while he was editing a new collection of Thomas's poetry.The young Thomas was an enthusiastic contributor to Swansea Grammar School's magazine after joining as an 11-year-old in 1925, but Gallenzi found at least a dozen examples where Thomas had copied wholesale from work published in other magazines.\"It's incredibly interesting, from a biographical, personal and psychological perspective,\" he said.Getty ImagesDylan Thomas, pictured with his wife Caitlin  The discovery was first made by Gallenzi's editor Alex Middleton, after they were given access to one of only two known complete collections of Thomas's school magazine in Swansea owned by Geoff Haden, president of the Dylan Thomas Society.But after transcribing the poems and looking more closely at them, they were not all they seemed.\"My heart stopped,\" said Gallenzi. \"We were close to finishing the collection and we had to go back and start from scratch.\"They discovered that 12 poems published while Thomas was at school were someone else's work - and Gallenzi said he believed there could be as many as 20 to 24.Most are in the pages of the school magazine, but the extent of the plagiarism included His Requiem, submitted by D M Thomas of Swansea and published in the Western Mail newspaper on 14 January 1927, which dated from five years before and was a poem by Lillian Gard, first published in the Boy's Own Paper.\"It was unlikely his readers would notice,\" said Gallenzi. \"But Thomas could also be audacious - we found a poem which he managed to get published himself in Boy's Own - and remember this was a nationally-read magazine - but was a copy of a poem already published in Boy's Own 15 years before.\"Alma BooksAlessandro Gallenzi says the discovery is significant to our understanding of Dylan Thomas's formative yearsWho was Dylan Thomas?Born on 27 October 1914 in Swansea, Thomas was the son of an English teacher and a seamstress.He started writing poetry while still at school and became a reporter on the Swansea Daily Post.He moved to London in 1934 when his first poetry collection was published.He married Caitlin Macnamara in 1937 and they lived at Laugharne in Carmarthenshire, having a tempestuous relationship.His collection of stories Portrait of the Artist as a Young Dog was published in 1940.His most famous poems include Do Not Go Gentle Into That Good Night, musing on death and dating from 1947.His play Under Milk Wood was first read on stage in New York in May 1953.Dylan collapses and later dies in hospital on 9 November 1953. He was buried in Laugharne.Gallenzi said: \"The fascinating question is, why did he do it and trying to understand this.\"He believes it could be due to insecurity, trying to get noticed, and helped by the fact that Thomas could get away with it.He said Thomas had started a new, much bigger school and may have been looking to stand out or impress his fellow pupils. He had his first poem published in the school magazine in his first year and later edited the publication.Another factor, said Gallenzi, was probably the looming presence of Thomas's father, who was a teacher of English at the school and had ambitions for his son.'Something to show his father'The young Thomas had also started to write his own poetry and there is an overlap between his original and plagiarised work. \"He found his own voice and his voice is unique,\" said Gallenzi.The plagiarised work now finds its place in an appendix to the forthcoming collection Dylan Thomas - The Complete Poems.Gallenzi, in his editor's introduction, said they revealed \"his mood, ambition and, perhaps, impishness at a time when he was starting out as a poet\".A couple of the school magazine poems - alongside the Boy's Own originals - will be on display from this weekend at Dylan's birthplace museum, 5 Cwmdonkin Drive in Swansea.The museum's curator Geoff Haden said he was not surprised by the revelation, as he was aware of a couple of examples of plagiarism by the schoolboy Thomas. \"The more I look at it, the more it's obvious,\" said Haden.\"I think he wanted something to show his father and to stop him nagging him about doing homework in other subjects.\"More top stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dylan Thomas 'plagiarised other poets' repeatedly as schoolboy",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/98be/live/9af16940-ec95-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-09T06:12:32.000Z",
      "dateModified": "2026-01-09T06:12:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Premier League highlights: Arsenal 0-0 Liverpool",
    "url": "https://www.bbc.com/sport/football/videos/cx2wq1jdzqjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/8336/live/e03e98b0-ece5-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-08T23:07:46.000Z",
    "description": "Arsenal miss the chance to move eight points clear at the top of the Premier League after they are held to a frustrating goalless draw by Liverpool.MA",
    "body": "Arsenal miss the chance to move eight points clear at the top of the Premier League after they are held to a frustrating goalless draw by Liverpool.MATCH REPORT: Arsenal 0-0 LiverpoolAvailable to UK users only.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Premier League highlights: Arsenal 0-0 Liverpool",
      "image": [
        "https://ichef.bbci.co.uk/ace/standard/1024/cpsprodpb/8336/live/e03e98b0-ece5-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-08T23:07:46.000Z",
      "dateModified": "2026-01-08T23:07:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oysters: The 'ocean superhero' species in seabed first for NI",
    "url": "https://www.bbc.com/news/articles/c3wz8qzv1zwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/af3d/live/f33f5d60-ec8f-11f0-abc2-c92f19f0499a.jpg",
    "tag": "Trending",
    "date": "2026-01-09T06:16:10.000Z",
    "description": "The 'superhero' oyster species helping to clean water6 hours agoLouise CullenAgriculture and environment correspondent, BBC News NIBBCDr Nick Baker-Ho",
    "body": "The 'superhero' oyster species helping to clean water6 hours agoLouise CullenAgriculture and environment correspondent, BBC News NIBBCDr Nick Baker-Horne says this is \"a significant step forward\" in helping to restore the oysters Thousands of European oysters have been placed on the Belfast Lough seabed, in a bid to bring back native reefs that had almost disappeared.The 2,000 adult oysters and 30,000 juveniles - called spat on shells - were brought to Belfast from a nursery in Scotland to support the return of the species.It is part of efforts by Ulster Wildlife to restore the once-abundant native oyster beds that help provide clean water and healthy fisheries.The charity's marine conservation manager Dr Nick Baker-Horne said it marked \"a significant step forward in helping to restore this small but mighty ocean superhero\".Not suitable for consumption The adult oysters are placed in biodegradable bags made from potato starch that dissolve harmlessly over timeThis seabed deployment is a first for Northern Ireland.Several native oyster nurseries have been created at Bangor Marina, Belfast Harbour, Glenarm and Carrickfergus.In Belfast Lough, the oysters are placed on the seabed to form a natural reef over time and potentially provide habitat for spat from the nurseries to settle on.After measuring a sample, staff and volunteers from Ulster Wildlife put the oysters in biodegradable potato starch bags for laying on the seabed.Some 2,000 adult oysters will go onto the seabedNone of the oysters are suitable for consumption.Instead, Baker-Horne pointed out, their purpose is purely environmental – removing nutrients from water and supporting countless other species in the reefs that they form.\"Oysters are a missing habitat, a missing species, that do fantastic things for biodiversity but also have some really fantastic supports for our environment,\" Baker-Horne said.These include \"improving water quality, defending our coasts from big waves and also supporting juvenile fish as a fantastic habitat for those commercially important fish species\".Water quality issues'They're a little nursery for baby fish and crabs'Jess Sennett-Seale says the oysters \"act as a little nursery for lots of different baby fish\"As filter feeders, shellfish like oysters contribute to improving water quality.Jess Sennett-Seale, a Marine Restoration Assistant with the Oyster Project, said that's not all they do.\"They also provide habitat because they build reefs together so they form clusters and that is really important not only for stopping wave energy and stabilising our shores and stopping so much coastal erosion, but it also forms habitats for baby animals.\"So they act as a little nursery for lots of different baby fish and crabs and other invertebrates.\"'First' for Northern IrelandThe native oyster all but disappeared from Belfast Lough in the early 20th Century, due to over-fishing, pollution and habitat loss.Outbreaks of typhoid at the time were, in part, blamed on sewage pollution of the water, contaminating the shellfish that were a large part of the diet for poorer communities.Laws were then introduced prohibiting the gathering of any shellfish from Belfast Lough for consumption.To this day, recreational fishing for shellfish in Belfast Lough remains forbidden.Simon Gibson says the oysters are a \"great way to help boost the biodiversity in Belfast Lough\"While these oysters will not be eaten, this \"first of its kind in Northern Ireland\" project has been a labour of love for Belfast Harbour's Marine Environment and Biodiversity Officer Simon Gibson, despite the challenges.\"It was a bit of a process trying to figure out how we can get this off the ground, working with Daera and the Crown Estate as well.\"It's a great way to help boost the biodiversity in Belfast Lough, as well as looking at nature-based solutions for tackling water quality and biodiversity issues.\"He said the oysters are great for improving water quality.\"I'm very excited now it's actually happening and I think it'll be a good way as a pilot programme that can be expanded in the future,\" he added.The project is supported by Ulster Wildlife members, Belfast Harbour and the Department of Agriculture, Environment and Rural Affairs via the Carrier Bag Levy.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oysters: The 'ocean superhero' species in seabed first for NI",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/af3d/live/f33f5d60-ec8f-11f0-abc2-c92f19f0499a.jpg"
      ],
      "datePublished": "2026-01-09T06:16:10.000Z",
      "dateModified": "2026-01-09T06:16:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]