[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Global Story - How the US, China and Russia are vying for influence in Africa - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct719w?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mv2yfp.jpg",
    "tag": "Trending",
    "date": "2026-01-15T10:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·15 Jan 2026,·27 minsAvailable for over a yearWhen the leaders of the US, China and Russia look at Africa today, they see huge opportunity – an abundance of natural resources and a skilled, young population. But what does it mean for the continent when African presidents allow these superpowers the influence and investment they want? \nAll this week, we’re teaming up with our BBC sister podcasts to explore how power and influence around the world is shifting. We’re talking about which countries have a sphere of influence, and which countries are in someone else’s. \nIn today’s episode, we speak to Charles Gitonga from the BBC’s Focus on Africa podcast about three countries in Central Africa which have found themselves at the at the centre of a geopolitical tug of war. \nProducers: Hannah Moore, Aron Keller and Lucy Pawle \nExecutive producer: James Shield \nMix: Travis Evans \nSenior news editor: China Collins \nPhoto: A soldier with the M23 armed group stands guard in Bukavu, South Kivu, Democratic Republic of the Congo. Credit: Marie Jeanne Munyerenkana/EPA-EFE/REX/Shutterstock.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Global Story - How the US, China and Russia are vying for influence in Africa - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mv2yfp.jpg"
      ],
      "datePublished": "2026-01-15T10:00:00.000Z",
      "dateModified": "2026-01-15T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Jenrick Joins Reform! - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mv8m8v?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-15T19:29:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·15 Jan 2026,·22 minsAvailable for over a yearIn the 2000th episode of Newscast, Adam and Chris return for second helpings as Robert Jenrick’s defection to Reform is confirmed.\nFollowing his dramatic sacking via social media this morning, Jenrick appeared on stage with Reform leader Nigel Farage this afternoon to announce that he was joining the party.\nFarage told reporters that although they had been negotiating the possibility of Jenrick joining Reform - the deal wasn’t done until Kemi Badenoch made her move this morning. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Shiler Mahmoudi and Chloe Scannapieco. The social producer was Beth Pritchard. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Jenrick Joins Reform! - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-15T19:29:00.000Z",
      "dateModified": "2026-01-15T19:29:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'Sacked Jenrick defects' and 'Traitories' ",
    "url": "https://www.bbc.com/news/articles/c99km7ym748o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fbc3/live/12cbae90-f271-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-16T01:42:14.000Z",
    "description": "3 hours agoRobert Jenrick's defection to Reform UK features heavily on Friday's front pages. The former Conservative shadow minister, who was sacked b",
    "body": "3 hours agoRobert Jenrick's defection to Reform UK features heavily on Friday's front pages. The former Conservative shadow minister, who was sacked by Kemi Badenoch for plotting against her, has become the \"most senior Tory to switch to Reform\", the Guardian reports. Jenrick has called the Conservatives \"rotten\" and a \"failed\" party. The Sun dramatically imagines Farage, Badenoch and \"banished Jenrick\" as part of the hugely popular TV show The Traitors, with the headline \"Traitories\" in front of the two men dressed in green cloaks. The paper describes Badenoch's actions as she \"banished her former leadership rival\". Similarly, the Metro reports that the \"shock Tory defection echoes the drama on TV\". An edited photo of Jenrick draped in a red clock as \"the secret traitor\" features on the paper's front page. Badenoch raises her glass on i Paper's front page on a \"day of poison and betrayal\" following the exiling of \"her rival Jenrick\". According to the paper, someone close to the former Conservative shadow minister revealed his plan of wanting to join Reform UK to the Tory leader. A smiling Jenrick shaking hands with an elated Nigel Farage is featured as the main image on the Independent. A \"gloating Farage\" thanks Badenoch for \"jumping the gun\" and delivering Robert Jenrick to Reform \"on a plate\", the paper reports.The Daily Mirror dubs Reform UK a \"party of Tory failures\" and asks \"would you trust any of them?\" Badenoch says \"bad people are leaving my party\" after the Tory leader sacked Jenrick, the Daily Express reports. The paper headlines on Jenrick's \"blast at 'rotten Tories'\".The Times reports on the former shadow justice secretary secretly negotiating with Farage \"for four months\" before he was sacked by Badenoch. The paper says the Conservative leader \"pre-emptively dismissed\" Jenrick after discovering \"irrefutable evidence he was plotting to join Reform\". Jenrick's declaration that his former party \"broke Britain\" makes the headline on the front of the Telegraph. The Daily Mail uses their front page to send a message to Reform and the Tories to \"stop fighting each other\" and \"end the Labour nightmare\". A \"line of fire\" of ICE agents in Minneapolis looms large at the top of the Financial Times. Nigel Farage being pranked into making a Cameo video is the focus of the Daily Star's front page. Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'Sacked Jenrick defects' and 'Traitories' ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fbc3/live/12cbae90-f271-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-16T01:42:14.000Z",
      "dateModified": "2026-01-16T01:42:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Iran protests: Authorities demanding large sums for return of protesters' bodies, BBC told",
    "url": "https://www.bbc.com/news/articles/c4g5md1n1yxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/49b1/live/89b0ed90-f24e-11f0-925d-b90aaf352e12.jpg",
    "tag": "Trending",
    "date": "2026-01-15T20:19:13.000Z",
    "description": "Families of people killed in the protests in Iran have told the BBC that the authorities are demanding large sums of money to return their bodies for ",
    "body": "Families of people killed in the protests in Iran have told the BBC that the authorities are demanding large sums of money to return their bodies for burial. Multiple sources have told BBC Persian that bodies are being held in mortuaries and hospitals and that security forces will not release them unless their relatives hand over money. At least 2,435 people have been killed during more than two weeks of protests across the country.  One family in the northern city of Rasht told the BBC that security forces demanded 700 million tomans ($5,000; £3,700) to release the body of their loved one. It was being held at the Poursina Hospital mortuary, along with at least 70 other dead protesters, they said. Meanwhile in Tehran, the family of a Kurdish seasonal construction worker went to collect his body, only to be told they must pay a billion tomans ($7,000; £5,200) to receive it. The family told the BBC that they could not afford the fee and were forced to leave without their son's body. A construction worker in Iran typically earns less than $100 a month. In some cases, hospital staff have phoned the relatives of the dead to give them an advance warning to come and get the bodies before security forces can extort any funds. BBC Persian has been told about a woman - who we are not identifying for her safety - who did not know her husband was killed until she received a phone call on 9 January on his phone from hospital staff. They told her she should quickly come and collect his body before security forces arrived and demanded payment for its release. BBC Persian was told about this situation by a London-based relative, who has spoken to her. The woman then took her two children to the hospital to find her husband's body.  She put it in the back of a pickup truck, and drove for seven hours to their hometown in western Iran to bury him. \"I rode in the back of the pickup truck, crying over his body for seven hours while my children sat in the front seat,\" she told her London relative. BBC Persian has also received reports that officials at Tehran's Behesht-e Zahra mortuary are telling families that if they claim their child was a member of the Basij paramilitary force and was killed by protesters, the body will be released without charge.The family member told the BBC in a message: \"We were asked to participate in a pro-government rally and portray the body as that of a martyr. We did not agree to this.\"In another case in Tehran, a source told BBC Persian that several families broke into a mortuary to retrieve bodies out of fear they would be taken away by the authorities. \"Several families, fearing that the authorities might keep the bodies or bury them without their knowledge, broke open the morgue door and pulled the bodies out of  ambulances,\" the source told the BBC. The families then guarded the bodies for several hours on the ground in the hospital courtyard to prevent them from being taken away until they could find private ambulances to transport them, the source said. An internet and communications blackout has made it difficult to get a full picture of what is happening on the ground. International human-rights groups have no direct access to the country and, along with other international news organisations, the BBC is not allowed by the Iranian government to report on the ground.Demonstrations began in the capital, Tehran, on 29 December, following a sharp fall in the value of the Iranian currency against the dollar. As the protests reached dozens of other towns and cities, they turned against Iran's clerical rulers and security forces launched a violent crackdown. The protests escalated significantly last Thursday and were met with deadly force by authorities. According to the US-based Human Rights Activists News Agency (HRANA), at least 2,435 protesters have been killed since the unrest began, as well as 13 children and 153 people affiliated with the security forces or government. It reports that another 18,470 protesters have been arrested.Meanwhile, arrests have continued across the country. Security forces and Revolutionary Guard intelligence units have detained activists, lawyers, and ordinary citizens. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iran protests: Authorities demanding large sums for return of protesters' bodies, BBC told",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/49b1/live/89b0ed90-f24e-11f0-925d-b90aaf352e12.jpg"
      ],
      "datePublished": "2026-01-15T20:19:13.000Z",
      "dateModified": "2026-01-15T20:19:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Swiss bar employee who reportedly held sparkler unaware of dangers, family says",
    "url": "https://www.bbc.com/news/articles/ckgvjnxpp9zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/eca3/live/27fcb860-f229-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-15T18:45:36.000Z",
    "description": "A staff member who was working at the Swiss bar where a deadly fire broke out on New Year's Eve received no safety training and was unaware of the dan",
    "body": "A staff member who was working at the Swiss bar where a deadly fire broke out on New Year's Eve received no safety training and was unaware of the danger posed by the ceiling that caught alight, her family's lawyer has alleged.Cyane Panine, 24, died in the fire at Le Constellation bar in Crans Montana and was widely identified in a video wearing a helmet and holding a champagne bottle with a sparkler attached when the ceiling caught fire.The bar's French owners, Jacques and Jessica Moretti, have been accused by authorities of manslaughter by negligence, bodily harm by negligence and arson by negligence.Forty people were killed and 116 were injured in the blaze in southwest Switzerland.Pope Leo XIV met relatives of some of those killed in the disaster on Thursday and said he was \"very moved and distraught\" to talk to them at the Vatican. \"Where can one find a consolation equal to what you are experiencing?\" he asked.Sophie Haenni, the lawyer representing Cyane Panine's family, told the BBC she \"wasn't supposed to be serving tables\" on the night of the fire but had been asked to go downstairs to help manage high demand for bottles. \"It wasn't Cyane herself who decided to put on this helmet, it was at the request of her employers. She was just doing her job.\" It is shocking to place the responsibility for their own failings on Cyane, a 24-year-old woman and their own employee\".Ms Haenni added that Cyane Panine had never been informed \"of the ceiling's danger and received no safety training\".A source who has seen the inquiry documents said that Jessica Moretti told investigators they had used sparklers in champagne bottles for the past 10 years. \"It wasn't the first time she'd done it, putting herself on someone else's shoulders,\" Ms Moretti told them. \"She did it on her own initiative.\"In a statement, Sophie Haenni said the casualties \"could have been avoided\" if \"safety standards (particularly regarding materials) had been followed and the required inspections carried out\". She added: \"Cyane is undoubtedly a victim.\" The Panine family's lawyers also say she \"felt used\" and was \"suffering from her working conditions\".\"[Cyane Panine] expressed her incomprehension at the lack of empathy and understanding from her employers\" in regards to her workload, the statement adds.\"My clients have lost their daughter, their sister. A loved one, a wonderful person, has been stolen from them,\" the statement says.The BBC has contacted lawyers for Jacques and Jessica Moretti for a response.On Wednesday, a Swiss court imposed a travel ban on Jessica Moretti as an alternative to pre-trial detention due to what prosecutors claim is a \"risk of flight\". She has had to surrender her passport and must report to police every day, authorities say.She previously told reporters that she was sorry about the \"unthinkable tragedy\".Jacques Moretti is being held in custody for an initial period of 90 days. Prosecutors have also argued that he is a flight risk.Initial findings from the investigation into the blaze suggest that it was caused by sparklers igniting soundproof foaming that lined the ceiling.Authorities have acknowledged that the bar in the popular ski resort had not undergone safety checks for five years.The Swiss canton of Valais has now banned pyrotechnic devices in all indoor public venues.Authorities said each of the victims would get a 10,000 franc ($12,500; £9,200) emergency payment, with a fund being set up to collect donations.Additional reporting by Marianne Baisnée in Paris.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Swiss bar employee who reportedly held sparkler unaware of dangers, family says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/eca3/live/27fcb860-f229-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-15T18:45:36.000Z",
      "dateModified": "2026-01-15T18:45:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Leon will focus on stations and airports to revive fortunes, boss says",
    "url": "https://www.bbc.com/news/articles/cd7z8j9j3ypo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4406/live/161c23a0-f225-11f0-a33d-037f0064a0e8.jpg",
    "tag": "Trending",
    "date": "2026-01-16T00:03:42.000Z",
    "description": "4 hours agoEmer MoreauBusiness reporterGetty ImagesFast-food chain Leon will open more restaurants in service stations, airports and train stations, a",
    "body": "4 hours agoEmer MoreauBusiness reporterGetty ImagesFast-food chain Leon will open more restaurants in service stations, airports and train stations, after it closes 20 on the High Street, its boss has said.John Vincent said the upcoming rises in business rates along with overall cost increases means the High Street is no longer as profitable. Leon has been losing £10m a year.Vincent, an original co-founder of the chain, bought the company back from Asda last year. But last month the firm appointed administrators and announced a major restructuring of its 71 restaurants, which employ 1,000 people.The government says it is backing hospitality businesses with a support package to limit bill rises.Vincent told the BBC's Big Boss Interview podcast tax rises were \"incredibly toxic\" for the hospitality industry.If taxes on businesses increase further, he said, \"the only people that are going to survive are those selling... food that's not very good quality\".In April, business rates relief for the hospitality sector which came in during Covid will end. At the same time, increases in the rateable value of premises take effect. The Treasury has indicated it will announce further assistance for pubs in the coming days but has faced a backlash from other hospitality businesses over why they are not included. Chancellor Rachel Reeves told a press conference on Wednesday she was \"working with the hospitality sector\".LeonJohn Vincent told the BBC Leon had moved away from its original mission of good-quality fast food for the massesVincent said that traditionally, \"the more fast food units you have, the better the operations, the better the supply chain, the better you can buy, the better your systems can be\".However, he added: \"I'm not sure this is true anymore because of pressure on the market.\"Vincent said Leon would close its restaurants outside London, but added the high costs of operating in the capital was making business there \"incredibly difficult\" with \"incredibly high upward-only rents\".He said even though airports in particular take a large slice of a retailer's takings, a 2% profit margin there \"is worth the same as a 6% on the High Street\".\"You might be doing two or three times the revenue in that airport than you might in a High Street location,\" Vincent saidResponding to Vincent's comments, a Treasury spokesperson said: \"We're backing hospitality businesses with a £4.3bn support package to limit bill rises.The spokesperson said this was in addition to \"capping corporation tax at 25%, cutting red tape and taking action on the cost of living to boost high streets\".Purpose and missionAside from rising costs, Vincent feels Leon is struggling because it has drifted from its original mission of good-quality fast food for the masses.The menu started out simple: meatballs, a superfood salad and tapas - relatively healthy offerings at a time when fast food was dominated by burgers, fried chicken and kebabs, Vincent said.But Leon \"lost chutzpah, leadership and confidence\" after it was sold in 2021, which resulted in \"a lack of clarity about what it wants the menu to be\", he said.He has previously said he sympathises with the company's previous owners, because of the challenges that restaurants have faced since the pandemic.\"I think Leon needs to make sense again,\" he said. \"We don't always make sense to people at the moment.\"He plans to bring simplicity back with menu changes this year: \"We do have to, as a brand, realise and remember, we were always about the best food for the most people. \"We were not about posh fast food for posh people. That was never our intention.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Leon will focus on stations and airports to revive fortunes, boss says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4406/live/161c23a0-f225-11f0-a33d-037f0064a0e8.jpg"
      ],
      "datePublished": "2026-01-16T00:03:42.000Z",
      "dateModified": "2026-01-16T00:03:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC News quiz of the week: Where are BTS kicking off their comeback tour?",
    "url": "https://www.bbc.com/news/articles/cn401prgx4jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dc36/live/9b1e4f20-f247-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-15T19:21:41.000Z",
    "description": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationHealthCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch L",
    "body": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationHealthCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch Live9 hours agoThis week, Iran's authorities made a deadly crackdown on protests, four astronauts returned to Earth after an unprecedented medical evacuation from the International Space Station, and the Love Island: All Stars villa was evacuated because of wildfires.But how much attention did you pay to what else happened in the world over the past seven days?Quiz collated by Ben Fell.Fancy some more? Test your memory of 2025 with our quiz of the year, try last week's quiz, or have a go at something from the archives.K-popBTSSouth KoreaPop musicMusicMore from the BBC6 hrs agoSouth Korea's impeached leader faces first of several verdicts. Here's what you need to knowYoon Suk Yeol is set to receive the first verdict on charges linked to his 2024 martial law attempt.6 hrs ago6 hrs agoNathan Evans: Embracing Scottish identity was the turning pointThe singer who shot to fame with his sea shanty Wellerman has found a new sound with the help of his band and best friends.6 hrs ago11 hrs agoHarry Styles announces fourth album - with intriguing titleThe pop star's long-awaited comeback is confirmed, after a viral campaign spread around the world.11 hrs ago14 hrs agoSheeran touts ordered to pay back £3m or face jailA Norfolk couple are ordered to pay the money after a Proceeds of Crime Act hearing.14 hrs ago17 hrs agoEurovision Song Contest announces live tourThe show will feature some of the most memorable performers from the seven decades of the competition.17 hrs ago",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC News quiz of the week: Where are BTS kicking off their comeback tour?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dc36/live/9b1e4f20-f247-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-15T19:21:41.000Z",
      "dateModified": "2026-01-15T19:21:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Luke Littler: World champion beats veteran Paul Lim in Bahrain",
    "url": "https://www.bbc.com/sport/darts/articles/c9dv06qwqp1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2c4d/live/00647190-f255-11f0-9dcf-ff16c0ef5f34.jpg",
    "tag": "Trending",
    "date": "2026-01-15T21:07:35.000Z",
    "description": "World champion Luke Littler beat veteran Paul Lim 6-1 to reach the quarter-finals of the Bahrain Masters.On his first trip to the oche since retaining",
    "body": "World champion Luke Littler beat veteran Paul Lim 6-1 to reach the quarter-finals of the Bahrain Masters.On his first trip to the oche since retaining his world title at Alexandra Palace on 3 January, Littler put in a statement performance.The 19-year-old had an average of 106 as he brushed aside 71-year-old Singaporean Lim.\"Not a chance! I will say it now,\" England's Littler replied when asked if he will still be playing into his 70s.\"He's just class and I wonder when is he going to retire? He still goes very strong in the practice room as well.\"Littler faces Wales' Gerwyn Price, who saw off Motomu Sakai 6-3, in the last eight. Price was last year's runner-up in Bahrain after beating Littler in the semi-finals.Second seed Luke Humphries is also through after a 6-0 win against Abdulla Saeed, while World Championship runner-up Gian van Veen defeated Man Lok Leung 6-2.Michael van Gerwen is set to play defending champion Stephen Bunting in the quarter-finals.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Luke Littler: World champion beats veteran Paul Lim in Bahrain",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2c4d/live/00647190-f255-11f0-9dcf-ff16c0ef5f34.jpg"
      ],
      "datePublished": "2026-01-15T21:07:35.000Z",
      "dateModified": "2026-01-15T21:07:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Deadline to fix unsafe crumbling NHS hospitals will be missed",
    "url": "https://www.bbc.com/news/articles/c0r47199rwyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/36f5/live/632808a0-f232-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-16T00:12:54.000Z",
    "description": "Work to fix hospitals built using unsafe concrete will not be completed in time to meet the government's target, a new report has warned.Seven hospita",
    "body": "Work to fix hospitals built using unsafe concrete will not be completed in time to meet the government's target, a new report has warned.Seven hospitals built using Raac, or reinforced autoclaved aerated concrete, were prioritised for remedial work last year, with the government setting a deadline of 2030.The new buildings are now expected to open in 2032 and 2033 - but some are already facing pressure to meet the revised timetable, the National Audit Office (NAO) said.In a number of hospitals, roofs are being supported by metal props and some areas have been closed as unsafe.Meanwhile, affected health trusts face huge maintenance bills to keep their aging buildings safe.Health Secretary Wes Streeting called the original New Hospitals Programme - 40 new hospitals by 2030 - promises \"that were never going to be met\".  In January 2025 he revised the scheme, prioritising 20 of the projects, including Raac hospitals, with more funding and later dates of completion.The NAO report says the 2025 review did put the programme on a \"more realistic, stable, long-term footing\". Standardising the design for some of the new buildings should speed up delivery and reduce costs, for example. But some of the new dates for completion have slipped. Torbay, Kettering and Musgrove Park hospitals are all delayed – they are estimated to be open nine to ten years later than under the previous plan.Raac is less durable than reinforced concrete as the \"bubbly\" structure can let water in, weakening the building material which can crumble and collapse. All of the seven \"prioritised\" schemes to replace Raac now won't be completed until 2032-33 and with \"significant operational and clinical risk and cost \", says the NAO.In the meantime, hospitals including the West Suffolk Hospital in Bury St Edmunds and The Queen Elizabeth Hospitals in Kings Lynn are facing huge maintenance bills to keep their sites open. By 2025 the seven hospitals will have required more than £500 million of investment to prevent structural failure.The NHS aims to remove all Raac concrete from its estate by 2035. The Department for Health and Social Care says so far there are 20 sites where it has been eradicated and that it is investing £1.6 billion across the next four years. Chair of the Public Accounts Committee Sir Geoffrey Clifton-Brown says the delays in addressing crumbling Raac must now be addressed \"as a matter of urgency.\"But the report warns that there is a tight construction schedule overall with little contingency in the next five years, so delivery dates could slip further.Mr Tim Mitchell, President of the Royal College of Surgeons of England, said: \"A steadier plan is better than drifting, but patients cannot wait a decade for capacity that we need now. \"NHS trusts will be pouring scarce funds into patching up old buildings for longer, when that money should be used to create extra operating theatres, securing ring‑fenced beds and making sure that there is enough staff to run them.\"A spokesperson for the Department of Health and Social Care said: \"We've confirmed a sustainable funding plan and an achievable timetable to deliver all schemes in the programme. We are now getting on with building these much-needed facilities as quickly as possible.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Deadline to fix unsafe crumbling NHS hospitals will be missed",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/36f5/live/632808a0-f232-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-16T00:12:54.000Z",
      "dateModified": "2026-01-16T00:12:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nigel Farage gains another Tory in his 'biggest coup' so far",
    "url": "https://www.bbc.com/news/articles/c20d9dlypnzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/baa5/live/a076fa60-f276-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-16T02:19:35.000Z",
    "description": "2 hours agoChris MasonPolitical editorThe key moment of Robert Jenrick's defection to Reform UK had it all.It was politics at its most raw: where chor",
    "body": "2 hours agoChris MasonPolitical editorThe key moment of Robert Jenrick's defection to Reform UK had it all.It was politics at its most raw: where choreography hasn't had time to get its boots on.Hundreds of us were crammed into a room at Reform HQ designed for far fewer – and then when Nigel Farage unveiled his latest recruit, there was no sign of him.Jenrick managed to be late to his own defection, in the latest dollop of farce on a day groaning with drama, jeopardy, skulduggery and plotting.Watch: Jenrick claims 'two main parties are rotten' in first speech as Reform memberIt was a day which began with a tactical masterstroke from the Conservative leader Kemi Badenoch, who got wind Jenrick was going to jump ship so pushed him overboard herself.'We'd been on high alert' - How Jenrick's dramatic defection unfoldedBut strategically it is Reform showing regular momentum and magnetism — to plenty of Conservatives at least.This is a pivotal waymarker in the remoulding of the Right of British politics.It is the biggest coup for Farage so far and will help him take on the jibe from his opponents that Reform is a one man band.The Conservative Party, so long the leviathan of British politics, had already been crushed by the electorate and had already been leaking like a burst pipe towards Reform.Now it has now lost one of its most high profile figures.There are, inevitably, cries of betrayal from Robert Jenrick's former colleagues, who are now indulging in the ritual sledging of his character.\"He was overwhelmed by personal ambition in a Macbeth type way,\" one shadow cabinet minister claimed.Jenrick responded that given he had been the bookies' favourite to be the next Conservative leader and was now joining a party with a very prominent and successful leader, it was a bit rich to put this all down to personal ambition.Nigel Farage now faces a familiar critique – that given the number of Tory defectors he is welcoming, does he really lead the Conservatives 2.0 rather than a distinctive, new, insurgent force?He told me they had welcomed a former Green councillor this week and would unveil a Labour defector next week.But is undoubtedly true that the vast majority of Reform's recent high profile signings are former Conservatives.It is a perception the party knows it has to manage astutely.And Labour were quick to point out the various past moments where Nigel Farage had been incredibly critical of Robert Jenrick.But, in short, defections and how they appear are a nice problem for a party to have – and far better than the alternative.A final thought: I wonder what the medium and long term consequences there may be of Kemi Badenoch's ruthlessness in giving Robert Jenrick the boot.Nigel Farage said he had thought it was 60/40 Robert Jenrick would join his party.60/40 isn't much better odds than tossing a coin. And yet there he was. What conversations between the two men, which may have happened in the coming days, weeks or even months, had to be rushed in a matter of hours after Badenoch's intervention?And what trouble could that store up for both men in the months ahead? Let's see.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nigel Farage gains another Tory in his 'biggest coup' so far",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/baa5/live/a076fa60-f276-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-16T02:19:35.000Z",
      "dateModified": "2026-01-16T02:19:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thousands descend on village after woman's social media plea",
    "url": "https://www.bbc.com/news/articles/cx2y9805g8go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/67d2/live/02916580-f21a-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-15T23:47:47.000Z",
    "description": "5 hours agoStephen McDonellChina correspondent, Beijing When Daidai realised her father was too old to slaughter two pigs for a traditional community ",
    "body": "5 hours agoStephen McDonellChina correspondent, Beijing When Daidai realised her father was too old to slaughter two pigs for a traditional community feast in the run-up to Chinese New Year, she turned to social media.She didn't want him to feel bad.\"Can anyone help me?\" she asked on Douyin, China's version of Tiktok, at the end of last week. \"My father is old. I am worried that he can't handle these pigs.\"Daidai, who's in her 20s, promised that those who came to their village, Qingfu, to assist would be treated to a pork banquet.In rural Sichuan and Chongqing, large community meals are an important part of culture, featuring twice-cooked pork, steamed ribs, soup and homemade liquor.\"Let me hold my head up high in our village,\" she said.Her appeal for help attracted more than a million likes and the response on the ground was like a scene from a cheesy feel-good movie, as thousands of cars poured in, carrying many more people than she needed for the task.So many responded that traffic jams have brought roads in this part of rural Chongqing in south-west China to a standstill. Drone images show carloads of people queuing up with rice crops on either side hoping to still enter Qingfu. Walking in from long distances has been a traffic-beating option for some.Daidai posted that drivers coming into the area should be careful on the roads, especially those from the city unaccustomed to conditions in the countryside.\"The atmosphere has been great. It reminded me of my childhood when my family still kept pigs. It has been years since I felt anything like that,\" one man, who drove more than 100 kilometres (65 miles) to get there, told the BBC.He has seen licence plates from all over the country, he said.When the pig slaughter and subsequent mass banquet did happen, it was watched live online by more than 100,000 viewers, registering 20 million likes, and the local government embraced it as a flash-tourism moment.With many more people in town than two pigs could feed, tourism officials donated more pigs to meet the huge demand, and small restaurants have been serving crowds of visitors in outdoor seating areas.Yet what this phenomenon has shown is how quickly a small matter can become something massive in the age of social media.\"I thought maybe a dozen people would come,\" Daidai told Chinese media. \"But there have been too many to count.\"The response has also been driven by what seems to be a yearning from Chinese people to get back in touch with community cultural events, as well as a need for positive experiences when life can, at times, seem very dark.Daidai couldn't believe how quickly it's all happened. Last Friday she posted her request for help. By Saturday the response was so large that she went to the police to warn them that there could be disruption in the village and extra officers were brought in to manage the situation.The banquet celebration, by then huge in size, went on for two days – 1,000 diners on 11 January became 2,000 the next day – with bonfires into the night and much partying, accompanied by a band.Eventually, Daidai posted that her celebration was over, urging any more visitors to enjoy the region but not visit her home. After sleeping for only four hours over two days, she said she was exhausted.However, it had been an incredible moment for her and her village.To all the strangers who answered her call she said, \"without your enthusiasm and passion, there would not have been a feast like this\".\"For everyone who came, the feeling was like that of a big family. It was really warm, really healing and really meaningful.\"She thanked government officials and the police for allowing a sudden celebration of this size to proceed.It is already being predicted that the now famous Hechuan region, where her village is located, may try to turn this into a regular event, to tap into the enthusiasm for genuine, grass-roots interaction in a world where many feel isolated and removed from their culture.One villager was quoted in the People's Daily as saying: \"Here neighbours help each other. Today I might help you slaughter a pig at your place, tomorrow you will come to my place to do the same.\"As for Daidai's father, she said in an interview: \"My dad is very happy. Seeing this many people arrive he had to borrow tables and chairs from other villagers. We've never experienced anything like this.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thousands descend on village after woman's social media plea",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/67d2/live/02916580-f21a-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-15T23:47:47.000Z",
      "dateModified": "2026-01-15T23:47:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rory McIlroy suggests LIV Golf could be decline after Brooks Koepka's return to the PGA Tour",
    "url": "https://www.bbc.com/sport/golf/articles/cje1yd43zkwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5265/live/cc3560b0-f249-11f0-a7a0-236b6b892995.jpg",
    "tag": "Trending",
    "date": "2026-01-15T19:49:32.000Z",
    "description": "Rory McIlroy says the return of Brooks Koepka to the PGA Tour could suggest that the rival LIV Golf tour is in decline.Koepka, 35, is back on the PGA ",
    "body": "Rory McIlroy says the return of Brooks Koepka to the PGA Tour could suggest that the rival LIV Golf tour is in decline.Koepka, 35, is back on the PGA Tour after controversially joining the Saudi Arabian-backed LIV series in 2022.He has agreed to make a $5m (£3.7m) charitable donation as part of his return, will forego any payment from the FedExCup Bonus scheme during the 2026 season and will be ineligible for the Tour's player equity programme between 2026-2030, which could amount to between $50-85m.Jon Rahm, Bryson DeChambeau and Cam Smith have all indicated they will remain with LIV Golf but the lack of any new signings suggests that the power may be shifting, according to McIlroy.\"It's not as if they made any huge signings this year, is it?\" the Northern Irishman told The Daily Telegraph, external.\"They haven't signed anyone who moves the needle and I don't think they will.\"I mean, they could re-sign Bryson for hundreds of millions of dollars, but even if they do, it doesn't change their product does it?\"They'll just be paying for the exact same thing. And they've lost Brooks.\"Former US Open champion Wyndham Clark, who played in the 2023 Ryder Cup alongside Koepka, says he is \"torn\" on his compatriot's return to the PGA calendar after turning down an approach from LIV himself.\"I personally really like Brooks, and I think it's ultimately really good for the PGA Tour, but also, you know, a guy that had an opportunity to go to LIV, it's kind of frustrating that he's able to get the cake and also eat it,\" Clark said.\"I had the offer. It was just over a year and a half ago. And if you would have told me that I could have gone for a year and a half, make a boatload of money and then be able to come back and play on the Tour, I think almost everyone would have done that.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rory McIlroy suggests LIV Golf could be decline after Brooks Koepka's return to the PGA Tour",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5265/live/cc3560b0-f249-11f0-a7a0-236b6b892995.jpg"
      ],
      "datePublished": "2026-01-15T19:49:32.000Z",
      "dateModified": "2026-01-15T19:49:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Machado presents Trump with her Nobel award at White House meeting",
    "url": "https://www.bbc.com/news/articles/cx2w94wp4p1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0de0/live/95f4ad40-f293-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-16T01:27:46.000Z",
    "description": "Venezuelan Nobel Peace Prize winner presents her medal to Trump3 hours agoMax MatzaWatch: Machado says she \"presented\" her Nobel Peace Prize medal to ",
    "body": "Venezuelan Nobel Peace Prize winner presents her medal to Trump3 hours agoMax MatzaWatch: Machado says she \"presented\" her Nobel Peace Prize medal to TrumpVenezuelan opposition leader María Corina Machado says that she presented her Nobel Peace Prize medal to President Donald Trump at a private White House meeting on Thursday.\"I think today is a historic day for us Venezuelans,\" she said after meeting Trump, the first time the two have met in-person. It came weeks after US forces seized Venezuelan President Nicolás Maduro in Caracas and charged him in a drug-trafficking case.Trump expressed his gratitude in a social media post, saying the move was \"a wonderful gesture of mutual respect\". The US president has declined to endorse Machado, whose movement claimed victory in 2024's widely contested elections, as Venezuela's new leader.Trump has instead been dealing with the acting head of state in Venezuela, Delcy Rodríguez, Maduro's former vice-president.But he said meeting Machado was a \"great honor\", calling her a \"wonderful woman who has been through so much\".After leaving the White House, Machado spoke to supporters gathered at the gates outside, telling them in Spanish, according to the Associated Press: \"We can count on President Trump.\"\"I presented the president of the United States the medal of the Nobel Peace Prize,\" Machado later told journalists in English, calling it \"a recognition for his unique commitment with our freedom\".Reuters/White HouseTrump, who often speaks about his desire to be awarded the Nobel Peace Prize, had expressed displeasure when it was given to Machado and she decided to accept the honour last year. The BBC has reached out to the White House for comment. Machado said last week that she would share it with Trump, but the Nobel Committee later clarified that it was not transferable.\"Once a Nobel Prize is announced, it cannot be revoked, shared, or transferred to others,\" the committee said in a statement last week. \"The decision is final and stands for all time.\"Asked for a reaction to Machado's remarks, the committee directed the BBC to their previous statement.Before the White House meeting on Thursday, the Nobel Peace Center posted on X that \"a medal can change owners, but the title of a Nobel Peace Prize laureate cannot\". In her remarks, Machado described how the Marquis de Lafayette, who fought in America's Revolutionary War, gave a medal bearing the likeness of George Washington to Simon Bolivar, one of the founding fathers of modern Venezuela. The gift was \"a sign of the brotherhood\" between her country and the US \"in their fight for freedom against tyranny,\" Machado said.\"And 200 years in history, the people of Bolivar are giving back to the heir of Washington a medal - in this case a medal of the Nobel Peace Prize - as a recognition for his unique commitment with our freedom,\" she said.ReutersMachado also visited Congress to meet US senators during her visit to Washington, where her remarks to reporters were drowned out by supporters chanting \"María, presidente\" and waving Venezuelan flags.Machado had been expected to use her time with Trump to try to persuade him that backing Rodríguez's interim government was a mistake, and that her opposition coalition should be in charge of this transition.White House Press Secretary Karoline Leavitt told reporters as the meeting was underway on Thursday that Machado is \"a remarkable and brave voice for many of the people of Venezuela\" and that Trump \"was looking forward to this meeting and expecting a frank and positive discussion\" about the current realities of life in Venezuela.Trump has previously described Machado as a \"freedom fighter\", but rejected the notion of appointing her to lead Venezuela after Maduro's removal, arguing that she lacks sufficient domestic support.Since Maduro was seized on 3 January, the Trump administration has moved quickly to remake Venezuela's oil sector, which had been under US sanctions. On Wednesday an American official said the US had completed its first sale of Venezuelan oil, valued at $500m (£373m).Oil tankers suspected of transporting sanctioned Venezuelan oil have also been seized by the US, with US forces saying they had boarded a sixth tanker on Thursday.A Venezuelan government envoy is expected to travel to Washington on Thursday to meet US officials and take initial steps toward reopening the country's embassy, the New York Times reported.The emissary is reported to be a close ally and friend of Rodríguez, who has been described as \"extremely co-operative\" by the White House.Rodríguez delivered the annual Message to the Nation speech in Caracas on Thursday, in which she said she was willing to attend meetings in Washington as well.\"If I ever have to go to Washington as acting president, I will do so standing tall, walking, and not crawling,\" she said, calling on the country to \"not be afraid of diplomacy\" with the US. Trump and Rodríguez also spoke by phone on Wednesday, with Trump later describing his counterpart on social media as \"a terrific person\".  Rodríguez, meanwhile, described the call as \"productive and courteous\" and characterised by \"mutual respect.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Machado presents Trump with her Nobel award at White House meeting",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0de0/live/95f4ad40-f293-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-16T01:27:46.000Z",
      "dateModified": "2026-01-16T01:27:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'We'd been on high alert' - How Jenrick's dramatic defection unfolded",
    "url": "https://www.bbc.com/news/articles/ce3ejzz78gxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f125/live/a4d4e600-f265-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-15T23:47:35.000Z",
    "description": "5 hours agoJoe PikePolitics correspondentEPAOn Wednesday afternoon in a large wood-panelled room in parliament, Robert Jenrick was sitting alongside K",
    "body": "5 hours agoJoe PikePolitics correspondentEPAOn Wednesday afternoon in a large wood-panelled room in parliament, Robert Jenrick was sitting alongside Kemi Badenoch and the rest of the Conservative shadow cabinet talking about foreign policy.\"He was honestly very positive and chipper\", says one who was in the room.Within twenty-four hours a sensational leak from inside Jenrick's own Commons office would lead to him being thrown out of the party he joined as a teenager. And him deciding to back Reform, its biggest rival.For months Jenrick had been on defection watch, and behind the scenes Badenoch's team were picking up worrying signals.\"We'd been in a high state of alert\", says a senior conservative. \"For quite a long time we've been hearing from multiple people that he was on manoeuvres. We knew about at least one evening meeting he'd had with Farage in December\".Secret discussionsIn fact Jenrick had been having many more secret discussions with Reform figures for four months including with the party's leader.\"There were multiple conversations, many one-to-one meetings with Nigel,\" says a Farage ally.Was Jenrick offered a top cabinet job in a possible future Reform government? \"Nothing was offered\", insists the senior Reform source. \"Honestly, genuinely nothing.\"Jeff Overs/BBCThe leakBut as Badenoch wrapped up her shadow cabinet meeting at 17:00 GMT on Wednesday, she was taken aside and shown what her advisers immediately recognised was a bombshell leak.A source with access to Jenrick's office had handed the Tory leadership a draft of Jenrick's secret defection speech, which included excoriating attacks on shadow cabinet ministers.Jenrick's allies won't comment on the identity of the alleged leaker but do not dispute the document came from one of his inner circle.They deny, however, that the MP was ever careless with the draft: \"The speech never left Rob's office. The idea that it was left lying around somewhere is untrue.\"Badenoch immediately assembled her closest advisers including Conservative chief whip Rebecca Harris and a few other shadow cabinet ministers.\"My immediate reaction was it's treachery, it's disloyalty\" says one of those Badenoch consulted in her parliamentary office.\"The temptation in these situations is to do nothing and hope it goes away, or wait a day or two. But that would have been a cop out. And Kemi is not someone who cops out.\"The Conservative leader decided her only option was to move fast.The sackingOn Thursday, Badenoch woke before dawn and made the final decision to sack Jenrick. She sat down in front of her home computer to record a video announcing that he had been sacked from the shadow cabinet and suspended from the Conservative Party.She then rushed to catch a flight to Scotland.Jenrick's allies say he was in his office in Westminster later that morning when he received a call from Tory chief whip Rebecca Harris.She told him what the party had discovered. He protested his innocence and ended the call abruptly. Within minutes, Badenoch's team had posted her video.Soon after, Jenrick had a brief call with Nigel Farage. \"It was quick\", says one Reform source. They said: 'We're on: let's do it today'.\"Jenrick's allies argue his defection was the biggest moment of his career, and he feels \"liberated\" to have got it out the way.\"At very little notice and under immense pressure he delivered a speech and Q&A to the media incredibly well\", one says. \"There were no slip-ups.\"\"I think it nullifies a massive Tory attack - that Reform are one man band and not serious. Because Rob is very serious.\"Badenoch's supporters argue her improving performance in prime minister's questions and in the opinion polls in recent months meant Jenrick's chances of unseating her as Tory leader were vanishingly small.\"It's not because Kemi is failing that he's done this. It's because she's succeeding\", say one in the shadow cabinet.\"It's made it more difficult to get the top job. He has no chance of being leader before 2029. So why stay?\"Defection decisionThe fact Jenrick had drafted a full defection speech is surely proof his mind was made up before Badenoch made her surprise move.\"Rob had decided\", one close to him says. \"It was a question of when.\"They say he got increasingly frustrated after being told off by colleagues both for speaking out about grooming gangs, and for criticising the UK granting citizenship to British-Egyptian dissident Alaa Abd El Fattah - a decision made under the Conservatives.The final straw seems to have been a disagreement at a shadow cabinet away-day last Thursday over whether Britain was broken.\"He was very odd at the away day\", said one present. \"His body language was withdrawn, his chair was pushed back from the table, he was taking lots of notes.\"In Jenrick's telling the shadow cabinet were asked if they thought Britain was broken. He said yes. Some agreed but argued: \"We can't say that. Because it implies we broke it.\"If that away day was a turning point in the political career of Robert Jenrick and the right of British politics, it seems fitting that the meeting took place at a venue overlooking the Tower of London.\"It's a traditional home of traitors\", jokes one who was there. \"Which we didn't realise at the time.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'We'd been on high alert' - How Jenrick's dramatic defection unfolded",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f125/live/a4d4e600-f265-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-15T23:47:35.000Z",
      "dateModified": "2026-01-15T23:47:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]