[
  {
    "title": "Hong Kong billionaire Jimmy Lai tested China's limits. It cost him his freedom",
    "url": "https://www.bbc.com/news/articles/c5yqr485d84o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9997/live/8983b1f0-dc27-11f0-89ae-89110b9e802d.png",
    "tag": "Trending",
    "date": "2025-12-20T22:58:58.000Z",
    "description": "9 hours agoGrace Tsoi,BBC World ServiceandBBC News Chinese,Hong KongBBCJimmy Lai, 78, faces life in prison for national security offencesOn a winter m",
    "body": "9 hours agoGrace Tsoi,BBC World ServiceandBBC News Chinese,Hong KongBBCJimmy Lai, 78, faces life in prison for national security offencesOn a winter morning in 2022 Raphael Wong and Figo Chan walked into Hong Kong's Stanley prison to meet Jimmy Lai, the media billionaire who had been arrested two years before and was awaiting trial charged with national security offences.They had all been part of the turbulent protests that had rocked Hong Kong in 2019, when hundreds of thousands took to the streets demanding democracy and more freedom in the Chinese territory. They would also often meet for dinner, sometimes lavish meals, gossiping and bantering over dim sum, pizza or claypot rice.In prison, he \"loved eating rice with pickled ginger,\" Chan said. \"No-one could have imagined Jimmy Lai would eat something like that!\"But neither had they imagined a reunion at a maximum security prison, the protests crushed, friends and fellow activists jailed, Hong Kong just as boisterous and yet, changed. And gone was the owner of the irreverent nickname \"Fatty Lai\": he had lost considerable weight.Decades apart - Lai in his 70s, Wong and Chan about 40 years younger - they had still dreamed of a different Hong Kong. Lai was a key figure in the protests, wielding his most influential asset, the hugely popular newspaper, Apple Daily, in the hope of shaping Hong Kong into a liberal democracy. That proved risky under a contentious national security law imposed in 2020 by China's Communist Party rulers in Beijing.Lai always said he owed Hong Kong. Although he is a UK citizen, he refused to leave. \"I got everything I have because of this place,\" he told the BBC hours before he was arrested in 2020. \"This is my redemption,\" he said, choking up.He wanted the city to continue to have the freedom it had given him. That's what drove his politics - fiercely critical of the Communist Party and avowedly supportive of Hong Kong's pro-democracy movement. It cost him his own freedom.Watch: Jimmy Lai's last interview as a free man in 2020Lai harboured \"a rabid hatred\" of the Chinese Communist Party and \"an obsession to change the Party's values to those of the Western world\", the High Court ruled on Monday as it delivered the verdict in his trial. It said that Lai had hoped the party would be ousted - or, at the very least, that its leader Xi Jinping would be removed.Lai was found guilty on all counts of charges he had always denied. The most serious one - colluding with foreign forces - carries a maximum sentence of life in prison.\"Never,\" Lai had said to that charge when he testified, arguing that he had only advocated for what he believed were Hong Kong's values: \"rule of law, freedom, pursuit of democracy, freedom of speech, freedom of religion, freedom of assembly\".Monday's verdict was welcomed by Hong Kong's chief executive John Lee, who said Lai had used his newspaper to \"wantonly create social conflicts\" and \"glorify violence\". The law, he added, never allows anyone to harm the country \"under the guise of human rights, democracy and freedom\".Getty ImagesLai's wife Teresa and son Shun-yan at court for Lai's verdict, along with Cardinal Joseph Zen, former bishop of Hong Kong who baptised Lai in 1997 Back in 2022, before Wong and Chan left the prison, Lai asked them to pray with him, to Wong's surprise.Lai's Catholic faith had deepened in solitary confinement - an arrangement he had requested, according to authorities. He prayed six hours a day and he made drawings of Christ, which he sent in the mail to friends. \"Even though he was suffering,\" Wong said, \"he didn't complain nor was he afraid. He was at peace.\"Peace was not what Jimmy Lai had pursued for much of his life - not when he fled China as a 12-year-old, not while he worked his way up the gruelling factory chain, not even after he became a famous Hong Kong tycoon, and certainly not as his media empire took on Beijing.For Lai, Hong Kong was everything that China was not - deeply capitalist, a land of opportunity and limitless wealth, and free. In the city, which was still a British colony when he arrived in 1959, he found success - and then a voice.Apple Daily became one of the top-selling papers almost instantly after its debut in 1995. Modelled on USA Today, it revolutionised the aesthetics and layout of newspapers, and kicked off a cut-throat price war.From a guide to hiring prostitutes in the \"adult section\" to investigative reports, to columns by economists and novelists, it was a \"buffet\" targeting \"a full range of readers\", said Francis Lee, a journalism professor at the Chinese University of Hong Kong.Former editors and employees spoke of Lai's encouragement - \"If you dared to do it, he would dare to let you do it\" - and his temper. One said he often swore.They describe him as unconventional, and as a visionary who wasn't afraid to bet on experiments. \"Even before the iPhone was launched, he kept saying mobile phones would be the future,\" recalled one of the paper's editors, adding that he was full of ideas. \"It was as if he asked us to create a new website every day.\"It had been the same when he owned a clothing label. \"He was not afraid of disrupting the industry, and he was not afraid of making enemies,\" said Herbert Chow, a former marketing director at a rival brand.That was both his making and undoing, Chow said: \"Otherwise, there would have been no Apple Daily. Of course, he wouldn't have ended up like this either.\"An early TV commercial for Apple Daily featured the then 48-year-old Lai biting the forbidden fruit while dozens of arrows took aim at him.It became a self-fulfilling prophecy.Jimmylai.substack.comThe Apple Daily commercial when it launched in 1995Escape from ChinaIt was his first taste of chocolate that beckoned Lai to Hong Kong as a boy.After carrying a passenger's luggage at a railway station in China, Lai was given a tip, and a bar of chocolate. He took a bite. \"I asked him where he's from. He said Hong Kong. I said, 'Hong Kong must be heaven' because I had never tasted anything like that,\" Lai said of the encounter in a 2007 documentary, The Call of the Entrepreneur.Life in Mao Zedong's China was punctuated by waves of oppressive campaigns - to industrialise China overnight, to weed out capitalist \"class enemies\". The Lais, once a family of business people, were blacklisted. His father fled to Hong Kong, leaving them behind. His mother was sent to a labour camp.Decades later, Lai wrote of how of he and his sisters would be dragged out of their homes to watch a crowd forcing their mother to kneel while she was shoved and taunted - cruel public shaming that soon became the norm. The first time, Lai wrote, was terrifying: \"My tears flowed freely and wet my shirt. I dared not make a move. My body was burning with humiliation.\"Uncowed, his grandmother finished every story with the same message: \"You have to become a businessman even if you only sell seasoned peanuts!\"And so, at the age of 12, he set off for Hong Kong, among millions who fled the mainland - and Mao's devastating rule - over the years.The day he arrived, on the bottom of a fishing boat, along with about 80 seasick travellers, he was hired by a mitten factory. He described the long working hours as a \"very happy time, a time that I knew I had a future\". It was there that one of his co-workers helped him learn English. Years later, he would give interviews and even testify at court in fluent English.By his early 20s, he was managing a textile factory and after making money on the stock market, he started his own, Comitex Knitters. He was 27.Getty ImagesJimmy Lai at his home in Hong Kong in 1993 Business often took Lai to New York, and on one of those trips, he was lent a book that came to define his worldview: The Road to Serfdom by Nobel Prize-winning economist Friedrich Hayek, a champion of free-market capitalism. \"People's spontaneous reaction\" and \"the exchange of information\" have created the best in the world, was his takeaway. To him, that was Hong Kong's strength.The book spurred a voracious reading habit. He would read the same book multiple times, and read every book by authors he admired.  \"I want to turn the author's thoughts into my backyard garden. I want to buy a garden, not cut flowers,\" he said in a 2009 interview.After a decade in manufacturing, he was \"bored\" and founded the clothing chain Giordano in 1981, which became a fast-fashion pioneer. It was so successful that Tadashi Yanai sought advice from Lai when his Japanese label Uniqlo opened shops.Lai launched stores in China, which had begun to open up after Mao died. He was \"excited\", China \"was going to be changed, like a Western country\", he said in the 2007 documentary.Then in 1989, Beijing crushed pro-democracy protests in Tiananmen Square: a rude awakening for Lai and Hong Kong, which was set to return to Chinese rule in 1997 under a recent agreement by China and the UK.Giordano sold tees with photos of Tiananmen protest leaders and anti-Beijing slogans, and put up pro-democracy banners in stores across Hong Kong.A million people marched in Hong Kong in solidarity with student protesters in Beijing. Until 2020, Hong Kong held the largest vigil that mourned the massacre.Lai said later that he \"didn't feel anything about China\" until then. He had always wanted to forget that part of his life but \"all of a sudden, it was like my mother was calling in the darkness of the night\".Getty ImagesLai was a frequent attendee at Hong Kong 's annual vigils in memory of those who died at Tiananmen Square in 1989'Choice is freedom'The following year Lai launched a magazine called Next, and in 1994 published an open letter to Li Peng, \"the Butcher of Beijing\" who played a key role in the Tiananmen massacre. He called him \"the son of a turtle egg with zero intelligence\".Beijing was furious. Between 1994 and 1996, Giordano's flagship store in Beijing and 11 franchises in Shanghai closed. Lai sold his shares and stepped down as chairman.\"If I just go on making money, it doesn't mean anything to me. But if I go into the media business, then I deliver information, which is choice, and choice is freedom,\" Lai said in the 2007 documentary.He soon became a \"very active participant\" in Hong Kong's pro-democracy movement, meeting leaders to discuss strategy, said Lee Wing Tat, a former lawmaker from the Democratic Party.He became an outspoken critic of the CCP, writing in 1994: \"I entirely oppose the Communist Party because I hate everything that restrains personal liberties.\" He also started to voice concerns about the looming handover of Hong Kong, from Britain to China, in 1997. \"After more than a century of colonial rule, Hong Kongers feel proud to return to the embrace of the motherland,\" he wrote. \"But should we love the motherland even if it doesn't have freedom?\"During the handover, however, China's then-leader Jiang Zemin promised that Hongkongers would govern Hong Kong and the city would have a high degree of autonomy for the next 50 years.Getty ImagesLai at an \"Occupy Central\" protest in Admiralty in October 2014The 2014 Umbrella Movement sparked by Beijing's refusal to allow completely free elections in Hong Kong became another turning point for Lai.Protesters occupied the city's main commercial districts for 79 days. Lai turned up from 9am to 5pm every day, undeterred after a man threw animal entrails at him. \"When the police started firing tear gas, I was with Fatty,\" the former lawmaker Lee recalled.The movement ended when the court ordered protest sites to be cleared, but the government did not budge. Five years later, in 2019, Hong Kong erupted again, this time because of a controversial plan that would have allowed extradition to mainland China.What began as peaceful marches became increasingly violent, turning the city into a battleground for six months. Black-clad protesters threw bricks and Molotov cocktails, stormed parliament and started fires; riot police fired tear gas, rubber bullets, water cannons and live rounds.Lai was at the forefront of the protests and served 20 months for participating in four unauthorised assemblies. A protester told the BBC he was surprised to see Lai: \"To me, he's a busy businessman, but he showed up.\"Getty ImagesLai at a pro-democracy march in 2019 Apple Daily provided blanket coverage or, as critics would argue, a sounding board for an anti-government movement.Government adviser Ronny Tong said Lai was \"instrumental\" in the protests because Apple Daily carried a \"totally false\" slogan – anti-extradition to China – which \"caught the imagination of people who wanted to cause havoc in Hong Kong\".Whether Apple Daily played a seditious role, and how much control Lai exerted over its stance was at the centre of his 156-day national security trial.Lai instructed the editorial team to \"urge people to take to the streets\", according to Cheung Kim-hung, former chief executive of Apple Daily's parent company Next Digital, and a defendant-turned-prosecution witness. After the National Security Law took effect, the newspaper was raided twice and eventually shut down in 2021.During the height of the protests, Lai flew to the US where he met then Vice-President Mike Pence to discuss the situation in Hong Kong. A month before the National Security Law was imposed, Lai launched a controversial campaign, despite internal pushback, urging Apple Daily readers to send letters to then US President Donald Trump to \"save Hong Kong\".All of this, the court ruled, amounted to a public appeal for a foreign government to interfere in Hong Kong's internal affairs.\"Nobody in their right mind should think that Hong Kong can undergo any kind of political reform without at least tacit acceptance from Beijing,\" Tong said. The protests in 2014 and 2019 \"are totally against common sense\".Getty ImagesCopies of the last Apple Daily newspaper early on June 24, 2021Beijing says Hong Kong has now moved from \"chaos to governance\" and onto \"greater prosperity\" because of the national security law and a \"patriot-only\" parliament. But critics, including hundreds of thousands of Hongkongers who have since left, say dissent has been stifled, and the city's freedoms severely curbed.Lee, the lawmaker, is among them: \"When I first came to the UK, I had nightmares. I felt very guilty. Why could we live in other places freely, while our good friends were jailed?\"Lai's family has been calling for his release for years, citing concerns for his health because he is diabetic, but their calls have been rejected so far. The government and Lai's Hong Kong legal team have said that his medical needs are being met.Carmen Tsang, Lai's daughter-in-law who lives in Hong Kong with her family, says her children miss grandpa - and the big family dinners he hosted every two weeks. His loud voice scared her daughter when she was younger, but \"they loved going to grandpa's place… They think he's a funny guy\".She is not sure today's Hong Kong has a place for Lai. \"If there's a speck of dust in your eye, you just get rid of it, right?\"Watch: What does the Jimmy Lai verdict mean for democracy in Hong Kong?",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hong Kong billionaire Jimmy Lai tested China's limits. It cost him his freedom",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9997/live/8983b1f0-dc27-11f0-89ae-89110b9e802d.png"
      ],
      "datePublished": "2025-12-20T22:58:58.000Z",
      "dateModified": "2025-12-20T22:58:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The best albums and songs of 2025: Unexpected comebacks and operatic pop",
    "url": "https://www.bbc.com/news/articles/c9w7qgpnv14o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c893/live/9de13d30-db31-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-21T00:26:17.000Z",
    "description": "8 hours agoMark Savage,Music correspondentandLola Schroer,Entertainment reporterBBC / Press / Getty ImagesThe year's biggest artists included (L-R): R",
    "body": "8 hours agoMark Savage,Music correspondentandLola Schroer,Entertainment reporterBBC / Press / Getty ImagesThe year's biggest artists included (L-R): Rosalía, Jarvis Cocker, PinkPantheress, Bad Bunny and Addison RaeSongs about love, sex, tax and demon hunters ranked among the best music of 2025, according to a \"poll of polls\" conducted by BBC News.We compiled more than 30 end-of-year lists from leading music publications to come up with a \"super-ranking\" of the year's best albums and singles, with artists including Pulp, Lady Gaga and Chappell Roan joined by newcomers like pop singer Addison Rae and indie band Geese.In total, the critics named more than 200 records among their favourites, although the year's biggest-sellers failed to impress them.Taylor Swift's blockbuster album The Life Of A Showgirl only picked up a handful of nominations. The year's biggest single, Alex Warren's Ordinary, appeared in just one list of 2025's best songs.Instead, critics selected music that shifted the tectonic plates of pop... Here's a guide to their favourites.The 10 best albums of 202510) Addison Rae – AddisonColumbia RecordsAfter a shaky start in 2021, Addison Rae's music career took flight with this collection of shimmering, trance-like hymns to desire. The desire for touch, the desire for fame, the desire for inner peace.Unlike most modern pop albums, it's the work of just three people, with Rae and her collaborators Elvira Anderfjärd and Luka Kloser establishing a stylish, spacey and occasionally off-kilter sonic palette all of their own.Singles like Diet Pepsi and Headphones On felt simultaneously classic and futuristic, marking Rae out as pop's newest It Girl.Listen to Diet Pepsi: Sensual, hypnotic and calorie-free pop.9) Lily Allen – West End GirlBMGHell hath no fury like a Lily Allen scorned.West End Girl is a savage and startlingly detailed portrait of a marriage being torn apart. Allen says some of the details have been exaggerated, but her pain is tangible amongst the artful pop beats and faux insouciance.The dirty laundry triggered an avalanche of press coverage when the album arrived in November, but the songs have lingered as everyone remembers just how well Allen can craft an intoxicating pop hook.Listen to Madeline: Where Allen confronts her partner's mistress, and recreates their texts.Lily Allen is 'vicious' and 'raw' on tell-all album8) Pulp – MoreRough TradePulp's first album since 2001, More, somehow manages to sound as if it was recorded and shelved in their mid-90s heyday.The lyrics are the only giveaway that this is the work of a band in their late middle age - as Jarvis Cocker sings movingly about stagnation, divorce and mortality. \"You've gone from all you that could be to all that you once were,\" he laments on Slow Jam.Yet, at 62, he remains stubbornly committed to the transformative power of love. And the reception Pulp received at Glastonbury this summer went a long way to proving him right.Listen to Spike Island: A spiritual sequel to 1995's Sorted for E's & Wizz. Pulp reveal first album in 24 years7) Dijon – BabyR&R / WarnerWhat a wild year it's been for Dijon Duenas. After contributing to Bon Iver's Sable, Fable and Justin Bieber's acclaimed comeback, Swag, he scored two Grammy nominations for his second album, Baby.It's a dazzling, harmony-rich R&B record, that channel-hops between genres and moods like a television tuned to the twin spirits of Prince and D'Angelo.The album's central theme is the ecstasy and chaos of fatherhood, with Dijon addressing the title track to his firstborn, then imploring his wife to expand the family on the subtly-titled Another Baby! Sleepless nights have never sounded so good.Listen to Yamaha: A swirling 80s funk groove allows Dijon to submerge himself in the bliss of enduring love.6) FKA Twigs – EusexuaAtlantic RecordsEusexua, FKA Twigs has said, is a word that describes \"the tingling clarity\" you get when you're struck by a new idea, when you kiss a stranger, or even \"the moment before an orgasm\".The album attempts to recreate that feeling with a series of abstract, futuristic soundscapes and deconstructed club tracks. Echoing Madonna's Ray of Light (most notably on Girl Feels Good), the hooks are as sharp as the dopamine is addictive.Listen to Girl Feels Good: A visceral ode to empowerment, femininity and healing on the dancefloor.5) CMAT - Euro-CountryCMATBaby / AWALCoronation Street! Social anxiety! Late stage capitalism! Jamie Oliver! Grief! Road rage!It's all there on Euro-Country, a riotously enjoyable romp through Ciara Mary-Alice Thompson's inner monologue. Along the way, she tackles everything from male suicide to the impossible beauty standards that had her \"trying to wax my legs with tape\" at the age of nine.Listen to Jamie Oliver Petrol Station: The only song of 2025 to address the need for tolerance through the prism of service station fast food.CMAT: I still face abuse over viral song4) Oklou – Choke EnoughTrue Panther SoundsFrench artist Oklou – aka Marylou Mayniel – described her debut album as a \"quest for meaning, of the need to be touched by anything\" in a world where our interactions are stripped of humanity and flattened onto a screen.Co-produced by Charli XCX collaborators AG Cook and Danny L Harle, it couldn't sound less bratty if it tried. It's an album of intimate, gauzy pop, almost entirely drumless and built around hypnotic musical loops that short-circuit your emotions. Unplug and absorb.Listen to Blade Bird: The album's swooning climax, based on a Basque poem about the tension between love and possession.3) Bad Bunny - Debí Tirar Más FotosRimas EntertainmentHe might be Spotify's most-played artist of the year, but Puerto Rico's Bad Bunny makes no concessions to commercial trends. His sixth album is a jubilant love letter to the music of his homeland, mixing traditional genres like plena, salsa and bomba with the hip-swaying pulse of reggaeton.The irresistible grooves dare you not to get up and dance, while the lyrics agonise about gentrification and capitalism stealing the island's old magic. Listen to DtMF: A lament for the loved ones he's lost, the album's title track translates as, \"I should have taken more photos\".Why Bad Bunny is refusing to tour the US2) Geese – Getting KilledPartisan / PIASA savage and unpredictable record, Getting Killed was apparently recorded in just 10 days. It finds the four members of Brooklyn-based Geese patchworking the best bits of Radiohead, the Strokes, Captain Beefheart and the Velvet Underground into something entirely new and unpredictable.Frontman Cameron Winter anchors the chaos with his singular warble, and lyrics that swerve wildly between irreverence and incisiveness. Listen to Taxes: Defiant, taut and full of swagger, Winter chants: \"If you want me to pay my taxes / You'd better come over with a crucifix.\"1) Rosalía - LuxColumbia RecordsIf music brings us closer to God, Rosalía wants her music to bring God closer to us. The Spanish singer's fourth album is an exhilarating - and profoundly moving - exploration of the human condition, that asks why the earthly and the holy have to be so far apart.It's a monumental work. She devoted an entire year to the lyrics alone, singing in 14 languages, over music that sits at the lesser explored intersection of classical, flamenco and avant-pop.In an interview with the New York Times, Rosalía agreed she was \"demanding a lot\" from listeners, \"but I think that the more we are in the era of dopamine, the more I want the opposite\".Accordingly, it's an album that reveals fresh new treasures on every listen, as Rosalía argues we're all capable of grace and beauty. We just have to open our hearts.Listen to Reliquia: As staccato strings are sucked into a vortex of electronic distortion, Rosalía sings about the sacrifices she's made for art and love, and concludes it's better to contribute to the world than take from it.Radical and Riveting: Rosalía's Lux reviewedThe 10 best singles of 2025Getty ImagesGhanaian-American singer Amaarae was recognised for her single SMO10) Wednesday - Elderberry WineThere's a sense of unease bubbling under this gentle indie rock song, as though singer Karly Hartzman is perpetually on the brink of divulging an uncomfortable truth. Built around the metaphor of elderberries, a fruit that can heal or poison depending on how it's handled, the song captures the tension of staying in a relationship you know is toxic. 9) Kehlani - FoldedIntroduced by nostalgic strings, Folded became Kehlani's first Top 10 hit in her native US, blending classic R&B themes of heartbreak and longing with modern production. Using the simple act of folding an ex-lover's clothes as jumping off point, Kehlani captures the  emotional push-and-pull of saying goodbye.8) Addison Rae - Headphones OnAddison Rae is a student of pop, and Headphones On is her master thesis – a hymn to music that whisks you away from the world for three minutes of distracted, hypnotic solace.7) Amaarae - SMOA seduction, a come-on, a hedonistic exploration of physicality. \"Ginga me,\" Amaarae sings repeatedly over a throbbing electro groove – referencing the fluid, hip-swaying movements of the Brazilian martial art Capoeira. You'll succumb, and you'll enjoy it.6) Bad Bunny - Baile InolvidableThis boisterous, captivating salsa was recorded live with student musicians from Puerto Rico's Escuela Libre de la Música (take that, AI). But the celebratory atmosphere masks a broken heart, as Bad Bunny is reminded of the ex who taught him to dance. \"I thought I'd grow old with you,\" he laments.NetflixK-Pop Demon Hunters' effervescent soundtrack was a breakout hit 5) Huntr/x – GoldenSometimes a song escapes its origins and goes into orbit. Golden was the last song written for Netflix's hit animation K-Pop Demon Hunters, but its soaring chorus became an anthem for anyone striving to achieve their dreams. An Oscar nomination beckons.4) Chappell Roan - The SubwayTwo things you can expect from Chappell Roan are theatricality and emotional honesty. The Subway delivers both, becoming a map of loss that carries listeners through a breakup on the streets and subways of New York - capturing that confusing limbo of experiencing grief and loneliness, surrounded by hundreds of strangers.3) Lady Gaga - AbracadabraA triumphant return to the sound of her debut album, Abracadabra takes all the Lady Gaga tropes – Nonsense lyrics! Demonic synths! Gothic choruses! – and dials them up to 11. An absolute banger.2) Olivia Dean - Man I NeedOlivia Dean says Man I Need is a song \"about knowing how you deserve to be loved and not being afraid to ask for it\". The object of her affections just needs a nudge in the right direction, and this playful, soulful melody should easily set the romance on track.1) PinkPantheress - IllegalOne of pop's most overused clichés is that falling in love is intoxicating, just like drugs! So it's a credit to PinkPantheress that she's made the idea sound fresh – zoning in on the fraught awkwardness of hooking up, whether it's with a dealer or a potential new partner. \"It feels illegal,\" she frets, as her heartbeat races with the drumbeat of this smouldering dance-pop anthem.The methodologyBBC News compiled more than 30 year-end lists published by the world's most influential music magazines and critics - including the NME, Rolling Stone, Spain's Mondo Sonoro and France's Les Inrockuptibles.Records were assigned points based on their position in each list - with the number one album or single getting 20 points, the number two album receiving 19 points, and so on.The results were the closest we've ever seen. Just 52 points separated Rosalía's Lux from the number two album, Geese's Getting Killed. In the singles countdown, PinkPantheress was the runaway winner - but the rest of the field was tightly packed, reflecting a year where there haven't been many universally popular, culturally dominant songs.The publications we surveyed included: Albumism, Billboard, Buzzfeed, Clash, Complex, Consequence of Sound, Dazed, Daily Mail, Dork, Double J, Entertainment Weekly, Exclaim!, The Fader, Flood, The Forty Five, Gorilla vs Bear, The Guardian, Independent, LA Times, Les Inrocks, Line of Best Fit, MOJO, Mondo Sonoro, NME, New York Times, Paste Magazine, Pitchfork, Pop Matters, Rolling Stone, The Skinny, Slant, Stereogum, The Telegraph, Time Magazine, Time Out, The Times, Uncut and Vulture.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The best albums and songs of 2025: Unexpected comebacks and operatic pop",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c893/live/9de13d30-db31-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-21T00:26:17.000Z",
      "dateModified": "2025-12-21T00:26:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Israel's grassroots hostage families group became a powerful international force",
    "url": "https://www.bbc.com/news/articles/cm20ppy0rreo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/48f6/live/19049120-dd2a-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2025-12-21T06:05:14.000Z",
    "description": "2 hours agoYolande KnellMiddle East correspondent, JerusalemBBCItzik Gvili demands the return of his son Ran, the last dead hostage in Gaza, in Tel Av",
    "body": "2 hours agoYolande KnellMiddle East correspondent, JerusalemBBCItzik Gvili demands the return of his son Ran, the last dead hostage in Gaza, in Tel Aviv's Hostages SquareIn central Tel Aviv, the main stage has now been dismantled in Hostages Square, the focal point for the campaign over the past two years to bring back Israelis held in Gaza.Nearby, signs and posters have been taken down, and the Hostages and Missing Families Forum has vacated the offices that served as its nerve centre. Of the 251 hostages seized by Hamas and other Palestinian armed groups in the 7 October 2023 attacks, 168 have been brought back alive from Gaza, eight have been rescued. Only one deceased hostage, Ran Gvili, remains.With songs and prayers instead of mass rallies, the Gvili family and a small crowd of supporters assemble in Hostages Square each Friday to mark the start of the Jewish Sabbath; this week, a candle for the Hanukkah holiday was also lit. They are determined to bring back the young police officer who was killed by Hamas fighters after he rushed to help people being attacked in Kibbutz Alumim in southern Israel in October 2023.\"I feel every day is still the 7 October. We didn't pass the 7 October, but we are strong, and we're waiting for him. We do whatever we need,\" says Itzik Gvili, Ran's father. \"This gives us hope: the support of the people.\"ReutersThe Hostages and Missing Families Forum's slogan is: \"Bring them home now\"From the start, people power has been key to the hostage families. As its operations wind down, members of the Hostages Families Forum have been reflecting on its extraordinary evolution which turned the grassroots group into a powerful international lobbying force.In the terrible aftermath of the 2023 Hamas-led assault on southern Israel, which also killed some 1,200 people, a huge group of distraught relatives gathered for the first time in Tel Aviv desperately seeking answers about their missing loved ones. Because of the incoming rocket fire from Gaza, they met in an underground car park.\"We were together, shocked, and it fell on me that this is actually real, that now we are going to face this unbelievable challenge of understanding where all these people are, getting them home,\" recalls Gil Dickmann, whose cousin Carmel Gat had been snatched from Kibbutz Be'eri.\"And the second thing is that we're going to do this together. I'm not going to stand alone.\"ReutersGil Dickmann (2nd R) said the public support gave him hope after kidnapping of his cousin, Carmel GatThe formation of the new forum, with its slogan: \"Bring them home now\", gave the hostages' families a much-needed sense of regaining control.\"It was very, very powerful to feel that when the government and Israeli state, in a way collapsed in those very first few days after 7 October, it felt like nothing was working, what was working was Israeli society,\" Mr Dickmann says. \"So many wonderful people came to help. That brought me a lot of hope.\"Dividing its efforts between supporting the families - many of whom were bereaved and displaced from their homes following the attacks - and campaigning in Israel and around the world, the Hostages Families Forum worked with more than 10,000 volunteers. They included former Israeli diplomats, lawyers and security officials.Funded entirely by donations, it began to pay some staff, and a high-tech company loaned its central Tel Aviv office space.ReutersA makeshift tunnel symbolizing Hamas's tunnel network in Gaza was constructed at Hostages Square In November 2023 - more than six weeks into the brutal war in Gaza, which had by then killed more than 14,000 Palestinians according to the Hamas-run health ministry - Israel and Hamas agreed to a Qatar-mediated truce.This saw most women and children hostages returned in exchange for Israel releasing more than 240 Palestinian prisoners, all women and children. Hamas also freed some foreign nationals.But after a week, the fighting resumed with ferocity. About half of the hostages were left in Gaza. In December, three Israeli hostages were killed by Israeli soldiers in Gaza despite the fact they were shirtless, waving a makeshift white flag, and calling out in Hebrew.Israeli Prime Minister's Office/handout via ReutersItay Regev and his sister Maya were released during the November 2023 ceasefireThose were difficult days for the Hostages Families Forum and in early 2024, with polls suggesting more Israelis prioritised eliminating Hamas over the return of those still held captive, it brought in political strategist, Lior Chorev, as campaign manager.\"We were in deep war in Gaza, deep war in Lebanon, there was the Iranian threat, and it appeared that everything was stuck, and public opinion was against us,\" Mr Chorev explains.\"As a civil society organisation, we could not impact whether or not there's going to be a deal, but we could work hard on the Israeli public opinion to ensure that if a deal came into place, it would have a sound civilian majority within the country.\"ReutersGaza has been devastated by the two-year war sparked by 7 October 2023 Hamas-led attacks on IsraelAs well as Saturday evening demonstrations in the plaza in front of the Tel Aviv Museum of Art, now renamed Hostages Square, there were near-daily actions by the Hostages Families Forum ranging from concerts and art installations to civil disruption. Media and diplomatic teams helped keep the hostages at the centre of attention.\"They kept going 24/7 for two years,\" comments Times of Israel political correspondent Tal Schneider who, like visiting foreign officials, often went to the forum's HQ. \"This place became like a foreign ministry for the country, for the families of 250 people.\"Looking back, Michael Levy says his intensive campaigning helped him deal with the \"emotional rollercoaster\" after his sister-in-law, Einav, was killed at the Nova Festival and his younger brother, Or, was taken hostage alive.\"The only thing that helped me was becoming active. I was interviewed all the time. I went with 15 different delegations to over 12 countries. I spoke to whoever was willing to listen and didn't want to stop and think,\" Mr Levy says.\"You need to stay optimistic all the time. You need to tell yourself every morning that today is going to be the day that he's going to be released, even though you know you are lying to yourself.\"ReutersMichael Levy's brother, Or, was released during the ceasefire that lasted from January to March 2025Although a hostage-prisoner exchange deal to end the war laid out in mid-2024 was described by then-US President Joe Biden as an Israeli proposal, Israel's Prime Minister Benjamin Netanyahu was widely seen as dragging out hostilities to aid his own political survival – a claim he rejected.Tensions rose between the Hostages Families Forum and Israel's government; there was open animosity from some government supporters.The situation worsened after a Netanyahu aide was accused of deliberately acquiring and illegally leaking a top-secret document to a German newspaper to influence how Israel's public viewed negotiations on a ceasefire and hostage deal. The document was misleadingly cast as suggesting that pressure on the prime minister played into the hands of Hamas.ReutersHundreds of people were killed or taken hostage at the Nova music festival during the 7 October 2023 attacksFor Mr Dickmann and Mr Levy, there was a low point when they headed to Washington for Netanyahu's address to a joint meeting of US Congress in July 2024 with other forum members.They showed off T-shirts saying \"Seal the deal\" during an ovation for the Israeli leader and were arrested for an unlawful demonstration. \"That was one of the moments in which I felt most alone,\" Mr Dickmann says. \"It was one of the most frightening things and it was while Carmel was still alive in captivity.\"The worst news came a month later when Carmel and five other hostages were killed by their Hamas captors, as the Israeli military closed in nearby.Mr Dickmann says it was only an \"unbelievable support group\" of younger forum members that helped him get through the ordeal.After the Israeli deaths were confirmed, angry protesters flooded the streets of Israeli cities. The forum puts the total number at 600,000.In Tel Aviv, a crowd of hostage families and their supporters marched with six prop coffins. A crowd gathered outside Israel's military headquarters and clashed with police on a major road.EPAThe killing of Carmel Gat and five other hostages by their Hamas captors sparked a huge protest in Tel AvivBy the start of 2025, international opposition to the devastating Gaza war had reached new heights as the number of Palestinians killed approached 48,000, according to Gaza's health ministry.In Israel, polls indicated a clear shift in Israeli public opinion, with a growing majority backing a hostage deal to end the war. With the election of a new US president, the Hostages Families Forum was increasingly directing its efforts stateside.\"They needed to bypass their own government,\" comments Ms Schneider.  \"The most important person for the job was obviously [US] President [Donald] Trump. There were signs written in English carried by the people and they would pack all their messages into a one-minute video, and they'd send it to him.\"Working with regional mediators, the US secured a new Gaza deal between Israel and Hamas in January 2025, just as Trump took office. The first stage brought back 33 hostages – eight of whom were dead – in exchange for nearly 2,000 Palestinian prisoners and detainees. Five Thai hostages were also released.But in mid-March, Israel ended the ceasefire, resuming its heavy bombing of Gaza, without starting talks on the deal's second stage, which involved a full end to fighting and the return of the remaining hostages.The White HouseReleased hostages travelled to Washington to ask President Donald Trump to ensure the return of those left behind in GazaFrail and emaciated following his release in February under the ceasefire deal, Or Levy was emotionally reunited with his three-year-old son, his parents and brother Michael. However, Michael's joy was short-lived. He quickly resumed his campaigning with others in the Hostages Families Forum.\"I got what I wanted, I got my brother back, but I couldn't just stop,\" he says, \"I couldn't be happy because in those 491 days, they became my family. I almost felt I knew all the other hostages, that every hostage still there was part of my family.\"Newly freed hostages gave TV interviews saying they had been starved and beaten in captivity, sometimes in response to the ill-treatment of Palestinian prisoners held by Israel. Despite their trauma and fragile health, a few of the former hostages travelled to the White House urging President Trump to use his influence to bring back all the living and dead Israelis they had left behind in Gaza.ReutersEvyatar David was among the last 20 living hostages freed shortly after the current ceasefire began in OctoberThere were more dramatic moments.In September, an Israeli air strike unsuccessfully targeted the exiled Hamas leadership as it met in Qatar, a regional mediator, to discuss a new ceasefire proposal presented by the US.However, the ultimate effect was to push the Trump administration - backed up by its Arab allies – towards a new plan to end the war, which had by then killed more than 67,000 people in Gaza, according to the territory's health ministry.Israel and Hamas agreed a ceasefire deal, under which all 20 living and 28 dead hostages still in Gaza would be handed over in return for almost 2,000 Palestinian detainees and prisoners in Israeli jails, as well as a surge in humanitarian aid and a partial Israeli withdrawal.ReutersIsrael released about 250 Palestinian prisoners and 1,700 detainees from Gaza in exchange for the living hostagesWhen Trump's Middle East envoy, Steve Witkoff, and the president's son-in-law, Jared Kushner, arrived in Israel just after the latest ceasefire started on 10 October, they were greeted by rapturous applause on stage in Hostages Square.On 13 October, the remaining living hostages came back.\"I'll never have a happier day in my life,\" says Mr Dickmann, remembering seeing his best friends reunited with their loved ones.Mr Chorev, the Hostage Families Forum's chief strategist, considers that long-held Jewish and Israeli traditions won through.\"This basic value of the Israeli theme that you don't leave anyone behind, that you're responsible for each and every Israeli held by the enemy, this was something that was unclear to certain elements in the Israeli government,\" he says. \"But it was very clear to the Israeli public.\"Tali (L) has been helping out hostages' families since the beginning of the warSlowly, 27 of the dead hostages' bodies have been returned to Israel over the past two months.Amid the ruins of Gaza, where health ministry officials say the number of Palestinians killed has risen to more than 70,000, Hamas operatives and the Red Cross have been searching for Ran Gvili's body east of Gaza City.Now, the last funds of the Hostages Families Forum are being used to support the Gvilis and a few dozen volunteers continue to head to Hostages Square on Fridays.\"We have been here in the rain and in nearly 50-degree [Celsius] heat, from winter to summer,\" says Tali, from Tel Aviv. \"Now that this is nearly over, I have mixed emotions. There is still one hostage who hasn't come back. I told myself I would stay until the last one.\"A symbolic tunnel, a large \"Hope\" sign and a piano put in the square in honour of now released hostage, Alon Ohel - a musician - have not yet been removed, nor has the giant countdown board which marks the days since 7 October 2023. A final mass rally is promised for when Ran Gvili's body is returned for burial.Itzik and Talik Gvili are determined to bring their son Ran home for a proper burial Israel's prime minister has never appeared in Hostages Square, but he has met with released hostages and hostage families, including those from a small, alternative group to the Hostages Families Forum, the Tikva Forum. The Gvilis belong to both.The family joined a candle-lighting ceremony on the first night of Hanukkah with Netanyahu.\"We will bring Ran back, just as we brought back 254 out of our 255 abductees,\" the prime minister said. \"Some did not believe. I believe. My friends in the government believed. They said: 'It will be a miracle.' I said: 'This nation performs miracles.'\"But in Israel, painful questions linger over why more hostages' lives were not saved.The Hostages Families Forum recently released harrowing Hamas videos recovered in Gaza which show the six hostages who were later murdered, including Carmel Gat, celebrating Hanukkah in a tunnel in 2023.The hostage crisis continues to cast a long shadow over Israeli society; even as many take heart from the families' message of endurance and solidarity.Additional reporting by Davide Ghiglione and Gidi Kleiman",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Israel's grassroots hostage families group became a powerful international force",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/48f6/live/19049120-dd2a-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-21T06:05:14.000Z",
      "dateModified": "2025-12-21T06:05:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: George visits 'Di homeless shelter' and shops face 'last Christmas'",
    "url": "https://www.bbc.com/news/articles/c80x2k0ldz7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ec11/live/26982b20-ddf8-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2025-12-21T00:24:20.000Z",
    "description": "8 hours agoMany of the papers feature a portrait of Prince George accompanying his father, the Prince of Wales, helping to prepare meals at a London h",
    "body": "8 hours agoMany of the papers feature a portrait of Prince George accompanying his father, the Prince of Wales, helping to prepare meals at a London homeless shelter. The Sunday Mirror says the 12-year-old was \"shown around The Passage in London with Prince William, 43, who was taken there by Princess Di in 1993\".The Observer leads with an interview with Wes Streeting, in which he wonders \"why anyone would want to be PM\". The health secretary, who last month dismissed suggestions from the prime minister's allies that he was seeking to challenge for the leadership, discusses \"leadership, the doctors' strike and why UK taxes are too high\".Labour's \"parking space ban\" leads the Sunday Telegraph, which reports that the government plans to impose limits on \"the number of spaces on new housing developments\". While the government hopes it will \"discourage car use in favour of greener alternatives such as using public transport\", the paper quotes critics who say it amounts to a \"war on motorists\".The Sunday People's top story is the proposed ban on trail hunts. The \"cruel sport\", as animal rights campaigners call it, involves \"animals and pets... chased and killed by packs of hounds supposed to be following the scent\".EastEnders actress Jacqueline Jossa has been sent death threats via social media, reports the Sun on Sunday. It reports that police were called to the BBC studios, with an unnamed source telling the paper \"they [the threats] were sinister enough to raise the alarm and take action\".High street businesses fear this Christmas could be their last, according to the Sunday Express, as consumers reel from the Budget. Shops and pubs fear a looming recession as \"consumer confidence dries up, the economy stagnates and unemployment rises\", the paper reports. The Mail on Sunday leads with a \"furious landlord\" who has barred Chancellor Rachel Reeves from entering his pub \"over tax hikes crippling the hospitality industry\". Martin Knowles, who owns the Marsh Inn in Reeves's Leeds constituency, says he has been hit with a \"£2,500 hike in business rates\" since Labour won power in July 2024.\"Beijing buys up homes across London\", is the headline splashed across the front page of the Sunday Times. China's government boasts \"a portfolio of 50 properties in England, including multi-million pound mansion houses and blocks of flats in London\", according to the paper. It writes China is \"increasing its diplomatic presence as it prepares to build a new embassy in Britain\".The Independent leads with its interview of British man Aiden Aslin, who was \"sentenced to death for fighting Putin\". The paper reports \"he was captured and tortured by Putin's forces and condemned to die after a show trial\". Aslin, who returned to the UK in 2022 after being freed and is now \"back in uniform\", claims to \"know just how Kyiv can win\" its war against Russia, according to the paper.An extra 125,000 pints will be brought in for \"thirsty fans\" at Alexandra Palace for the Darts World Championships, the Daily Star reports. \"Super, smashed, great!\" is the headline, in reference to the catchphrase of TV show Bullseye's host Jim Bowen \"super smashing great\". An investigation by the Sunday Times reveals that China has been buying homes across London, the majority of which have \"no clear use\". It reports that Beijing is also \"increasing its diplomatic presence as it prepares to build a new embassy\" in the capital. But the former Conservative leader Sir Iain Duncan Smith, who has been sanctioned by China, condemns what he calls \"an invasion of spies\".What's described as a government \"crackdown on parking spaces\" is the lead story in the Sunday Telegraph. It says new guidance is being published, requiring councils in England to limit the number of spaces on new housing developments. The Ministry of Housing says drivers will continue to have enough parking options under the changes.The health secretary, Wes Streeting, addresses speculation about a potential Labour leadership bid in an interview with the Observer. He tells the paper a \"bizarre drive-by\", in which he was accused of plotting to challenge Prime Minister Sir Keir Starmer, is now \"water under the bridge\". When pressed on his ambitions, he says he is \"diplomatically ducking\" the question. \"This is not a pitch or a job application\", he says. \"The prime minister has got my absolute support\".\"You're barred, Rachel\" is the headline in the Mail on Sunday, which reports Chancellor Rachel Reeves has been banned from her local pub in her constituency in Leeds. The landlord of the Marsh Inn, who was photographed with Reeves shortly after Labour's election victory, is reported to have put up a sign, making it clear that no Labour MPs are welcome because of the rise in business rates.And the front page of the Sunday Mirror features a photo of Prince George helping out at a homeless shelter in London, more than 30 years after it was visited by Princess Diana and an 11-year-old Prince William. The paper says George is \"following in his gran's footsteps\", while the Sun quotes the shelter's boss as saying that \"it was a lovely moment in terms of coming full circle from 1993 to 2025\".Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: George visits 'Di homeless shelter' and shops face 'last Christmas'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ec11/live/26982b20-ddf8-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-21T00:24:20.000Z",
      "dateModified": "2025-12-21T00:24:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Australian PM announces intelligence review as country mourns Bondi attack",
    "url": "https://www.bbc.com/news/articles/c5ydzl0nwqeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f372/live/d1aebac0-de29-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2025-12-21T06:41:49.000Z",
    "description": "2 hours agoWatch: 'You can't let fear win' - Bondi beachgoers return after fatal attackKaty Watson,Australia Correspondent at Bondi BeachandHarry Seku",
    "body": "2 hours agoWatch: 'You can't let fear win' - Bondi beachgoers return after fatal attackKaty Watson,Australia Correspondent at Bondi BeachandHarry SekulichAustralia's Prime Minister Anthony Albanese has announced a review into the police and national intelligence agencies after the Bondi Beach attack in Sydney.\"The ISIS-inspired atrocity last Sunday reinforces the rapidly changing security environment in our nation,\" Albanese said, using an acronym for the Islamic State group. \"Our security agencies must be in the best position to respond.\"The shooting, in which15 people were killed after two gunmen - father and son - opened fire at a Jewish festival has been declared a terrorist incident. Police say the attackers were inspired by \"Islamic State ideology\". A national day of reflection is being held on Sunday. A minute's silence will be observed at 18:47 (07:47 GMT) - the time when the attack began.Albanese said the intelligence review, due by April 2026, would focus on ensuring authorities were equipped to tackle extremism.He said: \"The Department of Prime Minister and Cabinet will examine whether federal law enforcement and intelligence agencies have the right powers, structures, processes and sharing arrangements in place to keep Australians safe in the wake of the horrific antisemitic Bondi Beach terrorist attack.\"In the wake of Australia's deadliest mass shooting in almost three decades, the government has also announced plans to tighten gun controls, while the New South Wales premier is pushing to crack down on hate speech.Naveed Akram, 24, has been charged with 59 offences, including 15 counts of murder and one of committing a terrorist act. His father Sajid was killed during the attack.Surfers and swimmers pay tribute to victims of Bondi shooting on FridayEarlier on Sunday, Governor-General Samantha Mostyn addressed a vigil held in Bondi, hosted by the National Council of Jewish Women Australia, where attendees largely wore white to symbolise peace.\"The entire Jewish community, whether it's here in Bondi or across our nation, you are part of the belonging story and the success of this country,\" she said.Australians across the country are still reeling and there's a sense of shock and disbelief that something like this could have happened. But this weekend, normality returned in some ways. Bondi promenade was once again filled with surfers, runners and dog-walkers returning to their regular routine.While a sombre mood lingers, children's surf club activities - known locally as \"nippers\" - resumed on Sunday as a sign of the community showing resilience. The bridge where two gunmen opened fire on a crowd of people at a Jewish festival at Bondi beach on Sunday, 14 December.Bullet holes in a car's windshield parked at Bondi a harrowing reminder of the violent attack North Bondi's Surf Life Saving president Steve Larnach told the BBC they had considered cancelling the regular nippers events.\"We were also aware of the sensitivity towards our Jewish community,\" Larnach said. \"We did ask their opinion, they were very supportive of us going ahead but also extremely grateful for what we did.\"Lifeguard volunteers were among the first on the scene at the shooting last week providing first aid, Larnach added. Some surf lifesavers have been hailed as heroes, including one who was photographed sprinting from a neighbouring beach with a red first aid kit slung over his shoulder.Geraldine Nordfelft, who brought her daughter to nippers, said \"it was really important to return to whatever this new normal is as soon as we could\".\"You have to return, you can't stay away, you can't let fear win. The beach is the Australian way of life and we all love it,\" she told the BBC. Geraldine Nordfelft brought her daughter to 'nippers' on SundayMore on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australian PM announces intelligence review as country mourns Bondi attack",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f372/live/d1aebac0-de29-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-21T06:41:49.000Z",
      "dateModified": "2025-12-21T06:41:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Best Bits of Newscast's Podcast-a-Thon (Part One) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mpq5kd?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-20T15:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·20 Dec 2025,·28 minsThe Best Bits of Newscast's Podcast-a-Thon (Part One)NewscastAvailable for over a yearToday, we’re bringing you some of the best bits from Newscast’s 25-hour Podcast-A-Thon!\nBack in November, Adam was challenged by Pudsey Bear to record a 25-hour long episode of Newscast in aid of Children In Need. Keeping Adam company were many friends of the podcast including paranormal podcasters Danny Robins and Tristan Redman, satirist Armando Iannucci, The Traitors star Alexander Dragonetti and Lisa Costello delivering a masterclass in the Shipping Forecast!\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Best Bits of Newscast's Podcast-a-Thon (Part One) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-20T15:00:00.000Z",
      "dateModified": "2025-12-20T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US seizes vessel in international waters off Venezuela's coast, officials say",
    "url": "https://www.bbc.com/news/articles/c0mpy1ynnzzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/01ab/live/12a8ded0-dded-11f0-afbd-d1ba55b6b5b2.jpg",
    "tag": "Trending",
    "date": "2025-12-21T00:44:40.000Z",
    "description": "The US has seized an oil tanker that had recently departed from Venezuela, according to the US Department of Homeland Security.It is the second time t",
    "body": "The US has seized an oil tanker that had recently departed from Venezuela, according to the US Department of Homeland Security.It is the second time this month that the US has seized an oil-carrying ship off the country's coast. The move comes after US President Donald Trump said on Tuesday that he was ordering a \"blockade\" of sanctioned oil tankers entering and leaving Venezuela.Venezuela has condemned the latest US seizure, describing it as \"theft and kidnapping\". Venezuela has previously accused the US of trying to steal its resources. \"These acts will not go unpunished,\" a statement from the Venezuelan government said, adding that it intends to file a complaint with the UN Security Council and \"other multilateral agencies and the governments of the world\".The operation was led by the US Coast Guard, similar to the operation earlier this month. The ship was boarded by a specialised tactical team, and was in international waters when it was taken.Department of Homeland Security Secretary Kristi Noem, whose department oversees the Coast Guard, shared a video of the operation on X. \"In a pre-dawn action early this morning on Dec 20, the US Coast Guard with the support of the Department of War apprehended an oil tanker that was last docked in Venezuela,\" Noem wrote.She posted a seven-minute video of the operation, which shows US helicopters landing on the deck of a ship with the name Centuries written on the side. \"The United States will continue to pursue the illicit movement of sanctioned oil that is used to fund narco terrorism in the region,\" Noem wrote, adding: \"We will find you, and we will stop you.\"The Centuries is a Panamanian-flagged ship, but in the past five years it has also sailed under the flags of Greece and Liberia, according to records seen by BBC Verify.It is not on the US Treasury's list of sanctioned vessels.In recent weeks, the US has been building up its military presence in the Caribbean Sea and has carried out deadly strikes on alleged Venezuelan drug-smuggling boats, killing around 100 people.The US has provided no public evidence that these vessels were carrying drugs, and the military has come under increasing scrutiny from Congress over the strikes.The US has accused Venezuela President Nicolás Maduro of leading a designated-terrorist organisation called Cartel de los Soles, which he denies.The Trump administration accuses him and the group of using \"stolen\" oil to \"finance themselves, Drug Terrorism, Human Trafficking, Murder, and Kidnapping\".Following the seizure of the second ship, Defence Secretary Pete Hegseth posted on X that the US will continue to \"unflinchingly conduct maritime interdiction operations... to dismantle illicit criminal networks.\" \"Violence, drugs, and chaos will not control the Western Hemisphere.\"Venezuela - which is home to the world's largest proven oil reserves - is highly dependent on revenues from its oil exports to finance its government spending.Trump's announcement of a \"blockade\" came less than a week after the US seized an oil tanker believed to be part of the \"ghost fleet\" off the coast of Venezuela, which allegedly used various strategies to conceal its work.The White House said the vessel in question, called the Skipper, had been involved in \"illicit oil shipping\" and would be taken to a US port.Venezuela's government decried the move, with Maduro saying the US \"kidnapped the crew\" and \"stole\" the ship.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US seizes vessel in international waters off Venezuela's coast, officials say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/01ab/live/12a8ded0-dded-11f0-afbd-d1ba55b6b5b2.jpg"
      ],
      "datePublished": "2025-12-21T00:44:40.000Z",
      "dateModified": "2025-12-21T00:44:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dancing is key to my longevity, says 102-year-old York woman",
    "url": "https://www.bbc.com/news/articles/cvg14q1y3p2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5204/live/33c81210-db28-11f0-9089-5fe5b3125085.jpg",
    "tag": "Trending",
    "date": "2025-12-19T07:00:31.000Z",
    "description": "2 days agoFiona CallowYorkshireAge UK YorkJosie, now 102, took up tap and ballet dancing in York at the age of 60A 102-year-old woman with a lifelong ",
    "body": "2 days agoFiona CallowYorkshireAge UK YorkJosie, now 102, took up tap and ballet dancing in York at the age of 60A 102-year-old woman with a lifelong love of dancing has said that actively taking up the hobby in later life has been \"beneficial\" to her longevity. Josie said she had always dreamed of dancing like Fred Astaire, and decided to take up tap and ballet at a dance school in York when she turned 60.For her recent birthday, she was surprised by another famous dance idol, former Royal Ballet dancer Wayne Sleep, who sent a personal message encouraging her to \"keep going\". Josie said: \"If you took dancing away from life, there would a lot of pleasure gone from it.\"\"It's been a big part of my life just watching it,\" she explained.\"If there wasn't Gene Kelly and Fred Astaire to watch, there'd be hours of pleasure missing\".Josie said that after decades of observing, she decided to try out dancing for herself, fulfilling a long-held ambition of learning to dance like the stars she admired. While she had concerns about starting at the age of 60, her teacher, Ms Dunn, whose dance school closed in 2009 after 65 years, \"insisted my age was not an issue\", Josie said.She went on to dance for many years, reaching what she said was \"a decent standard\", and even performed on stage in a top hat and tails.Jeff Spicer/Getty ImagesFormer Royal Ballet dancer Wayne Sleep sent a video message to Josie encouraging her to \"keep going\"Josie said she credited her love of dancing with playing a key role in her longevity.\"I think all the dancing was beneficial, given my age,\" she said.\"They say now how important it is to keep fit and active. When I danced, I didn't know I was exercising – to me, I was just dancing and having fun.\"Dancer Sleep's birthday message to Josie, arranged by the Age UK social group she regularly attends, included a video of the star dancing up to the camera.Addressing Josie directly, Sleep told Josie: \"I heard you started dancing like Fred Astaire when you were 60.\"Keep going, darling - I know you're over 100.\"Josie said she met Sleep in person years earlier, outside York Theatre Royal's stage door, to give him paintings of the dancer Vaslav Nijinsky which she had created herself.Sleep took them and \"gave me a kiss on my cheek\" as thanks, she recalled.More stories like thisRelated Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dancing is key to my longevity, says 102-year-old York woman",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5204/live/33c81210-db28-11f0-9089-5fe5b3125085.jpg"
      ],
      "datePublished": "2025-12-19T07:00:31.000Z",
      "dateModified": "2025-12-19T07:00:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Global News Podcast - First batch of Epstein files released - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mpt4lc?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mpt4ml.jpg",
    "tag": "Trending",
    "date": "2025-12-20T04:51:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·20 Dec 2025,·31 minsAvailable for 88 daysAfter months of political wrangling, parts of the long-awaited Epstein files have been released by the US Justice Department. The trove consists of thousands of documents related to the late sex-offender. Pictures include the former US President Bill Clinton, Andrew Mountbatten-Windsor - Britain's former prince, musicians Mick Jagger and Michael Jackson. Being named or pictured in the files is not an indication of wrongdoing. The justice department did not release all existing files, and the published ones were heavily redacted, prompting frustrated reactions from survivors of Epstein's abuse.\nAlso: the US carries out dozens of strikes against the Islamic State group in Syria. Anti-government youth protesters in South Korea are taking cues from the American right's MAGA movement. Italy announces a fee for tourists to visit the Trevi Fountain in Rome. Putin vows revenge on Ukraine after an oil tanker was blown up in the Mediterranean Sea. Palestinians tell the BBC they were sexually abused in Israeli prisons. And how a lost radio play by Tennessee Williams was found more than four decades after his death, and has now been heard for the first time.\nThe Global News Podcast brings you the breaking news you need to hear, as it happens. Listen for the latest headlines and current affairs from around the world. Politics, economics, climate, business, technology, health – we cover it all with expert analysis and insight.\nGet the news that matters, delivered twice a day on weekdays and daily at weekends, plus special bonus episodes reacting to urgent breaking stories. Follow or subscribe now and never miss a moment.\nGet in touch: globalpodcast@bbc.co.ukProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Global News Podcast - First batch of Epstein files released - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mpt4ml.jpg"
      ],
      "datePublished": "2025-12-20T04:51:00.000Z",
      "dateModified": "2025-12-20T04:51:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Strictly Come Dancing 2025 final: Winners crowned after Amber Davies, Karen Carney and George Clarke perform one last time",
    "url": "https://www.bbc.com/news/articles/cwyplq7zeqzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/06af/live/8c31edd0-ddef-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-20T23:24:02.000Z",
    "description": "Strictly winners crowned in glitzy live final9 hours agoNoor NanjiCulture correspondentWatch: Moment Strictly 2025 winners are crownedThis article rev",
    "body": "Strictly winners crowned in glitzy live final9 hours agoNoor NanjiCulture correspondentWatch: Moment Strictly 2025 winners are crownedThis article reveals the outcome of the Strictly Come Dancing 2025 final.Former Lioness Karen Carney has been crowned this year's Strictly Come Dancing winner, becoming the first footballer to lift the glitterball trophy.She beat Love Islander Amber Davies and social media star George Clarke after winning the public vote in Saturday's live final on BBC One.Carney, who was paired with professional dancer Carlos Gu, said: \"I can't believe it, it's been the biggest privilege and honour,\" before adding she was \"lost for words\".It was an emotional night in the ballroom, as Claudia Winkleman and Tess Daly hosted the final for the last time - with Queen Camilla among those paying tribute to the long-running hosts.Presenters Tess and Claudia say goodbye to Strictly Come DancingIn a message read out by judge Craig Revel Horwood, the Queen said Daly and Winkleman's \"warmth, compassion and sheer happiness\" had been at the heart of the show's success, adding: \"I think I speak for everyone when I say you have been utterly fab-u-lous\".Karen Carney and Carlos Gu with the giltterball trophy - their football-themed jive to One Way Or Another by Blondie earned them a standing ovationAs usual, one of the dances in the grand finale was chosen by the judges, one was their own favourite dance from the series, and the other was a show dance.The judges gave advisory scores but the public made the final decision.Carney and Gu performed routines including a show dance to Inner Smile by Texas, and an Argentine Tango to Red Right Hand by Nick Cave and The Bad Seeds.They also performed a football-themed jive to One Way Or Another by Blondie, earning them a standing ovation - and their second perfect score of the night.Amber Davies and Nikita Kuzmin were the first to take to the dance floor in the finalBut the winning duo faced stiff competition from the other remaining couples.Amber Davies and her partner, Nikita Kuzmin, were the first to take to the dance floor.The pair performed routines including a show dance to Rain On Me by Lady Gaga and Ariana Grande, a Paso Doble to Dream On by Aerosmith, and a jive to Proud Mary.Meanwhile, George Clarke and his partner Alexis Warr reprised their Paso Doble to Game of Survival by Ruelle.They also did their show dance to Human by The Killers, and a Viennese Waltz to Somebody to Love by Queen.But after weeks of tangos, salsas and foxtrots, it was Carney and Gu's night as they topped the public vote.\"I just want to say thank you to everybody that has supported our journey, and supported us,\" said Carney.Gu told her she had \"changed my life,\" adding: \"To the girls and boys watching at home, dream big and be proud and never give up.\"Social media star George Clarke and Alexis Warr chose to revisit their favourite dance from the series, a Paso Doble to Game of Survival by RuelleOther highlights on the night included the boyband Five performing a string of their hits during the grand final.Most of the cast of 2025 also came back for one more routine.However, social media personality Thomas Skinner did not attend. Speaking earlier today on social media, he claimed the BBC rigged the vote that saw him leave the show.A BBC spokesperson rejected the allegation, saying Strictly's public vote was \"independently overseen and verified to ensure complete accuracy\".Tess and Claudia's last finalIn October, Daly and Winkleman made the shock announcement that they would be stepping down at the end of this year's series.Daly has presented since the first series 21 years ago. Winkleman joined in 2014, having hosted Strictly's sister show It Takes Two since 2004.This was their last time presenting a Strictly final, and both were overcome with emotion as they signed off from hosting the show.During the live broadcast, as well as the tribute from the Queen, there were messages from TV cook Mary Berry, members of the crew and fans of the show.The Queen's message said: \"I have often thought that Strictly is not so much a show about dancing as about friendships: the bonds forged, the struggles overcome and the joy shared in undertaking a joint endeavour.\"If that is true, then perhaps yours has been the greatest Strictly partnership of all.\"The warmth, compassion and sheer happiness you have radiated with and from each other has been at the heart of the show's success.\"Daly and Winkleman's last ever appearance on the show will be the Christmas special, which airs on 25 December.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Strictly Come Dancing 2025 final: Winners crowned after Amber Davies, Karen Carney and George Clarke perform one last time",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/06af/live/8c31edd0-ddef-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-20T23:24:02.000Z",
      "dateModified": "2025-12-20T23:24:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'A good meal and a good poo': Kate Winslet describes how she dealt with media intrusion",
    "url": "https://www.bbc.com/news/articles/c20kymmxmxgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fa4a/live/01ec3040-dd9f-11f0-880c-9f4d353b75c0.jpg",
    "tag": "Trending",
    "date": "2025-12-21T00:25:35.000Z",
    "description": "8 hours agoSofia Ferreira SantosFilmMagic via Getty ImagesWinslet made her directorial debut with Goodbye June, released this monthKate Winslet has sp",
    "body": "8 hours agoSofia Ferreira SantosFilmMagic via Getty ImagesWinslet made her directorial debut with Goodbye June, released this monthKate Winslet has spoken about how she coped with \"appalling\" reporting and intrusion by the media after rising to fame as Rose in James Cameron's 1997 epic, Titanic.The actor and director said she was followed by paparazzi and had her phone tapped, with people even looking through her bins and asking her local shops what she bought to \"try and figure out what diet I was on or wasn't on\".\"It was horrific,\" she said. Years later, she experienced further intrusion during a marriage breakdown, adding the ways she dealt with the media attention were \"a good meal, a shared conversation, a nice cup of coffee, a bit of Radiohead and a good poo\".\"You know, life's all the better for those things,\" she told BBC Radio 4's Desert Island Discs.While filming Titanic in her early 20s, Winslet wasn't in a \"particularly good shape\" mentally around her body, she said.Though the experience of making the film was incredible, she said, her world was \"totally turned upside down\" once it hit cinemas.\"I wasn't ready for that world,\" she said.She said she had received negative comments about her appearance from a young age, recalling being nicknamed \"blubber\" by her peers at primary school as a child, and later being told she would have to \"settle for the fat girl parts\" if she wanted to be an actor by a drama teacher.From the ages of 15 to 19, she said she was \"on and off\" dieting, \"barely eating\" by the end.\"It was really unhealthy,\" she said.Once Titanic was released, she began to see herself on the cover of newspapers and magazines, often accompanied by what she described as \"awful, terrible, actually abusive names\".\"It was horrific. There were people tapping my phone. They were just everywhere. And I was just on my own. I was terrified to go to sleep,\" she said.Support from friends and those close to her was part of how she dealt with it then - including from a neighbouring couple who would leave her a \"bowl of steaming pasta and a little glass of red wine\" on the garden wall between their houses.CBS Photo Archive via Getty ImagesTitanic is one of the most successful films of all time, and won 11 Academy AwardsSpeaking further about her depiction in the media at that time, Winslet described how magazine cover images of her were edited without her knowledge - something she also famously spoke out about in the early 2000s.Speaking to Lauren Laverne, Winslet recalled looking at those types of images and thinking: \"I don't look like this. My stomach isn't flat like that. My legs are not that long, my boobs are not that big. What? My arms aren't that toned. What the hell?\"\"I didn't want any young woman, even just one, to look at that image and think, 'Oh my God, I want to look like that.' That's not me,\" she said.Jon Kopaloff/FilmMagic via Getty ImagesWinslet and her ex-husband, director Sam Mendes, after she won an Academy Awards for Best Actress in 2009Winslet also talked about the headlines that were printed after it emerged she was about to divorce from her second husband, film director Sam Mendes, in 2010.\"I was being followed by paparazzi in New York City with my two small kids, who wanted to, of course, know the reason why Sam and I had split up,\" she said.Asked how she dealt with that at the time, Winslet said: \"You just keep your mouth closed, you put your head down, and you keep walking. And you try and put your hands over your children's ears. You lean on your friends, you just keep going.\"Getty ImagesWinslet's son, Joe Anders, wrote the screenplay for Goodbye JuneLooking towards the present day, Winslet said that while the pressures of being a woman in the film industry may have changed with time, there is \"so much we still have to unlearn [...] about how we speak to women in film\".As she makes her directorial debut with the film Goodbye June, written by her son, Joe Anders, she said she had heard a number of things that \"would never be said\" to a male director.\"So they might say things like, 'Don't forget to be confident in your choices'.\"And I want to sort of say, 'Don't talk to me about confidence', because if that's one thing I haven't ever lacked, actually, it's exactly that. That person wouldn't say that to a man.\"Her reaction to it now?\"Shut up,\" she said with a laugh.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'A good meal and a good poo': Kate Winslet describes how she dealt with media intrusion",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fa4a/live/01ec3040-dd9f-11f0-880c-9f4d353b75c0.jpg"
      ],
      "datePublished": "2025-12-21T00:25:35.000Z",
      "dateModified": "2025-12-21T00:25:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hollies living 400 miles apart are best friends after transplants",
    "url": "https://www.bbc.com/news/articles/c4g4037rj52o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3b57/live/88438310-d9b1-11f0-b051-c9966e31459d.jpg",
    "tag": "Trending",
    "date": "2025-12-17T06:21:31.000Z",
    "description": "4 days agoKate BradbrookNorthamptonshire, DaventryFamily photoHollie B (left) and Hollie M met at Great Ormond Street Hospital in 2023Two schoolgirls ",
    "body": "4 days agoKate BradbrookNorthamptonshire, DaventryFamily photoHollie B (left) and Hollie M met at Great Ormond Street Hospital in 2023Two schoolgirls called Hollie who had double lung transplants in the same week have become best friends after meeting in hospital.Hollie M, 13, from Daventry, Northamptonshire, had been on the waiting list for three years while Hollie B, 12, from Bangor, County Down, was on the urgent transplant list for just 24 hours.They say their friendship means so much because they \"get everything\" they have both been through.The procedures took place at Great Ormond Street Children's Hospital, London, in 2023.Family photoHollie B was in hospital at the same time as Hollie MBoth Hollies had serious health conditions which affected their everyday lives.Hollie B underwent her double lung transplant first, followed by Hollie M, who had a heart transplant at the same time.\"She wrote me a note. It said, 'PS wanna be friends',\" remembers Hollie M, with a smile.\"She was worried about a procedure and I was telling her she didn't need to worried about it,\" said Hollie B.BBC/Kate BradbrookHollie M says she has found a friend \"for life\", and messages Hollie B every dayThe two girls message daily, meet regularly at hospital for clinics, and arrange to see each other socially.For the past two years, their families have celebrated the anniversary of their transplants together.\"The stars aligned... we'll be friends for life,\" said Andrea, Hollie M's mum.Marion, Hollie B's mother, added: \"There's something really special about having friends that have been through those same things.\"Family photoThe girls have celebrated two anniversaries of their transplantsThe girls' parents say the friendship has also helped them to cope in the months and years following their daughters' operations.\"In the same way that Hollie B gets Hollie, Marion and Gary completely understand what Bazz and I have been through. We all just click,\" said Andrea.Dr Rossa Brugha, consultant respiratory paediatrician at Great Ormond Street Hospital, said the friendship was \"quite rare\" as only about six paediatric lung transplants were carried out each year.\"I think it's fantastic that both these girls have made such a good recovery and that they appear to be really good friends for life,\" he said.You might also be interested inRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hollies living 400 miles apart are best friends after transplants",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3b57/live/88438310-d9b1-11f0-b051-c9966e31459d.jpg"
      ],
      "datePublished": "2025-12-17T06:21:31.000Z",
      "dateModified": "2025-12-17T06:21:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lottery winners scoop jackpot again in 24-trillion-to-one odds",
    "url": "https://www.bbc.com/news/articles/cx2pr1njl9vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d10c/live/9afac8b0-da79-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-16T18:04:08.000Z",
    "description": "Couple win £1m lottery jackpot for second time5 days agoNathan BevanBBC Wales'You can't get more luck than that': Couple celebrate second £1m lottery ",
    "body": "Couple win £1m lottery jackpot for second time5 days agoNathan BevanBBC Wales'You can't get more luck than that': Couple celebrate second £1m lottery winOne lucky couple has beaten extraordinary odds to win £1m on the National Lottery - for the second time.  Richard Davies, 49, and Faye Stevenson-Davies, 43, first scooped a seven-figure jackpot playing the EuroMillions Millionaire Maker in June 2018.And now they have done it again by matching five main numbers and the bonus ball in the Lotto draw on 26 November - the chances of which are more than 24-trillion-to-one, say experts.\"We knew the odds of it happening again were outrageous, but we're proof that if you believe anything is possible,\" said Faye, from mid Wales.National LotteryThe couple celebrating their first big win in 2018But, as Richard explained, their second win was not a case of simply picking the right numbers.\"It came to us through a series of four consecutive Lotto draws,\" he said.\"When you match two numbers in the Lotto draw, you automatically win a Lucky Dip for the next game and that's what's happened to us. \"We matched two numbers and won a free Lucky Dip from one draw which put us into the next draw and so on, until the winning draw on 26 November.\"According to experts at Allwyn, operator of the National Lottery, the odds of Richard and Faye winning both the EuroMillions Millionaire Maker and then five numbers and the bonus ball on Lotto are over 24-trillion-to-one.However, this latest windfall is unlikely to change the couple's community-minded attitude.Former hairdresser Richard uses his skills at a shelter for the homeless in Cardiff, a project which received vital National Lottery funding, while also helping out friends by working as a delivery driver.Meanwhile, ex-nurse Faye is a volunteer cook at Cegin Hedyn community kitchen in Carmarthen, while also providing mental health counselling services to local organisations such as Brecon & District Mind charity.\"The first time we won we gifted people cars, donated a minibus to the local rugby team and did our best to help friends and family,\" said Faye, who will even be working on Christmas Day. \"It was all new and it was amazing to be able to make a difference. \"This time around, who knows? We're just going to take our time and enjoy the moment.\"Speaking on BBC Radio Wales Drive, Richard said going public this time was \"something we didn't do lightly\".\"Since the first one we've been involved in quite a few events with the lottery and charity,\" he said.\"There's so much good out there and at the moment there's so much doom and gloom on the news. It's just a bit of cheer really.\"Andy Carter, senior winners' adviser at Allwyn, said: \"I can still remember the day I met Richard and Faye for the first time, and it's just as special to be with them as they celebrate their second £1m win. \"I saw the positive impact of that first win and know this second one will be just as meaningful.\"More top stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lottery winners scoop jackpot again in 24-trillion-to-one odds",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d10c/live/9afac8b0-da79-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-16T18:04:08.000Z",
      "dateModified": "2025-12-16T18:04:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why tinsel and colourful Christmas lights are on trend again",
    "url": "https://www.bbc.com/news/articles/cp398e49egpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/02e1/live/768f5370-dcf8-11f0-b67b-690eb873de1b.jpg",
    "tag": "Trending",
    "date": "2025-12-21T01:34:24.000Z",
    "description": "Maxing out on tinsel: Why retro Christmas decorations are cool again7 hours agoGrace DeanFelicity HaywardPeek the TV classic among the sea of retro pa",
    "body": "Maxing out on tinsel: Why retro Christmas decorations are cool again7 hours agoGrace DeanFelicity HaywardPeek the TV classic among the sea of retro paper chains and garlandsTinsel, foil garlands, multi-coloured floral lights and a lounge that looks like Christmas threw up all over it are making a return.Retro-themed decor is in, with trees jam-packed full of bold, mismatching decorations, as more people try to recreate a festive season from their childhood.The nostalgic shift started last year, say experts, but over-the-top (and tacky to some) has become one of the top decor trends for 2025.\"After a long run of pared-back, neutral or traditional Christmases, people seem much more willing to embrace fun, excess and nostalgia again,\" says Harry Bradshaw, from events and interiors styling company At Last Events.Felicity HaywardNo tree branches are being left empty as people embrace the brightly-coloured decorationsRetailers say they're seeing growing demand for decorations that can help recreate that familiar Christmas magic from years gone by.\"Maximalism is making a bold return,\" says Abi Wilson, head of seasonal and gift buying at Habitat, adding that people are turning to '80s and '90s-style colourful bells and bows, oversized ornaments and paper decorations.Primark said younger Gen X, millennials, and older Gen Z shoppers were buying decor that reminded them of their childhood.Marks & Spencer noted strong sales of its tinsel rosettes and tinsel tree skirts this year, while John Lewis said sales of \"retro-nostalgic decor\" had soared 180% in 2025.Felicity Hayward is going all out this year to find that Christmas joy.Back in October, as she browsed the charity shops near where she lives in Margate, Kent, she stumbled across a collection of colourful festive foil stars that reminded her of Christmas at her grandparents' house when she was a child.The 50p decorations started what became a two-month endeavour, looking for retro baubles, garlands, and anything she could find to recreate those special years growing up in the '90s.Felicity HaywardFelicity spent two months trawling round charity shop and antiques stores for Christmas decorations\"Christmas always revolved around my grandparents,\" Felicity, 37, says. The family would spend the day eating homemade cheese straws, listening to Frank Sinatra, watching Christmas movies and playing board games.\"When I think back to Christmas, I think back to their living room, and I think back to their decorations.\"Felicity HaywardFelicity's grandparents kept the same decorations for decades with her grandad declaring the baubles were \"for life\"Felicity hadn't bothered with any Christmas decorations since 2019. The combination of the pandemic and her grandparents' deaths in 2022 and 2023 had left her feeling far from festive.But this year, her living room is an explosion of colour, bedecked with foil stars, tinsel and homemade paper chains and ribbon garlands.Some people might see her decorations as \"tacky\", but Felicity says that \"for me, all of those colours bring me calm\".\"I literally cannot wait to get home on a night and turn all my Christmas lights on and lie on the sofa,\" she says.Felicity HaywardFelicity says her decorations this year remind her of spending time with her grandmother, Sybil, and grandfather, GeoffLiza Prideaux agrees understated decorations are overrated and has embraced \"nostalgic, vintage\" decor at Christmas for the last two years.\"There isn't a strict theme, it's more about colour, texture and creating a cosy, lived-in feeling,\" the 36-year-old from Devon says.\"The colourful incandescent lights are my favourite,\" she says. \"They make everything feel warm and cosy.\"How we sprinkle festive magic in our homes is a \"physical representation of what we emotionally need from our Christmas celebrations\", says Hannah Bartlett, who runs the business The Christmas Insider.The season is always a \"steady anchor\" and coming back to the same rituals and traditions each year can help \"ground us\", she says.But Ms Bartlett notes that the current \"uncertainty\" in the world is making people find even more comfort in those traditions that remind them of their childhood. There's a desire to \"return to simpler times\", she says.Decorations like tinsel and brightly-coloured lights \"take us back\", agrees 52-year-old Pandora Maxton from York, an influencer who means business with her elaborate festive displays.\"I think that's why it's having a revival, because it just takes people back to being kids. And that's what Christmas is about, isn't it?\"Holly LangleyHolly hosted a 1980s-themed Christmas despite not being born that decadeHolly Langley was born in 1990. But that didn't stop her from hosting an '80s-themed Christmas some 40 years later.Holly, 34, from Reading, hunted in charity shops and vintage fairs for foil decorations, satin baubles, tablecloths and china. On the day, she served Christmas cocktails and jam roly poly, with '80s music playing and a quiz about the decade.\"Every year we do the same thing, right? Everyone gets out their Christmas pyjamas, we watch the same TV shows, we eat the same food,\" Holly says. Her '80s-themed Christmas was \"a little bit different, a bit quirky, a bit fun\".Want to create your own retro Christmas? Here are Felicity, Holly and Lucy's tips:Check charity shops, especially immediately after Christmas when people might be having a clear-outLook on resale sites and apps, though be careful buying second-hand electronics like lightsMake paper chains that you can reuse for other celebrationsAsk relatives if they have any unwanted decorationsPlay '70s and '80s music videos, films or adverts in the backgroundSo why were decorations so bold and bright in the past?In 1970s Britain people were looking for a \"signal of hope\", says vintage decor collector Lucy Scott, in a time of austerity, trade union action and miners' strikes. It was also the age of flamboyant glam rock - Brits were going crazy for eye-catching style.But there were also simply fewer options available in the 1970s.\"There wasn't necessarily a massive amount of choice, but the choice was for these kind of bright space age tinsel decorations... the majority from Hong Kong,\"  says Lucy, 45, from Birmingham.This started to change in the 1980s, when more people owned their homes and retailers like Woolworths and BHS started selling a wider choice of decorations, Lucy says.Lucy ScottLucy, who collects old Christmas decorations, says the bright colours were a \"signal of hope\"But Felicity says she bought most of her decorations second hand. \"If you think about it, these tinsels are 20 to 30 years old and they're still intact,\" she says.And it's not just a trend for her. \"This won't be a Christmas, this will be my Christmas now forever.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why tinsel and colourful Christmas lights are on trend again",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/02e1/live/768f5370-dcf8-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-21T01:34:24.000Z",
      "dateModified": "2025-12-21T01:34:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]