[
  {
    "title": "Why there's no quick fix in sight for the problem of dazzling headlights",
    "url": "https://www.bbc.com/news/articles/cn71xyjpdl2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d2e4/live/a860eb00-0cd4-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-19T09:43:37.000Z",
    "description": "3 hours agoKaty AustinTransport correspondentBBCWhen Jane Kingsbury, 80, last had her eyes tested, she says her optician told her that her eyesight wa",
    "body": "3 hours agoKaty AustinTransport correspondentBBCWhen Jane Kingsbury, 80, last had her eyes tested, she says her optician told her that her eyesight was OK. But Jane, from Cambridge, says she is giving up driving at night because the feeling of being \"dazzled\" by other vehicles has left her feeling unsafe. \"I am worried about the glare from oncoming lights,\" she says.And when Jane mentioned this at a discussion group she attends, others felt the same. \"Over 90% of us did not want to drive in the dark,\" says Jane. \"So we have changed the time of our meetings from 7.30pm to 1.30pm [for much of the year] so that we can drive home before dark.\"Jane and her friends aren't alone. In a debate at Westminster last October, MPs voiced widespread concerns about bright headlights. Some described social isolation among constituents who had become too scared to drive in the dark.The RAC motoring organisation, which has campaigned on headlight dazzle, has repeatedly asked its members for their views. Most recently, more than half of respondents to a survey of 1,745 UK drivers in January this year felt the problem had worsened in the past 12 months. A third of those who said they were affected by dazzle said they felt less safe when driving at night.Getty ImagesHeadlight glare is an issue for all road users - not just motoristsIt's not only older drivers who feel this way. Emily McGuire from Essex told the BBC: \"I am in my 30s and sometimes I can't tell if [other vehicles'] main beam is on or off and once they have passed, I can't see properly for a good few minutes, it's terrible.\"She owns a smaller car and feels that she can't avoid the lights on higher, bigger cars: \"I suffer with migraines when a car approaches me with extremely bright lights, I have to look down or in the other direction… I also have to slow right down when it's really dark and I'm on a country lane.\"And experts say the problem is getting worse. Denise Voon, clinical advisor at the College of Optometrists - which also campaigns on the issue - says: \"I am a practising optometrist and I've noticed that maybe 15 years ago, you rarely had people coming in complaining about headlight glare. But now it's becoming more and more prevalent.\"It's an issue that has even reached the United Nations - it will mandate all new cars to automatically adjust their headlight levels.But this will only affect new cars. And so the questions many are asking are: what, if anything, can be done about all the cars currently out there causing headlight discomfort - and why did nobody spot that this might be a problem?The impact of changing headlightsExperts believe a number of factors can cause headlight dazzle.One is the angle of headlights. If misaligned, they are more likely to cause glare. Misalignment can cause a vehicle to fail its MoT test.Then there's the fact that headlights have got brighter, to help drivers see better.Headlights have moved a long way from the \"kind of brown glow\" produced by filament bulbs decades ago, according to Dale Harrow, professor of Intelligent Mobility and Car Design at the Royal College of Art in London. They have become more complex and \"a design object in their own right,\" he says.Glass casings have given way to plastic and significantly, the light source has changed too, with most people now using LEDs instead of halogen bulbs, he says - the quality has improved and lights are now \"brighter, but also a lot clearer\".Getty ImagesCar headlights have come a long way since the heyday of the Jaguar E TypeWhile this \"has to be a good thing\" when it comes to helping the driver see clearly, Harrow says, it has also resulted in \"unplanned drawbacks\" - including dazzling other road users.Another problem is the illegal retrofitting of LED bulbs, especially when fitted into units designed for halogen. The Driver and Vehicle Standards Agency has said it has stepped up a crackdown on retrofit bulbs, with sellers facing potential fines of up to £1,000.\"Recent advances in headlight technology have improved visibility but all headlights – whether LED or not – must still be aimed correctly and checked at the MOT test,\" says Mike Hawes, chief executive of the Society of Motor Manufacturers and Traders (SMMT).How bright lights affect our eyesOur eyes adapt in the dark to become a lot more sensitive to light, says Denise Voon. As a result, being suddenly hit by very bright lights can temporarily make it very hard to see, even causing pain.Retinal cells at the back of the eyes which detect the light can get bleached, and take a while to recover. That's when people notice an imprint remaining in their vision after looking away.Although headlight glare does affect younger people, age is thought to be a factor. Older people are more prone to conditions such as cataracts and glaucoma, for example.Bloomberg via Getty ImagesThere is widespread concern that glare is getting worse - but the statistics are unclearVoon says there are a number of reasons why LEDs may be particularly problematic. Firstly, they are two to three times as bright as traditional halogens, and their \"colour temperature\" is bluer and whiter, which mimics natural daylight.Also, LED lights \"are a lot more directional, so you've got this much brighter, whiter light in a very directional point hitting your eye compared to the more diffuse halogen ones\".It's not clear if it is the brightness, colour, temperature or the direction of the lights - or some combination of all of these - that causes most problems, she says: \"But what we know is that's one of the differences.\"What the data says - and doesn'tDespite widespread concerns that the problem is getting worse, there isn't evidence that brighter lights are causing more accidents.Statistics from the Department for Transport (DfT) show that headlight dazzle was recorded as a contributory factor in 216 collisions in 2023. Four of those collisions were fatal.Although the overall number of collisions rose very slightly compared to the previous year, it was far below the 330 recorded in 2014. The figure was also lower than any of the intervening years except 2020, when the pandemic meant fewer drivers on the roads.But the fact that since 2024 \"vision affected by dazzling headlights\" is no longer listed in the DfT's published statistics as a contributory factor in its own right, makes comparisons or identification of a trend harder.Equally, these statistics don't tell us whether some people are choosing not to drive at night and nor do they account for other changes in driver behaviour.Still, a government-commissioned report by the Transport Research Laboratory (TRL), published last year, found that drivers \"perceived glare from vehicle headlamps to be an important and widespread issue when driving at night\".It also concluded that headlamps were perceived as \"too bright\", and that \"whiter\" headlamps and those on larger vehicles were \"generally perceived to be especially problematic for causing glare\".So far so obvious, you may think, based on what campaigners have been saying for some time. But the study went further.Researchers took out a car at night, rigged with equipment to measure light intensity and an observer in the vehicle could press a button if they felt glare might interfere with their driving.The study drew a link between higher levels of luminance - meaning the intensity of light - and the likelihood of experiencing glare. It also suggested that 40,000 candela per sq m - a measure of luminance - may be an \"important threshold for the experience of glare being more likely\".Also, when the research car was travelling uphill or around a right-hand bend, glare was more likely, researchers said - a driver's eyes are more likely to fall within the \"throw\" of headlamps from oncoming vehicles.Echoing the concerns of experts, researchers also found \"some tentative indication that larger body shapes such as SUVs and models with light-emitting diode (LED) headlamps may be more likely to be associated with glare\". However, further research was recommended in this area.The government has since agreed to conduct such further research. But this has not started yet, and it's unlikely to begin for at least a couple of months.An unidentified problemBut all this raises the question of why nobody anticipated widespread complaints about glare - in spite of all the research and development work that's been carried out by carmakers around the world. \"It seems more priority has been put on giving drivers the best possible view of the road at night and less on the consequences for oncoming traffic,\" says Simon Williams, the RAC's head of policy.Manufacturers reject this. \"Safety is every car maker's top priority and providing good visibility to drivers in darkened conditions is essential,\" says Mike Hawes, chief executive of the SMMT. \"All headlights must meet international standards so drivers can see as clearly as possible but without dazzling other drivers.\"In October, I had the opportunity to speak to Thomas Broberg, senior advisor for safety at Volvo's Car Safety Centre in Gothenburg, Sweden. He explained how vehicles have to meet the standards of countries in which the manufacturer wants to sell them - vehicle manufacturing being an international business.LightRocket via Getty ImagesVolvo says avoiding glare is part of its design processThere are regulations around the headlights themselves, he says, covering their shape, intensity and glare. Also, headlights are tested on the road by different authorities and \"as a global car company, we need to comply with all of them\".Broberg said it was a \"concern\" that people are complaining about glare, but insisted that avoiding glare was part of the design process. He also pushed back against the suggestion that SUVs end up dazzling people more. \"The angle of the light is actually regulated,\" he says. \"So if you have a higher vehicle, then you need to have a lower [beam] angle.\"He argues that road geometry, and poor aiming of headlights in cars that don't have automatic levelling systems, are more likely culprits.What is already being done?In theory, technological innovations should help, particularly auto-dimming - although not everyone finds that they dip early enough.Off the back of the TRL report, the government has promised to look further into design factors that may be contributing to glare. The idea would be to use the findings to propose changes to international regulations at the United Nations.The United Nations Economic Commission for Europe (UNECE) has a World Forum for Harmonization of Vehicle Regulations. Following an agreement by this forum, new vehicles are meant to have mandatory automatic headlight levelling by September 2027. The effect of this technology is to correct the aim of headlights if the vehicle's load changes.But this would not change the headlight settings on the millions of cars on our roads already.More from InDepthThe TRL report also points out that \"many instances of glare are likely to remain even with stronger regulation\", because real-world situations of \"road geometry\" - the shape of the road, with ups, downs and corners - are not realistically under DfT's control.\"We know headlamp glare is a real frustration for many drivers and is even discouraging some from driving at night,\" a DfT spokesperson says. \"That's why we're investigating the causes as part of our Road Safety Strategy and are pressing for improvements to international lighting regulations.\"There are some basic things drivers can do to reduce the impact bright lights have on them. For example, keep their windscreen clean, inside and out.The College of Optometrists reminds motorists to always wear glasses if they have them, and make sure they are clean. It also advises staying up to date with vision tests, which can also pick up problems with eye health.More practical advice when confronted with bright oncoming headlights is to briefly look to the side of the road, keeping your eyes open - and of course, be considerate of other drivers when you're behind the wheel yourself.For Emily and others affected by glare, this guidance will have to make do for the time being. She says: \"It's tough but we cope and carry on until something is done about it.\"BBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. Emma Barnett and John Simpson bring their pick of the most thought-provoking deep reads and analysis, every Saturday. Sign up for the newsletter here",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why there's no quick fix in sight for the problem of dazzling headlights",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d2e4/live/a860eb00-0cd4-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-19T09:43:37.000Z",
      "dateModified": "2026-02-19T09:43:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential ch",
    "body": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Everything you need to know about Donald Trump’s Board of Peace - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n1wyl9?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-02-18T19:46:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·18 Feb 2026,·31 minsEverything you need to know about Donald Trump’s Board of PeaceAmericastAvailable for over a yearPresident Trump described his Board of Peace as “the most consequential international organisation ever.” The Board, which Donald Trump heads in perpetuity, is having its inaugural meeting in Washington, DC, on Thursday February 19. \nSarah and Anthony convene to tell you everything you know ahead of the meeting: lay out exactly what the Board is, what it does, who its members are, and crucially: what Donald Trump wants to get out of it.\nPlus, a handful of prominent Democrats appeared at the Munich Security Conference at the weekend with the message that Donald Trump would only be around for a few more years, and that the US would return as a strong partner with Europe. But did any of them stick out as potential front-runners for the nominations?\nHOSTS: \n• Sarah Smith, North America Editor\n• Anthony Zurcher, North America Correspondent\nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray, Grace Reeve and Kris Jalowiecki. The technical producer was Mike Regaard. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Everything you need to know about Donald Trump’s Board of Peace - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-02-18T19:46:00.000Z",
      "dateModified": "2026-02-18T19:46:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Is There A Gen Z Jobs Crisis? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n1p693?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-02-17T20:43:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·17 Feb 2026,·34 minsAvailable for over a yearToday, we look at why young people are bearing the brunt as unemployment hits its highest rate for nearly five years.\nAdam and Alex are joined by BBC business editor Simon Jack to unpack some of the factors driving the trend.\nPlus Alex updates us on Nigel Farage appointing Reform UK’s new top team, which he is calling his ‘shadow cabinet’. Alex explains what the appointments might tell us about how Reform is operating. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Shiler Mahmoudi. The social producer was Joe Wilkinson. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Is There A Gen Z Jobs Crisis? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-02-17T20:43:00.000Z",
      "dateModified": "2026-02-17T20:43:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Starmer appoints Antonia Romeo as head of UK civil service",
    "url": "https://www.bbc.com/news/articles/c3rz8z33rqxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5544/live/6703e600-0b1a-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-19T12:40:56.000Z",
    "description": "Just nowJoe PikePolitical correspondentCivil Service Blog / GOV.UKDame Antonia Romeo has held senior roles in three government departmentsPrime Minist",
    "body": "Just nowJoe PikePolitical correspondentCivil Service Blog / GOV.UKDame Antonia Romeo has held senior roles in three government departmentsPrime Minister Sir Keir Starmer has appointed Dame Antonia Romeo as cabinet secretary, the UK's top civil servant.Dame Antonia will be the first woman to hold the post in the role's 110-year history.She faced multiple bullying complaints earlier in her career but government sources have told the BBC that Sir Keir was impressed by her ability to \"get things done\".The government has previously said three allegations relating to Dame Antonia's use of expenses and bullying of staff when she was the UK's consul general in New York were investigated and there was \"no case to answer\".The cabinet secretary is the prime minister's most senior policy adviser and sits next to them during cabinet minister meetings, which usually take place weekly in Downing Street when Parliament is sitting.They are responsible for ensuring policy decisions are put into action and is ultimately responsible for all civil servants in Great Britain.Dame Antonia has a long track record of leading government departments including spells as permanent secretary at the Home Office, International Trade and the Ministry of Justice.Her appointment was made following a due diligence process overseen by crossbench peer Baroness Gisela Stuart, the First Civil Service Commissioner.Sir Keir said Dame Antonia is an \"outstanding public servant, with a 25‑year record of delivering for the British people\".He said: \"Since becoming prime minister, I've been impressed by her professionalism and determination to get things done.\"Dame Antonia said it was a \"huge privilege\" to be appointed, adding: \"The Civil Service is a great and remarkable institution, which I love. \"We should be known for delivery, efficiency and innovation, working to implement the government's agenda and meet the challenges the country faces.\"Dame Antonia, a University of Oxford graduate, joined the Civil Service in 2000 as an economist after previously working for a consultancy firm in the private sector.Her high-ranking jobs included serving as the UK's consul general in New York between 2016 and 2017.Dame Antonia's job involved promoting UK trade and business in New York, which saw her pictured with celebrities, shortly after the referendum to take Britain out of the EU.Concerns were raised about Dame Antonia's use of social media, with one former colleague claiming in an email that she seemed to be \"focusing an undue amount on building her personal Twitter brand\".Shortest servingSir Chris is the shortest serving cabinet secretary in history.His departure came after months of negative media reports suggesting Downing Street was unhappy with his performance.At the time of his appointment, the prime minister said Sir Chris would be tasked with \"the complete re-wiring of the British state to deliver bold and ambitious long-term reform\".As a career civil servant, some questioned whether he was the best person to reform the Civil Service.Sir Chris also had ultimate responsibility for the due diligence checks carried out before Lord Mandelson's appointment as US ambassador, although he took up the role only a few days before the appointment was formally announced.Lord Mandelson was sacked from the role last September after Downing Street said new information about the depth of his relationship with paedophile financier Jeffrey Epstein had emerged.The FDA union for senior civil servants criticised the anonymous briefings against Sir Chris.Liberal Democrat Cabinet Office spokesperson Lisa Smart, responding to Dame Antonia's appointment, said the public are \"tired of the endless sniping and the revolving door of officials\". She said: \"It's time to stop the Downing Street drama and start delivering for the country.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Starmer appoints Antonia Romeo as head of UK civil service",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5544/live/6703e600-0b1a-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-19T12:40:56.000Z",
      "dateModified": "2026-02-19T12:40:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Yes there is a right way to stack the dishwasher. Here are the 5 rules",
    "url": "https://www.bbc.com/news/articles/cwy89lr3pl4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cfdb/live/0bf16560-0d6a-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-19T01:32:26.000Z",
    "description": "11 hours agoAlex TaylorBBC News reporterGetty ImagesIt's a heated debate in many households - is there a right way stack to the dishwasher?It turns ou",
    "body": "11 hours agoAlex TaylorBBC News reporterGetty ImagesIt's a heated debate in many households - is there a right way stack to the dishwasher?It turns out some of us may be doing it wrong so here are five rules to ensure gleaming dishes - and an end to the dishwasher debate.1. Don't pre-rinseGetty ImagesIf you're rinsing your plates before putting them in the dishwasher you're doing it wrong, says Andrew Laughlin, principal researcher at consumer group Which?Modern dishwashers use a turbidity sensor to detect how dirty the water, and therefore the dish, is. If you rinse everything beforehand, the machine thinks the items are clean and lowers its temperature and intensity, reducing its efficiency.\"Instead, it's far better to scrape leftovers into your food waste bin and regularly clean the dishwasher filter,\" says Andrew.Lynsey Crombie, author of The 15 Minute Clean, agrees: \"Modern dishwashers are built to detect dirt so if your plates are too clean going in, they can actually wash less effectively,\" she says.\"Remove leftover food into the bin, but don't stand there pre-washing. You're wasting water and time.\"2. Stack correctlyGetty ImagesAndrew's rule for stacking the dishwasher is - if you eat from it, put it in the lower rack, if you drink from it, place it in the upper rack.Positioning dirty surfaces towards the jets is important too. \"Face everything towards the centre of the machine for the best performance,\" he says.Lastly, make sure no items are touching so that the water can flow and wash effectively.Lynsey says you should angle bowls downwards so they don't collect water and mix up your cutlery so spoons don't nest together.But the biggest mistake many of us make is overloading the dishwasher, she says.\"If water can't circulate properly, nothing will come out clean no matter how expensive your tablet is.\"3. Place the dirtiest items in the centreGetty ImagesThere's nothing more frustrating than loading the dishwasher, only to find some things aren't clean when the cycle is finished.Andrew says the \"worst offenders\" include cereal, scrambled eggs, or starchy food with protein-heavy residues. To fix this, he recommends putting the really dirty items in the middle, where the spray intensity is highest.This will make the wash more efficient and save you time and money by avoiding putting the same things back in again for another wash.4. Use tablets and saltGetty ImagesDishwashers need a helping hand to reach their peak performance.Andrew says it's \"absolutely\" vital to use tablets as these help to break down the dirt and the food waste and start the cleaning process. They contain enzymes to break down proteins and starches, and surfactants so water spreads and cleans better.Special dishwasher salt, meanwhile, helps to \"soften the water preventing lime scale build up and those horrid white marks on glasses.\" Lynsey says even if your tablet says \"all-in-one\", she still recommends topping up salt \"because it protects the machine long-term\".\"Think of it as maintenance, not an extra,\" she says.Rinse aid dispensers are also worth considering, explains Andrew. These \"disperse the water on the surface of the dishes, helping them to dry at the end of the cycle and to run efficiently.\"5. Avoid certain itemsGetty ImagesIt's equally important to remember what to keep out of your dishwasher, adds Andrew.Non-stick cookware, sharp knives, and wooden items should stay out.\"High temperatures and water pressure could damage them,\" he says.Lynsey says you should avoid anything with adhesive labels as these can clog the filter.But what about whose turn it is to empty the dishwasher? That's a question no expert can answer.Get our flagship newsletter with all the headlines you need to start the day. Sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Yes there is a right way to stack the dishwasher. Here are the 5 rules",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cfdb/live/0bf16560-0d6a-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-19T01:32:26.000Z",
      "dateModified": "2026-02-19T01:32:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chagossians trying to resettle on islands defy removal order",
    "url": "https://www.bbc.com/news/articles/ce8w2jknnk0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6533/live/ed5c1320-0d82-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-19T11:42:00.000Z",
    "description": "1 hour agoJoshua NevettPolitical reporterBBCMisley Mandarin (L) says the British will have to \"drag me from my beach\"A group of Chagossians are refusi",
    "body": "1 hour agoJoshua NevettPolitical reporterBBCMisley Mandarin (L) says the British will have to \"drag me from my beach\"A group of Chagossians are refusing to obey a removal order issued by British authorities, after landing on the Chagos Islands to protest against a deal to hand over the territory to Mauritius.The four Chagossians arrived on a remote part of the archipelago on Monday after sailing from Sri Lanka, with the aim of establishing a permanent settlement on their \"homeland\".A British patrol vessel found the men and officials served them with eviction papers, which warned them they could face fines or jail if they did not leave.The British Foreign Office has branded their journey an \"illegal, unsafe stunt\" and said they not pose any security risk to the UK-US military based on Diego Garcia.Misley Mandarin, a British-Chagossian who is part of the group, told the BBC the British would have to \"drag me from my beach\" and \"kill me\" if they wanted him to leave.Mandarin, who calls himself the first minister of a Chagossian government-in-exile, said the islands \"belong to us\" and urged the UK to \"let Chagossians come back to their homeland as British\".Lawyers supporting the Chagossians say they are prepared to go to court to appeal the removal order.The four are being supported by a crew on a vessel parked about 182m (200 yards) offshore from the Ile du Coin part of the Peros Banhos atoll.They had sailed to the islands from Galle Harbor on the south-western coast of Sri Lanka.Adam Holloway, a former Conservative MP and army officer who has now defected to Reform UK, helped the Chagossians return to the territory and remains on the island to help build the settlement.Holloway said the deal to cede the islands to Mauritius was \"completely crazy\".\"We've done this because Britain is about to make a catastrophically stupid mistake,\" Holloway said.\"We are now in a world of great power play. The base at Diego Garcia is absolutely critical to the security of the West.\"One of the crew supporting the Chagossians said the former MP was hiding out in the jungle and has not been served eviction papers.The removal orders were issued by a British Indian Ocean Territory (BIOT) immigration official.Footage shows the official arriving onshore in an inflatable small boat and handing over the eviction notice to Mandarin at a make-shift camp.The crew supporting the Chagossians said the BIOT patrol boat had trouble getting ashore and borrowed their dinghy to serve the removal order.The four Chagossians are calling for the Chagos Islands deal to be scrappedTrump pressureBritain has controlled the Chagos Islands since 1814 and evicted its inhabitants in the 1960s to make way for a military base on the largest island, Diego Garcia.The islands became formally established as an overseas territory in 1965, after the British government paid Mauritius a £3m grant to retain the archipelago.But last year, the UK government agreed to hand over control of the islands to Mauritius, arguing the future of the military base had been threatened by recent international court decisions.Under the deal, the UK has agreed to pay £101m annually for 99 years to keep control of the UK-US military base.The deal is now in doubt, after US President Donald Trump posted on his Trust Social platform to urge Prime Minister Sir Keir Starmer to not \"give away Diego Garcia\".The deal has also not gone down well with many people of Chagossian descent, who were granted the right to claim British citizenship in 2022.Many Chagossians see the deal as a betrayal and want to see the UK retain sovereignty over the islands so they can one day return to their homeland.But while many do oppose the deal, Chagossians - who live in the UK, Mauritius and the Seychelles - do not speak with one voice.Plea to the PMMandarin said removing the Chagossians from their homeland was a \"stain on British politics\" but said Sir Keir \"could be a hero right now\".\"Don't ratify that deal, cancel that deal and let Chagossians come back to their homeland as British,\" said Mandarin, who was brought up in Mauritius but has been living and working in the UK for many years.He issued a declaration of return after setting foot on the territory, claiming his \"right of self-determination\". He expects more Chagossians to make the journey.The Foreign Office said it is illegal to enter into the territory without a valid permit, and anyone who does so would be issued with a removal order.An Foreign Office spokesperson said: \"The UK government recognises the importance of the islands to the Chagossian community and is working with Mauritius to resume a programme of heritage visits to the Chagos Archipelago. This kind of illegal, unsafe stunt is not the way to achieve that.\"The vessel does not pose any security risk to Diego Garcia.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chagossians trying to resettle on islands defy removal order",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6533/live/ed5c1320-0d82-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-19T11:42:00.000Z",
      "dateModified": "2026-02-19T11:42:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sir David Attenborough's 100th birthday to be marked by BBC with special programmes",
    "url": "https://www.bbc.com/news/articles/c1l7m7j6lzjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1d31/live/8ae65d80-0d6f-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-19T09:20:22.000Z",
    "description": "BBC plans David Attenborough celebration for 100th birthday3 hours agoSteven McIntoshEntertainment reporterBBCSir David will appear in a new programme",
    "body": "BBC plans David Attenborough celebration for 100th birthday3 hours agoSteven McIntoshEntertainment reporterBBCSir David will appear in a new programme, Secret Gardens, as part of his centenary celebrationsSir David Attenborough's 100th birthday will be celebrated with three special programmes, the BBC has announced.The corporation will mark Sir David's \"extraordinary milestone\" on 8 May with a week of special programming featuring new and old shows by the beloved presenter.One of the new programmes, titled Making Life on Earth: Attenborough's Greatest Adventure, will go behind the scenes of his landmark BBC One series.Life on Earth was first broadcast in 1979 and followed Sir David as he travelled to 40 countries to film 600 species.The new programme will feature new interviews of the wildlife broadcaster and the original production team as they reflect on the making of the series.It will also touch on the challenges they faced along the way, including a coup in the Comoros, being shot at, as well as Sir David's famous encounter with gorillas in Rwanda.Sir David will also appear in a new series, Secret Garden, in which he will reveal the hidden worlds within Britain's gardens.Over five episodes filmed across the UK, the series will capture the rich diversity of life in Britain's back gardens while also reflecting on how the public can do their bit to save struggling species.And the presenter will appear in David Attenborough's 100 Years on Planet Earth, a live event from the Royal Albert Hall featuring the BBC Concert Orchestra and special guests.The week will also revisit episodes from Sir David's most-loved series including Planet Earth, One Planet, Blue Planet, Frozen Planet, Planet Earth and his most recent special Wild London.Jack Bootle, head of commissioning for specialist factual at the BBC, said: \"It's impossible to overstate what Sir David Attenborough has given us.\"His programmes have not only defined science and natural history broadcasting, but they have also changed how we see our planet and our place within it.\"This special week is a celebration of an extraordinary milestone and of a body of work that continues to inspire awe, curiosity and care for the natural world.\"It's also a moment for all of us at the BBC to say thank you to David - for his generosity, for his brilliance and for a lifetime spent bringing the wonders of nature into our homes.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sir David Attenborough's 100th birthday to be marked by BBC with special programmes",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1d31/live/8ae65d80-0d6f-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-19T09:20:22.000Z",
      "dateModified": "2026-02-19T09:20:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chagos Islands: Do not give away Diego Garcia, Trump tells UK",
    "url": "https://www.bbc.com/news/articles/c309qqyer8yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/63ef/live/533a9e50-0c7a-11f1-bbff-03527479c958.jpg",
    "tag": "Trending",
    "date": "2026-02-19T09:03:42.000Z",
    "description": "Do not give away Diego Garcia, Trump tells UK in fresh attack on Chagos deal4 hours agoJaroslav LukivGettyThe US had previously supported the UK's dec",
    "body": "Do not give away Diego Garcia, Trump tells UK in fresh attack on Chagos deal4 hours agoJaroslav LukivGettyThe US had previously supported the UK's decision to proceed with the Chagos dealDonald Trump has thrown the UK's Chagos deal into doubt as he launched a stinging criticism of the plan that would see the UK hand over the Chagos Islands to Mauritius and lease back a joint UK-US military base.The US president urged Sir Keir Starmer not to \"give away Diego Garcia\" - the largest island on the archipelago and home to the base. Trump said \"this land should not be taken away from the UK\" and if it did it would be \"a blight on our Great Ally\", in a post on social media. In response to Trump, the UK Foreign Office said the Chagos Islands deal was \"crucial to the security of the UK and our key allies, and to keeping the British people safe\".\"The agreement we have reached is the only way to guarantee the long-term future of this vital military base,\" it said in a statement.Prime Minister Sir Keir Starmer has previously insisted the deal is necessary to protect the continued operation of the base, amid previous attempts from Mauritius to dispute the legality of British sovereignty over the islands.Diego Garcia is the largest island in the archipelago, and is used as a joint military base by the UK and US armed forces.Under the deal - which was announced last May - the UK will lease back Diego Garcia for a period of 99 years at an average cost of £101m a year. Trump's latest comments come ahead of talks between the US and Mauritius planned for next week.The US president's position on the issue has seen rapid U-turns in recent months - from describing the planned transfer as an \"act of great stupidity\" to saying the deal was the \"best\" the prime minister could make.UK ministers have previously said that the deal could not go ahead unless it had the support of the US.The bill, aimed at enshrining the agreement into UK law, has been delayed and there is no date set for the next stage. UK Minister Alex Davies-Jones said the bill would return to the House of Lords \"as soon as parliamentary time allows\".Posting on the Truth Social platform on Wednesday, Trump wrote: \"I have been telling Prime Minister Keir Starmer, of the United Kingdom, that Leases are no good when it comes to Countries, and that he is making a big mistake by entering a 100 Year Lease...\"The US president stressed that Diego Garcia was \"strategically located in the Indian Ocean\".\"Prime Minister Starmer is losing control of this important Island by claims of entities never known of before,\" he said. \"We will always be ready, willing, and able to fight for the U.K., but they have to remain strong in the face of Wokeism, and other problems put before them.\"And referring to ongoing US-Iran talks on Tehran's controversial nuclear programme, Trump said: \"Should Iran decide not to make a Deal, it may be necessary for the United States to use Diego Garcia and the airfield located in Fairford in order to eradicate a potential attack by a highly unstable and dangerous Regime.\"The Republican president has repeatedly threatened to use military action against Iran over its deadly crackdown on anti-government protests and its nuclear activities. The US and its European allies suspect that Iran is moving towards the development of a nuclear weapon, something that Tehran has always denied.Asked by the BBC about Trump's latest comments, White House press secretary Karoline Leavitt said: \"The post should be taken as the policy of the Trump administration, it's coming straight from the horse's mouth.\"When you see it on Truth Social you know it's directly from President Trump, that's the beauty of this president in his transparency and relaying this administration's policies.\"Watch: BBC asks White House about Trump U-turn on Chagos Islands dealIn a statement, it said it \"supports the decision of the United Kingdom to proceed with its agreement with Mauritius concerning the Chagos archipelago\".Shadow foreign secretary Dame Priti Patel said: \"It's time Starmer finally saw sense, U-turned and scrapped this appalling deal altogether.\"Liberal Democrat leader Sir Ed Davey said: \"Trump's endless flip-flopping on the Chagos Islands shows why Starmer's approach is doomed to fail.\"Reform UK leader Nigel Farage said: \"Keir Starmer risks alienating our most important ally by giving away the Chagos Islands, the worst deal in British history.\"Earlier this week, four Chagos islanders - who are opposing the handover deal - landed on the Chagos Islands' remote atoll as part of a protest against the deal.They refused to leave it, despite a threat of eviction by a British maritime patrol.Speaking to BBC Radio 4's Today programme, Misley Mandarin - one of the Chagossians who had travelled to the islands - said they would have to \"drag me from my beach\".He said \"there's no reason\" for the deal \"because Mauritius never owned Chagos Islands in the first place\".\"Keir Starmer, you could be a hero right now - don't ratify that deal, cancel that deal and let Chagossians come back to their homeland as British,\" he added.The Chagos Islands – officially known as the British Indian Ocean Territory – are located about 5,799 miles (9,332km) south-east of the UK and about 1,250 miles north-east of Mauritius, in the Indian Ocean.The islands have been under British control since 1814 and were bought by the government for £3m, which led to the establishment of the islands as an overseas territory in 1965.But Mauritius has long argued that it was illegally forced to give the islands away as part of a deal to gain independence.In the late 1960s, Britain invited the US to build a military base on Diego Garcia, forcibly removing thousands of people from their homes in the process.Some of those Chagossians ended up in Mauritius and the Seychelles, but others settled in the UK, mostly in Crawley, West Sussex.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chagos Islands: Do not give away Diego Garcia, Trump tells UK",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/63ef/live/533a9e50-0c7a-11f1-bbff-03527479c958.jpg"
      ],
      "datePublished": "2026-02-19T09:03:42.000Z",
      "dateModified": "2026-02-19T09:03:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bad Bunny cast in first lead film role alongside Edward Norton and Javier Bardem",
    "url": "https://www.bbc.com/news/articles/cwy8082813ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f706/live/d8f38d40-0d79-11f1-ba5c-7bf79826200c.jpg",
    "tag": "Trending",
    "date": "2026-02-19T10:41:46.000Z",
    "description": "Bad Bunny to make lead acting debut in film inspired by Puerto Rican revolutionary2 hours agoReutersSinger Bad Bunny is to take on his first lead acti",
    "body": "Bad Bunny to make lead acting debut in film inspired by Puerto Rican revolutionary2 hours agoReutersSinger Bad Bunny is to take on his first lead acting role, starring in a film alongside Javier Bardem and Edward Norton.Porto Rico, described as a love letter to the 31-year-old's home of Puerto Rico, will be directed by rapper René Pérez, known as Residente.It comes after a huge year for Bad Bunny, which has seen him headline the Super Bowl half-time show and win album of the year at the Grammy Awards.\"I have dreamed of making a film about my country since I was a child. Puerto Rico's true history has always been surrounded by controversy.\"Porto Rico, also starring Viggo Mortensen, will be executive produced by Alejandro G Iñárritu, the Oscar-winning director of Birdman and The Revenant.It is inspired by Maldonado Román, known as Águila Blanca (White Eagle), who fought against Spanish colonialism in Puerto Rico and led uprisings against the authorities.Puerto Rico is now a self-governing territory of the USA.In a statement, actor Norton said: \"This film sits in a tradition of films we deeply love, from The Godfather to Gangs of New York, that both thrill us with visceral drama and iconic characters and eras while also forcing us to face up to the shadow story under the American narrative of idealism.\"Everybody knows what a poet of language and rhythm René is. Now they're going to see what a visual visionary he is as well.\"Norton added: \"Bringing him and Bad Bunny together to tell the true story of Puerto Rico's roots is going to be like a flame finding the stick of dynamite that's been waiting for it.\"Bad Bunny has previously appeared in supporting roles, such as in Brad Pitt thriller Bullet Train and Austin Butler crime comedy Caught Stealing.On Wednesday, he was named the fifth most popular artist in the world in 2025 by global music industry body the IFPI.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bad Bunny cast in first lead film role alongside Edward Norton and Javier Bardem",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f706/live/d8f38d40-0d79-11f1-ba5c-7bf79826200c.jpg"
      ],
      "datePublished": "2026-02-19T10:41:46.000Z",
      "dateModified": "2026-02-19T10:41:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Etsy sells second-hand fashion app Depop to eBay for $1.2bn",
    "url": "https://www.bbc.com/news/articles/cx240kme2k8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ac2e/live/6f0f21d0-0d30-11f1-b73d-5f7429e28cb8.png",
    "tag": "Trending",
    "date": "2026-02-19T11:07:24.000Z",
    "description": "2 hours agoDanielle KayeandOsmond ChiaDepopDepop, the second-hand clothing app that has skyrocketed in popularity among Gen Z shoppers, is being sold ",
    "body": "2 hours agoDanielle KayeandOsmond ChiaDepopDepop, the second-hand clothing app that has skyrocketed in popularity among Gen Z shoppers, is being sold to eBay for $1.2bn (£890m).Etsy, the online platform, is offloading Depop just five years after it bought the business - which was founded in the UK - for $1.6bn.eBay is hoping that the deal will help the online auction firm, which is more than 30 years-old, \"reach a younger demographic across the expanding re-commerce landscape\".Apps that allow people to buy and sell used or \"pre-loved\" garments and footwear have grown in use in recent years as young consumers seek sustainable, low-cost alternatives to traditional retailers, which means increased competition for the likes of Depop.The app, one of the earlier entrants to the fashion-app resale market, has seen its value fall amidst the rise of other savvy fashion apps, such as Vinted.\"The mass appeal of Vinted has had an impact on Depop's value,\" said retail analyst Catherine Shuttleworth. \"As Vinted made investments into global markets and improved its tech platform, more sellers gravitated towards it.\"She said that ultimately, users want the easiest, most accessible platform to buy and sell goods - but Depop simply didn't have the \"frictionless\" and \"universal\" appeal of eBay and Vinted.The all-cash deal is expected to be completed by the middle of this year and will see  Depop retain its name and branding.It will help boost eBay's used clothes sales, which is one of eBay's \"fastest-growing\" categories, said chief executive officer Jamie Ianonne.The announcement came as eBay published its 2025 financial results which showed revenues rose to $11.1bn, up 8% compared to a year earlier.Etsy's share price rose more than 15% in after-hours trading, while eBay's was rose by almost 6.5%.According to Etsy, nearly 90% of Depop's seven million active buyers are under the age of 34.The second-hand fashion platform also has more than three million active sellers.Depop has become \"one of the fastest-growing fashion resale marketplaces in the US\", said Kruti Patel Goyal, chief executive of Etsy. \"I am confident that Depop is well-positioned for its next phase of growth as part of eBay,\" she added.Etsy bought Depop in 2021 as part of a series of major purchases as it tried to compete with online retail giants like Amazon.But Etsy has since pulled back from many of those deals.In 2023, it sold of Elo7 - often referred to as Brazil's version of Etsy - at a loss after paying $217m for it two years earlier.Last year, Etsy said it would sell Reverb, a music equipment resale site that it bought in 2019, in order to prioritise its core business.The Etsy platform, known for its focus on handcrafted and niche goods, thrived during the Covid-19 pandemic as more people shopped online.But the firm has struggled in recent years, faced with shrinking demand and tough competition in the crafts market.Chinese giants like Temu and Shein, which offer cheaper goods and fast delivery, have become increasingly popular.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Etsy sells second-hand fashion app Depop to eBay for $1.2bn",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ac2e/live/6f0f21d0-0d30-11f1-b73d-5f7429e28cb8.png"
      ],
      "datePublished": "2026-02-19T11:07:24.000Z",
      "dateModified": "2026-02-19T11:07:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK Weather: Cornish village endures 50 consecutive days of rain",
    "url": "https://www.bbc.com/weather/articles/cvgkpemk2kno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/dcf1/live/d60cc5a0-0cf8-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-19T12:24:03.000Z",
    "description": "ByMatt TaylorSimon King Lead Weather Presenters and Jenny KumahSouth West England and Rural Affairs CorrespondentUpdated 17 minutes agoFor the small C",
    "body": "ByMatt TaylorSimon King Lead Weather Presenters and Jenny KumahSouth West England and Rural Affairs CorrespondentUpdated 17 minutes agoFor the small Cornish village of Cardinham the rain so far this year really has been relentless.According to the Met Office, it has rained there every day for the last 50 days.The last dry day residents experienced was 30 December 2025. They have already received more than their normal rainfall for February.The one ray of light? This is still well short of the previous longest wet spell in Cardinham of 72 days recorded in 2000.Elsewhere in the UK, the persistent rain over recent weeks has resulted in ongoing flooding with no significant let up expected until the middle of next month at the earliest.Few have escaped the near relentless rainImage caption, Number of rainy days for parts of southern EnglandExeter, Liscombe, Camborne and Okehampton all in the south-west have experienced between 44 and 49 days of continuous rain. Wiggenholt in West Sussex has had 45 days.Katesbridge, in Northern Ireland has now clocked up 40 days of wet weather, already seeing over two and a half times its February average rainfall. At Ryhill, West Yorkshire it had rained every day for the previous 36, prior to Wednesday.Northern Ireland experienced its wettest January in 149 years, and at Aboyne in Aberdeenshire over half the average rainfall for the entire year has already been recorded.What is it like to live with rain every day? For some of the residents of Cardinham, the relentless rain is starting to take its toll.Will Palmer, who normally enjoys outdoor activities like walking with his dog and cycling, told the BBC that the weather was \"miserable.\"Whilst fellow cyclist Josh Schol admits that there has been a lot of rain, he says at least when he's on his bike \"it keeps me cool.\"Laura, mum to Harriet and Rupert complained that her house \"has never been more full of sopping wet clothes\" but with it being half term added \"it's tough when you have a dog and two young children...but you've got to get out there and do it\".While the wet weather clearly brings some challenges, for Harriet and Rupert, jumping in muddy puddles is \"fun\".Image caption, While mum Laura has had to deal with sopping wet clothes, Harriet and Rupert have been enjoying the rainWhy has it been so wet?The main reason for the relentlessness of the rain is linked to a \"stuck\" weather pattern that developed across Europe shortly after the New Year.A large area of high pressure became established across northern and eastern parts of the continent, with cold air become strongly established underneath it. At the same time surges of Arctic air in the USA and Canada helped to fire up a strong Atlantic jet stream that directed rain-bearing areas of low pressure towards western Europe. The area of high pressure stopped the progress of the lows, meaning the same areas - namely the UK, Spain and Portugal - have been hit again and again by spells of wet weather.However, this blocked system has meant that some areas of the UK have escaped the worst of the rain. Parts of north-west England and western Scotland have been experiencing 'below-average' rainfall, with some of the Highlands having experienced a stretch of nearly three weeks without seeing any rain.This soggy start to the year reflects long-term trends that show winters in the UK are getting warmer and wetter due to climate change.A warmer atmosphere is able to hold more moisture meaning that when rain comes it is likely to be heavier and more intense.When will it stop raining?This weekend some parts of the UK may experience their first burst of spring 'warmth', with temperatures of 15 or 16C possible in a few spots. However, it doesn't mean that sunshine and dry weather is back.Rain will still feature across the UK during the weekend despite south-westerly winds dragging in milder conditions.The Met Office have said that there is no sign of prolonged dry weather until the middle of March at the very least, with our weather remaining very \"changeable\".Despite this, the blocked weather pattern that has been the reason for all our problems so far this year has finally changed. It means that low pressure systems will sit in different areas and also progress across the UK more than they have done. The result will be a different distribution of rainfall across the country, with some western hills likely to experience the wetter conditions. There should also be a few more drier and brighter days, but with rivers still very high and the ground saturated in large parts of the country any further rain could still bring the risk of more flooding.After the unusually dry conditions through a large part of 2025, and the resulting drought in a number of areas, the turn around to flood has been fairly rapid.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK Weather: Cornish village endures 50 consecutive days of rain",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/dcf1/live/d60cc5a0-0cf8-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-19T12:24:03.000Z",
      "dateModified": "2026-02-19T12:24:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why has Andrew Mountbatten-Windsor been arrested?",
    "url": "https://www.bbc.com/news/articles/cn9e1q4797wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3a3d/live/34d9b290-015b-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-19T11:57:37.000Z",
    "description": "46 minutes agoReutersAndrew Mountbatten-Windsor rides a horse in Windsor Great Park, near Royal Lodge, on MondayAndrew Mountbatten-Windsor has been ar",
    "body": "46 minutes agoReutersAndrew Mountbatten-Windsor rides a horse in Windsor Great Park, near Royal Lodge, on MondayAndrew Mountbatten-Windsor has been arrested on suspicion of misconduct in public office.Vehicles believed to be police cars arrived at the King's Sandringham Estate in Norfolk, where the former prince has been staying, on Thursday morning.The former prince has consistently and strenuously denied any wrongdoing.Why has Andrew Mountbatten-Windsor been arrested?Mountbatten-Windsor was arrested by Thames Valley Police on suspicion of misconduct in public office.The force also said it was \"carrying out searches at addresses in Berkshire and Norfolk\".We don't know the specifics of the allegations being investigated. However, the arrest of the former prince came after Thames Valley Police said it was assessing a complaint over the alleged sharing of confidential material by Mountbatten-Windsor with late sex offender Jeffrey Epstein.Officers arrested the King's brother on his 66th birthday.Assistant Chief Constable Oliver Wright said: \"It is important that we protect the integrity and objectivity of our investigation as we work with our partners to investigate this alleged offence.\"We understand the significant public interest in this case, and we will provide updates at the appropriate time.\"The force said it would not be naming the arrested man \"as per national guidance\".It is the first time the former prince, who has faced numerous allegations over this links to the convicted sex offender Jeffrey Epstein, has been arrested.Bav MediaVehicles, believed to be carrying police, near Mountbatten-Windsor's Sandringham home on Thursday morningWhere has Mountbatten-Windsor been taken?Police say King Charles's brother is in custody but we do not yet know where he has been taken.Danny Shaw, a policing commentator, told BBC News the longest the former prince can be held for is 96 hours.However, this would require multiple extensions from senior police officers and a magistrates' court.In most cases suspects are held for 12 or 24 hours and are then either charged or released pending further investigation, Shaw said.Mountbatten-Windsor will be placed in \"a cell in a custody suite\" with just \"a bed and a toilet\", where he will wait until his police interview, Shaw said.He added: \"There'll be no special treatment for him.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why has Andrew Mountbatten-Windsor been arrested?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3a3d/live/34d9b290-015b-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-19T11:57:37.000Z",
      "dateModified": "2026-02-19T11:57:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Read King and police statements in full after Andrew arrest",
    "url": "https://www.bbc.com/news/articles/cd6zjl58734o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5f9c/live/edce8d90-0d8e-11f1-b5e2-dd58fc65f0f6.jpg",
    "tag": "Trending",
    "date": "2026-02-19T12:28:43.000Z",
    "description": "15 minutes agoVehicles arrive at Sandringham Estate in NorfolkKing Charles III has released a statement after his brother Andrew Mountbatten-Windsor w",
    "body": "15 minutes agoVehicles arrive at Sandringham Estate in NorfolkKing Charles III has released a statement after his brother Andrew Mountbatten-Windsor was arrested on Thursday on suspicion of misconduct in public office.Earlier, Thames Valley Police released a separate statement saying it had arrested a man in his 60s.It comes after police said they were assessing a complaint over the alleged sharing of confidential material with late sex offender Jeffrey Epstein. Andrew has previously denied wrongdoing in relation to Epstein; he has not responded to the BBC's requests for comment on any of the specific allegations in relation to the release of millions of Epstein files in January.Here are both statements in full:King's statement\"I have learned with the deepest concern the news about Andrew Mountbatten-Windsor and suspicion of misconduct in public office.\"What now follows is the full, fair and proper process by which this issue is investigated in the appropriate manner and by the appropriate authorities.\"In this, as I have said before, they have our full and wholehearted support and co-operation.\"Let me state clearly: the law must take its course.\"As this process continues, it would not be right for me to comment further on this matter.\"Meanwhile, my family and I will continue in our duty and service to you all.\"Charles R.\"Thames Valley Police's statement\"As part of the investigation, we have today (19/2) arrested a man in his sixties from Norfolk on suspicion of misconduct in public office and are carrying out searches at addresses in Berkshire and Norfolk.\"The man remains in police custody at this time.\"We will not be naming the arrested man, as per national guidance. Please also remember that this case is now active so care should be taken with any publication to avoid being in contempt of court.\"Assistant Chief Constable Oliver Wright said: \"Following a thorough assessment, we have now opened an investigation into this allegation of misconduct in public office.\"'It is important that we protect the integrity and objectivity of our investigation as we work with our partners to investigate this alleged offence.\"We understand the significant public interest in this case, and we will provide updates at the appropriate time.'\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Read King and police statements in full after Andrew arrest",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5f9c/live/edce8d90-0d8e-11f1-b5e2-dd58fc65f0f6.jpg"
      ],
      "datePublished": "2026-02-19T12:28:43.000Z",
      "dateModified": "2026-02-19T12:28:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Danika Mason: Australian presenter apologises for drinking before slurred Winter Olympics report",
    "url": "https://www.bbc.com/news/articles/cdxgnrr11rwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d8e4/live/80de8970-0d3d-11f1-974d-631a5077a007.jpg",
    "tag": "Trending",
    "date": "2026-02-19T04:11:15.000Z",
    "description": "9 hours agoHelen LivingstoneSydneyGettyDanika Mason is one of Australia's most prominent sports reportersAn Australian sports presenter has apologised",
    "body": "9 hours agoHelen LivingstoneSydneyGettyDanika Mason is one of Australia's most prominent sports reportersAn Australian sports presenter has apologised after a clip of her slurring her way through a live cross from the Winter Olympics in Italy went viral, with even Australia's prime minister weighing in.Channel Nine reporter Danika Mason said she had \"misjudged the situation\" by drinking ahead of her appearance on live television, also blaming the altitude, the cold and her failure to eat dinner.\"I want to take full responsibility, it's not the standard I set myself,\" she said during another appearance a day later, adding that she was \"embarrassed\".Prime Minister Anthony Albanese said he was \"pro-Danika\" and that there was \"nothing to see here\" suggesting she had been affected by jet lag.Mason stumbled over her words and talked about iguanas and the price of coffee as she reported on the day's sports events.\"Literally like the price of coffee over here is actually fine, it's more the price of coffee in the US that we're gonna have to get used to. I'm not sure about the iguanas, where are we going with that one?\" she said during her cross to the breakfast television show Today on Wednesday, apparently in response to comments from the studio hosts.With glazed eyes she then stumbled through the rest of her sports report, mixing up her words as well as the UK and the US, while studio host Karl Stefanovic could be heard laughing in the background.\"Look the cold weather is a thing, right,\" Stevanovic said unprompted afterwards. \"You can't actually move your lips.\"Social media clips of her report prompted mixed reactions from Australians. \"Good on her, nothing wrong with this. You can tell she's having an absolute ball over there,\" said one person on X, while another commented: \"If it's not a health issue, she should be sacked on the spot - very unprofessional.\"Mason, a prominent sports reporter best known for her National Rugby League coverage, appeared again on the Today show on Thursday morning.After she delivered her live report, she told viewers she wanted to \"take a moment, if that's OK, just to apologise\" for her previous appearance.She thanked viewers for messages of concern and continued: \"I'm OK, probably just a little embarrassed. \"Look, I totally misjudged the situation, I shouldn't have had a drink, especially in these conditions, it's cold, we've got altitude, and not having had dinner probably didn't help as well. But I want to take full responsibility, it's not the standard I set myself.\"So in saying that, I'm genuinely really sorry and I'm thanking everyone for those messages I've received as well.\"The Today show host Jayne Azzopardi responded saying \"we know how hard you work, Danika\" while Stefanovic called her a \"legend\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Danika Mason: Australian presenter apologises for drinking before slurred Winter Olympics report",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d8e4/live/80de8970-0d3d-11f1-974d-631a5077a007.jpg"
      ],
      "datePublished": "2026-02-19T04:11:15.000Z",
      "dateModified": "2026-02-19T04:11:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]