[
  {
    "title": "Isak, Gyokeres, Woltemade, Sesko - how have big-name striker signings fared?",
    "url": "https://www.bbc.com/sport/football/articles/cx2xzxgw1qgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/84f4/live/f1938710-a3de-11f0-92db-77261a15b9d2.png",
    "tag": "Trending",
    "date": "2025-10-12T06:18:13.000Z",
    "description": "How have the big-name striker signings done so far in the Premier League?Image source, Getty ImagesImage caption, Viktor Gyokeres (left), Alexander Is",
    "body": "How have the big-name striker signings done so far in the Premier League?Image source, Getty ImagesImage caption, Viktor Gyokeres (left), Alexander Isak (centre) and Benjamin Sesko all made high-profile transfers in the summer, joining Arsenal, Liverpool and Manchester United respectivelyByMichael EmonsBBC Sport journalistStrikers dominated the summer transfer window as a host of major Premier League sides looked to strengthen up front.Not a day went by without speculation as reigning champions Liverpool and last season's runners-up Arsenal were among the teams to bolster their attacking options, with Manchester United and Chelsea doing likewise.We had strikers going on strike, clubs gazumping their rivals and plenty more drama along the way.With the international break ongoing, clubs are left to reflect on their seven league matches so far.But how have the big-name forward signings got on? We have taken a look at nine of them to see how they have fared - and want you to have your say.Thierno Barry (Everton)Image source, Getty ImagesImage caption, Among those to have played at least 180 minutes in the Premier League this season, no player averages more off-ball runs in behind per 90 minutes than Barry's 17.7Stats from Premier League 2025-26. Appearances: 7. Minutes played: 208. Goals: 0. Assists: 0. Shots on target: 0. Chances created: 1.Everton paid £27m to sign 22-year-old striker Thierno Barry from Villarreal after he scored 11 La Liga goals last season.But it has been a tough start at the Toffees for the France Under-21 international.He is yet to score in nine games in all competitions and five of his seven Premier League appearances have come as a substitute, with Beto often preferred by manager David Moyes.Dominic Calvert-Lewin (Leeds United)Image source, Getty ImagesImage caption, Only Bournemouth's Antoine Semenyo (17) and Crystal Palace's Jean-Philippe Mateta (14) have recorded more flick-ons in the Premier League this season than Dominic Calvert-Lewin's 13Stats from Premier League 2025-26. Appearances: 5. Minutes played: 357. Goals: 1. Assists: 0. Shots on target: 7. Chances created: 6.After scoring 57 Premier League goals for Everton in a nine-year spell, Dominic Calvert-Lewin left the Toffees on a free transfer and quickly joined newly promoted Leeds United.England international Calvert-Lewin, 28, had a chance to \"revive his career\", said Whites boss Daniel Farke, who has regularly used the striker - starting him in four of Leeds' Premier League matches so far.Calvert-Lewin got his first goal for the club, and his first since January, in Leeds' 3-1 win at Wolves on 20 September, but that remains his only goal of the campaign.Hugo Ekitike (Liverpool)Image source, Getty ImagesImage caption, Hugo Ekitike has a shot accuracy of 40% in the Premier League this season and no summer signing has scored more than him so farStats from Premier League 2025-26. Appearances: 6. Minutes played: 386. Goals: 3. Assists: 1. Shots on target: 4. Chances created: 4.France international Ekitike was a wanted man in the summer, with Newcastle United the first club to make a bid for him. With Liverpool initially being frustrated in their efforts to sign Alexander Isak from the Magpies, the Reds quickly made a move themselves - signing him for an initial £69m from Eintracht Frankfurt. To Newcastle's frustration, Liverpool also went on to sign Isak.The 23-year-old has proved an instant hit with the fans, although question marks remain around how he and Isak will fit into the champions' team together.Ekitike has scored three goals and has one assist so far, but was sent off after taking his shirt off while celebrating a late winner against Southampton in the Carabao Cup.Viktor Gyokeres (Arsenal)Image source, Getty ImagesImage caption, Only Manchester United's Bryan Mbeumo (108) and Aston Villa's Ollie Watkins (100) have made more off-ball runs in behind in the Premier League this season than Gyokeres' 86. He has also had the joint-third most touches in the opposition's box (45)Stats from Premier League 2025-26. Appearances: 7. Minutes played: 578. Goals: 3. Assists: 0. Shots on target: 5. Chances created: 5.Sweden international Viktor Gyokeres scored 54 goals in 52 games in 2024-25 and helped Sporting win a second successive Portuguese league title before moving to Arsenal in the summer.The Gunners signed the 27-year-old in a deal that could be worth up to £64m, and he has been a vital part of the side that sits on top of the Premier League table.He has started all seven of their league games, scoring twice in the 5-0 win over Leeds and once in the 3-0 victory over Nottingham Forest, and has also started in both of Arsenal's Champions League victories. Alexander Isak (Liverpool)Image source, Getty ImagesImage caption, Only Arsenal's Leandro Trossard (0.62) has a higher xG (expected goals) among players without a shot on target in the Premier League this season than Alexander Isak's 0.61Stats from Premier League 2025-26. Appearances: 3. Minutes played: 181. Goals: 0. Assists: 1. Shots on target: 0. Chances created: 1.Alexander Isak's protracted transfer from Newcastle to Liverpool was the story of the summer window.The Sweden striker released a statement in which he said promises had been \"broken\" by Newcastle and that their \"relationship can't continue\" after Liverpool's first bid was rejected, before he finally moved on transfer deadline day for a British record of £125m.But, without much of a pre-season, Isak, 26, has made a slow start at Liverpool. He is yet to have a shot on target after his first three Premier League games, although he has registered an assist and scored in a 2-1 win over Southampton in the Carabao Cup.Igor Jesus (Nottingham Forest)Image source, Getty ImagesImage caption, Among strikers with 10 or more aerial duels in the Premier League this season, only Manchester City's Erling Haaland (84.2% - 16/19) has a higher success rate than Igor Jesus' 60% (6/10)Stats from Premier League 2025-26. Appearances: 6. Minutes played: 101. Goals: 0. Assists: 0. Shots on target: 2. Chances created: 1.Brazil international striker Igor Jesus joined Nottingham Forest in a £10m move from Botafogo in July.It has been a tough start to the campaign for Forest, who are without a win in nine games in all competitions and sacked Nuno Espirito Santo, replacing him with Ange Postecoglou in September.Jesus, 24, is yet to score in the Premier League but has scored four goals in cup competitions - two in the 3-2 Carabao Cup loss to Swansea City and then another double a week later, when Forest drew 2-2 with Real Betis in the Europa League.Joao Pedro (Chelsea)Image source, Getty ImagesImage caption, Only Manchester City's Erling Haaland (10) and Bournemouth's Antoine Semenyo (nine) have more goal involvements in the Premier League this season than Joao Pedro's five (two goals, three assists)Stats from Premier League 2025-26. Appearances: 7. Minutes played: 586. Goals: 2. Assists: 3. Shots on target: 3. Chances created: 7.Chelsea completed a deal worth £60m to take Brazil forward Joao Pedro from Brighton on an eight-year contract, and he headed straight to the United States to play at the Club World Cup.His two goals in the semi-final helped beat Fluminense and he then scored against European champions Paris St-Germain as Chelsea won the final.In the Premier League he has scored twice and assisted three goals, although he has not scored in his past six games in all competitions. However, with Cole Palmer and another new Blues striker Liam Delap, a £30m summer signing from Ipswich Town, both injured, Joao Pedro, 24, is leading the Chelsea line every week.Benjamin Sesko (Manchester United)Image source, Getty ImagesImage caption, No player has scored more goals from inside the six-yard box in the Premier League this season than Benjamin Sesko's twoStats from Premier League 2025-26. Appearances: 7. Minutes played: 385. Goals: 2. Assists: 0. Shots on target: 6. Chances created: 5.Manchester United completed the signing of RB Leipzig striker Benjamin Sesko in a move worth £73.7m in August.The 22-year-old Slovenia international's first start came as United suffered a humiliating Carabao Cup exit to League Two side Grimsby Town, who won 12-11 on penalties, with Sesko criticised as he was the last of 10 United outfielders to take a spot-kick in the shootout.However, he has scored twice in recent weeks, in the 3-1 loss against Brentford on 27 September and then again seven days later in the 2-0 victory over Sunderland.Nick Woltemade (Newcastle United)Image source, Getty ImagesImage caption, No player has more headed goals in the Premier League this season than his two, which is as many as he scored in his 70 appearances in the BundesligaStats from Premier League 2025-26. Appearances: 4. Minutes played: 305. Goals: 3. Assists: 0. Shots on target: 3. Chances created: 2.With Alexander Isak making it clear he wanted to move from Newcastle to Liverpool, Eddie Howe moved to sign 23-year-old Germany striker Nick Woltemade.The 6ft 6in (1.98m) frontman joined in a club record deal worth up to £69m and has already made an impact.He scored the only goal on his debut in a 1-0 win against Wolves and has also netted against Arsenal, Union St-Gilloise in the Champions League and against Nottingham Forest.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Isak, Gyokeres, Woltemade, Sesko - how have big-name striker signings fared?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/84f4/live/f1938710-a3de-11f0-92db-77261a15b9d2.png"
      ],
      "datePublished": "2025-10-12T06:18:13.000Z",
      "dateModified": "2025-10-12T06:18:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC News - Newscast, Israel-Gaza: The Ceasefire Is Now \"In Effect\"",
    "url": "https://www.bbc.co.uk/programmes/p0m7y2cg?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-10-10T15:36:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live             \n\n        \n    \n        \n        \n                            Palestinians begin returning to Gaza's north.\n                        \n                Show more\n            \n        \n        \n                            Today, the Israeli military says the ceasefire in Gaza is now in effect. \n                            Troops have positioned themselves along the lines agreed under the Trump plan, the IDF says - but will continue to \"remove any immediate threat\". It comes after the Israeli government approved a deal with Hamas which will also see the release of hostages.\n                            Hamas now has 72 hours to release all Israeli hostages, while Israel will release hundreds of Palestinian detainees. Adam is joined by Lyse Doucet, chief international correspondent. \n                            And Adam, Chris and Dharshini are joined by Sarah Montague, presenter of the World At One, to round up the political week. \n                            You can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \n                            You can join our Newscast online community here: https://bbc.in/newscastdiscord\n                            Get in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\n                            New episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\n                            Newscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Miranda Slade and Shiler Mahmoudi. The social producer was Sophie Millward. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.\n                        \n                Show less\n            \n        \n    \n        \n                            \n                                    Available now\n                            \n                    \n                45 minutes\n            \n                    \n    \n    \n            \n                                    \n                        Timings (where shown) are from the start of the programme in hours and minutes\n                    \n                                    \n                                                    \n    \n            \n                .\n            \n            \n                                            \n                            \n            \n                                \n                                    \n                                        \n    \n                \n            \n    \n                Newscast\n    \n                The latest on Israel-Gaza ceasefire agreement.\n            \n    \n\n                                    \n                                \n                            \n        \n        \n                        \n                ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC News - Newscast, Israel-Gaza: The Ceasefire Is Now \"In Effect\"",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-10-10T15:36:00.000Z",
      "dateModified": "2025-10-10T15:36:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-10-11T04:34:42.000Z",
    "description": "Updated 11 October 2025Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is t",
    "body": "Updated 11 October 2025Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-10-11T04:34:42.000Z",
      "dateModified": "2025-10-11T04:34:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lostprophets singer Ian Watkins dies in prison attack as two men arrested",
    "url": "https://www.bbc.com/news/articles/cm2d2me0eljo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dd93/live/cff02cb0-a6c4-11f0-92db-77261a15b9d2.jpg",
    "tag": "Trending",
    "date": "2025-10-11T21:32:08.000Z",
    "description": "10 hours agoHolly HarrisonBBC WalesSouth Wales PoliceThe disgraced rock star from Pontypridd was serving a 29-year sentence at HMP Wakefield for child",
    "body": "10 hours agoHolly HarrisonBBC WalesSouth Wales PoliceThe disgraced rock star from Pontypridd was serving a 29-year sentence at HMP Wakefield for child sex offencesLostprophets singer Ian Watkins has died after being attacked in jail, prison sources have confirmed.West Yorkshire Police said two men aged 25 and 43 had been arrested on suspicion of murder.The disgraced rock star from Pontypridd was serving a 29-year sentence at HMP Wakefield for child sex offences.Watkins, 48, was jailed in December 2013 for a string of child sex offences, including the attempted rape of a baby.Police said they were called to the prison on Saturday morning to reports of a serious assault on a prisoner, who was pronounced dead at the scene.A Prison Service spokesperson said it was aware of an incident at the prison. \"We are unable to comment further while the police investigate.\"He was attacked in prison in August 2023, but his injuries were not life threatening.Watkins was sentenced to 29 years in prison with a further six years on licence, and his two co-defendants, the mothers of children he abused, were jailed for 14 and 17 years.The attack at Wakefield Prison comes less than two weeks after a report into the facility was published that found violence there had \"increased markedly\".The report from the chief inspector of prisons said: \"Many prisoners told us they felt unsafe, particularly older men convicted of sexual offences who increasingly shared the prison with a growing cohort of younger prisoners.\"Police were called to Wakefield Prison on Saturday morningWatkins admitted the attempted rape and sexual assault of a child under 13 but pleaded not guilty to rape.He also admitted conspiring to rape a child, three counts of sexual assault involving children, seven involving taking, making or possessing indecent images of children and one of possessing an extreme pornographic image involving a sex act on an animal.Judges rejected an appeal by Watkins in 2014 to reduce the length of his jail term.During sentencing, Mr Justice Royce said the case broke \"new ground\" and \"plunged into new depths of depravity\".\"Any decent person... will experience shock, revulsion and incredulity.\"The judge said Watkins had a \"corrupting influence\", and had shown a \"complete lack of remorse\".As a rock star in his 20s, Watkins sold millions of albums around the world and commanded huge arena crowds.Formed in 1997, Welsh rock band Lostprophets released five studio albums in total, including a number one album in the UK and two top 10 singles.Getty ImagesWatkins performing in London a few months before his arrest in 2012They also saw some success in the US, where their second and third albums both reached the top 40.After Watkins was sentenced, Des Mannion, NSPCC national head of service for Wales, said: \"Watkins used his status and global fame as a means to manipulate people and sexually abuse children.\"But we must nevertheless remember that this case isn't about celebrity, it's about victims. And those victims are children.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lostprophets singer Ian Watkins dies in prison attack as two men arrested",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dd93/live/cff02cb0-a6c4-11f0-92db-77261a15b9d2.jpg"
      ],
      "datePublished": "2025-10-11T21:32:08.000Z",
      "dateModified": "2025-10-11T21:32:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Common cold, flu, Covid: Why is Britain so sick right now?",
    "url": "https://www.bbc.com/news/articles/c1jz608l9l4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d262/live/c2050750-a6bb-11f0-a356-d3fc7522eb5a.jpg",
    "tag": "Trending",
    "date": "2025-10-11T23:07:17.000Z",
    "description": "8 hours agoNick TriggleHealth correspondentiStock/Getty ImagesAre you ill? If not, you probably know someone who is - or at the very least someone who",
    "body": "8 hours agoNick TriggleHealth correspondentiStock/Getty ImagesAre you ill? If not, you probably know someone who is - or at the very least someone who has just recovered. Coughs and colds, it seems, are rampant at the moment.And, if the anecdotes of people I know are anything to go by, the bug going round seems to be a particularly nasty one. Sore throat? Tick. Streaming nose? Tick. Sinus pressure? Double tick.What's going on?The perfect breeding ground\"This is normal, it's autumn after all,\" says Prof Jonathan Ball, from Liverpool School of Tropical Medicine.He says a combination of children returning to school, adults back at work after the summer break and people spending more time indoors as the weather turns cooler creates a ripe breeding ground for respiratory viruses to flourish.\"Basically we have a big mixing pot of different viruses that are beginning to do the rounds. Immunity has waned and people are getting ill.\" There are actually more than 100 different viruses that cause upper and lower respiratory tract infections, plus some bacterial infections. Is there more illness than normal?Data collection from the UK Health Security Agency (UKHSA) shows Rhinovirus – what many of us would call the common cold – has been on the increase in recent weeks and seems to be the most common cause of illness at the moment.Covid is also doing the rounds, driven by two new variants – XFG, called Stratus by some, and NB.1.8.1, known as Nimbus. But there is already a high degree of immunity built up in the population meaning, for most, it's a fairly mild infection.There are signs flu may be on the rise too – there has been an increase in the 15-25 age group over the past week - while RSV, which can cause serious illness in young children, also tends to take off in the autumn.\"There is often, although not always, a pattern,\" says Dr Jamie Lopez Bernal, a consultant epidemiologist at UKHSA. \"You tend to see Rhinovirus take off first and then RSV,\" he explains. \"Flu tends to come later in December and January. But that's not always the case – and certainly the pandemic disrupted the traditional seasonal trends. What we've seen in the last year or so is those trends return to something like normal.\"He says the levels of illnesses at the moment are not particularly high.\"Covid is above baseline and there's a lot of Rhinovirus around. The uptick in flu in that younger age group has perhaps come a little bit earlier than we would expect, but it is still at a low level.\"Is it a cold, flu or Covid?The most common symptoms, according to the NHS, are:ColdsSymptoms appear graduallyMostly affect nose and throatEarly sign - pressure in your earsChestier, mucus coughFluComes on suddenlyFeel wiped outFever, muscle aches, exhaustionNeed bed restDry coughCovidTypical flu symptomsLoss of taste of smellDiarrhoea or tummy upsetMany of the symptoms between cold, flu and more serious viruses like Covid overlap.How can you protect yourself?Respiratory infections can, of course, be really dangerous for vulnerable people - in a bad winter tens of thousands of people can die of flu.But there is nothing to suggest the respiratory viruses circulating now are causing more serious illness this year in otherwise healthy people. \"We all react in different ways – and we don't really understand why,\" admits Prof Ball. \"Of course, age and fitness have a lot to do with it, but sometimes it is just your individual genetics or how tired and rundown you may be, or when you were last exposed to that particular virus.\"In terms of protecting yourself, the most important step to take, if you are eligible, is to get vaccinatinated. Shots are being offered for flu, Covid and RSV to protect those who are most at-risk of serious illness, which includes older people and those with certain health conditions.If you are ill, UKHSA says you can help protect others by washing your hands regularly, especially after coughing or sneezing, staying at home if you can and consider wearing a mask if you do have to go into public places.Prof Ball says it is right to take precautions to try to protect vulnerable people, but adds if you are healthy and young or of working age, getting the odd respiratory illness is pretty inevitable and not necessarily a bad thing.\"Most people will get one or two respiratory infections every year. In some ways, it's a good thing when you are a child or healthy adult.\"By getting exposed you are building up your immunity through natural infection - so when you are older you hopefully have enough immunity to not get severely ill.\"More weekend picks",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Common cold, flu, Covid: Why is Britain so sick right now?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d262/live/c2050750-a6bb-11f0-a356-d3fc7522eb5a.jpg"
      ],
      "datePublished": "2025-10-11T23:07:17.000Z",
      "dateModified": "2025-10-11T23:07:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'White House anger over UK spy case' and 'Pensions tax raid'",
    "url": "https://www.bbc.com/news/articles/c3060v86y4jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/09ca/live/3330a530-a700-11f0-b741-177e3e2c2fc7.jpg",
    "tag": "Trending",
    "date": "2025-10-12T03:54:38.000Z",
    "description": "3 hours agoThe White House has warned that the collapse of a case against two people accused of spying for China \"risks undermining the special relati",
    "body": "3 hours agoThe White House has warned that the collapse of a case against two people accused of spying for China \"risks undermining the special relationship\" between the UK and US, according to the Sunday Times. A senior Trump official tells the paper that the US exercises \"extreme caution in sharing information with foreign government subject to adversarial coercion and influence.\"The Daily Express reports that the chancellor, Rachel Reeves, is considering a £7bn \"tax raid\" on pensioners to \"plug a black hole in her Budget\". Reeves could hike taxes on pension contributions and on withdrawals by retirees, according to experts cited by the paper. Whereas the Sunday Telegraph writes that wealthier people will be forced to \"contribute more\" in the chancellor's Budget. A Treasury source tells the paper that Reeves is prepared to make \"tough decisions\", but insists there will be no \"return to austerity\". The front page also features a photo of the relatives of Israeli hostages - due to be released by Hamas on Monday.The Duke of York told the late convicted sex offender Jeffrey Epstein that \"we are in this together\" in 2011, the Mail on Sunday reports. The emails appear to contradict Prince Andrew's claim in a BBC Newsnight interview in 2019 that he \"never had any contact\" with Epstein after they were photographed together in New York in 2010. Several papers lead with the death of disgraced paedophile Ian Watkins, who was fatally attacked while serving a 29-year sentence for child sex offences at HMS Wakefield. The Sunday Mirror reports the former Lostprophets frontman was \"ambushed\" while in jail.\"Monster murdered\" is the headline for the Daily Star, which reports that Watkins \"had his throat slashed\" in an attack by a fellow prisoner.A photo of Watkins also features on the front page of the Sunday People, but the paper leads with remarks from former prime minister Gordon Brown urging voters to \"fight Farage\". In an interview with the paper, Brown said the Reform UK leader's funding cuts would bring \"more suffering\" to children and pensioners.The Observer's front page is dedicated in full to a photo of a Palestinian family walking through rubble on their return to Gaza City, alongside the headline: “The burden of hope”.The Sun on Sunday says it has obtained an email from the Duke of York to Jeffrey Epstein in which Prince Andrew tells the disgraced financier \"we are in this together\". It says the message was sent in February 2011, the day after a photo emerged showing the prince with Virginia Giuffre - and weeks after he later claimed to have cut ties with Epstein. The Mail on Sunday, which has also seen the email, calls it \"astonishing\" and a \"bombshell\", and says it proves Prince Andrew lied to the BBC's Newsnight programme. Both papers say he has declined to comment.Several papers examine the mood in Israel and Gaza with the ceasefire now in force. The Sunday Times says that, \"for the first time in two long years, the night air in Tel Aviv carried not the sounds of sirens, but the pulse of anticipation\". It says the square where hostage families gather has turned from a place of anguish to one of cautious celebration. The Observer hears from a student in central Gaza, shocked by the sense she had managed to live through a war. \"It was a mix of happiness and disbelief\", she says.The Sunday Telegraph says the Chancellor will \"tax the rich\" in the Budget, rather than cutting spending or increasing borrowing. Sources tell the paper that Rachel Reeves will be \"fair\" when she asks people to contribute more, but says those on \"higher incomes\" will be targeted. The Sunday Express thinks she is \"eyeing up\" a raid on pensions, either pushing up taxes on contributions by working people, or on withdrawals by those who have retired. The Sunday Mirror says Reeves is pledging to \"leave no stone unturned\" in her efforts to get the economy firing again.The Sunday Times says the White House is the latest to express concern about the collapse of the case against two men accused of spying for China. It says the government has been told it could undermine the special relationship, and could threaten intelligence-sharing between the UK and the US. The Sun on Sunday says the longer the row goes on - about whether the government played a role in the spying case being dropped - the more concerning the situation becomes.Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'White House anger over UK spy case' and 'Pensions tax raid'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/09ca/live/3330a530-a700-11f0-b741-177e3e2c2fc7.jpg"
      ],
      "datePublished": "2025-10-12T03:54:38.000Z",
      "dateModified": "2025-10-12T03:54:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gaza: Hamas mobilises fighters as fears of internal violence mount",
    "url": "https://www.bbc.com/news/articles/ce8482418plo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/28d5/live/6f84f470-a6ae-11f0-b55a-e7725355d83f.jpg",
    "tag": "Trending",
    "date": "2025-10-11T14:44:59.000Z",
    "description": "17 hours agoRushdi AbualoufGaza correspondent in IstanbulHamas has recalled about 7,000 members of its security forces to reassert control over areas ",
    "body": "17 hours agoRushdi AbualoufGaza correspondent in IstanbulHamas has recalled about 7,000 members of its security forces to reassert control over areas of Gaza recently vacated by Israeli troops, according to local sources.The Palestinian group also appointed five new governors all with military backgrounds, some of whom previously commanded brigades in its armed wing.The mobilisation order was reportedly issued via phone calls and text messages which said the aim was to \"cleanse Gaza of outlaws and collaborators with Israel\" and told fighters to report within 24 hours.Reports from Gaza suggest that armed Hamas units have already deployed across several districts, some wearing civilian clothes and others in the blue uniforms of the Gaza police.Tensions rose sharply and quickly after two members of Hamas's elite forces were shot dead by gunmen from the powerful Dughmush clan in Gaza City's Sabra neighbourhood. One of them was the son of a senior commander in Hamas's armed wing, Imad Aqel, who now heads the group's military intelligence.Their bodies were left in the street, triggering anger and raising the prospect of a major armed response by Hamas.Hamas members later surrounded a large area where more than 300 Dughmush gunmen were believed to be holed up, armed with machine guns and improvised explosives.This morning Hamas killed one Dughmush clan member, and reportedly kidnapped another 30.Some of the clan's weapons were looted from Hamas depots during the war, while others had been in the clan's possession for years.Palestinians return to devastation in Gaza CityWhat we know about the Gaza ceasefire agreementWho are the 48 hostages still held in Gaza?The Hamas mobilisation had been widely anticipated amid growing uncertainty about who will govern Gaza once the war ends.This is a key issue that could complicate the start of the second phase of US President Donald Trump's peace plan, which calls for Hamas to disarm.A Hamas official abroad declined to comment directly on reports of the security deployment, but told the BBC: \"We cannot leave Gaza at the mercy of thieves and militias backed by the Israeli occupation. Our weapons are legitimate... to resist occupation, and they will remain as long as the occupation continues.\"A retired security officer who served for years with the Palestinian Authority in Gaza said he feared the territory was sliding towards another round of internal bloodshed. \"Hamas hasn't changed. It still believes that weapons and violence are the only means to keep its movement alive,\" he told the BBC. \"Gaza is flooded with arms. Looters have stolen thousands of weapons and rounds of ammunition from Hamas stores during the war, and some groups have even received supplies from Israel. \"This is a perfect recipe for civil war: weapons, frustration, chaos, and a movement desperate to reassert control over a shattered and exhausted population.\"Khalil Abu Shammala, a human rights expert who lives in Gaza, said it remained to be seen whether Hamas would accept handing over control on the ground or seek to obstruct the plan's implementation.  \"There is undoubtedly widespread fear among many Gazans of potential internal fighting, given the many conditions that could fuel it,\" he said.He said Hamas had been forced to accept the peace plan by the severe pressure it was under.\"I believe its continued attempts to maintain influence by any means, including involvement in security affairs, could ultimately jeopardise the agreement and plunge Gaza's residents into even greater suffering,\" he said.These developments since the ceasefire earlier this week have sparked deep concern among Gazans already worn down by two years of a devastating conflict.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gaza: Hamas mobilises fighters as fears of internal violence mount",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/28d5/live/6f84f470-a6ae-11f0-b55a-e7725355d83f.jpg"
      ],
      "datePublished": "2025-10-11T14:44:59.000Z",
      "dateModified": "2025-10-11T14:44:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "AI used by Kent student to find possible cave entrances on Moon",
    "url": "https://www.bbc.com/news/articles/crkj3y6e4pmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2f4b/live/5f4c2b10-a36f-11f0-b6c8-ab6f97553cbf.png",
    "tag": "Trending",
    "date": "2025-10-08T05:05:12.000Z",
    "description": "4 days agoJacob PanonsSouth EastUniversity of KentBel'kovich A Pit is close to the Moon's north pole and therefore more likely to be a source of water",
    "body": "4 days agoJacob PanonsSouth EastUniversity of KentBel'kovich A Pit is close to the Moon's north pole and therefore more likely to be a source of waterArtificial intelligence (AI) has been used to find two previously undiscovered possible cave entrances on the Moon, which could support human survival on future space missions.Daniel Le Corre, a PhD researcher at the University of Kent, surveyed less than 0.3% of the lunar surface before finding the two pits.The South Marius Hills Pit, which the university said was previously overlooked by researchers, is in an area thought to be rich in lava tubes, while the Bel'kovich A Pit is close to the Moon's north pole and more likely to be a source of water.The pits were detected using an AI model that was trained to scan publicly available Nasa images and identify pits based on their distinctive shape.The AI model is named Essa, which is short for entrances to sub-surface areas and a nod to the Cornish name of Mr Le Corre's hometown, Saltash.Mr Le Corre said: \"Thanks to Essa, we can now analyse volumes of space data at speeds that would have been unachievable manually, thus accelerating the search for the pits that will be the most favourable for future exploration or habitation.\"The university said the pits may be connected to underground cave networks that could provide natural shelter from harmful radiation and micrometeorite impacts, as well as harbour water ice.\"It's this which makes them of interest to scientists as good bases for humans exploring or living on the Moon, and hopefully one day even Mars,\" a university spokesperson said.More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "AI used by Kent student to find possible cave entrances on Moon",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2f4b/live/5f4c2b10-a36f-11f0-b6c8-ab6f97553cbf.png"
      ],
      "datePublished": "2025-10-08T05:05:12.000Z",
      "dateModified": "2025-10-08T05:05:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "When do the clocks go back in 2025?",
    "url": "https://www.bbc.com/weather/articles/cm2zdzwy12do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/201d/live/af01ae30-a42a-11f0-ba96-81d873a15aec.jpg",
    "tag": "Trending",
    "date": "2025-10-11T23:32:29.000Z",
    "description": "Image source, Getty ImagesByBen RichLead Weather PresenterThe clocks will go back by one hour in the UK on the last Sunday of October.It marks the end",
    "body": "Image source, Getty ImagesByBen RichLead Weather PresenterThe clocks will go back by one hour in the UK on the last Sunday of October.It marks the end of British Summer Time (BST) and a return to Greenwich Mean Time (GMT), a shift that has been taking place for well over a century.Most of us will get an extra hour in bed - or at the pub - but it is not such good news for night shift workers who will have to spend an extra hour at work.The clocks go forward again in March 2026.You may already have noticed that the nights are drawing in - in fact we are currently losing four or five minutes of daylight every day.However the clock change will bring sunset forward by an hour in one fell swoop which may come as a shock to the system.What time do the clocks go back?The clock change happens at 02:00 BST on Sunday 26 October in the UK. The clocks will go forward again at 01:00 GMT on 29 March 2026, when we return to British Summer Time.The easy way to remember which way the clocks change is the phrase \"spring forward, fall back\".In other words, we turn the time forward an hour in spring and back an hour in fall - or autumn.What is Daylight Saving Time?The first country to make use of Daylight Saving Time (DST) was Germany, in 1916 during World War One.It was intended to maximise evening daylight meaning less heating and lighting was needed, reducing fuel consumption during wartime.Many other countries followed suit just a few weeks later, including the UK where it was named British Summer Time.The time shift has mostly continued ever since, although during a short period in World War Two there was British Double Summer Time, where the clocks went forward by two hours.An experiment between 1968 and 1971 trialled year-round BST and there continue to be some debates about whether the UK should wind its clocks forward permanently.Image source, BBC Weather Watchers / Rainbow WatcherImage caption, A permanent switch to BST would mean lighter evenings but darker mornings - especially in winterArguments for keeping the time zone in summer mode include a potential boost in economic productivity as well as a possible reduction in evening road accidents.It would also eliminate the minor disruption caused to sleep patterns by the annual gaining - and losing - of an hour.However, it would also mean some very gloomy winter mornings, especially in Scotland.In Edinburgh and Glasgow the sun does not rise until around 08:45 GMT in the second half of December, which would equate to 09:45 BST.It would leave Scottish commuters and schoolchildren making their winter morning journeys in darkness - bringing increased risks on the roads.Will my clock change automatically?Most smartphones, digital devices and even modern cars will adjust the time automatically when GMT begins.However analogue clocks will need switching manually, especially important if you are relying on an old-fashioned alarm clock to wake you up.And if you are anything like me the clock on the oven will present a particular challenge.What countries have Daylight Saving Time?We are certainly not alone in switching time zones twice a year.Most of North America and Europe observes Daylight Saving Time, although only small parts of Asia, Oceania, South America and Africa take part.However different countries change their clocks on different dates.For example in the USA the switch takes place on 2 November this year, while in Egypt it happens on 30 October.One benefit of an earlier sunset is that it might be easier to get out and capture it on camera.If you do, feel free to sign up and send your photos to BBC Weather Watchers.Click here to play 'Cooler than me?'",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "When do the clocks go back in 2025?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/201d/live/af01ae30-a42a-11f0-ba96-81d873a15aec.jpg"
      ],
      "datePublished": "2025-10-11T23:32:29.000Z",
      "dateModified": "2025-10-11T23:32:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Diane Keaton: Oscar-winning actress dies aged 79, US media report",
    "url": "https://www.bbc.com/news/articles/cr5q5rp4r64o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8e60/live/49a140d0-a6ed-11f0-928c-71dbb8619e94.jpg",
    "tag": "Trending",
    "date": "2025-10-12T06:25:29.000Z",
    "description": "51 minutes agoNoor NanjiCulture reporterOscar-winning actress Diane Keaton through the yearsOscar-winning actress Diane Keaton has died at the age of ",
    "body": "51 minutes agoNoor NanjiCulture reporterOscar-winning actress Diane Keaton through the yearsOscar-winning actress Diane Keaton has died at the age of 79.Keaton, who was born in Los Angeles, shot to fame in the 1970s through her role as Kay Adams-Corleone in The Godfather films.She was also known for starring roles in films including Father of the Bride, First Wives Club and Annie Hall, which won her the Academy Award for Best Actress in 1978.Producer and friend of Keaton, Dori Rath, confirmed the actress's death to CBS News, the BBC's US partner.Silver Screen Collection via Getty ImagesWoody Allen directed and starred alongside Diane Keaton in Annie Hall, one of the most famous films Keaton appeared inFor Annie Hall, Keaton also won the Golden Globe Award for Best Actress in a Comedy or Musical Motion Picture and the BAFTA Award for Best Actress in a Leading Role.Throughout her more than five-decade career, Keaton starred in dozens of other films including The Family Stone, Because I Said So, And So It Goes, as well as a number of other Woody Allen films, like Play It Again, Sam, Sleeper, Love and Death and Manhattan. Keaton made her film debut in the 1970 romantic comedy Lovers and Other Strangers. Her most recent film was the 2024 comedy Summer Camp where she starred alongside Eugene Levy and Kathy Bates.Keaton also directed several films, the first of which was a 1987 documentary, Heaven, chronicling people's beliefs about the afterlife. Her 1995 film Unstrung Heroes - a comedy-drama starring Andie MacDowell, John Turturro and Michael Richards - was selected for Cannes Film Festival's Un Certain Regard, which showcases unique stories by emerging directors. Most recently, Keaton directed Hanging Up in 2000, a comedy-drama starring herself, Meg Ryan and Lisa Kudrow.Both in her film roles and in her personal life, Keaton was known for her unique style, which often featured menswear and a wide-brimmed hat.Columbia/Tristar via Getty ImagesLisa Kudrow, Meg Ryan and Diane Keaton in \"Hanging Up\", a film about three sisters bonding over the imminent death of their grumpy fatherKeaton died in California on Saturday, a family spokesperson told People magazine, which first reported the news.Paying tribute, her First Wives Club co-star Bette Midler wrote on Instagram: \"The brilliant, beautiful, extraordinary Diane Keaton has died. I cannot tell you how unbearably sad this makes me.\"\"She was hilarious, a complete original, and completely without guile, or any of the competitiveness one would have expected from such a star. What you saw was who she was ... oh, la, lala!\"Fellow First Wives Club co-star Goldie Hawn said Keaton left \"a trail of fairy dust, filled with particles of light and memories beyond imagination\".Writing on Instagram, Hawn said: \"How do we say goodbye? What words can come to mind when your heart is broken? You never liked praise, so humble, but now you can't tell me to 'shut up' honey. There was, and will be, no one like you.\"Getty ImagesFirst Wives Club co-stars Goldie Hawn, Diane Keaton and Bette Midler Steve Martin, who starred with Keaton in Father of the Bride alongside Martin Short, reposted part of a magazine article where Short asks: \"Who's sexier, me or Steve Martin?\" Keaton replies: \"I mean, you're both idiots.\"  Martin said: \"Don't know who first posted this, but it sums up our delightful relationship with Diane.\"Actor Ben Stiller paid tribute on X, writing: \"Diane Keaton. One of the greatest film actors ever. An icon of style, humor and comedy. Brilliant. What a person.\"Keaton was nominated for three further Oscars - all in the best actress category - for her work in Something's Gotta Give, Marvin's Room and Reds.Getty ImagesSeen here in The Godfather Part II, Diane Keaton starred in the trilogy as Kay Corleone  She never married and had two adopted children - a daughter, Dexter, and a son, Duke.In her 2011 autobiography, titled Then Again, Keaton wrote: \"I have assessed my happiness ratio and this is the result. I am totally content whenever the ones I love are happy about something little, big, insignificant, whatever. \"I just don't think anyone could possibly have the same wonderful, intense, compelling feelings that I have for this family of mine.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Diane Keaton: Oscar-winning actress dies aged 79, US media report",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8e60/live/49a140d0-a6ed-11f0-928c-71dbb8619e94.jpg"
      ],
      "datePublished": "2025-10-12T06:25:29.000Z",
      "dateModified": "2025-10-12T06:25:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "It was a normal Saturday night in my pub - then Justin Bieber waltzed in",
    "url": "https://www.bbc.com/news/articles/cjw7554z85eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d3c3/live/3f730060-a447-11f0-b741-177e3e2c2fc7.jpg",
    "tag": "Trending",
    "date": "2025-10-08T10:41:25.000Z",
    "description": "4 days agoGraeme OgstonTayside and central reporterJustin Bieber/InstagramJustin Bieber filmed his latest music video in a Dundee pubWhen you're worki",
    "body": "4 days agoGraeme OgstonTayside and central reporterJustin Bieber/InstagramJustin Bieber filmed his latest music video in a Dundee pubWhen you're working in a Dundee bar on a Saturday night, a visit from Justin Bieber is the last thing you'd expect.Manager Rae Wright had to do a double-take when the pop superstar and his entourage \"waltzed in\" to the Abandon Ship pub.The Canadian singer was so impressed with the venue that he filmed an impromptu music video.The video has now been viewed more than 3.7 million times, and footage of locals drinking with Bieber has been circulating widely on social media.The 31-year-old, who flew into the city by private jet on Thursday, was also seen over the weekend playing golf at St Andrews and Gleneagles.Justin Bieber/InstagramJustin Bieber was spotted in the Abandon Ship at the weekendBar manager Rae Wright said the superstar came into the city centre pub asking if there was DJ equipment he could use.She said: \"It was just a standard Saturday night and then he waltzes in with three or four people.\"He put his speaker on, set the place up, put a couple of lights on and then he just started filming.\"Rae was initially unsure if it actually was the singer.Bar manager Rae Wright said the singer happily chatted to staff and customersShe said: \"I'm used to the baby Justin Bieber with the hair flick and stuff, but obviously I've followed him a little bit.\"But no-one walks around Dundee in a green beanie looking like that.\"And then my manager gave me the side eye that said, no this is really the Biebs.\" Rae said Bieber was \"lovely\" and happily spoke to the bar staff and customers.She said: \"He chatted to the bar staff like we were actually people, which a lot of people don't seem to do.\"It will be nice when we've actually processed it all and think, wow, Justin Bieber was here.\"Justin Bieber/InstagramBieber has spent several days in ScotlandBieber posted the video to his social media channels on Monday night with the message \"Bad Honey video for your headtops\".The bar shared the video on its Facebook page, posting: \"You might have heard we had a special visitor over the weekend. \"Enjoy Justin Bieber laying down a new video for Bad Honey live at Abandon Ship right here in Dundee, Scotland.\"Justin BieberThe singer also posted pictures of himself in St Andrews at the weekendFootage has circulated on social media of the singer drinking in the pub with local customers at the weekend.Bieber also posted photos of himself drinking a beer in the street in St Andrews on Sunday morning.He was previously seen at the Gleneagles Hotel, where he was filmed playing the piano and singing his song Walking Away.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "It was a normal Saturday night in my pub - then Justin Bieber waltzed in",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d3c3/live/3f730060-a447-11f0-b741-177e3e2c2fc7.jpg"
      ],
      "datePublished": "2025-10-08T10:41:25.000Z",
      "dateModified": "2025-10-08T10:41:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Indian student allegedly fighting for Russia captured by Ukrainian forces ",
    "url": "https://www.bbc.com/news/articles/cwy870p96yjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d7b2/live/deba3130-a4dc-11f0-97b2-7b0352757645.jpg",
    "tag": "Trending",
    "date": "2025-10-11T22:40:29.000Z",
    "description": "Indian student captured by Ukraine joined Russian army to avoid drug charges, says mother 9 hours agoGopal KateshiyaBBC Gujarati, MorbiHasina MajotiSa",
    "body": "Indian student captured by Ukraine joined Russian army to avoid drug charges, says mother 9 hours agoGopal KateshiyaBBC Gujarati, MorbiHasina MajotiSahil Majothi had gone to Russia to study computer engineeringUkraine has captured an Indian national allegedly fighting for Russian forces, the first known Indian detained in the ongoing war.Sahil Majothi, 22, from the Indian state of Gujarat, went to Russia to study computer engineering two years ago. His mother claims he was falsely accused in a drug case last April.Mr Majothi joined the Russian army to avoid imprisonment over drug charges,  according to a video released by Ukraine's army on Tuesday.The Indian foreign ministry says it is investigating the case and has not received formal communication from Ukraine. The BBC has asked the Russian government for a response. In an interview with BBC Gujarati, Mr Majothi's mother Hasina Majothi said her son went to Russia in January 2024. He completed a three-month language course in St Petersburg before moving to Moscow for college, supporting himself part-time as a kitchenware courier.She alleges that in April 2024, someone slipped drugs into a parcel handed to Mr Majothi during his deliveries.\"The police caught him with it and charged him,\" Ms Hasina said. According to Ms Hasina, her son was detained, held for six months and later sentenced to seven years in prison. The family hired a private lawyer in Russia to defend him, but they had no idea when or how he was drafted into the military.\"I don't know how he ended up in Ukraine. I only found out through the viral video,\" Ms Hasina said.In the video released by the 63rd Mechanized Brigade of the Ukrainian army, Mr Majothi can be heard saying he was given a choice between joining the Russian army, with pay for his service, or serving jail time. He said he was told he would serve in the military for a year before being released. Mr Majothi claims that different people promised him varying amounts of money - from a hundred thousand to over a million roubles - but he never received any payment.He says he underwent 15 days of training in September 2024 and was sent to the battlefield a year later, on 30 September.The next day, on 1 October, Mr Majothi said he had an altercation with his commander, after which he separated from Russian soldiers. That was when he came across a Ukrainian dugout and asked them for help, he added.The BBC cannot independently verify the date or location of the video in which he makes these claims. Ukrainian army/FacebookMr Majothi says he underwent 15 days of training before being sent to the battlefield a year laterOn Wednesday, after the video went viral, Gujarat's Anti-Terrorism Squad (ATS)  questioned Ms Hasina and her brother in Ahmedabad. Her relatives said she separated from her husband around her son's birth and supports her family as a seamstress while living with her maternal relatives.ATS officials confirmed Mr Majothi's arrest and subsequent detention in Russia. They said the family claimed to have had no contact with him since his arrest. At his former school in Morbi, teachers called Mr Majothi an \"average student\" but deeply motivated to fulfil his mother's dreams through education. They spoke on condition of anonymity.Local community leaders have also appealed to the government to intervene and secure his return. \"Many young men like him have been trapped and dragged into the war,\" said  Kasam Sumra. \"We appeal to the government to bring back Sahil and other young Indians who went abroad seeking work.\" Mr Majothi's arrest comes amid rising concerns over Indians being recruited into the Russian military. Reports say over 150 Indians, some on student or visitor visas, have enlisted. At least 12 have died in the conflict and 16 remain missing.In September, Indian officials urged Moscow to release and repatriate 27 Indian nationals who had been recruited into the army.The Indian government has consistently advised its citizens against participating in the ongoing war in Ukraine.\"We once again strongly urge all Indian nationals to stay away from offers to serve in the Russian army, as they are fraught with danger and risk to life,\" a spokesperson from India's foreign ministry said last month.Additional reporting by Roxy Gagdekar Chhara from Ahmedabad and Nikita Yadav from DelhiFollow BBC News India on Instagram, YouTube, X and Facebook.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Indian student allegedly fighting for Russia captured by Ukrainian forces ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d7b2/live/deba3130-a4dc-11f0-97b2-7b0352757645.jpg"
      ],
      "datePublished": "2025-10-11T22:40:29.000Z",
      "dateModified": "2025-10-11T22:40:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kingswood man wins £125k after forgetting to cancel Lottery ",
    "url": "https://www.bbc.com/news/articles/c0m4dnlrxlmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/45c6/live/409aef60-a5d8-11f0-b741-177e3e2c2fc7.jpg",
    "tag": "Trending",
    "date": "2025-10-09T10:46:46.000Z",
    "description": "3 days agoDawn LimbuBristol andMike GilmoreBristolJames Adams and his girlfriend Rohanna Coulthard win £125k in the People's Postcode LotteryA man who",
    "body": "3 days agoDawn LimbuBristol andMike GilmoreBristolJames Adams and his girlfriend Rohanna Coulthard win £125k in the People's Postcode LotteryA man who forgot to cancel his direct debit to the Postcode Lottery at the request of his girlfriend has pocketed £125,000 in October's lottery draw.James Adams, a 31-year-old graphic designer from Kingswood, said his girlfriend had asked him to cancel his subscription because they were saving for a wedding.He was one of eight people from a neighbourhood in Kingswood near Bristol to win the October draw as part of the subscription lottery where winners in the same postcode share the prize money.\"Thank God for just being lazy and really silly,\" said Mr Adams. \"Incompetence pays off.\"The People's Postcode LotteryMr Adams and Ms Coulthard will spend their winnings on home maintenance and a honeymoon\"My girlfriend asked me to cancel the postcode lottery a couple of months ago because we're saving for a few things and to be honest, I forgot,\" he added.The couple, who got engaged three years ago, said they will spend the money on a new bathroom and a honeymoon in New Zealand.\"Thank goodness he didn't,\" said his fiancée, Rohanna Coulthard.The couple shared a £1m pot of cash with seven other neighbours after their postcode won the lottery's weekly Millionaire Street Prize.Every ticket was worth £125,000.Kingswood was the first location announced in October's draw, with four winning locations to be announced.Local charities in each of the five winning areas will share a combined total of £1m to support their work.The People's Postcode LotteryGemma Marson-May says she had a premonition about winning the Postcode LotteryOne of the other winning neighbours was social worker Gemma Marson-May, who joined the People's Postcode Lottery after getting a \"strong feeling\" she would win. \"It sounds like nonsense, but something said to me that if I didn't sign up, I'd be stupid,\" she said. Ms Marson-May and her fiancée are looking to plan a holiday and buy a house.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kingswood man wins £125k after forgetting to cancel Lottery ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/45c6/live/409aef60-a5d8-11f0-b741-177e3e2c2fc7.jpg"
      ],
      "datePublished": "2025-10-09T10:46:46.000Z",
      "dateModified": "2025-10-09T10:46:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump directs Pentagon to pay troops during shutdown",
    "url": "https://www.bbc.com/news/articles/ce808gvp56mo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/28b1/live/0a753390-a70a-11f0-b741-177e3e2c2fc7.jpg",
    "tag": "Trending",
    "date": "2025-10-12T02:04:52.000Z",
    "description": "Trump directs Pentagon to 'use all available funds' to pay troops during shutdownDonald Trump is directing US Defence Secretary Pete Hegseth to pay mi",
    "body": "Trump directs Pentagon to 'use all available funds' to pay troops during shutdownDonald Trump is directing US Defence Secretary Pete Hegseth to pay military personnel despite the federal government shutdown. The president said on Saturday that Hegseth must make sure troops do not miss out on their regular paycheque, scheduled for Wednesday. The directive comes as other government employees have already had some pay withheld and others are being laid off.\"I will not allow the Democrats to hold our Military, and the entire Security of our Nation, HOSTAGE, with their dangerous Government Shutdown,\" Trump posted on his Truth Social platform. The Republican and Democratic parties blame each other for failing to agree on a spending plan to reopen the government.Trump's message asks Hegseth to \"use all available funds to get our Troops PAID\" on 15 October, when military personnel would see their pay withheld for the first time since the shutdown began on 1 October.Many US military employees are considered \"essential\", meaning they must still show up for duty without pay. Some 750,000 other federal employees - about 40% - have been furloughed, or sent home, also without pay.Furloughed employees are legally supposed to receive back-pay after a shutdown ends and they return to work, but the Trump administration has insinuated this might not happen.\"The Radical Left Democrats should OPEN THE GOVERNMENT, and then we can work together to address Healthcare, and many other things that they want to destroy,\" Trump posted on Saturday.Democrats have refused to vote for a Republican spending plan that would reopen the government after nearly 12 days shut down, saying any resolution must preserve expiring tax credits that reduce health insurance costs for millions of Americans and reverse Trump's cuts to Medicaid, the healthcare program for elderly and low-income people.Republicans accuse Democrats of unnecessarily bringing the government to a halt, and blame them for the knock-on effects caused by the federal work stoppage.Finding a way to pay for military salaries could help reduce some of the political risk  for congressional leaders if the shutdown drags on.In an effort to pressure Democrats, the Trump administration has also begun laying off thousands of government workers, an unprecedented move during a shutdown.\"The RIFs have begun,\" White House Office of Management Director Russell Vought announced in a post on X on Friday morning, referring to an acronym for \"reductions in force\".The administration disclosed later on Friday that seven agencies had started firing more than 4,000 people, making good on the president's repeated threats to use the shutdown to further his long-held goal of reducing the federal workforce.The reductions included dozens of employees at the Centers for Disease Control and Prevention (CDC), according to the BBC's US partner CBS news, citing sources familiar with the situation. The agency's entire Washington DC office was laid off, the sources told CBS, adding that among the laid-off employees were those working on the CDC's Mortality and Morbidity Weekly Report, the agency's Ebola response and immunisations. There were also reductions in the human resources department, they said. Andrew Nixon, a spokesperson for the Department of Health and Human Services, which oversees the CDC, told CBS that the let-go workers were not essential, and that \"HHS continues to close wasteful and duplicative entities, including those that are at odds with the Trump administration's Make America Healthy Again agenda\".Employees at the Treasury Department and in the Cybersecurity and Infrastructure Security Agency in the Department of Homeland Security were also among those laid off on Friday, those agencies confirmed.   The American Federation of Government Employees and AFL-CIO, two major unions representing federal workers, have filed a lawsuit in northern California, asking a judge to temporarily block the layoff orders. \"It is disgraceful that the Trump administration has used the government shutdown as an excuse to illegally fire thousands of workers who provide critical services to communities across the country,\" AFGE president Everett Kelley said.A spokesman from the White House budget office told the BBC on Saturday that the layoffs were just the beginning.\"These RIF numbers from the court filing are just a snapshot in time,\" he said. \"More RIFs are coming.\"In a court filing opposing the unions' request for a temporary restraining order, the justice department revealed that agencies such as the Departments of Education, Housing and Urban Development, Commerce and Energy and the Environmental Protection Agency could also see staff cuts. The government lawyers said the labour unions had failed to establish that their members would be irreparably harmed by the layoffs, which is needed for the judge to grant the restraining order. But they said a restraining order would \"irreparably harm the government\". Are you a federal worker in the US? Get in touch here",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump directs Pentagon to pay troops during shutdown",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/28b1/live/0a753390-a70a-11f0-b741-177e3e2c2fc7.jpg"
      ],
      "datePublished": "2025-10-12T02:04:52.000Z",
      "dateModified": "2025-10-12T02:04:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]