[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Explanation - The President’s Path: After Venezuela, what next for Trump? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mt27hj?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0ls8h0k.jpg",
    "tag": "Trending",
    "date": "2026-01-09T13:05:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search Sounds              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu   BBC SoundsSounds home pageHomeMusicPodcastsMy SoundsUse BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·09 Jan 2026,·24 minsThe President’s Path: After Venezuela, what next for Trump?The ExplanationAvailable for over a yearTrump's actions in Venezuela and the removal of Nicolás Maduro sparks talk of further US operations in the region. In this episode Caitríona Perry, Sumi Somaskanda and Bernd Debusmann look at the US operation that seized the President of Venezuela.\nEvery weekend, The President’s Path explores the state of US politics in Washington and beyond. We dig into the key issues shaping America and uncover what is on the minds of those closest to power. You can contact us at: path@bbc.co.uk\nSenior Producer: Oksana Kundirenko \nExecutive Producer: Anna HolfordProgramme WebsiteMore episodesCymraegGaeilgeGàidhligBBC Sounds HelpContacts, Privacy and InformationHelp with Signing InNewsletter",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Explanation - The President’s Path: After Venezuela, what next for Trump? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0ls8h0k.jpg"
      ],
      "datePublished": "2026-01-09T13:05:00.000Z",
      "dateModified": "2026-01-09T13:05:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Week: How Does Starmer Handle Trump, Grok and What's Going On In Iran? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mt4qyc?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-09T16:41:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·09 Jan 2026,·37 minsThe Week: How Does Starmer Handle Trump, Grok and What's Going On In Iran?NewscastAvailable for over a yearToday marks the thirteenth consecutive day of widespread anti-government protests in Iran.\nIran's top security body has warned that the Iranian judiciary and security forces will show \"no leniency towards saboteurs\", amid internet blackouts.\nAdam is joined in the Newscast studio by BBC chief international correspondent, Lyse Doucet, to discuss the context and history of the unrest in Iran, plus President Trump’s warnings to Ayatollah Ali Khamenei and his response. \nAlso in the studio is New Statesman political editor Ailbhe Rea and The House Mag deputy editor Sienna Rodgers, to wrap up the first calendar week of UK Politics.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Chloe Scannapieco and Jem Westgate. The social producer was Beth Pritchard. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Week: How Does Starmer Handle Trump, Grok and What's Going On In Iran? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-09T16:41:00.000Z",
      "dateModified": "2026-01-09T16:41:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Protester climbs onto balcony of Iranian embassy in London",
    "url": "https://www.bbc.com/news/articles/cy09yvd57x2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/572d/live/5a3ebe10-ee49-11f0-9d20-ebe7255153c6.jpg",
    "tag": "Trending",
    "date": "2026-01-10T20:00:17.000Z",
    "description": "14 minutes agoFiona NimoniBBCA protester has climbed on to the balcony of the Iranian embassy in west London as hundreds gathered outside the building",
    "body": "14 minutes agoFiona NimoniBBCA protester has climbed on to the balcony of the Iranian embassy in west London as hundreds gathered outside the building, waving flags and shouting anti-government slogans.The Metropolitan Police said two arrests had been made at the protest and that officers were also seeking another individual for trespass.Anti-government protests erupted in Iran on 28 December, with two human rights groups reporting that at least 50 protesters have been killed.Protesters demonstrating against the Iranian regime have been gathering outside embassies across the world. Earlier on Saturday, the Met said additional officers had been deployed to the protest \"to prevent any disorder\". Confirming the arrest of two individuals on Saturday evening - one for aggravated trespass and assault on an emergency worker and one for aggravated trespass - police said the protest was continuing but being \"safely policed\". \"We saw no serious disorder and officers will remain in the area to ensure the continued security of the Embassy,\" a statement said. Footage on Saturday showed a man standing on the London embassy's balcony and tearing down the Iranian flag. The embassy later posted a picture on its X account of the flag back in place.Others at the protest in Kensington held up pictures of Reza Pahlavi, the exiled son of Iran's last shah (king) Mohammad Reza Shah Pahlavi, who was ousted in 1979 when the revolution swept away Iran's monarchy.Many demonstrators in Iran have been calling for Reza Pahlavi's return.In a joint statement released last week, UK Prime Minister Sir Keir Starmer, along with the leaders of Germany and France, said they were \"deeply concerned about reports of violence by Iranian security forces, and strongly condemn the killing of protesters\".\"The Iranian authorities have the responsibility to protect their own population and must allow for the freedom of expression and peaceful assembly without fear of reprisal,\" French President Emmanuel Macron, German Chancellor Friedrich Merz and Starmer said. The protests, which have now entered their 13th day, erupted over the economy and have grown into the largest in years - leading to calls for an end to the Islamic Republic and some urging the restoration of the monarchy.Iran's Supreme Leader Ayatollah Ali Khamenei has called anti-government protesters \"troublemakers\" and accused them of trying \"to please the president of the US\".An internet blackout is currently in place across the Middle Eastern country. The BBC and most other international news organisations are barred from reporting inside Iran, so social media is often relied upon to verify what is happening on the ground.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Protester climbs onto balcony of Iranian embassy in London",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/572d/live/5a3ebe10-ee49-11f0-9d20-ebe7255153c6.jpg"
      ],
      "datePublished": "2026-01-10T20:00:17.000Z",
      "dateModified": "2026-01-10T20:00:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oppenheimer",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002p1fr?at_mid=8PiucSontB&at_campaign=Oppenheimer&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002p1fr&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Oppenheimer&at_bbc_team=BBC&at_creation=Film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mlb4dr.jpg",
    "tag": "Trending",
    "date": "2025-12-21T23:52:18.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeOppenheimerOppenheimerContains some strong language and some sexual content.Deals with SuicideThe life of J Robert Oppenheimer, the physicist appointed by the US in the race to develop the atomic bomb before the Nazis. But winning that race comes at a cost. Duration2h 49mFirst shown2023Available for 10 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesCrimes of the FutureA new world is revealed. Viggo Mortensen stars in David Cronenberg's gory body-horror1h 38mOperation MincemeatDeception - the greatest weapon in war. True story of a daring plan that changed history1h 58mA Ghost Story for ChristmasNothing is what it seems… Mark Gatiss adaptation of MR James' spine-tingling tale29 minsUnforgivenThe acclaimed Oscar-winner with Gene Hackman. A retired gunslinger takes on one last job2h 2mElvisAustin Butler and Tom Hanks star in Baz Luhrmann's exhilarating portrait of an icon2h 26mThe Great EscaperLove, loyalty and spirit never grow old. Based on a true tale that captivated the world1h 30mFuneral in BerlinMichael Caine stars. Harry is in Berlin, with a wall between him and his next assignment1h 38mRaging BullRobert De Niro stars in Martin Scorsese's acclaimed brutal biopic of boxer Jake LaMotta2h 2mThe GodfatherA movie masterpiece. Al Pacino, Marlon Brando and one of the most acclaimed films ever2h 47mThe Godfather Part IIKeep your enemies closer. Betrayal complicates the family business for Michael Corleone3h 9mJawsYou'll never go in the water again... Steven Spielberg's iconic blockbuster with bite1h 59mHell or High WaterJustice isn't a crime. Two Texan brothers resort to dangerous measures to save the ranch1h 36m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oppenheimer",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mlb4dr.jpg"
      ],
      "datePublished": "2025-12-21T23:52:18.000Z",
      "dateModified": "2025-12-21T23:52:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rare first Superman comic once stolen from Nicolas Cage sells for $15m",
    "url": "https://www.bbc.com/news/articles/cly95lpwl1ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2680/live/f3173f30-ee40-11f0-9d20-ebe7255153c6.jpg",
    "tag": "Trending",
    "date": "2026-01-10T16:06:41.000Z",
    "description": "A rare copy of the 1938 comic that introduced Superman to the world has sold to an anonymous collector for $15m (£11.2m).The private sale of the Actio",
    "body": "A rare copy of the 1938 comic that introduced Superman to the world has sold to an anonymous collector for $15m (£11.2m).The private sale of the Action Comics No 1 copy - once stolen from actor Nicolas Cage's home and returned to him over a decade later - was announced on Friday.The previous record for the sale of a comic book was set in November, when a pristine Superman No 1 fetched $9.12m at auction. Both sales far exceed the original 10-cent price tags - or around $2.25 in today's money.Superman's debut is one of several tales anthologised in Action Comics No 1, which is widely credited with having defined the superhero genre as we now know it. Fewer than 100 copies are thought to exist.Friday's Action Comics sale was negotiated by New York-based Metropolis Collectibles/Comic Connect, which said both the comic book's owner and the buyer wished to remain anonymous.The broker said the copy had been graded nine out of a possible 10 points by the Certified Guaranty Company, which specialises in authenticating collectables - making it the joint-highest scoring copy of the comic to date.The broker said its value was further inflated by its storied association with Hollywood star CageThe Con Air and National Treasure star purchased this particular copy in 1996 for $150,000 - a record at the time.But the comic was stolen during a party at Cage's home in 2000 and only found - inside a storage unit in California - in 2011.\"During that 11-year period, it skyrocketed in value. The thief made Nicolas Cage a lot of money by stealing it,\" said Metropolis/ComicConnect CEO Stephen Fishler.Cage was reunited with the copy and, six months later, sold it at auction for $2.2m.Fishler compared the comic's history to the brazen theft of Leonardo Da Vinci's Mona Lisa from the Louvre museum in Paris in 1911, which transformed the then little-known work to the world's most famous painting.\"The recovery of the painting made the Mona Lisa go from being just a great Da Vinci painting to a world icon - and that's what Action No 1 is. An icon of American pop culture.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rare first Superman comic once stolen from Nicolas Cage sells for $15m",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2680/live/f3173f30-ee40-11f0-9d20-ebe7255153c6.jpg"
      ],
      "datePublished": "2026-01-10T16:06:41.000Z",
      "dateModified": "2026-01-10T16:06:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man dies in Cornwall as tree falls on caravan in Storm Goretti",
    "url": "https://www.bbc.com/news/articles/c20zxxlgdedo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4848/live/3c1a0af0-ee41-11f0-9d20-ebe7255153c6.jpg",
    "tag": "Trending",
    "date": "2026-01-10T15:20:06.000Z",
    "description": "5 hours agoZhara Simpson,South WestandArchie Farmer,South WestA man in his 50s has been found dead after a tree fell on to a caravan during Storm Gore",
    "body": "5 hours agoZhara Simpson,South WestandArchie Farmer,South WestA man in his 50s has been found dead after a tree fell on to a caravan during Storm Goretti. Devon and Cornwall Police said emergency services were called to the Mawgan area of Helston, Cornwall, at about 19:35 GMT on Thursday after the tree fell during a red weather warning for wind.\"Tragically, a man aged in his 50s was located deceased within the caravan,\" police said, adding his next of kin had been informed and were being supported by officers. Police said work took place at the scene on Friday to safely remove the tree and make further inquiries at the scene. The death was not being treated as suspicious and a file would be prepared for the coroner, they added.The Met Office issued the rare red weather warning on Thursday between 16:00 to 23:00, which caused major damage and disruption across the county.Red warnings say \"exposed places\" are most at risk, bringing the risk of falling debris and a danger to life. The storm saw gusts of up to 100mph (160km/h) in Cornwall and the Isles of Scilly.Cornwall Council said the storm had been \"one of the most severe\" the county had experienced \"in living memory\", with crews working around the clock to clear fallen trees and carry out emergency repairs.The clean-up is continuing into the weekend.A yellow warning for ice, including in parts of east Cornwall, issued from 12:00 GMT on Friday is due to end at midday. More than 34,000 premises are still without electricity in the south-west of England, the National Grid said. Staff were working \"tirelessly\" to fix issues, it added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man dies in Cornwall as tree falls on caravan in Storm Goretti",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4848/live/3c1a0af0-ee41-11f0-9d20-ebe7255153c6.jpg"
      ],
      "datePublished": "2026-01-10T15:20:06.000Z",
      "dateModified": "2026-01-10T15:20:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shay Given 'unreservedly' apologises for Holocaust remark on Final Score",
    "url": "https://www.bbc.com/sport/football/articles/c0r459gv2l1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3443/live/213e81d0-ee59-11f0-a367-9dccbe902db1.jpg",
    "tag": "Trending",
    "date": "2026-01-10T19:34:41.000Z",
    "description": "Former Premier League goalkeeper Shay Given has \"unreservedly\" apologised for describing Wilfried Nancy's short time as Celtic manager as an \"absolute",
    "body": "Former Premier League goalkeeper Shay Given has \"unreservedly\" apologised for describing Wilfried Nancy's short time as Celtic manager as an \"absolute Holocaust\" live on BBC show Final Score.Given, 49, was asked to give his thoughts on Nancy's sacking after just 33 days and eight games in charge of the Scottish champions. The ex-Republic of Ireland international said the tenure \"was terrible from start to finish\", before using insensitive language to describe 48-year-old Nancy's first week in the role.Posting on X,, external Given said he used a word he \"didn't fully understand the meaning of, and certainly won't ever use again\".He added: \"We all have areas of ignorance in our knowledge, and I hope to use this as an opportunity to become better educated going forward. \"I am genuinely mortified and apologise unreservedly to everyone offended, and will be donating my fee from today's show to the Holocaust Educational Trust.\" Final Score presenter Jason Mohammad apologised later in the show for the \"inappropriate language\" used.Frenchman Nancy was sacked last week following Celtic's 3-1 defeat by Rangers - his sixth loss as manager in just eight games. His 33-day stint as Celtic boss was the shortest reign in the club's history.The Holocaust, carried out by Nazi Germany during World War Two, claimed the lives of an estimated six million Jews.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shay Given 'unreservedly' apologises for Holocaust remark on Final Score",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3443/live/213e81d0-ee59-11f0-a367-9dccbe902db1.jpg"
      ],
      "datePublished": "2026-01-10T19:34:41.000Z",
      "dateModified": "2026-01-10T19:34:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Arrests as emergency responders are hurt in South Benfleet crash",
    "url": "https://www.bbc.com/news/articles/cj0nz9eldnzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7de4/live/34cad1f0-ee35-11f0-b216-81b5f104816e.jpg",
    "tag": "Trending",
    "date": "2026-01-10T17:38:16.000Z",
    "description": "Three men have been arrested after paramedics and off-duty police were struck while attending the scene of a crash in Essex.The emergency services wer",
    "body": "Three men have been arrested after paramedics and off-duty police were struck while attending the scene of a crash in Essex.The emergency services were initially called after a single-vehicle collision involving a white Nissan X-Trail on the A130 in South Benfleet at about 00:15 GMT. While at the scene, five emergency responders were struck in a second crash involving a white Ford Transit van. Two of them - a paramedic and a police officer - remain in a serious condition in hospital.An investigation has been launched, with police appealing for witnesses or anyone with dashcam footage to come forward.Those being questioned by police are:A 23-year-old man, from Canvey, on suspicion of causing serious injury by dangerous driving, theft of a motor vehicle and driving while unfit through drink or drugsA 29-year-old man, from Westcliff, on suspicion of causing serious injury by dangerous driving, theft of a motor vehicle, possession of a Class B or Class C drug, and being in charge of a vehicle while unfit through drink or drugsA 39-year-old man, from Canvey, on suspicion of causing serious injury by dangerous driving and driving while unfit through drink or drugs.Essex Police said the paramedic and police officer suffered serious injuries.It said the crashes happened on the southbound carriageway of the A130, between the Rayleigh Spur and Sadlers Farm roundabouts.Officers closed the A130 between Sadlers Farm and the A1245 Bonville's Roundabout leading to the A13, while it carried out an investigation. The roads have since been reopened.Ch Supt Morgan Cronin said: \"The thoughts of everyone at Essex Police are with the emergency workers injured while responding to this incident – both they and their families are being provided with support from the force.\"Policing minister Sarah Jones said her thoughts were with the officers, their families, colleagues and witnesses to the incident.\"I hope they make full recoveries and inquiries quickly determine the cause,\" she added in a post on X.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Arrests as emergency responders are hurt in South Benfleet crash",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7de4/live/34cad1f0-ee35-11f0-b216-81b5f104816e.jpg"
      ],
      "datePublished": "2026-01-10T17:38:16.000Z",
      "dateModified": "2026-01-10T17:38:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Debt charities report January spike in calls as worries mount",
    "url": "https://www.bbc.com/news/articles/c0er4n1zelro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/83c9/live/1ed7a090-eb0f-11f0-992c-75363ad17690.jpg",
    "tag": "Trending",
    "date": "2026-01-10T00:08:52.000Z",
    "description": "'Unprecedented' numbers seeking debt help post-Christmas, say charities20 hours agoKevin PeacheyCost of living correspondentGetty ImagesDebt charities",
    "body": "'Unprecedented' numbers seeking debt help post-Christmas, say charities20 hours agoKevin PeacheyCost of living correspondentGetty ImagesDebt charities say they are receiving an influx of calls as people worry their financial situation has slipped towards becoming unmanageable.The first weeks of January are usually the busiest time of year for helplines following a particularly expensive period.Advice charity StepChange said Monday was busier than any single day last year, and credit counselling service Money Wellness said a fifth of those accessing its services at the turn of the year did so between 22:00 and 03:00.Dave Murphy is working his way out of debt and said demands from creditors could have become overwhelming, but he urged anyone struggling to ensure they asked for help - for their financial and mental wellbeing.Money Wellness, which runs free debt and money advice services, said thousands of people had accessed its services on Christmas Eve and Christmas Day. Expanded assistance online allows people to increasingly find information outside of normal hours - including overnight.Sebrina McCullough, its head of advice, said: \"The numbers we're seeing over Christmas and New Year are unprecedented.\"People often feel pressure to celebrate the holidays, even when money is tight, and our data shows many are turning to us late at night when they feel most anxious.\"Pressure of priority billsStepChange's website had 3,958 visitors on Christmas Day, and 15,401 on New Year's Eve and 1 January combined.Many may have simply been exploring their options, but calls came in thick and fast at the start of the month. While not at the level of the energy crisis of a few years ago, call numbers were notably up on last year.The Money Advice Trust, which runs National Debtline, said the first working days of January had seen more calls than last year.Monday was the busiest single day in its history, when 1,365 calls came in.Concerns are particularly acute for those struggling to pay priority bills such as council tax and rent.The colder weather could also place extra strain on vulnerable households, with £4.4bn already owed to energy suppliers following a period of high prices, although the government's cold weather payments have been triggered in many areas.Charities are urging anyone whose debt has become unmanageable to seek help as soon as possible, rather than making matters worse by ignoring the situation.That is a view shared by Dave, who has managed to work his way out of difficulty. A few years ago, he found his previously manageable credit card debt becoming a problem when he was unexpectedly made redundant at the same time as going through a divorce.Dave has turned his finances around after receiving help from StepChange\"They were two quite dramatic things in six months,\" said Dave, who has previously spoken to the BBC about his debt issues.\"The debt was around £20,000 to £25,000 at its height. It became so overwhelming. You feel that you are letting creditors down because you want to do what they ask of you - but you are scared, you are renting, and at times you struggle to get through each day.\"Once you are in a spiral, it is really hard to get out of it.\"He is now working in insurance, his debts are manageable and being paid off, and he said he wanted to help others \"to show that you can get through these things\".Figures published earlier in the week by the Bank of England fuelled concerns that everyday costs were becoming harder for some households to manage without turning to borrowing.The data showed that credit card borrowing grew at the fastest annual rate in nearly two years in the run-up to Christmas.The annual growth rate for credit card borrowing increased to 12.1% in November, from 10.9% the previous month - the highest figure since January 2024 when it was 12.5%.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Debt charities report January spike in calls as worries mount",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/83c9/live/1ed7a090-eb0f-11f0-992c-75363ad17690.jpg"
      ],
      "datePublished": "2026-01-10T00:08:52.000Z",
      "dateModified": "2026-01-10T00:08:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bedford teen wins world record title for her Jellycat collection",
    "url": "https://www.bbc.com/news/articles/c3r1q9gjzd5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6caf/live/5b9c0b70-ea28-11f0-bee8-cb37bc70a803.jpg",
    "tag": "Trending",
    "date": "2026-01-06T06:09:20.000Z",
    "description": "5 days agoChloe BlackandLily-May Symonds,BedfordshireGuinness World RecordsA teenager from Bedford has been awarded a Guinness World Records title for",
    "body": "5 days agoChloe BlackandLily-May Symonds,BedfordshireGuinness World RecordsA teenager from Bedford has been awarded a Guinness World Records title for assembling the largest collection of Jellycat toys.Hope Roberts, 19, has 877 items in her collection, including soft toys, stickers, bags and keyrings.Guinness World Records confirmed the title in December after a detailed verification process that took four hours.\"I didn't know the full number until it was announced, so I was just as shocked,\" said Hope.She started her collection two years ago after buying a Jellycat bunny in a charity shop for 20p.\"I kind of knew what they were but had never seen one,\" she said.It led to Hope looking for them at car boot sales and being given the furry toys as gifts.Guinness World RecordsWhen the Guinness team told Hope Roberts how big her collection was, \"I had to get them to repeat it a couple of times – I couldn't believe it\"Her collection has grown further since being awarded the Guinness title, and she said she thought it was now near the 1,000 mark.The value of Jellycat toys varies wildly, from a few pounds to more than £1,000 for rare or limited edition items.The brand began life in 1999 but saw a spike in popularity during the Covid-19 pandemic.Hope documents her collection on social media, and she recently received feedback from socialite Nicky Hilton.\"I had to Google [that] it was definitely her,\" said Hope. \"It's crazy.\"Related storiesRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bedford teen wins world record title for her Jellycat collection",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6caf/live/5b9c0b70-ea28-11f0-bee8-cb37bc70a803.jpg"
      ],
      "datePublished": "2026-01-06T06:09:20.000Z",
      "dateModified": "2026-01-06T06:09:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Musk says outcry over X's Grok service is 'excuse for censorship'",
    "url": "https://www.bbc.com/news/articles/ce3kqzepp5zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fae4/live/80dd7630-edbb-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-10T11:41:06.000Z",
    "description": "Elon Musk has said critics of his social media site X are looking for \"any excuse for censorship\", after its artificial intelligence (AI) chatbot Grok",
    "body": "Elon Musk has said critics of his social media site X are looking for \"any excuse for censorship\", after its artificial intelligence (AI) chatbot Grok drew criticism over its use to create sexualised images of people without their knowledge or consent.Ofcom says it is conducting an urgent assessment of X in response, with the backing of Technology Secretary Liz Kendall.But the chairwomen of Parliament's technology and media committees have both said they are concerned that \"gaps\" in the Online Safety Act might hinder the media regulator's ability to deal with the matter.X has now limited the use of AI image function to those who pay a monthly fee, a change dubbed by Downing Street as \"insulting\" to victims of sexual violence.The BBC has seen several examples of the free AI tool undressing women and putting them in sexual situations without their consent.Kendall said on Friday that she expects an update from Ofcom within days, and that it would have the government's full support should it decide to block X in the UK.Musk reposted a number of messages on the site overnight criticising the government's reproval of Grok - including one which showed AI-generated images of Prime Minister Sir Keir Starmer in a bikini.\"They just want to suppress free speech,\" Musk wrote.Ashley St Clair, the mother of one of Elon Musk's children, told BBC Newshour on Friday that Grok had generated sexualised photos of her as a child. The conservative influencer said her image had been \"stripped\" to appear \"basically nude, bent over\", despite her telling Grok that she did not consent to the sexualised images.St Clair, who filed a lawsuit against Musk in 2025 seeking sole custody of their child, accused the social media site of \"not taking enough action\" to tackle illegal content, including child sexual abuse imagery. \"This could be stopped with a singular message to an engineer,\" she said.As of Friday morning, Grok was telling users asking it to alter images uploaded to X that \"image generation and editing are currently limited to paying subscribers\", adding users \"can subscribe to unlock these features\".An Ofcom spokesperson said on Friday: \"We urgently made contact [with X] on Monday and set a firm deadline of today to explain themselves, to which we have received a response.\"We're now undertaking an expedited assessment as a matter of urgency and will provide further updates shortly.\"Ofcom's powers under the Online Safety Act include being able to seek a court order to prevent third parties from helping X raise money or be accessed in the UK - should the firm refuse to comply.But Dame Chi Onwurah, chairwoman of the innovation and technology committee, said she was \"concerned and confused\" about how the matter is \"actually being addressed\", and has written to Ofcom and Kendall for clarification.Dame Chi said it was \"unclear\" under the Online Safety Act whether the creation of such images using AI was illegal, as was the responsibility of social media sites for what was shared on their platforms.\"The act should really make something so harmful to so many people clearly illegal, and X's responsibility should be clear,\" she told BBC Radio 4's Today programme.Caroline Dinenage, chairwoman of the culture, media and sport committee, likewise said she had a \"real fear that there is a gap in the regulation\".\"There are doubts as to whether the Online Safety Act actually has the power to regulate functionality - that means generative AI's ability to nudify someone's image,\" she told BBC Breakfast.The use of Grok to generate non-consensual sexualised images has been condemned by politicians on all sides: Prime Minister Sir Keir Starmer called it \"disgraceful\" and \"disgusting\"Reform UK leader Nigel Farage said it was \"horrible in every way\" and that X \"needs to go further\" than the changes it had made to Grok on Friday, but he added that banning the platform would be an attack on free speech The Liberal Democrats called for access to X to be temporarily restricted in the UK while the social media site was investigated.Elsewhere, Australia's Prime Minister Anthony Albanese said he agreed with Starmer that the material was \"completely abhorrent\".\"It, once again, is an example of social media not showing social responsibility,\" Albanese said, adding that Australia's digital safety commissioner was looking at the situation.\"Australians and indeed, global citizens deserve better.\"Meanwhile, Grok was temporarily suspended in Indonesia on Saturday. The country's digital minister said \"non-consensual sexual deepfakes [were] a serious violation of human rights, dignity and the security of citizens in the digital space\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Musk says outcry over X's Grok service is 'excuse for censorship'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fae4/live/80dd7630-edbb-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-10T11:41:06.000Z",
      "dateModified": "2026-01-10T11:41:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Charlotte Church says she would be dead without dad's help ",
    "url": "https://www.bbc.com/news/articles/c0er41yjyyno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e11a/live/93be1e00-eb1b-11f0-a935-e16fc33d91b4.jpg",
    "tag": "Trending",
    "date": "2026-01-06T18:05:59.000Z",
    "description": "4 days agoAnna LewisBBC Wales Getty ImagesCharlotte Church says her father's \"deep stewardship\" helped her navigate being a child star Charlotte Churc",
    "body": "4 days agoAnna LewisBBC Wales Getty ImagesCharlotte Church says her father's \"deep stewardship\" helped her navigate being a child star Charlotte Church has said she \"would be dead\" without the influence of her father, after growing up in the spotlight.The Cardiff-born singer opened up on her close relationship with her father, James Church, in public speaking coach Deborah Thomas's podcast, These Three Things. Church, 39, credited her dad with helping her navigate the \"child star route\", adding: \"It's so arduous and there are so many temptations along the way, and so it would have been so easy for me to have fallen into addiction...\" In the interview, the star said she had a \"lot going on\" and that her father, who has a terminal diagnosis of rare blood disorder amyloidosis, was currently in hospital. During the podcast, which asks guests to share a special person, place and possession which has shaped them, Church said her father was an \"absolutely extraordinary human\" who had been through \"so much\", including battling septicaemia seven times. Describing the start of her career as a child touring with mother Maria, she said: \"We really missed him on the road. My family aren't very traditional in any way at all, and so my father was far more sort of like the nurturing one.\"The singer, who recently appeared on Celebrity Traitors, was just 11 years old when she rose to global fame and earned the moniker the Voice of an Angel.Church said her father joined them on the road after a year and would help take care of her while her mother dealt with the business side of her career, describing him as like \"the hearth\". \"He was sort of worldly and wise enough that he could ground me in a perspective, ground me in the transience of it all, and that it probably wouldn't be forever, and just [try] to say let's enjoy it while it's here.\" Church, who runs a wellness retreat in the Nant Caethon Valley in Powys, said it had been a \"journey\" since her father's terminal diagnosis nearly a decade ago. \"Pretty much every year in those nine years, he's had a near-death experience where it's like something's happened.\"He has really had to tolerate this rollercoaster of health and emotions and everything associated. But it's also a very long time to live with a terminal diagnosis, and so it's massively changed him.\"Speaking about her father's impact on her life, Church added: \"I'm making him a photo album, and I think that'll be very emotional for us to go through. \"But in general, I am able to tell him what he means to me, and how he has massively shaped my life and shaped who I am.\"Without him, I'd be dead.\" More top stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Charlotte Church says she would be dead without dad's help ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e11a/live/93be1e00-eb1b-11f0-a935-e16fc33d91b4.jpg"
      ],
      "datePublished": "2026-01-06T18:05:59.000Z",
      "dateModified": "2026-01-06T18:05:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lewes influencer Faye Greenwood talks about heart transplant at 24",
    "url": "https://www.bbc.com/news/articles/cgjn0gwz8zeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c4e3/live/b5ee3c50-dc32-11f0-9509-6dc8fe227516.jpg",
    "tag": "Trending",
    "date": "2026-01-05T14:47:59.000Z",
    "description": "'I couldn't believe I had a heart attack at 24'5 days agoJacob Panonsin LewesFaye GreenwoodFaye Greenwood had the heart attack while on holiday in Par",
    "body": "'I couldn't believe I had a heart attack at 24'5 days agoJacob Panonsin LewesFaye GreenwoodFaye Greenwood had the heart attack while on holiday in ParisAn influencer who had a heart transplant aged 24 said she \"couldn't believe\" she had a heart attack so young.Faye Greenwood had the heart attack in July while on holiday in Paris with her now-fiance Ailbhe Lower, who is also an influencer known as Mr Bruv.Ms Greenwood said: \"I couldn't believe that something that serious would be happening.\"[You think:] 'That won't happen to me,' and then it did.\"The influencer, who lives in Lewes, said symptoms began when she started to have chest pains and vomited.\"I can't really remember a lot, but I just felt I was in really bad pain, something I've never felt before,\" she explained.\"A feeling of doom, like the world was closing in.\"Mr Lower said due to translation issues and people misunderstanding the symptoms of a heart attack considering his partner's age, it was six and a half hours before Ms Greenwood was admitted to hospital.Faye GreenwoodMr Lower and Ms Greenwood have been together about six yearsMs Greenwood says doctors are still unsure what caused the heart attack and that her previously diagnosed dilated cardiomyopathy was potentially not a factor.When back in the UK, Ms Greenwood was then told she may have to wait up to a year for a heart transplant, but was able to find a donor and leave hospital in just over four months.She said: \"It's just something you never really think that you're going to have to deal with.\"Mr Lower said it was a \"nice, crazy feeling\" to know his partner now had a healthy heartThe couple, who have about 1.6 million followers between them on their social media channels, were also hit with a £14,000 medical bill from the hospital in France, and a separate £40,000 bill as Ms Greenwood had to be flown back to the UK in an air ambulance.Ms Greenwood said the cost was \"really scary\" as the couple had saved up to move out of Mr Lower's mother's house six months earlier.She added: \"So we were only just getting on track with our lives and our jobs and everything, and then it just went downhill.\"'Unfair' situationThe influencer, who is known for her fashion and lifestyle content, says she is unsure what the future holds in terms of her career.\"Now it's a lot different because I have a lot of scarring and things and I don't really know how brands all react to that sort of thing,\" she explained.Mr Lower said the situation was \"unfair\".\"I drink loads of pints, eat Greggs every day, sit on my bum, and then she's having her green shakes and doing Pilates every day and she's the one who has the heart attack,\" he added.Ms Greenwood is now urging people to understand and not ignore symptoms of a heart condition, even if they are relatively young.\"If you think anything could be wrong, even a very small thing, just definitely get it checked out or push the doctors to check you out,\" she said.Mr Lower added: \"Don't just think: 'It'll be fine, it won't happen to me', because we thought that.\"More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lewes influencer Faye Greenwood talks about heart transplant at 24",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c4e3/live/b5ee3c50-dc32-11f0-9509-6dc8fe227516.jpg"
      ],
      "datePublished": "2026-01-05T14:47:59.000Z",
      "dateModified": "2026-01-05T14:47:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why 2016 nostalgia is taking over social media in 2026",
    "url": "https://www.bbc.com/news/articles/cwy1e605dvgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1882/live/92ec72f0-ed88-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-10T02:09:12.000Z",
    "description": "Rose-tinted filter: Why 2016 is taking over social media in 202618 hours agoNaomi de SouzaBBC NewsbeatGetty ImagesZara Larsson's breakthrough 2016 hit",
    "body": "Rose-tinted filter: Why 2016 is taking over social media in 202618 hours agoNaomi de SouzaBBC NewsbeatGetty ImagesZara Larsson's breakthrough 2016 hit Lush Life is back in the chartsWake up - it's 2016.The Chainsmokers are playing wall to wall, you've perfected your Snapchat dog filter pose and Leicester City have just won the Premier League.Justin Bieber and Drake are dominating playlists and everyone is hunting Pikachu on Pokémon Go - if they aren't filming their Mannequin Challenge attempt on their phone.It all feels like it happened yesterday. But that might be thanks to social media, which has welcomed 2026 by looking 10 years into the past.According to TikTok, searches for \"2016\" surged by 452% in the last week, and more than 55 million videos have been created using the app's filter named after the year.The nostalgic wave has got us recalling our favourite trends, tracks and looks. But why now? And is there anything special about the year 2016 specifically?Lauren RedfernRadio 1 DJ Lauren Redfern, pictured in 2016, was a teenager at the timeMusic has been a big driver of the 2016 revival, and some of the most popular tracks of the year have been making a comeback online.Radio 1 Anthems host Lauren Redfern tells BBC Newsbeat it's not hard to see why.\"It's just so so good, that music from that time, and so nostalgic to so many of us,\" she says.\"We had Zayn's debut solo single Pillow Talk, Chainsmokers were really hot at that time.\"Twenty One Pilots, The 1975 - it was all going on.\"Stats from Spotify show a 71% increase in \"2016\" playlists last year compared with 2024, and big-hitting artists have also been making a comeback.Zara Larsson's smash hit Lush Life, which first entered the charts 10 years ago, re-entered the UK top 40 last month and has since climbed back up to number eight.The Swedish pop sensation has also been behind a make-up trend focused on maximal, glam \"Y2K\" looks, and that's something Lauren remembers fondly from 2016.\"It was all the mad colours,\" she says. \"The eye shadow was bright pink. I used to love a big, thick winged eyeliner as well.\"I still like to pull that out every now and then.\"Coldest CreativeJoel Marlinarson, who advises brands on social media strategy, says 2016 evokes a simpler time in the minds of manyJoel Marlinarson, from London, is a TikTok creator and brand strategist whose video explaining why Gen Z is so obsessed with 2016 has been viewed more than a million times.The 22-year-old tells Newsbeat the year has become its own aesthetic on TikTok, thanks largely to the dedicated filter, which he says has helped to accelerate the trend.It gives videos a vintage, pink-hued look that's reminiscent of classic Instagram photo effects \"everyone used\" in 2016, says Joel.\"So without using words, be it somebody in France, be it someone in Germany, seeing that filter you're instantly taken back to a time when we were having so much fun and were so much younger,\" he says.Joel says the rosy hues also evoke a simpler time on social media, which played a big part in young people's lives but was far less complex.\"Looking at Instagram, around 2016, there was no carousel posts,\" says Joel. \"People were posting a picture of their avocado, and it wasn't so performative.\"There weren't short-form reels, so there wasn't that algorithmic kind of fatigue that people have now.\"This is something Lauren, 26, says she can relate to.\"To be honest, 2016 was the year of Snapchat stories,\" she says. \"If I go back through my Snapchat memories, it's pretty much all from 2016.\"Instagram was all about photos, we didn't have to worry about Reels, we didn't have to worry about updating our stories all the time. It was just a simple, chilled life.\"Jenny RoutledgeClay Routledge specialises in the study of nostalgia and says 2016 might not be as magical as it seemsLooking back at 2016 through a literal rose-tinted filter is a source of comfort for many of us, but is it distorting our memory?It was a particularly gloomy year for celebrity deaths, with legends including David Bowie, Prince, George Michael and Alan Rickman all passing away.And 2016 also saw some major world events - such as the UK Brexit referendum and Donald Trump's first US election win - that continue to divide people, whether they celebrated or despaired at the result.Psychologist Clay Routledge has specialised in the study of nostalgia since 2001 and says he's \"hesistant to make too big of a deal of any one given year\".Political events of 2016 may have elevated existing divisions, Clay says, but these significant moments and events hold nostalgic power because they act as \"markers\".\"You can always find these points in time in which people anchor themselves to for some sort of guidance,\" he says.The Boston Globe via Getty ImagesDonald Trump was elected as US president for the first time in 2016Clay suggests two factors that could be driving the obsession with 2016: the start of a new year, and many young people feeling uncertain about the future.\"We tend to be especially nostalgic when the world feels like it's going through some major change,\" says Clay.He points to the impact of artificial intelligence (AI), and people's worries about how it will affect employment.\"When generations are going through this kind of upheaval or this kind of challenge, they tend to look back to their youth for comfort and for inspiration, for guidance,\" he says.And 10 years ago makes sense for a lot of us, he says.\"Young millennials would be in their early 30s, and the older Gen Z would be in their late 20s, and so 10 years ago would be that kind of youthful time,\" he says. \"People are looking back maybe a decade and saying, 'Okay, what was going on then?'\"Lauren, who was in her teens at the time, says 2016 was \"a pivotal time for quite a lot of us\" and a time of firsts, discovering the world - and yourself - as you went along.Many people have been using the trend to remember and reflect on how their lives have changed, and Joel thinks it's reminded many of how carefree things felt 10 years ago.\"You posted something, you didn't think about how many likes there were,\" he recalls. \"Perhaps that's attached to the universal experience of ageing, but it feels now things are so divisive that we can all relate to feeling the world was a little lighter back then.\"Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why 2016 nostalgia is taking over social media in 2026",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1882/live/92ec72f0-ed88-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-10T02:09:12.000Z",
      "dateModified": "2026-01-10T02:09:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]