[
  {
    "title": "Woman's Hour - SEND reforms: A Woman's Hour and SEND in the Spotlight special - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/m002rql9?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0m1q1c4.jpg",
    "tag": "Trending",
    "date": "2026-02-24T12:23:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·24 Feb 2026,·58 minsSEND reforms: A Woman's Hour and SEND in the Spotlight specialWoman's HourAvailable for over a yearWoman's Hour in collaboration with our SEND in the Spotlight podcast brings you a special programme on the impact of the government's SEND reforms in England.\nWhether you’re a parent, a young person, a teacher or someone who works in the wider system we find out what the changes mean for you - and help you decode the new language - whether it's IB, ISP, Targeted, Targeted Plus, or SPP. \nNuala McGovern speaks to parents, teachers, charities, the School Standards Minister and the Children’s Commissioner for England.  We also hear from SEND in the Spotlight podcast regulars - actors Anna Maxwell Martin and Kellie Bright.\nSearch for the SEND in the Spotlight podcast on BBC Sounds.\nContributors:\nGeorgia Gould MP, Schools Standards Minister\nMarsha Martin, founder of Black SEN Mamas\nKatie Ghose, CEO of Kids charity and Disabled Children's Partnership\nMargaret Mulholland, Association of School and College Leaders\nKate McGough, BBC Education reporter\nEleanor Wright, solicitor at SOS!SEN\nRamandeep Kaur, SEND parent\nCarrie Grant, SEND parent and broadcaster\nKatie Nellist, SEND ambassador\nLouise Gittins, chair of the Local Government Association\nDame Rachel de Souza, Children's Commissioner for England\nPresenter: Nuala McGovern\nProducer: Sarah Crawley, with Carolyn Atkinson\nDigital producer: Olivia Bolton\nEditor: Karen DalzielProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Woman's Hour - SEND reforms: A Woman's Hour and SEND in the Spotlight special - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0m1q1c4.jpg"
      ],
      "datePublished": "2026-02-24T12:23:00.000Z",
      "dateModified": "2026-02-24T12:23:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The David Lammy Interview - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n2zr7q?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-02-24T16:31:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·24 Feb 2026,·29 minsAvailable for over a yearToday, Adam and Chris speak to the deputy prime minister David Lammy about his justice reforms.\nHe acknowledged the court backlog will continue to rise and may be at the same level as it is today at the next general election despite the government’s planned reforms. \nHe also said that Labour would be “out on their bums” if they haven’t delivered the change the public want by the time of the next election.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers.\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris. The social producers were Joe Wilkinson and Jem Westgate. The technical producer was Ben Andrews. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The David Lammy Interview - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-02-24T16:31:00.000Z",
      "dateModified": "2026-02-24T16:31:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential ch",
    "body": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mandelson's lawyers say he was arrested over 'baseless' claim he was a flight risk",
    "url": "https://www.bbc.com/news/articles/c05vey47yddo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5be3/live/7f0c72e0-11ae-11f1-a8f6-f18f581059b8.jpg",
    "tag": "Trending",
    "date": "2026-02-24T20:13:35.000Z",
    "description": "5 hours agoJoe Pike,Politics investigations correspondentandJoshua Nevett,Political reporterBBCLord Mandelson was arrested at his London home on Monda",
    "body": "5 hours agoJoe Pike,Politics investigations correspondentandJoshua Nevett,Political reporterBBCLord Mandelson was arrested at his London home on MondayLord Mandelson's lawyers have said police officers arrested the former ambassador to the US at his London home on Monday afternoon because they worried he was a flight risk.The peer's lawyers have told the BBC there is \"absolutely no truth\" in the suggestion that Lord Mandelson was planning to leave the UK and move abroad.The Metropolitan Police has said it will not comment.The former Labour minister was arrested on suspicion of misconduct in public office on Monday and later released on bail, pending further investigation.A spokesperson for Mishcon De Reya, Lord Mandelson's lawyers, said: \"Peter Mandelson was arrested yesterday despite an agreement with the police that he would attend an interview next month on a voluntary basis.\"The arrest was prompted by a baseless suggestion that he was planning to leave the country and take up permanent residence abroad. There is absolutely no truth whatsoever in any such suggestion.\"We have asked the MPS [Metropolitan Police Service] for the evidence relied upon to justify the arrest. \"Peter Mandelson's overriding priority is to cooperate with the police investigation, as he has done throughout this process, and to clear his name.\"Lord Mandelson was arrested on Monday afternoon and taken to Wandsworth police station in London for interview.He was at the police station for nine hours before being released on bail in the early hours of Tuesday morning.The force launched an investigation earlier this month over allegations that, while he was serving as a minister, Lord Mandelson had passed on market-sensitive government information to the late convicted paedophile Jeffrey Epstein.The arrest on Monday followed search warrants at two addresses in Wiltshire and Camden.The BBC understands that Lord Mandelson's position is he has not acted in any way criminally and that he was not motivated by financial gain.On Monday, Lord Mandelson was seen being led away from his London home by plain clothes officers who put him in the back of an unmarked car.The BBC understands his arrest was carried out by officers from the Met's central specialist crime division.Consultations between the police and the Crown Prosecution Service are ongoing.The Met said Lord Mandelson has been bailed to the end of May.The former Labour spin doctor has been a high profile figure in British politics for decades.He began working for Labour in the 1980s, playing a key role in the New Labour movement and Sir Tony Blair's landslide election victory in 1997.Lord Mandelson became the British ambassador to the US in February 2025 but was sacked in September after Downing Street said new information about the depth of his relationship with Epstein had emerged.The allegations against Lord Mandelson surfaced after the US Department of Justice released a tranche of documents last month, including emails between him and Epstein.An email from 2009 appears to show that Lord Mandelson passed on an assessment by an adviser to the then prime minister Gordon Brown about policy measures, including an \"asset sales plan\".He also appeared to discuss a tax on bankers' bonuses and confirm an imminent bailout package for the Euro on the day before it was announced in 2010.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mandelson's lawyers say he was arrested over 'baseless' claim he was a flight risk",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5be3/live/7f0c72e0-11ae-11f1-a8f6-f18f581059b8.jpg"
      ],
      "datePublished": "2026-02-24T20:13:35.000Z",
      "dateModified": "2026-02-24T20:13:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Swindon man 'caused death of wife by controlling her', court told",
    "url": "https://www.bbc.com/news/articles/czx7yp14v1vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/03a9/live/e796a8f0-115c-11f1-9c59-f960223a391b.png",
    "tag": "Trending",
    "date": "2026-02-24T15:07:23.000Z",
    "description": "10 hours agoFamily handoutTarryn Baird was 34 years old when she took her own lifeA man controlled his wife through \"physical and sexual violence\", le",
    "body": "10 hours agoFamily handoutTarryn Baird was 34 years old when she took her own lifeA man controlled his wife through \"physical and sexual violence\", leading to her taking her own life because she could not escape him, a court has heard.Christopher Trybus from Swindon in Wiltshire is accused of the manslaughter of Tarryn Baird, who took her own life in November 2017 at the age of 34.The 43-year-old also faces charges at Winchester Crown Court of controlling and coercive behaviour and two charges of rape, which he denies.Tom Little KC, prosecuting, told the jury that Trybus carried out \"extensive and escalating controlling, coercive and manipulative behaviour including sexual violence of two rapes and other sexual assaults\".More from WiltshireIf you have been affected by any of the issues raised in this story, information and support can be found at the BBC's Action Line.It is alleged that Trybus controlled Baird, using and threatening violence towards her, sexually assaulting her, monitoring her whereabouts, limiting access to finance, threatening to reveal private information to her family and isolating her from her family.\"It took place over a sustained period of time behind closed doors and all of it during the course of a marriage,\" Little told the court.\"It led ultimately in November 2017 to a woman in just her thirties and whose name is Tarryn Baird taking her own life.\"She was the defendant's wife and the prosecution say that the defendant is legally responsible for her death.\"Family handoutTarryn Baird worked in Swindon at an opticiansLittle explained that Trybus controlled \"many aspects of their relationship\" even from abroad using the \"threat and fear of physical and sexual violence\" leading to a deterioration in her \"already weakened mental state and a cause of her deciding that she should take her own life\".He added: \"She had not managed to escape from him, despite seriously considering doing so on a number of occasions.\"A jury heard Baird, who worked at an opticians, left a note to her family which said a \"dark cloud\" was over her. Trybus, a software consultant and developer, denies the charges. He said that Baird had been diagnosed as possibly having PTSD, having witnessed and suffered from armed car-jacking incidents in South Africa.The prosecutor said: \"Other things that Tarryn Baird said about the nature of the relationship were that the defendant had told her parents she was addicted to drugs and alcohol, and that this would prevent them believing her if she told them about the domestic abuse.\"He described this as \"classic domestic abuse perpetrator behaviour\".The trial continues.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Swindon man 'caused death of wife by controlling her', court told",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/03a9/live/e796a8f0-115c-11f1-9c59-f960223a391b.png"
      ],
      "datePublished": "2026-02-24T15:07:23.000Z",
      "dateModified": "2026-02-24T15:07:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NHS secures bone cement rescue package so surgery can resume",
    "url": "https://www.bbc.com/news/articles/cnv670d128go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5c31/live/6786e2d0-11d7-11f1-bd07-7dc7b5f46c6b.jpg",
    "tag": "Trending",
    "date": "2026-02-25T00:08:16.000Z",
    "description": "1 hour agoNick TriggleHealth correspondentGetty ImagesThe NHS says it has secured a rescue package of alternative medical cement to allow joint surger",
    "body": "1 hour agoNick TriggleHealth correspondentGetty ImagesThe NHS says it has secured a rescue package of alternative medical cement to allow joint surgery to continue.Last week hospitals had been told to postpone treatments, including knee and hip replacements, after the health service's main supplier encountered a major production problem.The NHS was thought to have only two weeks' supply in stock and so was focussing on emergency patients and the most complex cases on the waiting list.But NHS England believes the shortfall will now be covered after a new supplier was found and an existing supplier agreed to up its deliveries.Prof Tim Briggs of NHS England said: \"This shortage has been extremely concerning for patients and surgeons and we are delighted the NHS has now been able to secure this 'rescue package' of alternative bone cement to ensure trauma and elective care can continue across the country.\"Heraeus Medical, which supplies around three-quarters of the bone cement used by the NHS, had to temporarily halt production at its main site in Germany last week.It said it had experienced a critical machine failure when it was in the process of upgrading its production processes. It is expected to cause disruption to supply for two months.The product is used in more than 1,000 operations a week, including in joint replacements and to treat older patients who have suffered falls and those with broken hips.Currently there are 850,000 patients on the waiting list in England requiring planned treatment for their joints – the largest of any speciality.But the NHS has now secured enough for 10 to 12 weeks' supply of bone cement from Dutch manufacturer Zimmer Biomet, with the first stocks already in the country.One of the NHS's other suppliers – Johnson and Johnson – has said it can increase its deliveries too.The extra supplies will also be available to hospitals in other parts of the UK which were affected too.Fergal Monsell of the British Orthopaedic Association said: \"The alternative bone cement has been widely used since 2008 and has been assessed by surgical experts who confirm that it has the same chemical components and material properties. \"Patients can therefore be reassured that it this will not affect the outcome of their surgery.\"Health minister Zubir Ahmed said he was delighted by the breakthrough: \"This government's top health priority is cutting NHS waiting lists – and while it's good news that disruption has been minimised, our focus is now on rescheduling those procedures that were postponed.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NHS secures bone cement rescue package so surgery can resume",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5c31/live/6786e2d0-11d7-11f1-bd07-7dc7b5f46c6b.jpg"
      ],
      "datePublished": "2026-02-25T00:08:16.000Z",
      "dateModified": "2026-02-25T00:08:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Spring-like weather in the UK",
    "url": "https://www.bbc.com/weather/articles/cedzvwe1nn5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/99c9/live/313f4da0-1189-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-24T20:20:12.000Z",
    "description": "On Tuesday, temperatures in High Beach in Essex and Frittenden in Kent reached 16.6C.In Kinloss, in Moray, 13.7C was recorded. In Wales and Northern I",
    "body": "On Tuesday, temperatures in High Beach in Essex and Frittenden in Kent reached 16.6C.In Kinloss, in Moray, 13.7C was recorded. In Wales and Northern Ireland, temperatures fell a little short of those recorded at the weekend but still reached 15.2C and 13.4C in Hawarden and Helen's Bay respectively. The mercury could rise a little further still on Wednesday in south-east England with a small chance of 18C (64F) in the best of the sunshine. Northern Ireland may also be a little warmer than on Tuesday,  following a wet start.In the north and west of the UK there will be more cloud and some rain, but temperatures even here will still be above average.To put this warmer weather into context - the last time the temperature reached 18C was 13 November 2025, and the record for February is 21.2C (70.2F) on 26 February 2019 at Kew Gardens.Wednesday is likely to be the peak of the warmth this week, with temperatures back to near average on the last day on February and a possible frost for many on Friday night.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Spring-like weather in the UK",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/99c9/live/313f4da0-1189-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-24T20:20:12.000Z",
      "dateModified": "2026-02-24T20:20:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MPs openly criticising Andrew reflects shift in tradition",
    "url": "https://www.bbc.com/news/articles/c9wny21kkd9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cbe5/live/307c0fc0-11ac-11f1-a8f6-f18f581059b8.jpg",
    "tag": "Trending",
    "date": "2026-02-24T20:29:41.000Z",
    "description": "5 hours agoDaniela RelphSenior royal correspondentGetty ImagesThe MPs in the chamber did not hold back. This was new territory – hearing politicians o",
    "body": "5 hours agoDaniela RelphSenior royal correspondentGetty ImagesThe MPs in the chamber did not hold back. This was new territory – hearing politicians openly criticising a member of the Royal Family in a parliamentary debate was striking.The language was stark. We heard Andrew Mountbatten-Windsor was \"a rude, arrogant, entitled man who could not distinguish between the public interest, which he said he served, and his own private interest\".For Buckingham Palace, it may have been an uncomfortable watch at times.MPs shared their personal experiences of meeting the former prince – all of them were resoundingly negative. The debate, called by the Liberal Democrats to demand the release of documents relating to Andrew's 2001 appointment as UK trade envoy, took in privilege, deference, and holding power to account. The talk was of building a culture of accountability and transparency.MPs questioned Andrew's appointment and what oversight existed during his decade-long tenure, and if lessons had been learned following allegations he shared sensitive information with convicted sex offender Jeffrey Epstein.Andrew has not responded to the BBC's requests for comment on specific allegations that have emerged after the US release of files in January related to Epstein. He has previously denied any wrongdoing in relation to the late financier.The fact that this debate happened at all is in itself significant. It reflects the heat of the Andrew story and how conventions are shifting with the public mood.Buckingham Palace will not be getting involved in the details of what we heard today, but their position remains the same. Their focus is on supporting the police investigation and they will not be saying anything that could impact the proper process of the law.Erskine May, the guide to parliamentary procedure first published in 1844, says MPs should not put a question before Parliament which \"casts reflections upon the sovereign or the Royal Family\".That has generally been treated more as guidance than an official ban on discussing or criticising the Royal Family in Parliament.Decisions on royals being talked about in Parliament have been managed by the Speaker of the House, with a nod to convention and historical precedent.Over the years, MPs have generally abided by that approach - sometimes grudgingly.Today was perhaps the closest Parliament had come to removing those bandages.The level of public interest and the mounting questions around Andrew's work as trade envoy made it worthy of parliamentary debate.Several MPs said the public deserved clarity about the nature of his official role and how concerns, if raised at the time, were handled.It was, of course, a debate with limitations due to the ongoing police investigation but even hearing the small number of MPs in the chamber openly discussing stories that had existed in the shadows for so long felt impactful.Today was a reminder that public mood is moving fast and conventions must sometimes shift with it.Liberal Democrat leader Ed Davey, who led the debate, called the Jeffrey Epstein associations with the British establishment a \"stain\" on the UK and said today's debate had been an opportunity to \"clean away that stain with the disinfectant of transparency\".More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MPs openly criticising Andrew reflects shift in tradition",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cbe5/live/307c0fc0-11ac-11f1-a8f6-f18f581059b8.jpg"
      ],
      "datePublished": "2026-02-24T20:29:41.000Z",
      "dateModified": "2026-02-24T20:29:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC edited another racial slur out of Bafta ceremony",
    "url": "https://www.bbc.com/news/articles/c5ykl7y2zv9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/13f8/live/8b5d6660-109d-11f1-b048-c9424b2cf5fd.jpg",
    "tag": "Trending",
    "date": "2026-02-24T15:11:48.000Z",
    "description": "10 hours agoSteven McIntoshEntertainment reporterGetty ImagesThe racial slur was shouted while Michael B Jordan (left) and Delroy Lindo were presentin",
    "body": "10 hours agoSteven McIntoshEntertainment reporterGetty ImagesThe racial slur was shouted while Michael B Jordan (left) and Delroy Lindo were presenting an awardA racial slur was edited out of the Baftas ceremony before it was broadcast, but another one aired in error, the BBC's chief content officer has said.Tourette's campaigner John Davidson shouted the N-word when US actors Michael B Jordan and Delroy Lindo were on stage on Sunday. The shout was audible in the broadcast, although many viewers would have struggled to make out the word.BBC content chief Kate Phillips emailed staff on Tuesday, reiterating the BBC's apology for it not being edited out of the broadcast, adding: \"We understand how distressing this was.\"Phillips confirmed other instances of offensive language had been removed, telling staff: \"The edit team removed another racial slur from the broadcast.\"In contrast, the slur shouted when Lindo and Jordan were on stage \"was aired in error and we would never have knowingly allowed this to be broadcast\", she said.The use of the N-word on any BBC television programme is very rare and usually requires sign-off from a channel controller.The Bafta ceremony was shown on BBC One on a two-hour delay, with producers editing the show's length to fit its two-hour broadcast slot.BBC News understands the producers overseeing the ceremony for the BBC were doing so from a TV truck and simply did not hear the slur shouted when Lindo and Jordan were on stage. Davidson was not on mic or on stage at the time.Phillips added: \"Award attendees were pre-warned about the possibility of involuntary verbal tics associated with Tourette syndrome at the start of the show, and [host] Alan Cumming addressed it during the broadcast. \"Of course, this doesn't lessen the impact and upset.\"How the Bafta racial slur controversy unfolded\"We take full responsibility for what happened,\" Phillips said. \"When I was made aware it was audible on iPlayer, I asked for it to be taken down.\"The ceremony started at 17:00 GMT, two hours before the TV broadcast began.The ceremony was made available on iPlayer after its broadcast concluded at 21:00 GMT. It was removed from iPlayer at around 11:30 on Monday morning.In a statement on Monday, Bafta said it acknowledged the \"harm this has caused, address what happened and apologise to all\".\"Michael B Jordan and Delroy Lindo were on stage at the time, and we apologise unreservedly to them, and to all those impacted. We would like to thank Michael and Delroy for their incredible dignity and professionalism.\"Bafta also thanked Davidson for his \"dignity and consideration of others, on what should have been a night of celebration for him\".Getty ImagesHost Alan Cumming apologised to the audience for the language heard during the ceremonyAfter the ceremony, Lindo told Vanity Fair that he and Jordan, who were handing out an award \"did what we had to do\" as they carried on presenting, but also said he wished \"someone from Bafta spoke to us afterward\".On Tuesday, Deadline reported that a representative from Warner Bros, the studio behind Sinners, which stars Lindo and Jordan, complained to Bafta in the minutes after the slur was shouted, and reportedly received assurances that their concerns would be passed on to the BBC. Bafta has been asked for comment. In a letter to its members on Tuesday, the organisation said: \"We are in contact with the studios involved and conversations are ongoing.\"Bafta also said it wanted to \"assure all our members that a comprehensive review is under way\".In a statement on Monday, Davidson said he was \"deeply mortified if anyone considers my involuntary tics to be intentional or to carry any meaning\".\"I have spent my life trying to support and empower the Tourette's community and to teach empathy, kindness and understanding from others and I will continue to do so,\" he said in a statement.\"I chose to leave the auditorium early into the ceremony as I was aware of the distress my tics were causing.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC edited another racial slur out of Bafta ceremony",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/13f8/live/8b5d6660-109d-11f1-b048-c9424b2cf5fd.jpg"
      ],
      "datePublished": "2026-02-24T15:11:48.000Z",
      "dateModified": "2026-02-24T15:11:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "ETA: What is the UK's new travel system and how are dual nationals affected?",
    "url": "https://www.bbc.com/news/articles/cy57p1v61d1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ee60/live/83372ca0-11b5-11f1-801d-ed3cff6bf876.jpg",
    "tag": "Trending",
    "date": "2026-02-25T00:05:49.000Z",
    "description": "1 hour agoMitchell LabiakBusiness reporterUniversal Images Group via Getty ImagesPeople coming to the UK under the new system will still need to go th",
    "body": "1 hour agoMitchell LabiakBusiness reporterUniversal Images Group via Getty ImagesPeople coming to the UK under the new system will still need to go through passport control on arrival (file photo)A new travel system for visitors to the UK comes into force from Wednesday for citizens of dozens of countries like the US and Australia.The government says electronic travel authorisation (ETA) will improve the immigration system.However, it has created problems for dual nationals, who have been scrambling to get a UK passport to follow the new rules.What is an ETA and who needs one?From 25 February, most people who have been able to travel to the UK visa-free until now will need an ETA.The new rules apply to people from 85 different countries.Once approved, your ETA will allow you to stay in the UK for up to six months. It will be valid for two years, or until your passport expires, and allows multiple journeys to the UK.The visit can be for things like tourism, business or short-term study. It can also be for people who cross the border and travel through the UK as part of a journey, although people transiting through UK airports and who don't need to go through border security will not need an ETA. Longer trips and visits for work or longer study will require a visa.People who usually need a visa to travel to the UK will still need a visa to travel to the UK. They will not need to apply for an ETA as well.British or Irish citizens will not need an ETA or a visa to visit the UK or to travel through it. There are a few other exceptions, such as those with settled status or children travelling from France on a school trip.The scheme was launched in October 2023 but the government says it was \"not strictly enforced to give visitors ample time to adjust to the new requirement\".The government says ETAs will streamline the immigration system, speed it up and make it more secure.How do I get an ETA and how much does it cost?Getting an ETA costs £16, but the government has said it plans to increase the fee to £20 in the future.You will need to provide contact and passport details, a provide suitable photo, and answer a set of questions.You must travel using the same passport you used when you applied for the ETA.The government says most people will get an automatic answer in minutes when using the ETA app, but it recommends people apply at least three working days before travelling.If a person's ETA application is rejected, the government says they will be told the reason and can apply again.However, if a person's ETA application is refused, they cannot appeal and instead need to apply for a visa to visit the UK.How will the rules be enforced?When you check into your journey, you may not be able to board without a valid ETA.Airlines, rail companies and shipping companies have been given tools by the UK government to verify travel permission through automated digital checks with the Home Office.An ETA is digitally linked to your passport, so you don't need a paper copy at the border. However, the government says you may want to keep a paper copy for your records anyway.While an ETA gives you permission to visit the UK, it does not give you the right to enter. So you will still need to go through passport control.You could still be turned away at the border even with a valid ETA if there are other issues at passport control.What is the problem for dual nationals?Dual nationals - those who are citizens of both the UK and other countries - cannot get an ETA.To enter the country, they will need to show either a British passport or a new digital version of the certificate of entitlement to attach to their second nationality passport.Without one of them, they could face being denied the right to travel back to the UK.Neither British passports nor certificates of entitlement are automatically issued to people who obtain citizenship, which means some dual nationals have never applied for them, even if they have lived in the UK for decades.Both documents take several weeks to obtain, and there are costs too. A British passport costs about £100 for an adult, while the certificate of entitlement costs £589.Previously, dual nationals had been able to leave the UK and return using their non-British passport.Some have been outside the country since the rule change has been announced and say they haven't had enough time to adjust to the changes. A Home Office spokesperson previously told the BBC that \"public information advising dual nationals to carry the correct documents has been available since October 2024 and a substantive communications campaign about the introduction of ETA has been running since 2023\".Which other countries use ETAs?If ETA sounds familiar, it's because Canada, the US, and other countries already use the system.However, the costs vary.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ETA: What is the UK's new travel system and how are dual nationals affected?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ee60/live/83372ca0-11b5-11f1-801d-ed3cff6bf876.jpg"
      ],
      "datePublished": "2026-02-25T00:05:49.000Z",
      "dateModified": "2026-02-25T00:05:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MPs back move to release files on Andrew's appointment as trade envoy",
    "url": "https://www.bbc.com/news/articles/c80jd955889o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/231f/live/4e407880-1106-11f1-95d6-71ff8dfa1746.png",
    "tag": "Trending",
    "date": "2026-02-24T22:29:48.000Z",
    "description": "3 hours agoRichard Wheeler & Jennifer McKiernanPolitical reportersGetty ImagesMPs have backed releasing documents on Andrew Mountbatten-Windsor's appo",
    "body": "3 hours agoRichard Wheeler & Jennifer McKiernanPolitical reportersGetty ImagesMPs have backed releasing documents on Andrew Mountbatten-Windsor's appointment as a UK trade envoy.Trade Minister Sir Chris Bryant described Andrew as \"rude, arrogant and entitled\", as the government supported a Lib Dem motion forcing ministers to release files on his appointment in 2001.Sir Chris said the government would comply with the motion \"as fast as we possibly can\", although he said the live police investigation into Andrew could cause delays.Andrew was released under investigation last week after his arrest on suspicion of misconduct in public office. He has previously denied any wrongdoing over his links to Jeffrey Epstein but has not responded to this specific allegation.Police searches at Andrew's former Royal Lodge residence in Windsor, Berkshire, finished on Tuesday.Police had previously said they were considering investigating him over allegations relating to his association with the late sex offender Jeffrey Epstein and were reviewing allegations he shared confidential material.Andrew held the role of \"special representative for international trade and investment\" between 2001 and 2011, giving him privileged access to senior government and business contacts around the world.Emails released in the US from the latest tranche of files related to Epstein include claims that he forwarded government reports from visits to Vietnam, Singapore and China to Epstein in 2010.Elsewhere in the documents, Andrew is also alleged to have forwarded information on investment opportunities in gold and uranium in Afghanistan to Epstein.Andrew has not responded to the BBC's requests for comment on specific allegations that have emerged after the US release of files in January related to the late financier. He has previously denied any wrongdoing in relation to Epstein and has denied any personal gain from his role as trade envoy.Speaking in the House of Commons, Sir Chris said colleagues and civil servants had told him about their interactions with Andrew.He told MPs: \"They all betray the same pattern – a man on a constant self-aggrandising and self-enriching hustle, a rude, arrogant and entitled man who could not distinguish between the public interest, which he said he served, and his own private interest.\"The Lib Dems used scheduled debating time allocated to the party on Tuesday to force the government to agree to a so-called humble address that compels ministers to release information on Mountbatten-Windsor's appointment.This type of motion is generally seen as binding and was successfully used by the Conservatives earlier this month to force the government into releasing material related to Lord Mandelson's appointment as US ambassador in late 2024.The motion was approved unopposed without the need for a formal vote.Sir Chris, confirming the government's support, told the House of Commons: \"Frankly, it is the least we owe the victims of the horrific abuse that was perpetrated by Jeffrey Epstein and others, the abuse that was enabled, aided and abetted by a very extensive group of arrogant, entitled and often very wealthy individuals in this country and elsewhere.\"It's not just the people who participated in the abuse, it's the many, many more who turned a blind eye out of greed, familiarity or deference.\"To my mind they too were complicit, just as complicit and I welcome the reckoning that is coming to them now.\"Watch: Sir Ed Davey pressed on defending Andrew as trade envoy in 2011Sir Chris went on to explain the government would comply with the terms of the humble address \"in full\" before seeking to manage expectations on the speed of the process.After Conservative MP Sir Edward Leigh warned it could be \"years before we see any of these papers\", Sir Chris said: \"I want to make sure that we move as fast as we possibly can, but I also want to make sure that justice does happen, and I don't want to do anything that would undermine the police investigations.\"I hope that they will be able to move as swiftly as possible and we will certainly co-operate with them as swiftly as possible.\"It's worth bearing in mind that the documents that might be envisaged in this are mostly 25-years-old. Some of them are a bit earlier. They may be substantial in number and many of them will be in hard copy.\"For the Conservatives, shadow chancellor of the Duchy of Lancaster Alex Burghart advised ministers about \"how bad it will look\" if the government \"does not provide information as swiftly as possible\".Lib Dem leader Sir Ed, speaking in the Commons, described the Epstein scandal as \"truly global\" but also \"a deeply British scandal reaching right to the top of the British establishment\".In 2011, when he was a business minister, Sir Ed said Andrew was doing an \"excellent job\" as trade envoy and dismissed concerns around him at the time as \"innuendo\".Asked about his defence of Andrew during a previous parliamentary debate, he told BBC Radio 4's Today programme: \"First of all can I apologise to all those victims of Epstein who may have read those words and been upset by them. I really regret them.\"Sir Ed said he \"wasn't really over the brief\" and added \"no MP mentioned Epstein in that debate and I think that tells a tale about how Parliament and MPs don't hold the Royal Family, didn't hold [the former] Prince Andrew in that really privileged position, properly to account\".Andrew was appointed to the unpaid trade role under Tony Blair's Labour government.He was officially appointed by the then Queen after consultation with the Cabinet Office, Foreign Office and British Trade International.Elsewhere, MPs on the Business and Trade Select Committee said any inquiry into the role of UK trade envoys could only begin once legal proceedings against Andrew had concluded.However, Labour MP Liam Byrne, who chairs the committee said it would \"begin gathering information immediately\" so it would be ready to launch an inquiry if it decided to once police action had concluded.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MPs back move to release files on Andrew's appointment as trade envoy",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/231f/live/4e407880-1106-11f1-95d6-71ff8dfa1746.png"
      ],
      "datePublished": "2026-02-24T22:29:48.000Z",
      "dateModified": "2026-02-24T22:29:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Energy bills to fall in April after charges shake-up",
    "url": "https://www.bbc.com/news/articles/cx2lpl9lxw2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e3f9/live/a9b88a60-1177-11f1-ba61-2b399c307393.jpg",
    "tag": "Trending",
    "date": "2026-02-25T00:04:55.000Z",
    "description": "1 hour agoKevin PeacheyCost of living correspondentGetty ImagesEnergy bills will fall in April following a shake-up in costs by the government, with d",
    "body": "1 hour agoKevin PeacheyCost of living correspondentGetty ImagesEnergy bills will fall in April following a shake-up in costs by the government, with details of the extent of the drop to be announced shortly.Nearly everyone in England, Wales and Scotland will benefit from a cut irrespective of their tariff, although the amounts will vary between households.Energy regulator Ofgem will publish its next price cap imminently. The latest forecasts suggest households on variable tariffs will see their bill cut by about 7%.However, prices still remain relatively high by historical standards, debts have ballooned, and billpayers are being urged to shop around for further savings.Budget promise to reduce billsDomestic gas and electricity bills are a complicated mix of charges for energy policy, costs to run the network, as well as the price of gas and electricity to run a home.In November's Budget, Chancellor Rachel Reeves announced changes to the first of these - policy costs. She said the typical annual household energy bill would fall by £150, by scrapping the Energy Company Obligation (Eco) scheme introduced by the Conservatives in government, and also moving some charges onto general taxation.So, analysts at the consultancy Cornwall Insight have forecast that a household using a typical amount of gas and electricity will see their annual bill drop by £117, to £1,641 in April. A similar fall was seen last summer, but prices have risen since then. The announcement for bills in April will be made at 07:00 GMT on Wednesday.Crucially, the discount on each household's individual energy bill will depend on the size and type of household and how much energy it uses.The reduction is expected to be primarily applied through a lower price per unit of electricity used. This means high electricity users, which may include vulnerable households with medical equipment, are likely to see the biggest benefit. Those who use little electricity and a lot of gas will benefit the least.Ofgem is announcing changes to its price cap, which affects millions of households on variable deals.However, the changes to policy costs will also mean a reduction in bills for those on fixed deals. They will be contacted by their supplier with details in the coming weeks on the specific change to their tariff.The wholesale cost of gas, which spiked after Russia's invasion of Ukraine four years ago and led to soaring household bills, remains relatively volatile and difficult to predict.This makes it tricky to say what will happen to domestic energy bills later in the year, but Cornwall Insight is forecasting relatively little further change.Regulators and campaigners have encouraged people to shop around for a cheaper, fixed deal, depending on their circumstances.Richard Neudegg, director of regulation at Uswitch, said: \"While it is good news that the price cap is coming down, consumers should not be fooled into thinking that it is a good deal. \"By moving into a competitive fixed deal, consumers could save £200 [a year] as well as get the benefit of these government changes.\"Cost of living pressureEnergy bills will fall in April, but other bills will increase - meaning most people will continue to face a squeeze in the cost of living.Water bills will rise sharply in some areas, council tax will go up, and various other household costs will increase. Some larger families will receive more in universal credit when the two child benefit cap is scrapped.Households struggling to make ends meet have fallen behind on energy payments, leading to a collective debt to suppliers of well over £4bn.Dhara Vyas, chief executive of Energy UK, which represents suppliers, said companies can help.\"They are giving them different tariffs, extra help and support, offer white goods such as efficient fridges, but they can only do this if they know who is in your household and what your circumstances are,\" she said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Energy bills to fall in April after charges shake-up",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e3f9/live/a9b88a60-1177-11f1-ba61-2b399c307393.jpg"
      ],
      "datePublished": "2026-02-25T00:04:55.000Z",
      "dateModified": "2026-02-25T00:04:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man admits stealing Fabergé egg and watch worth £2m in London",
    "url": "https://www.bbc.com/news/articles/cp32e6y043lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ff9d/live/33b38320-11a3-11f1-8efc-bb8df6087c73.jpg",
    "tag": "Trending",
    "date": "2026-02-24T17:48:26.000Z",
    "description": "8 hours agoGetty ImagesA Fabergé egg - not the one pictured - was among items in the victim's stolen handbagA man has admitted stealing a handbag cont",
    "body": "8 hours agoGetty ImagesA Fabergé egg - not the one pictured - was among items in the victim's stolen handbagA man has admitted stealing a handbag containing a Fabergé egg and watch thought to be worth more than £2m.Enzo Conticello, 29, of no fixed address, stole from the victim in Soho, central London, on 7 November 2024, Southwark Crown Court heard.The handbag also contained a laptop and credit cards, which Conticello subsequently used to purchase cigarettes and other goods at supermarkets in the Soho area. The court heard the Fabergé egg had not been located.Conticello admitted theft and three charges of fraud by misrepresentation. He was remanded into custody to next appear at the same court on 6 March.Fabergé is a world-renowned jeweller founded in Russia more than two centuries ago, famous for its eggs made of gems and precious metals.Addressing Conticello, also known as Hakin Boudjenoune, after he pleaded guilty, Judge Martin Griffiths said: \"I expect it was probably quite a surprise to you when you discovered that egg.\"What you did with it, I don't quite know, but I expect we're going to find out.\"Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man admits stealing Fabergé egg and watch worth £2m in London",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ff9d/live/33b38320-11a3-11f1-8efc-bb8df6087c73.jpg"
      ],
      "datePublished": "2026-02-24T17:48:26.000Z",
      "dateModified": "2026-02-24T17:48:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Food waste collection deadline missed by one in four councils",
    "url": "https://www.bbc.com/news/articles/cpv8ye887e4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1b0a/live/53f4f790-11b2-11f1-9c3e-09b6f259d76e.jpg",
    "tag": "Trending",
    "date": "2026-02-25T00:01:58.000Z",
    "description": "1 hour agoEma Sabljak,England Data UnitandJonah Fisher,Climate correspondentPlanet One Images via GettySimpler Recycling legislation will make weekly ",
    "body": "1 hour agoEma Sabljak,England Data UnitandJonah Fisher,Climate correspondentPlanet One Images via GettySimpler Recycling legislation will make weekly food waste collections mandatory across EnglandAlmost a quarter of English councils will miss an official deadline to introduce weekly food waste collections to all homes, a BBC investigation has found.The Department for Environment, Food & Rural Affairs (Defra) said \"every household in England\" would get weekly food waste collections from next month under new legislation, but at least 71 councils told the BBC they would not meet that deadline. Councils blamed the delay on demand for new specialist vehicles, as well as issues with funding despite more than £340m in grants from Defra.Environment minister Mary Creagh said councils had also had a \"significant uplift in this year's budget\" to help \"make this policy a success\".\"Do it slowly, do it right but let's get on with it,\" she said. \"We have been stagnating at these very low recycling rates for far too long.\"Roughly half of councils were not collecting food waste weekly before the creation of the Simpler Recycling legislation, while some have had the collections in place for more than a decade.It meant not all councils needed to make changes to meet the new rules, but the BBC approached each local authority responsible for waste collection to find out what was happening in their area.At least 56 of those that will miss the deadline are aiming to launch their service for all households by the end of 2026. Nine could not give an approximate start date.A further 31 councils have secured agreements allowing for a later start date for their weekly food collections, so will not be viewed as missing the deadline.When those councils are factored in, more than a third of councils will still not be collecting food waste from all homes by March.Shropshire Council said an April launch would place it under \"significant financial risk\". Cabinet member David Vasmer said funds were provided for the purchase of vehicles, bins and the initial delivery, but the recent government financial settlement had \"failed to provide any revenue funding for a weekly food waste service\". South Derbyshire District Council spokesperson said the supplier of food waste collection vehicles was experiencing \"exceptionally high demand\", making it difficult to get hold of them.And East Hampshire District Council also confirmed availability of bin lorries was behind its delay, saying it did not yet have a date for when food waste collections would start.Greg Ford, who lives in Buriton, East Hampshire, already separates his food waste for composting. He said: \"It makes you think about food waste, planning what to do with leftovers, so I think ironically collecting people's food waste is going to cut down on food waste.He added the council should take as long as it needed \"to get it right\".Greg Ford is the chair of trustees of the Petersfield Climate Action Network, which is run by local residentsPatricia Jepheson lives in Worcester where the council said the rollout of food waste collection would be delayed until spring 2027.\"It's just a lot of extra waste that could be disposed of in a greener way,\" she said.\"When areas with fewer resources managed to do it years ago, it's hard to understand why we're waiting until 2027.\"Several councils are taking a phased approach that will delay the date when the service will be in place for all homes.The Local Government Association has called for clarity about funding for day-to-day costs.\"It is important that all councils have local flexibility on how this service is delivered, alongside adequate funding and support,\" a spokesperson said.\"We are also asking government to commit to reviewing service costs after a year, to help plug any costs gaps.\"'Postcode lottery' of rubbishThe Simpler Recycling policy aims to \"remove the confusion\" created by councils having different waste collection policies, which vary from just two bins to seven.Adam Herriott, a senior sector specialist for sustainability charity Wrap, said the idea was to enable everyone to recycle the same material, \"no matter where in England you are\".The default recycling collections across England will be paper and card, food waste and dry recycling including plastic, metal and glass. A Defra spokesperson said it will \"end the postcode lottery of bin collection\".  Wrap's senior specialist for food waste, Rosemary Brotchie, said the change would help \"maximise the value that food can have\".\"You're keeping it out of your general waste bin, keeping it out of landfill, reducing those emissions that will come from that food rotting in landfill, but you're also keeping your waste clean to allow that to be recycled,\" she said.Brotchie hopes the separate collection will impact daily habits and result in less waste being created.She added: \"If you are collecting your food in a caddy, you really get to see firsthand what you're throwing away. I think that can really prompt some rethinking.\"How is food waste recycled?The latest available data shows some local authorities recycle just a fifth of household waste.Herriott said: \"Food waste is generally pretty heavy because it's got quite a high water content.\"Diverting those tonnages from landfill or incineration can \"improve our recycling rate as a nation quite significantly\", he explained.Food waste is instead taken through a process called anaerobic digestion to create biomethane. The food is pulverised and mixed with liquids, then left to digest in a tank for months.Mark Barnfield, commercial director at Severn Trent Green Power, said the resulting gas was cleaned and either \"injected into the gas grid\" or converted to electricity.The rest of the material produces digestate which can be used as fertiliser by nearby farms.Barnfield believes it will benefit processing plants to not have every council start collection on the same date.\"If it was a light switch like that the system would be flooded and it would be difficult to cope, but the reality is that it will be more natural,\" he said.In addition to being cleaner for the environment, he said it could be \"cheaper to get rid of that waste through an anaerobic digestion plant\" than other methods.Additional reporting by Jonathan Fagg, Patrick Hughes and James Pearson",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Food waste collection deadline missed by one in four councils",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1b0a/live/53f4f790-11b2-11f1-9c3e-09b6f259d76e.jpg"
      ],
      "datePublished": "2026-02-25T00:01:58.000Z",
      "dateModified": "2026-02-25T00:01:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Driver admits causing death of Willingham mother pushing pram",
    "url": "https://www.bbc.com/news/articles/c4gql405dydo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a486/live/6f9bbdf0-11b0-11f1-9c3e-09b6f259d76e.jpg",
    "tag": "Trending",
    "date": "2026-02-24T18:35:40.000Z",
    "description": "7 hours agoBrian FarmerFamily handoutMr Tuczemskyi said his partner Rebecca Ableman \"helped so many people\" both in her work and personal lifeA lorry ",
    "body": "7 hours agoBrian FarmerFamily handoutMr Tuczemskyi said his partner Rebecca Ableman \"helped so many people\" both in her work and personal lifeA lorry driver has admitted causing the death of a woman who was struck on the head by crane equipment while pushing a pram.Rebecca Ableman, 30, was with her two-year-old daughter Autumn on the pavement by the B1050 in Willingham, Cambridgeshire, when she was hit in September 2022.Kevin Miller, 71, of Gayton Road, King's Lynn, Norfolk, admitted causing death by careless or inconsiderate driving at a hearing in Peterborough Crown Court, officials said.Court staff said he was due to be sentenced on 14 April.Family handoutRebecca Ableman was pushing her two-year-old daughter Autumn in her pram through the village where she livedMiller had gone on trial last year after denying causing death by dangerous driving - when detail of the incident emerged.The trial was halted in April and a new trial was due to start this week.Ms Ableman, who lived in Willingham, had left a farm shop in Station Road with her daughter when she was struck by the equipment at about 11:15 BST.She died from head and brain injuries three weeks later.Family handoutRebecca Ableman with daughter Autumn and partner Chris TuczemskyiProsecutors said Miller was transporting scrap metal from King's Lynn docks to two Network Rail depots in Essex and Cambridgeshire on 22 September.As he passed through Willingham, loose unsecured crane equipment moved from its position and was hanging over the edge of a trailer, the court heard.Miller said he did not know there had been an incident until he was arrested.Kevin Miller has admitted causing death by careless or inconsiderate drivingMore on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Driver admits causing death of Willingham mother pushing pram",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a486/live/6f9bbdf0-11b0-11f1-9c3e-09b6f259d76e.jpg"
      ],
      "datePublished": "2026-02-24T18:35:40.000Z",
      "dateModified": "2026-02-24T18:35:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]