[
  {
    "title": "Pirates of the Caribbean: Salazar's Revenge",
    "url": "https://www.bbc.co.uk/iplayer/episode/m000ryd0/pirates-of-the-caribbean-salazars-revenge?at_mid=Ucl6fIUx1a&at_campaign=Pirates_of_the_Caribbean_Salazars_Revenge&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m000ryd0&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Pirates_of_the_Caribbean_Salazars_Revenge&at_bbc_team=BBC&at_creation=Film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p095js24.jpg",
    "tag": "Trending",
    "date": "2025-12-03T01:40:25.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomePirates of the Caribbean: Salazar's RevengePirates of the Caribbean: Salazar's RevengeContains moderate violence.Young Henry Turner promises his father that he will break the curse that binds him to his ship. Henry then seeks out Jack Sparrow to help him locate Poseidon's trident. Duration1h 58mFirst shown2017Available for 27 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesLara Croft: Tomb RaiderShe's all action. The daredevil heroine races against time to recover an ancient relic1h 34mThe ImpossibleA true story of survival in the Boxing Day tsunami, with Ewan McGregor and Tom Holland1h 41mTell Me LiesThe one you'll never forget. Toxic love, desire and betrayal. Love is a dangerous gameCyranoHave you ever loved someone? A lavish adaptation of a timeless tale, stars Peter Dinklage1h 53mGringoIt’s the business trip from hell for Harold - from law-abiding citizen to wanted criminal1h 41mAbsolutely Fabulous: The MovieThis season's most wanted. Eddy and Patsy flee to France after a run-in with Kate Moss1h 24mThe Idea of YouFeel everything. The last thing a single mum expected becomes the only thing she wants1h 48mEverestThe real-life story of an awe-inspiring expedition that became an epic fight for survival1h 51mP.S. I Love YouTrue love never dies. Holly can't imagine life without her husband - until she has to1h 58mThe MercyThe true story of Donald Crowhurst's bid to sail around the world. Stars Colin Firth1h 35mThe MaskStanley Ipkiss is not the man he used to be. The action-packed comedy starring Jim Carrey1h 33mGladiatorA hero will rise. Russell Crowe and Joaquin Phoenix in Ridley Scott's Oscar-winning epic2h 24m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pirates of the Caribbean: Salazar's Revenge",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p095js24.jpg"
      ],
      "datePublished": "2025-12-03T01:40:25.000Z",
      "dateModified": "2025-12-03T01:40:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "World Cup 2026 draw: England open against Croatia, Scotland drawn with Brazil",
    "url": "https://www.bbc.com/sport/football/articles/c7vmr1mmve3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/19f2/live/58bc11d0-d212-11f0-bd15-e5c6de83b2f6.jpg",
    "tag": "Trending",
    "date": "2025-12-05T19:16:19.000Z",
    "description": "Image source, Getty ImagesImage caption, The World Cup has been increased from 32 to 48 teams for 2026ByHarry PooleBBC Sport journalistEngland will be",
    "body": "Image source, Getty ImagesImage caption, The World Cup has been increased from 32 to 48 teams for 2026ByHarry PooleBBC Sport journalistEngland will begin their World Cup 2026 campaign against Croatia, while Scotland have been drawn alongside Brazil at next summer's tournament.Thomas Tuchel's England will open their tournament in Dallas or Toronto on Wednesday, 17 June, before also facing Ghana and Panama in Group L.Scotland's first match at the men's World Cup for 28 years will be against Haiti on Saturday, 13 June, in Boston or New York, followed by matches against Morocco and Brazil in Group C.Wales or Northern Ireland would join Canada, Qatar and Switzerland in Group B, should either come through two rounds of Uefa play-off matches in March.The Republic of Ireland could meet Mexico, South Africa and South Korea if they qualify.The first-ever 48-team World Cup will be held in Canada, Mexico and the United States between 11 June and 19 July 2026.World Cup 2026 draw in full*Uefa play-off A: Italy, Wales, Bosnia-Herzegovina or Northern Ireland*Uefa play-off B: Ukraine, Poland, Albania or Sweden*Uefa play-off C: Turkey, Slovakia, Kosovo or Romania*Uefa play-off D: Denmark, Czech Republic, Republic of Ireland or North Macedonia*Fifa play-off 1: DR Congo, Jamaica or New Caledonia*Fifa play-off 2: Iraq, Bolivia or SurinameWhere and when each nation will play their matches will be confirmed in a separate draw on Saturday at 17:00 GMT, but there is some certainty at this stage.After their opener against Croatia - which comes six days after the tournament gets under way - England will play Ghana on Tuesday, 23 June in Toronto or Boston, before their final group game against Panama on Saturday, 27 June in Philadelphia or New York.Following their first men's World Cup match since 1998 against Haiti, Scotland face Morocco on Friday, 19 June in Boston or Philadelphia, while their meeting with Brazil takes place on Wednesday, 24 June in Atlanta or Miami.Mexico will take on South Africa at Estadio Azteca in the opening match of the expanded tournament, which will involve 104 matches taking place across 16 cities.Media caption, What happened when Scotland last played at a major men's finalsIn a major change to the draw, the top four nations in the Fifa world rankings - Spain, Argentina, France and England – have been awarded special seedings which ensure they cannot meet until the semi-finals, assuming each wins their group.England, the Euro 2024 runners-up, could meet the winner of Brazil's group in the quarter-finals.If they win their group, the Three Lions will face one of the eight best-performing third-placed sides in the first round of knockout matches.Drawn from pot three, Scotland must play Fifa's fifth and 11th best-ranked nations in Brazil - who they will face for a fifth time at a World Cup - and Morocco as they bid to reach the knockout stage.There will be 12 groups of four teams at next summer's tournament. The groups were drawn from four pots, into which teams had been placed based on their position in Fifa's rankings.The top two teams in each group will qualify for the knockout stages, along with the eight best third-placed teams.England verdict: 'Difficult group, difficult opener'Media caption, Tuchel reacts to England's 'difficult' World Cup groupEngland head coach Tuchel oversaw a flawless World Cup qualifying campaign, his team winning all their eight matches without conceding a goal.Speaking to BBC Sport following the draw, the German said: \"Difficult group, difficult opener. Croatia and Ghana [are] two regulars in World Cups and two proud and strong nations. Panama I don't know much about at the moment, but we will before the tournament starts.\"For me, I've only experienced group football in Champions League formats and the way to approach it was to always give it the biggest respect and to put all the focus into winning the group. It always seems difficult, like our group now, but we are confident and we will be well prepared when we arrive.\"Croatia were the highest-ranked nation England could have drawn from pot two, and they are the side England lost out to in the semi-finals of the 2018 World Cup.In the group stage at that same tournament, England defeated Panama 6-1.\"Nobody should be underestimated. Of course Croatia is the standout nation but Ghana is always full of talent, can always surprise and has a big history in World Cup football,\" Tuchel said. \"Panama will try to make the most of their underdog role. No-one can be underestimated, everyone deserves the fullest respect.\"Media caption, How Croatia beat England in the 2018 World Cup semi-finalsScotland verdict: 'We'll bring a little bit of magic'Scotland stunned Denmark with two stoppage-time goals as they secured World Cup qualification in a dramatic winner-takes-all final group game last month.Nearly three decades after their previous World Cup appearance, they will meet two of the nations they faced in 1998 in Brazil and Morocco, plus the lesser-known quantity of Haiti.Scotland boss Steve Clarke told BBC Sport: \"The draw is fantastic. One of the big things in my head was no European teams, so we're playing three top sides from three different continents of the world and that's what the World Cup is about.\"Looking ahead to facing record five-time champions Brazil, Clarke said: \"We are going to bring a little bit of magic as well, hopefully.\"It's great to play them. To go back to 1998, when Brazil and Morocco were in the group, that's a little bit of fate.\"Media caption, 'Bring it on' - Clarke releshing chance at World Cup after drawA World Cup of '104 Super Bowls'US President Donald Trump was awarded the new Fifa Peace Prize during a star-studded draw ceremony which lasted for more than two hours in Washington DC.Trump was presented with a trophy, medal and certificate by Fifa president Gianni Infantino and said the award, introduced to recognise an individual's actions for peace and unity, was \"one of the great honours of my life\".Fifa president Infantino described the 2026 World Cup for American viewers as equivalent to watching \"104 Super Bowls in one month\".The event was presented by comedian Kevin Hart, model Heidi Klum and actor Danny Ramirez, and featured live music performances by Andrea Bocelli, Robbie Williams, Nicole Scherzinger and Lauryn Hill.Former England and Manchester United player Rio Ferdinand conducted the draw, accompanied by American sporting greats Tom Brady, Aaron Judge and Shaquille O'Neal, and Canadian ice hockey legend Wayne Gretzky.Co-hosts Mexico, Canada and the United States had pre-determined group positions to ensure they will contest all group matches in their own countries.But Trump, Canadian Prime Minister Mark Carney and Mexican President Claudia Sheinbaum each drew their own nation's ball to begin proceedings.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "World Cup 2026 draw: England open against Croatia, Scotland drawn with Brazil",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/19f2/live/58bc11d0-d212-11f0-bd15-e5c6de83b2f6.jpg"
      ],
      "datePublished": "2025-12-05T19:16:19.000Z",
      "dateModified": "2025-12-05T19:16:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "World Cup 2026 draw: Haaland v Mbappe, Trump & YMCA - best of draw",
    "url": "https://www.bbc.com/sport/football/articles/c3e0n00p205o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f394/live/72125de0-d223-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-12-05T22:20:57.000Z",
    "description": "Haaland v Mbappe, dream ties and YMCA - the best of the World Cup drawImage source, Getty ImagesImage caption, US President Donald Trump was on his fe",
    "body": "Haaland v Mbappe, dream ties and YMCA - the best of the World Cup drawImage source, Getty ImagesImage caption, US President Donald Trump was on his feet dancing along to the Village People's rendition of YMCA at the end of the World Cup drawByBrendon MitchellBBC Sport journalistNext summer's World Cup, at long last, is starting to feel very real.But, while fans of the home nations can finally start marking their calendars and plotting routes through the tournament, Friday's draw in Washington DC was not short of other major talking points.Long before the Village People took to the stage to sing us out with a rendition of YMCA, we were left picking the bones out of a group stage which will see two of the world's best strikers go head-to-head and a knockout stage which could produce a truly mouthwatering meeting between two greats of the game.Are you excited yet?BBC Sport talks you through the best - and worst - of a World Cup draw which went on, and on, and on...The draw that seemed like it may never endMany people tuned into the BBC's coverage bang on 17:00 GMT, eager to find out who their teams would be playing in the group stage of next year's tournament.But, even though supporters should, by now, be well accustomed to these draws taking some time to get going... this was extraordinary.After performances by Robbie Williams and former Pussycat Dolls singer Nicole Scherzinger, speeches from US President Donald Trump and Fifa counterpart Gianni Infantino, plus numerous montages, cutaways and interviews, it finally seemed to get going at 17:55 GMT. Or so we thought.Mexico President Claudia Sheinbaum and Canada Prime Minister Mark Carney joined Trump on stage to pick their respective countries, as co-hosts, out of the hat. But this was not new news.Cue more interviews and performances, before the actual draw eventually began at 18:27 GMT - nearly an hour and a half after the star-studded show first kicked off.The draw itself then took 59 minutes to complete, with BBC commentator Jonathan Pearce even quipping at one point that everything was taking so long to get through, the tournament would be upon us by the time the ceremony had been wrapped up.Media caption, Donald Trump receives inaugural Fifa Peace PrizeOn to the actual football...Next summer's World Cup will the biggest in the competition's history, with a record 48 teams taking part and a round of 32 being introduced for the first time.But this has perhaps led to the group stage - with 12 groups each containing four teams - being slightly diluted in quality.There are very few matches between the major nations. England's game against Croatia - a repeat of the 2018 semi-final - is the most significant on paper.That is the only group fixture which will see two teams ranked in the top 10 in the world come up against one another.Brazil (fifth) v Morocco (11th) in Group C is the next best. Netherlands have the toughest group in terms of Fifa world rankings, drawn against Japan, Tunisia and one of the play-off winners, while Germany - grouped with Ecuador, Ivory Coast and Curacao - have the weakest.But that doesn't mean there aren't still some interesting matches to look forward.Media caption, Tuchel reacts to England's 'difficult' World Cup groupTwo goal machines go head-to-headGenerational goalgetter Erling Haaland will get a crack at his first major tournament next summer.The Manchester City and Norway striker scored 16 times in eight World Cup qualifiers to drag his country to their first appearance in the competition since 1998.And 'drag' is no exaggeration - no player, across any continent, scored more in qualifying than Haaland. No wonder one Norwegian journalist went as far as suggesting \"there's already a case to be made that he's our greatest ever player\".Few have managed to even come close to the 25-year-old's ridiculous goalscoring feats in recent seasons - but someone who has is set to come up against him in the final round of group games.Along with Senegal and one of the play-off winners, Norway have been drawn against Kylian Mbappe's France in Group I.It means the top marksmen in the Premier League and La Liga will go head-to-head for the first time in international football.Mbappe, just two goals away from becoming France's record scorer at the age of 26, has scored 16 times in 15 league games this season for Real Madrid. Haaland, already Norway's record scorer and a whopping 22 goals clear of the next best, has scored 15 in 14 for City.\"It will be a great duel,\" France coach Didier Deschamps said.\"Kylian and Haaland are two players recognised around the world and they will be two of the contenders to be the top scorer.\"Expect goals. Lots of goals.We meet againMexico will take on South Africa at Estadio Azteca in the opening match of next summer's World Cup - and not for the first time.The two teams also opened the 2010 edition, which was hosted by South Africa - the first time the competition had been held in the continent.The game, which ended 1-1, is best remembered for Siphiwe Tshabalala's rasping second-half strike to put Bafana Bafana in front. It was an iconic World Cup goal.Another eye-catching group game will see France again come up against Senegal, who stunned the then-world champions in 2002 in one of the tournament's most famous shocks.On the opening night in Seoul, South Korea, future Fulham midfielder Papa Bouba Diop upstaged France's cast of star names to score the decisive first goal of the tournament after 30 minutes.France never recovered, failing to win any of their games and finishing bottom of the group.Dream ties for the debutantsUzbekistan, Cape Verde, Jordan and Curacao have all taken advantage of the expanded World Cup by qualifying for the finals for the first time.But standing in their way are former world champions, European champions and champions of South America.In Group E Curacao, the tiny Caribbean island who will become the smallest nation to play at a World Cup, will take on four-time World Cup winners Germany in their first-ever finals match.With a population of around 600,000, Cape Verde may well have been pinching themselves when they were drawn alongside European champions and World Cup winners Spain in Group H. They will take on the 2010 winners in their opening game.Jordan took part in qualifying for the first time 40 years ago and their reward for reaching their first World Cup is a tie with defending champions Argentina and Lionel Messi in Group J.And, in Group K, Italy's 2006 World Cup winner Fabio Cannavaro will guide Uzbekistan into their first finals, where they will face Cristiano Ronaldo's Portugal.What about the knockout stage?Image source, Getty ImagesImage caption, Could Cristiano Ronaldo and Lionel Messi - pictured here before a friendly between Portugal and Argentina in 2014 - meet on the international stage again?Assuming all the top teams make it safely through their groups - a dangerous assumption, admittedly - we shouldn't have to wait too long for some of the big hitters to collide.It is in the last 16 where things could get really tasty, most notably with a potential tie between former champions Germany and France.The pair last met in a World Cup at the quarter-final stage in 2014, with Mats Hummels' early header enough to send the Germans through.If Germany come out on top again they would have to contend with the Netherlands and Spain if they are to reach the final - a very tough run having ended up in the most straightforward group.On the other side of the draw, eyes will instantly be drawn to the quarter-final stage, with old rivals Messi and Ronaldo set for a possible showdown.It would depend on both Argentina and Portugal finishing top of their respective groups and then squeezing through the last 32 and 16 but, if they are able to do that, it would be a remarkable way to mark the pair's final World Cups.If England get off to a great start against Croatia and go on to win their group, they would play a third-placed team in the last 32, although working out their exact opponents is somewhat complicated.If Scotland top their group Japan or Tunisia could be waiting for them in what would be their first-ever World Cup knockout game. Media caption, 'Bring it on' - Clarke releshing chance at World Cup after draw",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "World Cup 2026 draw: Haaland v Mbappe, Trump & YMCA - best of draw",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f394/live/72125de0-d223-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-05T22:20:57.000Z",
      "dateModified": "2025-12-05T22:20:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Is Russia Really Ready For War With Europe? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mldzp8?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-03T19:13:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·03 Dec 2025,·44 minsIs Russia Really Ready For War With Europe?NewscastAvailable for over a yearToday, NATO ministers have been meeting to discuss the US’s 28-point plan for peace between Russia and Ukraine after Russia rejected the plan and said it was “ready” for war with Europe.\nAdam is joined by Europe editor, Katya Adler and the Economist’s defence editor, Shashank Joshi to discuss what President Putin’s statement means for a divided NATO.\nPlus Faisal Islam, BBC Economics Editor, joins the conversation to discuss the UK’s possible involvement in a new European defence fund and the government’s latest suggestions it could be looking to get closer to the EU again. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Kris Jalowiecki. The social producer was Joe Wilkinson. The technical producer was Dafydd Evans. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Is Russia Really Ready For War With Europe? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-03T19:13:00.000Z",
      "dateModified": "2025-12-03T19:13:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Radical with Amol Rajan - Porn and Masculinity: How to Teach Kids about Sex and Relationships (Jordan Stephens) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/m002mz6w?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg",
    "tag": "Trending",
    "date": "2025-12-04T06:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·04 Dec 2025,·61 mins,·Available for over a yearHow is online porn affecting sex and relationships? In this episode, musician and campaigner Jordan Stephens calls for a new approach to sex education and a modern redefinition of masculinity. \nFrom Paris Hilton to Bonnie Blue and AI generated porn he discusses how sexual content is evolving and the impact it is having on young people’s lives. \nJordan also explains how his childhood and the whirlwind fame he found with Rizzle Kicks led to heartbreak and addiction. \nAnd how that led him to become an advocate for boys and men. \n(00:02:30) Why Jordan became an advocate for boys and men? \n(00:08:30) Jordan’s childhood \n(00:12:17) Reflections on fame \n(00:13:36) How he learned about healthy relationships \n(00:15:30) Is there a crisis of masculinity? \n(00:20:25) The reality of pornography \n(00:28:50) How he would design the sex education curriculum? \n(00:31:26) AI and pornography \n(00:38:25) Thoughts on Bonnie Blue \n(00:42:30) Legalisation of sex work and drugs \n(00:45:25) What his partner, the popstar Jade Thirwall, has taught him about relationships \n(00:47:30) Politics and young people \n(00:54:50) Amol’s reflections \nGET IN TOUCH \n* WhatsApp: 0330 123 9480 \n* Email: radical@bbc.co.uk \nEpisodes of Radical with Amol Rajan are released every Thursday and you can also watch them on BBC iPlayer: https://www.bbc.co.uk/iplayer/episodes/m002f1d0/radical-with-amol-rajan \nAmol Rajan is a presenter of the Today programme on BBC Radio 4. He is also the host of University Challenge on BBC One. Before that, Amol was media editor at the BBC and editor at The Independent. \nRadical with Amol Rajan is a Today Podcast. It was made by Lewis Vickers with Anna Budd. Digital production was by Gabriel Purcell-Davis. Technical production was by Ricardo McCarthy. The editor is Sam Bonham. The executive producer is Owenna Griffiths.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radical with Amol Rajan - Porn and Masculinity: How to Teach Kids about Sex and Relationships (Jordan Stephens) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg"
      ],
      "datePublished": "2025-12-04T06:00:00.000Z",
      "dateModified": "2025-12-04T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Frank Gehry: Legendary US architect dies aged 96",
    "url": "https://www.bbc.com/news/articles/c5y2p22z9gno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1b2b/live/ca170da0-d215-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-05T22:14:08.000Z",
    "description": "3 hours agoSakshi VenkatramanUS reporterREUTERS/Mike Blake/File PhotoFrank Gehry, one of the most influential architects of the last century, has died",
    "body": "3 hours agoSakshi VenkatramanUS reporterREUTERS/Mike Blake/File PhotoFrank Gehry, one of the most influential architects of the last century, has died aged 96.Gehry was acclaimed for his avant garde, experimental style of architecture. His titanium-covered design of the Guggenheim Museum in Bilbao, Spain, catapulted him to fame in 1997. He built his daring reputation years before that when he redesigned his own home in Santa Monica, California, using materials like chain-link fencing, plywood and corrugated steel.HIs death was confirmed by his chief of staff Meaghan Lloyd. He is survived by two daughters from his first marriage, Leslie and Brina; his wife, Berta Isabel Aguilera, and their two sons, Alejandro and Samuel, Getty ImagesThe Guggenheim Museum Bilbao, one of Gehry's most famous worksBorn in Toronto in 1929, Gehry moved to Los Angeles as a teenager to study architecture at the University of Southern California before completing further study at  the Harvard Graduate School of Design in 1956 and 1957.After starting his own firm, he broke from the traditional architectural principles of symmetry, using unconventional geometric shapes and unfinished materials in a style now known as deconstructivism. \"I was rebelling against everything,\" Gehry said in an interview with The New York Times in 2012.His work in Bilbao put him in high demand, and he went on to design iconic structures in cities all over the world: the Jay Pritzker Pavilion in Chicago's Millennium Park, the Gehry Tower in Germany, and the Louis Vuitton Foundation in Paris. \"He bestowed upon Paris and upon France his greatest masterpiece,\" said Bernard Arnault, the CEO of LVMH, the worlds largest luxury goods company which owns Louis Vuitton.With a largely unpredictable style, no two of his works look the same. Prague's Dancing House, finished in 1996, looks like a glass building folding in on itself; his Hotel Marques in Spain, built in 2006, features thin sheets of wavy, multicoloured metal; his design for a business school in Sydney looks like a brown paper bag.Gehry won the coveted Pritzker Architecture Prize for lifetime achievement in 1989, when he was 60, with his work described as having a \"highly refined, sophisticated and adventurous aesthetic\".\"His designs, if compared to American music, could best be likened to Jazz, replete with improvisation and a lively unpredictable spirit,\" ther Pritzker jury said at the time.Gehry was awarded the Order of Canada in 2002 and the Presidential Medal of Freedom, the highest civilian honour in the US, in 2016. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Frank Gehry: Legendary US architect dies aged 96",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1b2b/live/ca170da0-d215-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-05T22:14:08.000Z",
      "dateModified": "2025-12-05T22:14:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Failed Sarah Ferguson-backed app took £1m taxpayers' money",
    "url": "https://www.bbc.com/news/articles/cgl6zejp75wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/66ba/live/3e7ecdb0-d1ec-11f0-9fc3-51ad94ee6fea.jpg",
    "tag": "Trending",
    "date": "2025-12-06T00:01:16.000Z",
    "description": "1 hour agoBen KingBusiness reporterA lifestyle app backed by Sarah Ferguson received more than £1m of taxpayers' money but collapsed without ever laun",
    "body": "1 hour agoBen KingBusiness reporterA lifestyle app backed by Sarah Ferguson received more than £1m of taxpayers' money but collapsed without ever launching a product, according to documents filed this week.vVoosh was founded by Manuel Fernandez, a close friend of Ms Ferguson, who once described herself as an \"ambassador\" for the company and was an investor.It promised to give users \"the power to Find, Plan, Share, Live, and Remember all the things you love to do - and those you're yet to try.\"Ms Ferguson and Mr Fernandez did not respond to requests for comment.vVoosh was put into administration last month - and its failure will raise further questions about the judgement of the former duchess and the business relationships she pursued.Last month it emerged that a crypto-currency mining firm had agreed to pay her up to £1.4m for acting as a \"brand ambassador\" - that firm also failed, allegedly costing investors millions. Its co-founder denied misconduct and said he's working to repay backers. In September, a number of charities dropped her as a patron or ambassador after an email from 2011 revealed that she called sex offender Jeffrey Epstein her \"supreme friend\" and seemed to apologise for her public criticism of him. Manuel Fernandez, 57, went to school at Billericay in Essex, and was a soldier in the Royal Anglian Regiment, according to his LinkedIn profile. He then held senior sales roles at a number of tech companies before founding vVoosh in 2010.He was regularly photographed with the then duchess in 2015 and 2016, and they attended Sir Bob Geldof's wedding together, but she denied rumours they were a couple, saying they were just \"good friends\".Over the years vVoosh raised approximately £9m, including more than £1m from the UK government through research and development tax credits, according to documents filed by the administrator.It paid teams in the UK and then India to work on the app, but never launched it, and so had no income to fund further development.Progress on the app stopped when the Indian contractor threatened legal action.The administrator's report describes a \"breakdown in communication between the current directors/major creditors and the founder [Mr Fernandez], who ceased communication following [his] resignation as a director earlier in the year\".The report says that the company is owed £324,609 by a former director. This is believed to be Mr Fernandez, who is the only director to leave the company since 2019.Last summer he sold his house in North London for £1.3m, according to Land Registry documents, and is believed to have left the UK.Meanwhile, vVoosh owes £50,000 to one of Ms Ferguson's companies, La Luna Investments, which also held just under 1% of the company's shares.Ms Ferguson, 66, lost her duchess title when her former husband, Andrew Mountbatten-Windsor, relinquished use of his Duke of York title over his links with Epstein. He has since been stripped of the title of prince as well. Documents show the firm had more than 60 other small shareholders - many with addresses in Essex and London, though a few American addresses also appear.The administrators said that there was \"significant uncertainty\" over how much money the company's creditors would get back once the company was wound up.One of the firm's American backers, Mark Guzy, has put more than £400,000 into the company to preserve \"certain essential services\" and protect the value of its software platform, which is the company's main remaining asset.vVoosh originally intended to share 10% of its profits with a charitable foundation.The BBC understands that the Charity Commission has now begun the process of removing vVoosh Charitable Foundation from the register of charities, on the basis that it does not operate.It is more than four-and-a-half years overdue with its reporting. Its last accounts, from 2019, show that it had £1.28m gross income, but spent only £18,240 on charitable activities.HMRC declined to respond to questions about the tax credits. Mr Guzy and the other directors of vVoosh declined to comment.Earlier this month Mr Fernandez denied taking money out of the firm, according to the Times.He told the newspaper that allegation would be \"disproven in the course of legal proceedings\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Failed Sarah Ferguson-backed app took £1m taxpayers' money",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/66ba/live/3e7ecdb0-d1ec-11f0-9fc3-51ad94ee6fea.jpg"
      ],
      "datePublished": "2025-12-06T00:01:16.000Z",
      "dateModified": "2025-12-06T00:01:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meghan reaches out to estranged father Thomas after amputation reports, spokesman says",
    "url": "https://www.bbc.com/news/articles/c0je4v8j0vzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4f01/live/36e37940-d21c-11f0-be90-7bfb24e8b1c8.jpg",
    "tag": "Trending",
    "date": "2025-12-05T21:29:42.000Z",
    "description": "4 hours agoDaniela Relph,Royal correspondentandAmy WalkerThe Duchess of Sussex has attempted to contact her estranged father, Thomas Markle, who is re",
    "body": "4 hours agoDaniela Relph,Royal correspondentandAmy WalkerThe Duchess of Sussex has attempted to contact her estranged father, Thomas Markle, who is reported to be seriously ill in hospital in the Philippines.A spokesman for Meghan said: \"I can confirm she has reached out to her father.\"Mr Markle is reported to have had his leg amputated during surgery. The BBC understands that Meghan tried to contact him earlier today, but it is not clear whether the attempt was successful. The relationship between Meghan and her father broke down in the run-up to her wedding to Prince Harry in 2018.During the couple's engagement, the media interest in Thomas Markle and his family was intense. Mr Markle was found to have colluded with photographers who paid him for photos appearing to show the father of the bride preparing for the wedding.The fallout saw him pull out of his daughter's wedding just days before the ceremony in Windsor, citing health problems.King Charles III - who was then the Prince of Wales - walked Meghan down the aisle instead.It is not clear if Meghan ever resumed any proper relationship with her father following her marriage. Thomas Markle is not believed to have met Harry and Meghan's children, Prince Archie and Princess Lilibet.He was critical of his daughter and son-in-law's decision to step back from public duty in the UK and criticise the royal family. In one media interview he said: \"I think they're both turning into lost souls at this point.\"\"I don't know what they're looking for,\" he added. \"I don't think they know what they're looking for.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meghan reaches out to estranged father Thomas after amputation reports, spokesman says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4f01/live/36e37940-d21c-11f0-be90-7bfb24e8b1c8.jpg"
      ],
      "datePublished": "2025-12-05T21:29:42.000Z",
      "dateModified": "2025-12-05T21:29:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Keir Starmer rejects EU customs union after Lammy comments",
    "url": "https://www.bbc.com/news/articles/cj38ryp8k81o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/82c8/live/4ca69b00-d202-11f0-936b-f537e2f59ee5.jpg",
    "tag": "Trending",
    "date": "2025-12-05T18:05:29.000Z",
    "description": "7 hours agoPaul SeddonPolitical reporterEPA/ShutterstockSir Keir Starmer has repeated that he is not planning to rejoin the EU's customs union, after ",
    "body": "7 hours agoPaul SeddonPolitical reporterEPA/ShutterstockSir Keir Starmer has repeated that he is not planning to rejoin the EU's customs union, after the deputy prime minister said countries in such unions see a boost to their economies.Speaking on a podcast on Thursday, David Lammy said it was \"self-evident\" that Brexit had damaged the British economy.He added that rejoining the EU's customs union was \"not currently our policy\" - but highlighted that Turkey had seen growth as a result of its own union with the bloc.The prime minister - who has said economic growth is his government's top priority -  said he wanted to build closer trading ties with the EU but not break Labour's post-Brexit commitments.Labour's election manifesto ruled out taking the UK back into the EU's customs union, in which the remaining 27 member states charge the same taxes on goods imported from outside the bloc.The party also said it would not rejoin the EU's single market, where countries adopt common laws in some areas to make it easier to trade goods and services.Instead, the government is attempting to forge closer economic ties through a series of side-deals covering rules on food standards, visas for young people, carbon pricing and electricity trading.But the issue has reappeared on the political agenda in recent weeks, with the Liberal Democrats pushing the idea of a new customs union deal with the EU.Turkish modelSpeaking to The News Agents podcast, Lammy said: \"It's self-evident that leaving the European Union badly damaged our economy, took us out of an important marketplace and created serious friction.Asked whether he wanted to see the UK in a customs union with the EU, he replied: \"That's not currently our policy, that's not currently where we are.\"However, he highlighted that Turkey, which is in a customs union with the bloc, was \"seemingly benefiting and seeing growth in their economy\".Turkey's deal, which does not apply to agricultural goods, or services, reduces the the need to prove the origin of many goods it trades with the EU - a considerable source of trade friction for the UK since Brexit.The model has previously been suggested as a more realistic option for bolstering ties than rejoining the EU's customs union itself. However, the arrangement does significantly curtail Turkey's ability to pursue an independent trade policy - a key promise made by Brexiters.'Vote with us'Asked about Lammy's remarks on Friday, Sir Keir said: \"The position that we are taking has been clearly set out in the manifesto, and then we've been following it.\"He claimed that the UK's relationship with Europe had been \"totally reset\" since Labour entered office last year.Speaking earlier to reporters, a Downing Street spokesman appeared to play down Lammy's comments, reiterating that the government would seek to rebuild ties \"while sticking to our red lines\".He added that Labour wanted to bolster growth through \"open trading relationships\" - pointing to the government's trade and tariff reduction deals with India and the US, two agreements made possible by Brexit.The Liberal Democrats seized on Lammy's remarks, calling on him to \"vote with us\" next week, when the party is hoping to force a vote on the customs union issue.The party's Europe spokesperson Al Pinkerton added: \"The penny is dropping that a customs union is the best way to fix the economic problems plaguing Britain. It's time for Lammy to put his money where his mouth is\". ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Keir Starmer rejects EU customs union after Lammy comments",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/82c8/live/4ca69b00-d202-11f0-936b-f537e2f59ee5.jpg"
      ],
      "datePublished": "2025-12-05T18:05:29.000Z",
      "dateModified": "2025-12-05T18:05:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Volodymyr Zelensky: Irish police investigating drone activity during Ukrainian president's visit",
    "url": "https://www.bbc.com/news/articles/c0l94kz44ggo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5d58/live/27579070-d1f8-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-05T16:30:41.000Z",
    "description": "9 hours agoJessica LawrenceBBC News NIAn Garda Síochána (Irish police force) has launched an investigation after drones were detected in Irish skies o",
    "body": "9 hours agoJessica LawrenceBBC News NIAn Garda Síochána (Irish police force) has launched an investigation after drones were detected in Irish skies on the night the Ukrainian president arrived in Ireland.Volodymyr Zelensky flew into Dublin late on Monday night for a one-day official visit with his wife, First Lady Olena Zelenska.Senior Irish government figures, including Taoiseach (Irish Prime Minister) Micheál Martin, have been briefed on the issue. Martin confirmed it would be discussed at a National Security Council meeting later this month.In a statement, gardaí said its Special Detective Unit (SDU) is investigating the matter and will be liaising with the Defence Forces and international security partners.In a statement on Thursday, the Irish Defence Forces said it had no comment on \"the specifics of any alleged incidents\".On Monday, crew on board the Irish naval vessel LÉ William Butler Yeats spotted several unidentified drones flying near Howth, over the Irish Sea, around the same time Zelensky arrived in Dublin Airport, Irish broadcaster RTÉ has reported.Speaking during a meeting of the British-Irish Council (BIC) in Cardiff, the taoiseach said the Ukrainian president's visit went well, and the security dimension went \"particularly well\".While Martin said he did not want to comment on security matters, he said a review would now take place and it will include drones.\"It's been a feature now across Europe in more recent times the emergence of drones in the airspace of other colleagues in the European Union member states and we liaise and... we share experience,\" he added.\"Suffice to say that since the onset of the Ukrainian war there's been heightened activity on the cyber security front, in terms of maritime issues and in terms of drones.\"Asked if this suggested Russia's involvement in the drone activity, the taoiseach responded: \"I'm not going to make any comment until we have a full review.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Volodymyr Zelensky: Irish police investigating drone activity during Ukrainian president's visit",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5d58/live/27579070-d1f8-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-05T16:30:41.000Z",
      "dateModified": "2025-12-05T16:30:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Doctor charged with sexually assaulting West Midlands hospital patients",
    "url": "https://www.bbc.com/news/articles/cdd5z3qdjv4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4b2e/live/36049cb0-d1f5-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-05T17:14:07.000Z",
    "description": "8 hours agoAndy GiddingsWest MidlandsA doctor has been charged with sexually assaulting 38 patients while working at major hospitals in the West Midla",
    "body": "8 hours agoAndy GiddingsWest MidlandsA doctor has been charged with sexually assaulting 38 patients while working at major hospitals in the West Midlands, the Crown Prosecution Service (CPS) has said.Nathaniel Spencer, 38, of Quinton, Birmingham, has been charged with 15 counts of sexual assault, 17 counts of assault by penetration and nine counts of sexual assault of a child under 13.Mr Spencer also faces three counts of assault of a child under 13 by penetration, and one count of attempting to assault by penetration.The charges relate to alleged offences against 38 patients at the Royal Stoke University Hospital in Stoke-on-Trent, and Russells Hall Hospital in Dudley, between 2017 and 2021, the CPS said.The BBC has asked whether multiple children were involved, but the CPS and Staffordshire Police said they were not able to provide further details.Mr Spencer is due to appear at the North Staffordshire Justice Centre on 20 January 2026.The CPS said the decision to prosecute had followed a \"detailed and complex investigation by Staffordshire Police\".Mr Spencer has been suspended from medical practice in the UK pending the outcome of the investigation.He was a former resident doctor, previously known as junior doctor, who worked at the University Hospitals of North Midlands (UHNM) NHS Trust between August 2017 and August 2020.Mr Spencer later worked as a resident doctor on a placement at The Dudley Group NHS Foundation Trust from August 2020 to April 2021.Both trusts have set up dedicated helplines for those with concerns or questions about the care they had received.Dr Paul Hudson, the Dudley Group's operational medical director, said: \"We understand that many of our patients, staff, and people in the wider community will find this news very distressing.\"The trust said it had been working with the police throughout the investigations.UHNM said: \"As this is an ongoing criminal process, we cannot comment further at this time but we would like to reassure the public that the safety and well-being of our patients and their relatives are our highest priority.\"The General Medical Council said it had taken action to prevent Mr Spencer from practising while it investigated his fitness to practise.Its investigation would continue once criminal proceedings had concluded, it said and Mr Spencer remained suspended until that time.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Doctor charged with sexually assaulting West Midlands hospital patients",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4b2e/live/36049cb0-d1f5-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-05T17:14:07.000Z",
      "dateModified": "2025-12-05T17:14:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Frank Gehry's most iconic work - in pictures",
    "url": "https://www.bbc.com/news/articles/c0qlgx275jqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d0a8/live/4f3f52b0-7449-11f0-a20f-3b86f375586a.jpg",
    "tag": "Trending",
    "date": "2025-12-05T20:26:35.000Z",
    "description": "5 hours agoFrank Gehry, a provocative and creative force in architecture who has died aged 96, was behind some of the world's most intriguing building",
    "body": "5 hours agoFrank Gehry, a provocative and creative force in architecture who has died aged 96, was behind some of the world's most intriguing buildings.Tim Graham/Getty ImagesThe unmistakable curves of the Guggenheim Museum, BilbaoInsights/Universal Images Group via Getty ImagesA leaning glass tower at the Dancing House, PragueTim Graham/Getty ImagesStriking purple tones on the Hotel Marques de Riscal Bodega, SpainTim Graham/Getty ImagesTitanium and glass at the Guggenheim in BilbaoMichael Jacobs/Art in All of Us/Corbis via Getty ImagesThe oversized canopy of the Louis Vuitton Foundation in ParisPetr Svarc/UCG/Universal Images Group via Getty ImagesGehry's El Peix d'Or - or golden fish sculpture - is a must-see for visitors in BarcelonaView Pictures/Universal Images Group via Getty ImagesA golden-hour glow drenches the Walt Disney Concert Hall in CaliforniaJOKER/Walter G. Allgöwer/ullstein bild via Getty ImagesAn air of whimsy at Der Neue Zollhof in DüsseldorfView Pictures/Universal Images Group via Getty ImagesThe Walt Disney Concert Hall holds its own beside the imposing skyscrapers of central LAView Pictures/Universal Images Group via Getty ImagesLight floods into the curved form within Bilbao's GuggenheimNatalie Naccache/Bloomberg via Getty ImagesGehry's Guggenheim in Abu Dhabi while under construction in 2023Jay L. Clendenin / Los Angeles Times via Getty ImagesFrank Gehry, seen in 2022, was known for his unpredictable architectural style",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Frank Gehry's most iconic work - in pictures",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d0a8/live/4f3f52b0-7449-11f0-a20f-3b86f375586a.jpg"
      ],
      "datePublished": "2025-12-05T20:26:35.000Z",
      "dateModified": "2025-12-05T20:26:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man, 18, hit by car on motorway was Tasered before death",
    "url": "https://www.bbc.com/news/articles/cpvdjjy182go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fea1/live/5293d6e0-ce88-11f0-863d-7b9c77ed56fe.jpg",
    "tag": "Trending",
    "date": "2025-12-05T12:21:23.000Z",
    "description": "13 hours agoSarah TurnnidgeBristolNational HighwaysLogan Smith, 18, died after being hit by a car on the M5 in North Somerset on SundayAn 18-year-old ",
    "body": "13 hours agoSarah TurnnidgeBristolNational HighwaysLogan Smith, 18, died after being hit by a car on the M5 in North Somerset on SundayAn 18-year-old who got out of an ambulance on a motorway was Tasered by police before he was hit by a car and died, the police watchdog has said.Logan Smith, from Weston-super-Mare, died on the M5 in North Somerset late on Sunday evening. The Independent Office for Police Conduct (IOPC) said he was being taken to hospital when concerned paramedics stopped the ambulance on the hard shoulder of the northbound carriageway of the M5. Police were called when Mr Smith walked onto the carriageway, and the officer was captured on bodycam footage discharging their Taser, causing him to fall to the ground where he was hit by a car. Mr Smith was given emergency first aid, but died at the scene. A post-mortem examination has since been carried out ahead of a future inquest.Investigators at the IOPC are now looking into the actions and decisions made by Avon and Somerset Police prior to Mr Smith's death. The watchdog's director Derrick Campbell said his thoughts were with Mr Smith's family and friends, as well as \"everyone affected by this shocking and tragic incident\".\"We want to reassure everyone that we will independently investigate all the circumstances surrounding this incident, including the use of a Taser,\" he added, explaining that initial accounts had been taken from the officer and ambulance staff involved.He said the IOPC met with Mr Smith's family on Tuesday to give their condolences and explain the investigation, including the matter of the Taser being discharged. In a statement given after the incident, Avon and Somerset Police Assistant Chief Constable Joanne Hall said: \"This incident has had a significant effect on our officers and ambulance crews who are understandably incredibly upset by what happened.\"As well as providing support to the man's family, we are also making sure that the appropriate welfare arrangements are in place for our staff and also for those members of the public who were either directly involved or who witnessed the incident.\"More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man, 18, hit by car on motorway was Tasered before death",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fea1/live/5293d6e0-ce88-11f0-863d-7b9c77ed56fe.jpg"
      ],
      "datePublished": "2025-12-05T12:21:23.000Z",
      "dateModified": "2025-12-05T12:21:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tuam: Burial ground at mother and baby institution",
    "url": "https://www.bbc.com/news/articles/cy84ggnl8y7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3cbc/live/866c48f0-d1d8-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-12-05T12:35:15.000Z",
    "description": "12 hours agoChris PageBBC News Ireland correspondentAn excavation team said it has found evidence of a burial ground at the site of the former institu",
    "body": "12 hours agoChris PageBBC News Ireland correspondentAn excavation team said it has found evidence of a burial ground at the site of the former institution for unmarried mothers and their children in Tuam in County Galway.The agency began the work in July, with the aim of finding and identifying as many remains as possible.The institution at Tuam came to international attention in 2014, after local historian Catherine Corless discovered there were 796 death certificates for children and babies who died there, but no burial records.The Office of the Director of Authorised Intervention, Tuam (ODAIT) has published its fourth regular update.It said it found \"graves of child or infant size\" at an area on the western edge of the site, where excavations have been carried out under a tent.It corresponded to an area labelled as \"burial ground\" on historical maps of the site.ODAIT said: \"Despite these historical references, there were no surface or ground level indications of the potential for a burial ground at this location prior to excavation.\"The presence of burials at this location has now been confirmed.\"The layout and size of the graves is consistent evidence that, at this part of the site, there is a burial ground from the time of the operation of the mother-and-baby institution.\"The institution was open from 1925 until 1961.ODAIT said it recovered four more sets of human remains in the same area, further to the seven which it had found in its previous update last month.It said \"initial assessments\" indicated that all eleven remains were of infants and they had been in coffins.Further analysis is being carried out on the remains.The excavations under the tent are being carried out by machine and by hand.The area is about 100m from another part of the site where investigators from a government inquiry found \"significant quantities\" of remains in underground chambers in 2017.The Director of Authorised Intervention, Daniel MacSweeney, is leading the team.He has previously worked for the International Committee of the Red Cross in operations to recover missing people.He told the Irish national broadcaster RTÉ that the confirmation that infant remains were present was \"very important\".Mr MacSweeney said that 160 people had made contact with a view to giving DNA samples to help identify the bodies.He expressed hope that more would now follow, saying: \"I know from experience that sometimes the discovery of remains can be a catalyst for people to come forward.\"The institution at Tuam was owned by Galway County Council and run by a religious order, the Bon Secours Sisters.The order has previously acknowledged that children and infants were \"buried in a disrespectful and unacceptable way\", and apologised.It has contributed £2.14m towards the cost of the excavation.Galway County Council also apologised for \"failing mothers and children\" after the inquiry report in 2021.The excavation is expected to continue until 2027, with follow-up work expected to last several more years.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tuam: Burial ground at mother and baby institution",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3cbc/live/866c48f0-d1d8-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-05T12:35:15.000Z",
      "dateModified": "2025-12-05T12:35:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]