[
  {
    "title": "Best sports photos of 2025: The stories behind the images",
    "url": "https://www.bbc.com/sport/articles/cly5xnln575o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0f46/live/ea9f8470-d298-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-25T10:38:03.000Z",
    "description": "Great journalism without brilliant photography is like Christmas dinner without roast potatoes.Getty Images' team of award-winning photographers cover",
    "body": "Great journalism without brilliant photography is like Christmas dinner without roast potatoes.Getty Images' team of award-winning photographers covered more than 50,000 sports events in 2025, from grassroots tournaments watched by a few dozen fans to World Cups seen by millions around the globe.BBC Sport brings you the best sports photos of the past 12 months - and the photographers explain the stories behind them.Ever wondered how you get a picture at the top of the pole vault? What is a 'star filter'? And how much does luck play a part in capturing amazing images?There's a bonus point if you can spot the photographer in their own photo...Image source, Getty ImagesChristian Petersen: It was an honour to be part of the World Athletics Championship in Tokyo, where I set out to capture unique images and fresh perspectives. Noah Lyles' signature pre-race vertical leap inspired me to shoot from high above and behind, creating a new view that highlighted the graphic lines of the track. I was very happy with the result.Image source, Getty ImagesAdam Pretty: I took this picture at the relatively new Surftown wave pool in Munich, where some elite French Polynesian surfers had booked private training sessions. Athletes use the pool to focus on training specific manoeuvres and aerials on the perfectly consistent man-made wave.I photographed Aelan Vaast, the sister of 2024 Olympic surfing gold medallist Kauli Vaast, as she performed a layback hack on the final section of the wave. The image was shot in the early morning before the sun was up. I used a flash to create the silhouette of her against the bright blue water of the pool and the spray she was throwing with her massive turn.Image source, World Rugby/Getty ImagesMolly Darlington: I took this photo after the Women's Rugby World Cup final in the winners' studio, when the emotions were high and the players were super excited. It is my favourite photo I took from the tournament. Zoe Aldcroft and head coach John Mitchell are a perfect combination, summing up what it feels like to win the World Cup. What you can't see in the picture is all the players and staff who piled into the dressing room, throwing confetti and streamers and cheering them on. It was a special moment.Image source, Getty ImagesMahmoud Khaled: I am always searching for grassroots football tournaments in Egypt's villages and working-class neighbourhoods, where spontaneity meets pure passion. The Al-Qudah tournament in Sharqia was one of the most impressively organised I have seen, almost like a professional league match: huge crowds, co-ordinated team entrances, players from the lower divisions, and even referees who officiate in the Egyptian Premier League.What I love most is the journey itself, from discovering the story to reaching the place. The real reward comes afterward, seeing the joy on people's faces when they see their photos published.This frame was taken during the final, capturing the moment a player from Al-Ghaba takes a penalty in the shootout after a 2–2 draw. Al-Numan eventually lifted the trophy.Image source, Getty ImagesPool photo: The image - taken during the most exciting competition of the World Athletics Championships - illustrates Sweden's superstar Armand Duplantis' dominance in the pole vault final.A tiny camera, no bigger than a pack of cards, was mounted next to the support for the bar, and a customised technical solution allowed the photographer to trigger it remotely and receive the frame live on his laptop within seconds.Duplantis cleared 6.30m in this competition, broke the world record for the 14th time and secured his third world title. It is an exceptional achievement by the athlete and a fantastic piece of work by the photographer to capture the very best at the peak of the action.Matthias Hangst, Getty Images director of contentImage source, International Skating Union/Getty ImagesDean Mouhtaropoulos: Living in the Netherlands, I am lucky to cover speed skating, one of our national sports, although most of it is indoors.This event was near the Dolomites in Italy. Shooting such dynamic and talented athletes in an outdoor setting is a photographer's dream. A nearby building cast an afternoon shadow over the track. Once I spotted it, I quickly ran up the stand, hoping the clouds would not reappear. Some fans watching, plus my shadow, left a nice shape on the ice, leaving me to wait for the skaters to enter the frame.Image source, Getty ImagesEmilee Chinn: Geordie Beamish is shown going down after getting caught in the congestion of the early laps of the 3,000m steeplechase at the World Championships.Along with capturing the split second another runner's foot connected with his face during the fall, what makes this image so powerful and moving to me is that Beamish got up, finished second in the heat, and went on to win the gold medal. Moments like this are what make sports photography so rewarding, reminding us how resilience can turn a setback into something remarkable.Image source, Velo/Getty ImagesDario Belingheri: An unusual moment through the Tuscan hills during the one-day race Strade Bianche, where the gravel sectors and dust are its distinctive beauty. I was a bit lucky to catch the right moment when a train passes next to the peloton in a cloud of dust, so it is perfectly blended with nature.Image source, Getty ImagesCameron Spencer: As the northern hemisphere works through winter, we are fortunate in Australia to start the year with a major international event in the middle of our summer, the Australian Open in Melbourne.In this image, Holger Rune is stretching full length to play a forehand against Zhizhen Zhang. I captured it from an elevated position high above the court in a 'catwalk'. Taking a step back, I was able to shoot through the ceiling rafters. These, combined with the harsh shadows cast by the roofline, created an opportunity to capture an interesting shape on the bright blue court, then I waited patiently for Rune to play a dynamic shot behind the baseline.Image source, Getty ImagesMichael Reaves: This photo was taken during a Major League Baseball game between the Pittsburgh Pirates and the Chicago Cubs at Wrigley Field. Often in sports photography you can plan for the big moments and control factors with light, moment and composition, but other times luck comes into play. This is one of those moments.While shooting a mundane at-bat, Henry Davis broke his bat. Usually broken bats explode forward and out of frame, but this one broke on a centre point and created a unique image with the ball still in frame and the split bat floating in time, almost comically.Image source, Getty ImagesMatthias Hangst: This photograph was taken during the European Artistic Gymnastics Championships in Leipzig. The event was held at the Leipziger Messe, a very functional trade-fair complex and not always the most visually appealing setting. The roof structure was full of steel construction elements with plenty of light reflections, creating a rather distracting background.To work around this, I decided to use a 'star filter' - a layer of glass attached to the front of the lens that refracts light in a specific way. It adds a touch of elegance and helps highlight the dynamics of Sweden's Maya Staahl during her beam routine.Image source, Getty ImagesYong Teck Lim: Photo positions at the World Para Swimming Championships in Singapore were fixed, making it hard to get creative. Still, China's Jincheng Guo was impossible to overlook - competing without goggles, cap and tech suit, and throwing in his trademark bubble technique for good measure.For the first three days he swam only 50m events, leaving me little to capture. On day four the 200m individual medley finally gave me an opening. I went in tight, hoping to catch that bubble magic, and managed this single frame that looks like a UFO. His gold-medal finish made the shot even sweeter.Image source, Uefa/Getty ImagesMaja Hitij: Trophy-lift photos may look simple, but they require a bit of planning. Agencies and photographers divide responsibilities and co-ordinate positions in advance because the entire moment lasts only a few seconds.I wanted to find a different angle after the Champions League final - not the usual spot in front. I tried moving farther back, but the field was crowded with security, TV crews and players, so I settled on a position slightly further to the right, away from most photographers. I got lucky - the confetti was released earlier than expected, covering the whole background as the Paris St-Germain players turned toward Marquinhos.Image source, Getty ImagesJudit Cartiel: During the second half of the La Liga match at Espanyol, Atletico Madrid's Giuliano Simeone started a run down the wing. While following the play from the corner with my camera, I saw Simeone approaching the assistant referee. He collided with him and I quickly decided to keep the focus on the official. I was looking to capture a moment that was unusual in football, where the player usually takes the spotlight.The image shows the assistant completely upside down in an acrobatic posture, with a funny expression on his face, creating a photograph with a comical tone.Image source, Getty ImagesChristian Petersen: Covering alpine skiing is one of the most challenging and rewarding assignments for me. I am always searching for graphic elements to complement the intense action. Slalom's bright gates against the white snow create a striking visual canvas. This image, taken at the Ski World Cup Finals in Idaho, captures that perfectly, blending the racer's motion with a sweep of vivid colour.Image source, Getty ImagesAl Bello: This was an undercard fight before the main event. I like to shoot the undercards because I can try to take more chances with my photo technique. In this case I was shooting tighter than usual, hoping to catch a punch landing. The risk of shooting so tight is that if there is a knockdown you will likely miss the picture. I timed the punch at the exact moment, freezing the full force of the impact on the face.Image source, Getty ImagesHannah Peters: I had been looking forward to the Crankworx mountain biking festival in Rotorua, New Zealand, because it often makes good pictures, but was disappointed when I set off early that morning to clouds and no light.After about 30 minutes' walking and finding a good spot for the warm-up rounds, the sun suddenly broke through for about five minutes. There was only time for two riders to make their runs, so it was a bit of good fortune that Tim Bringer managed to pull off a pretty awesome trick.Image source, Getty ImagesStu Forster: This is the most exciting England cricket team to photograph in my career, with players like Jamie Smith at the forefront. You cannot take your eyes off it for a single ball. Here, Smith shows off his footballing skills to stop the ball from ricocheting on to the stumps during the Lord's Test. It was before this match that I read that the young Smith had been coached in his youth by Matt Holmes, formerly the cricket photography editor at Getty Images. It's a small world.Image source, Getty ImagesAdam Pretty: I have been trying to photograph water polo from the beginning of my sports photography career in 1998, as it has the potential for some amazing images. But it is so difficult to capture them because of the nature of the sport and the unpredictability of the water - the splashes and speed at which the drama happens.This image was extremely fortunate as the timing had to be perfect. I was not in control of anything apart from my camera, which was in an underwater robotic housing at the bottom of the pool. I had to rely on the match beginning at the perfect time, and the athlete diving in just the right way to pass through a tiny pocket of light.Fortunately, everything came together to create the image, and that is what I love about sports photography - it takes a number of elements or layers to create a memorable image.Image source, McKlein Photography/LAT ImagesTom Banks/McKlein Photography: Viera do Minho, a stage of Rally Portugal, features undulating roads and landscape scattered with large, round granite boulders.Having never shot this area myself, we hitched a ride up the mountainside to a remote stretch with the local 4x4 club - an experience in itself. After scouting various vantage points I settled in the valley and awaited the cars. As Adrien Fourmaux blasted into view, the fans delivered a perfectly timed wave of the Portuguese flag - complemented by the arrival of the low-flying TV helicopter.It is one of those moments when everything aligns.Image source, Getty ImagesShi Tang: This image captures a dynamic Tomoka Miyazaki of Japan mid-motion, rendered with a long-exposure effect that transforms her movement into flowing streaks of red light. The blurred trails emphasise the power and fluidity of the action, while the sharpness of her focused expression adds contrast and intensity. Set against a dark background, the vibrant colours and sweeping motion create an almost abstract, dance-like composition.Image source, Getty ImagesDean Mouhtaropoulos: Photographing the best athletes at the height of their powers is one of the many joys of my job. Covering the men's javelin F46 final at the World Para Athletics Championships in New Delhi, I noticed Guillermo Varona Gonzalez with a different pre-throw routine than most. Positioning myself low on the ground before his run-up, he would leap and double click his heels.The power in this leap would be enough to make a strong image, but the red clothing, impressive physique, javelin in hand and black sky all combined to made one of my favourite images of the year.Image source, Sportsfile/Getty ImagesSeb Daly/Sportsfile: For the uninitiated, this is hurling - an Irish sport that is incredibly fast, very skilful and, as this image shows, highly physical. These two players are merely getting to know each other at the start of the match - a little \"pulling and dragging\", as the locals might say, in an effort to throw an opponent off their game, to get into their head, assert a little dominance.All while this is going on, there is also a match to capture. It is a busy, raw, unique, and fantastic spectacle.Image source, Getty ImagesMichael Reaves: This photo was taken during game one of baseball's National League Division Series in Milwaukee. I was excited when they announced the mid-afternoon game time and was hoping the weather would hold off so the roof would stay open. The sun peaked for an inning while Aaron Ashby pitched and, from my position in the first base well, I was able to make a wide frame. I exposed for the highlights and let the shadows of the stadium create a compositionally pleasing frame as he delivered a pitch.Image source, PGA of America/Getty ImagesMaddie Meyer: In professional sports there is often such a distance between fans and athletes. It can feel sterile and as a photographer it can be hard to bring the atmosphere of the crowd and an athlete into one frame. Here Rory McIlroy ran to the adoring Europe fans after his team's win over the USA in the Ryder Cup in New York.He appeared to fully give in to the moment, allowing the fans to embrace him over the barricade. As a photographer it can be challenging to make a well composed image in a chaotic scene, but I like this picture and think it tells the story of Europe's triumph on away territory.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Best sports photos of 2025: The stories behind the images",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0f46/live/ea9f8470-d298-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-25T10:38:03.000Z",
      "dateModified": "2025-12-25T10:38:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Newscast Review of the Year 2025 - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mqch0p?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-24T12:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·24 Dec 2025,·52 minsThe Newscast Review of the Year 2025NewscastAvailable for over a yearAdam, Chris, Laura and Paddy go through the biggest stories of 2025 with the help of economics editor Faisal Islam and international editor Jeremy Bowen.\nThey also reveal what it was like to be on the inside as they happened, and discuss how Keir Starmer will reflect on his first full year as prime minister, how Donald Trump's tariffs reshaped the world's economy, and how a ceasefire between Israel and Hamas was reached.\nAnd we look at where the rise of Nigel Farage’s Reform UK and Zack Polanski’s Green Party have left politics in the UK.\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenters were Adam Fleming, Chris Mason, Laura Kuenssberg and Paddy O’Connell. It was made by Chris Flynn. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Newscast Review of the Year 2025 - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-24T12:00:00.000Z",
      "dateModified": "2025-12-24T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Were our 2025 predictions right? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mpqcjw?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-12-24T07:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·24 Dec 2025,·35 minsAvailable for over a yearWhat did the Americast team get right when they made their predictions for what the big news stories of 2025 might be? Justin, Anthony, Sarah and Marianna look back at a tumultuous year for Donald Trump in his second term, which include deportation raids, Elon Musk’s role, the war in Gaza, the US shutdown and more. It’s time to open up the Americast time capsule of predictions and find out what we got right and what we got wrong…\nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Anthony Zurcher, North America Correspondent\n• Marianna Spring, Social Media Investigations Senior Correspondent \nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray and Grace Reeve. The technical producer was Jonny Hall. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Were our 2025 predictions right? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-12-24T07:00:00.000Z",
      "dateModified": "2025-12-24T07:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Turkey arrests 115 IS suspects 'planning New Year's attacks'",
    "url": "https://www.bbc.com/news/articles/cn98w93l8plo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e997/live/44d2a2c0-e17a-11f0-b74d-8b6955ff49d6.jpg",
    "tag": "Trending",
    "date": "2025-12-25T10:19:28.000Z",
    "description": "Turkish authorities say they have disrupted planned attacks on Christmas and New Year's events after detaining more than 100 suspected members of the ",
    "body": "Turkish authorities say they have disrupted planned attacks on Christmas and New Year's events after detaining more than 100 suspected members of the so-called Islamic State group.Mass raids were carried out at 124 addresses across Istanbul, the city's chief prosecutor said, with firearms, ammunition and \"organisational documents\" seized.Officials said IS supporters had been actively planning attacks across Turkey this week, particularly against non-Muslims. Police detained 115 suspects but efforts are ongoing to trace a further 22, an official statement read.The prosecutor's office said the suspects were in contact with IS operatives outside Turkey. The announcement comes two days after Turkish intelligence agents carried out a raid against the group on the Afghanistan-Pakistan border.A Turkish national who is alleged to have held a senior role with the IS wing operating in the region was detained and accused of planning attacks against civilians. Turkey's security services regularly target people with suspected links to IS.The country shares a 900km (560 mile) border with Syria, where the group continues to operate in parts of the country.Syria's president Ahmed al-Sharaa, who has close ties to the Turkish government, has vowed to work with the US and Europe to root out surviving elements of IS. The US launched a wave of air strikes against the group's positions across Syria on Friday in response to the killing of three Americans.Two US soldiers and a civilian interpreter were killed by IS gunmen during an ambush earlier this month. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Turkey arrests 115 IS suspects 'planning New Year's attacks'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e997/live/44d2a2c0-e17a-11f0-b74d-8b6955ff49d6.jpg"
      ],
      "datePublished": "2025-12-25T10:19:28.000Z",
      "dateModified": "2025-12-25T10:19:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jingle bills: Arkansas Powerball player strikes $1.8bn jackpot on Christmas Eve",
    "url": "https://www.bbc.com/news/articles/cwyw4x39jdwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/704a/live/44cf86f0-e1a5-11f0-b650-ab4669d57967.jpg",
    "tag": "Trending",
    "date": "2025-12-25T15:55:36.000Z",
    "description": "A Powerball player in Arkansas won a whopping $1.817bn (£1.34bn) jackpot in a Christmas Eve drawing, making it the second-largest lottery prize ever c",
    "body": "A Powerball player in Arkansas won a whopping $1.817bn (£1.34bn) jackpot in a Christmas Eve drawing, making it the second-largest lottery prize ever claimed.The single winning ticket matched all six numbers  - 4, 25, 31, 52, 59 and red Powerball 19 - giving the winner the option of taking a lump-sum cash payment of  $834.9m.This marks only the second time a Powerball jackpot has been won by a ticket sold in Arkansas, according to the lottery operator. Powerball did not identify the winner.The largest single-ticket prize remains the $2.04bn jackpot won in 2022 by a player in Altadena, California.In order to win the jackpot, a lottery ticket holder must match all five white balls and the red Powerball selected during a drawing.Tickets for the lottery cost $2 each - and the odds of winning the jackpot are 1 in 292.2 million, according to game organisers. A winner has an option to choose a lump-sum payment or receive the full amount in an annuity paid over 29 years, but most winners opt for the upfront cash option.The game, which began in 1992, is played in 45 of the 50 US states, the capital city of Washington, and in the US territories of Puerto Rico and the Virgin Islands.The winnings are subject to federal taxes of between 24% and 37%, and, in most cases, state taxes.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jingle bills: Arkansas Powerball player strikes $1.8bn jackpot on Christmas Eve",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/704a/live/44cf86f0-e1a5-11f0-b650-ab4669d57967.jpg"
      ],
      "datePublished": "2025-12-25T15:55:36.000Z",
      "dateModified": "2025-12-25T15:55:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Front-runner to be Bangladesh PM returns after 17 years in exile",
    "url": "https://www.bbc.com/news/articles/crk733k1k1eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/76fa/live/40b11f80-e16d-11f0-a0bc-9fe6b7032229.jpg",
    "tag": "Trending",
    "date": "2025-12-25T06:44:21.000Z",
    "description": "Tarique Rahman, the front-runner to be the next prime minister of Bangladesh, has returned to the country after 17 years in exile ahead of landmark ge",
    "body": "Tarique Rahman, the front-runner to be the next prime minister of Bangladesh, has returned to the country after 17 years in exile ahead of landmark general elections.The 60-year-old is the figurehead of the influential Zia family and the son of former prime minister Khaleda Zia. The party he leads, the Bangladesh Nationalist Party (BNP), is eyeing a return to power when Bangladesh goes to the polls in the new year.Rahman, who has lived in London since 2008, is expected to become the country's new leader if the BNP emerges as the largest party. Rahman's return comes in the wake of former Prime Minister Sheikh Hasina being ousted last year.He had been the subject of various criminal investigations launched while her Awami League party was in power but was cleared of all charges when her regime fell. Hasina is living in exile in India and her party is unlikely to be permitted to take part in the elections, which many view as among the most consequential in Bangladesh's history.Last month, Hasina was sentenced to death for her role in suppressing anti-government protests. According to UN investigators, up to 1,400 people died in the student-led unrest.Hasina, who was put on trial in absentia, has denied committing crimes against humanity. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Front-runner to be Bangladesh PM returns after 17 years in exile",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/76fa/live/40b11f80-e16d-11f0-a0bc-9fe6b7032229.jpg"
      ],
      "datePublished": "2025-12-25T06:44:21.000Z",
      "dateModified": "2025-12-25T06:44:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pope Leo urges 'courage' to end Ukraine war in first Christmas address",
    "url": "https://www.bbc.com/news/articles/cm21728nwxlo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6659/live/eb56c3b0-e184-11f0-a275-6df560e31dd7.jpg",
    "tag": "Trending",
    "date": "2025-12-25T11:41:39.000Z",
    "description": "Pope Leo has urged Ukraine and Russia to find the \"courage\" to hold direct talks to end the war during his first Christmas remarks to crowds in St Pet",
    "body": "Pope Leo has urged Ukraine and Russia to find the \"courage\" to hold direct talks to end the war during his first Christmas remarks to crowds in St Peter's square.He called for an end to conflicts around the world during his Urbi et Orbi address, which is traditionally delivered by the pontiff on Christmas Day to worshippers gathered in Vatican City. Speaking about Ukraine, the Pope said: \"May the clamour of weapons cease, and may the parties involved, with the support and commitment of the international community, find the courage to engage in sincere, direct and respectful dialogue.\"His plea comes as US-led negotiations on a deal to end the fighting continues. The US has sought to put together an agreement acceptable to both sides, but direct talks between Russian and Ukraine have not taken place during this latest round of diplomatic efforts.Pope Leo also decried turmoil and conflict plaguing other parts of the world, including Thailand and Cambodia where deadly border clashes have flared up despite a ceasefire in July.He asked that the South East Asian nations' \"ancient friendship\" be restored and \"to work towards reconciliation and peace\".During an earlier Christmas Day sermon in St Peter's Basilica, Pope Leo lamented conditions for homeless people the world over, and the damage caused by conflicts.\"Fragile is the flesh of defenceless populations, tried by so many wars, ongoing or concluded, leaving behind rubble and open wounds,\" he said.He said the story of the birth of Jesus showed that God had \"pitched his fragile tent\" among the people of the world. \"How, then,\" he asked, turning his attention to the conditions of Palestinians, \"can we not think of the tents in Gaza, exposed for weeks to rain, wind and cold?\"Gaza has been devastated by Israeli bombardment in a two-year war, triggered by Hamas's attack on Israel on 7 October 2023.Winter storms have compounded the plight of the territory's 2.1m population, nearly all of whom have been displaced and their homes damaged or destroyed.Aid agencies have called for Israel to allow more tents and urgently needed supplies into Gaza. Cogat, the Israeli military body which controls Gaza's border crossings, has dismissed claims of deliberate aid restrictions, saying almost 310,000 tents and tarpaulins had been delivered since the start of the ceasefire in October.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pope Leo urges 'courage' to end Ukraine war in first Christmas address",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6659/live/eb56c3b0-e184-11f0-a275-6df560e31dd7.jpg"
      ],
      "datePublished": "2025-12-25T11:41:39.000Z",
      "dateModified": "2025-12-25T11:41:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Quiz of the Year 2025, Part 1: Which star teased her engagement on the red carpet?",
    "url": "https://www.bbc.com/news/articles/ce8n1l5vd5xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8f1e/live/96ba18e0-dff7-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2025-12-25T00:30:11.000Z",
    "description": "16 hours agoIn the first three months of the year, deadly wildfires tore through Los Angeles, outgoing US President Joe Biden handed over the keys to ",
    "body": "16 hours agoIn the first three months of the year, deadly wildfires tore through Los Angeles, outgoing US President Joe Biden handed over the keys to the White House, and actress Millie Bobby Brown hit back at \"bullying\" journalists.But how much attention did you pay to what else happened in the world?Test your memory of January to March in part one of our four-part Christmas quiz - 52 questions for 52 weeks of the year. Quiz compiled by Ben Fell.Fancy some more? Have a go at something from the archives.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Quiz of the Year 2025, Part 1: Which star teased her engagement on the red carpet?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8f1e/live/96ba18e0-dff7-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-25T00:30:11.000Z",
      "dateModified": "2025-12-25T00:30:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pat Finn, US actor in TV shows Friends and The Middle, dies at 60",
    "url": "https://www.bbc.com/news/articles/c4g5qy80m2vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/11ba/live/368d6660-e138-11f0-ba03-b3dff450825b.jpg",
    "tag": "Trending",
    "date": "2025-12-25T04:14:39.000Z",
    "description": "12 hours agoHarry SekulichGetty ImagesPat Finn starred in the popular TV show The MiddleUS actor Pat Finn, who appeared in popular TV shows including ",
    "body": "12 hours agoHarry SekulichGetty ImagesPat Finn starred in the popular TV show The MiddleUS actor Pat Finn, who appeared in popular TV shows including Friends, Seinfeld and The Middle, has died aged 60.The comedy and improvisation performer died at home in Los Angeles on Monday having undergone treatment for cancer since 2022, US media reported. \"Pat never met a stranger - only friends he didn't know yet,\" his family said in a statement posted on social media.He had \"lived his life fully - with joy and exuberance\", the statement added.Finn's first television role was on the George Wendt Show in 1995, where he appeared as the titular character's brother. He also had a recurring role on Murphy Brown between 1995 and 1997.He starred as Joe Mayo in Seinfeld in 1998, playing a party host known to delegate burdensome jobs to his guests.He made guest appearances on popular shows throughout the late 1990s and early 2000s, including on the King of Queens, Friends, That '70s Show, and House. Finn was perhaps best known for his role as Bill Norwood in The Middle, featuring across eight seasons between 2011 and 2018.His film credits include It's Complicated (2009) and Santa Paws 2: The Santa Pups (2012).Getty ImagesPat Finn appeared in two episodes of Friends as Monica Geller's partner Dr RogerBeyond his on-screen roles, Finn was an improv performer and also taught at the University of Colorado, where he was an adjunct professor. He was part of an six-person improv troupe called Beer Shark Mice.\"Pat coached, befriended and mentored countless students throughout the years and you'd be hard-pressed to find anyone anywhere who has an unkind word to say about him,\" his family wrote.In a tribute to Finn, fellow actor Richard Kind said there was \"no kinder, gentler, funnier, down to earth person you could encounter\".\"Always positive, helping you be funnier and better. A great dad, a great guy,\" Kind wrote on Instagram.Finn is survived by his wife Donna, three children, and his parents and siblings.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pat Finn, US actor in TV shows Friends and The Middle, dies at 60",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/11ba/live/368d6660-e138-11f0-ba03-b3dff450825b.jpg"
      ],
      "datePublished": "2025-12-25T04:14:39.000Z",
      "dateModified": "2025-12-25T04:14:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Premier League footballers: What are they eating at Christmas? ",
    "url": "https://www.bbc.com/news/articles/c989005xj32o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f32f/live/543ddae0-e0f3-11f0-a016-cd64476883b3.jpg",
    "tag": "Trending",
    "date": "2025-12-25T01:04:51.000Z",
    "description": "What are professional footballers tucking into at Christmas? 15 hours agoSrosh KhanandNaomi de Souza,BBC NewsbeatHandoutTommy Cole works with nutritio",
    "body": "What are professional footballers tucking into at Christmas? 15 hours agoSrosh KhanandNaomi de Souza,BBC NewsbeatHandoutTommy Cole works with nutritionists at football clubs to make sure players get the most out of their mealsMany of us have been waiting all year to tuck into our favourite festive treats.Christmas dinner can look very different for each household - but for professional footballers, it is still a time to stay focused on fitness and recovery for matches.Private chef Tommy Cole whips up meals for Premier League players from major clubs - including Fulham, Chelsea and Brighton - all year round. When it comes to the main Christmas meal, he takes a traditional approach, but makes it \"a little boujee-r\" and healthier. \"With roast potatoes, for example, it's just being careful not to roast them in a crazy amount of fat, whilst still trying to make them nice and crispy,\" he tells BBC Newsbeat.\"Also things like your fillings, again, just being careful with the amount of fat that you're cooking them in.\" Getty ImagesProfessional footballers have still got to stay focused on their fitness at Christmas HandoutHe also tries to stick to slightly leaner cuts of meat.\"Turkey's very popular at Christmas so we would use the breast and not quite so much of the dark meat, which tends to be a bit fattier, and then just try and get plenty of veggies,\" the 33-year-old explains.Tommy works with nutritionists at the footballers' clubs to make sure they get the most out of their meals.\"We communicate with the players themselves and get their likes, dislikes,\" he says.\"Then we basically build a menu around that information and try and feed them some really tasty food.\"HandoutThe Christmas period is a particularly busy time for some of his football clients, so he's got to ensure they're getting the fuel they need to stay at the top of their game.\"The guys that are playing games, especially around Christmas, we'll see the fixtures are a bit more frequent,\" he says. December is notoriously busy for major clubs, with additional Premier League matches, extra European fixtures and cup competitions like the Carabao Cup and FA Cup.Clubs like Chelsea and Arsenal are going to be playing more than 15 matches in December and January. HandoutTommy started his chef journey eight years agoHandoutThe relentless football fixtures have been long spoken about by players and managers, who have complained about injuries and the short turnaround between matches.Due to the increased schedule, Tommy says they will need to be eating more carbohydrates to keep up their energy. \"So more potatoes, pasta, that sort of thing. We're just increasing those in their meals,\" he says.He will also try to get plenty of vegetables in to their diets for added nutrients, and for those who aren't the biggest fan, he has some tricks to sneak them in.  \"We might make some kind of sauces with vegetables,\" he says. \"So quite a popular and tasty one is making a katsu sauce.\"I make the base of the sauce with carrots, onions, garlic, that sort of thing.\"When it comes to helping players' recovery, oily fish, nuts and seeds are top of the menu. HandoutThe chef will try to add plenty of vegetables for added nutrientsHandoutTommy admits he didn't initally plan to get into the culinary worldTommy's cooking videos have racked up millions of views on TikTok, fuelled by a mix of curiosity and fascination into the diets of professional players.The mystery behind who is he catering for also draws people in - but he tells Newsbeat he is keeping that secret to himself.He is part of a growing industry dedicated to cooking high-end dinners for the rich and famous.But Tommy admits he didn't initially plan to get into the culinary world.  \"It never was a real big sort of dream or aspiration to be a chef,\" he says.\"I got into it because I went on a ski season, I just wanted to have a good time and then ended up cooking through that.\"HandoutAfter catching the cooking bug, he trained as a chef. Through his work at luxury chalets and hotels, he cooked for several celebrities and Premier League players, and one thing led to another. But over his eight years as a chef, Tommy has had some strange requests.\"I have had people request just frankfurters,\" he says. \"Which is the most average thing.\"Obviously you give the players what they want, but it's nice to do slightly fancier stuff.\"Matches being played on Boxing Day is a long-standing tradition in English football, but this year only one will be played in the Premier League.For Boxing Day, Tommy leans into tradition: \"It's just going to be bubble and squeak, lots of veggies in there, that good stuff.\"Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Premier League footballers: What are they eating at Christmas? ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f32f/live/543ddae0-e0f3-11f0-a016-cd64476883b3.jpg"
      ],
      "datePublished": "2025-12-25T01:04:51.000Z",
      "dateModified": "2025-12-25T01:04:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sean 'Diddy' Combs files appeal asking for his immediate release",
    "url": "https://www.bbc.com/news/articles/c5yqe4j15lzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5add/live/f07769e0-e101-11f0-b67b-690eb873de1b.png",
    "tag": "Trending",
    "date": "2025-12-24T23:30:09.000Z",
    "description": "Sean \"Diddy\" Combs has asked an appeals court to release him from prison and overturn his conviction on two prostitution-related crimes.In a court fil",
    "body": "Sean \"Diddy\" Combs has asked an appeals court to release him from prison and overturn his conviction on two prostitution-related crimes.In a court filing for an expedited appeal, the rap mogul's attorney argued that he was improperly sentenced, and that the conduct that resulted in his conviction was not criminal in nature.Attorney Alexandra Shapiro called Combs' 50-month prison sentence \"unlawful, unconstitutional, and a perversion of justice\". She asked an appeals court to order that Combs be resentenced, should the panel choose not to throw out his conviction in its entirety. The request is the latest attempt by his team to reduce his sentence or throw out his conviction.The Southern District of New York, which prosecuted Combs, declined to comment on the request to the Second Circuit Court of Appeals.Combs' lawyers had previously said they would appeal his sentence and conviction.Federal prosecutors in New York accused Combs of using his money, power, and the threat of violence to coerce women into unwanted sexual encounters.During a high-profile trial this spring, the jury heard from two of Combs' ex-girlfriends, Cassie Ventura and a woman who testified as \"Jane Doe\". They said Combs abused them and forced them to participate in so-called \"freak-offs\" with male escorts.The jury found Combs not guilty of the two most serious charges: racketeering conspiracy and sex trafficking. They convicted him of two counts of transportation to engage in prostitution.In September, after his conviction, Combs asked Judge Arun Subramanian to consider an acquittal or new trial, citing objections over the way an anti-prostitution statute known as the Mann Act was used to prosecute Combs. That bid was not successful.Ahead of his sentencing, Combs' attorneys argued he should receive a brief sentence that would essentially amount to time served, a request that would have paved the way for a swift release. Prosecutors, however, asked the judge to send Combs to prison for at least 11 years.US District Judge Arun Subramanian ultimately sentenced Combs to more than four years in prison. He said he considered Combs' contributions to society and testimonials from family and friends, but \"a history of good works can't wash away your record\".Combs' appeal argues that Judge Subramanian did not properly follow sentencing guidelines when sending him to 50-months in prison.It argues the judge \"flouted\" new guidelines and improperly considered conduct for which Combs had been acquitted when formulating his punishment. The filing argues the judge \"acted as a thirteenth juror\" in the case and calls the sentence \"draconian\". Before Judge Subramanian issued his sentence, Combs apologized to Ms Ventura and \"Jane.\"\"My actions were disgusting, shameful, and sick,\" Combs said. \"I got lost in excess, I got lost in my ego.\"Combs is also facing dozens of pending civil lawsuits, which accuse him of sexual assault, rape and sexual exploitation. Many of the lawsuits allege that the rapper used his fame and power to silence accusers through threats. Some detail allegations that the rapper - or those who worked for him - drugged people at parties before alleged assaults. Representatives for Mr Combs have repeatedly said he \"never sexually assaulted or trafficked anyone - man or woman, adult or minor\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sean 'Diddy' Combs files appeal asking for his immediate release",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5add/live/f07769e0-e101-11f0-b67b-690eb873de1b.png"
      ],
      "datePublished": "2025-12-24T23:30:09.000Z",
      "dateModified": "2025-12-24T23:30:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Christmas Day weather: Cold health alert with warnings issued for parts of UK",
    "url": "https://www.bbc.com/news/articles/cr4dvgkvveyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8cf6/live/45316f50-e1a0-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-25T15:35:41.000Z",
    "description": "Cold health alert as parts of UK set to freeze on Christmas Day39 minutes agoThomas MackintoshandJonathan Josephs,BBC News, Hyde ParkWatch: Swimmers b",
    "body": "Cold health alert as parts of UK set to freeze on Christmas Day39 minutes agoThomas MackintoshandJonathan Josephs,BBC News, Hyde ParkWatch: Swimmers brave the Serpentine for chilly Christmas dipA cold health alert and weather warnings have been issued for parts of the UK on Christmas Day, as forecasters dashed hopes of a white Christmas.The UK Health Security Agency (UKHSA) issued the yellow alert for south-west England from 18:00 on 25 December to midday on 27 December.A Met Office yellow warning for wind covers south-west England, Somerset and a large swathe of Wales, stretching from Cardiff and Swansea up to Bangor. Gusts hit 68mph (109 km/h) early on Thursday at Berry Head, Torbay.Organisers of some Christmas and Boxing Day swims in Devon and Cornwall have had to cancel events.Others have still gone gone.Some 400 swimmers competed in an annual race at The Serpentine in London's Hyde Park.Dave Bill, who took the trophy this year, told the BBC it was a \"real honour\" to win, adding: \"Swimming in the cold water is one of the most rewarding things. It calms my nervous system.\"Meanwhile, the Met Office warning covers 18 of Wales' 22 council areas.In south-west England, temperatures on Christmas morning were between 1C and 4C (34F and 39F) for most, said BBC Weather's Matt Taylor, but it was \"feeling below freezing due to the wind chill\".Winds around coasts and on moors have exceeded 40mph at times, hitting 43mph at Plymouth and 49mph at Liscombe, Exmoor, he added.Met Office spokesman Oli Claydon said it was \"highly unlikely\" the UK would see a white Christmas.\"We've got a very dry picture across the UK over the next few days,\" he added.Although not an official part of the UK, the crown dependency of Jersey experienced snow on Thursday morning.The Jersey Met Section said it was only the third time since records began that snow was observed on the island on Christmas Day and the first time since 1970.PA MediaNot every Christmas Day dip was cancelled and brave swimmers took to the water in Blackroot Pool in Sutton Park, Birmingham Nadezna / BBC Weather WatchersPeople gather to watch the Christmas Day sunrise in PenarthAccording to UKHSA, low temperatures are likely to have minor impacts on health and social care services including \"increased use of healthcare services by vulnerable people\" and a \"greater risk to life of vulnerable people\".The Met Office said east to north-easterly winds would become particularly strong and gusty during Christmas Day.Gusts are expected to peak fairly widely at 45-55mph, with 55-65mph possible along some exposed coasts and to the west of prominent hills.It added that \"given the more unusual wind direction, this may lead to some disruption to transport and power supplies\" and that \"large waves will be an additional hazard on some coasts\".The highest temperatures on Christmas Day were forecast to be around 7C (45F) in north-east England and 6C in south or south-east England.The Met Office added that frost and freezing temperatures were likely in western rural areas overnight on Christmas Day into Boxing Day, with -6C possible in rural parts of Scotland and -4C in rural Wales.Organisers of the Coverack swim in Cornwall said with the weather forecast it would be \"too dangerous\" for the event to go ahead and postponed the event until New Year's Day.Start Bay Inn, in Devon, said it was \"really sad\" to announce its Boxing Day swim had been cancelled, while the RNLI Teignmouth took a similar decision, insisting \"safety considerations must come first\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Christmas Day weather: Cold health alert with warnings issued for parts of UK",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8cf6/live/45316f50-e1a0-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-25T15:35:41.000Z",
      "dateModified": "2025-12-25T15:35:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Two men believed missing after Budleigh Salterton swimmers search",
    "url": "https://www.bbc.com/news/articles/c4g41v0dekgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e3ff/live/71a2d550-e19c-11f0-a524-2133d4a7aa5a.jpg",
    "tag": "Trending",
    "date": "2025-12-25T16:13:01.000Z",
    "description": "Two men believed missing as coast search continuesJust nowArchie FarmerDevonBBCA number of people have been safely brought back to shore, police sayTw",
    "body": "Two men believed missing as coast search continuesJust nowArchie FarmerDevonBBCA number of people have been safely brought back to shore, police sayTwo men are believed to be missing off the Devon coast after reports of swimmers in difficulty, police have said.Devon and Cornwall Police were called at 10:25 GMT to the beach at Budleigh Salterton after concern was raised for people in the water, prompting a significant emergency response.A number of people were safely brought back to shore and were checked either by paramedics at the scene or taken to hospital as a precaution, the force confirmed.It said the next of kin of one man had been spoken to and attempts to speak to a second man's family were continuing, with a local friend informed as part of those efforts.In a statement, the force added: \"A significant amount of emergency service personnel were deployed to the incident and we ask that people do not enter the water for public safety reasons.\"The Maritime and Coastguard Agency said Exmouth and Beer Coastguard Rescue teams, RNLI lifeboats from Exmouth and Torbay, and coastguard search and rescue helicopters have been sent to the scene to assist, alongside police and the ambulance service.Police have urged members of the public not to enter the water along this stretch of coast while the incident is ongoing.Earlier, the force asked people not to participate in a Christmas Day swim at Exmouth while emergency services responded to the incident at Budleigh Salterton.On Wednesday, organisers of some Christmas and Boxing Day swims in Devon and Cornwall postponed or cancelled events due to a yellow weather warning for wind.'Roughest’ seaBBC journalist Phillip Stoneman has been a visitor to Budleigh for the swim for the past few years. He said: \"As soon as we arrived you could tell that the sea was the roughest it's been and that anyone going in would need to be a lot more cautious than usual.”He added: “The waves swept some people exiting the sea off their feet and other swimmers were helping them out.”He said the RNLI boat was out in the water at the time and hundreds of people were either on the beach or in the water. Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two men believed missing after Budleigh Salterton swimmers search",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e3ff/live/71a2d550-e19c-11f0-a524-2133d4a7aa5a.jpg"
      ],
      "datePublished": "2025-12-25T16:13:01.000Z",
      "dateModified": "2025-12-25T16:13:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US discovers a million more possible Jeffrey Epstein files",
    "url": "https://www.bbc.com/news/articles/czdgz84dn35o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4fff/live/714a9180-e0ff-11f0-aeaa-01aad3a08dd8.jpg",
    "tag": "Trending",
    "date": "2025-12-24T22:55:25.000Z",
    "description": "US authorities have discovered more than a million more documents potentially related to the late paedophile Jeffrey Epstein that they plan to release",
    "body": "US authorities have discovered more than a million more documents potentially related to the late paedophile Jeffrey Epstein that they plan to release in the coming days and weeks, officials say.The FBI and federal prosecutors in New York informed the Department of Justice (DoJ) of the discovery.\"We have lawyers working around the clock to review and make the legally required redactions to protect victims, and we will release the documents as soon as possible,\" the DoJ said on Wednesday.The department said it could take \"a few more weeks\" before all the files are released. The DoJ has been under scrutiny after not releasing all Epstein files by 19 December, the deadline mandated under a new law.The agency said it would \"continue to fully comply with federal law and President Trump's direction to release the files\". The statement did not specify how the FBI and the US Attorney for the Southern District of New York came across the additional material. Epstein had been facing charges of sex trafficking minors in the state when he died awaiting trial in a New York prison. The news comes after the justice department released thousands of documents - some heavily redacted - related to their investigations into Epstein. The department has been releasing the documents in batches and top officials have said hundreds of thousands of documents still are to be released. Who and what are in the Epstein files?Who was Jeffrey Epstein? The disgraced financier with powerful associatesTrump trips, a fake video and 10 possible co-conspirators: Takeaways from new Epstein filesThe files were released after Congress passed the Epstein Files Transparency Act - signed into law by US President Donald Trump - that ordered the agency to share all the documents with the public while protecting victims' identities. Many of the released documents, which include videos, photos, emails and investigative documents, have heavy redactions, including names of people the FBI appears to cite as possible co-conspirators in the Epstein case.The justice department has faced criticism from lawmakers on both sides of the aisle over the amount of redactions, which the law permits only to protect victims' identities and active criminal investigations. In a post on X after the discovery of the additional documents was announced, the top Democrat on the House Oversight Committee, a congressional panel that has been investigating the Epstein saga, accused the White House of “illegally” withholding the files.“Every day we see lies, incompetence, missed deadlines, and illegal redactions,” Representative Robert Garcia said in a statement. The law passed by Congress and signed last month by Trump states that names and information that might be embarrassing or cause \"reputational harm\" are not allowed to be redacted. It specifically asks the DoJ for internal communications and memos detailing who was investigated and decisions on whether \"to charge, not charge, investigate, or decline to investigate Epstein or his associates\".Included in the documents are emails appearing to be exchanged between FBI personnel in 2019 that mention 10 possible \"co-conspirators\" of Epstein.The emails said six of the group had been served with subpoenas. This included three in Florida, one in Boston, one in New York City, and one in Connecticut.Possible co-conspirators in Epstein's crimes are a major focus for his victims, and for several lawmakers who have demanded more transparency from the justice department.Previous releases of Epstein documents have included revelations that reverberated across the Atlantic. Andrew and Epstein is the story that will not go awayAndrew stripped of 'prince' title and will move out of Royal LodgePeter Mandelson: Rise and fall of Labour's political fixerPeter Mandelson was sacked as the UK's ambassador to the US after details emerged about his friendship with the convicted paedophile, and that he told Epstein \"I think the world of you\", the day before Epstein began his sentence for soliciting prostitution from a minor in June 2008.Lord Mandelson said in a letter to staff that \"I deeply regret\" the circumstances of his departure from the British embassy in Washington DC. He said being ambassador had been \"the privilege of my life\" and he continued \"to feel utterly awful about my association with Epstein twenty years ago and the plight of his victims\".In October, Andrew Mountbatten-Windsor lost his prince title and was asked to leave his Windsor mansion, Royal Lodge, following prolonged scrutiny over his links to Epstein. In the latest release of files on Tuesday, a 2001 email sent by a person identified as \"A\" from \"Balmoral\" to Epstein's accomplice and close associate Ghislaine Maxwell - who was sentenced to 20 years in prison in 2022 for sex trafficking of minors and other offences- asks: \"Have you found me some new inappropriate friends?\"The BBC has contacted Andrew's team for a response. He has repeatedly denied wrongdoing, and said he did not \"see, witness or suspect any behaviour of the sort that subsequently led to his [Epstein's] arrest and conviction\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US discovers a million more possible Jeffrey Epstein files",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4fff/live/714a9180-e0ff-11f0-aeaa-01aad3a08dd8.jpg"
      ],
      "datePublished": "2025-12-24T22:55:25.000Z",
      "dateModified": "2025-12-24T22:55:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]