[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Radical with Amol Rajan - Can Donald Trump Be Compared To Julius Caesar? (Your Radical Questions with Tom Holland) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mpbrwl?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mpd8bx.jpg",
    "tag": "Trending",
    "date": "2026-01-05T06:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·05 Jan 2026,·21 minsAvailable for over a yearHistorian and The Rest Is History co-host Tom Holland answers your questions about whether Britain is currently in a more precarious state than it was in the 1970s, what definition of ‘radical’ best describes him and if he will ever score a century playing cricket.\nHe also explains why American presidents are often compared to Julius Caesar and faces a question he’s never heard before.\nGET IN TOUCH\n* WhatsApp: 0330 123 9480\n* Email: radical@bbc.co.uk\nEpisodes of Radical with Amol Rajan are released every Thursday and you can also watch them on BBC iPlayer: https://www.bbc.co.uk/iplayer/episodes/m002f1d0/radical-with-amol-rajan\nAmol Rajan is a presenter of the Today programme on BBC Radio 4. He is also the host of University Challenge on BBC One. Before that, Amol was media editor at the BBC and editor at The Independent.\nRadical with Amol Rajan is a Today Podcast. It was made by Lewis Vickers with Anna Budd. Digital production was by Gabriel Purcell-Davis and Joe Wilkinson. Technical production was by Mike Regaard. The editor is Sam Bonham. The executive producer is Owenna Griffiths.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radical with Amol Rajan - Can Donald Trump Be Compared To Julius Caesar? (Your Radical Questions with Tom Holland) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mpd8bx.jpg"
      ],
      "datePublished": "2026-01-05T06:00:00.000Z",
      "dateModified": "2026-01-05T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Everything We Know About The Minneapolis ICE Shooting…So Far - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0msylv4?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-08T20:12:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·08 Jan 2026,·28 mins,·Everything We Know About The Minneapolis ICE Shooting…So FarNewscastAvailable for over a yearProtests are taking place in Minneapolis after a woman was fatally shot by a US ICE agent.\nAccounts of what exactly happened are conflicting, with the Trump Administration citing self-defence whilst law makers in the city and state of Minnesota are calling it a brazen act of force.\nAdam is joined by BBC North America correspondent, Anthony Zurcher, and BBC North America reporter, Madeline Halpert, who is on the ground and at the scene in Minneapolis.\nIn studio is BBC business editor Simon Jack, who got the scoop on the government’s latest change of heart about business rates for English pubs.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Shiler Mahmoudi and Chloe Scannapieco. The social producer was Beth Pritchard. The technical producer was Rohan Madison. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Everything We Know About The Minneapolis ICE Shooting…So Far - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-08T20:12:00.000Z",
      "dateModified": "2026-01-08T20:12:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Philippines: One dead, 38 missing after massive landfill collapses in Cebu",
    "url": "https://www.bbc.com/news/articles/c17zqz5pprwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9591/live/2be118f0-ed0f-11f0-ad80-d7f736b055b6.jpg",
    "tag": "Trending",
    "date": "2026-01-09T04:22:38.000Z",
    "description": "A mountain of rubbish collapsed at a landfill in the central Philippines on Thursday, killing a 22-year-old woman and leaving 38 people missing, athor",
    "body": "A mountain of rubbish collapsed at a landfill in the central Philippines on Thursday, killing a 22-year-old woman and leaving 38 people missing, athorities said.Rescuers pulled 12 injured sanitation workers from debris at the Binaliw Landfill in Cebu City, who were later hospitalised.Many of the victims are believed to be workers at the landfill. The cause of the collapse is still unclear.Some 300 people from various government agencies and civilian groups have been deployed to the privately-owned landfill. Several excavators, ambulances and fire trucks are also seen on site.\"All response teams remain fully engaged in search and retrieval efforts to locate the remaining missing persons,\" Cebu Mayor Nestor Archival said in a Facebook post on Friday.Cebu City councillor Joel Garganera said the incident may have happened suddenly, but was likely a result of poor waste management practices.Operators had been cutting into the mountain, mining the soil, and then piling garbage to form another mountain of waste, Garganera told local newspaper The Freeman.\"It's not a sanitary landfill. It's already an open dumpsite,\" he said.Landfills are common in major Philippine cities like Cebu, which is the trading centre and transportation gateway of the Visayas, the archipelago nation's central islands.The Binaliw landfill is about 10 hectares (25 acres).",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Philippines: One dead, 38 missing after massive landfill collapses in Cebu",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9591/live/2be118f0-ed0f-11f0-ad80-d7f736b055b6.jpg"
      ],
      "datePublished": "2026-01-09T04:22:38.000Z",
      "dateModified": "2026-01-09T04:22:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC News quiz of the week: Which sport helped Timothée Chalamet win a Best Actor award?",
    "url": "https://www.bbc.com/news/articles/c74w3qx4j5no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3328/live/716fc2a0-ecb9-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-08T18:45:01.000Z",
    "description": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationHealthCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch L",
    "body": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationHealthCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch Live14 hours agoThis week, the US shocked the world by seizing Venezuelan leader Nicolás Maduro in a raid on his home, high street retailer Claire's financial troubles continued, and actress Ashley Tisdale spoke out against \"toxic mom groups\".But how much attention did you pay to what else happened in the world over the past seven days?Quiz collated by Ben Fell.Fancy some more? Test your memory of 2025 with our quiz of the year, try last week's quiz, or have a go at something from the archives.FilmUnited States",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC News quiz of the week: Which sport helped Timothée Chalamet win a Best Actor award?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3328/live/716fc2a0-ecb9-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-08T18:45:01.000Z",
      "dateModified": "2026-01-08T18:45:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New Zealand: Six whales die after mass stranding on remote beach",
    "url": "https://www.bbc.com/news/articles/c24g1lgqrvpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6b90/live/73104a10-ecf7-11f0-b453-e103e8d25de7.jpg",
    "tag": "Trending",
    "date": "2026-01-09T01:25:33.000Z",
    "description": "Six whales have died on a remote beach in New Zealand's South Island following a mass stranding and volunteers are racing against time to get 15 other",
    "body": "Six whales have died on a remote beach in New Zealand's South Island following a mass stranding and volunteers are racing against time to get 15 others that are still alive back to the sea.Some 55 pilot whales washed up on Farewell Spit on Thursday. While most managed to make their way back out to sea, 15 have restranded and are now spread along about 1km (0.6mi) of the beach.A video from Project Jonah, a non-profit working with marine mammals, showed volunteers pouring buckets of water on the whales to keep them cool.\"When the tide comes in, we're going to have to move really quickly to bring these whales together, then move them out to deeper waters,\" said Louisa Hawkes from Project Jonah.Pilot whales are highly social animals and have a natural instinct to look out for one another. Volunteers hope to bring the 15 stranded whales together in a \"nice tight group\" to help them refamiliarise with one another and swim out together, Hawkes said.They will attempt to refloat the whales this afternoon, but time is tight. \"We have to do all of that before the tide turns and drops again,\" Hawkes said.The group is calling for volunteers to help with the refloating.New Zealand's conservation department has deployed rangers, a boat and a drone to Farewell Spit to monitor any further strandings.Mass strandings regularly occur at Farewell Spit, located on the northern-most tip of the South Island. The conservation department describes it as a \"naturally occurring 'whale trap'\" located along a migratory route for long-finned whales.\"Whales may be easily deceived and caught out by the gently sloping tidal flats and a rapidly falling tide,\" it said in a statement on Thursday.In February 2017, more than 400 long-finned pilot whales washed up there – the largest stranding in New Zealand for more than 100 years.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New Zealand: Six whales die after mass stranding on remote beach",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6b90/live/73104a10-ecf7-11f0-b453-e103e8d25de7.jpg"
      ],
      "datePublished": "2026-01-09T01:25:33.000Z",
      "dateModified": "2026-01-09T01:25:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Saunas and winter swim plans for Hampstead Heath",
    "url": "https://www.bbc.com/news/articles/c5yx97w5vydo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a980/live/b2a2f310-ecb3-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-09T06:19:11.000Z",
    "description": "2 hours agoBen LynchLocal Democracy Reporting ServiceHampstead Heath's Mixed Pond could soon welcome swimmers year-round, as the City of London Corpor",
    "body": "2 hours agoBen LynchLocal Democracy Reporting ServiceHampstead Heath's Mixed Pond could soon welcome swimmers year-round, as the City of London Corporation considers extending its season in response to the rising popularity of open water swimming.The Mixed Pond is one of three bathing ponds on the Heath, alongside Kenwood Ladies' Pond and Highgate Men's Pond.A review by the corporation is also considering plans to improve changing room facilities and the installation of saunas across the ponds.Chair of the City of London Corporation's Hampstead Heath, Highgate Wood and Queen's Park Committee, Alderman Gregory Jones KC, said the review had been proposed due to the \"increasing popularity of open water swimming\".While the Ladies' and Men's ponds are open all year round, the Mixed Pond is only available for use by the public from April to October. Jones said that during the winter \"only members of the Hampstead Heath Winter Swimming Club can use the pond, by long-standing arrangement\".The review will look at bringing the pond into line with Parliament Hill Lido, Kenwood Ladies' Pond and Highgate Men's Pond.A draft five-year business plan, which has been drawn up by the corporation, has proposed several changes to the swimming spots, according to the Local Democracy Reporting Service.These also include fitting temperature sensors that can be viewed online, and the installation of water aeration systems.The plan is due to go before the Hampstead Heath Consultative Committee next week for discussion with approval expected at a separate committee meeting in early February.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Saunas and winter swim plans for Hampstead Heath",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a980/live/b2a2f310-ecb3-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-09T06:19:11.000Z",
      "dateModified": "2026-01-09T06:19:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ofcom urged to use 'banning' powers over X AI deepfakes",
    "url": "https://www.bbc.com/news/articles/ckgjzknepvzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/309e/live/0888ccc0-ecee-11f0-a272-7ba2cc2ad754.jpg",
    "tag": "Trending",
    "date": "2026-01-09T06:00:44.000Z",
    "description": "2 hours agoFaisal IslamEconomics editorThe government has urged the regulator Ofcom to use all its powers – up to and including an effective ban – aga",
    "body": "2 hours agoFaisal IslamEconomics editorThe government has urged the regulator Ofcom to use all its powers – up to and including an effective ban – against X over concerns about unlawful AI images created on the site.Ofcom's powers include the ability to obtain a court order to prevent third parties from helping the Elon Musk-owned platform from raising money or from being accessed in the UK.This follows an ongoing backlash against the use of X's AI Grok to digitally remove clothing from images of people.The possibility there could be sexualised images of children raised very specific concerns in government.Addressing concerns over sexualised images of adults and children produced by Grok, Prime Minister Sir Keir Starmer said: \"This is disgraceful. It's disgusting. And it's not to be tolerated… Ofcom has our full support to take action in relation to this.\"\"It's unlawful. We're not going to tolerate it. I've asked for all options to be on the table,\" he added in an interview with Greatest Hits Radio.Government sources told BBC News: \"We would expect Ofcom to use all powers at its disposal in regard to Grok & X.\"Ofcom's powers under the Online Safety Act have been rarely used, but include a \"very strong\" ability to ask the High Court to effectively ban offending companies by preventing their access to technology and to funding through advertisers and other payments.That process normally requires an investigation, but can be short-circuited where there are serious harms, risks to children, and histories of non-compliance.A new Ofcom chair is also in the process of being recruited. They will be expected to take a much more robust approach to these matters amid newer concerns about internet safety and national security, arising from new technology and types of ownership.The Online Safety Act is also at the centre of some concerns from the Trump administration about the impact on US tech firms.On Monday, Ofcom said it had made \"urgent contact\" with X and xAI, which built Grok, and told the BBC it was investigating concerns.It is currently illegal to share deepfakes of adults in the UK.In an earlier statement, X said: \"Anyone using or prompting Grok to make illegal content will suffer the same consequences as if they upload illegal content.\"With additional reporting from Laura Cress and Chris Vallance",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ofcom urged to use 'banning' powers over X AI deepfakes",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/309e/live/0888ccc0-ecee-11f0-a272-7ba2cc2ad754.jpg"
      ],
      "datePublished": "2026-01-09T06:00:44.000Z",
      "dateModified": "2026-01-09T06:00:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Peers back calls for more time to debate assisted dying bill",
    "url": "https://www.bbc.com/news/articles/c4gr08x0erxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fdbf/live/9a589f50-eccf-11f0-a921-b5325c652f4b.jpg",
    "tag": "Trending",
    "date": "2026-01-08T21:08:10.000Z",
    "description": "11 hours agoBecky MortonPolitical reporterPeers have backed calls for extra time for the House of Lords to debate the assisted dying bill.The proposal",
    "body": "11 hours agoBecky MortonPolitical reporterPeers have backed calls for extra time for the House of Lords to debate the assisted dying bill.The proposal was put forward by supporters, who are increasingly concerned it could run out of time to pass all its parliamentary stages.However, some opponents argued the bill was unsafe and suggested even more time to debate the legislation could not transform it.It has been approved by MPs but must also pass the Lords before early May, when the current session of Parliament is expected to end, to become law.There will now be private negotiations between peers over when and how much extra time should be granted.Extending debates already scheduled on Fridays is one likely option but sitting later would anger some Jewish peers because the weekly religious Shabbat ceremony begins at sunset.Peers have already been given 10 extra sessions to debate the legislation but with more than 1,000 amendments proposed there is a risk it will not pass all its parliamentary stages in time.Supporters of assisted dying have raised concerns that the number of amendments put forward - which experts believe is a record for a bill proposed by a backbench MP - is a delaying tactic aimed at blocking the bill from becoming law.Opponents insist they are not obstructing the bill but believe significant changes are needed to make it safe and to protect vulnerable people.The legislation proposes allowing terminally ill adults in England and Wales with fewer than six months to live to apply for an assisted death, subject to certain safeguards.Lord Falconer, who is leading the bill's passage through the upper chamber, put forward the proposal for extra time to allow peers to consider the legislation.Speaking during a debate on the motion, which passed without a vote, he warned that if peers failed to reach a conclusion \"it would significantly damage the reputation\" of the House of Lords.Former Lord Justice of Appeal Baroness Butler-Sloss also warned the reputation of the House was \"at stake\"Supporting the proposals for more time, she told peers: \"I don't like the Bill, but we have it, and we have to deal with it.\"However, Conservative peer Lord Shinkwin, who has rare brittle bone disease osteogenesis imperfecta, argued that peers had already \"been generous with our time\".\"We can only ever work with what we have been given, the volume of amendments, and the time taken to consider them, therefore, reflect the quality or lack thereof of the bill that was sent to us,\" he said.\"If any bill is so poorly drafted and so unsafe, surely the question is not so much whether the bill deserves more time as whether yet more time could transform it.\"A source close to peers concerned about the bill said: \"Supporters of assisted dying seem determined to keep complaining about the process in the Lords rather than engaging with significant failings in the bill.\"They added that the motion was not accompanied by \"any acknowledgement of the scale of the problems identified by Lords committees and external experts or of what amendments Lord Falconer is willing to accept to address those problems\".The government's chief whip in the Lords, Lord Kennedy, said he would look to hold \"urgent discussions\" early next week \"to seek to find a way forward to deliver on what the House has just agreed\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Peers back calls for more time to debate assisted dying bill",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fdbf/live/9a589f50-eccf-11f0-a921-b5325c652f4b.jpg"
      ],
      "datePublished": "2026-01-08T21:08:10.000Z",
      "dateModified": "2026-01-08T21:08:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Minnesota officials say FBI blocked access to ICE shooting investigation",
    "url": "https://www.bbc.com/news/articles/c99knmrx71go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/886e/live/1fa1ba80-ecd4-11f0-9d35-971c224e6291.jpg",
    "tag": "Trending",
    "date": "2026-01-08T23:01:45.000Z",
    "description": "9 hours agoMadeline HalpertMinneapolisEloise Alanna/BBCFlowers have been left at the scene of the shooting in tribute to Renee GoodMinnesota officials",
    "body": "9 hours agoMadeline HalpertMinneapolisEloise Alanna/BBCFlowers have been left at the scene of the shooting in tribute to Renee GoodMinnesota officials say the FBI has blocked their access to an investigation into the fatal shooting of a woman by a US Immigration and Customs Enforcement (ICE) agent.People have taken to the streets of Minneapolis to protest the killing of 37-year-old Renee Nicole Good, who died on Wednesday after being shot in her car.Minnesota Governor Tim Walz has accused the Trump administration of blocking state officials from involvement in the case, but the US vice-president said the investigation is a federal issue.Officials have offered differing accounts of the incident, with the Trump administration claiming the ICE agent was acting in self defence, while local officials say the woman posed no danger.Homeland Security Secretary Kristi Noem has claimed the ICE agent shot Good multiple times because she was trying to run over the officer in her car. The US Federal Bureau of Investigation said it would investigate the incident. Minnesota's Bureau of Criminal Apprehension (BCA) said the FBI had initially agreed to a joint investigation with state officials but then reversed course and denied the state access to materials and evidence. Without the ability to access all the necessary case materials and evidence, the BCA has \"reluctantly withdrawn\" from the investigation, the BCA's superintendent Drew Evans said in a statement.Watch: Politicians divided on Minneapolis shootingSpeaking at a news conference on Thursday, Walz said he was worried the federal government would not be able to carry out an unbiased investigation. \"It feels now that Minnesota has been taken out of the investigation,\" Walz said. \"It feels very, very difficult that we will get a fair outcome.\"Vice President JD Vance told reporters on Thursday that the investigation into the shooting was a federal issue, arguing it would go against precedent for a local official to be involved in prosecuting the case. Videos of the incident show ICE agents approaching a car which is in the middle of the street, and tell the woman behind the wheel to get out of the SUV. One of the agents tugs at the driver's side door handle.As the vehicle attempts to drive off, one of the agents points their gun at the driver and several shots are heard.The car then continues to drive away from the officer and crashes into the side of the street. At the scene of the crash on Thursday, blood from the shooting could still be seen in the snow. People set up a vigil at the site to honour Good, lining the bank with candles and roses. Hundreds of demonstrators showed up throughout the day, shouting insults at ICE and offering their neighbours coffee on the cold winter day. Susie Hawyard, a minister, said she went to the scene of the shooting as soon as she heard the news to verify \"with my own eyes\" what happened. Eloise Alanna/BBCMembers of the community have been gathering to pay their respects to Good\"I was horrified,\" she said. \"I saw the car, I saw Renee's car, I saw Renee's blood.\" Protesters also gathered at a federal building in Minneapolis early Thursday morning, where they were met with armed officers. The protests remained largely peaceful there, as residents expressed their anger over the killing of Good. \"They cannot get away with killing someone. There has to be consequences for actions,\" said Gavin, one of dozens of people outside the federal building. Those who knew Good said she was a poet and guitarist who had just moved to the city of Minneapolis. Her mother, Donna Ganger, told the Minnesota Star Tribune that her daughter was \"probably terrified\" during the confrontation with officers that saw her fatally shot. \"She was extremely compassionate,\" Ganger told the daily newspaper. \"She's taken care of people all her life. She was loving, forgiving and affectionate. She was an amazing human being.\"Even those who did not know Good said they were touched by her death. \"Renee was everything that was good about our community,\" said Nimco Ahmad, a Somali immigrant who grew up just blocks from the incident. Ahmad said she and others were gathered to help ensure justice would be secured for Good.Eloise Alanna/BBCNimco Ahmad said the shooting has shaken up the welcoming community of MinneapolisThe exclusion of state authorities from the probe into Good's killing is likely to undermine public trust, said Edward Maguire, a criminology professor at Arizona State University. \"From a criminological perspective, jurisdictional claims in cases like this are often less about legal requirements and more about political efforts to control the investigation and shape its outcome,\" he said. But the state could still file criminal charges later against the federal officer who killed Good, said Bryna Godar, a staff attorney with the State Democracy Research Initiative at the University of Wisconsin Law School.With additional reporting from Grace GoodwinFollow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weekly US Politics Unspun newsletter. Readers in the UK can sign up here. Those outside the UK can sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Minnesota officials say FBI blocked access to ICE shooting investigation",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/886e/live/1fa1ba80-ecd4-11f0-9d35-971c224e6291.jpg"
      ],
      "datePublished": "2026-01-08T23:01:45.000Z",
      "dateModified": "2026-01-08T23:01:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Two people wounded in shooting involving federal agents in Portland",
    "url": "https://www.bbc.com/news/articles/ckgn1y1zygxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c03b/live/c4d2bdd0-ecfa-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-09T02:51:30.000Z",
    "description": "Two people have been wounded in a shooting involving US federal agents in Portland, Oregon, say officials.The city's police department said in a state",
    "body": "Two people have been wounded in a shooting involving US federal agents in Portland, Oregon, say officials.The city's police department said in a statement that a man and woman had been taken to hospital and their conditions were unknown. The Department of Homeland Security (DHS) said the incident happened at 14:19 local time (22:19 GMT) with the traffic stop of a Venezuelan gang member, who \"attempted to run over\" agents with his car.The incident comes a day after a federal agent fatally shot a woman in Minneapolis, triggering protests around the US against federal law enforcement operations in US cities.\"The passenger of the vehicle and target is a Venezuelan illegal alien affiliated with the transnational Tren de Aragua prostitution ring and involved in a recent shooting in Portland,\" DHS said in a statement posted on X.\"When agents identified themselves to the vehicle occupants, the driver weaponized his vehicle and attempted to run over the law enforcement agents.\"Fearing for his life and safety, an agent fired a defensive shot. The driver drove off with the passenger, fleeing the scene.\"Portland Police said in their own statement that their officers were not involved in the incident, and were called after receiving reports of a shooting. The two people who were shot have not been identified, and police say they were discovered several blocks from the scene of the shooting.\"Officers applied a tourniquet and summoned emergency medical personnel,\" before they were taken to hospital, the statement said, adding that \"their conditions are unknown\".US media has cited police sources as saying the man and woman who were shot were a married couple. Portland District Attorney Nathan Vasquez, speaking from the scene of the shooting, told reporters he was there \"to monitor, to assist, and to make sure that there's a thorough and complete investigation\".He pledged to ensure \"that evidence is fully preserved and that - we're certainly hoping - that we can get all of the facts about what transpired here today\".His comments come after officials in Minnesota announced that the FBI would not include local investigators in their probe of the death on Wednesday of Renee Nicole Good, who was shot after officers alleged she attempted to run over agents. \"We are still in the early stages of this incident,\" said Portland Police Chief Bob Day on Thursday.\"We understand the heightened emotion and tension many are feeling in the wake of the shooting in Minneapolis, but I am asking the community to remain calm as we work to learn more.\"He told a news conference later the investigation into the incident in the Hazelwood neighbourhood was being led by the FBI.Portland Mayor Keith Wilson, a Democrat, called on Immigration and Customs Enforcement (ICE) to halt all operations in the city pending the investigation.\"We know what the federal government says happened here,\" he said. \"There was a time when we could take them at their word. That time is long past.\"He added: \"The administration is trying to divide us, to pit communities against each other. Portland, this is a moment to hold each other close.\"Portland has been the site of large anti-Trump protests in the past. On Wednesday night, Portland police arrested one protester who was charged with menacing after officers found him allegedly threatening another person with a knife.Lew Frederick, a Democratic state senator, told the BBC that local officials must be involved in the investigation into Thursday's shooting otherwise \"the community isn't going to trust that those results aren't impartial\".\"It's been clear for many weeks that there has been tensions increasing, and tense situations on the street,\" he said, referring to ongoing protests in the city against the Trump administration.\"And unfortunately, I do think, the, the resulting tragedy that occurred was foreseeable.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two people wounded in shooting involving federal agents in Portland",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c03b/live/c4d2bdd0-ecfa-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-09T02:51:30.000Z",
      "dateModified": "2026-01-09T02:51:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'Pub tax U-turn' and 'caring Catherine'",
    "url": "https://www.bbc.com/news/articles/cm24dznk16go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d7dd/live/d67942b0-ecf1-11f0-b385-5f48925de19a.png",
    "tag": "Trending",
    "date": "2026-01-09T05:44:26.000Z",
    "description": "3 hours agoBBC\"Cheers!\" to \"another 'too late' U-turn from PM\", declares the Daily Express after the \"watering down\" of pub business rate rises. \"Sir ",
    "body": "3 hours agoBBC\"Cheers!\" to \"another 'too late' U-turn from PM\", declares the Daily Express after the \"watering down\" of pub business rate rises. \"Sir Keir starts the year by flip-flopping again,\" it adds. Also on its front, \"caring Catherine\" as the Princess of Wales made a surprise visit to Charing Cross Hospital to celebrate \"the worth of NHS heroes\".The Daily Mail echoes the Express with \"pub U-turn's too little too late\", describing that the climbdown on tax hikes for pubs is \"humiliating\" for Labour. The move has been signalled by ministers, the paper says, and comes six weeks after the Chancellor Rachel Reeves unveiled the initial rate rises in her Budget.The Daily Telegraph also headlines on how Reeves is \"to climb down on pub tax\" in the latest in a \"series of about turns\" including changes to the inheritance tax \"raid\" on farmers and on winter fuel payments, it adds. In Iran, the internet has been shut down \"as protests mount\". The Princess of Wales is snapped again at Charing Cross Hospital, where she recalled her experience of chemotherapy and described the \"kindness\" of NHS workers.The Independent also marks \"yet another U-turn\" in its lead story. It seconds the Mail's take that this is a \"humiliating reversal\". Also on the front page, the \"violent clashes in Minneapolis after ICE agent shoots dead a mother\" that the federal agency \"claim 'weaponised her car'.\"The Times leads with \"top defence chief warns of need for extra £28bn\". Under pressure to get forces ready for \"possible war with Russia\", the paper says defence chiefs are at the same time \"preparing to make huge cuts to the military\". It also reports that Equalities Minister Bridget Phillipson has delayed guidance on single-sex spaces due to \"cost fears\". \"Send writ like Beckham\" leads the Sun, as the paper reports that the famous family's eldest son Brooklyn has told his parents they can only contact him via lawyers. An \"extraordinary\" letter also instructed ex-Spice Girl Victoria Beckham and her footballer husband David Beckham \"not to 'tag' him on social media\", according to the paper.The Daily Mirror says there is anger in Clacton, constituency of Reform UK leader Nigel Farage. The MP was \"blasted for ignoring his day job after jetting to the Abu Dhabi Grand Prix\" and has been dubbed \"freeloader Farage\" by the paper as it asks \"where's Wally?\"The Guardian reports that 34 school contemporaries of Farage have accused the Reform UK leader of \"racist behaviour\". On Wednesday, the Reform UK leader told Times Radio he acknowledged \"aggressive banter\" but said claims that he had told one fellow pupil to \"go back to Africa\" and made gas hissing noises at a Jewish pupil were \"complete fantasy land\".The i Paper headlines on \"Putin's shadow fleet\", saying there have been at least 50 \"zombie\" tankers sailing in UK waters in the past three days. Now it reports ministers see the North Atlantic as part of the front line against the Russian president's war effort and have pledged to use \"hard power\".A photo of federal agents fighting with protesters in the US is splashed across the Financial Times after the fatal shooting in Saint Paul, Minnesota \"sparks clashes\". Also on its front, the \"push to reset EU ties excludes financial services\". The City of London \"shuns\" the \"closer alignment\", it reports.Metro chastises an Albanian burglar for posing with stolen cash and watches, writing \"wad a wally... he'll do time\". The selfies have led to \"years in jail\" for the group that undertook \"at least 44 raids on mansions in a seven-month spree\".It is \"cloak and daggers\" for the Daily Star as it reports that the traitors are \"at war\". The paper also marks the death of footballer Terry Yorath, leading with BBC Sport presenter Gabby Logan's words that \"to us Terry was just dad\".The government's climbdown on business rates for pubs features on several front pages - with The Daily Mail calling it \"too little too late\". The paper says hospitality bosses think the move is \"just not enough\". The Daily Express has a similiar sentiment, saying \"cheers! It's yet another u-turn\". It says the prime minister has \"flip-flopped again\".The Daily Telegraph quotes the reaction of the Labour MP it says led a rebellion against the rate hike. Emma Lewell says she's \"deeply sorry\" to pub owners who've had to close their doors, and people who've lost their jobs. Speaking to The Times, sources \"close to the chancellor\" deny she was forced into a U-turn. The paper says the Treasury wanted to \"cushion the blow\" for pubs.Elsewhere on its front page, The Times says Britain's most senior military chief has warned that the Ministry of Defence faces a £28bn shortfall over the next four years - even if the government increases core defence spending to 3.5% of GDP by 2035. The paper quotes a military source as saying some \"big ticket items\" must be cut. The MoD says the defence budget is \"rising to record levels\".The Guardian leads on further allegations that the Reform UK leader Nigel Farage used racist language while at school in South East London. Nigel Farage has previously said he \"never directly racially abused anybody\" and has called the claims \"made up fantasies\".The i Paper says at least 50 ships, suspected to be part of Russia's shadow fleet, have been recorded in British waters in the past three days. It quotes an ally of the prime minister as saying the UK is ready to use \"hard power\" against Moscow. Downing Street has said it's preparing to undertake operations against the shadow fleet.And Catherine, Princess of Wales features on several front pages, including the Mirror and the Express, after she made an unannounced visit to Charing Cross hospital in central London. She spoke about her experience of chemotherapy. Catherine is quoted by the Sun as saying the \"kindness\" of NHS staff helped her during treatment.Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'Pub tax U-turn' and 'caring Catherine'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d7dd/live/d67942b0-ecf1-11f0-b385-5f48925de19a.png"
      ],
      "datePublished": "2026-01-09T05:44:26.000Z",
      "dateModified": "2026-01-09T05:44:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hajar Abdelkader: Wildcard serves 20 doubles faults and loses match in 37 minutes",
    "url": "https://www.bbc.com/sport/tennis/articles/cx2gr00ndmyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/775d/live/2589b140-ecb2-11f0-9d80-bdb3e01a6d27.png",
    "tag": "Trending",
    "date": "2026-01-08T16:28:22.000Z",
    "description": "Tournament chiefs admit errors over viral wildcard Image source, ITFImage caption, Hajar Abdelkader's biography on the ITF website says she started pl",
    "body": "Tournament chiefs admit errors over viral wildcard Image source, ITFImage caption, Hajar Abdelkader's biography on the ITF website says she started playing tennis at the age of 14ByStewart MacleanBBC News, in NairobiThe organisers of a professional women's tournament which has gone viral on social media because of a wildcard player's dire performance have acknowledged she should not have been allowed to play.Egyptian Hajar Abdelkader, 21, lost 6-0 6-0 and served 20 double faults during the first-round match in Nairobi on Wednesday, with the footage leaving many viewers wondering if she had ever played tennis before.The amateur player won only three points during her 37-minute debut - two double faults by opponent Lorena Schaedel and an unforced error from the bemused German, ranked 1,026th in the world.The match was part of an International Tennis Federation (ITF) W35 tournament, hosted by Tennis Kenya, the governing body for the sport in Kenya.Tennis Kenya said it had reached out to both Abdelkader and Schaedel to offer its support \"given the extent and nature of coverage of this match\". Tennis Kenya said Abdelkader had applied to enter the tournament as a wildcard and had been given a space at the last minute following the withdrawal of another player.The organisation said she was permitted to enter to maintain a balance of players and nations represented in the tournament, but said that in hindsight she should not have been allowed to play.\"The federation has taken note of this experience and will ensure that such an extremely rare occurrence never happens again,\" the organisation added. \"Tennis Kenya remains committed to fairness, transparency and the integrity of competition, as well as to the continued development of tennis in Kenya, East Africa, and across Africa.\" The Egyptian Tennis Federation confirmed to the BBC Abdelkader has never been registered as an Egyptian player and had not been entered into the tournament on Egypt's behalf.Egyptian Tennis Federation technical director Dia Nabil Loutfy said: \"We would like to clarify that she is not registered with the Egyptian Tennis Federation, nor is she included in any of our official player lists.\"Based on the information available to us, the player was previously residing in Kenya and participated in the ITF tournament in Nairobi through a wildcard granted by the Kenyan Tennis Federation.\"The Egyptian Tennis Federation had no role whatsoever, whether directly or indirectly, in the nomination, approval, or issuance of this wildcard, and we were not involved in the player's entry into the tournament in any capacity.\"The organisation said it had no records relating to Abdelkader, and said she had never been affiliated with the Egyptian Tennis Federation.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hajar Abdelkader: Wildcard serves 20 doubles faults and loses match in 37 minutes",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/775d/live/2589b140-ecb2-11f0-9d80-bdb3e01a6d27.png"
      ],
      "datePublished": "2026-01-08T16:28:22.000Z",
      "dateModified": "2026-01-08T16:28:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "School pool barricaded as repairs contract ends with work unfinished",
    "url": "https://www.bbc.com/news/articles/cx2y009pr50o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/15d1/live/d214b840-ecbe-11f0-b5f7-49f0357294ff.jpg",
    "tag": "Trending",
    "date": "2026-01-09T00:01:20.000Z",
    "description": "Pupils left shivering during exams as PFI contract ends with school repairs unfinished8 hours agoBranwen Jeffreys,education editorandHope Rhodes,educa",
    "body": "Pupils left shivering during exams as PFI contract ends with school repairs unfinished8 hours agoBranwen Jeffreys,education editorandHope Rhodes,education producer Ann Gannon / BBCAt Trentham Academy, a large secondary school in Stoke-on-Trent, the swimming pool is barricaded with danger signs, while the heating system has remained broken during recent mock exams.\"It was hard to concentrate,\" student Esme says. \"I couldn't stop myself from shivering while I was trying to breathe and to calm myself down while I was trying to do the exam.\"This is one of 88 schools in the area that were maintained as part of a Private Finance Initiative (PFI) contract, signed by the city council 25 years ago.These contracts pay private companies to maintain buildings in return for being allowed to generate profits.The contract in Stoke-on-Trent is one of the largest of around 660 similar contracts across the UK, most of which were signed under a previous Labour government, and is among the first to come to an end.Ann Gannon / BBCBut a BBC investigation in February last year revealed concerns the Stoke-on-Trent contract would run out before vital school repairs were completed.The end of these contracts is crucial, because if buildings are not handed back in good condition, public money has to pick up the bill. In the years before the contract finished, the BBC understands work costing between £24m and £30m was identified, not all of which was done in time.Shortly after the contract ended in October, Transform Schools (Stoke) Ltd (TSSL) - the PFI company - went into liquidation, leaving building repairs unfinished, contractors unpaid, and the city council left picking up the pieces. Just months earlier, TSSL had agreed to \"extend its obligations\", but that became irrelevant because of the insolvency.Earlier in the year, as concern grew, Stoke-on-Trent City Council said it would set aside £3.5m to ensure schools were left \"safe, warm and dry\".But the BBC has also heard allegations that work slowed down markedly in the final year of the contract, with repair jobs marked as closed without problems being fixed.The BBC spent a day seeing some of the problems first-hand at Trentham and other academies in the same trust.'Hands shaking'On the day the BBC visited Trentham, teenagers preparing for their science GCSEs were bundled up in layers of clothes, some wearing coats.The school has reported problems with the heating system repeatedly, but some classrooms still rely on small electric heaters for warmth.\"You can't write,\" pupil Sam said. \"You can't hold the pencil properly.\"\"It's simply so cold and no one wants to work,\" classmate Kai added.If classrooms become too cold, the school has to send pupils home to learn remotely.Ann Gannon / BBCPupils have previously been sent home because of the broken heatingThe school pool was previously used by local primaries for swimming lessons, but remains closed after first shutting in 2022 due to leaks and structural issues.When Trentham bid for government funding for building work, it was turned down on the grounds the PFI contract was meant to put everything right by October 2025.But Sharon Bates, from the school trust, says jobs were \"stacking up\" in the final year of the contract, despite repeated requests for repairs.The schools involved had been paying a regular fee to TSSL as part of the contract to manage any issues with their buildings and facilities.Equans, a large sub-contractor working for TSSL, ran the contract helpdesk, and told us TSSL insisted on signing off work costing more than £250, meaning schools had to repeatedly chase jobs that had been marked as completed.Even small repairs were caught up in the process, including a water issue with a sink at Smallthorne Primary School, which was first reported in May 2025 but remained unfixed by the end of the contract in October.The BBC has seen evidence the issue was logged under multiple job numbers, and understands a repair was not signed off by TSSL.Down the road, Mill Hill Primary School had roof repairs completed in May by a different company for TSSL and by October was still reporting leaks, with little information about what work had been done.Ann Gannon / BBCThe pool at Trentham was first closed in 2022 and was still empty when the BBC visited the schoolInformation released to the BBC a year ago by the government revealed surveys of the 88 schools in 2021 and 2024 warned their condition was graded \"amber/red\", meaning major work was needed.Despite Stoke-on-Trent City Council promising \"safe, warm and dry\" schools and saying an agreement was being reached, on 20 November the council wrote to the schools in the contract warning that TSSL was going into Creditors Voluntary Liquidation, meaning the agreement no longer applied.The council said it had worked hard to manage the end of the PFI contract over several years and had withheld a further £8m from TSSL to ensure work would be completed, on top of the £3.5m from unspent capital funds.It is not clear how much of the money set aside by the council has already been spent, or how great the remaining bill will be to repair Stoke-on-Trent's schools.In a statement, the council said it was working to reach agreement with schools on what needed to be done.\"We want to reassure schools and parents that we absolutely intend to complete the remaining works,\" a spokesperson said.Ann Gannon / BBCParts of the Trentham school building have had to be cordoned off or boarded upCouncil chief executive Jon Rouse robustly defended the management of the contract, which he described as a \"difficult hand\" weighted towards the private sector.He said there was a \"moral and ethical\" obligation to sort it out, adding that \"we know what remains undone and needs to be put right\".Rouse told the BBC he \"would have preferred if those profits had been spent on Stoke-on-Trent's schools\", but conceded that making money was part of the contract.Subcontractor Equans told the BBC it had successfully completed £6.2m worth of handback repairs, and was still owed £5m by TSSL, which it was pursuing through the liquidation process.The saga has left many wanting answers. Carl Ward, chief executive of City Learning Trust - which includes Trentham and four other academies left with multiple building issues - said it was \"hugely frustrating\" that work wasn't completed before the contract ended.Half of the schools in the contract, all academies, had been withholding payments as concerns about unfinished work escalated.Privately, three other academy chief executives have shared concerns and evidence with the BBC about unfinished work and the legacy for schools in Stoke-on-Trent.Ann Gannon / BBCCarl Ward said \"hundreds of pieces of work\" needed doing in each impacted schoolQuestions remain about why work seemingly slowed down towards the end of the contract, and how much profit was made over the 25 years.That question is harder to answer than it may seem because of complex company structures.TSSL was in a group of companies that ultimately belongs to Innisfree, one of the largest infrastructure investment companies in the UK with a big share of PFI projects, which has included 260 schools.The founder and chief executive of Innisfree, David Metter, has been a staunch advocate of the value for public money in PFI contracts, telling MPs in 2011 that, overall, \"UK plc is getting an excellent deal\".BBC analysis of public accounts suggests Metter, or companies owned and controlled by him or his family, appear to have made at least £130m in dividends from PFI investments in schools, hospitals and other infrastructure projects. It's not possible to say how much came from the Stoke-on-Trent contract.The BBC first wrote to Metter and his company Innisfree Ltd in December, and made a number of attempts to contact him.The BBC understands Innisfree was asked if it would put money back into the Stoke-on-Trent PFI company, TSSL, having drawn significant dividends out over the years, and the company declined.A spokesperson for Innisfree said: \"We have no comment other than to say that on Stoke schools these matters are subject to commercial contract.\"The directors of the now liquidated TSSL, based at Innisfree, have not replied to the concerns raised by our investigation.When approached by the BBC in February 2025, TSSL said it was \"unaware of widespread issues with quality\" and considered that schools had been \"maintained in accordance with the contract\".Subcontractor Equans said it had \"focused on fulfilling our role with a consistently high standard of service\" throughout the contract, adding that it \"conducted a responsible and well-managed close of our contracted works\".Concerns about the end of these PFI contacts have been longstanding.In 2021, the public accounts committee of MPs said academy schools, responsible for their own buildings, might be left having to fund outstanding repairs.PFI investors, they added, could pay higher dividends and \"walk away with limited threat of recourse\".Additional reporting by Ben King",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "School pool barricaded as repairs contract ends with work unfinished",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/15d1/live/d214b840-ecbe-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-09T00:01:20.000Z",
      "dateModified": "2026-01-09T00:01:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Huge anti-government protests in Tehran and other Iranian cities, videos show",
    "url": "https://www.bbc.com/news/articles/cg7y0579lp8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/42b0/live/e740c480-ed30-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-09T00:51:43.000Z",
    "description": "7 hours agoDavid GrittenWatch: Protests break out in Iran's capital city TehranHuge crowds of protesters have been marching through Iran's capital and",
    "body": "7 hours agoDavid GrittenWatch: Protests break out in Iran's capital city TehranHuge crowds of protesters have been marching through Iran's capital and other cities, videos show, in what is said to be the largest show of force by opponents of the clerical establishment in years.The peaceful demonstrations in Tehran and the second city of Mashhad on Thursday evening, which were not dispersed by security forces, can be seen in footage verified by BBC Persian.Later, a monitoring group reported a nationwide internet blackout.Protesters can be heard in the footage calling for the overthrow of Iran's Supreme Leader Ayatollah Ali Khamenei and the return of Reza Pahlavi, the exiled son of the late former shah, who had urged his supporters to take to the streets.It was the 12th consecutive day of unrest that has been sparked by anger over the collapse of the Iranian currency and has spread to more than 100 cities and towns across all 31 of Iran's provinces, according to human rights groups.The US-based Human Rights Activist News Agency (HRANA) has said at least 34 protesters - five of them children - and eight security personnel have been killed, and that 2,270 other protesters have been arrested.Norway-based monitor Iran Human Rights (IHR) has said at least 45 protesters, including eight children, have been killed by security forces.BBC Persian has confirmed the deaths and identities of 22 people, while Iranian authorities have reported the deaths of six security personnel.On Thursday evening, videos posted on social media and verified by BBC Persian showed a large crowd of protesters moving along a major road in Mashhad, in the country's north-east.Chants of \"Long live the shah\" and \"This is the final battle! Pahlavi will return\" can be heard. And at one point, several men are seen climbing on an overpass and removing what appears to be surveillance cameras attached to it.Another video posted online showed a large crowd of protesters walking along a major road in eastern Tehran. In footage sent to BBC Persian from the north of the capital, another large crowd is heard chanting \"This is the final battle! Pahlavi will return\". Elsewhere in the north, protesters were filmed shouting \"Dishonourable\" and \"Don't be afraid, we are all together\" following a clash with security forces. Middle East Images / AFP via Getty ImagesProtests were also reported in several other provinces, including Kermanshah - pictured here on ThursdayOther videos showed protesters chanting \"Death to the dictator\" - a reference to Khamenei - in the central city of Isfahan; \"Long live the shah\" in the northern city of Babol, and \"Don't be afraid, we are all together\" in the north-western city of Tabriz.In the western city of Dezful, footage sent to BBC Persian showed a large crowd of protesters and also security personnel appearing to open fire from a central square. The evening protests came not long after Reza Pahlavi, whose father was overthrown by the 1979 Islamic revolution and lives in Washington DC, had called on Iranians to \"take to the streets and, as a united front, shout your demands\".In a post on X, Pahlavi said \"millions of Iranians demanded their freedom tonight\", describing the protesters as his \"courageous compatriots\".He thanked US President Donald Trump for holding the \"regime to account\", and called on European leaders to do the same.Pahlavi has also called for protests to continue from 20:00 local time (16:30 GMT) on Friday night.Iranian state media downplayed the scale of Thursday's unrest. In some cases, they denied protests had taken place altogether, posting videos of empty streets.Meanwhile, internet watchdog NetBlocks said its metrics showed that Iran was \"in the midst of a nationwide internet blackout\".\"The incident follows a series of escalating digital censorship measures targeting protests across the country and hinders the public's right to communicate at a critical moment,\" it warned, referring to previous losses of connectivity in several cities.Earlier in the day, footage from Lomar, a small town in the western province of Ilam, showed a crowd chanting \"Cannons, tanks, fireworks, mullahs must go\" - a reference to the clerical establishment. Another showed people throwing papers into the air outside a bank that appeared to have been broken into.Other videos showed many shuttered shops in a number of predominantly Kurdish cities and towns in Ilam, as well as Kermanshah and Lorestan provinces.It followed a call for a general strike by exiled Kurdish opposition groups in response to the deadly crackdown on protests in the region.At least 17 protesters have been killed by security forces in Ilam, Kermanshah and Lorestan during the unrest, and many of them have been members of the Kurdish or Lor ethnic minorities, according to Kurdish human rights group Hengaw.On Wednesday, there were violent clashes between protesters and security forces in several cities and towns in western Iran, as well as other regions.IHR said it had been the deadliest day of the unrest, with 13 protesters confirmed to have been killed across the country.\"The evidence shows that the scope of crackdown is becoming more violent and more extensive every day,\" said the group's director, Mahmood Amiry-Moghaddam.Hengaw said two protesters were shot dead by security forces in Khoshk-e Bijar, in the northern province of Gilan, on Wednesday night.Iran's semi-official news agency Fars, which is close to the Revolutionary Guards, reported that three police officers were also killed on Wednesday. It said two were shot dead by armed individuals among a group of \"rioters\" in the south-western town of Lordegan, and the third was stabbed to death \"during efforts to control unrest\" in Malard country, west of Tehran.XIn videos from Mashhad, protesters can be heard chanting \"Long live the shah\"On Thursday, US President Donald Trump reiterated his threat to intervene militarily if Iranian authorities killed protesters.\"I have let them know that if they start killing people, which they tend to do during their riots - they have lots of riots - if they do it, we are going to hit them very hard,\" he said in an interview with the Hugh Hewitt Show.Separately, the US treasury secretary, Scott Bessent, said the Iranian economy was \"on the ropes\".While speaking at the Economic Club of Minnesota on Thursday, he added: \"[President Trump] does not want them to harm more of the protesters. This is a tense moment.\" Iranian President Masoud Pezeshkian earlier called on security forces to exercise \"utmost restraint\" when handling peaceful protests. \"Any violent or coercive behaviour should be avoided,\" a statement said.Khamenei - who has ultimate power in Iran - said on Saturday that authorities should \"speak with the protesters\" but that \"rioters should be put in their place\".The protests began on 28 December, when shopkeepers took to the streets of Tehran to express their anger at another sharp fall in the value of the Iranian currency, the rial, against the US dollar on the open market.The rial has sunk to a record low over the past year and inflation has soared to 40% as sanctions over Iran's nuclear programme squeeze an economy also weakened by government mismanagement and corruption.University students soon joined the protests and they began spreading to other cities, with crowds frequently heard chanting slogans critical of the clerical establishment.In messages sent to the BBC, via a UK-based activist, a woman in Tehran said despair was driving the protests.\"We're living in limbo,\" she said. \"I feel like I'm hanging in the air with neither wings to migrate nor hope to pursue my goals here. Life here has become unbearable.\"Another said she was protesting because her dreams had been \"stolen\" by the clerical establishment and she wanted it to know that \"we still have a voice to shout, a fist to punch them in the face.\"A woman in the western city of Ilam said she knew of young people from families affiliated with the establishment who were taking part in protests. \"My friend and her three sisters, whose father is a well-known figure in the intelligence services, are joining without their father knowing,\" she said.The protests have been the most widespread since an uprising in 2022 sparked by the death in custody of Mahsa Amini, a young Kurdish woman who was detained by morality police for allegedly not wearing her hijab properly. More than 550 people were killed and 20,000 detained by security forces over several months, according to human rights groups.The biggest protests since the Islamic revolution took place in 2009, when millions of Iranians took to the streets of major cities after a disputed presidential election. Dozens of opposition supporters killed and thousands were detained in the ensuing crackdown.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Huge anti-government protests in Tehran and other Iranian cities, videos show",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/42b0/live/e740c480-ed30-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-09T00:51:43.000Z",
      "dateModified": "2026-01-09T00:51:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]