[
  {
    "title": "The Global Story - The cost of USAID cuts to women in Afghanistan - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct719b?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mb7yc6.jpg",
    "tag": "Trending",
    "date": "2025-10-23T09:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·23 Oct 2025,·26 minsAvailable for over a yearSince the Taliban takeover in 2021, the US has contributed billions of dollars in aid to Afghanistan for food and medical care – a lifeline in a country ravaged by two decades of war. \nBut earlier this year, following deep cuts to USAID under the Trump administration, more than 400 USAID-backed medical clinics have closed, and for pregnant women in desperate need of care, the impacts are devastating. \nThe BBC’s South Asia and Afghanistan correspondent, Yogita Limaye, tells us about the families she met on her recent reporting trip, and the lives lost because women did not get the care they needed. \nProducer: Hannah Moore \nMix: Travis Evans \nSenior news editor: China Collins\nPicture: Taliban bans female medical education, Afghan female doctors and midwives face setback, Kabul, Afghanistan, 24 Dec 2024. Samiullah Popal/EPA-EFE/REX/ShutterstockProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Global Story - The cost of USAID cuts to women in Afghanistan - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mb7yc6.jpg"
      ],
      "datePublished": "2025-10-23T09:00:00.000Z",
      "dateModified": "2025-10-23T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-10-23T07:46:57.000Z",
    "description": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and p",
    "body": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-10-23T07:46:57.000Z",
      "dateModified": "2025-10-23T07:46:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Why Are Survivors Quitting The Grooming Gangs Inquiry? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mb5t6y?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-10-22T19:27:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·22 Oct 2025,·35 minsWhy Are Survivors Quitting The Grooming Gangs Inquiry?NewscastAvailable for over a yearToday, concerns are growing over the government’s handling of the set up of a national inquiry into grooming gangs. Two potential candidates to chair the inquiry have withdrawn their names from the process and four survivors have quit the panel assisting it. \nAdam and Chris are joined by special correspondent Judith Moritz to discuss why this has become such a challenge for the government.\nPlus, economics editor Faisal Islam explains why the price of orange juice has risen by 134% in the last 5 years and what it tells us about today’s inflation figures. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Shiler Mahmoudi and Adriana Urbano. The social producer was Sophie Millward. The technical producers were James Piper and Johnny Hall. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Why Are Survivors Quitting The Grooming Gangs Inquiry? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-10-22T19:27:00.000Z",
      "dateModified": "2025-10-22T19:27:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon apologises to customers impacted by huge AWS outage",
    "url": "https://www.bbc.com/news/articles/cvgvnp77dy9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8a36/live/2846df60-afff-11f0-af36-791af27228b8.jpg",
    "tag": "Trending",
    "date": "2025-10-23T12:08:51.000Z",
    "description": "4 hours agoLiv McMahonTechnology reporterAmazon Web Services (AWS) has apologised to customers impacted by Monday's massive outage, after it knocked s",
    "body": "4 hours agoLiv McMahonTechnology reporterAmazon Web Services (AWS) has apologised to customers impacted by Monday's massive outage, after it knocked some of the world's largest platforms offline.Snapchat, Reddit and Lloyds Bank were among more than 1,000 sites and services reported to have gone down as a result of issues at the heart of the cloud computing giant's operations in North Virginia, US on 20 October.In a detailed summary of what caused the outage, Amazon said it occurred as a result of errors which meant its internal systems could not connect websites with the IP addresses computers use to find them.\"We apologise for the impact this event caused our customers,\" the company said.\"We know how critical our services are to our customers, their applications and end users, and their businesses.\"We know this event impacted many customers in significant ways.\"While many platforms such as the online games Roblox and Fortnite were back up and running within a few hours of the outage, some services experienced prolonged downtime.This included Lloyds Bank, with some customers experiencing issues until mid-afternoon, as well as US payments app Venmo and social media site Reddit.What caused the AWS outage - and why did it make the internet fall apart?The outage had a far-reaching impact - even reportedly disrupting the sleep of some smart bed owners.Eight Sleep, which makes sleep \"pods\" with temperature and elevation options requiring an internet connection, said it would work to \"outage-proof\" its mattresses after some overheated and even got stuck in an inclined position.Many experts said the outage showed how reliant tech is on Amazon's dominance in the cloud computing sector, as a market largely cornered by AWS and Microsoft Azure.The company said it would also \"do everything we can\" to learn from the event and improve its availability.In its lengthy summary of Monday's outage, Amazon said it came down to an issue in US-EAST-1 - its largest cluster of data centres which power much of the internet.Critical processes in the region's database which stores and manages the Domain Name System (DNS) records, allowing website URLs to be understood by computers, effectively fell out of sync.According to Amazon, this triggered a \"latent race condition\" - or in other words unearthed a dormant bug that could occur in an unlikely sequence of events.The delay in one process, which Amazon said occurred in the early hours of Monday morning, had a knock-on effect which caused its systems to stop working properly.Much of this process is automated, meaning it is done without human involvement.Dr Junade Ali, a software engineer and fellow at the Institute for Engineering and Technology, told the BBC \"faulty automation\" had been at the core of Amazon's problems.\"The specific technical reason is a faulty automation broke the internal 'address book' systems in that region rely upon,\" he said.\"So they couldn't find one of the other key systems.\"Like others, Dr Ali believes it highlights the need for companies to be more resilient and diversify their cloud service providers \"so they can fail over to other data centres and providers when one isn't available\". \"In this instance, those who had a single point of failure in this Amazon region were susceptible to being taken offline,\" he said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon apologises to customers impacted by huge AWS outage",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8a36/live/2846df60-afff-11f0-af36-791af27228b8.jpg"
      ],
      "datePublished": "2025-10-23T12:08:51.000Z",
      "dateModified": "2025-10-23T12:08:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Doctors to strike in November after talks break down",
    "url": "https://www.bbc.com/news/articles/clyk5zr7p71o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5777/live/4b798ae0-b00f-11f0-8317-a7963fdcfd4f.jpg",
    "tag": "Trending",
    "date": "2025-10-23T13:26:07.000Z",
    "description": "2 hours agoNick TriggleHealth correspondentThe British Medical Association has announced a fresh round of strikes in England after talks broke down ag",
    "body": "2 hours agoNick TriggleHealth correspondentThe British Medical Association has announced a fresh round of strikes in England after talks broke down again with the government.The union and government have been in dialogue throughout the summer and early autumn since the last walkout at the end of July.But the BMA said with no progress being made there would be a five-day walkout by resident doctors, the new name for junior doctors, starting on Friday 14 November.This will be the 13th strike in the long-running pay dispute since March 2023 and is expected to cause significant disruption, particularly in hospitals.Resident doctors represent nearly half the medical workforce and range from doctors fresh out of university through to those with up to a decade of experience.They will walk out of both emergency and routine care with senior doctors brought in to provide cover.While the NHS attempted to keep as many routine services running as possible during the last strike, thousands of operations and appointments still had to be postponed.Dr Jack Fletcher, chair of the BMA's resident doctors committee, said: \"This is not where we wanted to be. \"We talked with the government in good faith. We hoped the government would see that our asks are not just reasonable, but are in the best interests of the public and our patients and would also help stop our doctors leaving the NHS.\"While we want to get a deal done, the government seemingly, does not, leaving us with little option but to call for strike action.\"Health Secretary West Streeting has maintained throughout this year that he would not negotiate on pay after resident doctors had received pay rises totalling nearly 30% in the past three years.The talks, therefore, had centred on career progression, working conditions and out-of-pocket expenses like exam fees.The union argues that, despite the pay rises, resident doctors' pay is still a fifth lower than it was in 2008, once inflation is taken into account.They have also said they wanted the government to address what they say is a shortage of jobs after the second year of training when resident doctors move into speciality training.This year there were more than 30,000 applicants for 10,000 jobs at this stage, although some will have been doctors from abroad.Health Secretary Wes Streeting called the announcement \"preposterous\".\"The BMA are walking away from an offer to improve resident doctors' working conditions and create more specialty training roles to progress their careers. The BMA are blocking a better deal for doctors.\"These unreasonable and unnecessary strikes do not have the public's support.\"The BMA's reckless posturing will harm patients, leave other doctors and NHS staff to pick up the pieces and divert resources away from rebuilding the NHS.\"Rory Deighton, of the NHS Confederation, which represents health leaders, said he was \"bitterly disappointed\" talks had broken down again - and urged the BMA to get back to the negotiating table.\"We now have to prepare to mitigate the disruption of more strikes at the same time as they are getting ready for what is likely to be another very difficult winter, while continuing to bear down on their elective waiting lists.\"Ultimately, despite the best efforts to plan and put contingencies in place, it is patients who bear the brunt of industrial action, with more cancelled appointments, tests and operations leaving people waiting longer for the care they need.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Doctors to strike in November after talks break down",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5777/live/4b798ae0-b00f-11f0-8317-a7963fdcfd4f.jpg"
      ],
      "datePublished": "2025-10-23T13:26:07.000Z",
      "dateModified": "2025-10-23T13:26:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Three held on suspicion of helping Russian intelligence",
    "url": "https://www.bbc.com/news/articles/c2lpzjvgrp8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5d76/live/25831cc0-b005-11f0-82b9-4927130e421a.jpg",
    "tag": "Trending",
    "date": "2025-10-23T12:49:33.000Z",
    "description": "Three men have been arrested in London on suspicion of assisting Russia's foreign intelligence service, the Metropolitan Police has said. The three, a",
    "body": "Three men have been arrested in London on suspicion of assisting Russia's foreign intelligence service, the Metropolitan Police has said. The three, aged 48, 45, and 44, were arrested at addresses in west and central London. Searches are ongoing at these and another address in west London.They were arrested on suspicion of assisting a foreign intelligence service, namely Russia, under section 3 of the National Security Act (NSA) 2023, as part of an ongoing investigation into alleged offences under the act led by counter-terrorism police.The arrests come as police work to clamp down on the increasing number of \"proxies\" being recruited by foreign intelligence services, the force said.Cdr Dominic Murphy, head of Counter Terrorism Policing London, said the Met was seeing an increasing number of these. \"Anyone who might be contacted by and tempted into carrying out criminal activity on behalf of a foreign state here in the UK should think again,\" he said. \"This kind of activity will be investigated and anyone found to be involved can expect to be prosecuted and there are potentially very serious consequences for those who are convicted.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Three held on suspicion of helping Russian intelligence",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5d76/live/25831cc0-b005-11f0-82b9-4927130e421a.jpg"
      ],
      "datePublished": "2025-10-23T12:49:33.000Z",
      "dateModified": "2025-10-23T12:49:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Soft Cell's musical force Dave Ball dies, aged 66",
    "url": "https://www.bbc.com/news/articles/ckg1rrzn1kwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ae9d/live/8b34bc20-b01b-11f0-8261-4d7901038185.jpg",
    "tag": "Trending",
    "date": "2025-10-23T13:16:22.000Z",
    "description": "3 hours agoMark SavageMusic correspondentPeter AshworthDave Ball formed Soft Cell with singer Marc Almond in Leeds in 1977In 1981, an unlikely group f",
    "body": "3 hours agoMark SavageMusic correspondentPeter AshworthDave Ball formed Soft Cell with singer Marc Almond in Leeds in 1977In 1981, an unlikely group from Leeds scored a number one hit with their icy cover version of an obscure 60s soul hit.With Tainted Love, Soft Cell set a template for 80s synth-pop duos: The flamboyant frontman paired with an unassuming keyboard technician.Dave Ball, who has died at the age of 66, was that musical force, creating ominous, polyphonic soundscapes to match Marc Almond's lyrics about X-rated movies and sado-masochism.Tainted Love sold more than 21 million copies over the worl and was followed by hits such as Say Hello, Wave Goodbye and Torch, before the band split in 1984. Reunited in the 2000s, they had completed a new album in the days before Ball's death.In a statement, the musician's family said he had died peacefully in his sleep at his home in London on Wednesday 22 October. It comes less than two months after Soft Cell played a headline show to 20,000 fans at the Rewind Festival in Henley-on-Thames.During that concert, Ball performed in a wheelchair, as he had for the last two years, following a spate of ill-health.\"I managed to damage myself quite a bit,\" he told the Yorkshire Post in 2023. \"I fractured lower vertebrae in my spine and cracked about five ribs and broke my wrist\". After catching pneumonia and developing sepsis, he was placed in an induced coma and remained in hospital for seven months.  However, he had been in \"a great place emotionally\" over the summer, as he worked on Soft Cell's new album, Danceteria, which is scheduled for release next year.The band were at the forefront of the synth-pop movement in the early 1980s\"He was focused and so happy with the new album that we literally completed only a few days ago,\" said Almond in a tribute. \"It's so sad as 2026 was all set to be such an uplifting year for him, and I take some solace from the fact that he heard the finished record and felt that it was a great piece of work.\"Almond has thanked his bandmate for \"being an immense part of my life and for the music you gave me\", adding: \"I wouldn't be where I am without you.\"Ball had also been part of the pioneering techno duo The Grid, who scored a UK top 10 hit in 1994 with the banjo-powered Swamp Thing.His bandmate from that era, Richard Norris, also paid tribute, remembering Ball's \"endless laughter\" and \"unwavering friendship\".\"Being in a duo with someone is different from being in a band, the bond is very tight,\" he added. \"That's how it was with us. We went through so many remarkable, extraordinary, life-affirming experiences together. Thank you, Dave.\"Mike OwenThe musician's death was announced shortly after Soft Cell completed a new albumBorn into a single-parent household in Chester in 1959, Ball was given up for adoption when he was 18 months old. He grew up in Blackpool with adoptive parents Donald and Brenda Ball, who changed his first name from Paul to David, alongside his younger sister Susan, who was also adopted.He met Almond at Leeds Polytechnic in 1977, where they were both studying art. Fuelled by a shared love of Northern Soul, they formed Soft Cell the same year, and quickly recorded an EP, which was given early airtime by Radio 1's John Peel.They were an unusual pairing: Ball was quietly hunched over his keyboard, while Almond was a flamboyant showman, all glitter and eye-liner; but they achieved a rare musical alchemy.Ball had developed a fascination with synthesizers after watching Kraftwerk appear on BBC science show Tomorrow's World, and began to marry dark electronica to the soaring melodies Almond was writing.Tainted Love became the UK's second biggest-selling single of 1981, shifting 21 million copies worldwide. Alongside hits by Gary Numan, Human League and Ultravox, it helped paved the way for the synth-pop sound of the 80s.The song was also included on their full-length debut, Non-Stop Erotic Cabaret, which spawned two further top five singles: Bedsitter and Say Hello, Wave Goodbye. They followed the album with the stand-alone single, Torch, which peaked at number two in 1982.Getty ImagesThe duo were working on new material right up until Ball's deathFame had its upsides. \"I loved being able to afford my first home, having money and travelling, which makes me sound like a Miss World,\" Ball recently told Classic Pop Magazine.But it also presented problems. \"Newfound wealth meant we could afford newfound drugs to relieve the boredom\" of media interviews and TV performances, Ball said.\"I know that's a cliché, but it's a cliché for a good reason, because it works for so many bands.\"Amidst the hedonistic lifestyle, the duo were also drifting apart, but they managed to create a second classic album - the wayward, tense and aptly-titled The Art Of Falling Apart.They released one more album, 1984's This Last Night In Sodom, before dissolving the band to concentrate on other projects.Almond went on to have a successful solo career, including the top 10 hit Something's Got A Hold Of My Heart; while Ball created The Grid, who mixed acid house with ambient pop over a long-lasting collaboration.Peter AshworthDave Ball was a pioneer of the 80s British synth-pop movementSoft Cell reunited in 2001, producing the Top 40 album Cruelty Without Beauty. After another hiatus, they reappeared in 2018, releasing the original singles Northern Lights and Guilty (Cos I Say You Are) before performing what was supposed to be a farewell show at the O2 Arena on 30 September, 2018.However, they remained together, recording their fifth album, Happiness Not Included, during the 2020 Covid lockdown.Ball recently described the band's new music as a tribute to the New York club scene they frequented while recording their first two albums.He added that his time in hospital had influenced the band's sound.\"I had strange recollections when I was in and out of hospital because I was on morphine,\" he told Classic Pop.\"The new songs are a digital reflection of the sounds in my head from that time.\"In parallel, it's about the times me and Marc got up to in the 80s.\"The final mixes were completed only days before Ball died. It is due for release in Spring 2026.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Soft Cell's musical force Dave Ball dies, aged 66",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ae9d/live/8b34bc20-b01b-11f0-8261-4d7901038185.jpg"
      ],
      "datePublished": "2025-10-23T13:16:22.000Z",
      "dateModified": "2025-10-23T13:16:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Government rejects calls for debate on Prince Andrew",
    "url": "https://www.bbc.com/news/articles/cpv1rr1znveo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3f02/live/3bf3d840-b01a-11f0-a6e4-031e2de4ddc5.jpg",
    "tag": "Trending",
    "date": "2025-10-23T15:31:08.000Z",
    "description": "45 minutes agoSam FrancisPolitical Reporter ReutersThe government has refused to give MPs time to debate Prince Andrew's titles or taxpayer-funded hom",
    "body": "45 minutes agoSam FrancisPolitical Reporter ReutersThe government has refused to give MPs time to debate Prince Andrew's titles or taxpayer-funded home, despite growing pressure for scrutiny.The decision effectively kills efforts to pass a law to strip Prince Andrew of his dukedom, only a day after ex-Labour MP Rachel Maskell tabled a bill in the Commons. Downing Street rejected suggestions that it was \"blocking\" debate, pointing our Prince Andrew agreed to no longer use his titles after Virginia Giuffre's memoir revived claims about his ties to paedophile Jeffrey Epstein.Sir Keir Starmer is facing Lib Dem calls for a select committee inquiry into the deal that let Prince Andrew live rent-free on the 30-room Royal Lodge for two decades.Journalists repeatedly asked the PM's official spokesperson if the government - which controls the Commons timetable - would give MPs time to debate Andrew's titles and financial affairs.The spokesperson said: \"We know that the Royal Family would not want to take time from other important issues.\"On the question of whether Andrew could be hauled before a select committee, they added: \"Any decision for committees to scrutinise developments are a matter for them.\"The chairman of the influential public accounts committee, Tory MP Sir Geoffrey Clifton-Brown, has said he is writing to the Crown Estate and the government in the coming days to \"seek further information on the lease arrangements for Royal Lodge\".Earlier this week, when asked if it would launch an inquiry, a spokesperson for the committee said its programme of inquiries was \"full up until the new year\".Sir Geoffrey says the committee will make a decision next year on whether to investigate the Royal Lodge, when the Crown Estate's next annual accounts have been published. Prince Andrew's ties to Epstein came under fresh scrutiny after Ms Giuffre's memoir Nobody's Girl revealed new details of her allegations against the pair. Prince Andrew, who reached a financial settlement with Ms Giuffre in 2022, has always denied the allegations.Ahead of the books publication, Prince Andrew announced he will be giving up his royal titles. Only legislation can formally remove his dukedom, which is now held in abeyance.Calls have also intensified for Andrew to give up his Royal Lodge home in Windsor Great Park after it emerged he paid a \"peppercorn rent\" for more than 20 years.Liberal Democrat Leader Sir Davey has called for Prince Andrew to be hauled in front of MPs to give evidence about his lease of Royal Lodge.There had been some confusion over whether a member of the Royal Family could be asked to give evidence in Parliament.Earlier on Thursday, Commons Speaker Sir Lindsay Hoyle said there was no ban on MPs discussing the conduct of a member of the Royal Family but it would have to be on a \"substantive motion\" rather than during regular question time sessions.The SNP had pressed Commons Leader Sir Alan Campbell to give MPs time to debate plans to remove Prince Andrew's title.Sir Alan said: \"The palace have been clear that they recognise that there are other matters that this House needs to be getting on with, and we are guided in this by the palace.\"That doesn't mean that the House can't find ways of debating these matters, whether it be the matter of titles, or whether it be a matter of the finances, which I know are under question here.\"Independent MP Rachel Maskell has attempted to change the law to allow the King to remove titles following a recommendation from Parliament or at the request of the title holder.\"The Duke of York title may no longer be being used by its holder, but it has not been removed,\" said the former Labour MP as she formally introduced her Removal of Titles Bill on Wednesday.As a private members' bill it would have stood very little chance of becoming law and the decision of the government not to give MPs debating time has effectively killed it.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Government rejects calls for debate on Prince Andrew",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3f02/live/3bf3d840-b01a-11f0-a6e4-031e2de4ddc5.jpg"
      ],
      "datePublished": "2025-10-23T15:31:08.000Z",
      "dateModified": "2025-10-23T15:31:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Caerphilly by-election polls open to choose Senedd member",
    "url": "https://www.bbc.com/news/articles/c993nlyrdglo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2be9/live/1a6b5720-b006-11f0-ba75-093eca1ac29b.jpg",
    "tag": "Trending",
    "date": "2025-10-23T06:02:38.000Z",
    "description": "Voters go to the polls in key Caerphilly by-election10 hours agoGetty ImagesPolls for the Caerphilly by-election are open from 07:00 BST until 22:00Vo",
    "body": "Voters go to the polls in key Caerphilly by-election10 hours agoGetty ImagesPolls for the Caerphilly by-election are open from 07:00 BST until 22:00Voters in Caerphilly are heading to the polls in a by-election to choose a new member of the Senedd.Polls are open from 07:00 until 22:00 BST, with the result expected early on Friday morning.The vote is taking place following the death of Labour's Hefin David, who died suddenly on 12 August aged 47 after being Member of the Senedd for Caerphilly since 2016.There are eight candidates standing, with all the main parties represented.The by-election will fill the vacancy until May 2026 when a Wales-wide election will decide the shape of the newly expanded Welsh Parliament.Unlike Westminster elections, 16 and 17-year-olds can vote in this election and ID is not required at polling stations.There will be full coverage of the result, reaction and analysis across BBC digital, television and radio services.The full list of candidates for the by-election is:Liberal Democrats: Steve AichelerGwlad: Anthony CookGreens: Gareth HughesConservatives: Gareth PotterReform: Llyr PowellUKIP: Roger QuilliamLabour: Richard TunnicliffePlaid Cymru: Lindsay WhittleMore top stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Caerphilly by-election polls open to choose Senedd member",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2be9/live/1a6b5720-b006-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-23T06:02:38.000Z",
      "dateModified": "2025-10-23T06:02:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "CQC chief resigns over maternity failings",
    "url": "https://www.bbc.com/news/articles/c4gp2wgzpp1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d1cc/live/f08e9f60-b001-11f0-af36-791af27228b8.jpg",
    "tag": "Trending",
    "date": "2025-10-23T10:46:55.000Z",
    "description": "5 hours agoMichael Buchanan,Social affairs correspondent and Divya Talwar,Investigations reporterBBCSir Julian Hartley's resignation comes days after ",
    "body": "5 hours agoMichael Buchanan,Social affairs correspondent and Divya Talwar,Investigations reporterBBCSir Julian Hartley's resignation comes days after an independent inquiry was announced into maternity care in LeedsSir Julian Hartley, chief executive of the Care Quality Commission which is the independent regulator of all health and adult social care services in England, has resigned. The announcement comes just days after an independent inquiry into maternity care at the Leeds Teaching Hospitals NHS Trust was announced.Mr Hartley had previously spent a decade leading the trust and said that in light of that inquiry, his role at the CQC, \"has become incompatible with the important conversations happening about care at Leeds.\"Some of the families who received poor maternity care had demanded his resignation.On Monday, the Health Secretary Wes Streeting announced an independent inquiry into \"repeated failures\" at the Leeds trust.  Mr Streeting said the investigation would examine what had \"gone so catastrophically wrong\" at the trust's maternity services at both Leeds General Infirmary and St James' University Hospital.  He said he was grateful for Sir Julian Hartley's efforts to improve the work of the Care Quality Commission.\"It is vital that trust in the regulator and its ratings is rebuilt for patients and staff, and I am determined the CQC becomes the robust and effective regulator patients deserve.\"Earlier this year, a BBC investigation revealed the deaths of at least 56 babies and two mothers over the past five years may have been prevented.  In a statement reacting to the inquiry's announcement, the trust said it was \"taking significant steps to address improvements.\"Several of the families who had campaigned for the inquiry had questioned Mr Hartley's role at the CQC given he had led the trust for 10 years, until 2023.  He was appointed chief executive of the hospital regulator last December having spent 21 months leading NHS Providers, a health service trade body.MARTIN MCQUADE / BBCAmarjit Kaur and Mandip Singh Matharoo's daughter Asees was stillborn in January 2024Amarjit Kaur and Mandip Singh Matharoo's daughter Asees was stillborn in January 2024 - a trust investigation found care issues which may have prevented her death. They welcomed Mr Hartley's resignation and questioned his original appointment.  \"The fact that he was head of Leeds teaching hospitals over such a large period of time, where maternity care was substandard should have raised alarm bells within the system to prevent him becoming Chief Executive of such a large regulator in the first instance,\" they said.A whistleblower at the trust, who has raised concerns about maternity, also said they were pleased he'd gone.  \"Its been dire for many years, including under his watch. Him being the head of CQC was a scandal when staff like us have been complaining to the regulator about unsafe care. Things need to change,\" she said.A statement from a broader group of bereaved and harmed Leeds families said that while they welcomed his resignation, \"we do not accept his apology.\"  Mr Hartley's CQC role, they added, \"has always been a scandal hiding in plain sight. Just as it has been down to bereaved families to prove the total failings of the CQC in their inspection processes and lack of regulatory action in Leeds, this now, again, has fallen onto families to highlight.\"Dan Ramm and Fiona Winser-Ramm's daughter Aliona, died in January 2020 at Leeds General Infirmary. An inquest found \"a number of gross failures\" that \"directly contributed\" to her death.In his statement, Sir Julian said he was \"sorry for the fact that some families suffered harm and loss during this time\" and vowed to cooperate with the inquiry \"so families can get the transparency and answers that they need and deserve.\"The chair of the CQC Professor Sir Mike Richards said that while Mr Hartley's resignation was \"a huge loss\" he understood that his previous job at Leeds \"may undermine trust and confidence in the CQC's regulation.\" On Monday, when the inquiry was announced, both Mr Richards and Wes Streeting said they had confidence in Sir Julian.A rapid review into maternity services in England is currently underway while the largest inquiry into maternity care in the history of the NHS, centred on services at the Nottingham University Hospitals NHS Trust, is due to report next summer.  The inquiry into care at Leeds is the fifth investigation into maternity services at a single NHS trust since 2013. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "CQC chief resigns over maternity failings",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d1cc/live/f08e9f60-b001-11f0-af36-791af27228b8.jpg"
      ],
      "datePublished": "2025-10-23T10:46:55.000Z",
      "dateModified": "2025-10-23T10:46:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rosenberg: Trump abandons carrot and wields stick over Putin in Ukraine talks",
    "url": "https://www.bbc.com/news/articles/cnve5532v7yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/becc/live/20d276e0-b00e-11f0-8317-a7963fdcfd4f.jpg",
    "tag": "Trending",
    "date": "2025-10-23T14:18:28.000Z",
    "description": "2 hours agoSteve RosenbergBBC Russia EditorSputnik/Alexander Kazakov/Pool via Reuters and ReutersOne week ago I had the distinct feeling it was Ground",
    "body": "2 hours agoSteve RosenbergBBC Russia EditorSputnik/Alexander Kazakov/Pool via Reuters and ReutersOne week ago I had the distinct feeling it was Groundhog Day, or as the Russians call it, Dyen Surka.Amid US threats to pressure Moscow - by supplying Tomahawk missiles to Ukraine - Vladimir Putin and President Donald Trump held a telephone call. The result: the announcement of a US-Russia summit in Budapest.Last August, amid threats of additional US sanctions against Russia, Putin met Trump's special envoy Steve Witkoff. The result: the announcement of a US-Russia summit in Alaska.Déjà vu.But Groundhog Day seems to be over.The Alaska meeting went ahead, with minimal preparation and little result.But the Budapest summit is off. It barely had time to be \"on\", to be fair. Now President Trump has cancelled it.\"It didn't feel like we were going to get to the place we have to get,\" the US president told reporters.And that's not all.Previously, Trump had not followed through on threats of more pressure on Russia, preferring carrots to sticks in his dealings with the Kremlin.For the moment he has put his carrots away. Instead he's imposed sanctions on two major Russian oil companies, Rosneft and Lukoil. That's unlikely to force a U-turn on the war from President Putin. But it's a sign of Trump's frustration with the Kremlin's unwillingness to make any compromise or concessions to end the fighting in Ukraine.Trump says Putin talks 'don't go anywhere' as he imposes new sanctionsWhat's the significance of US sanctions on Russian oil?The Russians don't take kindly to sticks.\"The USA is our enemy and their talkative 'peacemaker' has now fully set on the path to war with Russia,\" wrote former Russian President Dmitry Medvedev on social media. \"The decisions that have been taken are an act of war against Russia.\"Thursday morning's edition of the tabloid Moskovsky Komsomolets was slightly less dramatic, but obviously unflattering. The paper criticised \"the capriciousness and fickleness of [Russia's] main negotiating partner.\"So what's changed?Instead of rushing off to summit no.2, as he had done for summit no.1, this time around President Trump was slightly more cautious. He had asked Secretary of State Marco Rubio to lay the groundwork for the summit with the Russian foreign minister Sergei Lavrov; to make sure there was a point in decamping to Budapest.It soon became clear that there wasn't, and that a new summit now was unlikely to produce a breakthrough. Russia is fiercely opposed to Donald Trump's idea of freezing the current battle lines in Ukraine. The Kremlin is determined to take control, at the very least, of the entire Donbas region in eastern Ukraine. It has seized and occupied much of it. But President Volodymyr Zelensky is refusing to cede to Russia those parts of the Donbas that Ukraine still controls.ReutersMembers of Russia's National Guard patrol Red Square near St. Basil's Cathedral in central Moscow on 23 OctoberMoscow would have welcomed a second US-Russia summit. The first, in Alaska, was a diplomatic and political coup for the Kremlin. The red-carpet welcome in Anchorage for President Putin symbolised Russia's return to the international stage and the West's failure to isolate Moscow. Over the last week Russian state media have been savouring the idea of a summit with President Trump in Europe, but without the European Union at the table. Russian commentators portrayed the proposed meeting in Budapest as a slap in the face for Brussels.At the same time, few here seemed to believe that, even if it went ahead, the Budapest summit would produce the kind of result Moscow wanted. Some Russian newspapers have been calling for the Russian army to continue fighting.\"There isn't a single reason Moscow should agree to a ceasefire,\" declared Moskovsky Komsomolets yesterday.That doesn't mean the Kremlin doesn't want peace.It does. But only on its terms. And right now those are unacceptable to Kyiv and, it would appear, to Washington. Those terms involve more than just territory. Moscow is demanding that what it calls the \"root causes\" of the Ukraine war be addressed: an all-encompassing phrase with which Russia broaden its demands to include a halt to Nato enlargement eastwards. Moscow is also widely believed to retain the goal of forcing Ukraine back into Russia's orbit.Is Donald Trump ready to increase the pressure on Russia even more?Possibly.But it's also possible we may wake up one morning and find ourselves back in Groundhog Day.\"In the game of Trump tug-of-war, Russia is leading again,\" wrote Moskovsky Komsomolets after the Budapest summit had been announced. \"In the couple of weeks before the meeting in Budapest, Trump will be pulled in the opposite direction by telephone calls and visits from Europe. Then Putin will pull him back to our side again.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rosenberg: Trump abandons carrot and wields stick over Putin in Ukraine talks",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/becc/live/20d276e0-b00e-11f0-8317-a7963fdcfd4f.jpg"
      ],
      "datePublished": "2025-10-23T14:18:28.000Z",
      "dateModified": "2025-10-23T14:18:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Five grooming gang survivors back Jess Phillips to keep her job",
    "url": "https://www.bbc.com/news/articles/cvgwnqeq5z0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ca07/live/321d61b0-b01a-11f0-a6e4-031e2de4ddc5.png",
    "tag": "Trending",
    "date": "2025-10-23T15:37:13.000Z",
    "description": "22 minutes agoJennifer McKiernanPolitical reporterFive abuse survivors have written to prime minister Sir Keir Starmer to say they will only continue ",
    "body": "22 minutes agoJennifer McKiernanPolitical reporterFive abuse survivors have written to prime minister Sir Keir Starmer to say they will only continue working with the grooming gang inquiry if Safeguarding Minister Jess Phillips keeps her job.It comes after four different members of the survivors panel quit the inquiry and said they would only rejoin it if Phillips resigned. The survivors panel, thought to include about 16 women, is playing a central role in setting up the national inquiry into grooming gangs.But they are at odds over whether it should be expanded to cover other types of child sexual exploitation - and whether they can trust Phillips to lead the process of setting it up. The prime minister has repeatedly backed the minister.Sir Keir announced a national inquiry into the sexual exploitation of children by grooming gangs in England and Wales in June.The PM said the inquiry would have the power to compel witnesses to be questioned and would be guided by a panel of survivors, which the BBC understands had at least 20 members at the start.But there has been turmoil over the past week, with Fiona Goddard and Ellie Reynolds quitting the survivors panel in the inquiry on Monday, and two more known as \"Elizabeth\" and \"Jess\" following them on Tuesday and Wednesday this week.The issue was raised at Prime Minister's Questions on Wednesday, when Sir Keir invited the four who had quit to re-join and sought to reassure them that \"I want to get this right\", despite the difficulties when \"every survivor does bring their own painful experience to this\".\"The inquiry is not and will never be watered down. Its scope will not change. It will examine the ethnicity and religion of the offenders and we will find the right person to chair the inquiry,\" he told MPs.However, there was still palpable fury from the group, who penned a group letter calling for Phillips to resign because she had broken a fragile trust. Now, a second group of survivors, headed by Samantha Walker-Roberts, has written to Sir Keir and Home Secretary Shabana Mahmood with a list of seven conditions for their continued support, including Phillips continuing in her role.\"Jess Phillips has remained impartial to the process, only listening to feedback [and] we want her to remain in position for the duration of the process for consistency,\" they wrote. \"Her previous experience and drive to reduce VAWG [violence against women and girls] and her clear passion and commitment is important to us.\"They praised Phillips, who they said had \"devoted her life to hearing and amplifying the voices of women and girls who would otherwise have been unheard\" and had helped some of them access support. Earlier today, the first group called on Phillips to quit in order to restore trust in the inquiry, accusing her of \"betrayal\" for describing reports the scope of the inquiry could be widened as \"untrue\".Headed up by Fiona Goddard, the group of four said they would only re-join it if the minister went, because they had \"raised legitimate concerns around the inquiry's direction\" but \"in response, your safeguarding minister, Jess Phillips called our accounts untrue\".Another survivor, known as Carly, from Huddersfield, told the BBC she wanted to remain part of the inquiry, but she also believes Phillips should go, because \"she can't lie about what we all know\" around the question of whether to widen the inquiry's scope.There is disagreement  among survivors on whether the focus should be widened, which the BBC understands can be tracked back to an email sent to the panel by NWG, the charity tasked with organising it on behalf of the government.This email asked survivors if they wanted to keep the the inquiry focused on grooming gangs or if they would like it to be widened out.Ms Walker-Roberts' group of survivors stressed that this request had not come from Phillips.\"When asked directly in the feedback session, Jess was clear that the focus would be on grooming gangs,\" they wrote.\"However survivors in the group explained they would be excluded for not fitting the generalised stereotype of what that is and [the inquiry] should focus on CSE (child sexual exploitation].\"On how to reconcile the differences between the two groups of survivors, they suggested \"the panel should be smaller\" and there should be \"no re-entry to the panel after you have forfeited your position\".There is also an ongoing hunt for someone to chair the inquiry, after the only two candidates to be publicly named pulled out amid fear their previous work with the police and social workers could cause a conflict of interest.Annie Hudson - who has a background in social work - pulled out first, followed by former Northern Irish police chief Jim Gamble, who gave several interviews after withdrawing on Wednesday.Mr Gamble criticised \"political point-scoring\" for creating a \"toxic atmosphere\" around the inquiry and  stressed his \"track record of fierce independence\" as head of the Child Exploitation and Online Protection (CEOP) command.Sign up for our Politics Essential newsletter to read top political analysis, gain insight from across the UK and stay up to speed with the big moments. It'll be delivered straight to your inbox every weekday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Five grooming gang survivors back Jess Phillips to keep her job",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ca07/live/321d61b0-b01a-11f0-a6e4-031e2de4ddc5.png"
      ],
      "datePublished": "2025-10-23T15:37:13.000Z",
      "dateModified": "2025-10-23T15:37:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Met officers sacked for gross misconduct after BBC Panorama Charing Cross investigation",
    "url": "https://www.bbc.com/news/articles/cy0kynx59v0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bf36/live/72bdf240-b018-11f0-a6e4-031e2de4ddc5.jpg",
    "tag": "Trending",
    "date": "2025-10-23T15:50:08.000Z",
    "description": "19 minutes agoBruce Thain and Kathryn ArmstrongBBCTwo Metropolitan Police officers have been sacked for gross misconduct after appearing in an underco",
    "body": "19 minutes agoBruce Thain and Kathryn ArmstrongBBCTwo Metropolitan Police officers have been sacked for gross misconduct after appearing in an undercover report by BBC Panorama.Three allegations were upheld against PC Philip Neilson, including making \"highly racist and discriminatory remarks\" about different ethnic groups. Five allegations were upheld against PC Martin Borg, with the chair of the panel describing his conduct as a \"disgrace\". Both were dismissed with immediate effect. They are the first two of 10 current or former officers to face hearings as part of the Met's accelerated misconduct proceedings over footage recorded during the Panorama investigation. During the hearings in south-west London on Thursday, both Mr Neilson and Mr Borg denied being racist and disputed allegations of gross misconduct, but accepted the comments aired in the programme.Chair of the panel, Cdr Jason Prins, said of both officers: \"It was or must have been obvious to him that the comments made were abhorrent.\"Mr Neilson was recorded by the BBC referring to an \"invasion\" of \"scum\" from the Middle East, and made offensive comments about people from Algeria and Somalia. He was also observed saying a detainee who had overstayed his visa should have a \"bullet through his head\".The other allegations against Mr Neilson related to \"glorifying what he was describing as inappropriate use of force on a restrained detainee\" and for suggesting unlawful violence against migrants who broke the law. Cdr Jason Prins found all the allegations proven.The hearing was told that he did not dispute the words he said but argued they only amounted to just misconduct.Giving evidence, Mr Neilson said he had been a police officer for four years and denied he was a racist.He said he believed the undercover reporter \"breached his humans rights\" and it was the reporter who \"kept bringing up these conversations\" and \"egging me on\".Mr Neilson said he had eight or nine pints of Guinness while at the pub when he made some of the comments and said he was not a \"drinker\".He said he did not discriminate against anyone and footage from his body worn camera would show \"no matter the ethnicity I did everything with the utmost respect\".Cdr Prins ruled that Mr Neilson's comments caused \"significant harm\" to the reputation of Metropolitan Police and wider public confidence in the police and amounted to gross misconduct, describing the conduct of the officer as an \"utter disgrace\".The Met had previously said he had \"displayed extreme racial, violent and discriminatory views\", as well as a lack of \"respect, courtesy and professionalism\".PC Philip Neilson calls immigrants 'scum' in secret filmingPC Martin Borg, who worked out of Charing Cross Police station, was also dismissed on Thursday.An undercover BBC reporter recorded Mr Borg enthusiastically describing how he saw another officer stomp on a suspect's leg in custody.The officer was filmed laughing and saying he had offered to make a statement claiming the suspect had kicked the sergeant first. It is not clear from CCTV footage seen by the BBC whether that was the case.James Berry KC, bringing the case for the Met, said the Panorama programme showed Mr Borg \"revelled in the use of force on detainees\" and made a \"number of discriminatory remarks about Muslims\".PC Martin Borg described seeing a colleague stamp on a detaineeMr Borg denied he was a racist and all the allegations of gross misconduct against him, but admitted he made the comments in the programme and argued he had \"been groomed over a series of months to get the undercover report\".He faced a total of eight allegations, of which five were found proven as gross misconduct by the panel.Chair Cdr Jason Prins described Mr Borg's conduct as a \"disgrace\", adding: \"He alone was responsible for the comments and it was or must have been obvious to him his comments were abhorrent.\"The comments caused significant harm to the reputation of the Metropolitan Police and public confidence in policing more generally.\"Eight serving police officers, a former Met constable, and a police constable who moved from London to serve with Gloucestershire Police will undergo accelerated hearings, the Met previously confirmed.Mr Neilson and Mr Borg's hearings were two of three that are due to take place on Thursday. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Met officers sacked for gross misconduct after BBC Panorama Charing Cross investigation",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bf36/live/72bdf240-b018-11f0-a6e4-031e2de4ddc5.jpg"
      ],
      "datePublished": "2025-10-23T15:50:08.000Z",
      "dateModified": "2025-10-23T15:50:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I thought my insides were falling out: The condition affecting one in 12 mums",
    "url": "https://www.bbc.com/news/articles/ckgk0y18mrvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6dc0/live/9f5e02e0-af23-11f0-b9f9-e5c1839c872f.jpg",
    "tag": "Trending",
    "date": "2025-10-22T23:43:23.000Z",
    "description": "17 hours agoYasmin RufoBBC NewsHelen LedwickWhen Helen Ledwick typed \"why do my insides feel like they're falling out\" into Google a decade ago, she h",
    "body": "17 hours agoYasmin RufoBBC NewsHelen LedwickWhen Helen Ledwick typed \"why do my insides feel like they're falling out\" into Google a decade ago, she had no idea that search would mark the beginning of a life-changing journey.The former BBC 5 Live journalist and podcaster was experiencing pelvic organ prolapse - a condition that affects around one in twelve women after birth, but which many have never even heard of.Prolapse happens when one or more of the organs in the pelvis, such as the bladder, bowel or uterus, slip from their usual position and bulge into the vagina. It's not life-threatening, but it can have a profound impact on daily life, relationships and mental health.For Helen, the shock came just two weeks after a difficult birth with her second child.\"I stood up from the sofa and suddenly felt things shift,\" she recalls. \"It felt like when a tampon isn't sitting properly, you can feel something's not right.\"Confused and frightened, she grabbed a mirror and her phone to see what was happening.\"I'd never even heard the term prolapse before,\" she says, and since talking openly about it she's realised it's often a \"taboo\" subject despite being very common.Helen believes the shame and stigma surrounding it has led to a lack of awareness among women and health professionals - something she's now fighting to change.Helen LedwickHelen says her diagnosis, confirmed by a doctor, brought confusion and fear as she was \"hoping for an explanation, fix or some sense of urgency, instead I got a shrug of the shoulders.\"The initial advice she was given was to not do anything that could make it worse such as running, jumping or lifting.\"It kind of felt like the advice was don't live your life,\" she says.Perhaps more debilitating than the physical symptoms was the isolation Helen felt.\"You live with it in embarrassment, silence, shame and isolation,\" she explains. \"Because you don't talk about it, you think you're the only person in the world it's happened to.\"Helen initially ventured onto Instagram to seek support. Finding other people on the social platform who were similarly anxious and confused and in some cases too embarrassed to seek help prompted her to eventually launch a podcast and write a book, Why mums don't jump.Her goal was to create a platform for women to share stories and break the silence around pelvic health.\"I was angry because no-one ever talked about it. So I decided I would.\"I wanted to give women the knowledge that I'd found so hard to come by, and comfort in knowing they were not on their own.\"Pelvic organ prolapse: ‘Why did no one tell me this could happen?’Dr Nighat Arif, a women's health specialist, says Helen's experience is far from unique and issues can arise as symptoms aren't always obvious.\"Sometimes physically there isn't a lump to see, there's just a feeling of pressure and it might be in the lower back, at the front or slightly higher up near your belly button,\" she explains. \"The symptoms can also be more pronounced during sex which is again massively taboo.\"Prolapse can happen for a variety of reasons including childbirth, heavy lifting, being overweight or even after a hysterectomy. And in rare cases, it can affect men too.Pelvic floor exercises and lifestyle changes can help to improve symptoms, but sometimes medical treatment is needed such as vaginal pessaries or surgery.Gynaecologist Dr Christine Ekechi says women with prolapse may notice a swelling or a lump within their vagina \"as essentially what has happened is that we have weakening of the ligaments within the pelvic floor that can move for example the bladder\".Helen LedwickHelen says what began as a lonely Google search 15 years ago, has now become something far more powerful, helping women to recognise when there is a problem and seek help.In her case, recovery has been slow, but transformative.\"For me it's been a long process of building up slowly, doing postpartum [immediately after pregnancy] exercises, building up some strength work.\"Eventually she saw a physio who helped her to start running again. Helen says this was \"a massive moment because I really thought that was something I would never do again.\"Now, Helen is doing more than she ever thought possible and has signed up for a 10k run.\"I feel good and I've learned how to manage my symptoms. I've still got prolapse, but it doesn't rule my life in the way that it once was.\"I feel like I'm kind of winning the battle.\"Find out more about the symptoms of pelvic floor prolapse on the NHS website Get our flagship newsletter with all the headlines you need to start the day. Sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I thought my insides were falling out: The condition affecting one in 12 mums",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6dc0/live/9f5e02e0-af23-11f0-b9f9-e5c1839c872f.jpg"
      ],
      "datePublished": "2025-10-22T23:43:23.000Z",
      "dateModified": "2025-10-22T23:43:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]