[
  {
    "title": "Spider-Man: No Way Home",
    "url": "https://www.bbc.co.uk/iplayer/episode/m001zpyp/spiderman-no-way-home?at_mid=mAky0efvnp&at_campaign=SpiderMan_No_Way_Home&at_medium=display_ad&at_campaign_type=owned&at_audience_id=SS&at_product=iplayer&at_brand=m001zpyp&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=SpiderMan_No_Way_Home&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0hyn8bb.jpg",
    "tag": "Trending",
    "date": "2025-12-23T18:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeSpider-Man: No Way HomeSpider-Man: No Way HomeContains language which may offend.Revealed as the web-slinging superhero, Peter Parker wants the world to forget, so he begs a spell from Dr Strange, but with grave consequences. Duration2h 15mFirst shown2021Available for 22 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesSpider-Man: Far from HomeIt’s time to step up. Peter Parker takes a trip to Europe but lands in monstrous trouble1h 58mSpider-Man: HomecomingHomework can wait. The city can't. Superhero Avengers action with Tom Holland and Zendaya2h 2mSpider-Man: Across the Spider-VerseMiles must redefine what being a hero really means - or risk losing everything2h 11mBack to the FutureGreat Scott! The most iconic time-travel adventure ever told, starring Michael J. Fox1h 49mNight at the Museum: Secret of the TombOne night to save the day. In London, Larry tries to save the magic that awakens exhibits1h 31mThe War Between the Land and the SeaWe inherited their world - they want it back. When oceans rise, whose side do you choose?Night at the Museum: Battle of the SmithsonianA battle of historic proportions. Larry and his old allies unite to stop an evil Pharaoh1h 38mNight at the MuseumWhere history comes to life. A night guard learns that when the lights go off, it's on1h 42mFather BrownThe crime-busting priest's busier than ever, with a wedding and secret mission to performPirates of the Caribbean: Salazar's RevengeDead men tell no tales. Henry Turner seeks out Jack to help him locate Poseidon's trident1h 58mRoald Dahl's Matilda the MusicalWill you dare to dream? An exceptional girl takes a stand and changes her destiny1h 48mSister Boniface MysteriesA new force of habit. The nun, winemaker, and police's secret weapon in fighting crime",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Spider-Man: No Way Home",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0hyn8bb.jpg"
      ],
      "datePublished": "2025-12-23T18:00:00.000Z",
      "dateModified": "2025-12-23T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What growing up in war does to a child's brain - and their future",
    "url": "https://www.bbc.com/news/articles/cre3pdxde7vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/775d/live/9c1778d0-dc25-11f0-b67b-690eb873de1b.jpg",
    "tag": "Trending",
    "date": "2025-12-30T03:25:02.000Z",
    "description": "What growing up in war does to a child's brain - and how it really affects them years later17 hours agoFergal KeaneSpecial correspondent BBCContent wa",
    "body": "What growing up in war does to a child's brain - and how it really affects them years later17 hours agoFergal KeaneSpecial correspondent BBCContent warning: this article includes details about the impact of conflict on children in war zones and descriptions of injuries that some readers may find distressing.The first thing was that Abdelrahman's dad was killed. The family home was struck by an Israeli air strike. The boy's mum, Asma al-Nashash, 29, remembers that \"they brought him out in pieces\".Then on 16 July 2024 an air strike hit the school in Nuseirat, central Gaza. Eleven-year-old Abdelrahman was seriously wounded. Doctors had to amputate his leg.His mental state began to deteriorate. \"He started pulling his hair and hitting himself hard,\" Asma recalls. \"He became like someone who has depression, seeing his friends playing and running around… and he's sitting alone.\"When I meet Abdelrahman at a hospital in Jordan in May 2025, he is withdrawn and wary. Dozens of children have been evacuated to the Kingdom from Gaza for medical treatment.\"We will return to Gaza,\" he tells me. \"We will die there.\"Abdelrahman is one of thousands of traumatised children I've met in my nearly four decades of reporting on conflicts. Certain faces are embedded in my memory. Some as though I had only met them yesterday. They reflect the depth of terror inflicted on children in our time.AFP via Getty ImagesAFP via Getty ImagesAFP via Getty ImagesHundreds of thousands of children have lived through more than two years of war in GazaThe first was on a hilltop in Eritrea in the mid-1980s. Adonai Mikael was a child victim of an Ethiopian napalm strike, crying in agony as the wind blew dust on to his wounds. The cries, the expression of pure agony in his eyes sent me fleeing from the tent where he was being treated. In Belfast a few years later, I remember a boy following the coffin of his father, blown up by the IRA. Never before had I seen such a distance in anyone's eyes.In Sierra Leone during the civil war, there was the girl whose hands were hacked off by a drunken militiaman; from Soweto there is the image of a child helping her mother mop the blood of a murder victim on their doorstep; and in Rwanda the boy who broke down when I asked him why the other children called him \"Grenade\" – a moment of insensitivity I will always regret.He had been wounded by an explosion that killed his parents.Figures underscore the sheer scale of the crisis. In 2024, 520 million children were living in conflict zones - one in every five children worldwide - according to an analysis by the Peace Research Institute Oslo, which pieced together conflict records with population data to arrive at the estimate.Prof Theresa Betancourt, author of Shadows into Light, a book about former child soldiers, calls this \"the largest humanitarian disaster since World War Two\".She warns trauma has an impact that lasts long into the future. \"[It can affect] the developing architecture of the brain in young children, with lifelong consequences for learning, behaviour, and both physical and mental health.\"But given how much time has been spent researching the impact of war on children's minds, what can help?This is a question that has never been more relevant following this period of multiple global conflicts that have affected millions of children: from those Sudanese children who, in October, saw their mothers and sisters raped by militiamen in el-Fasher, Darfur; the youngsters abducted from Israel by Hamas on 7 October, 2023, many having witnessed the slaughter of family and neighbours; the children of Bucha in Ukraine whose parents were among the people massacred by Russian troops in February 2022; and the hundreds of thousands of children like Abdelrahman who have endured more than two years of war in Gaza.AFP via Getty ImagesGetty ImagesSudanese refugees in 2025I should declare a personal interest. I suffered from post traumatic stress disorder – PTSD both as a child in a broken home, and later as an adult, witnessing war and genocide. Though different from experiencing war as a child, I know the symptoms all too well: the extreme anxiety, hypervigilance – being constantly on guard against threats - flashbacks, nightmares, and depression. The symptoms were severe enough to require several hospitalisations.Personal experience has made me intensely curious about how children respond and are treated.\"The evidence is quite solid across different studies that the exposure to war and displacement is associated with a higher risk of mental health problems,\" says Michael Pluess, a professor of psychology at the University of Surrey.He has carried out long-term research into the children of Syrian war refugees, and cautions against making assumptions. \"It's important to recognise that children differ in how they respond.\"A variety of factors can influence the outcome. How long was the child exposed to the traumatic events? Were they physically wounded? Did they lose an important person in their life, or see them killed or injured? Did they have physical security and emotional support in the aftermath?In a sample of 2,976 children from Bosnia-Herzegovina - all of whom had been exposed to war and were aged between nine and 14 - high levels of post-traumatic symptoms and grief symptoms were reported.Getty ImagesGetty ImagesGetty ImagesBosnia-Herzegovina: Children in SarajevoBut there is the potential for long-term health damage – heart disease, autoimmune problems - linked to \"toxic stress\", where the body is flooded with hormones like cortisol and catecholamines, which produce adrenaline.There is also a developing field of research into epigenetics, which asks whether the experience of trauma by one generation can show up in later generations through changes in the way our genes behave.Are we more susceptible to, say, poor mental health, addictions or other health problems if our families have a history of trauma - and how much has this to do with genetics versus our family setups and everyday lives?The family drip-feed effectEpigenetics is a tentative and debated area of scientific research with much still to be learned.\"I think there is some evidence that there is a sort of intergenerational transmission of trauma,\" says Prof Pluess. \"Some of that or much of that will happen through social practice rather than biological practice, but there's some evidence to suggest that there are some epigenetic factors as well.\"Prof Metin Başoğlu, director of the Istanbul Centre for Behavioural Sciences, is sceptical. However, he says it is possible that certain temperament traits (for example, predispositions that are transmitted genetically across generations) might make some people more vulnerable to traumatic events.During research for a book on my own PTSD, I remember a conversation with one of Britain's most eminent experts in the field, Prof Simon Wessely, former president of the Royal College of Psychiatrists. I wondered whether my own family history – great-grandparents born during the Irish famine, a grandmother who was traumatised by her war experiences in the 1920s – could have made me more genetically predisposed to PTSD?\"There is simply no way of knowing, without studying a representative sample group from the same area, with ancestors born in the same place and subjected to the same conditions,\" he told me. \"I can't do it on one person…\"What I think is much easier to understand - and, I think, is also the most powerful - is the influence of our background. And it's absolutely impossible for you to have grown up in the household that you did, with the interests that you have, for that not to have the same effect on you.\"AFP via Getty ImagesAFP via Getty ImagesProf Pluess has carried out long-term research into the children of Syrian war refugees, and cautions against making assumptionsThere is broader consensus that trauma is a family crisis. It isn't only a question of what a child witnesses or survives – there is also the impact on adults.\"Not only do children in war zones face the death of caregivers and traumatic separations,\" says Prof Betancourt, \"but caregivers experiencing their own trauma and distress may not be fully available to help protect and guide their children through the horrors of war.\"Prof Pluess's research among Syrian refugees supports this. Among the 80% of children found to be vulnerable to more than one psychological disorder, family circumstances were critical.Around 1,600 families took part in a study, published in 2022, of Syrian refugees in Lebanon. Prof Pluess says that children's living conditions (such as access to safe housing, food, and schooling) were found to be \"about 10 times more predictive of their mental health\".Children who adapted more healthily may have \"had a social environment that was very protective, maybe the parents were able to shield them, maybe they had close friendships, relationships, maybe they have access to school, all those external things that sort of buffer the negative impact of war exposure.\"The roots of this knowledge in Britain go back to WW2 and the experience of children who lived through the Blitz – the eight months of German air attacks between September 1940 and May 1941.Getty ImagesHulton-Deutsch Collection/Corbis via Getty ImagesFox Photos/Getty Images\"The evidence is quite solid [...] exposure to war and displacement is associated with a higher risk of mental health problems,\" says Prof PluessProf Edgar Jones, of King's College London, points to a study of 212 children treated at Great Ormond Street Hospital for Children during the war. When researchers went back to the children in 1949 – four years after the conflict ended – they found only 21% had recovered. The role of parents – both positive and negative – emerged as an important finding.\"The severity of a child's reaction to bombing was judged to be influenced by their parents' response to the trauma either to accentuate or calm their anxiety,\" says Prof Jones.Overcoming fear and establishing controlIn my own experience, therapy and medication helped, but also the ongoing support of family and friends. Without the power of caring relationships I don't believe I could have emerged from the darkness.I was also encouraged to confront my avoidance of anything that might remind me of the trauma. For example, I went through a long period of avoiding travel to the continent of Africa, fearing that simply being there would trigger reminders of the Rwandan genocide. But my therapist gradually encouraged me to face the fear. It took several years but I did return, and continue to visit places there that are dear to my heart.Prof Başoğlu pioneered the use of what is called CFBT – Control Focused Behavioural Treatment - among survivors of the 1999 Turkish earthquake, which killed about 18,000 people.The idea is to encourage the individual to take control of their fear of the event recurring. In the case of children who were constantly clinging to their parents, this was attempted by encouraging them to get used to sleeping alone.\"Once they overcome their fear, all the traumatic stress reactions that are associated with fear also improve,\" Prof Başoğlu says.Israeli psychologists working with children released from Hamas captivity after the 7 October attacks also stress the importance of re-establishing a sense of control.Getty ImagesAFP via Getty ImagesGetty ImagesGlobal conflicts have affected millions of children, including the young people abducted from Israel by Hamas on 7 October, 2023, those who witnessed the slaughter of family and neighbours that day, and those dealing with the aftermathIn a paper for the Child and Adolescent Psychiatry and Mental Health journal, a team of Israeli specialists wrote that this was achieved \"by providing survivors with information and space to express their concerns while ensuring that their needs and voices are heard\".But successful interventions depend greatly on creating a stable environment where the fear of being killed or maimed is not an ever-present reality.\"What they also need is that their parents are well, that they live in a safe place, that they have access to education, that they have a routine, that they have some predictability,\" says Prof Pluess.This is rarely certain in areas ravaged by war. Ceasefires break down. Front lines become frozen. The displaced are stuck in camps.'We were dehumanised'Still, those words about a safe place bring to mind my friend Beata and the difference stability made to her life.She was 15 years old when the Rwandan genocide – the worst mass slaughter since the Nazi Holocaust – erupted in 1994. Up to 800,000 people, mostly members of the Tutsi minority, were massacred over a period of 100 days.As a reporter I travelled on the convoy that evacuated dozens of orphaned children - Beata Umubyeyi Mairesse among them - through roadblocks manned by the murderous Interahamwe militia. It was a terrifying experience, but especially for the children whose families had been killed.From roadblock to roadblock, we did not know if the machete-wielding gangs would attack.Years later when she was researching her experiences (later published in a book, The Convoy), Beata got in touch. I remember being struck by her composure and openness. She is married with two children, lives in France and is now a successful writer.\"The first thing that helped me was exile to France, leaving the scene of the genocide. I found myself safe, in a peaceful place, with shelter, a foster family who took care of all my material needs, and the opportunity to see a psychologist. I went back to school in September, and that helped me too.\"VCG via Getty ImagesMirrorpix/Getty ImagesLiaison/ Getty ImagesGlobal conflicts that have affected millions of children - in 1994, up to 800,000 people were massacred in Rwanda over a period of 100 days Beata was joined by her mother who also survived. Her father had died before the slaughter.Composed as she was, there were lingering terrors. She panicked one night when classical music was played on the radio – similar to music played on Rwandan radio the night the genocide began. Fireworks or the sound of hunters shooting sent her hiding under a desk in class \"because I thought war had broken out in France\".I wondered if she makes a conscious effort to protect her children from the traumatic inheritance of genocide. \"There are things that are difficult to tell your children, how we were dehumanised, how I was almost raped. The term 'unspeakable' makes sense when passing on stories to children. We are afraid of contaminating them with our trauma.\"But for Beata, nuance is vital. \"Their only image of Rwanda should not be the genocide. I told them stories from my childhood and every time I went there I brought them back fruit so that they could also discover a country full of flavour.\"Although she lives a full and happy life, Beata still suffers from anxiety and takes anti-depressants to deal with insomnia. I also use medication, and like Beata I do not see it as a burden or a stigma. Rather I count myself fortunate to be able to access care and medicine.Fergal Keane (second from right) in Rwanda after the genocideCreating a safe community is also seen as critical by many experts.\"They're not just victims of mental health,\" says Prof Pluess. \"They're little people with interests and that's why they need to go to school, they need to have opportunities to play together - and that might be as important as dealing with the mental health problems that they're facing.\"Psychologists working in Gaza are well aware of these needs. Davide Musardo, who volunteered with Medecins Sans Frontieres, has written of trying to provide therapy against the background of drones and explosions.\"In Gaza, one survives but the exposure to trauma is constant. Everything is missing, even the idea of a future. For people, the greatest anguish is not of today — the bombs, the fighting, and the mourning — but of the aftermath. There is little confidence about peace and reconstruction, and the children I saw in the hospital showed clear signs of regression.\"It is possible, in devastated Gaza, that the current ceasefire will become a permanent peace, allowing rebuilding, and the restoration of family life and schooling. Possible but by no means certain. In Sudan there are attempts to re-start talks about peace but little optimism for their outcome. The war in Ukraine, and many other wars grind on every day.Trauma is as old as war itself. Politicians, journalists, and experts looking to the aftermath of a conflict often ask, \"What will happen when the killing stops?\" But somewhere else the killing will continue. That is the relentless tragedy of children caught in wars they did not start, over which they have no control. For all the knowledge gained about treating trauma, humanity is far from dealing with its root cause – war itself.Additional reporting by Harriet WhiteheadTop picture credit: EPA/ShutterstockMore from InDepthBBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. You can now sign up for notifications that will alert you whenever an InDepth story is published - click here to find out how.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What growing up in war does to a child's brain - and their future",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/775d/live/9c1778d0-dc25-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-30T03:25:02.000Z",
      "dateModified": "2025-12-30T03:25:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tatiana Schlossberg, granddaughter of John F Kennedy, dies aged 35 ",
    "url": "https://www.bbc.com/news/articles/c338ne3relzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c2a0/live/5209b110-e5ba-11f0-b886-23af5d5824af.jpg",
    "tag": "Trending",
    "date": "2025-12-30T20:06:03.000Z",
    "description": "9 minutes agoKayla EpsteinGetty ImagesTatiana Schlossberg, the granddaughter of former US President John F Kennedy, has died aged 35.Her family announ",
    "body": "9 minutes agoKayla EpsteinGetty ImagesTatiana Schlossberg, the granddaughter of former US President John F Kennedy, has died aged 35.Her family announced her death in a social media post shared by the John F Kennedy Library Foundation, writing: \"Our beautiful Tatiana passed away this morning. She will always be in our hearts.\"In November, Schlossberg, a climate journalist, announced her diagnosis of an aggressive form of cancer. She said in an essay that she had been given less than a year to live.Schlossberg was the daughter of designer Edwin Schlossberg and diplomat Caroline Kennedy.In an article published last month in The New Yorker titled, \"A Battle With My Blood,\" Schlossberg revealed she had been diagnosed with acute myeloid leukaemia in May 2024, after giving birth to her second child.\"My first thought was that my kids, whose faces live permanently on the inside of my eyelids, wouldn't remember me,\" she wrote.Schlossberg described the treatments she received, including chemotherapy and a bone marrow transplant, but shared that doctors did not give her a good prognosis.She also wrote of the pain she feared her passing would cause for her family, which has endured multiple personal tragedies. Her grandfather, President Kennedy, was assassinated in 1963 and her uncle, John F Kennedy Jr, died in 1999.\"For my whole life, I have tried to be good, to be a good student and a good sister and a good daughter, and to protect my mother and never make her upset or angry,\" Schlossberg wrote.\"Now I have added a new tragedy to her life, to our family's life, and there's nothing I can do to stop it.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tatiana Schlossberg, granddaughter of John F Kennedy, dies aged 35 ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c2a0/live/5209b110-e5ba-11f0-b886-23af5d5824af.jpg"
      ],
      "datePublished": "2025-12-30T20:06:03.000Z",
      "dateModified": "2025-12-30T20:06:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Were our 2025 predictions right? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mpqcjw?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-12-24T07:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·24 Dec 2025,·35 minsAvailable for over a yearWhat did the Americast team get right when they made their predictions for what the big news stories of 2025 might be? Justin, Anthony, Sarah and Marianna look back at a tumultuous year for Donald Trump in his second term, which include deportation raids, Elon Musk’s role, the war in Gaza, the US shutdown and more. It’s time to open up the Americast time capsule of predictions and find out what we got right and what we got wrong…\nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Anthony Zurcher, North America Correspondent\n• Marianna Spring, Social Media Investigations Senior Correspondent \nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray and Grace Reeve. The technical producer was Jonny Hall. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Were our 2025 predictions right? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-12-24T07:00:00.000Z",
      "dateModified": "2025-12-24T07:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Third man arrested after pedestrian dies in Gillingham crash",
    "url": "https://www.bbc.com/news/articles/c0r9rdjr21do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/042d/live/fd5a8600-e5a8-11f0-b84b-6d40b6925787.jpg",
    "tag": "Trending",
    "date": "2025-12-30T17:57:37.000Z",
    "description": "Pensioner 'carried on roof of car' and killed in crash2 hours agoJacob Panons,South EastandZac Sherratt,South EastGetty ImagesA third person has been ",
    "body": "Pensioner 'carried on roof of car' and killed in crash2 hours agoJacob Panons,South EastandZac Sherratt,South EastGetty ImagesA third person has been arrested in connection with the death on a man in his 80sThree men have been arrested after a pedestrian in his 80s died after being hit by a car and carried on top of it for as much as a mile.Kent Police said the man was struck by a grey Mercedes estate on the A289 Gads Hill, in Gillingham, on Monday and carried for an unspecified distance.A postman is said to have found the man's body in Grange Road before the vehicle was later discovered in Eastcourt Lane.A man, 29, from Chatham, and another man, 28, of no fixed address, were arrested the same day. On Tuesday, a third man, 28, from Edgware in north-west London, was also arrested in connection with the incident.Police said the two occupants of the Mercedes had fled on foot.Ralph Belmonte, a resident of Grange Road for 47 years, said a postman discovered the body on the road after having mistaken it for a dummy strapped to the roof of a driving car.\"It was only on his return to drop the rest of the mail off that he saw [the body] on the road and approached it thinking that it might have been a dummy and it could create a problem, an accident,\" Mr Belmonte said.\"And as he went to turn it over, he realised it was actually a body.\"He added: \"It's as safe as anybody's area really, until something like this happens, you know – everything's safe until becomes unsafe.\"It's not an area known for high crime rate, but it can happen anywhere.\"Witness appealDetectives investigating the crash released CCTV images which showed two hooded men dressed in dark clothing on a pavement on foot, with one appearing to be running while carrying a number plate.South East Coast Ambulance Service paramedics treated the pedestrian at the scene but he later died, a spokesperson said. Det Insp Zoe Wilczek, of Kent Police's serious collision investigation unit, said the force was continuing to appeal for witnesses.\"We would like to thank all those who have assisted our investigation so far,\" she said.\"We are urging anyone who witnessed the incident, or saw the vehicle or pedestrian prior to the collision, to contact us.\"We're also asking anyone who may have caught any part of the incident on their dashcams and CCTV, and has not yet got in touch with us, to do so.\"Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Third man arrested after pedestrian dies in Gillingham crash",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/042d/live/fd5a8600-e5a8-11f0-b84b-6d40b6925787.jpg"
      ],
      "datePublished": "2025-12-30T17:57:37.000Z",
      "dateModified": "2025-12-30T17:57:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "German bank heist: Thieves use drill to steal €30m from savings bank",
    "url": "https://www.bbc.com/news/articles/c4grzz60kp3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/753f/live/909e7470-e5aa-11f0-b84b-6d40b6925787.jpg",
    "tag": "Trending",
    "date": "2025-12-30T16:54:32.000Z",
    "description": "3 hours agoAmy WalkerGelsenkirchen PolicePolice say the thieves used a parking garage to gain access to the branchThieves used a large drill to break ",
    "body": "3 hours agoAmy WalkerGelsenkirchen PolicePolice say the thieves used a parking garage to gain access to the branchThieves used a large drill to break into a safe at a high street bank branch in western Germany and steal an estimated €30m (£26m; $35m) in cash and valuables, police have said.A police spokesman likened the break-in to the Hollywood heist film Ocean's Eleven, telling AFP news agency it was \"very professionally executed\".During the heist at Sparkasse savings bank in the city of Gelsenkirchen, thieves broke open more than 3,000 safe deposit boxes containing money, gold and jewellery. Gelsenkirchen Police said they became aware of the crime after a fire alarm was set off in the early hours of Monday morning.Currently, no arrests have been made and the perpetrators remain at large.Police said the thieves had used the \"quiet Christmas days\" to rob the building on Nienhofstrasse in the Buer district.Initial investigations suggest they gained access to the bank, and escaped, via an adjacent parking garage.Witnesses have reported seeing several men carrying large bags in the staircase of the garage overnight on Saturday into Sunday. Police said video footage shows a black Audi RS 6 leaving the garage, on De-La-Chevallerie-Strasse, early on Monday morning.The hole into the underground vault room was discovered when a fire alarm went off in the early hours of Monday, and police and the fire brigade searched the building.Affected bank customers have been asked to contact Sparkasse bank, which has set up a hotline. Police secured the entrance of the branch on Tuesday after a large number of customers gathered outside demanding information.Watch: Bank customers demanded to be let in following heistA message on the bank's website said the branch would remain closed on Tuesday following the break-in.Sparkasse said 95% of customers' safe deposit boxes had been forced open by the thieves, so the likelihood they were affected is \"very high\". It added that the contents of each compartment are insured up to €10,300 and told customers to check if they had additional coverage through their home insurance.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "German bank heist: Thieves use drill to steal €30m from savings bank",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/753f/live/909e7470-e5aa-11f0-b84b-6d40b6925787.jpg"
      ],
      "datePublished": "2025-12-30T16:54:32.000Z",
      "dateModified": "2025-12-30T16:54:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Protests spread across Iran for third day after currency hits record low",
    "url": "https://www.bbc.com/news/articles/cqj2llkjv8vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2a92/live/77f3c720-e598-11f0-bb65-6152e605acc9.jpg",
    "tag": "Trending",
    "date": "2025-12-30T16:31:18.000Z",
    "description": "Protests and strikes in Iran over inflation and currency devaluation have spread from the capital, Tehran, to several other cities on a third day of u",
    "body": "Protests and strikes in Iran over inflation and currency devaluation have spread from the capital, Tehran, to several other cities on a third day of unrest.The protests began on Sunday after shopkeepers in Tehran's Grand Bazaar staged a strike when the Iranian rial hit a record low against the US dollar on the open market.Since then, videos verified by BBC Persian have shown demonstrations in the cities of Karaj, Hamedan, Qeshm, Malard, Isfahan, Kermanshah, Shiraz and Yazd. Police were also seen using tear gas in an attempt to disperse demonstrators.The Iranian government said it \"recognises the protests\" and would listen \"with patience, even if it is confronted with harsh voices\".President Masoud Pezeshkian wrote on X late on Monday that he had instructed the interior minister to hold talks with what he described as \"representatives\" of the protesters so that measures could be taken \"to resolve the problems and act responsibly\".He also accepted the resignation of Iran's central bank governor, Mohammadreza Farzin, and named former economy and finance minister Abdolnasser Hemmati to replace him.University students have also joined the protests, chanting anti-government slogans including \"Death to the dictator\" - a reference to the Supreme Leader, Ayatollah Ali Khamenei, who holds ultimate power in Iran.Some protesters were also heard chanting slogans in support of the son of the late Shah Mohammad Reza Pahlavi, who was overthrown in the 1979 Islamic Revolution, including \"Long live the Shah\".In response, Reza Pahlavi, who lives in exile in the United States, wrote on X: \"I am with you. Victory is ours because our cause is just and because we are united.\"\"As long as this regime remains in power, the country's economic situation will continue to deteriorate,\" he added.The US state department's Persian-language account on X also expressed support for the protests.It said the US \"praises their courage\" and stands with those seeking \"dignity and a better future\" after years of failed policies and economic mismanagement.Iran was reportedly high on the agenda of a meeting between US President Donald Trump and Israeli Prime Minister Benjamin Netanyahu in Florida on Monday,At a joint news conference afterwards, Trump declined to say whether he supported regime change in Iran, but said: \"They've got a lot of problems: tremendous inflation, their economy is bust, their economy is no good, and I know people aren't so happy.\"The president also said he might back another round of Israeli air strikes on Iran if the country rebuilt its ballistic missile or nuclear programmes.During a 12-day war between Israel and Iran in June, the US carried out air strikes on key Iranian uranium enrichment sites. Iran insists its nuclear programme is entirely peaceful.President Pezeshkian vowed on Tuesday that Iran's response to \"any oppressive act of aggression\" would be \"severe and regret-inducing\".Iran's supreme leader has repeatedly said that Israel's government hoped mass protests would erupt in Iran during the war and topple the regime.\"They wanted to create sedition on the streets... But people were absolutely not influenced by what the enemy wanted,\" Khamenei said in September.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Protests spread across Iran for third day after currency hits record low",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2a92/live/77f3c720-e598-11f0-bb65-6152e605acc9.jpg"
      ],
      "datePublished": "2025-12-30T16:31:18.000Z",
      "dateModified": "2025-12-30T16:31:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "George Clooney and family awarded French citizenship",
    "url": "https://www.bbc.com/news/articles/c0q4ezpepdvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/235b/live/f4067820-e5a3-11f0-8bbe-6935d94eeebc.jpg",
    "tag": "Trending",
    "date": "2025-12-30T18:31:58.000Z",
    "description": "US actor George Clooney, his wife, human rights lawyer Amal and their two children have been awarded French citizenship, the government said. The fami",
    "body": "US actor George Clooney, his wife, human rights lawyer Amal and their two children have been awarded French citizenship, the government said. The family's new citizenship was made public in the Journal Officiel, where French government decrees are published.Their farm in Brignoles, in the south of France, serves as the family's primary residence. The couple purchased the home in 2021.Didier Brémond, the city's mayor, told local media that their decision to become French citizens was a testament to \"his love for our country\".  He told broadcaster BFMTV that the Clooneys are \"a very simple and very accessible family\". \"Here, he wants to live normally, and that's what he is trying to do,\" he said.In an Esquire magazine interview earlier this year, George Clooney said his family decided to move to France because he was \"worried about raising our kids in LA, in the culture of Hollywood\".\"I don't want them to be walking around worried about paparazzi. I don't want them being compared to somebody else's famous kids,\" he added.\"We live on a farm in France,\" Clooney told Esquire. \"A good portion of my life growing up was on a farm, and as a kid, I hated the whole idea of it.\"But now, for them, it's like – they're not on their iPads, you know? They have dinner with grown-ups and have to take their dishes in. They have a much better life.\"In addition to their home in France, George Clooney also owns a home in the UK and in Kentucky, where he was born, according to the New York Times.The Clooneys' twins, Ella and Alexander, were born in London in 2017. Their mother was born in Lebanon and raised in the UK. The Journal Officiel shows Amal Clooney was naturalised under her maiden name, Amal Alamuddin. The adjustment to French life appears to be easier for Amal Clooney and her children than for her husband. George Clooney described his wife and children's French as perfect in a recent interview promoting his new movie Jay Kelly. The actor, however, described his French as \"horrible,\" despite trying to teach himself the language using an app. \"They speak French in front of me so that they can say terrible things about me to my face, and I don't know,\" he joked, speaking to French broadcaster Canal+.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "George Clooney and family awarded French citizenship",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/235b/live/f4067820-e5a3-11f0-8bbe-6935d94eeebc.jpg"
      ],
      "datePublished": "2025-12-30T18:31:58.000Z",
      "dateModified": "2025-12-30T18:31:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Do saunas really boost your health?",
    "url": "https://www.bbc.com/news/articles/c5yj3g0p26ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9e16/live/9d7781f0-df2e-11f0-b6a6-1bf5f87ee304.jpg",
    "tag": "Trending",
    "date": "2025-12-30T01:01:39.000Z",
    "description": "19 hours agoYasmin RufoBBC NewsGetty ImagesScroll through social media and you'd be forgiven for thinking saunas and cold plunges are close to a mirac",
    "body": "19 hours agoYasmin RufoBBC NewsGetty ImagesScroll through social media and you'd be forgiven for thinking saunas and cold plunges are close to a miracle cure, boosting immunity, burning fat and fixing everything from sore joints to low mood.But the reality, experts say, is more nuanced.\"There are a lot of people who swear by hot and cold exposure, but we don't yet have sufficient evidence to say it's categorically good for you,\" says Dr Heather Massey, associate professor of extreme environments and physiology at the University of Portsmouth.She explains our bodies are \"incredible\" at keeping core temperature stable, usually between about 36.5C and 37C.In everyday life, many of us rarely challenge that system, spending long periods in heated or air-conditioned spaces.Heating or cooling the body creates a small stress, she says, which may trigger adaptive or protective responses.The science behind the saunaThat idea underpins the appeal of saunas, which nowadays at gyms and spas are rarely empty.  For some people it's a reward after exercise while for others, it's the main attraction and many regulars swear by it, convinced that 15 minutes of intense heat does wonders for their body and mind. And there's no doubt it can feel good.\"When you sit in a sauna and work up a sweat, you may feel looser, freer, a bit more mobile and your aches and pains may resolve themselves a bit,\" Dr Massey tells the BBC's What's Up Docs podcast.\"So there's definitely some benefit to using the sauna but the question is whether that's a long-term health benefit or more of a psychological one.\"Getty ImagesDr Massey explains that a recent study put people repeatedly in hot tubs and the results showed changes in insulin and blood pressure.\"We're starting to explore whether heating the body could help people living with lifelong conditions.\"Still, she urges caution when it comes to bold health claims as robust scientific evidence is still limited.\"We've never really done a proper sauna trial,\" she says. \"I suspect we'll find benefits in the future, but we're not there yet.\"For now, she says, it's reasonable to enjoy the ritual for how it makes you feel, without assuming it's a guaranteed shortcut to better health.And if you do try saunas or hot tubs, Dr Massey advises caution, \"ease yourself in gradually\" and check with your GP first if you have any underlying health conditions or are pregnant.What about cold water swimming?Some people like to push things in the opposite direction. Cold-water swimming groups are growing in popularity, with early-morning dips now a familiar sight at beaches, lakes and rivers.Dr Massey, who has swum the channel and competed in the world ice-swimming championships, goes cold-water swimming once a week but only spends a couple of minutes in the water. She finds it \"painful\" at first, but that initial shock is exactly what people are chasing.\"When you first immerse, you get an involuntary gasp and rapid breathing,\" she explains. Heart rate and blood pressure jump and stress hormones such as cortisol and adrenaline surge. \"That response peaks at about 30 seconds and then drops away very quickly,\" she adds.Repeated exposure reduces the shock response and after several short swims, it can be cut by around 50%.As with saunas, the big question is whether the benefits come from the temperature itself, or everything wrapped around it.Cold-water swimming is usually done outdoors and with others. \"It's an activity with multiple mechanisms - nature, movement and social connection and they are all interlinked,\" Dr Massey says.Podcast host Dr Chris van Tulleken agrees it's difficult to separate those factors: \"We don't know if the benefit is the cold water itself or being with a group of fun people and doing something challenging together.\"Find something you enjoyFor Dr Massey, though, the starting point isn't temperature at all, but enjoyment.\"I speak to people who do Parkrun every week, and describe exactly the same kind of buzz as other people get from cold water swimming,\" she says.\"What matters is finding something you enjoy, can do regularly, and ideally can share with others, as building a friendship group around an activity can reduce psychological stress.\"That could be anything from gardening, birdwatching, joining a choir or simply walking with friends. So even if saunas and cold swims are not essential for good health, says Dr Massey, they may still offer something positive.Drs Chris and Xand van Tulleken are on a mission to help us take better care of ourselves. Listen to What's Up Docs? on BBC Sounds or wherever you get your BBC podcasts.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Do saunas really boost your health?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9e16/live/9d7781f0-df2e-11f0-b6a6-1bf5f87ee304.jpg"
      ],
      "datePublished": "2025-12-30T01:01:39.000Z",
      "dateModified": "2025-12-30T01:01:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "British-Egyptian dissident appears to endorse 'smear campaign' claims",
    "url": "https://www.bbc.com/news/articles/c3dm9944glpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/edd5/live/3474e4e0-e591-11f0-bb65-6152e605acc9.jpg",
    "tag": "Trending",
    "date": "2025-12-30T16:12:05.000Z",
    "description": "4 hours agoBilly KenberPolitics investigations correspondentThe British-Egyptian activist at the centre of a political row appears to have endorsed ne",
    "body": "4 hours agoBilly KenberPolitics investigations correspondentThe British-Egyptian activist at the centre of a political row appears to have endorsed new and baseless claims that he is the victim of a \"smear campaign\". Alaa Abd El Fattah flew to the UK on Friday to be reunited with his family for the first time in 12 years following his release from an Egyptian jail where human rights groups said he had been unfairly detained.The prime minister welcomed his return in a post on X but subsequently faced criticism after old social media posts emerged in which Mr Abd El-Fattah called for the killing of Zionists and police officers.Sir Keir Starmer has since said he was unaware of the \"absolutely abhorrent\" resurfaced posts, which Mr Abd El Fattah has apologised for, and said the government was \"taking steps to review the information failures in this case\".\"With the rise of antisemitism, and recent horrific attacks, I know this has added to the distress of many in the Jewish community in the UK,\" he added.Foreign Secretary Yvette Cooper has asked a senior civil servant to review why ministers in the current and former governments were not aware of Mr Abd El Fattah's previous comments.Mr Abd El Fattah's apology, which came in a statement issued in the early hours of Monday morning, said that he understood \"how shocking and hurtful\" the posts were.He said the comments were \"expressions of a young man's anger\".The apology was welcomed by the prime minister's spokesman on Monday. He said it was a \"fairly fulsome apology and that's clearly the right thing to do\".However, within hours of his apology, BBC News has established that Mr Abd El Fattah's Facebook account liked another user's post which described criticism of him as a \"relentless smear campaign\" being waged by \"the richest man in the world, a couple of Middle East intelligence services, and a few Zionist organisations\".Shadow justice secretary Robert Jenrick has  highlighted a second posted liked by Mr Abd El Fattah's Facebook account on the same day which claimed he was a victim of a campaign by Zionists. BBC News has seen a screenshot of this second message but the original post appears to have been deleted.Jenrick said the two posts \"show El Fattah's apology was insincere and scripted\".\"Far from distancing himself from his earlier extremist views, he confirms that he still holds them. Far from showing contrition, he is presenting himself as the victim of a conspiracy,\" he added.He said the posts \"suggest the threshold for revoking his citizenship could be met: he was, and remains, a threat to national security, and his presence in the UK is clearly not conducive to the public good\".The Facebook account belonging to Abd El Fattah had previously shared a photo of him being reunited with his 14-year-old son Khaled on his arrival in the UK.The activist, who has spent more than a decade behind bars, rose to prominence during the 2011 uprising that forced then-Egyptian president Hosni Mubarak to resign.In 2021 he was convicted of \"spreading fake news\" for sharing a Facebook post about torture, in a trial that was widely condemned as unfair by human rights groups.He was granted British citizenship in December 2021, while the Conservatives were in power, and was eligible through his London-born mother.Since his old tweets emerged, the Conservatives and Reform UK have called for the government to strip him of his British citizenship and deport him.Although the home secretary has powers to strip a dual national of their citizenship if it is deemed not to be \"conducive to the public good\", in practice this has typically been used in cases linked to terrorism or serious organised crime where someone is deemed a national security threat.It is understood that Downing Street believes that this high bar is not met in this case. Any decision to strip someone of their citizenship is also likely to face a potentially lengthy and expensive legal challenge.The activist had been withdrawn as a nominee for a human rights prize a decade ago over comments he made online about Israel he had posted in 2012.Rail minister Lord Hendy said it was right the government was looking into why ministers were unaware of the messages.\"What he said was clearly quite abhorrent. Nobody would subscribe to that - certainly not the government. And now there is an inquiry by the Foreign Office about how these tweets were overlooked,\" he said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "British-Egyptian dissident appears to endorse 'smear campaign' claims",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/edd5/live/3474e4e0-e591-11f0-bb65-6152e605acc9.jpg"
      ],
      "datePublished": "2025-12-30T16:12:05.000Z",
      "dateModified": "2025-12-30T16:12:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta buys Chinese-founded AI agent start-up Manus",
    "url": "https://www.bbc.com/news/articles/ce3k11q9qe1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f148/live/57d2c670-e59e-11f0-8bbe-6935d94eeebc.jpg",
    "tag": "Trending",
    "date": "2025-12-30T17:30:36.000Z",
    "description": "3 hours agoLiv McMahonTechnology reporterMeta says it is acquiring the Chinese-founded AI firm Manus as it looks to boost the capabilities of its tech",
    "body": "3 hours agoLiv McMahonTechnology reporterMeta says it is acquiring the Chinese-founded AI firm Manus as it looks to boost the capabilities of its tech.Bloomberg analysts and The Wall Street Journal suggested the purchase could be worth more than $2bn (£1.48bn).Meta said the deal would help improve its own AI by giving people access to \"agents\" - tools which can do complex things with minimal user interaction such as planning trips or making presentations.\"Manus's exceptional talent will join Meta's team to deliver general-purpose agents across our consumer and business products, including Meta AI,\" it said in a blog post.Barton Crockett, analyst at Rosenblatt Securities, told Reuters it was a \"natural fit\" for Meta, which extended into boss Mark Zuckerberg's \"vision of personal AI\" using agents.Based in Singapore after relocating from China, Manus has sought to set itself apart from rival AI developers with what it claims can be a \"truly autonomous\" agent.Unlike many chatbots which need to be repeatedly asked for things before a user can get their desired response, Manus says its service can plan, execute and complete tasks independently in accordance with instructions.It forms part of the company's mission to \"extend human reach\" with general-purpose agents that can aid, rather than replace, human work.The company said its acquisition by Meta was \"validation\" of its efforts.\"Joining Meta allows us to build on a stronger, more sustainable foundation without changing how Manus works or how decisions are made,\" said Xiao Hong, its chief executive and one of its Chinese founders, in a blog post.\"We're excited about what the future holds with Meta and Manus working together and we will continue to iterate the product and serve users that have defined Manus from the beginning.\"Meta said as part of its deal it would continue to operate and sell Manus' AI service.It marks yet another high-profile move by the Silicon Valley tech giant to cement its presence in the sector through deals with rising start-ups.In June the company spent $14bn to buy 49% of Scale AI and secured its boss to take a lead role in Meta's development of the tech.This came amid a wider increase in spending by Zuckerberg on the company's AI strategy, as well as reportedly luring talent from rivals like OpenAI.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta buys Chinese-founded AI agent start-up Manus",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f148/live/57d2c670-e59e-11f0-8bbe-6935d94eeebc.jpg"
      ],
      "datePublished": "2025-12-30T17:30:36.000Z",
      "dateModified": "2025-12-30T17:30:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Labour criticises Tory shadow minister for representing Roman Abramovich",
    "url": "https://www.bbc.com/news/articles/cly5yyxvv73o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/99b1/live/01603d50-e589-11f0-99b0-ada9be4ed6d1.jpg",
    "tag": "Trending",
    "date": "2025-12-30T15:04:37.000Z",
    "description": "5 hours agoBecky MortonPolitical reporterGetty ImagesRoman Abramovich was sanctioned by the UK government in March 2022Labour has criticised Conservat",
    "body": "5 hours agoBecky MortonPolitical reporterGetty ImagesRoman Abramovich was sanctioned by the UK government in March 2022Labour has criticised Conservative shadow attorney general Lord Wolfson for acting as a lawyer for sanctioned Russian billionaire Roman Abramovich.Justice Minister Jake Richards said it was \"indefensible\" for him to retain his position on the Tory frontbench while also representing Mr Abramovich, arguing it risked a conflict of interest.The Conservatives said the comments were \"pure politics\" and a \"baseless smear\", adding that \"barristers act for clients, not causes\".Lord Wolfson is part of the legal team representing the former owner of Chelsea Football Club in his court battle with the Jersey government.Mr Abramovich was sanctioned by the UK government in March 2022, following Russia's invasion of Ukraine.The oligarch, who made his fortune in oil and gas, is alleged to have strong ties to Russian President Vladimir Putin, which he denies.More than £5.3bn of assets linked to Mr Abramovich have been frozen by courts in Jersey since he was sanctioned.In April 2022, the Jersey government launched an investigation to determine the source of the funds, sparking a long-running legal battle.The justice minister claimed the case was holding up the transfer of funds from Mr Abramovich's sale of Chelsea FC, which the government wants to go to victims of the war in Ukraine.In 2022 Mr Abramovich said the £2.5bn he made from the sale should be used for \"all victims of the war\" - meaning Russians could also benefit.In a letter to Conservative leader Kemi Badenoch, Richards said: \"Mr Abramovich's position is that the transfer of the funds cannot be completed until the end of the court case in Jersey in which Lord Wolfson is representing him.\"As shadow attorney general, Lord Wolfson has a crucial role in formulating Conservative Party policy. \"As a paid representative of Mr Abramovich, he has a financial interest in the question of whether and when Mr Abramovich's assets are transferred to benefit the people of Ukraine.\"In his letter the minister raised a number of questions, including whether Lord Wolfson played a role in formulating the party's position on transferring the funds from the sale of Chelsea FC and whether he declared an interest or recused himself from the process.Richards said the \"cab rank rule\" - the principle that a barrister must take on any case that is within their area of expertise, regardless of the client - \"should always be respected, but it cannot remove conflicts of interest, or eliminate the responsibility of politicians to avoid such conflicts\".He added: \"Lord Wolfson's ability to advise you in respect of this matter is clearly compromised by the fact that he is being paid to act on behalf of Mr Abramovich.\"If he wants to continue to represent clients whose interests directly bear on the policies of the government and HM opposition that is a matter for him - but he cannot do it while serving in your shadow cabinet.\"In response, a Conservative Party spokesperson said: \"Lord Wolfson is instructed in on-going legal proceedings in Jersey. He is not instructed on the Chelsea FC matter.\"Jake Richards' comments are pure politics, and they show Labour still does not understand how the Bar works. Barristers act for clients, not causes.\"The spokesperson accused Labour of \"rank hypocrisy\", pointing out that Attorney General Lord Hermer  - the government's chief legal adviser - previously represented former Sinn Féin leader Gerry Adams before he became a minister.They added: \"The Conservative Party led the way on supporting Ukraine and we remain committed to their cause. To suggest anything else is just Labour sinking to new depths.\"PA MediaLord Wolfson has served as shadow attorney general since November 2024There has been a delay in releasing the funds from the sale of Chelsea FC, which are currently frozen in a British bank account, due to a standoff over how exactly they should be used.Mr Abramovich cannot access the money under UK sanctions but the proceeds from the Chelsea sale still legally belong to him.Earlier this month, Prime Minister Sir Keir Starmer urged the oligarch to \"pay up now\" or face court action.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Labour criticises Tory shadow minister for representing Roman Abramovich",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/99b1/live/01603d50-e589-11f0-99b0-ada9be4ed6d1.jpg"
      ],
      "datePublished": "2025-12-30T15:04:37.000Z",
      "dateModified": "2025-12-30T15:04:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "French right pushes for national tribute to film star Brigitte Bardot",
    "url": "https://www.bbc.com/news/articles/cp848g51zd3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b7f2/live/62c21d50-e56d-11f0-978a-3510e7b058d9.jpg",
    "tag": "Trending",
    "date": "2025-12-30T11:20:27.000Z",
    "description": "9 hours agoPaul KirbyEurope digital editorCharly Hel/Prestige/Getty ImagesBrigitte Bardot died on Sunday aged 91 and had long shunned the limelight, p",
    "body": "9 hours agoPaul KirbyEurope digital editorCharly Hel/Prestige/Getty ImagesBrigitte Bardot died on Sunday aged 91 and had long shunned the limelight, preferring the company of animalsFrench right-wing figure Éric Ciotti has called for a national tribute to honour film legend Brigitte Bardot, prompting objections from political opponents on the left.\"France has a duty to honour its Marianne,\" said Ciotti, referring to the emblem of French liberty whose face Bardot was chosen to represent in the 1960s.Bardot died on Sunday aged 91. A petition launched by Ciotti since has attracted more than 23,000 signatures, and has the backing of some allies on the far right.But Socialist leader Olivier Faure has pointed out that national homages are for \"exceptional services to the nation\". Bardot was an iconic actress but she also \"turned her back on republican values\", Faure argued.Bardot has been hailed by President Emmanuel Macron as a \"legend of the century\" who embodied a life of freedom, and Ciotti, who leads the right-wing UDR party, has appealed to him to organise a national send-off.  Ciotti said France should recognise a woman who brought her country an extraordinary level of international recognition and actively helped in the fight for  women's liberty and abortion rights.Meanwhile, the mayor of Nice, Christian Estrosi, has announced that his city will name an \"iconic site\" in Bardot's honour. But Bardot is destined to remain controversial in death as she was during her life. Faure pointed out that she had been convicted five times for inciting racial hatred.Bardot starred in some 50 films, after bursting on to the scene in And God Created Woman in 1956. She then left the world of cinema in 1973 for a life devoted to animal welfare, and lived for decades in Saint-Tropez on the French Riviera, at her home called La Madrague.But she became as well known for her far-right sympathies as she was for her love of animals. Some of her remarks targeted Muslims, and others insulted the people of the French Indian Ocean island of Réunion.\"To be moved by the plight of dolphins and yet be indifferent to the deaths of migrants in the Mediterranean - what degree of cynicism is that?\" asked Green MP Sandrine Rousseau on social media.There are differing types of national tribute in France. Robert Badinter, who abolished the death penalty in France, was honoured with a national homage in the form of a solemn ceremony in 2024, as was singer Charles Aznavour in 2018. A more likely option for Bardot would be along the lines of the public farewell given to rock star Johnny Hallyday, when large crowds lined the streets of Paris in 2017.Not everyone on the left is opposed to the idea of a national homage to Bardot.\"Why not? We've done it for other figures, particularly Johnny Hallyday,\" Socialist MP Philippe Brun told French radio. \"If the president of the republic decides on it, I don't see why we should oppose it.\"MIGUEL MEDINA/AFPBardot will be buried near her family's graves in the marine cemetery in Saint-TropezBardot herself had shunned the limelight for decades and close friend Wendy Bouchard said she was not remotely interested in medals and ceremonies.\"It probably comes from a good place, but I'm not sure that she, who lived a life of simplicity and deprivation, would have wanted this national homage,\" she told French TV.Journalist Steven Bellery, who interviewed Bardot earlier this year, agreed she wanted something far more simple and intimate.Bardot had asked to be buried at her Riviera home at La Madrague, rather than in a public cemetery, where she feared \"a crowd of idiots might damage the graves of my parents and grandparents\".However, the town hall in Saint-Tropez has said she will have a private burial in the public cemetery that overlooks the Mediterranean as well as her home.The Brigitte Bardot Foundation, which is dedicated to animal welfare, says her funeral will take place on 7 January at the Notre-Dame de l'Assomption church and will be broadcast on screens across the town.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "French right pushes for national tribute to film star Brigitte Bardot",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b7f2/live/62c21d50-e56d-11f0-978a-3510e7b058d9.jpg"
      ],
      "datePublished": "2025-12-30T11:20:27.000Z",
      "dateModified": "2025-12-30T11:20:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amanda Nguyen: Blue Origin astronaut reveals depression after space flight backlash",
    "url": "https://www.bbc.com/news/articles/cd0k0939dd3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/011d/live/66e271a0-e586-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-30T12:26:50.000Z",
    "description": "A Vietnamese-American astronaut has opened up about her depression after she received a \"tsunami of harassment\" following the first all-female space t",
    "body": "A Vietnamese-American astronaut has opened up about her depression after she received a \"tsunami of harassment\" following the first all-female space trip since 1963 earlier this year.Amanda Nguyen - a 34-year-old scientist and civil rights activist - was part of the 11-minute Blue Origin space flight, which also included pop star Katy Perry and Lauren Sánchez, the journalist and wife of Blue Origin founder Jeff Bezos, among its crew.The much-derided flight was criticised by some for its expense and environmental impact.Speaking about the experience, Ms Nguyen - who became the first Vietnamese woman to go to space - said the backlash saw her dreams buried under \"an avalanche of misogyny\".Watch the moment the Blue Origin rocket launched and landed in April 2025.In a statement posted on Instagram, Ms Nguyen said that when fellow crew member Gayle King - a US news anchor - called to check in on her in the days following the flight, \"I told her my depression might last for years\".She described the news coverage and social media reaction that followed the trip as an \"onslaught no human brain has evolved to endure\".\"I did not leave Texas for a week, unable to get out of bed. A month later, when a senior staff at Blue [Origin] called me, I had to hang up on him because I could not speak through my tears.\"Ms Nyugen, who has worked as a scientist researching women's health and conducted numerous experiments during the Blue Origin flight, said everything she \"had worked for - as a scientist, my women's health research, the years I had trained for this moment, the experiments I operated in space, the history that was being made as the Vietnamese woman astronaut, on the 50th anniversary of the US-Vietnam war, as the child of boat refugees, the promise I kept to my survivor self - was buried under an avalanche of misogyny\".Ms Nguyen is most recognised for her work protecting the civil rights of sexual assault survivors.She put her own ambition to become an astronaut on hold after being raped while at university and pursuing a years-long campaign for justice, she told the Guardian in an interview in March.Eight months on from realising her dream, she said the \"fog of grief has started to lift\", and thanked those who have followed her and sent her good wishes. \"You all saved me\", she said.She added that despite the backlash, \"there has been overwhelming good that has come out of [the flight]\", listing the media attention brought to her women's health research and opportunities to meet world leaders in relation to her advocacy work.Blue Origin's New Shepard rocket lifted off from its Texas launch site in April and took the six-woman crew on an 11-minute flight which crossed the internationally recognised boundary of space.The crew also included aerospace engineer Aisha Bowe and film producer Kerianne Flynn.The New Shepard rocket does not require human operation and is fully automated.Blue Origin is a private space company founded in 2000 by Jeff Bezos, the billionaire entrepreneur who also started Amazon.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amanda Nguyen: Blue Origin astronaut reveals depression after space flight backlash",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/011d/live/66e271a0-e586-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-30T12:26:50.000Z",
      "dateModified": "2025-12-30T12:26:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]