[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Radical with Amol Rajan - Can Donald Trump Be Compared To Julius Caesar? (Your Radical Questions with Tom Holland) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mpbrwl?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mpd8bx.jpg",
    "tag": "Trending",
    "date": "2026-01-05T06:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·05 Jan 2026,·21 minsAvailable for over a yearHistorian and The Rest Is History co-host Tom Holland answers your questions about whether Britain is currently in a more precarious state than it was in the 1970s, what definition of ‘radical’ best describes him and if he will ever score a century playing cricket.\nHe also explains why American presidents are often compared to Julius Caesar and faces a question he’s never heard before.\nGET IN TOUCH\n* WhatsApp: 0330 123 9480\n* Email: radical@bbc.co.uk\nEpisodes of Radical with Amol Rajan are released every Thursday and you can also watch them on BBC iPlayer: https://www.bbc.co.uk/iplayer/episodes/m002f1d0/radical-with-amol-rajan\nAmol Rajan is a presenter of the Today programme on BBC Radio 4. He is also the host of University Challenge on BBC One. Before that, Amol was media editor at the BBC and editor at The Independent.\nRadical with Amol Rajan is a Today Podcast. It was made by Lewis Vickers with Anna Budd. Digital production was by Gabriel Purcell-Davis and Joe Wilkinson. Technical production was by Mike Regaard. The editor is Sam Bonham. The executive producer is Owenna Griffiths.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radical with Amol Rajan - Can Donald Trump Be Compared To Julius Caesar? (Your Radical Questions with Tom Holland) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mpd8bx.jpg"
      ],
      "datePublished": "2026-01-05T06:00:00.000Z",
      "dateModified": "2026-01-05T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - UK Troops In Ukraine…But Only Under A Peace Deal - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0msg62t?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-06T21:26:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·06 Jan 2026,·39 minsUK Troops In Ukraine…But Only Under A Peace DealNewscastAvailable for over a yearToday, Adam and Chris discuss the latest agreement between the Coalition of the Willing and the US to provide security guarantees for Ukraine as part of ongoing efforts to secure a ceasefire with Russia.\nThe talks in Paris saw the UK and France agree to put troops on the ground \"in the event of a peace deal\".\nPlus we look at why President Trump has his sights set on Greenland and whether he really might annex the island.\nAdam is joined by the Economist’s defence editor Shashank Joshi and Dr Gabriella Gricius, senior fellow at the Arctic Institute to discuss the strategic importance of Greenland to security in the Arctic. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Shiler Mahmoudi. The social producers were Joe Wilkinson and Beth Pritchard. The technical producer was Ben Andrews. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - UK Troops In Ukraine…But Only Under A Peace Deal - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-06T21:26:00.000Z",
      "dateModified": "2026-01-06T21:26:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ex-referee David Coote sentenced over child image offence",
    "url": "https://www.bbc.com/news/articles/cr7j2nj02p1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d07e/live/298efcc0-ec79-11f0-ba9c-c9d74e6fde06.jpg",
    "tag": "Trending",
    "date": "2026-01-08T11:56:18.000Z",
    "description": "34 minutes agoAsha PatelandLaura Hammond,NottinghamReuters/Peter CziborraDavid Coote returned to Nottingham Crown Court for sentencing on ThursdayForm",
    "body": "34 minutes agoAsha PatelandLaura Hammond,NottinghamReuters/Peter CziborraDavid Coote returned to Nottingham Crown Court for sentencing on ThursdayFormer Premier League referee David Coote has been given a suspended prison sentence after a child abuse video was found on his laptop.The video, which showed a 15-year-old boy in a school uniform, was found on a device recovered by police in February last year.Coote, from Woodhill, Collingham, Nottinghamshire, admitted a charge of making an indecent image of a child in relation to the category A video, the most serious kind, at Nottingham Crown Court in October.The 43-year-old returned to the same court on Thursday and was sentenced to nine months in prison, suspended for two years. He was also given a sexual harm prevention order lasting 10 years.The court heard analysis of Coote's devices showed his Dell laptop had been connected to the hard drive and had made - in the sense of being downloaded and viewed on the screen - a category A moving image, which lasted two minutes and 11 seconds, on 2 January 2020.Judge Nirmal Shant KC told Coote: \"Those who commit this sort of offence must realise they involve a real child and that causes them damage.\"Getty ImagesCoote officiated his first match in the Premier League in 2018The charge of making an indecent image of a child refers to activities such as downloading, sharing or saving photos or videos containing abuse.The video came to the police's attention when Coote was being investigated by the FA, and a number of devices were seized and analysed when he was arrested at his home, Nottingham Magistrates' Court was told in September.He admitted the offence the following month, after initially pleading not guilty.Defending Coote, Laura Miller said his actions on 2 January 2020 did not reflect him as a person, adding he was going through an \"internal struggle\" following the breakdown of a relationship.She added he had faced a period of media scrutiny, to which the judge responded: \"Some might say he has brought it on himself.\"Ms Miller told the court six years had passed since the offence and Coote, who is now working in an administrative job, was trying to \"rebuild his life step by step\".'Spectacular fall from grace'She said: \"His life is a far cry from where it was at the height of his career, he knows he will never get that back.\"Coote was also cautioned for possession of cocaine after police visited his home, the court heard.Addressing him ahead of sentencing, Judge Shant told Coote he had \"had a spectacular fall from grace\".Coote was sacked in 2024 when comments made in a video about former Liverpool manager Jurgen Klopp in 2020 came to light.In August last year, he was given an eight-week suspension by the Football Association over the Klopp footage.In addition, the ex-official is also banned by European football's governing body Uefa until 30 June this year after photographs emerged of him snorting a white powder through a bank note while in Germany for Euro 2024.Coote came out as gay in an interview with The Sun in January 2025 and said a lifelong struggle to hide his sexuality had contributed to the rant about Klopp.In addition to the suspended prison sentence and sexual harm prevention order, Coote was ordered to carry out 150 hours of unpaid work.Judge Shant said: \"If you breach this order in any way, if there are any further offences - particularly sexual offences - you will be subject to being brought back to court.\"Additional reporting by PA MediaMore on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ex-referee David Coote sentenced over child image offence",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d07e/live/298efcc0-ec79-11f0-ba9c-c9d74e6fde06.jpg"
      ],
      "datePublished": "2026-01-08T11:56:18.000Z",
      "dateModified": "2026-01-08T11:56:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "IWF finds sexual imagery of children which 'appears to have been' made by Grok",
    "url": "https://www.bbc.com/news/articles/cvg1mzlryxeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f31e/live/872207a0-ebf3-11f0-8608-ef259671aea9.jpg",
    "tag": "Trending",
    "date": "2026-01-08T09:58:38.000Z",
    "description": "2 hours agoChris VallanceSenior technology reporterThe Internet Watch Foundation (IWF) charity says its analysts have discovered \"criminal imagery\" of",
    "body": "2 hours agoChris VallanceSenior technology reporterThe Internet Watch Foundation (IWF) charity says its analysts have discovered \"criminal imagery\" of girls aged between 11 and 13 which \"appears to have been created\" using Grok.The AI tool is owned by Elon Musk's firm xAI. It can be accessed either through its website and app, or through the social media platform X.The IWF said it found \"sexualised and topless imagery of girls\" on a \"dark web forum\" in which users claimed they used Grok to create the imagery.The BBC has approached X and xAI for comment.The IWF's Ngaire Alexander told the BBC tools like Grok now risked \"bringing sexual AI imagery of children into the mainstream\".He said the material would be classified as Category C under UK law - the lowest severity of criminal material.But he said the user who uploaded it had then used a different AI tool, not made by xAI, to create a Category A image - the most serious category.\"We are extremely concerned about the ease and speed with which people can apparently generate photo-realistic child sexual abuse material (CSAM),\" he said.The charity, which aims to remove child sexual abuse material from the internet, operates a hotline where suspected CSAM can be reported, and employs analysts who assess the legality and severity of that material.Its analysts found the material by on the dark web - the images were not found on the social media platform X.X and xAI were previously contacted by Ofcom, following reports Grok can be used to make \"sexualised images of children\" and undress women.The BBC has seen several examples on the social media platform X of people asking the chatbot to alter real images to make women appear in bikinis without their consent, as well as putting them in sexual situations.The IWF said it had received reports of such images on X, however these had not so far been assessed to have met the legal definition of CSAM.In a previous statement, X said: \"We take action against illegal content on X, including CSAM, by removing it, permanently suspending accounts, and working with local governments and law enforcement as necessary.\"Anyone using or prompting Grok to make illegal content will suffer the same consequences as if they upload illegal content.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "IWF finds sexual imagery of children which 'appears to have been' made by Grok",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f31e/live/872207a0-ebf3-11f0-8608-ef259671aea9.jpg"
      ],
      "datePublished": "2026-01-08T09:58:38.000Z",
      "dateModified": "2026-01-08T09:58:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man admits attempted murder of soldier near Chatham army barracks",
    "url": "https://www.bbc.com/news/articles/c20xp6pgp43o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6a2f/live/2d9a4720-cb90-11f0-8b24-8191145688b1.jpg",
    "tag": "Trending",
    "date": "2026-01-08T12:09:00.000Z",
    "description": "Man admits knife attack on soldier near barracks21 minutes agoJoshua AskewSouth EastPA MediaAnthony Esan's trial was delayed several timesA man has pl",
    "body": "Man admits knife attack on soldier near barracks21 minutes agoJoshua AskewSouth EastPA MediaAnthony Esan's trial was delayed several timesA man has pleaded guilty to trying to murder a uniformed Army officer in a knife attack outside a barracks in Kent.Anthony Esan, 25, admitted to the attempted murder of Lt Col Mark Teeton, who he stabbed \"repeatedly\" in Sally Port Gardens, near Brompton Barracks in Chatham, on 23 July 2024.Esan was arrested near his home in Rochester about 25 minutes after the attack.The case had been delayed several times over concerns around Esan's mental health and fitness to plead.Esan appeared at Maidstone Crown Court via video-link from Broadmoor Hospital on Thursday.He also admitted to the possession of two bladed weapons.Teeton, who was taken to hospital with serious injuries after the attack, was there in court to hear the pleas. 'Horrific experience'At a previous hearing, prosecutor Rajni Prashar said a man was seen \"running up behind\" Teeton before he \"pulled the soldier to the ground\". He stabbed him \"repeatedly\" and drove away on a moped, she continued. Two knives were dropped at the scene and a further three were found stored on the bike, the prosecutor added.Brompton Barracks is the headquarters of the British Army's 1 Royal School of Military Engineering Regiment.Teeton is a chartered engineer working as a course manager in the Army's Corps of Royal Engineers, according to a LinkedIn page. Mark Teeton/FacebookTeeton thanked people for their generosity after the attackTeeton was discharged from hospital in August. An online fundraiser raised almost £50,000 to support him and his family.The officer, who has worked in various roles in the armed forces since 2001, earlier thanked the \"overwhelming\" generosity of strangers who had donated towards his recovery.\"We took strength and comfort from all the messages when we had just been through the most horrific experience,\" he said.\"Our family cannot thank those people enough.\"Esan is due to be sentenced at Maidstone Crown Court from 9-11 February. More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man admits attempted murder of soldier near Chatham army barracks",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6a2f/live/2d9a4720-cb90-11f0-8b24-8191145688b1.jpg"
      ],
      "datePublished": "2026-01-08T12:09:00.000Z",
      "dateModified": "2026-01-08T12:09:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "McDonald's sexual abuse: Government offers to intervene in row with unions",
    "url": "https://www.bbc.com/news/articles/c2e1g17drr2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cbf7/live/f8a2ea80-ebc0-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-08T00:00:14.000Z",
    "description": "12 hours agoNoor Nanji & Zoe ConwayBBC NewsA group of trade unions has alleged McDonald's has violated international labour standards by failing to ta",
    "body": "12 hours agoNoor Nanji & Zoe ConwayBBC NewsA group of trade unions has alleged McDonald's has violated international labour standards by failing to tackle sexual harassment in its UK restaurants and franchises.It comes after a BBC investigation exposed a toxic culture at the fast-food chain in which workers, some as young as 17, were being groped and harassed. Last year, McDonald's staff told us they still faced sexual abuse and harassment.The unions complained to an independent unit within government which has now offered to intervene by mediating between the unions and McDonald's.The fast-food chain said it was \"reviewing the information and considering next steps\".The complaint from trade unions was referred to the UK National Contact Point (NCP) - an independent unit which sits with the Department for Business and Trade, run by a mix of civil servants and external advisors.After conducting an initial assessment, the UK NCP has decided the complaint merits further consideration and will now offer mediation to both parties.McDonald's - A toxic workplace for teenagers?The group of five trade unions, including the Bakers Union and the TUC, alongside the Corporate Justice Coalition, state that their complaint - which was lodged in February 2024 - was prompted by the BBC's investigation.The complaint said there had been \"further evidence of persistent, deeply rooted gender-based discrimination\" in McDonald's restaurants, in breach of Organisation for Economic Co-operation and Development (OECD) guidelines.It described \"repeated episodes\" of harassment against McDonald's workers, \"most of them teenagers\". It also accuses managers of failing to stop such behaviour.The Department for Business and Trade said its decision to accept the complaint is not a finding against McDonald's. It also said it does not mean that it considers that the company has acted inconsistently with OECD guidelines.It said the mediation offer is voluntary and if any party declines to take part, the UK NCP will conduct a further examination of the complaint.Ian Hodson, president of the Bakers Union, said the stories exposed in the BBC investigation were \"horrific\" and had \"helped to shine a light on workplace harassment\".\"The most important thing to me is the workers,\" he told BBC News. \"Their voices need to be heard. Everyone deserves the right to be safe when they go to work.\"Luise Schroter, senior policy officer at the Corporate Justice Coalition, said harassment at McDonald's \"must end\".\"Workers and their unions are key to ending these systemic abuses and must not be sidelined,\" she said.McDonald's workers speak out over sexual abuse claimsMcDonald's workers make fresh harassment claimsMcDonald's abuse: MeToo hasn’t helped these teenage workersAfter the initial BBC investigation, McDonald's apologised and set up a new unit to deal with complaints.But since then, more than 160 people have approached the BBC with allegations, while the EHRC has heard 300 reported incidents of harassment.Last January, McDonald's workers told us they still faced sexual harassment more than a year after its chief executive promised to clean up behaviour at the fast-food chain.More than 700 current and former junior employees are now taking legal action against the firm.Kiran Daurka, employment partner at law firm Leigh Day, which is representing the workers, says their clients accuse McDonald’s of failing to protect them.In November, the equality watchdog said McDonald's would bring in new sexual harassment training for managers in strengthened measures agreed with it to protect its staff from abuse.At the time, McDonald's said it welcomed the new measures, adding that they would \"build on the significant progress we have already made in this space\".Responding to the latest developments, a McDonald's spokesperson said: \"We are aware of the NCP's initial assessment and continue to engage constructively with the OECD process.\"We are reviewing the information and considering next steps.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "McDonald's sexual abuse: Government offers to intervene in row with unions",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cbf7/live/f8a2ea80-ebc0-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-08T00:00:14.000Z",
      "dateModified": "2026-01-08T00:00:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man who threw boy from Tate Modern jailed for Broadmoor assaults",
    "url": "https://www.bbc.com/news/articles/c050mpy3y30o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1350/live/b090d230-ec82-11f0-9e8f-711b96aa17e7.png",
    "tag": "Trending",
    "date": "2026-01-08T11:18:32.000Z",
    "description": "Tate Modern attacker sentenced for nurse assaults1 hour agoMet PoliceBravery was jailed for life in 2019 after he threw the boy from the galleryA man ",
    "body": "Tate Modern attacker sentenced for nurse assaults1 hour agoMet PoliceBravery was jailed for life in 2019 after he threw the boy from the galleryA man who was already serving a life prison term for throwing a six-year-old off the Tate Modern has been sentenced for assaulting two nurses at Broadmoor Hospital.Jonty Bravery, 24, kicked one of the women in the thigh and \"clawed\" at the face of a second, leaving her with blood dripping down her cheek.Bravery was given a life sentence for hurling a French boy from the London art gallery's 10th storey balcony in 2019 and is being held at the high security hospital in Crowthorne, Berkshire.He was sentenced at Westminster Magistrates' Court to 16 weeks in jail after being found guilty in his absence last November. The sentence will run concurrently with his existing 15-year minimum term. Passing sentence, Chief magistrate Paul Goldspring, who had found Bravery guilty of two counts of assault, said those who \"care\" for Bravery were the targets of his assaults.Goldspring found he had assaulted Linda McKinlay and Kate Mastalerz in September 2024.The defendant refused to appear at the hearing via video link.Jessica Hart, from the Crown Prosecution Service, said: \"This was a violent and distressing incident for the nurses who were simply doing their jobs. No one should ever face this kind of aggression while providing care.\" In 2020, Bravery was handed a 14-week jail sentence after he admitted attacking two other Broadmoor staff.More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man who threw boy from Tate Modern jailed for Broadmoor assaults",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1350/live/b090d230-ec82-11f0-9e8f-711b96aa17e7.png"
      ],
      "datePublished": "2026-01-08T11:18:32.000Z",
      "dateModified": "2026-01-08T11:18:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Flu bouncing back after Christmas mixing, says NHS",
    "url": "https://www.bbc.com/news/articles/c9qp47ze35do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cfa0/live/d61063a0-ec81-11f0-9e8f-711b96aa17e7.jpg",
    "tag": "Trending",
    "date": "2026-01-08T11:14:50.000Z",
    "description": "Flu on the rise again after Christmas mixing, says NHS1 hour agoNick TriggleHealth correspondentGetty ImagesChristmas gatherings may have caused a res",
    "body": "Flu on the rise again after Christmas mixing, says NHS1 hour agoNick TriggleHealth correspondentGetty ImagesChristmas gatherings may have caused a resurgence in flu and other winter viruses, NHS leaders say.Figures show that the average number of patients in hospital beds in England with flu last week hit 2,924 - a rise of 9% on the previous week. This comes after two weeks of decreasing numbers, prompting hope flu cases may have peaked.NHS England medical director Prof Meghana Pandit said a combination of the vicious cold snap and winter viruses was making services \"extremely busy\".Hospitals are reporting the icy conditions have led to a rise in patients seeking help for injuries from slips and falls as well as struggling with respiratory conditions.Pandit said: \"It's clear that the worst is far from over for the NHS this winter.\"Despite the pressures, there are signs the NHS is coping better than in the last few winters.Ambulance delays when handing patients over to A&E staff were lower over the Christmas than the year before.Health Secretary Wes Streeting said: \"Today's data shows we are not out of the woods yet.\"While the NHS is better prepared and performing more strongly than this time last year thanks to the tireless work of staff, the current cold snap is putting fresh pressure on frontline services.\"Sarah Sleet, of Asthma and Lung UK, said people with lung conditions were facing a \"deadly duo\" of freezing temperatures, which can worsen breathlessness and wheezing, and flu.She urged people with lung conditions to protect themselves by breathing through their noses when outside as it helps warm the air as does loosely wrapping a scarf around your nose and mouth.While flu cases have gone up, they are still well below the peak of last year which exceeded 5,000.As well as flu, the number of patients in hospital with Covid and the vomiting bug norovirus have also increased.Sarah Woolnough, of The King's Fund health tank, said despite signs the NHS was coping better than in previous years the pressures being experience were still not sustainable and were not allowing service to provide the \"best possible outcomes for patients\".The warning comes as the Health Services Safety Investigations Body has warned that risky corridor care is becoming normalised in hospitals across the country.The watchdog said patients being brought into A&E were being treated in waiting rooms, corridors and in ambulances outside hospital because of a lack of beds.Dr Vicky Price, president of the Society for Acute Medicine, said there was a deepening crisis in emergency care.She warned there were \"people dying as a direct consequence\" of the situation and called for immediate action to address the pressure.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Flu bouncing back after Christmas mixing, says NHS",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cfa0/live/d61063a0-ec81-11f0-9e8f-711b96aa17e7.jpg"
      ],
      "datePublished": "2026-01-08T11:14:50.000Z",
      "dateModified": "2026-01-08T11:14:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "No forensics used to ID boys in Rotherham crash death mix-up",
    "url": "https://www.bbc.com/news/articles/cx2wgpx1990o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0a50/live/456c2bf0-ebf4-11f0-8608-ef259671aea9.jpg",
    "tag": "Trending",
    "date": "2026-01-08T12:01:58.000Z",
    "description": "29 minutes agoVictoria Scheerin Doncaster Coroner's CourtSuppliedPolice told Trevor Wynn's family he had died in a car crash before it emerged he was ",
    "body": "29 minutes agoVictoria Scheerin Doncaster Coroner's CourtSuppliedPolice told Trevor Wynn's family he had died in a car crash before it emerged he was being treated in hospitalA teenager wrongly believed to have died in a car crash was misidentified by police through visual checks as no forensic tests were initially carried out, a coroner has been told.Trevor \"TJ\" Wynn, 17, was reported to have died in the 13 December collision while the family of Joshua Johnson, 18, were told he had been seriously injured.However, doubts emerged when the injured boy woke in hospital three weeks later and confirmed he was Trevor and not Joshua, Doncaster Coroner's Court heard.Asked if issues with identification had now been fully resolved, South Yorkshire Police's Det Ch Insp Andy Knowles told the coroner: \"Yes, to a high degree of certainty.\"The crash happened between Dinnington and Todwick near Rotherham, in the early hours when the silver Toyota Corolla the group were in left the road and collided with a tree.Knowles told the hearing, overseen by Senior Coroner Nicola Mundy, the female driver, Summer Louise Scott, 17, and one male passenger died at the scene, while a second male was left critically injured.South Yorkshire PoliceJoshua Johnson's parents described him as a \"loveable, gentle giant\" who was \"ever so genuine in his care for others\" after his death was confirmedKnowles said several personal items were found at the scene of the crash, but none were physically on a person.These included a phone in a case and a driving licence in the name of Joshua Johnson, as well as a second phone displaying medical identification in the name of Trevor Wynn, with a bank card attached to the device.Knowles said one of the attending officers used this to establish the next of kin and called Trevor's mother to explain what had happened.She provided her son's college identification card plus a description of his appearance, build and footwear.The ID card was then taken to the mortuary by the officer, Knowles said, where  details of build and clothing were compared.\"The officer was satisfied that this was the body of Trevor Wynn,\" he added.Meanwhile, a second officer, who had been travelling in an ambulance with the surviving male, said he had been told by an officer at the scene the victim was Joshua Johnson, based on driving licence photos.That officer then liaised with medical staff at the hospital and the photograph was compared with the victim.The medical staff and officer were satisfied the person in hospital was Joshua Johnson, said Knowles, who had no involvement in the investigation prior to 5 January.Doubts about identity emerged when the boy woke up on Sunday, prompting Johnson's father to call South Yorkshire Police and voice concerns the person in hospital was not his son.Knowles said at that point it was decided police would no longer rely on visual identification and obtained dental records, which confirmed the boy in hospital was  actually Trevor.The incident occurred on the road between Dinnington and TodwickDoncaster Coroner's Court officer Siobhan Golightly said she had no reason to doubt the police identification and said an inquest had been opened for Trevor on 22 December.\"At no point prior [to 4 January] did any individual or organisation raise any concerns which would've caused me to question the identification of the deceased.\"It was the first time it was raised with the coroner's office and relayed to the senior coroner,\" she added.Concluding Thursday's hearing, which Johnson's parents joined via videolink, Mundy said she was satisfied the inquest did, in fact, concern Joshua Johnson and not Trevor Wynn.She told Johnson's family the coroner's investigation would continue but any potential criminal proceedings would take priority.An 18-year-old arrested on suspicion of causing death by dangerous driving and a 19-year-old arrested on suspicion of perverting the course of justice remain on bail pending further inquiries, police said on Wednesday.'Awful consequences'South Yorkshire Police previously said the force had referred itself to the Independent Office for Police Conduct (IOPC) after identifying the error.The IOPC said on Thursday an independent investigation was now under way to look at the actions and decision-making of police involved in the identification process.IOPC director Emily Barry said expressed her \"sincere condolences\" to all those involved, adding: \"It's hard to imagine what these families have been through in the past few weeks. \"It is clear something has gone very wrong with awful consequences for them.\"More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "No forensics used to ID boys in Rotherham crash death mix-up",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0a50/live/456c2bf0-ebf4-11f0-8608-ef259671aea9.jpg"
      ],
      "datePublished": "2026-01-08T12:01:58.000Z",
      "dateModified": "2026-01-08T12:01:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Greenland: Vance criticises Denmark and Europe's handling of 'critical' territory",
    "url": "https://www.bbc.com/news/articles/c2lgjd51v95o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9e05/live/080bb350-ec87-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-08T12:11:27.000Z",
    "description": "US Vice-President JD Vance says Greenland is \"critical\" for the defence of the US and the world against possible Russian or Chinese missile attacks - ",
    "body": "US Vice-President JD Vance says Greenland is \"critical\" for the defence of the US and the world against possible Russian or Chinese missile attacks - and that Europe and Denmark have \"not done a good job\" in securing the area.Vance told Fox News that they had not only under-invested in Greenland's defences, but also failed to engage with President Donald Trump's argument over the issue.US officials are \"actively\" discussing a potential offer to buy Greenland - a semi-autonomous Danish territory - the White House said on Wednesday, a day after suggesting military action to annex it to the US was also an option.Denmark, a fellow Nato member, has warned this would spell the end of the alliance.Both Greenland and Denmark have repeatedly stressed the island is not for sale.Despite being the most sparsely populated territory, Greenland's location between North America and the Arctic makes it well placed for early warning systems in the event of missile attacks, and for monitoring vessels in the region.Pituffik Space Base, formerly known as Thule Air Base, has been operated by the US since World War Two.In recent years, there has also been increased interest in Greenland's natural resources - including rare earth minerals, uranium and iron - which are becoming easier to access as its ice melts due to climate change. Scientists think it could also have significant oil and gas reserves.\"People do not realise that the entire missile defence infrastructure is partially dependent on Greenland,\" Vance said in his interview on Wednesday.\"If God forbid the Russians and the Chinese - not saying they're going to - but if, God forbid, somebody launched a nuclear missile into our continent, they launched a nuclear missile at Europe, Greenland is a critical part of that missile defence. \"So you ask yourself, 'have the Europeans, have the Danes done a proper job of securing Greenland and of making sure it can continue to serve as an anchor for world security and missile defence?' And the answer is obviously they haven't,\" he said. Concerns over the future of the territory resurfaced after Trump's use of military force against Venezuela on Saturday to seize its President Nicolás Maduro. Trump previously made an offer to buy the island in 2019, during his first presidential term, only to be told it was not for sale.US Secretary of State Marco Rubio said on Wednesday that he would hold talks with Denmark next week.A day earlier, European leaders issued a joint statement rallying behind Denmark.\"Greenland belongs to its people, and only Denmark and Greenland can decide on matters concerning their relations,\" the leaders of France, the UK, Germany, Italy, Poland, Spain and Denmark said in a joint statement.Stressing they were as keen as the US on Arctic security, the European signatories said this must be achieved by Nato allies, including the US, \"collectively\".They also called for \"upholding the principles of the UN Charter, including sovereignty, territorial integrity and the inviolability of borders\".Aaja Chemnitz, one of two MPs in the Danish parliament representing Greenland, told the BBC that the comments from the Trump administration were \"a clear threat\".\"It's completely disrespectful from the US side to not rule out annexing our country and to annex another Nato ally,\" she said.But Chemnitz said she saw this as unlikely and that instead, \"what we are going to see is that they will put pressure on us in order to make sure that they will take over Greenland over time\".Aleqatsiaq Peary, a 42-year-old Inuit hunter living in Greenland's remote northerly town of Qaanaaq, appeared indifferent to the potential of US ownership.\"It would be switching from one master to another, from one occupier to another,\" he told the BBC. \"We are a colony under Denmark. We are already losing a lot from being under the Danish government.\"Saying that he did not have \"time for Trump\", he added that people were \"in need\". Hunters like him, he explained, hunted with dogs on the sea ice and fish \"but the sea ice is melting and hunters cannot make a living anymore\".Additional reporting by Adrienne Murray in Copenhagen",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Greenland: Vance criticises Denmark and Europe's handling of 'critical' territory",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9e05/live/080bb350-ec87-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-08T12:11:27.000Z",
      "dateModified": "2026-01-08T12:11:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gaza children return to school after years without formal education",
    "url": "https://www.bbc.com/news/articles/c62vmn30j3yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1228/live/6b84a350-e814-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2026-01-08T06:11:11.000Z",
    "description": "6 hours agoShaimaa KhalilBBC News, JerusalemBBCAccording to Unicef, more than 97% of schools in Gaza were damaged or destroyed during the warIn Gaza C",
    "body": "6 hours agoShaimaa KhalilBBC News, JerusalemBBCAccording to Unicef, more than 97% of schools in Gaza were damaged or destroyed during the warIn Gaza City, the sound of children learning can be heard once again.The tents that now serve as classrooms are noisy and a little chaotic but lively. Some teachers point to boards covered in English letters; others invite pupils to come forward and write basic Arabic words.It is nowhere near a normal school day. But after the Israel-Hamas ceasefire in October, it's a start.After two years of war, the hum of lessons and chatter of classmates resonates around the ruins of what was once Lulwa Abdel Wahab al-Qatami School, in the Tel al-Hawa neighbourhood in the south-western part of Gaza City.It was hit in January 2024, and for months afterwards, its grounds served as a shelter for displaced families. Today, it is again a place of learning - albeit in a more basic form.Walking in a straight line, their small arms resting on each other's shoulders, pupils smile as they head into the makeshift classrooms.For many, this is the first return to routine and education since the war began.According to Unicef, more than 97% of schools in Gaza were damaged or destroyed during the war. The IDF has made repeated claims that Hamas uses civilian infrastructure including schools to carry out operations but has rarely provided solid evidence. Of the Strip's 658,000 school-aged children, most have had no formal education for nearly two years. During that time, many learned first-hand how hunger, displacement and death can shape their young lives. Now, something rare is emerging: a fragile glimpse of the childhoods they once knew.For many children at this school, it's the first return to education since the war beganFourteen-year-old Naeem al-Asmaar used to attend this school before it was destroyed. He lost his mother in an Israeli air strike during the war.\"It was the hardest thing I've ever been through,\" he says quietly.Although he was displaced for months, Naeem's home in Gaza City survived. After the ceasefire, he returned with his family.\"I missed being in school a lot,\" Naeem said adding that the difference is stark.\"Before the war, school was in real classrooms,\"\"Now it's tents. We only study four subjects. There isn't enough space. The education is not the same - but being here matters. School fills all my time and I really needed that.\"Rital Alaa Harb, a ninth-grade student who once studied here too, wants to become a dentist.\"Displacement affected my education completely,\" she says. \"There was no time to study. No schools. I missed my friends so much - and I miss my old school.\"The makeshift school is run by Unicef and brings together children from the original Lulwa school and others displaced by the war.It does not teach the full Palestinian curriculum - only the basics: Arabic, English, mathematics and science.The principal, Dr Mohammed Saeed Schheiber, has worked in education for 24 years. He took over management of the site in mid-November.\"We started with determination,\" he said, \"to compensate students for what they lost.\"Dr Mohammed Saeed Schheiber says many of the children are struggling with traumaThe school currently serves 1,100 boys and girls, operating in three shifts a day - with boys attending on alternating days from girls. There are just 24 teachers.\"Before the war,\" Dr Schheiber says, \"our students learned in fully equipped schools - science labs, computer labs, internet access, educational resources. All of that is gone.\"There is no electricity here. No internet. And many children are struggling with trauma.More than 100 students at the school lost one or both parents, had their homes destroyed, or witnessed killings during the war. In total, Dr Schheiber says, every student has been affected - directly or indirectly.A counsellor now runs psychological support sessions, trying to help children process what they have endured.Despite the effort, demand far exceeds capacity.\"We have more than a thousand students here already,\" Dr Schheiber says. \"But only six classrooms per shift. There is a large displacement camp next to the school - families from northern and eastern Gaza. Many children want to enrol. We simply cannot take them.\"Many parents say their children have lost years of educationFor parents, the return to school brings relief as well as anxiety.Huda Bassam al-Dasouki, a mother of five displaced from southern Rimal, says education has become an overwhelming challenge.\"It's not that education doesn't exist,\" she says. \"It's that it's extremely difficult.\"Even before the war, schools struggled with shortages, she says. Now, basic supplies are unaffordable or unavailable.\"A notebook that cost one shekel ($0.31; £0.23) before the war now costs five,\" she says. \"I have five children.\"Some children, she says, have fallen four years behind, including time lost during the Covid pandemic.\"My son can't read. He can't write. He doesn't know how to copy from the board,\" she says.Jonathan Crickx says schools have been affected by restrictions on aid suppliesUnicef says the situation is made worse by restrictions on aid supplies entering Gaza.Standing outside one of the school tents, Jonathan Crickx, a Unicef spokesman, points to what is missing.\"Paper, notebooks, pens, erasers, rulers... we've been asking for a long time that these supplies can enter the Gaza Strip and they haven't been allowed in. It's the same for mental health and psychosocial recreative kits - toy kits that can be used to do mental health activities and recreational activities with the children,\" he says.An Israeli security official referred us to the prime minister's office, which did not respond to the BBC's questions.Israel says it is meeting its obligations under the ceasefire deal with Hamas and facilitating increased aid deliveries. The UN and multiple aid agencies dispute that, accusing Israel of continuing to restrict access to essential supplies.Despite the ceasefire, Israel's bombardment of Gaza continues - with almost daily strikes - in response to what it says are Hamas violations of the deal. Still, the children keep coming.For Kholoud Habib, a teacher at the school, that determination is telling.\"Education is our foundation,\" she says. \"As Palestinians, it is our capital.\"We lose homes. We lose money. We lose everything,\" she adds. \"But knowledge - knowledge is the one investment we can still give our children.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gaza children return to school after years without formal education",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1228/live/6b84a350-e814-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2026-01-08T06:11:11.000Z",
      "dateModified": "2026-01-08T06:11:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Greenlanders express fear and indignation as Trump eyes territory",
    "url": "https://www.bbc.com/news/articles/cvgx8w4pgk0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3613/live/27934480-ec10-11f0-bb47-dd0326c45745.jpg",
    "tag": "Trending",
    "date": "2026-01-07T22:59:09.000Z",
    "description": "14 hours agoGabriela Pomeroy & Alicia Curry,in LondonandAdrienne Murray,in CopenhagenMia ChemnitzMia Chemnitz says \"the people of Greenland do not wan",
    "body": "14 hours agoGabriela Pomeroy & Alicia Curry,in LondonandAdrienne Murray,in CopenhagenMia ChemnitzMia Chemnitz says \"the people of Greenland do not want to become American\"\"The people of Greenland do not want to become American,\" Mia Chemnitz tells the BBC. \"We are not for sale.\"The 32-year-old business owner in the Greenlandic capital Nuuk reflects the sentiments of many who spoke to the BBC about how they felt about recent rhetoric from the Trump administration.The White House has said it was \"actively\" discussing an offer to buy the territory that has for centuries belonged to Denmark. US President Donald Trump and his officials had earlier intimated a willingness to take it by force if necessary.This has been met with nervousness and opprobrium among Greenlanders - both on the world's largest island and elsewhere.This nervousness has only grown since the US took Venezuela's President Nicolás Maduro from his residence in Caracas to New York on drug-trafficking and narco-terrorism charges in an unprecedented military move.Almost immediately after, the wife of a senior White House staffer indicated that Greenland was next.\"That's when it stopped feeling abstract,\" says Tupaarnaq Kopeck, 40, who moved to Canada - another place Trump has threatened to annex - for family and work.\"For the first time, I contacted my sister in Greenland and told her that if the unthinkable ever became reality, they would have a place to stay with us.\"Aaja Chemnitz, one of two MPs in the Danish parliament representing Greenland, says the comments from the Trump administration are \"a clear threat\" that she was \"appalled\" by.\"It's completely disrespectful from the US side to not rule out annexing our country and to annex another Nato ally,\" she says.Tupaarnaq KopeckTupaarnaq Kopeck says the military intervention in Venezuela made the \"abstract\" feel realGreenland is the world's most sparsely populated territory. With much of the Arctic island covered by ice, most of the population lives in Nuuk and the surrounding south-western coastline.But it is strategically significant to the US - which is why it has had a military presence there since World War Two. Greenland's location between North America and the Arctic makes it well placed for early warning systems in the event of missile attacks.More recently, there has also been increased interest in Greenland's natural resources, including rare earth minerals, which are becoming easier to access as its ice melts due to climate change.\"It's not fun being 56,000 people and having these threats - if you can call them that - from a giant like the US,\" says Masaana Egede, editor of Greenlandic newspaper Sermitsiaq.\"The citizens of Greenland are nervous about this, because this is not something that we take lightly.\"Experts generally agree that a military takeover of Greenland would be an easy undertaking for the US - but that the geopolitical fallout would effectively end the Nato alliance.After the issue of Greenland's ownership was raised anew by the White House, six European allies issued a statement saying its future should be decided by its people - something Mia says she is grateful for.But she worries this will matter little to the US \"if it's not backed with consequences and actions\".\"As a Greenlander, I can't help but wonder: what are we worth to these allies? To what lengths are they willing to go to protect us?\"Tupaarnaq says: \"Respect is about more than alliances on paper. When powerful nations talk about you instead of with you, that respect disappears very quickly.\"Aleqatsiaq PearyAleqatsiaq Peary, a 42-year-old Inuit hunter says a US takeover would just \"replace one occupier with another\"The Trump administration has stressed its intention was to buy Greenland from Denmark - despite Copenhagen reiterating the territory was not for sale - while retaining a military intervention as an option.Aaja sees annexation by force as unlikely - instead, \"what we are going to see is that they will put pressure on us in order to make sure that they will take over Greenland over time\".Polling consistently shows that Greenlanders generally favour eventual independence from Denmark but oppose being owned by the US. The territory is largely self-governing, with control of foreign affairs and defence retained by Copenhagen.This is perhaps why Aleqatsiaq Peary, a 42-year-old Inuit hunter living in the remote northerly town of Qaanaaq, seemed unfazed by the prospect of US ownership.\"It would be switching from one master to another, from one occupier to another,\" he says. \"We are a colony under Denmark. We are already losing a lot from being under the Danish government.\"But he says: \"I don't have time for Trump. Our people are in need,\" explaining hunters like him hunt with dogs on the sea ice and fish, \"but the sea ice is melting and hunters cannot make a living anymore\".For Sermitsiaq editor Masaana, the rhetoric from the US is pushing a fallacious binary choice.\"We really have to try to avoid getting the story going to a place where it's Greenland that has to decide between the US and Denmark, because that is not the choice that the Greenlandic people want.\"Christian KeldsenChristian Keldsen says \"people in Greenland are getting really irritated with this\"For others, who see the strong relationship Greenland already has with the US being soured, there is a clear sense of indignation.\"People in Greenland are getting really irritated with this,\" says Christian Keldsen of the Greenland Business Association.\"Greenlanders are welcoming and open-hearted, it's the best thing about the country. But now with this, some people are scared.\"Greenland is open for business with the US, Christian stresses, noting that there are new direct flights from Greenland to New York - a sure sign \"they don't need to take us over\".\"We are a well-functioning democracy and our government has a strong mandate,\" Mia says. \"We are a Nato ally and the US has had military bases in Greenland for over 70 years - and still has the right to establish and run new and more.\"As it has been stated from Greenland before: we are not for sale, but we're open for business.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Greenlanders express fear and indignation as Trump eyes territory",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3613/live/27934480-ec10-11f0-bb47-dd0326c45745.jpg"
      ],
      "datePublished": "2026-01-07T22:59:09.000Z",
      "dateModified": "2026-01-07T22:59:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "We were fired, and we're owning it – here's how to find a new job that works for you",
    "url": "https://www.bbc.com/news/articles/cwyvw1ev9rro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ad3f/live/b8004f60-ebc8-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-08T01:58:50.000Z",
    "description": "11 hours agoEmily HoltBBCKristina and Laura have written a book titled 'All the Cool Girls Get Fired' about their experiences. The new year is a natur",
    "body": "11 hours agoEmily HoltBBCKristina and Laura have written a book titled 'All the Cool Girls Get Fired' about their experiences. The new year is a natural time to reflect, and for many of us, that involves thinking about our careers. Kristina O'Neill and Laura Brown are both editors who lost their jobs after restructures, and they initially thought it was the end of the world.\"I poured my heart into the role... I believed in the values we promoted. Yet, when it came to me, those values weren't there,\" says Laura. They both chose to use the word fired after they lost their roles and say being open about it can help you deal with what's happened.\"There are so many euphemisms that we all use for losing our jobs. But the faster you own it, the faster you're honest about it, the faster you can move on.\"That's the fast track to whatever you want to do next,\" adds Laura.Now, they are thriving in new jobs, with Laura owning her own media company and Kristina editor in chief for Sotheby's magazine. If you've lost your job or are simply looking for a new career, here are four ways to help.1. Reflect on the past year Getty ImagesIt's natural to feel a bit low about work if  you've had a break over the festive period.Sarah Ellis, co-founder of careers website, Squiggly Careers and Amazing If, says it is important to reflect on the past year before diving into a new job search. She encourages people to think about what they want to do more or less of, and what inspires or drains their energy. Looking back through your successes to find common themes can help too. \"Try not to just look at the last month, because we all have a bit of recency bias that can get in the way,\" she adds.Laura says it is also important to decide where your work sits in your life.  This involves being honest about how much time you're working and its impact on your social and family life.After losing her role, she advises not letting your life be defined by your work.2. Take small steps Getty ImagesSarah says people can make small steps towards a career change without diving in head first. She took seven years to make the jump from her corporate career to running her own company full time, working on her project alongside her job, which meant she could pay herself from the start. \"It took a bit longer, but that was how I did it in a sustainable way\", she says. Sarah recommends a \"try before you buy\" approach.This could be volunteer work, getting involved in a work project that interests you, or saying yes to something different within your existing team.\"Worst case scenario, you don't like that area, but it's better to know now than to know when you've made the move,\" she says. Sarah also encourages looking into small \"bridging roles\". These may not be ideal, but serve as a step in the right direction, such as a role which has similarities to the career you want, but not in the exact industry.\"It's giving yourself space to say this is good for now, but that isn't the same as forever.\"That can be a really smart strategy for getting much closer to that career change.\"3. Remember your achievementsGetty ImagesIf you've recently lost your job, you aren't alone - redundancies have surged to their highest rate since 2021, official figures indicate.Laura was editor in chief of a style magazine, but in 2022 she and her team were laid off after her firm closed the print version of the magazine.  Understanding this did not mean she wasn't good at her job helped her process the change. \"What you've learned doesn't go away because you lost your job.\"Don't give your power up, it's important for everybody to remember their own value.\"Kristina was fired after a 10-year spell at a financial magazine after a regime change at the top and the arrival of a new editor. She stresses that so much of the shame of being fired is \"in your head\". \"In the US, especially hundreds of thousands of people being laid off, it's not personal. It's likely very much not you, so don't take that ball of shame and carry it around.\"4. Create a career check-list Getty ImagesIf you're desperately looking for work or utterly miserable in your current role, it can be tempting to dive straight into applying for any job - ignoring personal happiness. But Sarah says this is a big mistake.Instead, she suggests an exercise called \"scanning\" - narrowing your search down to job descriptions that sound interesting to you.She recommends going through websites like LinkedIn, and gathering around 10 to 15 that you like the look of.  \"What are the words that keep coming up?\" she says. \"Because [these] will give you some clues as to the things that matter most to you.Through this, you can create your own career check list, and avoid wasting time on ill-fitting applications.Laura stresses it's also important to think about what has made you happy and unhappy over the course of your career. \"It may not be what you can do all the time, but it could be something that's lit up in you, that you've forgotten,\" she says. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "We were fired, and we're owning it – here's how to find a new job that works for you",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ad3f/live/b8004f60-ebc8-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-08T01:58:50.000Z",
      "dateModified": "2026-01-08T01:58:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Terry Yorath: Leeds and Wales legend dies aged 75",
    "url": "https://www.bbc.com/sport/football/articles/ce8e5rg2dyxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c72c/live/1aec67e0-ec68-11f0-9ce3-0774ae46fe08.jpg",
    "tag": "Trending",
    "date": "2026-01-08T08:16:48.000Z",
    "description": "Former Leeds United and Wales midfielder Terry Yorath has died at the age of 75 following a short illness.Yorath scored 11 goals in 199 appearances fo",
    "body": "Former Leeds United and Wales midfielder Terry Yorath has died at the age of 75 following a short illness.Yorath scored 11 goals in 199 appearances for Leeds, his first professional club, in a nine-year spell from 1967. He won the First Division title with Leeds in 1974 and earned a runners-up medal in the FA Cup, European Cup and Cup Winners' Cup.He played 59 times for Wales, 42 as captain, before leading them to the brink of the 1994 World Cup finals as manager, only to see his team beaten 2-1 by Romania in their final qualifier.Yorath had spells as a player with Coventry City, Tottenham Hotspur, Vancouver Whitecaps and Bradford City, before finishing his playing career with a solitary appearance for Swansea City.The father of BBC Sport presenter Gabby Logan, Yorath was a player-coach of Bradford on the day of the Valley Parade fire in 1985, which killed 56 fans and injured 270. In addition to Gabby, Yorath had three other children - Daniel, Louise and Jordan. In 1992, Daniel died aged 15 from the genetic heart condition hypertrophic cardiomyopathy while playing football at home with his father.\"To most he was a revered footballing hero, but to us he was dad; a quiet, kind and gentle man. Our hearts are broken but we take comfort knowing that he will be reunited with our brother, Daniel,\" Yorath's children said in a statement.Gabby was presenting Match of the Day on Wednesday night but left during the broadcast and was replaced by Mark Chapman, who said his co-host had to leave for a \"family emergency\".After hanging up his boots, Yorath moved into management and had spells in charge of Swansea, Wales, Bradford, Cardiff, Lebanon, Sheffield Wednesday and Margate.He steered Swansea to promotion from the Fourth Division in 1988, before almost guiding Wales to a first World Cup finals since 1958.\"He had great leadership qualities,\" former Wales and Cardiff striker Nathan Blake told Radio Wales Breakfast. \"He expected a lot of professionalism, but you could have a joke with him, he could wind you up. He was a fatherly figure.\"Players like Kevin Ratcliffe and [Ian] Rush had huge respect for him.\"Leeds United said they were \"devastated\" to hear of Yorath's passing, adding: \"Our thoughts and deepest sympathies are with Terry's family, friends and former team-mates at this incredibly sad time.\"Yorath managed Wales for 41 games and led them to 16 victories, including wins against Italy and Brazil.\"The thoughts of everyone connected to the association are with Terry's family, friends and loved ones,\" the Football Association of Wales posted on X.Former Bradford striker Dean Windass wrote on X: \"Sad news, great man and a gentleman. Thoughts go to his family RIP.\"\"He was a fantastic person, with a great family,\" former Manchester United and Wales midfielder Clayton Blackmore told Radio Wales Breakfast. \"He was proud of all his kids, like Gabby [Logan]. I think that's all you can ask for as an adult. He was a fantastic guy and he'll be sadly missed.\"First Minister of Wales Eluned Morgan said: \"Football fans across Wales will never forget his feats as a player and especially as our national coach.\"Yorath spent 44 games in charge of Margate FC, who posted on X: \"Our thoughts are with the friends and family of Terry at this difficult time.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Terry Yorath: Leeds and Wales legend dies aged 75",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c72c/live/1aec67e0-ec68-11f0-9ce3-0774ae46fe08.jpg"
      ],
      "datePublished": "2026-01-08T08:16:48.000Z",
      "dateModified": "2026-01-08T08:16:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]