[
  {
    "title": "Premier League predictions: Chris Sutton v The Wellermen's Jonny Stewart - and AI",
    "url": "https://www.bbc.com/sport/football/articles/cyvg0my1zvyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/716b/live/e8173b70-de97-11f0-b67b-690eb873de1b.png",
    "tag": "Trending",
    "date": "2025-12-24T07:14:26.000Z",
    "description": "Arsenal are sitting top of the Premier League at Christmas, but it is BBC Sport football expert Chris Sutton who leads the way when it comes to predic",
    "body": "Arsenal are sitting top of the Premier League at Christmas, but it is BBC Sport football expert Chris Sutton who leads the way when it comes to predictions.\"I'm number one at Christmas - again,\" said Sutton, who as a player led the Premier League table at this point with Norwich in 1992 and Blackburn in 1994, and went on to win the title with Rovers.\"It's a big deal for me to be top, as well as for Arsenal.\"AI is the go-to for virtually everyone in the world whenever they have to ask anything, so the fact that I am beating it - and let's face it, I have stuffed it for half a season now - is pretty incredible. It says a lot about me, and I'm delighted. \"Rather than asking AI about everything, maybe people should come to me to tap into my intelligence instead?\"Sutton is making predictions for all 380 Premier League games this season, against AI, BBC Sport readers and a variety of guests.For week 18 - the festive fixtures on Boxing Day and the weekend of 27 and 28 December - he takes on Jonny Stewart, bass singer with sea shanty folk supergroup The Wellermen, who is a Newcastle fan.The Wellermen were the originators of the sea shanty trend on TikTok, with their versions of Misty Mountain, Nancy Mulligan and Hoist the Colours racking up billions of views.Do you agree with their scores? You can make your own predictions below.The most popular scoreline selected for each game is used in the scoreboards and tables at the bottom of this page.A correct result (picking a win, draw or defeat) is worth 10 points. The exact score earns 40 points.Image source, The WellermenImage caption, The Wellermen's eponymous debut album achieved 110m streams across all platforms. Their latest album, Northern Sky, is out now - as is their latest single of the same name, featuring Rose BettsSome of Jonny's earliest memories as a fan were the FA Cup finals that Newcastle lost in 1998 and 1999, but he was finally able to celebrate a trophy when the Magpies won the Carabao Cup in March.\"We were actually on tour in Colorado at the time - we had just done a show in Boulder and we had one in Denver the next day,\" he told BBC Sport.\"I was frantically Googling where I could watch the game a few weeks before, when we'd reached the final, and whether I could find anyone to watch it with me - because on Mountain Time it kicked off around 10am.\"I connected with the Mile High Magpies, the Denver area supporters' club, and they said to come along to this bar. There were a couple of Liverpool fans in there but more than 100 Newcastle fans were crammed into it. It was brilliant.\"I'd bought a Dan Burn Carabao Cup final shirt in the run-up to the game because I thought, if we win, it is going to mean so much having the ultimate local lad on the back of my jersey.\"So, when Big Dan scored one of the best headers I've ever seen to put us 1-0 up, I cried so hard.\"Being away from home, and away from my best mate Angus, who I'd usually watch our games with, was hard - he was Facetiming me from this pub in Chelmsford which had about two people in, so I'd found a much better place.\"And then I saw us totally outplay the best team in the league, and end our trophy drought. It really doesn't get much better than that.\"Chris Sutton and Jonny Stewart were speaking to BBC Sport's Chris Bevan. The AI predictions were generated using Microsoft Copilot Chat - we simply asked the tool to 'predict this weekend's Premier League scores'.Premier League predictionsFriday, 26 DecemberOld Trafford, 20:00 GMTManchester United got a bit of praise for their performance against Aston Villa, even though they were beaten.The key to how this game goes is what they do without Bruno Fernandes, and how they are going to cope without him.You look around Ruben Amorim's squad and he does not seem to have a lot of leaders in there. It will be interesting to see if Amorim plays centre-back Lisandro Martinez in that holding midfield role, the same job he did when he came on for Fernandes against Villa, because he could provide that leadership they will need.Newcastle United will be absolutely sick that they let a two-goal lead slip against Chelsea last week, while their away record has a lot of room for improvement - they have won only one of their eight away league games so far.Manchester United are three points and four places above them in the table, but they are missing a few players at the Africa Cup of Nations and, in my mind, Newcastle United have the better squad anyway.Because of that, I am going to back Eddie Howe's side here. There won't be many goals, though, and they may only need to score one to win it.Sutton's prediction: 0-1Jonny's prediction: Manchester United blow hot and cold - they are capable of playing some really nice football but I don't know where their goals will come from without Bryan Mbeumo or Bruno Fernandes. This is genuinely really hard for me to call but I am going with my heart over my head - I have to! 1-2AI's prediction: 2-2Saturday, 27 DecemberCity Ground, 12:30Nottingham Forest are still lingering just above the relegation places, and Monday's defeat at Fulham was a disappointing result for them.I still think Sean Dyche's side are going to be fine, however, and they have definitely made strides since he took charge at the end of October.This is a tricky game for Manchester City but they are on a bit of a roll at the moment.I thought Arsenal were going to run away with the title, but not any more. City are getting better and better as the season goes on, and I can understand why Pep Guardiola feels there is even more to come from his side.Rayan Cherki and Phil Foden are both flying, they are creating stacks of chances for Erling Haaland and, at the other end, they are keeping clean sheets now too. You just can't back against them at the moment, and I am expecting more moments of quality like we saw when they won 3-0 at Crystal Palace a couple of weeks ago.Sutton's prediction: 0-2Jonny's prediction: City are hitting a really good run of form at the right time. As well as Pep's tactical sophistication, I am loving seeing a flair player like Cherki get to impose his will on games. Foden is filling that David Silva role he was always earmarked for, too. 0-3AI's prediction: 1-3Emirates Stadium, 15:00People are saying that Arsenal are wobbling but I think they have had their wobble, really, when they scraped past Wolves.The Gunners won 1-0 at Everton last time out, and it was a bit of a battle, but they were up against a David Moyes side so I didn't expect anything else.My only criticism of Arsenal at the moment is that Viktor Gyokeres shouldn't be taking their penalties - Bukayo Saka should, because he is in my Fantasy team. It really annoyed me to see Gyokeres scoring from the spot against the Toffees.It won't be easy for them against Brighton, but I still think they should win this one.The Seagulls are such a strange team, and they are extremely difficult to predict.They have not won any of their past four games but they pushed Liverpool all the way when I watched them at Anfield recently, and I think they will do the same here.Sutton's prediction: 2-0Jonny's prediction: Manchester City have cut Arsenal's lead pretty dramatically and they are probably looking over their shoulders a bit. Needing two own goals to beat Wolves, one of the worst Premier League teams of all time, says a lot about where they are at the moment. Even so, I still think Arteta's side have probably got too much in the tank for the Seagulls, even though they have got ex-Gunners star Danny Welbeck leading their attack. 2-1AI's prediction: 2-1Gtech Community Stadium, 15:00Brentford picked up their first away win of the season against Wolves last time out, and their home form is really strong, although Leeds held them in their most recent game there.I feel like this game has got goals in it, because Bournemouth seem to score and concede a lot.The Cherries have drawn their past three games, and I have a feeling this is one will also end up with the points being shared.Sutton's prediction: 2-2Jonny's prediction: Brentford are a lot like Newcastle in that their home form is so strong, while their away results have been pretty poor. So, this is not an easy game for the Cherries at all - apologies to their fans because, despite spending many years living in the Bournemouth area, I don't see them returning to winning ways here. 2-0AI's prediction: 1-2Turf Moor, 15:00Burnley got a late goal that earned them a point at Bournemouth, which felt big for their boss Scott Parker - it felt like a few Clarets fans were questioning whether he is the man to keep them in the Premier League.As I've said before, I've always felt like Burnley were being competitive, even when they were losing games.This is going to be a close game, too. Everton's problem is that they are missing Iliman Ndiaye and Kiernan Dewsbury-Hall, and they might have to settle for a point.Sutton's prediction: 1-1Jonny's prediction: Scott Parker's teams seem to do incredibly well in the Championship, then struggle a bit when they get to the Premier League.Everton were on a really good run before they lost to Chelsea and Arsenal and I am backing them here, even with Ndiaye at the Africa Cup of Nations and Dewsbury-Hall injured. 0-1AI's prediction: 0-1Anfield, 15:00Poor old Alexander Isak. His form has been awful all season following his move from Newcastle, and now he is out for a couple of months.I don't think Liverpool are going to struggle with Hugo Ekitike leading the line, however. Yes, they are also missing Mohamed Salah while he is with Egypt at Afcon, but Ekitike is having a phenomenal season.Dominik Szoboszlai is out for Liverpool too, after picking up his fifth booking of the season against Spurs.Maybe it is time for Florian Wirtz to really come to the fore for Arne Slot's side.Wolves did really well to hold out for so long at Arsenal recently, and that kind of backs-against-the-wall defending seems to suit them.They will try to make things awkward for Liverpool too, but I don't see it working out for them.Sutton's prediction: 2-0Jonny's prediction: Hugo Ekitike has got brilliant confidence, can do a bit of everything and seems to integrate really well with the team. Liverpool also spent £125m on someone who was a bench striker before he got injured. Even though they have not had the season they would have liked, Arne Slot's side are going to have too much for Wolves who, in terms of bad teams in the past few years, are right up there as one of the worst. I don't know who they are going to beat this season. 3-0AI's prediction: 3-1London Stadium, 15:00West Ham really need a win here. They are staring down the barrel of relegation after taking only two points from their past five games.Nuno Espirito Santo got a bit of a bounce at the start of November but they have not maintained that form.There does not seem to be much Christmas cheer at London Stadium at the moment and if they get off to a bad start here, things could turn quite quickly.Fulham got an important win over Nottingham Forest on Monday, which was enough for them to keep their heads above water in the relegation struggle. They always seem to pose a goal threat, and I have a feeling they will have something to celebrate here, too.Sutton's prediction: 1-2Jonny's prediction: Fulham tend to be sneaky good - I always underrate them, and then they end up delivering really good team performances, and I love watching Kevin because - as well as flair - he has an end product too. West Ham are not having a great time of it right now but they will be up for it and they really need something here. 1-1AI's prediction: 2-1Stamford Bridge, 17:30I could not believe that Aston Villa were getting criticism on the Monday Night Club because they are only winning games by the odd goal.I made the point that I don't remember going in the dressing room as a player and being down about only winning 2-1. They are on an incredible run of 10 wins on the spin, including beating Arsenal and Manchester City. Morgan Rogers is on fire, and I think you have to respect them as title contenders.This is a real test for them, however, and it is only a few weeks since we were saying the same about Chelsea being in the title race after they drew against Arsenal with 10 men.I played for both these clubs and am highly thought of by both sets of fans.It is the Chelsea fans who I think will be smiling at full-time, though, once they've finished singing my name.I have got a lot of time for Blues boss Enzo Maresca, who is like Villa manager Unai Emery in the way he sticks to his footballing principles.Chelsea showed their resilience when they fought back from 2-0 down to draw with Newcastle and I can see them digging in again here, to end Villa's winning run.Sutton's prediction: 2-1Jonny's prediction: Unai Emery's side didn't start the season well but now they have got that confidence that, even if they concede, they can score more than the opposition. This was a hard one to call but I am going with Villa, probably because I want them to win rather than because I think they will. 1-2AI's prediction: 1-2Sunday, 28 DecemberStadium of Light, 14:00Dominic Calvert-Lewin has been absolutely unbelievable up front for Leeds. They are just a much better team with him in it, and their confidence must be sky-high at the moment too, because they have had some excellent results recently.The worry for Sunderland is how much they will miss their players who are away at Afcon, but I don't think it will affect them.The Black Cats don't score a lot of goals but they are always so well-organised - I am going for them to win, and keep out Calvert-Lewin to keep a clean sheet too.Sutton's prediction: 1-0Jonny's prediction: It depresses me how good Sunderland are this season. They have recruited so wisely and even with losing players to Afcon, the core of their team is really strong. Leeds have picked up recently and it's nice to see Dominic Calvert-Lewin scoring, but I think Sunderland will still win this - the Tyne-Wear derby has given them an even bigger boost in confidence, sadly. 2-1AI's prediction: 1-2Selhurst Park, 16:30Both teams have got problems at the moment.Crystal Palace have been feeling the effects of a heavy schedule, and at the moment their squad seems really stretched.That's the main reason I am thinking Tottenham might get something at Selhurst Park and, let's face it, Thomas Frank really needs to.Frank must be hoping the way his team played with nine men against Liverpool can kick-start his side's season, but I'm not sure that will happen.I am certainly not going to back them to win this one, but I am hardly confident about Palace's chances either.Sutton's prediction: 0-0Jonny's prediction: Palace should be the stronger side but Ismaila Sarr is a big loss for them while he is away at Afcon, he is so explosive. Thomas Frank is under a bit of pressure at Spurs - they are more pragmatic, but they are not scoring and they are still conceding. 2-2AI's prediction: 1-2How did Sutton do last week?Chris got three correct results with one exact score from the 10 matches in week 17, giving him 60 points.His guest, rapper Sampa the Great, got eight correct results with one exact score, leaving her on 110 points.AI did even better, with five correct results, but including three exact scores, for a tally of 140 points.But to the relief of Chris, because it keeps him top of the overall league table, it was the collective efforts of the BBC readers who took the weekly win.AI was ahead after Saturday's games, leading the readers by 130 to 120, but the readers got an exact score from Aston Villa's 2-1 win over Manchester United on Sunday - out of more than 33,000 predictions, 31% of you went for that scoreline.That meant the outcome went down to the final game of the week, between Fulham and Nottingham Forest on Monday. The readers went for a 1-1 draw while AI backed Fulham to win 2-1.An exact score for AI would have seen it grab the victory but, in the end, Fulham's 1-0 win meant the readers triumphed. Overall, they managed seven correct results and three exact scores, and that gave them 160 points.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Premier League predictions: Chris Sutton v The Wellermen's Jonny Stewart - and AI",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/716b/live/e8173b70-de97-11f0-b67b-690eb873de1b.png"
      ],
      "datePublished": "2025-12-24T07:14:26.000Z",
      "dateModified": "2025-12-24T07:14:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Challengers",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002p109?at_mid=CCbWDZltV1&at_campaign=Challengers&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002p109&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Challengers&at_bbc_team=BBC&at_creation=film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0ml8snt.jpg",
    "tag": "Trending",
    "date": "2025-12-23T00:46:11.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeChallengersChallengersContains very strong language and some sexual content.A love triangle forms between three tennis players: formidable former prodigy Tashi, her champion husband Art and his former best friend Patrick, who is also Tashi's ex. Duration2h 4mFirst shown2024Available for 28 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesThe Idea of YouFeel everything. The last thing a single mum expected becomes the only thing she wants1h 48mBlacKkKlansmanInfiltrate hate. Spike Lee's scorching satire of a black cop who joined the Ku Klux Klan2h 6mDie Hard 2Wrong place, wrong time, same John McClane. Action-packed thrills with Bruce Willis1h 53mWorld War ZFight. Survive. Repeat. A zombie pandemic spreads across the world, one bite at a time1h 46mTell Me LiesThe one you'll never forget. Toxic love, desire and betrayal. Love is a dangerous gameThe ProposalHere comes the bribe. Sandra Bullock and Ryan Reynolds in a rom-com with humour and heart1h 43mBridget Jones: The Edge of ReasonBridget's found the perfect boyfriend and the perfect life. What could possibly go wrong?1h 39mParis, 13th DistrictFriends, sometimes lovers - often both. Jacques Audiard's sensual tale of lust and desire1h 39mThe ImpossibleA true story of survival in the Boxing Day tsunami, with Ewan McGregor and Tom Holland1h 41mBridget Jones's DiaryPut your big girl pants on. The woman set on having it all - once she's drunk her wine1h 31mSpider-Man: Far from HomeIt’s time to step up. Peter Parker takes a trip to Europe but lands in monstrous trouble1h 58mLara Croft: Tomb RaiderShe's all action. The daredevil heroine races against time to recover an ancient relic1h 34m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Challengers",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0ml8snt.jpg"
      ],
      "datePublished": "2025-12-23T00:46:11.000Z",
      "dateModified": "2025-12-23T00:46:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Best Bits of Newscast's Podcast-a-Thon (Part Two) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mpq6t5?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-21T12:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·21 Dec 2025,·38 minsThe Best Bits of Newscast's Podcast-a-Thon (Part Two)NewscastAvailable for over a yearToday, we’re bringing you some of the best bits from Newscast’s 25-hour Podcast-A-Thon!\nBack in November, Adam was challenged by Pudsey Bear to record a 25-hour long episode of Newscast in aid of Children In Need. Members of the Newscast family dropped by throughout the day and night to cheer Adam on. Including when Laura and Paddy met Pudsey, voice coaching with Chris and a midnight snack session with Lyse Doucet chatting about how she spends her down time with her family in Canada. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Best Bits of Newscast's Podcast-a-Thon (Part Two) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-21T12:00:00.000Z",
      "dateModified": "2025-12-21T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Australian man charged after endorsing Bondi attack had weapons stockpile, police say",
    "url": "https://www.bbc.com/news/articles/cly34n7rg5lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8508/live/7522bde0-e097-11f0-88de-07ebc4f82fce.jpg",
    "tag": "Trending",
    "date": "2025-12-24T07:47:24.000Z",
    "description": "Police located several guns, a stockpile of ammunition and a shopping list for bomb materials in the home of a Western Australian man arrested after p",
    "body": "Police located several guns, a stockpile of ammunition and a shopping list for bomb materials in the home of a Western Australian man arrested after pledging support for the Bondi attackers, a court has heard.Martin Glynn, 39, appeared in a Perth court on Wednesday charged with racial harassment, possessing a prohibited weapon and failing to store firearms correctly.Prosecutors allege flags of Hamas and Hezbollah, both declared terrorist groups by Australia, were located during a police raid sparked by a tip-off from the public.In a statement, Prime Minister Anthony Albanese said \"there is no place in Australia for antisemitism, hate and violent ideologies\".The court heard that Mr Glynn posted on Instagram just hours after two gunmen killed 15 people in a targeted attack on a Hanukkah event at Sydney's Bondi Beach on 14 December to endorse their actions.\"A community member saw a post from the man online, recognised it wasn't right, and reported it to police,\" acting Western Australia premier Rita Saffioti told reporters on Christmas Eve.Police subsequently searched Mr Glynn's home in Yangebup, a suburb of Perth, allegedly finding a notebook including antisemitic comments and references to Nazi ideology.Three flags, six rifles and around 4,000 rounds of ammunition were also seized, prosecutors say.There is \"nothing illegal or improper\" with supporting the Palestinian cause, Magistrate Benjamin Tyers told the court on Wednesday.\"What is not proper is posting online comments supporting a massacre of innocent civilians,\" he said, according to The Sydney Morning Herald.In court, Mr Glynn, who represented himself, said he had been \"opinionated\" about the war in Gaza, but was \"hoping to raise the hypocrisy\" by creating the Instagram post.He said he was a doomsday prepper, and that the alleged \"bomb-making material\" was actually fire-starting material.\"I don't intended to harm anyone,\" he said.Western Australia Police Commissioner Col Blanch told media it is early days in their investigation, but there was no previous \"record of concern for this individual\".Mr Glynn, a former mine worker, was denied bail and will face court again on 3 February.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australian man charged after endorsing Bondi attack had weapons stockpile, police say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8508/live/7522bde0-e097-11f0-88de-07ebc4f82fce.jpg"
      ],
      "datePublished": "2025-12-24T07:47:24.000Z",
      "dateModified": "2025-12-24T07:47:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Global News Podcast - First batch of Epstein files released - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mpt4lc?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mpt4ml.jpg",
    "tag": "Trending",
    "date": "2025-12-20T04:51:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·20 Dec 2025,·31 minsAvailable for 85 daysAfter months of political wrangling, parts of the long-awaited Epstein files have been released by the US Justice Department. The trove consists of thousands of documents related to the late sex-offender. Pictures include the former US President Bill Clinton, Andrew Mountbatten-Windsor - Britain's former prince, musicians Mick Jagger and Michael Jackson. Being named or pictured in the files is not an indication of wrongdoing. The justice department did not release all existing files, and the published ones were heavily redacted, prompting frustrated reactions from survivors of Epstein's abuse.\nAlso: the US carries out dozens of strikes against the Islamic State group in Syria. Anti-government youth protesters in South Korea are taking cues from the American right's MAGA movement. Italy announces a fee for tourists to visit the Trevi Fountain in Rome. Putin vows revenge on Ukraine after an oil tanker was blown up in the Mediterranean Sea. Palestinians tell the BBC they were sexually abused in Israeli prisons. And how a lost radio play by Tennessee Williams was found more than four decades after his death, and has now been heard for the first time.\nThe Global News Podcast brings you the breaking news you need to hear, as it happens. Listen for the latest headlines and current affairs from around the world. Politics, economics, climate, business, technology, health – we cover it all with expert analysis and insight.\nGet the news that matters, delivered twice a day on weekdays and daily at weekends, plus special bonus episodes reacting to urgent breaking stories. Follow or subscribe now and never miss a moment.\nGet in touch: globalpodcast@bbc.co.ukProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Global News Podcast - First batch of Epstein files released - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mpt4ml.jpg"
      ],
      "datePublished": "2025-12-20T04:51:00.000Z",
      "dateModified": "2025-12-20T04:51:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Russia: Two police officers killed in explosion in Moscow ",
    "url": "https://www.bbc.com/news/articles/cz68z3wn1e3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7580/live/8078e4b0-e099-11f0-8d52-c5145d57eac0.jpg",
    "tag": "Trending",
    "date": "2025-12-24T07:41:26.000Z",
    "description": "Three people - including two police officers - have been killed in an explosion in Moscow, Russian authorities have said. Two traffic police officers ",
    "body": "Three people - including two police officers - have been killed in an explosion in Moscow, Russian authorities have said. Two traffic police officers saw a \"suspicious individual\" near a police car on the city's Yeletskaya Street, and when they approached the suspect to detain him, an explosive device was detonated, Russia's Investigative Committee has said. The two police officers died from their injuries, along with another individual who was standing nearby. The blast took place close to the location where a senior Russian general was killed in a car bombing in the capital on Monday.Lt Gen Fanil Sarvarov died after an explosive device - which had been planted under a car - was detonated.Investigate Committee spokesperson Svetlana Petrenko said in a statement on Telegram that a criminal case was being investigated in Moscow \"regarding an attempt on the lives of traffic police officers\". ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Russia: Two police officers killed in explosion in Moscow ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7580/live/8078e4b0-e099-11f0-8d52-c5145d57eac0.jpg"
      ],
      "datePublished": "2025-12-24T07:41:26.000Z",
      "dateModified": "2025-12-24T07:41:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Libya's army chief killed in air crash in Turkey",
    "url": "https://www.bbc.com/news/articles/cyvgzyepdqno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/22bb/live/8697f930-e044-11f0-a9a2-693a1a1aa5e1.jpg",
    "tag": "Trending",
    "date": "2025-12-23T21:33:42.000Z",
    "description": "The Libyan army chief has been killed in an air crash in Turkey, Libya's prime minister has said.Gen Mohammed Ali Ahmed al-Haddad and four others were",
    "body": "The Libyan army chief has been killed in an air crash in Turkey, Libya's prime minister has said.Gen Mohammed Ali Ahmed al-Haddad and four others were on board a Falcon 50 aircraft flying out of the Turkish capital, Ankara, on Tuesday evening.  In a post on X, Turkish Interior Minister Ali Yerlikaya said signal with the business jet was lost at 20:52 local time (17:52 GMT) - about 42 minutes after it took off from Ankara's airport. The Tripoli-bound jet had issued an emergency landing request before contact was lost. The aircraft's wreckage was later found south-west of Ankara, and an investigation is now under way into what caused the crash.In a later post on X, Yerlikaya wrote that police had spotted the debris near the village of Kesikkavak, in the Haymana district.He said the \"public will be informed of further developments\".In Libya, Abdul Hamid Dbeibeh, the prime minister of the country's internationally-recognised Government of National Unity (GNU), said he had received news of the deaths of Gen Haddad and other senior Libyan military officials on board the jet.The prime minister called it a \"great loss\" for the nation, saying Libya had \"lost men who served their country with sincerity and dedication\".Gen Haddad and his team had been in Turkey for talks aimed at further strengthening military and security co-operation between the two countries.Turkey has played an increasingly dominant role in Libya after intervening in 2019 to prevent an army from the east of the country driving out the internationally-recognised government in Tripoli, and has built close political, military and economic ties.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Libya's army chief killed in air crash in Turkey",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/22bb/live/8697f930-e044-11f0-a9a2-693a1a1aa5e1.jpg"
      ],
      "datePublished": "2025-12-23T21:33:42.000Z",
      "dateModified": "2025-12-23T21:33:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Someone thought I was actually the woman from Baby Reindeer and screamed in my face, says actress",
    "url": "https://www.bbc.com/news/articles/cly07r675d9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0c37/live/3b60c4a0-e06d-11f0-a8c7-bb1c822fc6a9.jpg",
    "tag": "Trending",
    "date": "2025-12-24T01:46:54.000Z",
    "description": "6 hours agoCharlotte GallagherGetty ImagesJessica Gunning won a Bafta for her role in Baby Reindeer in May Baby Reindeer was one of the standout telev",
    "body": "6 hours agoCharlotte GallagherGetty ImagesJessica Gunning won a Bafta for her role in Baby Reindeer in May Baby Reindeer was one of the standout television moments of the past few years and it catapulted actress Jessica Gunning to stardom. She played the obsessive and troubled woman, Martha, who dramatically unravels onscreen. For Gunning it was the \"role of a lifetime\", describing life as a \"surreal\" but also a \"dream\" since the show's release. \"I got goose bumps when I first read the script,\" the British actress tells the BBC, adding she had five auditions for the role.But she thought the television series might have been an indie hit, not the phenomenon on Netflix it became.  Of course, a potential downside of starring in a show like that does mean you get stopped in the street and occasionally confused with your character. \"I'd just parked near where I live and a woman screamed in my face! But in her defence she had just finished the series, walked out of her home and there I was. \"So that's surreal, occasionally being screamed at,\" she says.\"But everyone has been so lovely, there's also an incredible statistic about the difference the show has made to charities, especially ones for male survivors of sexual assault. \"I think it shows people want complicated stories. I have had 14-year-olds come and talk to me about it, as well as 90-year-olds.\"Getty ImagesShe played the troubled character MarthaAnyone who has watched Baby Reindeer may tell you it can be a difficult and upsetting watch.The show says it was based on real-life events experienced by the show's creator, Richard Gadd, who also plays the lead character. But this is disputed by the woman who allegedly inspired the person Martha is based on, who has said Netflix told \"brutal lies\" about her to more than 50 million viewers around the world.She said in June 2024 she was suing Netflix for defamation, negligence and privacy violations.The show is billed as \"a true story\", but a judge concluded in his ruling in September 2024 that certain key events in the series, like the conviction for stalking, did not happen in real life.Netflix failed in its attempt to persuade the judge to throw out the legal case brought against it, but said: \"We intend to defend this matter vigorously and to stand by Richard Gadd's right to tell his story.\"'It's all been a bit pinch me'Filming such an intense drama has given Gadd and Gunning a \"unique bond\" the actress says.\"We always checked in with each other and the producers and director made sure everything felt safe and considered.\"Baby Reindeer started life as a stage show at the Fringe at Edinburgh, Gunning had tried to see but couldn't get tickets so bought the play text instead.\"That was a little bit Martha of me\" she laughs.Her persistence paid off, and Gunning swept up during award season, winning an Emmy, a Bafta, a Golden Globe, an RTS and a Screen Actors Guild award. \"It's all been a bit pinch me, for all of the cast and crew really, we were out in LA, which is just crazy anyway to be in Hollywood. All the clichés are true, even to be nominated is an honour.\"Sometimes I look at the shelf that has my awards on and I think 'Oh my gosh', it feels like a dream really.\"Gunning has been in the industry for almost two decades, but Baby Reindeer has been a life-changing experience.\"I feel like on the one hand my life has completely changed, but I also feel exactly the same in a good way.\"\"I feel like if something like Baby Reindeer happened straight after coming out of drama school, maybe I'd feel like a bit of a deer in the headlights, pardon the pun. \"Now I feel a lot more grounded and I've got a big group of family and friends. But it is kind of strange, the number of viewers that Netflix bring in, you can't really compute. If you think about it too much it can feel a little bit scary.\"She is well aware of the significance of the role saying: \"I waited 17 years for a part like Martha to come along, so hopefully it won't be another 17 years.\"Getty ImagesJessica Gunning and her Baby Reindeer co-star Richard GaddGunning will next be on-screen on Christmas Eve, in the BBC One and Children In Need animation Pudsey and the Thread of Hope. It is based on an original story by McFly star and composer for the Paddington muscial Tom Fletcher, who's also written the music for the cartoon. Gunning plays a woman grieving for her husband, while her son is also navigating his way through grief. It is a handbrake turn after Baby Reindeer, but Gunning says the script was \"beautiful\" and she wanted to be involved \"in the special charity\". \"Children can deal with big issues like this, and hopefully children will watch and feel seen if they've experienced this, or are going through something similar.\" \"All my life I've grown up with Children In Need, I went to school dressed up as an Emu and wore it all day.\" Jessica Gunning took Pudsey Bear into a recording studioSo what next for Gunning? She's starring alongside Claire Foy and Andrew Garfield in a film adaptation of Enid Blyton's much-loved children's book, The Magic Faraway Tree, and is filming a comedy with Angelina Jolie. The actress who's from the West Yorkshire market town where enduring BBC sitcom Last of the Summer Wine was filmed jokes: \"It's Holmfirth to Hollywood.\" Pudsey and the Thread of Hope airs on 24 December at 10:20 GMT on BBC One and iPlayer, and on 27 December at 17:00 GMT on CBeebies and CBBC.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Someone thought I was actually the woman from Baby Reindeer and screamed in my face, says actress",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0c37/live/3b60c4a0-e06d-11f0-a8c7-bb1c822fc6a9.jpg"
      ],
      "datePublished": "2025-12-24T01:46:54.000Z",
      "dateModified": "2025-12-24T01:46:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Australia to deport British man charged with displaying Nazi symbols",
    "url": "https://www.bbc.com/news/articles/cgke51rzpvro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/10c7/live/ce7bd6b0-e060-11f0-b67b-690eb873de1b.jpg",
    "tag": "Trending",
    "date": "2025-12-24T00:25:04.000Z",
    "description": "8 hours agoLana LamSydneyAustralian Federal PolicePolice arrested and charged the British man, 43, earlier this monthA British national in Australia h",
    "body": "8 hours agoLana LamSydneyAustralian Federal PolicePolice arrested and charged the British man, 43, earlier this monthA British national in Australia has had his visa cancelled and faces deportation for allegedly displaying Nazi symbols.The 43-year-old man living in Queensland was arrested and charged earlier this month, after allegedly using a social media account to post the Nazi swastika, promote pro-Nazi ideology and call for violence towards the Jewish community.The man was taken into immigration detention this week in Brisbane and is due to face court in January. Police have been cracking down on the use of prohibited symbols amid a recent rise in antisemitism and right-wing extremism.Home Affairs Minister Tony Burke said: \"He came here to hate - he doesn't get to stay.\"\"If you come to Australia on a visa, you are here as a guest,\" Burke told the Australian Broadcasting Corporation (ABC) on Wednesday.Last month, Burke also revoked the visa of Matthew Gruter, a South African national who had been living in Australia since 2022, after he was seen attending a neo-Nazi rally in front of the New South Wales parliament. Like Gruter, the British man can appeal his visa being revoked. He can leave Australia voluntarily or wait to be deported to his home country. It is understood police are assessing whether to delay deporting the man so he can face court next month.The BBC has contacted the UK Foreign Office for comment.Earlier this year, Australia tightened its hate crime laws, introducing mandatory jail terms for displaying hate symbols or performing a Nazi salute.Police began investigating the British man in October over alleged posts on X. The social media platform blocked his account, prompting him to create a new one with a similar name where he continued posting offensive and harmful content, police said. Australian Federal PolicePolice seized weapons including axes and knives from the British man's homeAuthorities searched the man's home in Caboolture, on the outskirts of Brisbane, in late November and seized phones, weapons and several swords with swastika symbols. He was charged with three counts of displaying banned Nazi symbols and one count  of using the internet to cause offense.\"We want to ensure these symbols are not being used to fracture social cohesion,\" Australian Federal Police Assistant Commissioner Stephen Nutt said earlier this month.  \"If we identify instances where this is happening, we will act swiftly to disrupt the behaviour, prosecute those involved and protect the dignity, safety and cohesion of our diverse community.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australia to deport British man charged with displaying Nazi symbols",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/10c7/live/ce7bd6b0-e060-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-24T00:25:04.000Z",
      "dateModified": "2025-12-24T00:25:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'Find me some \"friends\"' and 'Scrap farm raid'",
    "url": "https://www.bbc.com/news/articles/cpvdezwpzd9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d027/live/706b6410-e05a-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2025-12-24T04:53:33.000Z",
    "description": "3 hours agoMany of the papers lead with the latest tranche of the Epstein files released by the US Department of Justice, which includes an email exch",
    "body": "3 hours agoMany of the papers lead with the latest tranche of the Epstein files released by the US Department of Justice, which includes an email exchange between Ghislaine Maxwell and a person signing off as 'A' writing from the \"Balmoral Summer Camp for the Royal Family\". The Daily Mirror says the author of the email asked Maxwell to \"find me some 'friends'\" who are described as \"inappropriate\", according to the paper. The emails do not indicate any wrongdoing. The BBC has contacted Andrew Mountbatten-Windsor's team for a response. The former prince has previously denied all wrongdoing.Under the headline \"Ghislaine Maxwell emails revealed\", the Sun says she allegedly sought to \"find fun girls for Andrew\".\"Andrew, 'fun girls' and 'inappropriate friends'\" is the i Paper's summary of the latest round of the Epstein files. The Guardian also leads with the \"girls\" email from the Epstein files, saying \"Andrew faces new pressure\". A photo shows climate activist Greta Thunberg being questioned by a police officer in London. The paper writes she was arrested \"after protesting in support of the Prisoners for Palestine hunger strike\".The government will \"scrap farm raid\" plans, the Daily Express writes. Labour will raise the \"tax threshold on inherited farmland\" from £1m to £2.5m, the paper says. It quotes farmer Jonathan Charlesworth – whose dad took his own life \"amid fears\" of the tax – saying the change was \"the best Christmas present for a lot of farmers\". A preview of King Charles III's Christmas message, which will be delivered from Westminster Abbey, also features on the front page.Labour's \"quiet Christmas U-turn\" on its inheritance tax plans is the Financial Times's take. \"Treasury to forgo £130mn\" in tax revenue as a consequence, the paper writes, as it \"shrinks [the] share of farmers facing inheritance tax to 15%\". The Times says Prime Minister Sir Keir Starmer faced a \"revolt by Labour MPs\" over the initial £1m inheritance tax threshold proposal, writing \"Downing Street was warned that over 40 MPs were prepared to defy Starmer.\"The prime minister's \"U-turn on farm tax\" is described by the Daily Mail as a \"humiliating capitulation to his backbenchers\".\"Farmers cheer as Starmer U-turns on tractor tax raid\" reads the Independent's headline, which the paper says follows \"months of fierce protests – and financial anguish for many families\". \"Loathe actually\" is the Daily Star's headline spin on the popular Christmas film Love Actually, whose director Richard Curtis and his wife Emma Freud oppose \"the idea of a 30-pitch campsite in their swanky village\". Plans for the campsite were approved by East Sussex Council, which Mr Curtis \"objects to\", the paper says.The Times is one of several papers to highlight emails from the Epstein files, which reveal that Ghislaine Maxwell sought \"pretty, fun girls\" for someone called Andrew. The Sun calls the emails \"a bombshell\", while the Daily Mirror says pressure is growing on Andrew Mountbatten Windsor. The Guardian says the Metropolitan Police contacted the US authorities last month asking whether or not there were any ongoing investigations related to the former Duke of York and his relationship with the disgraced financier. Andrew has previously denied any wrongdoing.The other main story is the government watering down its plans to tax inherited farms. The Daily Telegraph features an interview with the son of a farmer who took his own life last year, shortly before the government formally announced its original plans. Jonathan Charlesworth says his father was worried and that he would still be alive if the threshold had been set at the new level of £2.5m from the start.The Daily Mail calls the rethink on the policy \"yet another humiliating capitulation to his backbenchers\" for Prime Minister Sir Keir Starmer. The Daily Express says many farmers will now fight to continue their campaign, this time aiming for an inheritance tax exemption for their farms. The Financial Times calls the development an \"unexpected u-turn just before Christmas, with Parliament not sitting\", and calculates that the net annual cost to Treasury coffers will be £130m.The \"i\" Paper says that rented Christmas trees are growing in popularity, sparked by environmental concerns. One business in Scotland which has spoken to the paper says 86% of its rentals have been to returning customers this winter. In the summer, the trees are looked after in a nursery. The Telegraph quotes University of Sheffield research which says the trees which go into landfill release 100,000  tonnes of greenhouse gases into the atmosphere. Academics have suggested pine needles from discarded trees could be used to produce sweeteners, paint, adhesives and vinegar.Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'Find me some \"friends\"' and 'Scrap farm raid'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d027/live/706b6410-e05a-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-24T04:53:33.000Z",
      "dateModified": "2025-12-24T04:53:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "King's Christmas speech to come from Westminster Abbey",
    "url": "https://www.bbc.com/news/articles/c0mp73p7310o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/40aa/live/e01b3760-e09e-11f0-b67b-690eb873de1b.jpg",
    "tag": "Trending",
    "date": "2025-12-23T22:01:56.000Z",
    "description": "10 hours agoSean CoughlanRoyal correspondentPA MediaThe King will give the traditional message from the Abbey's Lady ChapelThis year's Christmas messa",
    "body": "10 hours agoSean CoughlanRoyal correspondentPA MediaThe King will give the traditional message from the Abbey's Lady ChapelThis year's Christmas message from King Charles III will be delivered from Westminster Abbey.This traditional speech, filmed in the Lady Chapel of the medieval church in central London, follows his \"good news\" earlier this month about responding well to cancer treatment.The King is expected to talk about the \"pilgrimage\" of life, and the lessons it can teach about the issues of the day, in a message broadcast at 15.00 on Christmas Day.Last year the speech was given in the Fitzrovia Chapel, which once served hospital staff, and was a symbolic location for a message focusing on the King's thanks for health workers.PA MediaThe King was able to re-use the Christmas trees from Catherine's carol concertThis year's setting is below the Lady Chapel's famous medieval vaulted ceiling, in a chapel where 15 previous kings and queens are buried, including Elizabeth I, Mary I and Charles II.It also means that for a second year the Christmas message won't be delivered from behind a desk inside a palace.The King will be seen standing in front of Christmas trees which were brought to decorate the Abbey for the Princess of Wales's carol concert held earlier this month.Westminster Abbey was also the venue for the King's recent Advent service, where there were prayers and music from different Christian traditions, including Anglican, Catholic and Orthodox.There was a display of icons in the Abbey for that service - and when the King visited Pope Leo earlier this year he gave him an icon of St Edward the Confessor, a saint with strong connections to Westminster Abbey.The Advent service and the trip to the Vatican had reflected one of the King's longstanding causes - his efforts to build bridges between people of different faiths and backgrounds.The tradition of an annual Christmas broadcast from the monarch, looking back on the year and addressing current events, dates back to 1932, when George V delivered a speech on the radio.The first televised Christmas speech was delivered by Elizabeth II in 1957. It's usually among the most-watched programmes on Christmas Day.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "King's Christmas speech to come from Westminster Abbey",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/40aa/live/e01b3760-e09e-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-23T22:01:56.000Z",
      "dateModified": "2025-12-23T22:01:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Government waters down farm inheritance tax plan",
    "url": "https://www.bbc.com/news/articles/c8e9n3y28g1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9a68/live/122654e0-dffc-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2025-12-23T17:29:09.000Z",
    "description": "15 hours agoKate Whannel,political reporter,Georgia Roberts,Derby political reporterandJoe Pike,politics investigations correspondentPA MediaFarmers p",
    "body": "15 hours agoKate Whannel,political reporter,Georgia Roberts,Derby political reporterandJoe Pike,politics investigations correspondentPA MediaFarmers protested against the changes again at last month's Budget Government proposals to tax inherited farmland have been watered down, with the planned threshold increasing from £1m to £2.5m.The climbdown follows months of protests by farmers and concern from some Labour backbenchers.At last year's Budget, ministers said they would start imposing a 20% tax on inherited agricultural assets worth more than £1m from April 2026, ending the 100% tax relief that had been in place since the 1980s. In an announcement put out after MPs had left Parliament for the Christmas recess, Environment Secretary Emma Reynolds said: \"We have listened closely to farmers across the country and we are making changes today to protect more ordinary family farms.\"\"It's only right that larger estates contribute more, while we back the farms and trading businesses that are the backbone of Britain's rural communities, \" she said. Head of the National Farmers' Union Tom Bradshaw welcomed the change, telling BBC Radio 5 Live it \"takes out many family farms from the eye of a pernicious storm\".Gavin Lane, president of the Country Land and Business Association, said: \"The government deserves credit for recognising the flaws in the original policy and changing course.\"However, this announcement only limits the damage - it doesn't eradicate it entirely. \"Many family businesses will own enough expensive machinery and land to be valued above the threshold, yet still operate on such narrow profit margins that this tax burden remains unaffordable.\"Ben Ardern, a farmer from Derbyshire, told the BBC said it was \"a step in the right direction\".He said the government should \"drop it [the tax] for family farms... and just tax the people who have got the money to tax.\"The big corporations who have just buried money into land - they're not farmers, they have just done it to avoid tax. Farmers haven't bought land to avoid tax, we've bought land to farm it and grow food.\"Ben Ardern, a third generation beef and dairy farmer from Buxton, has organised protests against the taxIn the 14 months since the initial proposal was announced, there have been regular protests by farmers outside Parliament. Some Labour MPs in rural areas have also expressed concern. At a recent parliamentary vote on the plan, a dozen backbenchers abstained and one, Markus Campbell-Savours, voted against.Campbell-Savours was subsequently suspended for voting against the government, meaning he now sits as an independent MP.John Whitby, a Labour MP from the Rural Research Group of backbenchers, said the government's climbdown on inheritance tax was \"fantastic news\".But one Labour source described the timing of the change as \"bizarre\".They added that many MPs would be annoyed as \"they were made to vote for it so recently\".Conservative leader Kemi Badenoch said in a post on social media: \"This fight isn't finished. \"Other family businesses are still affected by Labour's tax raid, and we will keep pushing until the tax is lifted from them too.\"Liberal Democrat spokesperson Tim Farron MP said: \"It is utterly inexcusable that family farmers have been put through over a year of uncertainty and anguish since the government first announced these changes.\"We demand that the government scraps this unfair tax in full and if they refuse to, Liberal Democrats will submit amendments in the new year to bring it down.\"Reform UK deputy leader Richard Tice said: \"This cynical climbdown - whilst better than nothing - does little to address the year of anxiety that farmers have faced in planning to protect their livelihoods... with British agriculture hanging by a thread, the government must go further and abolish this callous farms tax.\"In her first Budget in 2024, Chancellor Rachel Reeves announced she would be reversing the 100% inheritance tax relief on agricultural assets that had been in place since the 1980s.The move would have seen inherited agricultural assets worth over £1m taxed at 20%, half the standard inheritance tax rate, raising an estimated £520m annually by 2029.The government had argued that the change would protect smaller farms while stopping wealthy investors from buying farmland as a tax loophole. However, it has now stepped back from the original proposal raising the threshold level to £2.5m.Coupled with an exemption which allows farmers to pass on assets to their spouses tax-free, this new government concession means a couple could pass on up to £5m in qualifying assets, without paying tax. Above the threshold, a 50% relief will be applied to the remaining assets. According to the government, the number of estates in the UK expected to pay more inheritance tax in 2026/27 will be reduced from around 2,000 under the original plans to 1,100 under the new proposal. A Treasury source said changing the thresholds would cost the government £130m, but that there were \"no plans\" for the policy to be scrapped entirely.\"The principle of reforming the tax system remains,\" the source said. \"It's right that the wealthiest estates pay their fair share, but smaller farms will get help.\"The climbdown is the latest in a series of U-turns the government has made since being elected in July 2024. Earlier this year the government eased cuts to winter fuel payments and backtracked on plans to make £5bn of cuts to the welfare bill. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Government waters down farm inheritance tax plan",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9a68/live/122654e0-dffc-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-23T17:29:09.000Z",
      "dateModified": "2025-12-23T17:29:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Buildings could still burn under 'spineless' new safety law, industry leader warns",
    "url": "https://www.bbc.com/news/articles/cev8mrgky9eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f4a8/live/68977c70-e027-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-24T06:00:10.000Z",
    "description": "Government plans to turn post-Grenfell fire safety guidance into law have been strongly criticised by a leading voice in the construction industry.Dav",
    "body": "Government plans to turn post-Grenfell fire safety guidance into law have been strongly criticised by a leading voice in the construction industry.David Jones, president of the Institute of Construction Management, says the guidance for multi-storey residential buildings is \"loose\", \"spineless\" and \"open to interpretation\".He argues it permits too many \"tolerable\" risks - for example, allowing flammable materials in window systems and between floors to remain even if they could let fire spread.\"It's allowing developers to game the system,\" the veteran of more than 50 years says, adding that making it law would be an \"absolute abomination\".Mr Jones is the first senior building industry leader to publicly criticise the plans, which are currently out for consultation.The government says the guidelines are a proportionate approach to dealing with the flammable cladding crisis.Ministers insist making them law will bring clarity and certainty to the process of deciding which fire safety defects need addressing.Cladding campaigners say the word \"tolerable\" appears dozens of times in the guidelines, which are known in the industry as PAS 8890.Combustible materials are allowed to remain in place if risks are assessed to be \"tolerable\" - meaning in a standard fire test a blaze does not spread beyond one floor within 15 minutes or two floors within 30 minutes.Mr Jones argues that in the guidance, engineers are not explicitly required to present fire test safety data for these materials, making assessments subjective and open to interpretation.He believes the lack of a ban on materials with \"limited combustibility\" is \"another gaming of the system. It's a fuel, it just burns a little bit slower.\"Part of the motivation for tolerating certain risks is to avoid delays caused by disagreements about how much work is needed to make buildings constructed with cladding safe.Progress has been slow in the eight years since the Grenfell tragedy.Ministry of Housing statistics for December show around 475 of the more than 5,500 blocks so far identified as unsafe have been completely fixed and certified as safe in the last 12 months.Cladding has been replaced in 35% of those dangerous blocks since Grenfell - including nearly all of the tallest buildings with the same type of cladding as Grenfell Tower.Residents' representatives fear that any flammable materials left in place can lead to a lower fire safety rating - even after repairs. In turn, this could result in permanently higher building insurance premiums.In a statement, the government said it was up to the insurance industry to bring premiums down once buildings are certified as safe.The insurance industry says if flammable materials remain, it will price the risk accordingly.Mr Jones also criticises the fact the guidelines only deal with the exterior facades of buildings - covering cladding and insulation issues.Fire safety inspections since Grenfell have revealed many tower blocks also have significant internal fire safety defects.The government has robustly rejected Mr Jones's criticisms.It adds the new law will prevent what it describes as unnecessary work and disturbance for residents.A consultation on the guidance becoming law ends on 31 December, with legislation planned in 2026.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Buildings could still burn under 'spineless' new safety law, industry leader warns",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f4a8/live/68977c70-e027-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-24T06:00:10.000Z",
      "dateModified": "2025-12-24T06:00:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Andrew and Jeffrey Epstein is the story that will not go away",
    "url": "https://www.bbc.com/news/articles/cewjrvn5795o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/32fc/live/1464ad50-e016-11f0-a174-b3b49d9e9906.jpg",
    "tag": "Trending",
    "date": "2025-12-24T07:58:12.000Z",
    "description": "22 minutes agoSean CoughlanRoyal correspondentEvery time you think the Andrew Mountbatten-Windsor story must have finished, there is another twist.The",
    "body": "22 minutes agoSean CoughlanRoyal correspondentEvery time you think the Andrew Mountbatten-Windsor story must have finished, there is another twist.The latest batch of documents from the Epstein files includes emails that could further damage his reputation. Or perhaps his reputation is already at rock bottom and this will only reinforce existing negative impressions.Public opinion might be divided too, in reaction to this drip-drip of pictures and emails.There might be some who have had enough of all these seedy headlines and do not want any more Andrew all over their Christmas dinner. They have already formed an opinion and this will only provide further confirmation.While others will see these latest documents as evidence of the need to press even harder into Andrew's links to Jeffrey Epstein and his circle. What more is there to find, they will ask.There are still outstanding calls for Andrew to give evidence to a US Congress committee and the US Department of Justice. And these latest emails will only add to the questions.\"Have you found me some new inappropriate friends?\" someone called A in Balmoral asks Ghislaine Maxwell, Epstein's friend and companion who is now  serving a 20-year prison sentence in the US for sex trafficking.Maxwell replies: \"I have only been able to find appropriate friends. Will let you know about some church meetings on those dates.\"She signs off with \"kisses\", and the emails seem to be between people who are very close.The identity of A, who also uses the name \"Invisible Man\", is not made clear and we do not know for sure it is Andrew. And there might be some quizzical looks at some of the language in the emails - for instance \"Fall\" rather than \"Autumn\", which is more like American English than British.But there are lines in the emails that seem to tally with Andrew's biography, such as talking about when he left the Royal Navy.Elsewhere in the files, there also seem to be documents detailing arrangements in 2002 for a trip to Peru, with calls from Maxwell for discreet introductions to friends when he is there, with the suggestion from Maxwell of \"intelligent pretty fun and from good families\".All of that could be read in many different ways, innocent or otherwise. And appearing in these files is not any proof of guilt or misbehaviour.But part of the challenge with this released information is to put apparently random pieces into some kind of context.The email sent by \"A\" asking for \"inappropriate friends\" was sent in August 2001, which is five months after Virginia Giuffre claims she was forced to have sex with the then Prince Andrew in London at Maxwell's house.That is a claim that Andrew has always strongly denied and he has always rejected any claims of wrongdoing arising from his links with Epstein.However, further documents show that the US Department of Justice formally sought to question Andrew, asking in April 2020 for the UK government to assist in getting him to give evidence in cases linked to Epstein.In the event that he would not voluntarily give evidence, the US authorities asked their UK counterparts to compel him.There were also detailed questions about Andrew's relationship with Epstein from US authorities, including asking for details for any financial payments between them or any women associated with Maxwell or Epstein.There could be more questions about what happened to that request. It arrived when the Covid lockdown had just begun and attention was elsewhere.There has already been some embarrassment for Andrew from the Epstein files, with a picture of him lying on the laps of people in what is thought to be the saloon at Sandringham, with Maxwell in the background.It is a room in Sandringham where the royals could be gathering this week to watch the King's message and they might have to erase that other image from their thoughts.So far for Andrew it is more bad news, but perhaps similar to the previous bad news, of which there has been plenty.A year ago there were multiple \"What next for Andrew?\" pieces, after his disastrous scandal surrounding his links to an alleged Chinese spy.And it could not have been foreseen then how much further there was still to fall, with Andrew experiencing the most public loss of status for a royal in modern history.No-one would have predicted the loss of his titles and his status as prince.Next year there will be questions about his finances and his Crown Estate lease from the Public Accounts Committee.And who knows how much more could emerge from this vast cache of Epstein documents?This is a downward spiral - and every time you think it has ended, has kept going deeper.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Andrew and Jeffrey Epstein is the story that will not go away",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/32fc/live/1464ad50-e016-11f0-a174-b3b49d9e9906.jpg"
      ],
      "datePublished": "2025-12-24T07:58:12.000Z",
      "dateModified": "2025-12-24T07:58:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]