[
  {
    "title": "F1 Q&A: Norris and Tsunoda incident, Hamilton, Verstappen, Red Bull and overtaking",
    "url": "https://www.bbc.com/sport/formula1/articles/ckgdjw10rz1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d242/live/0ff79f40-d4de-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-09T12:06:29.000Z",
    "description": "Hamilton's struggles and ranking Verstappen's 2025 - Q&AMcLaren's Lando Norris is the 2025 world champion after he finished third at the Abu Dhabi Gra",
    "body": "Hamilton's struggles and ranking Verstappen's 2025 - Q&AMcLaren's Lando Norris is the 2025 world champion after he finished third at the Abu Dhabi Grand Prix.The 26-year-old is the 11th British world champion in Formula 1.Max Verstappen won the race but finished two points behind Norris in the standings, while Oscar Piastri finished second at the Yas Marina Circuit and ended his season in third overall. After the season finale, BBC F1 correspondent Andrew Benson answers your latest questions.Is Lewis Hamilton staying in F1 too long and damaging his reputation, just like Michael Schumacher did when returning with Mercedes? - MartinHamilton has had a very difficult season for Ferrari, however you look at it.He has been comprehensively out-performed by team-mate Charles Leclerc in both qualifying and races, and he has failed to score a podium finish for the first time in his career.Most observers felt that Hamilton might find it difficult to adapt to Ferrari, and that Leclerc would provide a stiff challenge. But few will have expected Hamilton to struggle the way he has.Hamilton's belief seems to be that the issue is a combination of the difficulty of adapting to an unfamiliar car in a new environment in a unique team, and the fundamental disconnect he has felt with the generation of cars that is now consigned to the bin.The 2026 cars promise to be different in many ways, especially in terms of power-units and energy management, but in one potentially important factor they are a return to the cars in which Hamilton excelled.The fundamental aerodynamic philosophy is a return to so-called 'step-plane' cars, with a flat bottom either side of the central chassis reference plane, with a diffuser at the back.This type of car gelled much more naturally with Hamilton's driving style, which is to brake late and use the change in aerodynamic pressure to help rotate the car into the corner.Few - if any - were as good as him at balancing extreme braking with corner entry speed without compromising the exit.So, yes, there are inevitable and justifiable questions as to whether Hamilton's struggles to adapt have anything to do with age - he is 40, after all. But it would be unfair and unwise not to wait until next season before jumping to conclusions.Was it virtually impossible for the stewards to give any kind of penalty to Lando Norris for the Yuki Tsunoda incident in Abu Dhabi? - Danny The stewards at the Abu Dhabi Grand Prix were clear in their reasoning for penalising Tsunoda and not penalising Norris in the incident in which the Briton's McLaren went off track in passing the Red Bull.It was all applied according to the rules.Tsunoda was penalised for making more than one move in defence - weaving, as it is known.And while Norris technically broke the rule that forbids overtaking off track, he was deemed to have been forced there by Tsunoda.The stewards' report said that he had ended up there because Tsunoda \"made multiple moves defending his position\".It added: \"Had (Tsunoda) not made those moves, (Norris) would have overtaken without going off track, but (he) moved off track to avoid contact\".The FIA driving standards guidelines \"provide that if a car is 'forced off' (which was effectively what occurred here) it is not considered to have exceeded track limits\".It has to be said that Tsunoda did not do an especially good job, from the perspective of Red Bull, of holding up Norris.Such was the tyre offset between the two cars, Norris was always going to find passing on the straight relatively easy.But if Tsunoda had driven with more calculation, he could have measured his pace to ensure Norris caught him at the start of the final part of the track around the marina, where overtaking is impossible.Doing that, he could have delayed Norris a significant amount through that section before being passed.Media caption, 'Winning made everything worth it' - Norris on F1 title and what's to come in the futureWhile we were talking about McLaren almost throwing away the drivers' championship for different reasons, surely by Red Bull not having a decent number two driver, who would have taken points off both McLaren drivers, you could argue that this cost Max Verstappen the title. - BillIt's a fair point, but also a debatable one.Red Bull are in a difficult position.In Max Verstappen, they have someone who many - if not most - regard as the best racing driver in the world. Certainly, that's what Red Bull think.So they are probably working from the principle that whoever they signed alongside him is unlikely to be able to beat him over a season, and would not find it easy to get close to him.Daniel Ricciardo left the team at the end of 2018 because he felt things had swung too much towards Verstappen. Partly in terms of the way the team operated. But also, almost certainly, because he could see the trend line of performance between the two of them was only going one way.Since then, Red Bull have been looking for a driver of a similar sort of level.Pierre Gasly and Alex Albon fell short at the team, but have gone on to have very solid careers elsewhere.Sergio Perez's status was pretty much established before he even got into a Red Bull, so it was no surprise he could not get close to matching Verstappen.He proved handy in the Abu Dhabi showdown in 2021, by delaying Lewis Hamilton enough that when the critical late safety car came out, Hamilton did not have a gap large enough to pit for fresh tyres without losing the lead.But Perez would likely have been of no significant help this season, judging by his average performance deficit to Verstappen over his time at Red Bull and the gaps between the front-running cars.Then you're looking at the next level of driver up. Red Bull could have signed Carlos Sainz for this season, for example. They chose not to because they felt it would disrupt the team dynamic.And as much as a driver of that calibre would likely have got in the mix with the McLarens, he would also likely have taken points away from Verstappen, in the same way the McLaren drivers took points from each other.On top of that, the Red Bull has been a difficult car this season, and perhaps only a very few drivers other than Verstappen could have got a tune out of it.Joining Stirling Moss, Jim Clark, Alain Prost and Lewis Hamilton in being a driver with the most victories in a season without winning the championship, where does Max Verstappen's 2025 performance rank in terms of seasons without winning the title? - AlanAny topic like this is always going to be subjective.There are a number of examples of drivers who arguably, on merit, should have won the title but didn't.Stirling Moss in 1958, Niki Lauda in 1976, Gilles Villeneuve in 1979, Ayrton Senna in 1989 and Lewis Hamilton in 2007 are just some of the years up for discussion.Arguably the peak example of this was Fernando Alonso in 2012, when he drove a season of remarkable consistency and excellence to keep a Ferrari that was on average the fourth fastest car in the title fight until the final race.He ended up losing out to Red Bull's Sebastian Vettel. But had only one of two incidents for which he was entirely blameless not happened, he would easily have been champion.He was taken out by the cartwheeling Lotus of Romain Grosjean at the start in Belgium, and his tyre was punctured by the other Lotus driver Kimi Raikkonen into the first corner in Japan.There is no doubting Verstappen's excellence this season. How his year has compared with Alonso's then is a matter for debate, but his Red Bull was certainly more competitive than that Ferrari.As for Verstappen himself, he says he has \"no regrets\" about his season.\"I've hated this car at times,\" he said in Abu Dhabi, \"but I've also loved it at times. I always tried to extract the most from it, even in the difficult weekends that we've had.\"Luckily, the last, I would say, eight, nine rounds in general have been a lot more enjoyable. And also, in the team, we have a great atmosphere. We're really on a roll - positive energy, belief, confidence - and that's exactly what you want heading into next year.\"Of course, shame to miss out on the title, but at the same time, for a long period of time I was not even thinking about the title. I never felt like I was in it until a few rounds ago. That's pretty crazy.\"You take your pride in different ways. I'm happy with myself, and going into next year I'm not in a state of having to worry about my skills or whatever.\"Media caption, 'That's life' - Verstappen and Piastri react to missing out on F1 titleThe phrase \"it's difficult to overtake at xxxx race track\" seems to be getting more and more common. Should F1 be dropping the worst tracks or incentivising tracks to amend their layouts to provide overtaking opportunities? - SteveWith a few exceptions, it is primarily the nature of the cars that has restricted overtaking in recent years rather than circuits.When the regulation cycle that ends this year was introduced, the aim was to make overtaking easier and racing closer.The field has definitely closed up, but any effect on overtaking has been negligible. Drivers agree that it was marginally better in the first year of the regulations, 2022, but has become increasingly worse ever since.That's because the cars have become more sophisticated, and have developed more and more downforce. And the more downforce, the more disruption from the car in front.The theory behind this set of rules - that controlling the wake created by a car and trying to direct it away from cars behind will make it easier to follow - has, at best, not been proven. At worst, it has been debunked.Another factor in overtaking is tyres. Pirelli's rubber has improved significantly this year in terms of durability, but the tyres are still prone to overheating when drivers follow other cars closely. And once they overheat, they lose grip, and bang goes the chance of overtaking.There's also the question of whether governing body the FIA has always made the right calculations about the length of the zones in which drivers can use the DRS overtaking aid. Which some would say has not always been the case.Will next year's cars be better?They have a push-to-pass button that actives extra electrical energy instead of DRS, because both the front and rear wings will be moveable to decrease drag on straights.But there are so many questions about how next year will be that it's impossible to know the answer.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "F1 Q&A: Norris and Tsunoda incident, Hamilton, Verstappen, Red Bull and overtaking",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d242/live/0ff79f40-d4de-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-09T12:06:29.000Z",
      "dateModified": "2025-12-09T12:06:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Global Story - Will a social media ban for Australian teens work? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct71cz?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mmg8nb.jpg",
    "tag": "Trending",
    "date": "2025-12-09T10:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·09 Dec 2025,·26 minsAvailable for over a year**This episode contains discussion of bullying and suicide**\nAustralian teens are bracing for a new law coming into effect this week that will ban social media accounts for anyone under the age of 16. The Government says the legislation is designed to protect the mental wellbeing of Australian children and teens – but it’s already proving controversial, not least among American tech companies and some politicians who see the ban as a threat to free speech.  \nIn today’s episode, we are joined by Katy Watson, the BBC’s Australia correspondent, to discuss how the country became a global test case for a bold new policy – and crucially, whether it will succeed.  \nProducers: Cat Farnsworth, Aron Keller and Xandra Ellin\nMix: Travis Evans\nSenior News Editor: China Collins\nPhoto: A teen using her phone ahead of social media band for users under 16. Hollie Adams/ReutersProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Global Story - Will a social media ban for Australian teens work? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mmg8nb.jpg"
      ],
      "datePublished": "2025-12-09T10:00:00.000Z",
      "dateModified": "2025-12-09T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Trump v Europe? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mmctzz?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-08T19:26:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·08 Dec 2025,·38 minsAvailable for over a yearToday, we discuss President Trump’s new vision for global security, one that is creating a lot of criticism in Europe.\nThe 33-page document called the National Security Strategy suggests Europe is facing \"civilisational erasure\" and does not cast Russia as a threat to the US. Russia says the strategy is “largely consistent” with their vision.\nSecurity correspondent Frank Gardner and former UK ambassador to the US Lord Kim Darroch join Adam to discuss what this means for Europe.\nPlus, we discuss what has happened in Syria a year after former President Bashar al-Assad was overthrown. Adam chats with Mina Al-Lami from BBC Monitoring.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Adam Chowdhury. The social producer was Gabriel Purcell-Davis. The technical producer was Dafydd Evans. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Trump v Europe? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-08T19:26:00.000Z",
      "dateModified": "2025-12-08T19:26:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Heathrow suitcase robbery suspects used CS spray, court told",
    "url": "https://www.bbc.com/news/articles/cdxeql929dgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8100/live/cbb976c0-d4f9-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-12-09T15:24:13.000Z",
    "description": "54 minutes agoJess WarrenLondonPA MediaThe incident resulted in the partial closure of the Central Terminal Area tunnel and the Terminal 3 car parkTwo",
    "body": "54 minutes agoJess WarrenLondonPA MediaThe incident resulted in the partial closure of the Central Terminal Area tunnel and the Terminal 3 car parkTwo men have appeared in court after two women were sprayed with CS spray in a robbery at Heathrow airport on Sunday.Tyrone Richards, 31, and Anton Clarke-Butcher, 24, have both been charged with two counts of robbery and two counts of administering a noxious substance after the incident on Sunday.CS spray is a man-made chemical that UK police forces use to temporarily incapacitate people in a similar manner to pepper spray, according to the government.Prosecutor Rene De Silva told Uxbridge Magistrates' Court on Tuesday the men were arrested after a robbery at the multi-storey car park at Terminal 3 and were suspected of playing a \"key role\" in the incident.Mr Richards, of no fixed address, and Mr Clarke-Butcher, of Mantlet Close, Streatham, appeared separately the court and spoke only to confirm their names, addresses and dates of birth.The indictment stated that the men allegedly stole two suitcases from two separate women, using CS spray on both.Mr De Silva said the defendants, along with others, used CS spray to commit the robbery of a suitcase.Mr Richards and Mr Clarke-Butcher were both remanded in custody and are due to appear at Isleworth Crown Court on 8 January for a plea hearing.The court heard that two other suspects are currently still \"at large\".Ambulance crews treated 21 people, including a three-year-old child, following the incident.Five people were taken to hospital and later discharged.The incident - which the Met said was isolated and not being treated as terrorism - resulted in train delays and the partial closure of the Central Terminal Area tunnel and the Terminal 3 car park for a short time.On Monday, the Met Police said it had also arrested a woman, 23, on suspicion of conspiracy to commit robbery. She was later released on bail pending further inquiries. A second woman, 57, was arrested on suspicion of conspiracy to commit robbery. She was subsequently released under investigation.Another man, 31, was arrested on Monday on suspicion of affray. He remains in custody, police said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Heathrow suitcase robbery suspects used CS spray, court told",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8100/live/cbb976c0-d4f9-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-12-09T15:24:13.000Z",
      "dateModified": "2025-12-09T15:24:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Starbucks workers and unions in 10 countries to protest in support of US baristas",
    "url": "https://www.bbc.com/news/articles/c62lqv3mvmjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b342/live/b0204560-d481-11f0-b433-753c64b53a9c.jpg",
    "tag": "Trending",
    "date": "2025-12-09T16:15:30.000Z",
    "description": "Just nowDanielle KayeBusiness reporterStarbucks workers and union members in England, Scotland and eight other countries are protesting on Wednesday i",
    "body": "Just nowDanielle KayeBusiness reporterStarbucks workers and union members in England, Scotland and eight other countries are protesting on Wednesday in support of striking US employees, the company's US union told the BBC.Starbucks Workers United last month launched a strike, which the union said has expanded to 3,000 baristas in more than 100 US cities. Workers are pushing for better pay and staffing, and for the coffee chain to resolve hundreds of unfair labour practice claims.Starbucks said the strike affected less than 1% of the chain's shops, adding it had \"no impact\" on its overall business.The international action will involve hundreds of workers and union supporters, Starbucks Workers United said.The coordinated global action is unlikely to directly affect the company financially. It comes as the US union tries to ramp up pressure on the chain after negotiations stalled.In the UK, rallies organised by the union Unite are set to take place in London, Norwich and Glasgow, the union said. Workers in Glasgow will join a work stoppage.Coordinated demonstrations are also planned at Starbucks stores and offices in cities across Australia, Brazil, Canada, Italy, the Netherlands, Germany, Switzerland and Turkey. Also on Wednesday, baristas are gearing up to protest at the largest Starbucks in the world, in Chicago.\"Starbucks executives need to know: wherever Starbucks is, our picket lines will be there too,\" Diego Franco, a barista from Chicago, said in a statement.The company maintains that its pay and benefits are industry-leading, and that baristas continue to get more hours of work per week on average.Starbucks has in recent years faced consumer boycotts, a wave of new competitors and a customer backlash over high prices, as well as turmoil in its leadership ranks.The chain, under chief executive Brian Niccol, has been working to bring back customers, promising faster service and a return to its coffeehouse roots, with ceramic mugs and hand-written notes. It has also outlined plans to invest more than $500m to improve staffing and training.In October, Starbucks reported 1% growth in sales at global stores open at least one year - its first quarterly increase in almost two years. But in the US, sales were flat.Despite some recent progress in boosting sales, the company is still wrestling with a years-long labour fight that threatens to hamper its turnaround by bringing unwanted scrutiny.The Starbucks Workers United union, which launched four years ago, said it had won elections at more than 600 stores - roughly 5% of the chain's company-owned US locations.Union leaders say relations improved last year, but that contract discussions stalled when Mr Niccol - who was in charge of Chipotle when it faced complaints of labour rights violations - took the helm of the company last September.Even after the two sides agreed to bring in a mediator in January, they remained at odds over pay, staffing and unresolved charges of unfair labour practices.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Starbucks workers and unions in 10 countries to protest in support of US baristas",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b342/live/b0204560-d481-11f0-b433-753c64b53a9c.jpg"
      ],
      "datePublished": "2025-12-09T16:15:30.000Z",
      "dateModified": "2025-12-09T16:15:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former children's commissioner Baroness Anne Longfield to lead grooming gangs inquiry",
    "url": "https://www.bbc.com/news/articles/ckgk2pj2ygko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5e2a/live/c36324a0-d506-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-12-09T16:08:43.000Z",
    "description": "Ex-children's boss to lead grooming gang inquiry10 minutes agoMaia DaviesBBCBaroness Anne Longfield was the children's commissioner for England from 2",
    "body": "Ex-children's boss to lead grooming gang inquiry10 minutes agoMaia DaviesBBCBaroness Anne Longfield was the children's commissioner for England from 2015 to 2021A former children's commissioner will chair the inquiry into child sexual abuse by grooming gangs in what will be a \"moment of reckoning\", Home Secretary Shabana Mahmood has announced. Baroness Anne Longfield will lead the inquiry, which was derailed when four women resigned from its survivors panel and two leading candidates to chair the investigation pulled out.Home Secretary Shabana Mahmood said \"we must root out this evil once and for all\" as she announced in the Commons the peer would lead the three-year inquiry.The prime minister announced the inquiry for England and Wales in June after accepting the recommendation of Baroness Louise Casey's audit into group-based child sexual abuse.Baroness Longfield will be supported by panellists Zoe Billingham, a former inspector at HM Inspectorate of Constabulary and Fire & Rescue Services, and Eleanor Kelly, former chief executive of Southwark Council.Mahmood said Baroness Longfield and the two panellists had been recommended by Baroness Casey following \"recent engagement with victims\" and would meet survivors later this week.On her appointment, Baroness Longfield said the inquiry \"owes it to the victims, survivors and the wider public to identify the truth, address past failings and ensure that children and young people today are protected in a way that others were not\".Fiona Goddard - one of the survivors who quit the inquiry in October - said those still serving on the panel had \"not been consulted at all on the chair\".\"They have been overlooked and just used to give the impression of victim engagement,\" she wrote on X. She also criticised the selection of Baroness Longfield, who will resign the Labour whip in the House of Lords to chair the inquiry.\"That doesn't change a lifetime of representing Labour's best interests,\" Ms Goddard said, arguing that the inquiry was not \"independent\" of government.The inquiry will comprise a series of targeted local investigations into the group-based child sexual exploitation of girls by grooming gangs, overseen by a national panel. As a statutory inquiry, it will have more powers - such as requiring people to testify and release other forms of evidence.Mahmood said one of these would be in Oldham, Greater Manchester, with the other locations to be decided.No area will be able to \"resist\" a local investigation during the inquiry, she added, which would last three years with a budget of £65m under draft terms of reference, which will be consulted on and confirmed by March 2026.The inquiry will also \"explicitly\" consider the backgrounds of offenders, including their ethnicity and religion, Mahmood said, and \"whether the authorities failed to properly investigate what happened out of a misplaced desire to protect community cohesion\".She noted that Baroness Casey's audit concluded that in some local areas a \"disproportionate\" amount of suspects for group-based child sexual exploitation were from Asian ethnic backgrounds where sufficient police data had been collected.\"Like every member of my community who I know, I am horrified by these acts,\" said Mahmood.\"The sickening acts of a minority of evil men - as well as those in positions of authority who looked the other way - must not be allowed to marginalise or demonise entire communities of law-abiding citizens.\"Baroness Casey's report also found that ethnicity data was not recorded for two-thirds of cases, meaning it was not robust enough to support conclusions about offenders at a national level.Mahmood said she had commissioned new research to \"rectify the unacceptable gaps\" in this area, and that she would draft a law as soon as possible so that police had to gather ethnicity data.She added that the government was working to disregard prostitution offences levelled against some victims with its Crime and Policing Bill.Responding in the Commons, Shadow Home Secretary Chris Philp called for an apology from the prime minister for having \"disgracefully smeared those calling for an inquiry as far-right\" earlier this year.In January, Sir Keir Starmer dismissed calls for a national inquiry, arguing the scandal had already been examined in a seven-year inquiry led by Professor Alexis Jay. He also suggested those calling for an investigation were \"jumping on a bandwagon\" and \"amplifying\" the demands of the far-right\". The scandal had returned to prominence partly because of tech billionaire Elon Musk, who was criticising the prime minister for not calling a national inquiry.Conservative leader Kemi Badenoch meanwhile said progress on the inquiry was welcome but survivors have been waiting too long for an inquiry they can trust.\"They have been ignored, dismissed and made to feel invisible. They are the ultimate judges of whether this inquiry is credible,\" she said. The inquiry was thrown into chaos in October when four women resigned from its survivors liaison panel in protest at how the government had handled the process so far.They called for Safeguarding Minister Jess Phillips to resign, accusing her of \"betrayal\" for denying claims the investigation might be broadened beyond grooming gangs.They also expressed doubts about two candidates proposed to chair the inquiry because one had a background in social work and the other as a senior police officer - two professions facing questions about trust.At the time, Phillips denied claims of a cover-up and insisted the government was \"committed to exposing the failures\".Five others abuse survivors wrote to the prime minister to say they would only continue working with the inquiry if Phillips kept her job.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former children's commissioner Baroness Anne Longfield to lead grooming gangs inquiry",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5e2a/live/c36324a0-d506-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-09T16:08:43.000Z",
      "dateModified": "2025-12-09T16:08:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump criticises 'decaying' European countries and 'weak' leaders",
    "url": "https://www.bbc.com/news/articles/clydlwldkvko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/df8a/live/623e1270-d515-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-09T16:11:46.000Z",
    "description": "US President Donald Trump has criticised European leaders as \"weak\" and suggested the US could scale back support for Ukraine.In a wide-ranging interv",
    "body": "US President Donald Trump has criticised European leaders as \"weak\" and suggested the US could scale back support for Ukraine.In a wide-ranging interview with Politico, he said \"decaying\" European countries had failed to control migration or take decisive action to end Ukraine's war with Russia, accusing them of letting Kyiv fight \"until they drop\". He argued that Russia held the \"upper hand\" and urged Ukrainian President Volodymyr Zelensky to \"play ball\" by ceding territory to Moscow.In the UK, Downing Street rejected Trump's claim that Europe had failed to act, citing the UK's leadership on sanctions and reiterating support for the US-led peace process.Trump claimed ideological divisions now threatened to fracture Washington's alliances. Asked whether leaders he viewed as weak could still be allies, he replied: \"It depends\", adding: \"I think they're weak, but I also think that they want to be so politically correct. I think they don't know what to do.\"His comments come a day after European leaders came together in London to discuss their continued joint efforts to reach a peace deal with Russia.The talks were the latest attempt by Ukraine's European allies to carve out a role in the US-led efforts to end the war, which they fear will undercut the long-term interests of the continent in favour of a quick resolution.Asked whether Europe could help end Russia's war with Ukraine, the US president said: \"They talk but they don't produce. And the war just keeps going on and on.\"Ukraine is preparing to present a revised peace plan to the White House, seeking alternatives to any settlement requiring territorial concessions. Zelensky, who has again ruled out surrendering land, is pressing European and Nato leaders to help deter the US from backing a deal that Kyiv fears would leave it exposed to future attack.His latest public criticism of Europe comes as he looks to increase pressure on Zelensky and Kyiv's allies to end the war in Ukraine.The president's remarks also came after his administration released its new 33-page National Security Strategy, which warned of Europe's potential \"civilisational erasure\" and questioned whether some nations could remain reliable allies. Russia welcomed that strategy - which did not cast Russia as a threat to the US - as \"largely consistent\" with Moscow's vision.The document also followed similar rhetoric to Trump's speech to the UN earlier this year, where he had harsh criticism for western Europe and its approach to migration and clean energy.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump criticises 'decaying' European countries and 'weak' leaders",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/df8a/live/623e1270-d515-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-09T16:11:46.000Z",
      "dateModified": "2025-12-09T16:11:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Crunch budget vote risks trouble for French PM",
    "url": "https://www.bbc.com/news/articles/c3w7530w37po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ed0e/live/bb05de60-d4f7-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-09T12:26:26.000Z",
    "description": "4 hours agoHugh SchofieldParisReutersFrench Prime Minister Sebastien Lecornu faces a crucial test on Tuesday as the country's divided parliament prepa",
    "body": "4 hours agoHugh SchofieldParisReutersFrench Prime Minister Sebastien Lecornu faces a crucial test on Tuesday as the country's divided parliament prepares to vote on a 2026 budget bill.If Lecornu fails to win a majority in the National Assembly for his social security budget, it bodes ill for the main budget bill which follows and which needs to be voted through by the end of the year.It could also pose awkward questions over his authority to lead the government, though for the moment there is little expectation he will resign.Appointed in September by President Emmanuel Macron, Lecornu has devoted himself exclusively to the uphill task of guiding 2026 budget legislation through the two chambers of parliament.Since snap elections called by Macron in June 2024, the more powerful chamber, the National Assembly, has been split into three roughly equal blocs – centre, left, and far-right -- none of which is capable of commanding a majority.Lecornu is Macron's fourth prime minister since then – the two previous incumbents Michel Barnier and François Bayrou having both been forced to resign after trying to rein in France's burgeoning debt.  Barnier stepped down exactly a year ago after failing to push through the 2025 social security budget.In the French system, there are two budgetary laws – one that raises and allocates money in the social security system, including hospitals and pensions; and the principal one that covers everything else, from defence to education.  For years both have run on massive deficits.Widely acknowledged for his discretion and diligence, Lecornu needs to convince enough deputies from the 11 different parliamentary groups that failure to vote the budgets through will plunge the country into even deeper financial gloom.His main target has been the Socialist Party (PS) with around 70 MPs, many of whom are uncomfortable in their erstwhile electoral alliance with the far-left France Unbowed party.In major concessions to the PS, Lecornu promised to suspend Macron's key second-term reform increasing to 64 the statutory age of retirement, and also to refrain from using a government power (known as 49-3) to force through the budget laws without a vote.Socialist leaders Olivier Faure and Boris Vallaud have praised Lecornu's sense of compromise and are urging their deputies to support the social security budget.But by giving ground to the centre-left, Lecornu has potentially lost support in his own camp on the centre-right, where important figures such as former Prime Minister Edouard Philippe say the bill will do little to redress the country's fast deteriorating public accounts.Tuesday's vote was set to be very close, with the far-right National Rally and its allies (140 or so deputies) and the far-left France Unbowed (71) both set to vote no, along with the Ecologists and Communists (55 altogether). A majority in a full chamber is 288 MPs.Lecornu is hoping to win over some individuals on the left with promises of more spending on hospitals. And he hopes opposition from within his own camp will be limited to abstentions rather than votes against.If the social security budget fails to pass, it would almost certainly mean that the main budget for 2026 would also fail.  As a result the government would probably introduce a special law to allow the state administration to continue functioning from 1 January using 2025 allocations.Though a personal blow to Lecornu and his low-key political methods, few expect that he would immediately step down in such a scenario.By voluntarily abandoning the use of the 49-3, the prime minister in effect gave MPs the chance to amend the government's budget text to their hearts' content.  If the text then fails, he calculates, the blame will fall primarily on heads in parliament.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Crunch budget vote risks trouble for French PM",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ed0e/live/bb05de60-d4f7-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-09T12:26:26.000Z",
      "dateModified": "2025-12-09T12:26:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Japan's Nankai Trough megaquake - can you predict it?",
    "url": "https://www.bbc.com/news/articles/cx2en927054o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/624b/live/e630ea00-565c-11ef-8f0f-0577398c3339.jpg",
    "tag": "Trending",
    "date": "2025-12-09T11:51:10.000Z",
    "description": "Does Japan's megaquake warning mean the 'big one' is coming?4 hours agoShaimaa Khalil,BBC News, TokyoandFlora Drury,BBC News, LondonAFP via Getty Imag",
    "body": "Does Japan's megaquake warning mean the 'big one' is coming?4 hours agoShaimaa Khalil,BBC News, TokyoandFlora Drury,BBC News, LondonAFP via Getty ImagesAfter a magnitude 7.5 earthquake struck north-eastern Japan on Monday, authorities again warned of the possibility of a future megaquake.It means that thoughts in Japan are turning to the \"big one\" - a once-in-a-century quake.In September, Japan's earthquake investigation panel said there was a 60-90% chance that a megaquake would occur in the Nankai Trough  - an area of seismic activity which stretches along Japan's Pacific coast - within the next 30 years. In April authorities had warned that a megaquake had the potential to trigger a tsunami of more than 20m (66ft) which could hit parts of Tokyo and other prefectures. They predicted that there would be around 300,000 deaths and trillions of dollars in economic damage.So, what is the \"big one\", can it be predicted - and is it likely to strike any time soon?What did the latest warning say?Officials urged residents in seven prefectures from Hokkaido in the north to Chiba in central Japan to stay on high alert for a potential megaquake.This is a vast area with millions of people.A government official said there was a possibility that \"a large-scale earthquake with a magnitude of 8 or higher could occur as a follow-up earthquake\" in the region.Authorities also told people to check evacuation routes, secure furniture, and prepare emergency kits, including food, water and portable toilets.However, an evacuation order was not issued. Japan's director for disaster management said at a news conference that global earthquake data suggests there's a possibility, not a prediction, of a larger tremor to come.Officials said the possibility of a larger quake occurring is about one in 100. What is a megaquake?APThe last megaquake occured along the Nankai Trough almost 80 years agoJapan is a country used to earthquakes. It sits on the Ring of Fire and, as a result, experiences about 1,500 earthquakes a year. The vast majority do little damage, but there are some - like the one which struck in 2011 measuring magnitude 9.0, sending a tsunami into the north-east coast and killing more than 18,000 people.But the one that authorities fear may strike in this more densely populated region to the south could - in the absolute worst-case scenario - be even more deadly.Earthquakes along the Nankai Trough have already been responsible for thousands of deaths. In 1707, a rupture along its entire 600km length caused the second-biggest earthquake ever recorded in Japan and was followed by the eruption of Mount Fuji.The Nankai Trough sits between Suruga Bay, in central Japan, and the Hyuganada Sea in Kyushu to the southThese so-called \"megathrust\" earthquakes tend to strike every hundred years or so, often in pairs: the last ones were in 1944 and 1946.And this long-anticipated event is, according to geologists Kyle Bradley and Judith A Hubbard, \"the original definition of the 'Big One'”.\"The history of great earthquakes at Nankai is convincingly scary\" so as to be concerning, the pair acknowledged in their Earthquake Insights newsletter last year.But can earthquakes actually be predicted?Not according to Robert Geller, professor emeritus of seismology at the University of Tokyo.When authorities issued a megaquake warning last year, after a 7.1 quake struck southern Japan, Prof Geller told the BBC that the warning had \"almost nothing to do with science\".The advisory was \"not a useful piece of information\", he said.This, he argued, is because while earthquakes are known to be a \"clustered phenomenon\", it is \"not possible to tell in advance whether a quake is a foreshock or an aftershock”.Indeed, only about 5% of earthquakes are \"foreshocks\", said Bradley and Hubbard.However, the 2011 earthquake was preceded by a 7.2 magnitude foreshock, they note - one which was largely ignored.The warning system was drawn up after 2011 in an attempt to prevent a disaster of this scale again. August 2024 was the first time the Japan Meteorological Agency (JMA) used it.Getty ImagesA massive earthquake in 2011 killed more than 18,000 peopleBut, crucially, while it told people to be prepared, it did not tell anyone to evacuate. Indeed, they were keen to play down any massive imminent risk.\"The likelihood of a new major earthquake is higher than normal, but this is not an indication that a major earthquake will definitely occur,\" the JMA said at the time.Additional reporting by Chika Nakayama and Jake Lapham",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Japan's Nankai Trough megaquake - can you predict it?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/624b/live/e630ea00-565c-11ef-8f0f-0577398c3339.jpg"
      ],
      "datePublished": "2025-12-09T11:51:10.000Z",
      "dateModified": "2025-12-09T11:51:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man, 28, accused of raping two teenage girls in Bolton",
    "url": "https://www.bbc.com/news/articles/cd9zygpn81jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6d9e/live/438ffc20-d4ee-11f0-9abd-ef7d7ff2dab9.png",
    "tag": "Trending",
    "date": "2025-12-09T11:08:15.000Z",
    "description": "A man has been charged with the rape of two teenage girls in Bolton over the weekend.Sultani Bakatash, 28, is due before Manchester and Salford Magist",
    "body": "A man has been charged with the rape of two teenage girls in Bolton over the weekend.Sultani Bakatash, 28, is due before Manchester and Salford Magistrates' Court accused of sexual offences against two 14-year-old girls.Greater Manchester Police (GMP) said the man was an Afghan national and had been arrested in the early hours of Sunday following a report of rape at a flat in Middle Hulton.Under national guidelines police can release details about nationality, but GMP did not specify a reason for doing so in this case.The force said the defendant had self-defined their ethnicity as \"any other\". It added criminal proceedings were active and urged the public not to speculate while investigations continued.GMP said the suspect had been charged with two counts of rape of a girl aged under 16, one count of sexual assault and one count of assault by penetration.It is alleged the suspect had previously been in online contact with the girls before meeting them.Both are being supported by specialist teams as officers continue to investigate the full circumstances.GMP said it was not looking for anyone else in connection with this incident.Ch Supt Helen Critchley, Bolton district commander, said: \"This is a deeply concerning report, and our priority is supporting the two young girls and their families at this traumatic time.\"We have acted quickly since this was reported to us in the last 48 hours, and we've been using all available resources to understand what has happened and help this case progress through court.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man, 28, accused of raping two teenage girls in Bolton",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6d9e/live/438ffc20-d4ee-11f0-9abd-ef7d7ff2dab9.png"
      ],
      "datePublished": "2025-12-09T11:08:15.000Z",
      "dateModified": "2025-12-09T11:08:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Covid scheme fraud hit almost £11bn but much 'beyond recovery', report says",
    "url": "https://www.bbc.com/news/articles/c075vjxyx3no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/deae/live/07c3aef0-d4fb-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-12-09T15:48:32.000Z",
    "description": "30 minutes agoNick EdserBusiness reporterMuch of the £10.9bn in taxpayer money lost to fraud and error in Covid support schemes is now \"beyond recover",
    "body": "30 minutes agoNick EdserBusiness reporterMuch of the £10.9bn in taxpayer money lost to fraud and error in Covid support schemes is now \"beyond recovery\", a report has said.The response to the pandemic had led to \"enormous outlays of public money which exposed it to the risk of fraud and error\" with many organisations unprepared, the Covid Counter Fraud Commissioner, Tom Hayhoe, said.Employment support schemes set up by the previous Conservative government, including furlough and help for the self-employed, suffered £5bn of fraud, the report found.Many of the support measures were credited with propping up the economy throughout the Covid lockdowns. However, Mr Hayhoe said the \"outrage\" at fraud, abuse and error was  \"undiminished\".Mr Hayhoe had been asked by Chancellor Rachel Reeves to investigate the amount of public money lost to fraud given his experience in procurement as the former chair of an NHS trust.The near £11bn lost to fraud and error is close to what the government spends on the UK's justice system. The report said £1.8bn had been recovered, although: \"Much of the shortfall is now beyond recovery.\"However, it added that there were still areas \"where investing in recovering money paid out incorrectly is worthwhile and work should continue\".When asked on BBC Radio 5 live how much more money could be recovered, Mr Hayhoe said \"I don't know.\" But he added that new laws extended the amount of time authorities had to uncover fraud cases. Mr Hayhoe said that, for him, the main issue to come out of study was \"the scale at which people were prepared to pull a fast one and make money out of the taxpayer in a crisis\".\"If there's one single lesson that comes out of this is the lesson that you can't assume that everyone – even in difficult times like Covid-19 was – will do the right thing.\"The report found weak accountability, bad quality data and poor contracting contributed to the losses.Most public bodies were unprepared for \"a crisis that required spending on such a scale and with such urgency\".\"Consequently, some measures to protect against potential fraud were inadequate.\"This applied to the procurement of Personal Protective Equipment (PPE) where the volume of orders \"overwhelmed the newly created supply chain and involved measures that invited mistrust, opportunism and profiteering\".It found £13.6bn was spent on PPE procurement, with 38 billion items purchased - although 11 billion were unused by 2024. Losses were estimated at £10bn from over-ordering and £324m of fraud.The support for small businesses was also criticised, where \"lending relied on self-certification with inadequate checks to prevent abuse\".It said the design of the Bounce Back Loan Scheme \"created specific vulnerabilities to fraud and error\". Fraud related to that programme, together with other business loan schemes, is estimated to have cost the public about £1.7bn.The report acknowledges that the schemes were designed and rolled out at speed, and My Hayhoe paid tribute to public servants who \"were working their socks off in really difficult time during the crisis\".However, given the pressure they \"did things that in retrospect were not necessarily the right things\", he said. The report recommends that fraud prevention should be more embedded into future disaster responses.In September the government launched a voluntary repayment scheme for people and businesses to return pandemic scheme money with no questions asked until the end of December.Rachel Reeves welcomed the report and said the government would respond fully in the new year.Speaking in the Commons, she criticised the previous Conservative government, saying they \"played fast and loose with the public purse and left the front doors wide open to fraud\".\"This government will leave no stone unturned, because that money belongs to taxpayers.\"Conservative leader Kemi Badenoch said fraud was absolutely something she was concerned about when she was in government, but that getting money to people who needed it was something she was proud of.Asked if she would apologise for it, she said: \"We're not the ones who took out the fraudulent loans. We set up a scheme in record time to make sure we could pay people in the middle of a pandemic and I will always be proud of what the Conservative government did then.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Covid scheme fraud hit almost £11bn but much 'beyond recovery', report says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/deae/live/07c3aef0-d4fb-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-09T15:48:32.000Z",
      "dateModified": "2025-12-09T15:48:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TV faithful Claudia Winkleman made MBE by the King at Windsor Castle",
    "url": "https://www.bbc.com/news/articles/cx2g0117qgpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f7bf/live/fb29d900-d502-11f0-949c-45d05c88eada.jpg",
    "tag": "Trending",
    "date": "2025-12-09T15:32:40.000Z",
    "description": "47 minutes agoPaul GlynnCulture reporterClaudia Winkleman was all smiles on Tuesday after being made an MBE by King Charles III at an investiture cere",
    "body": "47 minutes agoPaul GlynnCulture reporterClaudia Winkleman was all smiles on Tuesday after being made an MBE by King Charles III at an investiture ceremony at Windsor Castle.The Traitors and Strictly Come Dancing presenter was recognised in the King's Birthday Honours this summer alongside her Strictly co-host, Tess Daly, for services to broadcasting.Winkleman, who wore a white suit with matching headband and a black shirt for the occasion, was joined by family - including her mother, journalist Eve Pollard - at the royal residence.Following the event, the star posted on Instagram: \"An incredible morning and an enormous honour. I'm speechless.\"Winkleman won a Bafta award in 2023 for her deadpan work on The Traitors, which returns in the New Year.Alan Carr won the recent celebrity version, with the final episode being watched by a peak audience of 12 million, according to the BBC.Until the success of the show, Winkleman was best known for co-presenting BBC One's flagship celebrity dance contest, which she has been bringing her warmth and wit to in one form or another since 2004.She first presented its spin-off show, It Takes Two, then began co-presenting the Sunday night results show alongside Daly in 2010.It was 2014 when the pair first presented the main Saturday night show together, with Winkleman filling the big shoes of Bruce Forsyth.The presenting duo announced in October that they will both be leaving at the end of the current series, with the Christmas Day special marking their final appearance.\"We have loved working as a duo and hosting Strictly has been an absolute dream. We were always going to leave together and now feels like the right time,\" they wrote in a joint statement on Instagram.Last month Daly was honoured by the King, whose wife, Queen Camilla, last year revealed: \"We all watch it. I'm one of Strictly's greatest fans.\"Winkleman's sister, Peep Show actress Sophie Winkleman, became a member of the Royal family herself after marrying Lord Frederick Windsor.Alongside It Takes Two, Winkleman began hosting various reality shows including BBC Three's The House of Tiny Tearaways and ITV's Hell's Kitchen, before she took the helm as one of the co-presenters of BBC One's Film programme, following the departure of Jonathan Ross.She also hosted Comic Relief, The Great British Sewing Bee and The Piano talent show on Channel 4, as well as a raft of shows on BBC Radio 2.Earlier this year she was given the Royal Television Society's outstanding achievement award.After being named on the honours list in June, Winkleman said she was \"incredibly grateful to receive this honour\".\"It's a real privilege to work with extraordinarily talented people and I have only got this because of them. So this is for the BBC, the Traitors and the Faithful, for pianos and for the cha cha,\" she added.Meanwhile on Tuesday, Sir Antony Gormley was also recognised by King Charles at the same ceremony.The Angel of the North sculptor joined the elite Companions of Honour, an exclusive group limited to only 65 recipients at any one time.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TV faithful Claudia Winkleman made MBE by the King at Windsor Castle",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f7bf/live/fb29d900-d502-11f0-949c-45d05c88eada.jpg"
      ],
      "datePublished": "2025-12-09T15:32:40.000Z",
      "dateModified": "2025-12-09T15:32:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Katie Boulter misses out on a place in the main draw of the Australian Open",
    "url": "https://www.bbc.com/sport/tennis/articles/c0edz5xny0go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b5e5/live/cdb14690-d4e2-11f0-ad0f-1bf8c30d15bc.jpg",
    "tag": "Trending",
    "date": "2025-12-09T11:02:40.000Z",
    "description": "Former British number one Katie Boulter has missed out on a place in the main draw for the Australian Open.There are 104 players who have received dir",
    "body": "Former British number one Katie Boulter has missed out on a place in the main draw for the Australian Open.There are 104 players who have received direct entry into the Melbourne draw, including those with protected rankings, with Boulter currently ranked 106.The 29-year-old will now have to go through qualifying at Melbourne Park in January for the first Grand Slam of 2026.Boulter had the opportunity to earn extra ranking points in the WTA 125 challenger event in France last week but opted not to play after sustaining a hip injury in Hong Kong in October.She told BBC Sport in November that she had to \"choose between my body and my ranking\" when weighing up whether to play to improve her ranking. \"If there are tournaments there, it gives you an opportunity because you want to make the main draw of Australia,\" she said at the time.\"I think I know my own right choice, but it's difficult because it means that everyone else is going to be playing and passing me.\"Boulter has won just 14 Tour-level main-draw matches this year and recently split with coach Biljana Veselinovic after a three-year partnership in which she won three WTA titles.Emma Raducanu, Sonay Kartal and Francesca Jones all received direct entry into the main draw - along with Jack Draper, Cameron Norrie and Jacob Fearnley.For the first time, the men's Australian Open entry list was drawn up in November - which is the ATP's official year-end ranking date - with the earlier draw aimed at discouraging players from chasing ranking points in the off season, as Boulter could have.The women's entry list was based on the world rankings as of 8 December.\"There has to be somewhere where you draw the line and you give people an opportunity to recuperate and also get a good pre-season in,\" Boulter said.\"I feel like this year we've seen so many burnouts, and so many people not playing the end of year because of mental health issues as well as body issues, and I do think it contributes to it.\"Now Boulter will need to win through qualifying if she is to make the main draw at Melbourne Park for the sixth time in her career.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Katie Boulter misses out on a place in the main draw of the Australian Open",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b5e5/live/cdb14690-d4e2-11f0-ad0f-1bf8c30d15bc.jpg"
      ],
      "datePublished": "2025-12-09T11:02:40.000Z",
      "dateModified": "2025-12-09T11:02:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "EU investigates Google over AI-generated summaries in search results",
    "url": "https://www.bbc.com/news/articles/crl95eg33k1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1308/live/968a9a60-d4f4-11f0-ad89-6340086573f4.jpg",
    "tag": "Trending",
    "date": "2025-12-09T13:24:15.000Z",
    "description": "3 hours agoLiv McMahonTechnology reporterThe EU has opened an investigation into Google over its artificial intelligence (AI) summaries which appear a",
    "body": "3 hours agoLiv McMahonTechnology reporterThe EU has opened an investigation into Google over its artificial intelligence (AI) summaries which appear above search results.The European Commission said it would examine whether the firm used data from websites to provide this service - and if it failed to offer \"appropriate compensation\" to publishers.It is also investigating how YouTube videos may have been used to improve its broader AI systems, and whether content creators were able to opt-out.A Google spokesperson said the probe \"risks stifling innovation in a market that is more competitive than ever\".\"Europeans deserve to benefit from the latest technologies and we will continue to work closely with the news and creative industries as they transition to the AI era,\" they said.The EU's investigation will also cover Google's AI Mode, which gives people an answer in a conversational style with some links to other pages.It is in addition to the tech giant's existing search platform - providing an experience similar to its rivals such as ChatGPT.What is AI and how does it work?Google's introduction of its AI Overview summaries was met with concerns it could result in fewer visitors to websites.Without people clicking on web pages, sites generate less money from advertising.The Daily Mail previously claimed the number of people who clicked its links from Google search results fell by around 50% since Google introduced its AI Overview feature.The Commission said it was concerned both web publishers and YouTube video creators were not being compensated or given the opportunity to opt-out of their content being used to train the company's AI models.Ed Newton-Rex from AI fairness campaigners Fairly Trained said it was \"career suicide\" for people to not publish their work on YouTube or online.He told the BBC Google \"essentially makes it a condition\" of online publishing that the firm can \"use your work to build AI that competes with you\".\"This investigation could not come at a more critical time for creators around the world,\" he said.And the move was also welcomed by Rosa Curling, co-executive director of campaign group Foxglove - which had called on the Commission in June to tackle the impact of AI Overviews on independent media organisations.But she said \"clear and present\" dangers to journalism and democracy remain.\"We need an urgent opt out for news publishers to stop Google from stealing their reporting today – not when this investigation is finished,\" she said.\"Otherwise, there will be little left, by the time the Commission is ready to act.\"The Commission's investigation comes down to whether Google has used the work of other people published online to build its own AI tools which it can profit from.Its generative AI systems are capable of producing text, images and video in seconds, in response to simple text prompts.Many firms can now do this - and they have used huge volumes of online web content to train their underlying systems.But creatives have voiced concern their work may have formed the basis for big tech's AI products and outputs, at the expense of their own rights or livelihoods.\"A free and democratic society depends on diverse media, open access to information, and a vibrant creative landscape,\" said Commission executive vice-president Teresa Ribera.She said AI was ushering in \"remarkable innovation\" and \"many benefits for people and businesses\" - but its growth should not come at the cost of the EU's values.But the Commission's recent enforcement of its tough digital rules - which can see tech companies face huge fines if they found to be breaching them - has been met with outrage from US lawmakers.Elon Musk's platform X axed the Commission's account for placing adverts on the site, after the EU brandished a €120m (£105m) fine over its blue verification badges.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "EU investigates Google over AI-generated summaries in search results",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1308/live/968a9a60-d4f4-11f0-ad89-6340086573f4.jpg"
      ],
      "datePublished": "2025-12-09T13:24:15.000Z",
      "dateModified": "2025-12-09T13:24:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]