[
  {
    "title": "Will Hamas really relinquish control in Gaza?",
    "url": "https://www.bbc.com/news/articles/cn51w77vlp9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4908/live/348990d0-ab66-11f0-ba75-093eca1ac29b.jpg",
    "tag": "Trending",
    "date": "2025-10-20T20:58:30.000Z",
    "description": "Hamas ruled Gaza with an iron rod - will it really give up control?11 hours agoPaul AdamsDiplomatic correspondent, Jerusalem andRushdi AbualoufGaza co",
    "body": "Hamas ruled Gaza with an iron rod - will it really give up control?11 hours agoPaul AdamsDiplomatic correspondent, Jerusalem andRushdi AbualoufGaza correspondentBBCHow does a group that has governed the Gaza Strip for almost 20 years, ruling two million Palestinians with an iron rod and fighting Israel in repeated wars, suddenly lay down its arms and relinquish control?Judging by a steady stream of gruesome images emerging from Gaza since the ceasefire came into effect on 10 October, Hamas seems intent on reasserting its authority.Its masked men, back on the streets, have been seen beating and executing opponents. Impromptu firing squads have dispatched kneeling men they say are members of rival groups, including some of Gaza's powerful clans.Other victims, cowering in terror, are shot in the legs or beaten with heavy clubs.Some of those now being attacked by Hamas had been part of groups involved in looting and diverting aid, according to one aid worker I spoke to, exacerbating the humanitarian crisis. The UN has also accused criminal gangs of stealing aid.This is not yet a world in which, as US President Donald Trump's 20-point Gaza peace plan envisages, Hamas fighters turn over their weapons, submit to an amnesty, leave Gaza and hand over to an international stabilisation force.AFP via Getty ImagesThe ceasefire came into effect on Friday 10 October​ - Hamas and Israel have both blamed each other for blatant violations of itFor his part, President Trump initially seemed ambivalent about the brutality.On his way to Israel on 13 October, he signalled the US had given Hamas - designated a terrorist group by the US, UK, Israel and others - a green light to restore order.\"We have given them approval for a period of time,\" he told reporters aboard Air Force One.Three days later, he hardened his tone. \"If Hamas continues to kill people in Gaza, which was not the Deal,\" he wrote on Truth Social, \"we will have no choice but to go in and kill them.\"So, where does this situation on the ground in Gaza today leave Hamas? And ultimately, after two years of war that has resulted in unparalleled suffering for its own people and the violent death of most of its key figures, what, if anything, does the future really hold for the group?'A complete loss of law and order'For many Gazans, traumatised and exhausted by two years of perpetual suffering - and a war that has killed 68,000 people in Gaza according to the Hamas-run Health Ministry - this ugly endgame is nerve-wracking, but doesn't come as a surprise.Of the Gazans I spoke to - among them, aid workers, lawyers, as well as a former adviser to a Hamas leader - each has a different take on the likelihood of Hamas laying down its arms and relinquishing control. And indeed - given the situation on the ground - whether now is the time for them to do so.Anadolu via Getty ImagesPalestinians gathered to celebrate following the announcement of the ceasefire agreement \"It's been two years with a complete loss of law and order,\" aid worker Hanya Aljamal says from her home in Deir al-Balah, in the middle of the Gaza Strip. \"We need someone to take over.\"As unqualified as Hamas is to rule the Strip, they are a better option than the gangs.\"Dr Ahmad Yousef, a former advisor to Ismail Haniyeh, who was Hamas's political leader, is of the opinion that a firm grip is needed at present.\"As long as there are still people who try to take the law into their hands, we need somebody to scare them and squeeze them to the corner,\" says Dr Yousef, who now runs a Gaza think tank and remains close to the Hamas leadership.'As unqualified as Hamas is to rule the Strip, they are a better option than the gangs,' argues aid worker Hanya Aljamal \"This will take time. Not a long time. Within a month we will host those police forces and soldiers from Turkey and Egypt,\" he continues, referring to the international stabilisation force for Gaza, outlined in the peace plan, that could be composed of troops from Egypt and Turkey, among others. \"This is the moment where they will set their guns aside.\"Other Gazans are more sceptical, and fearful. Some aren't convinced that Hamas will give up their power - or weapons at all.Moumen al-Natour, a Gaza-based lawyer imprisoned several times by Hamas, is one of them. AFP via Getty ImagesMany Palestinians and Israelis doubt Hamas is willing to step back from a political roleHe has been in hiding since July, when he says masked Hamas gunmen came to his Gaza City apartment and ordered him to report to al-Shifa hospital for interrogation.\"Hamas is [sending] a message to the world and to President Donald Trump… that they will neither relinquish power nor hand over their weapons.\"If I fell into Hamas' hands now, they would make a video and kill me in the street with a shot to the head,\" he says in one of a series of videos sent to us from an undisclosed location in the Gaza Strip. The wall behind him is riddled with bullet holes.Moumen al-Natour, a Gaza-based lawyer: 'If I fell into Hamas' hands now, they would make a video and kill me in the street with a shot to the head'\"It is a gang, not a government,\" he says of Hamas. \"I don't want them to remain in Gaza… I don't want them in government, and I don't want them in security. I don't want to see their ideas spread in mosques, in the streets, or in schools.\"'Still the dominant player in Gaza'Mr al-Natour has his own take on what Gaza could look like.The disparate array of militias now under Hamas assault could, in his view, be integrated into a new security apparatus. But with their competing agendas, sometimes murky pasts and, in some cases, controversial links to the Israeli military, it's a problematic proposition.\"The fact is – and sometimes it's very hard for Israelis to admit this – that Hamas still exists and is the dominant player in Gaza.\" says Dr Michael Milshtein, a former head of the department for Palestinian Affairs in Israeli Military Intelligence.\"Relying on suspicious players - clans, militias, gangs, many of them criminals, many of them affiliated with ISIS [the Islamic State group], many of them involved in terror attacks against Israel - and considering them as a kind of alternative to Hamas is an illusion.\"'Hamas still exists and is the dominant player in Gaza' says Dr Michael Milshtein, a former head of the department for Palestinian Affairs in Israeli Military IntelligenceHamas officials have said the group is willing to hand over political control of Gaza. The Trump ceasefire plan, to which it gave its qualified support, envisages \"temporary transitional governance of a technocratic, apolitical Palestinian committee\".But even if the group is willing to step back from a political role – something many Palestinians and Israelis still doubt - persuading its battle-hardened fighters to lay down their weapons is a big step for an organisation whose power, even before October 2023, relied heavily on the force of arms.Rise of Hamas and its iron gripTo begin to answer the complex question of what may happen to Hamas next requires delving backwards into how exactly it consolidated power in the first place.From its origins in the 1980s as an offshoot of the Egyptian Muslim Brotherhood and a rival to the secular Palestine Liberation Organization (PLO), Hamas morphed into a violent militant group responsible for the deaths of Israeli civilians.Initially, Israel offered discreet support to Hamas, seeing it as a useful counterweight to the PLO and its dominant faction, Fatah, led at the time by Yasser Arafat.\"The major enemy was Fatah,\" says Ami Ayalon, former head of Israel's domestic security service, Shin Bet, \"because they were the people who demanded a Palestinian state.\"But when Hamas launched deadly suicide bomb attacks in the 1990s and 2000s on Israelis, Israel responded with a series of high-profile assassinations.A violent power struggle with Fatah left Hamas, which won a 2006 election, in sole control of the Gaza Strip.Eighteen years of Hamas rule have followed, characterised by an Israeli military and economic blockade, and bouts of armed conflict in 2008-09, 2012, 2014 and 2021.Despite Israeli claims since October 2023 that \"Hamas is ISIS\", the government of Israeli Prime Minister Benjamin Netanyahu has previously convinced itself that Hamas did not pose a strategic threat.\"His was a policy of managing the conflict,\" says Mr Ayalon. \"He said we are not going to solve it and we are totally against the reality of two states, so the only way is to divide and control.\"With Hamas in control in Gaza and the Palestinian Authority, led by President Mahmoud Abbas, ruling in part of the occupied West Bank, the Palestinians remained hopelessly divided, enabling Israel to argue that it had no unified leadership to negotiate peace with.\"[Netanyahu] did everything in order to support Hamas in Gaza,\" Mr Ayalon says. \"He let Qatar send them… more than $1.5bn.\"Getty ImagesIsrael has gone to enormous lengths to eliminate Hamas's key political and military figuresThe money from Qatar was meant to pay the wages of civil servants and support the poorest families, but security chiefs feared it was being used for other purposes.Mr Ayalon adds: \"It was clear to the director of the Shin Bet and the head of Mossad that this money would go to military infrastructure.Netanyahu has defended allowing payments to Hamas, saying it was meant to aid the civilian population.Hamas was always preparing for warAs 7 October brutally revealed, Hamas was always preparing for war. Nowhere was this more obvious than in its elaborate network of tunnels.Tunnels had already been used to mount attacks on Israeli army positions during the second Palestinian uprising, or \"Intifada\" that began in 2000.In 2006, Hamas fighters used a tunnel under the border with Israel to attack a military post near Kerem Shalom, killing two Israel soldiers and kidnapping a third, Gilad Shalit. He was held for five years until his release, in 2011, in exchange for 1,027 Palestinian prisoners, including Yahya Sinwar, who would go on to mastermind the Hamas attacks of October 2023.Getty ImagesYahya Sinwar, one of those behind the Hamas attacks of October 2023Over time, Hamas' tunnel network expanded, to include workshops, weapons-manufacturing sites and command centres.Regional developments also played a role. In 2012, after the fall of the Libyan dictator Muammar Gaddafi and the brief rise to power of the Muslim Brotherhood in Egypt, Hamas was able to smuggle increasingly sophisticated weapons into Gaza, including sniper rifles, mobile rocket launchers and equipment for the manufacture of long-range rockets.Hamas is thought to have benefitted from the help of technicians and fighters with experience of tunnelling in places like Lebanon and Iraq.Iran was also a key supporter, seeing Hamas as a natural component in its \"Axis of Resistance,\" a loose coalition of militant groups across the Middle East with a shared antipathy towards Israel and the United States.In 2020, a US State Department report said that Iran was providing around $100m a year to Palestinian militant groups including Hamas.Yousef Masoud/SOPA Images/LightRocket via Getty ImagesOver time, Hamas' tunnel network expandedSome tunnels were reportedly dug as deep as 230ft (70m) below ground, took years to build and cost tens of millions of dollars each. These were designed to protect senior Hamas commanders and house long-range weapons.A local expert with extensive knowledge of the tunnels told the BBC the cost of the entire project totalled roughly $6bn (£4.5bn).Precise figures are hard to come by, but it's thought that the scattered network extended for as much as 250 miles (400km), in a strip of land just 26 miles long and, at its widest, seven miles across.Tunnels: a project shrouded in secrecyPublic discussion of the tunnels - their location or cost - could expose Gazans to accusations of espionage, leading to arrest and worse. But many knew what was happening. Local residents would see the tell-tale signs: sand and clay being removed, new entrances appearing unexpectedly and machinery being brought in under cover of darkness.What began as an opportunistic response to Gaza's isolation became, over the span of three decades, a multi-layered subterranean industrial and military complex.It emerged later that much of it was concealed under Gaza's civilian infrastructure, including hospitals, schools and, in the case of a tunnel containing a Hamas data centre, the headquarters of the UN Relief and Works Agency (UNRWA) in Gaza City.Anadolu via Getty ImagesAt least 67,938 people have been killed by Israeli attacks in Gaza since since October 2023, according to the Hamas-run health ministryAfter 7 October 2023, when Hamas fighters stormed into Israel, killing around 1,200 people and taking 251 hostage, it also became a massive underground prison. Not all of those held hostage were concealed in tunnels, but many were, especially as the war ground on.Eli Sharabi, who became one of the most high profile of those taken, was first moved from a safe house into a tunnel after 52 of his 491 days in captivity. \"They tied us with ropes in our legs and hands,\" he told the BBC earlier this month. \"I fainted from time to time from the pain. One time they broke my ribs.\"By the time he was released, in February, he had lost more than 30kg (4st 10lb).EPAEli Sharabi, who was held hostage, was moved from a safe house into a tunnel. 'They tied us with ropes,' he has saidHamas used the hostages as bargaining chips, to secure ceasefires or the release of Palestinians held in Israeli prisons. As negotiations over their fate continued, Hamas drip fed the Israeli public with a cruel series of videos, often showing the hostages in situations of extreme distress.Eventually it was, says Dr Yousef, internal and external pressure that forced Hamas to abandon the strategy.\"Qatar, Egypt and Turkey and also the people here in displacement camps sent a strong message to Hamas leaders outside that enough is enough.\"Getty ImagesIsrael assassinated Hamas's powerful leader, Ismail Haniyeh, in Tehran in July 2024In the meantime, Israel continues to destroy what it can of the tunnel network, often demolishing civilian neighbourhoods above in the process.And the job is far from done.\"According to publications from the defence establishment, estimates speak of damage to between 25% and 40% of the tunnels,\" says Yehuda Kfir, an Israeli civil engineer and underground warfare researcher at Haifa's Technion University.\"No doubt [Hamas] aspires to rehabilitate the infrastructure, including restoring tunnels that were dealt with in various ways by the IDF.\"A leadership in tattersRestoring tunnels is one thing. Reconstituting the organisation is another. After the events of the past two years, Hamas' leadership is in tatters.Israel has gone to enormous lengths - in Gaza, Iran, Lebanon and Qatar - to eliminate the group's key political and military figures. From its best known, internationally recognisable leaders, travelling the world to promote their cause, to its battalion commanders on the ground in Gaza, Hamas has lost almost everyone of consequence.Israel assassinated Hamas's powerful leader, Ismail Haniyeh, in Tehran in July 2024. Three months later, Haniyeh's successor, the elusive Yahya Sinwar, was killed in the ruins of a house in Rafah.ReutersIsmail Haniyeh (left) was assassinated in Tehran in July 2024, followed three months later by his successor Yahya Sinwar (centre). Hamas deputy leader Saleh al-Arouri (right) was killed in Beirut blastDespite the loss of these leading figures - and thousands of members of its armed wing - the group battled on, recruiting a fresh generation of radicalised young fighters and splintering into small cells intent on carrying out hit-and-run guerrilla-style operations.But Hamas in October 2025 is a pale shadow of the organisation that carried out the attacks of 7 October. Today's leaders are less well known and, crucially, have little political experience.Ezzedine al-Haddad, who is 55, now heads the five-member military council that commands Hamas' armed wing, the Izz al-Din al-Qassam Brigades.EPA/ ShutterstockMany of the group's key political and military figures have been killed. (L-R) Ismail Haniyeh, Yahya Sinwar, Mohammed Deif and Sheikh Ahmed YassinOutside Gaza, the remnants of the group's political leadership include Khaled Meshaal (the subject of a botched Israeli assassination attempt in Jordan in 1997), Khalil al-Hayya and Muhammad Darwish.All are believed to have escaped death on 9 September, when Israeli jets attacked a building in Doha, Qatar, where they were meeting to discuss the latest US ceasefire proposals.Hamas is 'tired of war'Despite the violence still raging in Gaza, the former Hamas adviser, Ahmed Yousef, says the group is tired of war. Without mentioning 7 October directly, he describes the cause of the war as a \"terrible mistake\" and that a \"different approach\" is needed.Anadolu via Getty ImagesPeople sit among the rubble and wreckage of war in Gaza. The former Hamas adviser, Ahmed Yousef, claims Hamas is also tired of war\"I'm talking to many of them and they have said that they are not interested in ruling Gaza anymore,\" he says. \"But Hamas has more than 100,000 members and those people are not going to disappear.\"Hamas, he suggests, is looking to rebrand itself in order to continue to play a political role in the future, a process he likens to the ANC's transition from guerrilla warfare to political rule in post-apartheid South Africa.\"If tomorrow there [are] elections,\" he says, \"I'm sure Hamas will come under different names, giving the impression it is more peaceful and more willing to be part of political life. \"Violence is not going to be part of any political party.\"Dr Milshtein is doubtful.\"Even if there will be a new local regime in Gaza, of course behind the scenes Hamas will be the dominant player,\" he argues.Anadolu via Getty ImagesIsrael may have to deal with Hamas for some time to comeDisarmament, he continues, is even less likely: he predicts another Gaza war within the next five years.But Ami Ayalon, the former Shin Bet chief, believes Israel should find another way to tackle its enemy.\"Unless we defeat the ideology, they will flourish,\" he says. \"The only way to defeat the ideology is by creating and presenting to the Palestinian and the Israeli people a new horizon. A horizon of two states.\"For now, that horizon does not exist, perhaps making Dr Milshtein's prediction more likely than Ami Ayalon's vision of a shared future.But Hamas, however diminished, is far from a spent force. One way or another, Israel may have to deal with it for some time to come.Top picture credit: Getty ImagesBBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. You can now sign up for notifications that will alert you whenever an InDepth story is published - click here to find out how.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Will Hamas really relinquish control in Gaza?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4908/live/348990d0-ab66-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-20T20:58:30.000Z",
      "dateModified": "2025-10-20T20:58:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Prince Andrew dropping title is victory for Virginia Giuffre, co-author tells BBC",
    "url": "https://www.bbc.com/news/articles/c201k3wd65yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d38f/live/a4681fa0-adf7-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-21T06:37:52.000Z",
    "description": "Virginia Giuffre would see Andrew giving up titles as a victory, co-author tells BBC2 hours agoEmily McGarveyWatch: Ms Wallace, who spent four years w",
    "body": "Virginia Giuffre would see Andrew giving up titles as a victory, co-author tells BBC2 hours agoEmily McGarveyWatch: Ms Wallace, who spent four years writing the book with Ms Giuffre, spoke on her behalfVirginia Giuffre would have viewed Prince Andrew giving up his titles \"as a victory\", the ghostwriter of her posthumous memoir told BBC Newsnight.The book, Nobody's Girl, co-written by Amy Wallace, describes Ms Giuffre's encounters with convicted sex offender Jeffrey Epstein and his former girlfriend Ghislaine Maxwell - and more details of her allegations about Prince Andrew, which he has always denied.In the memoir - released on Tuesday - Ms Giuffre described three occasions where she alleged Prince Andrew had sex with her.Ms Wallace spent four years writing the book with Ms Giuffre, who took her own life almost six months ago.She told the BBC there was a period when Prince Andrew \"indicated he was willing to help investigators in the US\" but he was \"never available, for some reason\".\"That's something he could still do,\" Ms Wallace said. \"He could say, as he has repeatedly, 'I still deny that I was involved... however, I was in these houses and I was on that island and I was on the jet and I saw things, and I know how much these women have suffered and I would like to share what I saw.In the book, Ms Giuffre said she had sex with Prince Andrew on three separate occasions. She says the third occasion was on Epstein's island as part of what Ms Giuffre called \"an orgy\" with Epstein and approximately eight other young women.Prince Andrew, who reached a financial settlement with Ms Giuffre in 2022, announced on Friday that he was voluntarily deciding not to use his titles including the Duke of York, an honour received from his mother, the late Queen Elizabeth II.He is also giving up membership of the Order of the Garter - the oldest and most senior order of chivalry in Britain.But there are still calls for them to be formally removed.Ms Wallace said: \"I can speak for Virginia; I know that she would view it as a victory that he was forced, by whatever means, to voluntarily give them up.\"She called it a \"symbolic gesture\" which has made \"modern history in terms of the royal era\", describing it as \"a step in the right direction\".\"Virginia wanted all the men who she had been trafficked to, against her will, to be held to account, and this is just one of the men.\"Even though he (Andrew) continues to deny it, his life is being eroded because of his past behaviour, as it should be,\" Ms Wallace said.Getty ImagesMs Wallace said the private jets used by Epstein \"had been remodelled in order to afford many bedrooms - they were designed as flying trafficking agents, they were there to use girls in\".She added: \"Prince Andrew was on at least one of those jets that I know of, if not more.\"He has to take sort of the measure of his own moral compass - he said in his settlement with Virginia that he now acknowledges the pain that these women and young girls had suffered. If you really feel it, do something about it.\"Speaking about Ms Giuffre, Ms Wallace said: \"I'm sad and I'm honoured to be able to speak at least a little bit on her behalf to stand up for her. \"She wrote this book to try to help other people, to make the world a better place. \"She deserves all credit for whatever role she played in forcing Prince Andrew to relinquish a few more of his titles but she deserves all credit even more than that for being brave enough to stand up to say 'this isn't right'.\"The memoir, which the BBC bought from a book store in central London days before its official release, paints a picture of a web of rich and powerful people abusing young women.At the centre of the abuse was Epstein and his former girlfriend, Ghislaine Maxwell, who is currently serving a 20-year sentence on sex-trafficking charges.Ms Giuffre says that even decades later, she remembers how much she feared them both.Epstein was convicted in Florida in 2008 for soliciting prostitution from a person under the age of 18. He died in 2019 while awaiting trial on sex trafficking charges.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Prince Andrew dropping title is victory for Virginia Giuffre, co-author tells BBC",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d38f/live/a4681fa0-adf7-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-21T06:37:52.000Z",
      "dateModified": "2025-10-21T06:37:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Australia: Almond-sized crab and tiny lantern shark discovered in deep seas",
    "url": "https://www.bbc.com/news/articles/cly275d3dvdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6b3f/live/a576bbc0-ae3f-11f0-ba75-093eca1ac29b.png",
    "tag": "Trending",
    "date": "2025-10-21T05:56:08.000Z",
    "description": "2 hours agoLana LamSydneyCSIRO/Cindy BesseyThe new species of porcelain crab was found more than 100m below the ocean's surfaceA semi-transparent crab",
    "body": "2 hours agoLana LamSydneyCSIRO/Cindy BesseyThe new species of porcelain crab was found more than 100m below the ocean's surfaceA semi-transparent crab about the size of an almond and a tiny, glowing lantern shark are among two new species discovered by Australian scientists exploring the deep sea.In late 2022, scientists from Australia's science agency CSIRO embarked on a research voyage in the Gascoyne Marine Park, about 20km (12 miles) off the coast of Western Australia.Australia is one of the world's biggest biodiversity hotspots, home to more than a million different species, many of which are not found anywhere else on earth.But - like much of the globe - large swathes of its water remain unexplored, and the animal and plant life within them unknown to science.Among the hundreds of specimens collected during the 2022 voyage was the newly described West Australian Lantern Shark. Growing up to 40cm, it has large eyes and a glowing belly, and was found more than 600m below the ocean's surface.\"Lantern sharks are bioluminescent, with light produced by photophores located on their belly and flanks, which is where their common name comes from,\" Dr Will White, a fish scientist, said.CSIROThe West Australian lantern shark has large eyes and can grow up to 40cmThey also discovered a new type of porcelain crab, about 1.5cm in length and found about 122m below sea level. They use hairs to catch food, instead of their claws.\"Porcelain crabs are known as filter feeders, feeding on plankton by using modified mouthparts with long hairs to sweep the water for small pieces of food such as plankton, rather than the typical crab method of grabbing and pinching food with their claws,\" said Dr Andrew Hosie, curator of aquatic zoology from the Western Australian Museum.About 20 new species have been unearthed as a result of the voyage so far, including the Carnavon Flapjack Octopus, a rusty red creature around 4cm big.Researchers estimate about 600 more are yet to be described and named, as it can take years for scientists to gather the information to prove they're unique.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australia: Almond-sized crab and tiny lantern shark discovered in deep seas",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6b3f/live/a576bbc0-ae3f-11f0-ba75-093eca1ac29b.png"
      ],
      "datePublished": "2025-10-21T05:56:08.000Z",
      "dateModified": "2025-10-21T05:56:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'What did the palace know?' and 'world wide wobble'",
    "url": "https://www.bbc.com/news/articles/c231n2zlpreo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b4e0/live/63e70de0-ae0d-11f0-ba75-093eca1ac29b.png",
    "tag": "Trending",
    "date": "2025-10-21T04:24:02.000Z",
    "description": "'What did the palace know?' and 'web giant glitch'4 hours agoBBCThe Daily Mirror asks \"what did the palace know?\" as it continues its reporting on Pri",
    "body": "'What did the palace know?' and 'web giant glitch'4 hours agoBBCThe Daily Mirror asks \"what did the palace know?\" as it continues its reporting on Prince Andrew. It reports the allegation that the \"prince tried to 'dig dirt' on his accuser\". Former Liberal Democrat MP Norman Baker is quoted as saying \"there are questions that others in the Royal Family need to answer\". Elsewhere, the Daily Mail questions Andrew's finances as the paper reports \"the disgraced prince 'did not' receive a significant inheritance from late Queen or Queen Mother\".  The front page also pictures one of his daughters driving reportedly to his home alongside the caption: \"Now Beatrice and Eugenie face a test of family loyalty\".The Times also headlines on the prince's tenancy, claiming that he \"has not paid rent since 2003\". According to terms of the leasehold agreement the paper has seen, he has paid \"one peppercorn (if demanded)\" in rent a year for two decades.More claims about Prince Andrew from Virginia Giuffre's book lead the Guardian. In its prominent picture slot, the paper shares a snap of King Charles in Manchester as he visited those affected in a synagogue attack last month. The Guardian says the King is \"under pressure to act further against Andrew\".Metro\"Something went wrong\" headlines the Metro in a glitchy font after many of the world's biggest websites and apps were disrupted. It describes \"online havoc across the globe\" including at UK banks and firms.The Daily Telegraph leads on the grooming inquiry after two survivors quit a liaison panel on Monday. The paper says critics are accusing Labour of \"sabotage\" with the prime minister urged to launch a new judge-led inquiry. A Home Office spokesman said it was \"committed to delivering a robust, thorough inquiry\".The news of a \"revolutionary bionic chip\" helping blind patients get their sight back leads The i Paper. The chip will enable people who have lost their vision to read again thanks to a \"2mm electronic eye implant\", according to The i. Scientists are hailing the technology as a \"paradigm shift\", it says, adding that it \"could become available on NHS\".The Daily Express leads on an employment tribunal in which a group is challenging a health trust's policy about female changing rooms at work. It says the women have been seen together for the first time.The Sun reports Katie Price's former husband Kieran Hayler has been charged with three counts of rape and one count of sexual assault against a 13-year-old. A legal representative for Hayler said on Monday he strongly denies the allegations made against him.Meanwhile, the Daily Star leads on the death of Harley Pearce - former England football player Stuart Pearce's son. The paper says the vehicle he was driving \"had a suspected tyre blowout\".Once again many papers focus on the scandal surrounding Prince Andrew. The Sun picks up on fresh allegations made by Virginia Giuffre in her posthumous memoir, Nobody's Girl. The paper says that in the book she accuses the prince's team of \"hiring internet trolls to tarnish her name\" after she made sex abuse allegations, which Andrew has always denied.\"What did the palace know?\" asks the Daily Mirror on its front page. It says an allegation that the prince asked a police protection officer to find out information about Ms Giuffre has sparked a \"new crisis\". The palace tells the paper that the accusations should be \"examined in the appropriate way\".The Daily Mail asks how Prince Andrew can afford to stay in Royal Lodge, a mansion owned by the Crown Estate in Windsor. The Times says it's seen the leasehold agreement for the \"30-room\" property, and that he has paid only a 'peppercorn' rent each year since 2003. A former chair of the public accounts committee tells the paper \"The Crown Estate is owned by us\", and the onus is on those running it to \"maximise our income out of it\". In its analysis, the Guardian says the \"optics are bad; a disgraced prince living in the luxury of a huge Crown Estate property\".The Daily Telegraph says Prince Andrew has been deemed a \"potential national security risk\" because of links to alleged Chinese spies. It says multiple sources have told the paper that \"concerns\" were raised by the security services as long ago as 2021. The article highlights what it calls the prince's \"repeated meetings\" with suspected spy Yang Tengbo. The prince has previously said nothing sensitive was ever discussed, and that he cut off ties after concerns were raised. Yang Tengbo denies spying.The i Paper devotes its front page to the development of a bionic chip that helps \"blind patients to regain sight\". It says there are hopes the technology could become available on the NHS. One patient can read again after taking part in the clinical trial. She tells the paper: \"Reading takes you into another world. I am definitely more optimistic.\"Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'What did the palace know?' and 'world wide wobble'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b4e0/live/63e70de0-ae0d-11f0-ba75-093eca1ac29b.png"
      ],
      "datePublished": "2025-10-21T04:24:02.000Z",
      "dateModified": "2025-10-21T04:24:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Daniel Naroditsky, US chess grandmaster, dies aged 29",
    "url": "https://www.bbc.com/news/articles/c15pz8vpjp9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d756/live/f190e630-ae2a-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-21T04:57:04.000Z",
    "description": "3 hours agoHarry SekulichCharlotte Chess CenterDaniel Naroditsky, also known to his online fans as 'Danya', died two weeks out from his 30th birthdayU",
    "body": "3 hours agoHarry SekulichCharlotte Chess CenterDaniel Naroditsky, also known to his online fans as 'Danya', died two weeks out from his 30th birthdayUS chess grandmaster and online commentator Daniel Naroditsky has died aged 29.The popular chess player's family announced his \"unexpected\" death in a statement released by his club, the Charlotte Chess Center, on Monday. No cause of death was given.\"It is with great sadness that we share the unexpected passing of Daniel Naroditsky,\" the statement said. \"Daniel was a talented chess player, commentator and educator, and a cherished member of the chess community, admired and respected by fans and players around the world.\"The US and International chess federations have paid tribute to Naroditsky, along with other professional players.American world number two Hikaru Nakamura said he was \"devastated\" at the news.\"This is a massive loss for the world of chess,\" Nakamura said in a social media post.Naroditsky first took an interest in chess at the age of six, when his older brother Alan introduced him to the game to help entertain a group of children at a birthday party.His father Vladimir and multiple coaches soon noticed his talents.\"As far as I was concerned, I was just playing games with my brother,\" Naroditsky told the New York Times in a 2022 interview.He gained international attention in 2007 when he won the under-12 boys world youth championship in Antalya, Turkey. In 2010, at the age of 14, he became one of the youngest ever published chess authors when he wrote a book titled Mastering Positional Chess, covering practical skills and technical manoeuvrings.In 2013 Naroditsky won the US Junior Championship, helping him earn the title of grandmaster, the international chess federation's highest-ranked chess competitor, while he was still a teenager.Getty ImagesNaroditsky in 2008, following his World Youth Championship victory in TurkeyNaroditsky later graduated from Stanford University and worked as a chess coach in Charlotte, North Carolina.While still competing in high-level events, he transferred his talents to the online chess universe.Naroditsky's YouTube channel gained nearly 500,000 subscribers and his Twitch stream drummed up 340,000 followers, with hundreds of thousands of viewers drawn to his regular video tutorials and livestreams against competitors. Fans praised his insight and passion, casually referring to him as 'Danya'.In 2022 the New York Times named Naroditsky as its \"new chess columnist\" and invited him to contribute to a series of chess puzzles for the newspaper's games section.In the publication's accompanying interview, the young grandmaster mused on chess's influence in his life.\"Even at my level, I can still discover beautiful things about the game every single time I train, teach, play or am a commentator at a tournament,\" he said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Daniel Naroditsky, US chess grandmaster, dies aged 29",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d756/live/f190e630-ae2a-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-21T04:57:04.000Z",
      "dateModified": "2025-10-21T04:57:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Highest government borrowing in  September for five years  ",
    "url": "https://www.bbc.com/news/articles/c8035130918o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/20a0/live/0d22db50-ae45-11f0-8c88-ef716e73d157.jpg",
    "tag": "Trending",
    "date": "2025-10-21T07:49:58.000Z",
    "description": "29 minutes agoMichael Sheils McNameeBusiness reporterUK government borrowing in September hit the highest level for the month in five years, official ",
    "body": "29 minutes agoMichael Sheils McNameeBusiness reporterUK government borrowing in September hit the highest level for the month in five years, official figures show, highlighting the challenges facing the chancellor ahead of next month's Budget.Borrowing - the difference between public spending and tax income - was £20.2bn in September, up £1.6bn from the same month last year, the Office for National Statistics (ONS) said.A rise in debt interest payments offset the increased amount the government had raised through tax and national insurance, the ONS said.   Borrowing over the first six months of the financial year has now reached £99.8bn, which is up £11.5bn from the same period last year.The figures add to the pressure on Chancellor Rachel Reeves, who is expected to raise taxes in November's Budget in order to meet her self-imposed rules for government finances.September's figure was slightly less than analysts' expectations of £20.8bn, but was just above the £20.1bn that had been projected by the government's official forecaster, the Office for Budget Responsibility, in March.Speaking to the BBC's Today programme, Capital Economics chief economist Paul Dales said the chancellor would \"love tax receipts to be higher\" but that it would depend on faster growth in the economy.Capital Economics is projecting that the government will have to raise £27bn in the Budget, with \"higher taxes on households having to do the heavy lifting\".Ahead of the Budget, the government has announced a number of measures it is taking to try and boost economic growth. At the Regional Investment Summit in Birmingham on Tuesday, Reeves will announce reforms to scrap paperwork and red tape, which she claims will save companies almost £6bn a year. Although tax income in September was higher than last year, in part due to the increase in employers' national insurance contributions, spending also increased.This was partly due to pay rises and inflation increasing the government's day-to-day running costs, as well as inflation-linked increases to state benefits. The government also had to pay £9.7bn in debt interest, which was up by £3.8bn from the same month last year. Public sector debt in the UK is now estimated to be at 95.3% of gross domestic product (GDP) and remains at levels not seen since the early 1960s.Responding to the figures, Chief Secretary to the Treasury James Murray said the government would \"never play fast and loose with the public finances\". He reiterated the government's aim of bringing down borrowing, to be rid of \"costly debt interest, instead putting that money into our NHS, schools and police\".But shadow chancellor Mel Stride said that borrowing was \"soaring under this Labour government\". \"Rachel Reeves has lost control of the public finances and the next generation are being saddled with Labour's debts,\" he said. Liberal Democrat Treasury spokeswoman Daisy Cooper said \"alarm bells should be ringing for the government ahead of the Budget\". She said the Conservatives had left the economy in \"a terrible state\" but that \"this government has made mistake after mistake, failing to get our economy growing again\".The new figures from the ONS include a correction to earlier data, when an error had been made in how VAT receipts had been added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Highest government borrowing in  September for five years  ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/20a0/live/0d22db50-ae45-11f0-8c88-ef716e73d157.jpg"
      ],
      "datePublished": "2025-10-21T07:49:58.000Z",
      "dateModified": "2025-10-21T07:49:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Europe 'ready to deploy' troops to Ukraine if ceasefire secured, says Healey",
    "url": "https://www.bbc.com/news/articles/cd9kqve398vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c3e3/live/e61646b0-a641-11f0-bf8c-8df5a7a0d5c3.jpg",
    "tag": "Trending",
    "date": "2025-10-20T21:54:18.000Z",
    "description": "10 hours agoSam FrancisPolitical reporter EPADefence Secretary John Healey has said European troops are \"ready to deploy\" to Ukraine in the coming wee",
    "body": "10 hours agoSam FrancisPolitical reporter EPADefence Secretary John Healey has said European troops are \"ready to deploy\" to Ukraine in the coming weeks if Donald Trump and Vladimir Putin agree on a ceasefire.After a surprise call last Thursday, the US and Russian presidents are planning to meet in Budapest, Hungary. Ukrainian President Volodymyr Zelensky has not been invited but said he is ready to join.Asked if troops could deploy if a deal was reached in the next two weeks, Healey said: \"If President Trump can broker a peace, then we will be ready to help secure that peace\".But he added that Ukrainians must be the \"people who will decide how and what\" is negotiated in any peace talks.Members of the \"coalition of the willing\", an alliance of 26 European nations founded in March by UK Prime Minister Sir Keir Starmer to guarantee Ukraine's security, had been \"developing detailed plans, in the event of a ceasefire\", Healey said.Under the plans, UK troops could join a multinational force to secure Ukraine's border.The work of \"over 200 military planners from 38-plus nations over the last six months\" had meant forces were ready to deploy when needed, Healey said.The government were expecting to spend \"well over\" £100m on sending troops to Ukraine, with some funds already used to prepare the deployment, Healey said.Speaking at the London Lord Mayor's Annual Defence Lecture, Healey also said Vladimir Putin views Britain as his \"number one enemy\" because of the country's support for Ukraine.The defence secretary also warned of a \"new era of threat\" and said the risk of wider conflict in Europe has not been as great since the end of World War Two.During the speech, Healey also announced British soldiers will be granted new powers to shoot down drones threatening military bases.Four British airbases used by US forces reported mystery drone sightings last year, while drones have disrupted airspace across Europe a number of times in recent months.The new powers will only apply to military sites, but could be extended to civilian locations such as airports.Healey said the introduction of a \"kinetic option\" would enable British troops or Ministry of Defence (MoD) police to shoot drones posing a threat to a military site in the UK.The announcement followed reports that a White House meeting between Trump and Zelensky ended in a \"shouting match\", as US officials pushed Ukraine to give up land to Russia.Zelensky had gone to Washington to ask the US to supply sought-after Tomahawk cruise missiles to Ukraine to strike deep into Russian territory.But reports suggest Trump had instead insisted Zelensky surrender the entire eastern Donbas region to Putin. Russia controls 70% of Donetsk and nearly all of neighbouring Luhansk.The Financial Times reported Trump had warned Zelensky that Putin would \"destroy\" Ukraine if he did not agree to its terms, citing sources familiar with the conversation.In the more than 1,300 days since Russia invaded Ukraine, Putin has become increasingly reliant on support from North Korea, Iran and China. According to Healey, Russia has suffered over a million casualties and devoted 40% of its government spending to the military.But in recent months Moscow has intensified attacks on Ukrainian infrastructure, prompting emergency power cuts across the country.European leaders have expressed concern over Trump's shifting stance, with Polish Prime Minister Donald Tusk warning on social media that \"appeasement never was a road to a just and lasting peace\". Finnish President Alexander Stubb said \"the only ones who can decide on the land issue are the Ukrainians themselves\".Speaking to the BBC, Stubb said Finland, a member of the coalition of the willing.  would never recognise Crimea, or the regions of Donetsk or Luhansk, as Russian.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Europe 'ready to deploy' troops to Ukraine if ceasefire secured, says Healey",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c3e3/live/e61646b0-a641-11f0-bf8c-8df5a7a0d5c3.jpg"
      ],
      "datePublished": "2025-10-20T21:54:18.000Z",
      "dateModified": "2025-10-20T21:54:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nicholas Rossi: US fugitive who fled to Scotland jailed for rape",
    "url": "https://www.bbc.com/news/articles/c8035ng7rpmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d693/live/415e0680-ae16-11f0-89c1-f108f0134d3f.jpg",
    "tag": "Trending",
    "date": "2025-10-21T02:27:07.000Z",
    "description": "6 hours agoMax MatzaAndrew Milligan/PA WireRossi, seen in 2023 after the UK ruled he could be extradited to the USA US man who faked his death and fle",
    "body": "6 hours agoMax MatzaAndrew Milligan/PA WireRossi, seen in 2023 after the UK ruled he could be extradited to the USA US man who faked his death and fled to Scotland after being accused of rape has been jailed for at least five years. Nicholas Rossi, 38, of Rhode Island, was convicted in separate trials in August and September of raping two women in Utah in 2008. Appearing in court in Salt Lake City on Monday, Rossi was sentenced by a judge for the first conviction to a term ranging from five years to life in prison. He is due to be sentenced for the second conviction next month.Before sentencing, Judge Barry G Lawrence described Rossi as a \"serial abuser of women\" and said he was the \"very definition of a flight risk\".How the mask slipped during Nicholas Rossi's court saga\"He fled the country to avoid investigation. He took on an alias and, even in response to this case, refused to admit who he was,\" the judge said.An online obituary posted in February 2020 said Rossi, who was born Nicholas Alahverdian, had died from non-Hodgkin lymphoma.He then came to wider attention in December 2021 when he was arrested on the Covid ward of a Glasgow hospital. Staff recognised his mugshot and distinctive tattoos from an Interpol wanted notice.Rossi claimed that his name was Arthur Knight - an Irish-born orphan who had never been to the US.He made a series of bizarre court appearances in Scotland - in a wheelchair, wearing a three-piece suit and an oxygen mask, maintaining his claim of mistaken identity.He was extradited to the US in January 2024 and put on trial in Utah for two separate charges of rape.The saga from Glasgow to Salt Lake City was documented in the BBC's Strange But True Crime podcast.WATCH: The story of Nicholas Rossi, the US fugitive who ‘faked his own death’Utah has an indeterminate sentencing, meaning it is given in a range of years rather than a fixed number. The judge said it was up to the state's board of pardons and parole to determine how long he should be jailed.Shortly before sentencing, one victim said Rossi had left a \"trail of fear, pain and destruction\" behind him.\"This is not a plea for vengeance. This is a plea for safety and accountability, for recognition of the damage that will never fully heal,\" she said.Rossi maintained his debunked claims of mistaken identity - which have been disproved by DNA and matching tattoos - during his court appearance on Monday. \"I am not guilty of this,\" he told the court before being sentenced. \"These women are lying, and in due course, we will lodge an appeal.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nicholas Rossi: US fugitive who fled to Scotland jailed for rape",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d693/live/415e0680-ae16-11f0-89c1-f108f0134d3f.jpg"
      ],
      "datePublished": "2025-10-21T02:27:07.000Z",
      "dateModified": "2025-10-21T02:27:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sarkozy enters jail over campaign financing - France's first ex-president behind bars",
    "url": "https://www.bbc.com/news/articles/cvgkm2j0xelo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d440/live/d19bd7b0-ae55-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-21T07:49:49.000Z",
    "description": "French ex-president Sarkozy goes to  jail for campaign finance conspiracy 28 minutes agoPaul KirbyEurope digital editor andHugh Schofieldin ParisWatch",
    "body": "French ex-president Sarkozy goes to  jail for campaign finance conspiracy 28 minutes agoPaul KirbyEurope digital editor andHugh Schofieldin ParisWatch: Sarkozy was cheered by supporters as he embraced his wife Carla Bruni-Sarkozy outside their Paris homeNicolas Sarkozy has become the first French ex-president to go to jail, as he starts a five-year sentence for conspiring to fund his election campaign with money from late Libyan dictator Muammar Gaddafi.Not since World War Two Nazi collaborationist leader Philippe Pétain was jailed for treason in 1945 has any French ex-leader gone behind bars.Sarkozy, who was president from 2007-2012, has appealed against his jail term at La Santé prison, where he will occupy a cell roughly measuring 9 sq m (95 sq ft) in the jail's isolation wing.More than 100 people stood outside his villa in the exclusive 16th district of Paris, after his son Louis, 28, called on supporters for a show of support.Another son, Pierre, called for a message of love – \"nothing else, please\".Nicolas Sarkozy, 70, arrived at the entrance to the notorious 19th-Century prison in the Montparnasse district south of the River Seine at 09:40 (07:40 GMT), amid high security. He continues to protest his innocence in the highly controversial Libyan money affair and posted a message on X as he was driven to the jail, saying \"I have no doubt. Truth will prevail. But how crushing the price will have been\".\"With unwavering strength I tell [the French people] it is not a former president they are locking up this morning - it is an innocent man,\" he wrote. \"Do not feel sorry for me because my wife and my children are by my side... but this morning I feel deep sorrow for a France humiliated by a will for revenge.\"Sarkozy has said he wants no special treatment at La Santé prison, although he has been put in the isolation section for his own safety as other inmates are infamous drugs dealers or have been convicted for terror offences.Other than Philippe Pétain, the only other former French head of state to have been jailed was King Louis XVI before his execution in January 1793.ReutersNicolas Sarkozy has maintained his innocence and has lodged an appealInside his cell he will have a toilet, shower, desk and small TV. He will be allowed one hour a day for exercise, by himself.At the end of last week he was received at the Élysée Palace by President Emmanuel Macron, who told reporters on Monday \"it was normal that on a human level I should receive one of my predecessors in that context\".In a further measure of official support for the ex-president, Justice Minister Gérald Darmanin said he would go to visit him in prison as part of his role in ensuring Sarkozy's safety and the proper functioning of the jail.\"I cannot be insensitive to a man's distress,\" he added.Read more: Former French president Sarkozy given five-year sentence after Libya caseAhead of his arrival at La Santé prison, Sarkozy gave a series of media interviews, telling La Tribune: \"I'm not afraid of prison. I'll keep my head held high, including at the prison gates.\"Sarkozy has always denied doing anything wrong in a case involving allegations that his 2007 presidential campaign was funded by millions of euros in Libyan cash.The former centre-right leader was cleared of personally receiving the money but convicted of criminal association with two close aides, Brice Hortefeux and Claude Guéant, for their role in secret campaign financing from the Libyans.The two men both had talks with Gadaffi's intelligence chief and brother-in-law in 2005, in a meeting arranged by a Franco-Lebanese intermediary called Ziad Tiakeddine, who died in Lebanon shortly before Sarkozy's conviction.As he lodged an appeal, Sarkozy is still considered innocent but he has been told he must go to jail in view of the \"exceptional seriousness of the facts\".Sarkozy said he would take two books with him into prison, a life of Jesus and the Count of Monte Christo, the story of a man wrongly imprisoned who escapes to wreak vengeance on his prosecutors.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sarkozy enters jail over campaign financing - France's first ex-president behind bars",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d440/live/d19bd7b0-ae55-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-21T07:49:49.000Z",
      "dateModified": "2025-10-21T07:49:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sentencing bill: Tories say thousands of criminals will be released under reforms",
    "url": "https://www.bbc.com/news/articles/ce8g5k6kyllo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/392a/live/264b8db0-ae14-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-21T00:52:39.000Z",
    "description": "Thousands of criminals could be released early under government sentencing reform, Tories say7 hours agoSima KotechaSenior UK correspondent andYang Ti",
    "body": "Thousands of criminals could be released early under government sentencing reform, Tories say7 hours agoSima KotechaSenior UK correspondent andYang TianThe Conservatives say more than 2,000 prisoners serving sentences for rape, stalking and grooming will have their jail time cut because of the government's new sentencing plan.The opposition party has tabled an amendment to the sentencing bill - which is in the House of Commons on Tuesday where it will be scrutinised by MPs - to make sure offenders of the most serious crimes stay locked up for longer.Shadow justice minister Kieran Mullan has called the government's plan \"a betrayal of victims\", while Labour have accused the Tories of \"rank hypocrisy\" after they left prisons \"at breaking point\".The sentencing review recommends releasing some offenders earlier from prison if they have behaved well.The review was set up to look at alternative punishments to jail after prisons became dangerously overcrowded.It recommends offenders on a fixed length prison term could be released after serving a third of their sentence, providing they behave well.Under this \"earned progression scheme\", prisoners released early will be monitored with enhanced supervision in the community, followed by a period on licence, which is unsupervised.The Conservatives have said in addition to more than 2,000 serious offenders having their jail terms cut, Labour's changes will also benefit over 62% of jailed rapists.\"Keir Starmer is putting criminals before communities and letting predators out early,\" Mullan said.\"Under Labour's plans, thousands of the most serious would no longer be treated as such, an insult to thousands of victims across the country.\"The amendment tabled by the Tories wants to ensure offenders of the most serious crimes - including rape, sexual offences against children and grievous bodily harm - will not benefit from the government's early release scheme, a press release said.Early prisoner release plan worries police chiefBBC In-Depth: A scheme helped prevent sex offenders committing more crimes - then it closed. Why?But sentencing minster Jake Richards accused the Conservatives of \"feigned outrage\" and said the government is \"cleaning up the mess\" left by the Tories.\"The Conservatives' rank hypocrisy is shameful. They built this crisis, then feigned outrage when the consequences arrived,\" he said.\"They took our prisons to breaking point, released thousands of serious offenders early and pushed Britain to the brink of a situation where police could no longer make arrests and courts could no longer prosecute.\"Labour have said the worst offenders - those on extended fixed sentences or life sentences - will never benefit from early release.President of the Prison Governors' Association Tom Wheatley said successive governments have failed to deliver the prison spaces needed to deal with dangerous overcrowding.\"The sentencing bill seeks to address this issue by reducing the amount of time offenders will spend in custody,\" he said.\"The alternatives are either spending more taxpayers money on building and running prisons or to continue to release prisoners earlier than the courts intended, as both this government and  previous Conservative governments have done.\"The Tories have proposed other amendments to the sentencing bill, which reached its committee stage in the House of Commons on Tuesday. They include requiring courts to collect and publish detailed data on sentencing, making judges' remarks available to the public within two days, and extending the time victims have to challenge lenient sentences.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sentencing bill: Tories say thousands of criminals will be released under reforms",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/392a/live/264b8db0-ae14-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-21T00:52:39.000Z",
      "dateModified": "2025-10-21T00:52:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Amazon services 'recovering' as Snapchat and banks among sites hit by outage",
    "url": "https://www.bbc.com/news/articles/c20pgp3nx07o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8f6f/live/a4c61660-adb0-11f0-a1e9-05271081384a.jpg",
    "tag": "Trending",
    "date": "2025-10-21T03:30:02.000Z",
    "description": "Amazon outage 'resolved' as Snapchat and banks among sites impacted5 hours agoLiv McMahonTechnology reporter andLily JamaliNorth America Technology Co",
    "body": "Amazon outage 'resolved' as Snapchat and banks among sites impacted5 hours agoLiv McMahonTechnology reporter andLily JamaliNorth America Technology CorrespondentGetty ImagesAmazon Web Services (AWS) said late Monday that it had resolved a massive outage that knocked some of the world's largest websites offline for much of the day.More than 1,000 apps and websites - including social media platforms like Snapchat and banks such as Lloyds and Halifax - were impacted by problems that Amazon said were at the heart of the cloud computing giant's operations in the US.The platform outage monitor Downdetector said user reports of problems globally soared to more than 11 million during the outage on Monday.Even after Amazon fixed the underlying problem, experts said the outage demonstrated the perils of having so many companies rely on a single, dominant provider.\"What this episode has highlighted is just how interdependent our infrastructure is,\" said Prof Alan Woodward of the University of Surrey.\"So many online services rely upon third parties for their physical infrastructure, and this shows that problems can occur in even the largest of those third-party providers.\"Small errors, often human made, can have widespread and significant impact.\"The issues appear to have begun at around 07:00 BST on Monday, as users began to report problems accessing a slew of platforms.This included a wide range of different sites and services, from massive online games like Fortnite to the language-learning app Duolingo.Early in the day, Downdetector told the BBC it had seen more than four million reports from users across 500 sites within just a few hours - more than double the amount it would see across an entire regular weekday.These later peaked at more than 11 million, it said, as more services including Reddit and Lloyds Bank attempted to recover.At around 23:00 BST, Amazon said all AWS services had \"returned to normal operations.\"But not before the company had to throttle parts of its own system in order to address the root issue.A new series of \"cascading failures\" may have arisen after the initial outage, according to Mike Chapple, an information technology professor at Notre Dame University.\"It's like when you have a large-scale power outage. Crews start working to try to bring it back on line,\" Mr Chapple said. \"The power might flicker a few times,\" he explained, but it's possible Amazon had initially \"only addressed the symptoms\" and not the cause.What went wrong?Amazon has not yet fully detailed what caused Monday's outage or issued an official statement regarding it.It said in an update on its service status web page the issue \"appears to be related to DNS resolution of the DynamoDB API endpoint in US-EAST-1\".DNS, which stands for Domain Name System, is often likened to a phone book for the internet.It effectively translates the website names people use (like bbc.co.uk) into numbers which can be read and understood by computers.This process basically underpins the way we use the internet, and disruptions to it can leave web browsers unable to locate the content they are looking for.Matthew Prince, chief executive of Cloudflare, told the BBC the AWS outage highlighted the power cloud services have over how the internet works.\"Everyone has a bad day, today Amazon had a bad day,\" he said. \"There are amazing things about the cloud, it allows you to scale… but if you have an outage like this it can take down a lot of services we rely on.\"And Cori Crider, head of the Future of Technology Institute, told the BBC it was \"a bit like a bridge collapsing\".\"An essential part of the economy has fallen to pieces,\" she said.And with so much of cloud computing relying on Amazon, Microsoft and Google - estimated at around 70% - she said the status quo was \"unsustainable\".\"Once you have a concentrated supply in a handful of monopoly providers, when something like this falls over, it takes a huge percentage of the economy out with it,\" she said.\"We should really look at trying to buy more local services, rather than relying on a handful of American monopoly platforms.\"That's a risk to our security, our sovereignty and our economy and we need to look at structural separations to make our markets more resilient to these kind of shocks.\"Watch: BBC's Lucy Woodham asks Cardiff students about Snapchat outageOne computer science expert says some of the responsibility rests with the companies that use AWS.\"Companies using Amazon haven't been taking enough adequate care to build protection systems into their applications,\" says Ken Birman, a computer science professor at Cornell University in New York.Outages like the one on Monday occur frequently, although not always at this scale.Birman tells the BBC that app developers should take care to invest in backing up mission-critical applications that live in the cloud.\"We know how to make these systems stronger, and we know how to do it securely,\" Birman says.The question of responsibility could well land in the courts.More than a year after the massive CrowdStrike outage, Delta Airlines is still wrangling with the company to recover more than $500m in losses.Even after CrowdStrike had fixed the issue, the airline said it had to manually reset 40,000 servers, leading to major flight delays over several days.Additional reporting by Esyllt Carr.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Amazon services 'recovering' as Snapchat and banks among sites hit by outage",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8f6f/live/a4c61660-adb0-11f0-a1e9-05271081384a.jpg"
      ],
      "datePublished": "2025-10-21T03:30:02.000Z",
      "dateModified": "2025-10-21T03:30:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The trailblazer who made history as Nasa's first woman commander",
    "url": "https://www.bbc.com/news/articles/c0mxzdg203jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d45a/live/b5035360-ab9b-11f0-ba75-093eca1ac29b.jpg",
    "tag": "Trending",
    "date": "2025-10-21T02:34:44.000Z",
    "description": "Nasa's first female space commander: I didn't want people to say 'the woman made a mistake'6 hours agoRebecca MorelleScience Editor andAlison FrancisS",
    "body": "Nasa's first female space commander: I didn't want people to say 'the woman made a mistake'6 hours agoRebecca MorelleScience Editor andAlison FrancisSenior Science JournalistTony Jolliffe/ BBC NewsFrom a very young age, Eileen Collins wanted to be an astronaut She's the astronaut who smashed through the glass ceiling. And kept on going.Eileen Collins made history as the first woman to pilot and command a spacecraft - but despite her remarkable achievements, not everyone will know her name.Now a feature-length documentary called Spacewoman, which chronicles her trailblazing career, looks set to change that.We meet Collins at London's Science Museum. She's softly spoken, warm and very down to earth - but you quickly get a sense of her focus and determination. She clearly has inner steel.\"I was reading a magazine article on the Gemini astronauts. I was probably nine years old, and I thought that's the coolest thing. That's what I want to do,\" she says.\"Of course, there were no women astronauts back then. But I just thought, I'll be a lady astronaut.\"NASANasa's Space Shuttle programme flew for three decades But that little girl set her sights even higher - she wanted to be at the controls of a spacecraft.And the only way to achieve this was to join the military and become a test pilot.In the Air Force, she stood out from the crowd and was selected to join the astronaut programme. She was to fly Space Shuttles - Nasa's reusable \"space planes\".She knew the eyes of the world were on her when her first mission launched in 1995.\"As the first woman to pilot the Space Shuttle, I worked very hard at that because I didn't want people to say, 'Oh look, the woman has made a mistake'. Because it wasn't just about me, it was about the women to follow me,\" she says.\"And I wanted there to be a reputation for women pilots that was: 'Hey, they're really good'.\"Eileen CollinsEileen Collins with her young daughter BridgetShe was so good in fact that she was soon promoted to commander, in another space first.Collins was also a parent to two young children. The fact that she was a working wife and mother was frequently brought up in press conferences at the time, with some journalists seemingly astonished that she could be both.But Collins says being a mum and a commander were \"the two best jobs in the world\".\"But I'm going to tell you it is harder to be a parent than to be a space shuttle commander,\" she laughs.\"The best training I ever had for being a commander was being a parent - because you have to learn how to say no to people.\"NASAA huge investigation was launched after the Columbia disaster Nasa's Space Shuttles, which flew for three decades, reached breathtaking highs, but also some terrible lows.In 1986, the Challenger spacecraft suffered a catastrophic failure seconds after launching, killing all seven crew members on board.And in 2003, the Columbia shuttle broke up in the skies over Texas at the end of its mission, killing its crew of seven as well.A piece of insulating foam on Columbia's fuel tank broke loose during launch, damaging the heat shield with devastating results.Columbia was unable to withstand the fiery re-entry into the Earth's atmosphere, disintegrating as the world watched on in horror.Collins shakes her head at the memory of the disaster, and of the friends whose lives were lost.But with her job as commander, she had to pick up the mantle - she was to be in charge of the shuttle's following flight.Did she think about quitting at that point?\"People throughout the shuttle programme were counting on the commander to stick with it,\" she says quietly.\"I think quitting the mission would have been the opposite of brave… and I wanted to be a brave leader. I wanted to be a confident leader. I wanted to instill that confidence in other people.\"But when her mission finally took to the skies in 2005, the nightmare scenario happened again. A chunk of foam broke away during launch.This time, though, there was a plan in place to check the damage. But it meant undertaking one of the riskiest maneuvers in space history.Collins had to pilot the shuttle through a 360 degree flip while flying beneath the International Space Station. It allowed colleagues on the orbiting lab to photograph the craft's underside and check if the heatshield had been breached.\"There were engineers and managers saying it couldn't be done, all these reasons why it was too dangerous,\" she says.\"I listened to the discussion, they knew I was the commander, and I said: 'It sounds like we can do it'.\"NASACollins remained cool and calm under pressure With her hands steady at the controls, her voice calm as she spoke to mission control, Collins piloted the craft through a slow, graceful somersault. With the shuttle's underside now visible, the damage was quickly spotted - and a spacewalk was carried out to repair it.It meant Collins and her crew would make it safely home.This was Collins's last flight. She tells us that she always planned to stop after her fourth mission - to give others a chance to go to space.And she's watched plenty of astronauts follow in her footsteps. Does she have any advice for the next generation dreaming of the stars?\"Do your homework, listen to your teacher, pay attention in class and read books, and that will give you something to focus on,\" she says in a matter-of-fact way.Those who follow Collins to space will learn just how much she achieved, not only as a woman, but as a formidable pilot and commander.She says she has no regrets about bringing her astronaut career to an end. She made her decision and didn't look back. But there's still a wistful look in her eye when we ask if she'd be tempted if a seat on a spacecraft became free.\"Yes, I would love to go on a mission someday. When I'm an old lady, maybe I'll get a chance to go back in space.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The trailblazer who made history as Nasa's first woman commander",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d45a/live/b5035360-ab9b-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-21T02:34:44.000Z",
      "dateModified": "2025-10-21T02:34:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Prince Andrew: Key moments from his famous Newsnight interview",
    "url": "https://www.bbc.com/news/videos/c07mkx9nz19o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ca79/live/333f77e0-adc7-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-20T19:43:51.000Z",
    "description": "Prince Andrew's interview with BBC Newsnight is back in the spotlight following the publication of a posthumous memoir by Virginia Giuffre.The intervi",
    "body": "Prince Andrew's interview with BBC Newsnight is back in the spotlight following the publication of a posthumous memoir by Virginia Giuffre.The interview, broadcast in November 2019, saw the prince speak to former Newsnight presenter Emily Maitlis.In her memoir, Ms Giuffre alleges that she had sex with Prince Andrew on three separate occasions. She says she was one of many vulnerable girls and young women who were sexually exploited by Jeffery Epstein and his circle of wealthy connections.In 2019, Prince Andrew said he had no recollection of ever meeting Ms Giuffre, and has always denied wrongdoing.He also said he cut off contact with sex offender Epstein in December 2010, but new emails suggest they were still in touch two months later.Prince Andrew gave up his royal titles, including the Duke of York, last week, after extracts from Ms Giuffre's memoir made headlines.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Prince Andrew: Key moments from his famous Newsnight interview",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ca79/live/333f77e0-adc7-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-20T19:43:51.000Z",
      "dateModified": "2025-10-20T19:43:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "White House begins demolishing part of East Wing for Trump ballroom",
    "url": "https://www.bbc.com/news/articles/ced6np51532o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8cee/live/0383bde0-ae44-11f0-ba75-093eca1ac29b.jpg",
    "tag": "Trending",
    "date": "2025-10-21T02:48:43.000Z",
    "description": "6 hours agoSakshi Venkatraman,Kwasi Asiedu andBernd Debusmann Jrat the White HouseWatch: Construction begins in the East Wing of the White HouseParts ",
    "body": "6 hours agoSakshi Venkatraman,Kwasi Asiedu andBernd Debusmann Jrat the White HouseWatch: Construction begins in the East Wing of the White HouseParts of the White House's East Wing have been demolished, as construction begins on US President Donald Trump's new ballroom. Construction crews on Monday tore down massive chunks of a covered entryway and windows in the East Wing, which Trump said is being \"fully modernised\".The president previously said that his $250m (£186m) White House ballroom addition would be \"near\" the existing structure but would not change it. \"It won't interfere with the current building. It won't be. It'll be near it but not touching it - and pays total respect to the existing building, which I'm the biggest fan of,\" Trump said in July. \"It's my favourite. It's my favourite place. I love it.\"Trump announced the construction in a social media post, saying \"ground has been broken\" on the \"much-needed\" ballroom space. \"For more than 150 years, every President has dreamt about having a Ballroom at the White House to accommodate people for grand parties, State Visits, etc,\" he wrote. BBC/Bernd Debusmann JrThe East Wing of the White House on MondayReutersHe said the project is being privately funded by \"many generous Patriots\". Their identities are unclear still as the White House has not released any names of who might be funding it.The White House has served as the historic home of the US president for two centuries. The East Wing was constructed in 1902 and was last modified in 1942.From the south side of the building, the BBC saw several large pieces of construction equipment - some adorned with US flags - near the East Wing.Trump wrote in his post that the East Wing was \"completely separate\" from the White House, though it is attached to the main structure. The covered entryway, which spans much of the East Wing's south side, appeared as though it was being gutted, with concrete debris and metal cables clearly visible from several hundred metres.ReutersControversy and preserving historyThough the White House and its adjoining parks are administered by the National Park Service (NPS), the president generally has broad powers to make renovations. Robert K Sutton, former chief historian of the NPS, told the BBC that there is always public concern when the White House goes under construction. \"There has been controversy with anything going on related to the White House pretty much since it was built,\" he said.The NPS has guidelines and a rigorous review process for any construction.  That includes things like reviewing in-depth plans for a project, vetting the architect and designs and reviewing the costs.That – he said – hasn't been done here.\"This building is so important. It's considered, I think, to be the most important executive building in the world – yet we just don't know what's happening and I think that's very inappropriate.\"Mr Sutton noted that figures for how many people the new ballroom can host have been tossed around, ranging from 600 to more than 900.The White House has released some information on the project, including drawings that give a sense of its scale and a new interior that includes seating for hundreds and decadent gold chandeliers. It said that construction would begin in September and Trump had met with those at the National Parks Service and the US Secret Service, among others, about the project. The Trump administration said it selected Clark Construction to head the project, with McCrery Architects designing it. The White House has said the Secret Service \"will provide the necessary security enhancements and modifications\" to the building. \"I am honored that President Trump has entrusted me to help bring this beautiful and necessary renovation to The People's House, while preserving the elegance of its classical design and historical importance,\" McCrery Architects head Jim McCrery said.Sutton said an extensive review process is typically in place for projects like this to ensure there is functionality to any changes, and that the White House sticks to its iconic appearance - noting these changes will outlive presidents and generations.He said he worried that this process is being rushed and will be a reflection of Trump and his signature style instead of the country's history. \"It's always been called the People's House,\" he said.Trump has installed a number of changes at the White House this year, including re-decorating the Oval Office with a variety of gold decor and paving over the grass in the Rose Garden with concrete to add tables and chairs.Presidents from Obama to Truman have made changesThe new White House renovation project has also been criticised by the Society of Architectural Historians, an international non-profit group that studies the preservation of historic buildings worldwide. In a statement last week, the group said it \"expresses great concern over the proposed ballroom additions\", which it notes, \"will be the first major change to its exterior appearance in the last 83 years (since the East Wing in its current form was built in 1942). \"Therefore, such a significant change to a historic building of this import should follow a rigorous and deliberate design and review process.\"The American Institute of Architects has also expressed alarm, and called for a transparent review of the project.But Trump is certainly not the first president to leave his mark on the building. President Barack Obama, who preceded Trump, had the White House tennis court converted to be able to also host basketball games. The White House swimming pool was converted to the White House Press Room during Richard Nixon's presidency. Briefings now still regularly take place in the room where presidents once swam laps. The indoor pool had originally been installed in 1933 for President Franklin D Roosevelt, who swam regularly for exercise due to a polio diagnosis more than a decade earlier.After it closed, Gerald Ford had an outdoor pool installed in 1975.Before that, one of the biggest renovations came under Harry Truman, who saw the complete gutting and rebuilding of the White House from 1948 to 1952. Truman was relocated from living at the White House during the extensive project. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "White House begins demolishing part of East Wing for Trump ballroom",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8cee/live/0383bde0-ae44-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-21T02:48:43.000Z",
      "dateModified": "2025-10-21T02:48:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Met Police says it will no longer investigate non-crime hate incidents ",
    "url": "https://www.bbc.com/news/articles/cwyp1gk0n23o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dd5a/live/eeef00e0-add7-11f0-9c53-d1367f9334cb.jpg",
    "tag": "Trending",
    "date": "2025-10-20T20:04:13.000Z",
    "description": "12 hours agoEmma SaundersCulture reporterGetty ImagesThe Metropolitan Police says it will no longer investigate non-crime hate incidents to allow offi",
    "body": "12 hours agoEmma SaundersCulture reporterGetty ImagesThe Metropolitan Police says it will no longer investigate non-crime hate incidents to allow officers to \"focus on matters that meet the threshold for criminal investigations\".The announcement came as the Met confirmed it was dropping a probe into Father Ted creator Graham Linehan after he was arrested at Heathrow Airport on suspicion of inciting violence in posts on X.Mr Linehan was arrested by five officers on 1 September after arriving on a flight from the US, sparking a backlash from some public figures and politicians.The Crown Prosecution Service said it had decided no further action should be taken in the writer's case following a \"careful review\" of the evidence supplied by police.In a statement on Monday addressing non-crime hate incidents, a Metropolitan Police spokesperson said it \"understands the concern\" around the case.\"The commissioner has been clear he doesn't believe officers should be policing toxic culture war debates, with current laws and rules on inciting violence online leaving them in an impossible position,\" the spokesperson said.The policy change would \"provide clearer direction for officers, reduce ambiguity and enable them to focus on matters that meet the threshold for criminal investigations,\" the spokesperson added.Non-crime hate incidents are alleged acts perceived to be motivated by hostility or prejudice towards people with certain characteristics, such as race or transgender identity.They are recorded to collect data on \"hate incidents that could escalate into more serious harm\" but do not amount to a criminal offence, according to Home Office guidance. Police guidance on the recording of NCHIs was first published in 2005, following recommendations by an inquiry into the murder of Stephen Lawrence.Mr Linehan was arrested at Heathrow under the Public Order Act.In an email to Mr Linehan's lawyers, a Metropolitan Police detective said: \"I am writing to inform you that following a review of the evidence by the Crown Prosecution Service, it has been determined that no further action will be taken in this matter.\"This decision means that no charges will be brought against Graham Linehan in relation to this allegation.\"Please note that this decision may be reconsidered if further evidence or information comes to light.\"Mr Linehan and the Free Speech Union (FSU), an advocacy group, vowed to sue the Metropolitan Police for wrongful arrest and interference with his free speech rights.The writer added that Westminster Magistrates' Court had earlier ordered that all of his bail conditions be dropped after an application by FSU lawyers. District Judge Snow ruled that the conditions were too vague and ordered that they were immediately lifted.The arrestIn an online Substack article published in September, Mr Linehan said that, following his arrest at the airport, officials became concerned for his health after taking his blood pressure. He said he was then taken to hospital.The Metropolitan Police said that a man in his 50s was arrested on 1 September at Heathrow Airport and taken to hospital, adding his condition \"is neither life-threatening nor life-changing\" , and he was bailed \"pending further investigation\".Linehan said in the Substack post that his arrest related to three posts on X from April, on his views about challenging \"a trans-identified male\" in \"a female-only space\".He shared screen shots of the posts he said he was arrested for on Substack, the subscription-based online platform.The first post, from his X feed, said: \"If a trans-identified male is in a female-only space, he is committing a violent, abusive act. Make a scene, call the cops and if all else fails, punch him in the balls.\"He then wrote on Substack that during his police interview following the arrest, \"I explained that the 'punch' tweet was a serious point made with a joke\", and that it was about \"the height difference between men and women... and certainly not a call to violence\".His second post from X appeared to be an aerial shot of a group of protesters in a town centre, and he called it \"a photo you can smell\".The third expressed his views, in which he said \"I hate them\", referring to \"misogynists and homophobes\", adding an expletive.Getty ImagesOn 3 September the head of the Metropolitan Police, Sir Mark Rowley, defended the officers involved in the Heathrow arrests, but said he recognised \"concern caused by such incidents given differing perspectives on the balance between free speech and the risks of inciting violence in the real world\".He called on the government to \"change or clarify\" the law following Linehan's arrest, while Prime Minister Sir Keir Starmer said police must \"focus on the most serious issues\", when asked about the arrest.At the time, Green Party leader Zack Polanski called the posts \"totally unacceptable\", saying the arrest seemed \"proportionate\", while Shami Chakrabarti, a Labour peer and ex-director of Liberty, a civil liberties group, said \"the public order statute book and speech offences in particular do need an overarching review\".\"But inciting violence must always be a criminal offence,\" she added.Mr Linehan has pleaded not guilty to charges of harassment and criminal damage in a separate case, which has been adjourned until 29 October, with the comedian released on bail.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Met Police says it will no longer investigate non-crime hate incidents ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dd5a/live/eeef00e0-add7-11f0-9c53-d1367f9334cb.jpg"
      ],
      "datePublished": "2025-10-20T20:04:13.000Z",
      "dateModified": "2025-10-20T20:04:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]