[
  {
    "title": "F1 pre-season testing: Who are winners and losers?",
    "url": "https://www.bbc.com/sport/formula1/articles/c77e1djpg3mo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/90a1/live/9b3a1a90-0e8d-11f1-9120-a910fc22c6ac.png",
    "tag": "Trending",
    "date": "2026-02-20T19:44:29.000Z",
    "description": "Ferrari's Charles Leclerc ended the test with the single fastest lap time in an emphatic way - 0.811 seconds quicker than the next best time, set by M",
    "body": "Ferrari's Charles Leclerc ended the test with the single fastest lap time in an emphatic way - 0.811 seconds quicker than the next best time, set by Mercedes' Kimi Antonelli.Headline times in testing are usually not the place to look to gauge the competitive order, but this did reflect the picture in one important way - Mercedes and Ferrari look like they are going into the new season in the best shape.Andrea Stella, team principal of world champions McLaren, said on Friday evening: \"This test has confirmed that Ferrari and Mercedes look like the teams to beat. McLaren and Red Bull [are] probably very similar, Ferrari and Mercedes a step ahead.\"This picture, an impression reflected by many other senior figures up and down the pit lane, comes less from the headline lap times - even if they did show the teams in the order Ferrari, Mercedes, McLaren, Red Bull - than the so-called race-simulation runs.Because the teams fill up their cars with fuel and run a grand prix distance, these have far fewer variables to muddy the picture than single laps.On Friday evening, Leclerc did the best race simulation of the week, slightly quicker than Red Bull's Max Verstappen and McLaren's Oscar Piastri the day before, when they set more or less exactly the same time.Mercedes did not do any race simulations in the second week, only in the first, when track conditions were up to a second slower.Antonelli set comfortably the fastest race simulation of the first week - a lot faster than Piastri, who was running at the same time.And his team-mate George Russell - the bookies' pre-season championship favourite - was also impressively quick when running in the hotter, slower conditions earlier in the day.This is not an exact science, but the cumulation of data is what led to the conclusion reached by Stella and many others.A complication was that McLaren were not running the latest specification of Mercedes power-unit, which Mercedes were proving out, so can expect an uplift when they switch in Australia to the latest spec.Another is Red Bull's new engine is said by Russell to have the best deployment of energy, which is such an important facet this season.Mercedes' biggest concern is reliability. This hit Antonelli much more than Russell, but it's probably fair to say that Mercedes suffered more problems than their major rivals, although Red Bull's new recruit Isack Hadjar did lose a fair bit of his running to issues of one kind or another.There is no question as to the prize for biggest disappointment so far this year. Aston Martin, starting their new works partnership with Honda, are runaway winners of that.With design legend Adrian Newey at the helm, Honda - world champions with Red Bull as recently as 2024 - and the money of their billionaire owner Lawrence Stroll and Saudi Arabia's Public Investment Fund (PIF), all the ingredients for success seem to be there.But the new car, delayed by the fact Newey did not arrive until March last year, is uncompetitive and difficult, and the engine is lacking power and unreliable. Aston Martin completed the fewest laps of testing, and look like they may even be in worse shape than new team Cadillac, who expected to be last this year.Both the internal combustion engine and hybrid elements of the new Honda power-unit are said to be well behind the best.Several sources told BBC Sport this week that Newey said at Wednesday's meeting of the F1 Commission - a rule-making body comprising all the teams as well as F1 and the FIA - that the Honda power-unit could not even recover energy at the lower limit of 250kw, let alone the higher one of 350kw, which comes into force under certain circumstances in the highly complex rules.Reliability was so bad that by the start of the final day of the test, Honda had only one battery left, and took the decision to limit running to only short runs. A statement said that was to allow them to study data in between track outings, but in the end Lance Stroll did only six laps all day.The problems with the engine make it difficult to make any judgement on the car. There is no question it was slow in the corners - but the Honda is running so badly that it's hard for the team to work out where the car is, and therefore how to improve it.This is exacerbated by the fact Aston's first in-house gearbox - they have bought them in previously - is not communicating with the engine properly, and keeps behaving oddly, making life even more difficult for the drivers.For Fernando Alonso, this all must come with an agonising sense of deja vu. He spent three painful years at McLaren when Honda were underprepared when they re-entered F1 in 2015.And now he faces another one, at the age of 44, and with his contract running out at the end of the year.Publicly, Alonso is staying optimistic as he said: \"Short and medium term, I don't think there is anything that is impossible to fix.\"How long it takes, though, is another matter. And one thing Alonso does not have much of is time.While all the teams are reluctant to say exactly where they think they stand in the competitive order, all are clear that there appears to be three groups of teams - the top four, the midfield, and then Aston Martin and Cadillac at the back.Among the midfield runners, who are in the region of at least a second a lap slower than the big four, the team poised to make the biggest step seem to be Alpine.They finished last season last, by the biggest margin ever, partly because they devoted extremely limited resource to last year's car, so they could focus on this year.Alpine have switched to a Mercedes power-unit, following parent company Renault's decision to end its F1 engine programme. And with the combination of this and a much-improved car appear to have jumped up to the top of the midfield fight.There is some debate as to whether they or Haas are in the best shape, but either way this is huge progress for the French team.Racing Bulls are also in this mix at the top of the midfield.Among the midfield teams, Williams seem to be the biggest losers. Their 2026 car has been a disappointment so far, overweight by a significant margin - said to be anywhere between 25 and 40 kilos - and lacking downforce.Williams finished fifth last year, and this season was supposed to be the next step in their ambition of a return to the top of F1.Team principal James Vowles has been saying for two years how much of an opportunity the new rules are to move forward, and was vocal last season as to how early they had switched to the 2026 design and compromised 2025 for exactly this reason.So this is a major blow.Audi, which has taken over Sauber for the start of its brand new works programme with its own in-house engine, were expected to have difficulties.But they appear to be in decent shape and have been quietly impressive in the midfield context, and could well be ahead of Williams, even if a long way from their ultimate ambitions.The leading drivers have all at various points expressed their dissatisfaction with the new rules, especially the amount of energy management required with the new hybrid power-units.These feature a near 50-50 split between internal combustion engine and electrical components.With the amount of hybrid power increased three-fold, a component of the engine that helped recovery energy removed, and the batteries more or less the same size as last year, the cars are energy starved.This has led to some unusual aspects being added to driving.These include not going flat out in the run up to the start of a qualifying lap, taking corners in higher gears than is optimum for lap time to keep the turbo spinning, lifting and coasting in qualifying, and even not going flat out at the end of a qualifying lap because it is more time-effective to use the energy elsewhere.At some circuits, there will be a lot more energy recovery required than others by the various means available. These include recovering while at full throttle, known as \"super-clip\", and lifting and coasting, as well as the standard method, during braking.Albert Park is one of these energy-poor circuits.For a purist, and drivers who want to be on the limit at all times, this is not ideal.But F1 as a sport has known this was coming ever since the power-unit regulations were created in 2022. And, for now, the drivers are going to have get used to a new normal.Behind the scenes, meanwhile, there are ongoing discussions as to how to allow the drivers to drive in a more conventional way, but it remains to be seen how these will resolve.However, having seen the cars on track, and watched them on television, it is highly unlikely the average viewer will notice any difference. They still look like F1 cars, and in some ways are more appealing than last year's.They are smaller and have less downforce, so they slide more in corners, and look more agile. Many of the fast corners that were rendered bends in straights by last year's cars will become a driving challenge again, such as Abbey at Silverstone.Russell, while acknowledging the differences from previous cars, said: \"The guiding principles are still very much the same. You're pushing the car to the absolute limit. You're trying to brake as hard and late as possible, and carry as much speed through the corners. So far, I'm quite enjoying it.\"Off track, one of the main focuses of pre-season has been a row between the engine manufacturers over the rules governing the engines' compression ratio.It split the engine suppliers into two groups, Mercedes versus the rest - Ferrari, Honda and newcomers Red Bull and Audi.The row was dismissed earlier this week by Vowles - a Mercedes customer - as \"noise that will probably go away\", and by Mercedes F1 boss Toto Wolff as \"a storm in a teacup\". And it looks like both will end up being right.Why have Mercedes been targeted? Because their rivals believe they have found a way of exploiting the rule restricting the compression ratio - a measurement of the cylinder displacement between the two extremes of the piston stroke - to 16:1. The rules dictate it is measured at ambient temperature.Typically, the compression ratio reduces when engines heat up, and the belief was Mercedes had found a way using materials technology to limit this loss.Mercedes' rivals have been pushing for a rule that measures it at a higher temperature, in the hope of restricting their perceived advantage.This could also have allowed the others to set their ambient temperature compression ratio higher than 16:1 so that it was at the limit at a higher temperature, and so improve the performance of their engines relative to Mercedes.Governing body the FIA has proposed a compromise whereby the ratio is measured both at ambient temperature and 130C.As this does not achieve the aim Mercedes' opponents wanted, the signs are the other companies may even vote against the proposal that came out of their own campaign. Even if it passes, it seems it will make no difference.Wolff added: \"The way it works, you know, either we stay with the regulations like we are or the e-vote goes ahead with the proposal that came from the FIA. Both are OK for us.\"The new engines are also much harder to get off the line, which many expect will lead to unpredictability at starts.There were safety concerns about this at the start of the first test - especially the risk of a car slow away being rear-ended by another at high speed.But these were largely assuaged by a new start line procedure that was trialled at the test, which gives the drivers more time to get the turbos spinning at the optimum speed.On the face of it, the Ferrari-engined cars seemed to have an advantage - they rocketed past rivals on several occasions during these tests.But Williams driver Alex Albon said: \"I don't think what you're seeing is really what's going to happen. You've got drivers who are finishing long runs, going into a practice start, on a high-mileage tyre that's already gone. So you've seen this chaos of some people getting good starts, bad starts, but actually it's not as bad as that.\"And data seen by BBC Sport showed that, actually, of all the starts performed in testing, the Mercedes-engined teams as a bloc had the best starts on average - they were ranked in four of the top five places - followed by Ferrari-powered cars.Strangely, Racing Bulls were second and Red Bull last, despite having the same Red Bull Powertrains/Ford engine.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "F1 pre-season testing: Who are winners and losers?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/90a1/live/9b3a1a90-0e8d-11f1-9120-a910fc22c6ac.png"
      ],
      "datePublished": "2026-02-20T19:44:29.000Z",
      "dateModified": "2026-02-20T19:44:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential ch",
    "body": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Andrew Mountbatten-Windsor Arrested - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n22992?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-02-19T14:56:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·19 Feb 2026,·36 minsAndrew Mountbatten-Windsor ArrestedNewscastAvailable for over a yearToday, Andrew Mountbatten-Windsor has been arrested and is in custody on suspicion of misconduct in public office. \nKing Charles says he \"learned with the deepest concern\" of Andrew's arrest, adding \"the law must take its course\" - Prince William and Catherine are understood to support the statement.\nAndrew, who turns 66 today, has previously denied any wrongdoing in relation to Epstein; he has not responded to the BBC's requests for comment on the specific allegations in relation to the release of millions of Epstein files in January\nAdam and Laura are joined by royal correspondent Jonny Dymond and home and legal correspondent Dominic Casciani.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers.\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Chris Gray with Shiler Mahmoudi. The social producer was Joe Wilkinson. The technical producer was Gareth Jones. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Andrew Mountbatten-Windsor Arrested - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-02-19T14:56:00.000Z",
      "dateModified": "2026-02-19T14:56:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Who is Tucker Carlson and what does he tell us about the future of MAGA? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct8bz5?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-02-20T11:04:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·20 Feb 2026,·37 minsWho is Tucker Carlson and what does he tell us about the future of MAGA?AmericastAvailable for over a yearWho are the people shaping MAGA ideology in the US? Tucker Carlson’s story tells a larger one about just how much conservative media has changed in the United States, and the direction of conservatism itself. \nJason Zengerle, New Yorker staff writer and author of ‘Hated by All the Right People’, joins us to map Tucker Carlson’s trajectory from centre-right talk show host to one of the most prominent figures in the MAGA movement, with the ear of the president and a knack for gauging the mood of the base. \nAnthony and Justin discuss Carlson and the future of the conservative movement, as well as the other prominent figures spearheading it. Where is the Make America Great Again movement going - and who will lead it after Trump? \nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Anthony Zurcher, North America Correspondent\nGUEST:\nJason Zengerle, Staff Writer at the New Yorker and Author, ‘Hated By All The Right People’\nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray, Grace Reeve and Kris Jalowiecki.  The technical producer was Mike Regaard. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Who is Tucker Carlson and what does he tell us about the future of MAGA? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-02-20T11:04:00.000Z",
      "dateModified": "2026-02-20T11:04:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Saltburn",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002f1vy?at_mid=5dhF4rgAGg&at_campaign=Saltburn&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002f1vy&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Saltburn&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0lkj2gp.jpg",
    "tag": "Trending",
    "date": "2026-02-02T00:03:27.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeSaltburnSaltburnContains very strong language, explicit sexual content and some upsetting scenes.Deals with suicideBlack comedy thriller. A student at University finds himself drawn into the world of a charming, aristocratic classmate. Duration2h 2mFirst shown2023Available for 10 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesThe Souvenir Part IIHonor Swinton Byrne stars in a film about life and the return of old friends and lovers1h 40mThe Night ManagerStylish. Devilish. Deadly. John le Carré's twisted spy thriller with Tom HiddlestonThe NotebookYou never forget first love. A sweeping love story with Ryan Gosling and Rachel McAdams1h 55mBirdBarry Keoghan stars in Andrea Arnold's empathetic tale of life on the fringes of society1h 54mLord of the FliesWhen the rules vanish, the beast within awakens. A bold retelling of a dystopian classicAfireSelf-centred Leon is driven to distraction by some unwelcome housemates on holiday1h 37mIndustryProve your worth. Colleagues, turned lovers, turned enemies...RetreatNo neighbours. No help. No escape. Tense thriller with Cillian Murphy and Thandie Newton1h 25mCrossingIs Lia on the path to inner peace? A tender tale of a connection that transcends borders1h 38mSilent WitnessThe forensics team who will stop at nothing to get answers for the deadThe Last Letter from Your LoverFelicity Jones stars in a romance for the ages. Some love stories deserve a second chance1h 41mWould I Lie to You?Tall tales, faithless fibs with Kate Garraway, Jonathan Ross, JB Gill and Michelle Wolf29 mins",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Saltburn",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0lkj2gp.jpg"
      ],
      "datePublished": "2026-02-02T00:03:27.000Z",
      "dateModified": "2026-02-02T00:03:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC News weekly quiz: Why was the mysterious fossil ‘smiling’?",
    "url": "https://www.bbc.com/news/articles/cev7dg291jzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/17c9/live/a0af8730-0dac-11f1-b5e2-dd58fc65f0f6.jpg",
    "tag": "Trending",
    "date": "2026-02-19T17:39:19.000Z",
    "description": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessTechnologyHealthCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch L",
    "body": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessTechnologyHealthCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch Live1 day agoThis week, Andrew Mountbatten-Windsor was arrested, Prince William spoke about understanding his own emotions, and an Amazon delivery van got stuck in the sea.But how much attention did you pay to what else happened in the world over the past seven days?Quiz collated by George Sandeman and Grace Dean.Fancy some more? Try last week's quiz, or have a go at something from the archives.Fossils",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC News weekly quiz: Why was the mysterious fossil ‘smiling’?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/17c9/live/a0af8730-0dac-11f1-b5e2-dd58fc65f0f6.jpg"
      ],
      "datePublished": "2026-02-19T17:39:19.000Z",
      "dateModified": "2026-02-19T17:39:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tributes paid to teens who died at East Yorkshire holiday park",
    "url": "https://www.bbc.com/news/articles/c4g8rdp6lrvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4453/live/c1770790-0e97-11f1-990b-f3effc469b9e.png",
    "tag": "Trending",
    "date": "2026-02-20T20:13:57.000Z",
    "description": "5 hours agoGrace McGroryEast Yorkshire and LincolnshireFamily handoutCherish Bean, 15, and Ethan Slater, 17, died at Little Eden Holiday Park, near Br",
    "body": "5 hours agoGrace McGroryEast Yorkshire and LincolnshireFamily handoutCherish Bean, 15, and Ethan Slater, 17, died at Little Eden Holiday Park, near Bridlington, on WednesdayTributes have been paid to two teenagers who died at a holiday park in East Yorkshire.Humberside Police confirmed Ethan Slater, 17, and Cherish Bean, 15, from Sheffield, died at Little Eden Holiday Park, near Bridlington, on Wednesday.The force said their deaths were \"thought to be connected to carbon monoxide poisoning\".Two men, aged 33 and 42, have been arrested on suspicion of gross negligence manslaughter and remained in police custody, the force added.Family handoutCherish Bean's mum said her daughter was \"my girl, my world, my love, my everything\" In a statement issued through police, Cherish's mum said: \"My perfect girl, my angel, has left this world and we are broken as a family. I am broken as a mother, and I will never ever be the same again.\"If you know me, I live and breathe my babies, and we were away for a few nights making the best memories ever. We have had the best life together and it has been ripped from under us.\"Ethan's mum said: \"Ethan was the most beautiful young man to walk the earth. He was generous, loving, charming and kind.\"We hope you know how loved you are our boy, rest well and keep the table warm for us up there.\"Ethan's dad added: \"I am a broken man without you, son. I will love you eternally my boy. You were taken way too soon from me. Love you always.\"A fundraising page has been set up by Ethan's family.Family handoutEthan Slater's mum described him as \"generous, loving, charming and kind\"The 33-year-old was arrested on Thursday and an extension to keep him for a further 12 hours had been granted, while the 42-year-old had been arrested since, police said.Ch Supt Matt Peach said: \"Our thoughts remain with the loved ones of both teenagers.\"This remains a very complex investigation with numerous lines of inquiry being followed up.\"He said investigations to establish the full circumstances surrounding the deaths continued and a cordon remained in place at the site.Police said they were working with the Health and Safety Executive, Humberside Fire and Rescue and East Riding of Yorkshire Council. Humberside Police was called to Little Eden Holiday Park near Bridlington on Wednesday More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tributes paid to teens who died at East Yorkshire holiday park",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4453/live/c1770790-0e97-11f1-990b-f3effc469b9e.png"
      ],
      "datePublished": "2026-02-20T20:13:57.000Z",
      "dateModified": "2026-02-20T20:13:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nasa targets March 6 date to send humans back around the Moon ",
    "url": "https://www.bbc.com/news/articles/c86y1g6wde3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/041d/live/dd9135c0-0e80-11f1-801d-ed3cff6bf876.jpg",
    "tag": "Trending",
    "date": "2026-02-20T17:00:26.000Z",
    "description": "8 hours agoRebecca Morelle,Science Editor,Alison Francis,Senior Science JournalistandGreg Brosnan,Senior Science JournalistShutterstockThe astronauts ",
    "body": "8 hours agoRebecca Morelle,Science Editor,Alison Francis,Senior Science JournalistandGreg Brosnan,Senior Science JournalistShutterstockThe astronauts will begin their journey on Nasa's Space Launch System rocket Nasa is targeting early March to launch a crew around the Moon for the first time in more than 50 years, in what would be humankind's furthest trip into space.The Artemis II mission will see four astronauts embark on a 10-day journey around the far side of the Moon and back to Earth, paving the way for a future lunar landing.Nasa set the earliest launch date of March 6 (early on March 7 in the UK) following a successful \"wet dress rehearsal\" - a critical pre-launch test where the rocket is filled with fuel and taken through the countdown sequence.It was the Artemis team's second attempt at a practice run at the Kennedy Space Center in Florida.\"Every night I look up at the Moon and I see it and I get real excited because I can feel she's calling us and we're ready,\" Nasa's Lori Glaze told a news conference on Friday.\"The excitement for Artemis II is really, really starting to build, we can really start to feel it. It's coming.\"The first rehearsal, which took place at the beginning of February, ended early because of a hydrogen fuel leak at the launch pad.Glaze said issues including with seals and filters had now been remedied.\"Yesterday we were able to fully tank the SLS rocket within the planned time line […] we also succesfully demonstrated the launch countdown,\" she said.Three Americans - Reid Wiseman, Victor Glover and Christina Koch - and one Canadian, Jeremy Hansen, make up the Artemis II crew.Glaze said the crew were excited following the successful rehearsal and would go into quarantine later on Friday.They'll begin their journey on Nasa's mega Moon rocket: the 98m-tall (322ft) Space Launch System, or SLS.It's only flown once before in November 2022 for the Artemis I mission, but this was with no people onboard.The crew will be strapped into the Orion capsule, which is located at the top of the rocket.The inside of their spacecraft is about the size of a minibus, and it's where the four will live, eat, work and sleep during the 10-day mission.The first day of their journey will be spent in orbit around the Earth, then if all systems are working well, the astronauts will head towards the Moon.The voyage takes about four days, and the crew will travel around the far side of the Moon, which is the side we never see from Earth.They'll be at a distance of 6,500-9,500km (4,000 to 6,000 miles) above the lunar surface, and will have several hours dedicated to studying and taking images of the Moon.After the fly by, the astronauts will begin their four-day journey home. They will end the mission with a splash down in the Pacific Ocean.NASAApollo 17 astronaut Harrison Schmitt visited the Moon in 1972The mission, if successful, will pave the way for Artemis III, which will see astronauts set foot on the lunar surface. The last time humans visited the Moon was in 1972 for the Apollo 17 mission.Nasa says the landing will happen by 2028, but this is a very ambitious timescale.Elon Musk's SpaceX company has a contract to build the lander for Artemis III - which will be flown to the Moon on a SpaceX Starship rocket. But delays to the Starship rocket have led Nasa to ask SpaceX for a new streamlined plan to speed a return to the Moon.Nasa has also asked rival company Blue Origin - which is owned by Jeff Bezos - to come up with an accelerated lunar plan for Artemis III.As the tech billionaires battle it out, the US is under pressure to return to the Moon. China is aiming for a lunar landing by 2030, and has been making steady progress towards this.Both nations are planning to land at the Moon's south pole - and are competing for the best spots to build their lunar bases.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nasa targets March 6 date to send humans back around the Moon ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/041d/live/dd9135c0-0e80-11f1-801d-ed3cff6bf876.jpg"
      ],
      "datePublished": "2026-02-20T17:00:26.000Z",
      "dateModified": "2026-02-20T17:00:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man charged with raping unconscious wife with other men for years",
    "url": "https://www.bbc.com/news/articles/cqxde27ep5qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3f1a/live/dcd53690-0e71-11f1-9acc-6bf6c7adf476.jpg",
    "tag": "Trending",
    "date": "2026-02-20T16:06:29.000Z",
    "description": "9 hours agoJonny HumphriesManchester Minshull Street Crown CourtEPAA number of men are accused of sexually assaulting the woman while she was unconsci",
    "body": "9 hours agoJonny HumphriesManchester Minshull Street Crown CourtEPAA number of men are accused of sexually assaulting the woman while she was unconsciousA man has been charged with drugging and sexually abusing his unconscious wife alongside a number of other men.The husband, who cannot be named for legal reasons, faces 48 counts including conspiracy to rape, sexual assault by penetration and conspiracy to administer a substance with intent to commit a sexual offence.The case involves 12 other men ranging in age from 28 to 73, and involves allegations dating back to the early 2000s.The defendants appeared at Manchester Minshull Crown Court earlier where seven of the defendants including the woman's husband, aged in his 60s from Stockport, Greater Manchester, pleaded not guilty to all charges.Some members of the woman's family attended the hearing and watched from the public gallery.Five of the defendants were not asked to enter their pleas.One man pleaded guilty to conspiracy to commit rape, conspiracy to administer a substance with intent, conspiracy to commit sexual assault by penetration and one of committing sexual assault by penetration.A further hearing will take place in March and a trial date has been set for 1 September, with an estimated duration of 12 weeks.Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man charged with raping unconscious wife with other men for years",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3f1a/live/dcd53690-0e71-11f1-9acc-6bf6c7adf476.jpg"
      ],
      "datePublished": "2026-02-20T16:06:29.000Z",
      "dateModified": "2026-02-20T16:06:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Authorities in Italy accuse man of training dog to illegally dump his rubbish",
    "url": "https://www.bbc.com/news/articles/cy57erz57xyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/af9f/live/3b795c80-0e5e-11f1-9120-a910fc22c6ac.png",
    "tag": "Trending",
    "date": "2026-02-20T15:57:17.000Z",
    "description": "Dog trained to illegally dump rubbish, Italian authorities say9 hours agoKerena CobbinaWatch: Video footage shows a small dog carrying a bag along a r",
    "body": "Dog trained to illegally dump rubbish, Italian authorities say9 hours agoKerena CobbinaWatch: Video footage shows a small dog carrying a bag along a roadA dog owner in Italy has been accused of training their canine to dump bags of rubbish on the side of a road.Video footage released by police shows a small dog leisurely walking down a road in Catania's San Giorgio district in Sicily carrying a bag of rubbish in its mouth before dropping it.Local authorities say the dog's actions - which were captured on video on two consecutive days - are evidence that \"leaves little room for doubt\" the canine had been trained to drop off the bags so that its owner could avoid being filmed discarding them.Fly tipping is illegal in Italy, but it remains a common problem. Local authorities have been trying to step up efforts to get a grip on the issue by using methods such as surveillance cameras to catch culprits.\"Ingenuity can never become an alibi for incivility,\" the municipality of Catania said in a post on its official Facebook page.\"Respect for urban etiquette and the environment is everyone's duty,\" it added.The post did not say whether any action had been taken.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Authorities in Italy accuse man of training dog to illegally dump his rubbish",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/af9f/live/3b795c80-0e5e-11f1-9120-a910fc22c6ac.png"
      ],
      "datePublished": "2026-02-20T15:57:17.000Z",
      "dateModified": "2026-02-20T15:57:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK Athletics pleads guilty to corporate manslaughter",
    "url": "https://www.bbc.com/sport/articles/c0ljn0z94n5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a742/live/9c6dfac0-0e4d-11f1-9189-e7ebb4fb5ccd.jpg",
    "tag": "Trending",
    "date": "2026-02-20T11:34:09.000Z",
    "description": "UK Athletics has pleaded guilty to the corporate manslaughter of Paralympian Abdullah Hayayei.Hayayei died aged 36 after a metal cage fell on him whil",
    "body": "UK Athletics has pleaded guilty to the corporate manslaughter of Paralympian Abdullah Hayayei.Hayayei died aged 36 after a metal cage fell on him while training at Newham Leisure Centre, London in July 2017.UK Athletics pleaded not guilty to the charge in March 2025 but entered a fresh plea on Friday at an Old Bailey hearing.Keith Davies, the head of sport for the 2017 World Para-athletics Championships, also pleaded guilty to a health and safety charge, having previously denied gross negligence manslaughter.Prosecutor Karen Robinson asked the court to set a two-day sentencing hearing in early June, confirming the prosecution would not seek a trial and the outstanding charges would be dealt with at the conclusion of the sentencing.Davies, 78, was granted continued bail on the condition he liaise with the Probation Service for a pre-sentence report.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK Athletics pleads guilty to corporate manslaughter",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a742/live/9c6dfac0-0e4d-11f1-9189-e7ebb4fb5ccd.jpg"
      ],
      "datePublished": "2026-02-20T11:34:09.000Z",
      "dateModified": "2026-02-20T11:34:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "KFC, Nando's, and others ditch chicken welfare pledge as demand soars",
    "url": "https://www.bbc.com/news/articles/cm2r6jqm042o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ad8a/live/7f74d6e0-0e67-11f1-9f23-b3f349b149c7.jpg",
    "tag": "Trending",
    "date": "2026-02-20T16:17:53.000Z",
    "description": "9 hours agoJosh MartinBusiness reporterGetty ImagesMajor restaurant chains, including KFC, have ditched a commitment to improve chicken sourcing stand",
    "body": "9 hours agoJosh MartinBusiness reporterGetty ImagesMajor restaurant chains, including KFC, have ditched a commitment to improve chicken sourcing standards in the UK as poultry demand soars.Eight restaurant groups, which also include the owners of Burger King and Nando's, have left the Better Chicken Commitment (BCC), in which they pledged to stop using fast-growing chickens, for an industry-led plan without that commitment.Animal welfare groups say fast-growing \"franken-chickens\" mature quicker but also have higher rates of premature death and muscle disease.Trade body UKHospitality said the industry-led plan will help restaurant firms reduce emissions and meet surging demand for the lean protein while ensuring secure supply chains.Allen Simpson, CEO of UKHospitality, which represents some of the restaurant brands who have withdrawn from the BCC, said despite the change the businesses are \"committed to enhancing their ongoing work across welfare and the environment\".The eight businesses, owning or franchising 18 leading restaurant chains, have instead joined the industry-led Sustainable Chicken Forum (SCF).Some of the brands include include Popeyes, Wingstop, and Wagamama.The SCF said businesses \"no longer believe the BCC is the right framework to drive the next phase of progress on welfare due to the requirement to source only slower-growing breeds\".It argued that farming slower-growing breeds produces more greenhouse gas emissions than farming faster-growing breeds.UKHospitality said the SCF will focus on increasing welfare while limiting the environmental impact of chicken farming and keeping up with demand.The BBC understands the famous chicken chain owned by Yum Brands buys about 4% of the UK chicken supply. An industry source said there is not yet a large enough supply of slower-growing poultry in the UK.However, animal welfare group Anima International said the change was \"about money and nothing else\".Its UK chief executive Connor Jackson said the companies' explanation for leaving is rubbish.\"Franken-chickens pose the most serious animal welfare problem in the UK,\" Jackson said.He said that chicken farmers and poultry companies would produce more slower-growing, higher-welfare chickens according to orders.\"This is why the supply isn't there for them now: producers won't do it unless they have a contract in place because they are more expensive,\" he said.Claire Williams, campaigns manager at The Humane League UK, said it was clear to her animal welfare group why the chicken outlets had switched membership. \"Major food companies, with the combined worth of many billions of pounds, have decided that their profit margins cannot be threatened,\" Williams said.\"The Better Chicken Commitment was designed by scientists to help animals - the Sustainable Chicken Forum is a welfare-washing, PR-stunt designed to deflect criticism, and let these companies claim they are doing enough\".Richard Griffiths, head of the British Poultry Council, which represents poultry breeders and processors, said the news was \"most welcome\".He said that at a time of higher production costs and slow planning approvals the industry did not need added costs.Retailers such as M&S and Waitrose and cafe chains Pret and Greggs remain members of the BCC.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "KFC, Nando's, and others ditch chicken welfare pledge as demand soars",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ad8a/live/7f74d6e0-0e67-11f1-9f23-b3f349b149c7.jpg"
      ],
      "datePublished": "2026-02-20T16:17:53.000Z",
      "dateModified": "2026-02-20T16:17:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK agrees drone and missile defence plan with four EU allies",
    "url": "https://www.bbc.com/news/articles/c875jj3y475o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ae7c/live/dd9689c0-0e7c-11f1-aed6-eb0cc10d195f.png",
    "tag": "Trending",
    "date": "2026-02-20T17:35:35.000Z",
    "description": "8 hours agoPaul SeddonPolitical reporterGetty ImagesBritain is to develop new air defence weapons alongside the EU's four biggest military powers, dee",
    "body": "8 hours agoPaul SeddonPolitical reporterGetty ImagesBritain is to develop new air defence weapons alongside the EU's four biggest military powers, deepening ties with the European defence sector.The project will invite manufacturers in the UK, Germany, France, Italy and Poland to submit plans to build low-cost missiles and autonomous drones. The allies are pledging a speedy process to build the weapons together, inspired by Ukraine's development of cheap drones to counter attacks from Russia.The UK's Ministry of Defence (MoD) says the programme will prioritise a \"lightweight, affordable\" surface-to-air weapon, with the first project to be delivered by next year. The plan, announced at a meeting of the five countries' defence ministers in the Polish city of Krakow, marks a boost to UK-Europe ties after the failure of talks last year over UK participation in the EU's new €150bn (£130bn) defence fund.Agreement would have allowed British defence companies to play a greater part in joint projects funded by the loans, but negotiations fell apart after the UK rejected a multibillion euro entry fee demanded by the EU.A budget for the latest drone defence plan has not been confirmed, but Defence Minister Luke Pollard told reporters in Poland that each country was making a \"multimillion pound, multimillion euro\" commitment to the scheme.The MoD says it will take inspiration from Ukraine, which has quickly developed a huge domestic drone manufacturing sector since Russia's full-scale invasion of the country four years ago.Huge numbers of low-cost drones have become a key part in defending the country from Russian attacks that can involve hundreds of attack drones, rendering traditional missile defence systems impractical and costly.'Economics of warfare'\"To be effective at shooting down relatively low-cost missiles, drones and other threats facing us, we need to make sure that we're matching the cost of the threat with the cost of defence,\" said Pollard after the meeting.He added that the drone defence plan agreed on Friday would be the first in a series of initiatives from the group of five allies, known as the E5, to change the \"economics of warfare\" amid the threat from Russia.The MoD has not provided a detailed plan for how drones could be developed more quickly, but is pledging to step up co-operation with smaller technology companies and minimise operational requirements for taking part in projects.Europe is under pressure to increase defence spending in the wake of the Ukraine war and questions over the reliability of the United States as a Nato ally.The E5 group, which first met in autumn 2024 after Donald Trump's re-election, has now met seven times and has emerged as a key body for boosting European defence co-operation outside the much larger structures of the EU.Boosting the use of autonomous drones, which can independently identify targets without human control using AI, was a key part of a wide-ranging review of UK military capabilities unveiled in summer last year.That review saw the MoD commit to developing \"more permissive\" regulations for such autonomous systems, in a potential shift away from the position that there should always be \"context-appropriate human involvement\" in weapons. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK agrees drone and missile defence plan with four EU allies",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ae7c/live/dd9689c0-0e7c-11f1-aed6-eb0cc10d195f.png"
      ],
      "datePublished": "2026-02-20T17:35:35.000Z",
      "dateModified": "2026-02-20T17:35:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sam Fender and Olivia Dean reach number one after 35 weeks with Rein Me In",
    "url": "https://www.bbc.com/news/articles/cq6q9m016l5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/36bd/live/9b8bb470-0e76-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-20T17:45:01.000Z",
    "description": "8 hours agoPaul GlynnCulture reporterBBC/GettyRein Me In gives Olivia Dean her second number one single, and Fender his firstSam Fender and Olivia Dea",
    "body": "8 hours agoPaul GlynnCulture reporterBBC/GettyRein Me In gives Olivia Dean her second number one single, and Fender his firstSam Fender and Olivia Dean have made UK chart history after their slow-burning collaboration, Rein Me In, finally made it to number one after 35 weeksThe song - Fender's first ever chart-topping single - finally reached the summit on Friday, breaking the record for the most consecutive weeks in the top 40 before reaching number one.The soulful pop-rock love song has been a mainstay on the singles chart since its release last June, previously peaking at number five three times. The previous record was held by Ed Sheeran's Thinking Out Loud, which spent 19 consecutive weeks slowly charming the nation before topping the chart in 2014.Asked about why he thought it took so long to reach the top, Fender told BBC Radio 1: \"I guess it's the internet, it travelled online and people come to it later, which is wonderful really because it's the music that's doing the talking.\"The new number one is a duet reworking of a track of the same name taken from Fender's third studio album, the Mercury Prize-winning People Watching.Fender noted the new version - a sort of lyrical two-way conversation about the end of a relationship - was \"all the better\" for having her input. \"Olivia made the song her own, and it took on a life of its own after we did it together,\" he said.The pair previously gave the melancholic ballad its live debut, performing it together during Fender's gig at the London Stadium - home of Dean's team West Ham United.She joined him onstage again, a week later, to sing the same song at St James' Park - home of Fender's beloved Newcastle United - like the home and the away leg of the same musical tie.Allow Google YouTube content?This article contains content provided by Google YouTube. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read and before accepting. To view this content choose ‘accept and continue’.The BBC is not responsible for the content of external sites. Google YouTube content may contain adverts.Rein Me In climbed four places to reach number one, dethroning Taylor Swift's latest single Opalite, which reached the top last week after the release of its music video.Despite scoring three UK number one albums, Fender had never had a number one single until now, with perhaps his best known anthem, Seventeen Going Under, peaking at number three in 2021.Dean is no stranger to the top of the charts, having reigned supreme in October with her crossover smash hit, Man I Need (which is still in fourth place on Friday's chart).The London-born singer also takes second place in this week's chart, with her solo single So Easy (To Fall In Love).Elsewhere on Friday's singles chart, Swedish pop star Zara Larsson's Lush Life equalled its peak chart position - third - nearly 10 years on from its original release - thanks largely to a wave of 2016 nostalgia that has been taking over social media.And recent Super Bowl performer, Puerto Rican singer Bad Bunny, sits in fifth spot with DtMF.Charli hits the heights againReutersCharli XCX attended the UK premiere of Wuthering Heights in London earlier this monthMeanwhile, Charli XCX secured a hat-trick of number one albums with her official soundtrack to the Wuthering Heights movie.The success of her soundtrack to Emerald Fennell's movie adaptation of Emily Brontë's gothic love story follows that of her 2022 album Crash and 2024's all-conquering party record Brat.But it also signals a significant departure in style for the British pop star, as heard on songs such as Chains of Love and Dying For You.The album's lead single, House, features Welsh musician and founding member of the Velvet Underground, John Cale.Asked how she'd found the transition from the lime-green Brat summer vibe of her Brit Award-winning album to the darker themes of this film, Charli said: \"Honestly, [it was] really, really fun.\"\"I always like to work in polar opposites,\" she told BBC News at the recent Wuthering Heights premiere. \"And so this was, honestly, a dream project to me.\"Her new number one arrived on the same day that the Brit Award winner saw the cinematic release her Aidan Zamiri-directed mockumentary, The Moment.Charli XCX's success on this week's album chart prevented a double number one for Olivia Dean, whose album The Art of Loving was at the summit last week.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sam Fender and Olivia Dean reach number one after 35 weeks with Rein Me In",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/36bd/live/9b8bb470-0e76-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-20T17:45:01.000Z",
      "dateModified": "2026-02-20T17:45:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Winter Olympics 2026: Four men, one aim - to end 102-year wait for curling gold",
    "url": "https://www.bbc.com/sport/articles/ce3gqz1yyyyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b251/live/a9c57ac0-0e9a-11f1-801d-ed3cff6bf876.jpg",
    "tag": "Trending",
    "date": "2026-02-20T17:30:20.000Z",
    "description": "Image source, Andy HoneByRichard WintonBBC Sport in CortinaIt's a Thursday night in November. A pub in Glasgow's Merchant City. Four men, all about th",
    "body": "Image source, Andy HoneByRichard WintonBBC Sport in CortinaIt's a Thursday night in November. A pub in Glasgow's Merchant City. Four men, all about the age of 30, are squeezed around a small table, eating and talking about what the next few months might bring. Nobody recognises them.That same pub three months later. Screens showing a Celtic game are changed so the patrons can watch the curling. Almost everyone is anxiously staring at the TVs, willing those same four men to reach a Winter Olympic final.Chances are they will be doing the same on Saturday (18:05 GMT), when Team GB's Bruce Mouat, Grant Hardie, Hammy McMillan and Bobby Lammie take on Canada with a gold medal at stake.\"Our gold medal,\" as Mouat referred to it after the epic semi-final win over Switzerland in northern Italy on Thursday - a contest which drew 3.4million viewers to the BBC at its peak.And fulfilling what they believe to be their destiny - by upgrading their silver medal from Beijing four years ago - is what these four Scots have travelled to Cortina to do.Since that 2022 near miss, Team Mouat have come to dominate men's curling, winning two World Championships and adding another couple of European crowns, as well as a record 12 Grand Slam titles. At times, they have been unbeatable.That cloak of invincibility slipped during the round-robin stages here - leaving qualification out of their hands - but that fright has now been forgotten, replaced with the return of a clear-eyed focus on the task in hand.But who are these four young men who have now caught the country's attention? And what makes them more than the sum of their parts?Nine years that changed face of curlingTo understand the dynamic between the quartet, you have to go back almost nine years to when they first came together as a team.With the world of curling being as small as it is, they weren't strangers to each other. Hardie and McMillan are 33-year-old cousins from south-west Scotland. Lammie, 29,  hails from there, too, and played in a rink previously with 31-year-old Mouat, who knew the others from their shared school days in Edinburgh.Approaches were made, conversations had, culminating in a meeting. \"That first time we met, the thing we wrote at the top of our list of goals was to win Olympic gold,\" Mouat told BBC Sport.After that, the die was cast. The boys told British Curling they were only willing to join the elite programme as a unit and not individually. Their ultimatum was accepted, success has followed, and now they are considered the best in the world.Mouat is thought to be among the greatest skips to have played the game. Hardie has a reputation as a high-grade tactician and shot maker, while McMillan and Lammie are credited with reinventing the role of a sweeper.Once just 'the lads with the brushes', their physicality has evolved the position to the extent that the curling cognoscenti consider it to now be \"a sweeping game\" rather than a throwing one.Media caption, Semi-final victory 'hardest fought win we've ever had' - GB men's curling teamWill GB quartet make history?But it is the coalescence of their personalities that amplifies all that sporting talent. And underpinning the team are two key things - total honesty and trust.As McMillan puts it \"if one of us is in the wrong, the rest can say so\", while the more-measured Mouat describes it as \"knowing the different things to say to get the best out of each other\".Individually, they are all very different. McMillan is lively enough for all four of them; Hardie is the logic guy, an engineer by trade; Mouat is thoughtful, reflective and calm; and Lammie is the quiet, reliable presence in the background.It might be labelled as 'Team Mouat' - as per the convention of naming a rink after the skip - but this is very much a collective. In fact, Mouat is keen to share the spotlight.\"Bruce is so compassionate and calm and he's very different from a lot of skips,\" explains BBC Sport pundit and 2022 gold medallist Vicky Wright. \"A lot of them are clearly the leader but the GB team operates so well because they function on a level playing field.\"The dynamic they've got works so well because they all bring a different aspect to the table and they all respect that. That's a massive part of why they're so successful.\"Media caption, GB will go for gold after beating Swiss to reach men's curling finalIt's instructive to see how comfortable the four of them are in each other's company and with the position they find themselves in.All four - and alternate Kyle Waddell - have been right in among it in Cortina this week, be it stopping for a chat in the street or in restaurants, meeting friends and relatives, watching other British athletes compete. Or - in Mouat's case - going pillowcase shopping and \"spending far too much money\" on the morning of the semi-final.Even in the moments before that crucial match, there was a relaxed focus about them. McMillan and Hardie were sharing a laugh, Mouat picking out familiar faces in the crowd for a smile and a wave, and Lammie was casually studying the Swiss warming up.All of that will culminate on Saturday night in the quirky Cortina Curling Stadium, first built as an open-air venue to host the 1956 Games.In a place where history looks down from the wooden bleachers, these four will attempt to make their own by becoming the first GB men's rink in 102 years to win Olympic gold.Achieve that, and maybe the next time they go into that Glasgow pub they might just draw a few glances of recognition.Winter Olympics 20266-22 FebruaryMilan-CortinaWatch two live streams and highlights on BBC iPlayer (UK only), updates on BBC Radio 5 Live and live text commentary and video highlights on the BBC Sport website and app. CurlingWinter SportsWinter Olympics",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winter Olympics 2026: Four men, one aim - to end 102-year wait for curling gold",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b251/live/a9c57ac0-0e9a-11f1-801d-ed3cff6bf876.jpg"
      ],
      "datePublished": "2026-02-20T17:30:20.000Z",
      "dateModified": "2026-02-20T17:30:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]