[
  {
    "title": "Oppenheimer",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002p1fr?at_mid=8PiucSontB&at_campaign=Oppenheimer&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002p1fr&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Oppenheimer&at_bbc_team=BBC&at_creation=Film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mlb4dr.jpg",
    "tag": "Trending",
    "date": "2025-12-21T23:52:18.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeOppenheimerOppenheimerContains some strong language and some sexual content.Deals with SuicideThe life of J Robert Oppenheimer, the physicist appointed by the US in the race to develop the atomic bomb before the Nazis. But winning that race comes at a cost. Duration2h 49mFirst shown2023Available for 11 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesCrimes of the FutureA new world is revealed. Viggo Mortensen stars in David Cronenberg's gory body-horror1h 38mOperation MincemeatDeception - the greatest weapon in war. True story of a daring plan that changed history1h 58mA Ghost Story for ChristmasNothing is what it seems… Mark Gatiss adaptation of MR James' spine-tingling tale29 minsUnforgivenThe acclaimed Oscar-winner with Gene Hackman. A retired gunslinger takes on one last job2h 2mElvisAustin Butler and Tom Hanks star in Baz Luhrmann's exhilarating portrait of an icon2h 26mThe Great EscaperLove, loyalty and spirit never grow old. Based on a true tale that captivated the world1h 30mFuneral in BerlinMichael Caine stars. Harry is in Berlin, with a wall between him and his next assignment1h 38mRaging BullRobert De Niro stars in Martin Scorsese's acclaimed brutal biopic of boxer Jake LaMotta2h 2mThe GodfatherA movie masterpiece. Al Pacino, Marlon Brando and one of the most acclaimed films ever2h 47mThe Godfather Part IIKeep your enemies closer. Betrayal complicates the family business for Michael Corleone3h 9mJawsYou'll never go in the water again... Steven Spielberg's iconic blockbuster with bite1h 59mHell or High WaterJustice isn't a crime. Two Texan brothers resort to dangerous measures to save the ranch1h 36m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oppenheimer",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mlb4dr.jpg"
      ],
      "datePublished": "2025-12-21T23:52:18.000Z",
      "dateModified": "2025-12-21T23:52:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Scarecrows' Wedding",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002hzg2?at_mid=NmMWAx3ZZx&at_campaign=The_Scarecrows_Wedding&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002hzg2&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=The_Scarecrows_Wedding&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mmp2nr.jpg",
    "tag": "Trending",
    "date": "2025-12-25T15:37:45.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeThe Scarecrows' WeddingThe Scarecrows' WeddingBetty O’Barley and Harry O’Hay are scarecrows planning a wedding to remember. A loving tale about learning that the important thing isn’t a grand gesture – it's simply being together. Duration25 minsFirst shown3:10pm 25 Dec 2025Available for over a yearWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesStick ManWill our hero make it home in time for Christmas? An epic adventure across the seasons26 minsThe Highway RatA crafty duck is trying to put an end to the rat's crooked ways - will she succeed?25 minsZog and the Flying DoctorsZog and Gadabout try to rescue Princess Pearl, who has been locked up in the castle.24 minsZogJulia Donaldson’s much-loved picture book comes to life with a stellar voice cast.26 minsTabby McTatA heart-warming tale of friendship and kittens starring a 'purrrfectly happy' pair25 minsThe Smeds and the SmoosSoar into space for an adventure that’s out of this world! A Julia Donaldson adaptation26 minsTiddlerA little fish with a big imagination, saved by his tales after getting lost in the ocean23 minsSuperwormHe's a wiggly, squiggly superhero - but who'll rescue him from the evil Wizard Lizard?25 minsThe Snail and the WhaleThe tiniest creature and the mightiest mammal head off on a wonderful adventure.26 minsRoom on the BroomIggety ziggety zaggety zoom! A kind witch invites too many animals onto her broom25 minsBlueyFestive fun with Bluey and her family: a collection of fun and heartwarming episodes.42 minsThe GruffaloA mouse took a stroll through the deep dark wood, and his tall tales turn out to be true!27 mins",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Scarecrows' Wedding",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mmp2nr.jpg"
      ],
      "datePublished": "2025-12-25T15:37:45.000Z",
      "dateModified": "2025-12-25T15:37:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What Trump's vision of the new world order means for Europe",
    "url": "https://www.bbc.com/news/articles/c041n3ng03no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cdd1/live/eb492840-ec7e-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-09T12:11:35.000Z",
    "description": "Trump's grand plan to reshape the world order leaves Europe with a difficult choice to make4 hours agoAllan LittleSenior correspondentBBCFor 80 years,",
    "body": "Trump's grand plan to reshape the world order leaves Europe with a difficult choice to make4 hours agoAllan LittleSenior correspondentBBCFor 80 years, what bound the United States to Europe was a shared commitment to defence and a common set of values: a commitment to defend democracy, human rights and the rule of law.That era was inaugurated in March 1947 in an 18-minute speech by President Harry Truman, in which he pledged US support to defend Europe against further expansion by the Soviet Union.America led the creation of Nato, the World Bank, the IMF and the United Nations. And it bound itself into what became known as the \"rules-based international order\", in which nation states committed to a series of mutual obligations and shared burdens, designed to defend the democratic world against hostile authoritarian powers.Now, the new US National Security Strategy (NSS), published in December, signals that, for the White House, that shared endeavour has ended; that much of what the world has taken for granted about America's role is over.The review refers to the \"so-called 'rules-based international order'\", putting the latter phrase in inverted commas: a kind of delegitimisation by punctuation mark.AFP via Getty ImagesJD Vance said that the real threat to Europe did not come from Russia but from within Vice-President JD Vance warned America's European allies that this was coming in a speech at the Munich Security Conference in February 2025.He told them bluntly that the real threat to Europe did not come from Russia but from within - from those censoring free speech, suppressing political opposition and therefore undermining European democracy. And he was damning about the \"leftist liberal network\".The French newspaper Le Monde said the speech was a declaration of \"ideological war\" against Europe.Last month's NSS codifies Vance's remarks, and, in black and white, elevates them to the status of doctrine.\"Certainly America is no longer the country that promoted the global values that have been in place since the end of the Second World War,\" says Karin von Hippel, who previously held senior positions in the US State Department and is a former Director of the Royal United Services Institute (Rusi), a Whitehall think tank.\"It is shifting to a very different place.\"So, if the world is indeed moving away from that order, what is it moving towards? And what does it mean for the rest of the world and in particular for Europe?'We have a different world today'\"International institutions, notably the United Nations, have been marked by dramatically anti-American sentiment, and have not served our or any other particular purpose,\" says Victoria Coates, a vice-president at The Heritage Foundation, a prominent right-wing think tank in Washington.In the eyes of Coates - who was previously the Deputy National Security Adviser to US President Donald Trump - change to the international order is inevitable in a changing world.\"The other issue we face here is that when that so-called rules-based international order was established after the Second World War, 80 short years ago, China wasn't a major concern.\"We just have a different world today.\"Getty ImagesPresident Truman watches on as a US representative signs the United Nations Charter in 1945This rules-based international order, built in the years after World War Two, was created by a generation that had come of age during an era of Great Power geopolitics, and had seen that system descend, twice, into catastrophic global conflict.That international order, flawed and incomplete though it undoubtedly was, was the legacy of that experience.But the NSS directly argues that American strategy went astray in the years since - and it blames what it calls \"American foreign policy elites\".\"They lashed American policy to a network of international institutions, some of which are driven by outright anti-Americanism and many by a transnationalism that explicitly seeks to dissolve individual state sovereignty,\" it says.It suggests that in future, the US will seek to roll back the influence of supranational bodies. Anadolu via Getty ImagesThe National Security Strategy says: 'We stand for the sovereign rights of nations, against the sovereignty-sapping incursions of the most intrusive transnational organizations'\"The world's fundamental political unit is and will remain the nation-state… We stand for the sovereign rights of nations, against the sovereignty-sapping incursions of the most intrusive transnational organizations…\"Elsewhere in the document, reflecting on the \"balance of power\", it states: \"The outsized influence of larger, richer, and stronger nations is a timeless truth of international relations.\"The Kremlin responded to the review with praise, saying much of it aligned with Moscow's own thinking.\"I think Trump, Xi, Putin and their more authoritarian acolytes are seeking to return us to an era of Great Power politics,\" says Field Marshal Lord Richards, who, as General Sir David Richards, was the head of the UK's armed forces from 2010 till 2013.Yet Sir Lawrence Freedman, Emeritus Professor of War Studies at King's College London, believes the new Security Strategy is not as radical a break with the past as it may appear.AFP via Getty ImagesThe Kremlin said much of the review aligned with Moscow's own thinking\"We need to be careful about the rules-based international order, which is a term that came into general use in the last decade or so,\" he argues.\"Look back and you find plenty of violations of the rules, Vietnam for example. So there's a sort of rosy glow about the past at times and everyone should be careful about nostalgia for what was a complex past.\"Muscular reassertion of the Monroe doctrineWashington's military operation in the Venezuelan capital Caracas that led to the capture of the country's leader Nicolas Maduro and his wife, Cilia Flores, is an early example of this more muscular assertion of sovereign unilateralism.Some international law experts have questioned the legality of the Trump administration's actions, and argued the US may have violated international statutes governing the use of force. The US maintains its actions were legally justified.\"Under American law it certainly was [legal]\" Robert Wilkie, who served as an Undersecretary of Defense in the first Trump administration, has previously told the BBC.\"Maduro - most of our European partners have not recognised his regime so he is an illegitimate figure. Because of that he is stripped of the normal protections that heads of state would have [...]particularly when were are looking at constitutional provisions that exist in the United States, that would supersede anything the UN says.\"AFP via Getty ImagesThe military operation in the Venezuelan capital Caracas led to the capture of Nicolas Maduro and his wife, Cilia FloresThe NSS claims, for the United States, the right to be the pre-eminent power in the Western Hemisphere, and to bend its Latin American and Caribbean neighbours into alignment with Washington's interests.This is a muscular reassertion of the 1823 Monroe Doctrine and its promise of US supremacy in the Western hemisphere.Colombia, Panama and Cuba are all also in the President's sights.\"This starts primarily with the Panama Canal,\" says Victoria Coates. \"The degree to which control of the canal is necessary to the United States cannot be overstated.\"China is now Latin America's biggest trading partner and a major infrastructure investor there. The NSS aims to roll back Chinese influence in Washington's backyard.When the canal was handed over to Panama, in 1999, by President George HW Bush, says Coates, \"we were in the assumption that China was a reasonable actor… That turned out not to be true…\"So making sure that the United States retains a prime position over the canal is critical, and I think Panama is for the first time getting that message from the United States.\"But Sir Lawrence Freedman is among those who argue that the US's ability to control its neighbours is not unlimited.\"The Strategy Review might say this is our hemisphere and we can do what we want, but there are still constraints. They may have extricated Maduro and his wife, but they're still dealing with the old regime.\"They're not running the country, despite what Trump says.\"Under the new strategy, the United States will no longer pressure authoritarian regimes to improve their human rights records.In a phrase taken from the US Declaration of Independence of 1776, the review declares, \"All nations are entitled by 'the laws of nature and nature's God' to a 'separate and equal station' with respect to one another.\"Getty ImagesXi Jinping and Nicolas Maduro pictured in 2015 in Beijing, ChinaIn the Middle East, for example, the US says it will abandon the \"misguided experiment with hectoring these nations - especially the Gulf monarchies - into abandoning their traditions and historic forms of government\".\"The key to successful relations with the Middle East,\" it adds, \"is accepting the region, its leaders, and its nations as they are while working together on areas of common interest.\"But it seems the same level of respect for traditions and historic forms of government is not extended to the democratic and allied nations of Europe.Whilst it refers to an American sentimental attachment to the European continent - and to Britain and Ireland - what's striking about this paper is that it seeks to redefine what is worth defending in the Western world.This review is civilisational in its reach, and argues for a civilisation that is no longer built on the shared values of the Truman Doctrine, but instead on the primacy of the sovereign nation-state.Where does this leave Europe?The review is damning about Europe's \"current trajectory\" and raises questions about whether some European nations can be regarded as dependable allies in the future.It talks about \"economic decline\" but adds that this is \"eclipsed by the real and more stark prospect of civilizational erasure\".Elsewhere in the document, it states: \"It is more than plausible that within a few decades at the latest, certain Nato members will become majority non-European,\" which raises doubts about their viability as long-term security partners, the strategy suggests.\"It's a very nativist document,\" argues Karin von Hippel. \"It's very ideological. The underlying message is that the Christian white male is no longer running many of the countries [in the West] and we're seeing a threat to the dominance that the Christian white male has had in the United States and Europe.\"They're very careful not to say any of that explicitly but I think that's what's implied.\"Getty ImagesThe new US National Security Strategy, which was published in December, is damning about Europe's 'current trajectory'But Victoria Coates argues that, in her view, the \"larger struggle we find ourselves in\" is indeed civilisational.\"Sovereignty is also a critical issue,\" she says. \"Looking at the European Union project, especially after Brexit, I think a lot of countries are wondering if subverting the national interest to Brussels is a winning strategy.\"I do think that is one of the institutions that the NSS does call into question.\"This chimes with the interests of the American tech giants that oppose EU efforts to regulate their activities on the European continent.Last month Elon Musk posted on X that the European Union should be abolished and sovereignty returned to the individual nation states.'Cultivating resistance to Europe's trajectory'The review is clear about how Europe can regain its \"self-confidence\".It says: \"The growing influence of patriotic European parties indeed gives cause for great optimism. Our goal should be to help Europe correct its current trajectory. We will need a strong Europe to help us successfully compete.\"And one of its policies for doing this is by \"cultivating resistance to Europe's current trajectory within European nations\".What is meant precisely by \"cultivating resistance\" raises many questions.In Europe, some have already concluded that the USA may no longer be a reliable ally, at a time when Russia poses a growing threat. After Vice-President Vance's speech in Munich, Germany's Chancellor, Friedrich Merz, said Europe would need to \"achieve independence\" from America with a reshaped Nato.But this takes time.\"It's not achievable in the short term,\" says Sir Lawrence. \"The Europeans have become very dependent upon the United States, and this was a matter of choice: it was cheaper and simpler.\"Though in practice it would be desirable to be able to act without the Americans… in practice it's going to take years to disentangle ourselves. And it'll be extremely expensive.\"So Europe has a difficulty: it can't rely on the Americans, but it can't operate easily without them.\"AFP via Getty ImagesFriedrich Merz has said Europe would need to \"achieve independence\" As to the pressing question of what it means for Europe - and the EU - in the near future, Lord Richards issues a stark warning: \"[It] risks falling between the cracks.\"\"The EU cannot be a Great Power, nor can any of its constituent nations,\" he argues. \"[So] the UK/EU must decide under whose sphere of influence they should shelter?\"The answer is they are likely to remain in the USA's - and within a reshaped Nato.\"'A popular revolt against the establishment'But Lord Richards also believes that increased spending commitment is long overdue.\"European nations are going to have to spend much more on their own defence. This has long been coming but in the UK it is not yet translating into any fresh money. Indeed this year the armed forces are being required to save money rather than spend more.\"The US has been pushing Europe to increase defence spending for years, notes Sir Lawrence.\"The message that Europe needs to do more for its own defence has been around a long time. It was pushed by both Obama and Biden.\"Last year Trump secured from the European allies a commitment to increase defence spending to 5% of GDP - and in doing so may have done Europe a security favour, by pushing it, in the long term, towards greater operational independence from Washington.\"Spending has gone up quite significantly,\" says Sir Lawrence. \"The Germans have been making quite impressive strides. So there is movement, not as fast as many would wish, but it's happening.\"The review is clear about how America thinks it can \"help\" Europe. \"We want to work with aligned countries that want to restore their former greatness,\" it says.Getty ImagesVictoria Coates says: \"International institutions, notably the United Nations, have been marked by dramatically anti-American sentiment...\"Ultimately, what the report reveals is not so much an ideological divide that separates the US and Europe, but one that slices through both continents.Both sides of the Atlantic have certain concerns in common, argues Victor Mallet, a Paris-based journalist and author of a forthcoming book, Far Right France: Le Pen, Bardella and the Future of Europe.\"Concerns about immigration, concerns about the economy… and there's an extraordinary cultural gulf between supporters of people like Donald Trump, the National Rally in France, the AfD in Germany, and the intellectual, metropolitan, educated liberal elite.\"It's definitely a popular revolt against the establishment.\"He believes that one of the problems is inequality. \"America has, on average, the richest group of consumers the world has ever seen and yet many ordinary Americans find it hard to make ends meet and the same applies in Western Europe.\"More from InDepthIn the NSS, the US commits to scrapping certain practices, such as Diversity, Equity and Inclusion, that are derided by many in Trump's base.In this document, the culture wars that shape America's bitter public discourse now to a degree also shape its in foreign policy, and - by extension, affect the security of the Western world.Russia is not mentioned as a hostile power, despite its invasion of Ukraine, a Western ally. For in the culture wars, some in Trump's Maga base see in Vladimir Putin not a foe but a natural ally in the defence of white, Christian nationalist civilisation: a man who proudly defends his country, its traditions and identity - the very attributes, after all, that they value and admire in Donald Trump.Top picture credit: AFP / Getty ImagesBBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. You can now sign up for notifications that will alert you whenever an InDepth story is published - click here to find out how.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What Trump's vision of the new world order means for Europe",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cdd1/live/eb492840-ec7e-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-09T12:11:35.000Z",
      "dateModified": "2026-01-09T12:11:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Everything We Know About The Minneapolis ICE Shooting…So Far - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0msylv4?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-08T20:12:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·08 Jan 2026,·28 mins,·Everything We Know About The Minneapolis ICE Shooting…So FarNewscastAvailable for over a yearProtests are taking place in Minneapolis after a woman was fatally shot by a US ICE agent.\nAccounts of what exactly happened are conflicting, with the Trump Administration citing self-defence whilst law makers in the city and state of Minnesota are calling it a brazen act of force.\nAdam is joined by BBC North America correspondent, Anthony Zurcher, and BBC North America reporter, Madeline Halpert, who is on the ground and at the scene in Minneapolis.\nIn studio is BBC business editor Simon Jack, who got the scoop on the government’s latest change of heart about business rates for English pubs.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Shiler Mahmoudi and Chloe Scannapieco. The social producer was Beth Pritchard. The technical producer was Rohan Madison. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Everything We Know About The Minneapolis ICE Shooting…So Far - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-08T20:12:00.000Z",
      "dateModified": "2026-01-08T20:12:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - The fatal Minneapolis ICE shooting - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0msxs2k?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-01-08T18:19:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·08 Jan 2026,·29 minsAvailable for over a yearProtests have broken out in Minneapolis after a US immigration agent shot dead a 37-year-old woman in the city. \nVideos posted on social media show the moment of the shooting, in which ICE agents approach a car in the middle of a residential street. As it attempts to drive off, one of the agents points his gun at the driver and at least two shots are heard. \nWith the Trump administration characterising the incident as “domestic terrorism”, alleging Renee Good had “harassed” officers all day prior to the shooting, the mayor of Minneapolis has labelled this account “bullshit” and called on immigration officers to get out of the city. The governor of Minnesota, Tim Walz, is calling for a full investigation but says a fair outcome will be difficult because \"people in positions of power\" - naming Trump, Vice President JD Vance and Homeland Security Secretary Kristi Noem - have \"already passed judgement\". Walz says they've shared information that he says is \"verifiably false\" and \"inaccurate\" and made assumptions about Renee Good's character and actions ahead of the shooting.\nIn today’s episode, Justin, Sarah and Marianna discuss the reasons why Americans can’t agree on what happened in the videos posted to social media, and reflect on whether the shooting has the capacity to lead to a larger protest movement across the nation. And, as recent polling suggests more Americans are growing dissatisfied with some of the tactics used by ICE, we ask what it would take to change Donald Trump’s mind on his flagship deportations policy.\nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Marianna Spring, Social Media Investigations Senior Correspondent \nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by George Dabby with Alix Pickles. The technical producer was Rohan Madison. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - The fatal Minneapolis ICE shooting - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-01-08T18:19:00.000Z",
      "dateModified": "2026-01-08T18:19:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trial starts of man accused of inciting teens to harm themselves",
    "url": "https://www.bbc.com/news/articles/cje1vjpwje4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/661f/live/aa428600-ab5d-11f0-b0f1-8b73bbc9408d.jpg",
    "tag": "Trending",
    "date": "2026-01-09T15:42:38.000Z",
    "description": "35 minutes agoBethany BellBBC News, BerlinA 21-year-old man has gone on trial in Hamburg, charged with committing multiple crimes online, including co",
    "body": "35 minutes agoBethany BellBBC News, BerlinA 21-year-old man has gone on trial in Hamburg, charged with committing multiple crimes online, including coercing a 13-year-old to die by suicide on the internet.The man, who used the pseudonym White Tiger, is believed to have been a prominent figure in a group of international cyber-criminals known as \"764\".He is accused of grooming children and young teenagers between the ages of 11 and 15 to commit acts of violence against themselves online.The authorities say White Tiger's victims came from Germany, the UK, Canada and the US but his lawyer described the allegations are baseless and fabricated.The US Federal Bureau of Investigation (FBI) described the \"764\" group as an international child exploitation enterprise and a \"network of nihilistic violent extremists\". It also made a number of arrests.The man, named only as Shahriar J in line with German privacy laws, has both German and Iranian nationality. He was arrested at his parents' home in Hamburg last summer.He is charged with 204 offences against more than 30 children and teenagers.Prosecutors in Hamburg say the crimes were committed between 2021 and 2023.Shahriar J is suspected of having made particularly vulnerable children emotionally dependent on him via social media. He is then believed to have exploited that bond to create child pornography.In some of the cases, he is accused of persuading his victims to take their own life.Prosecutors have charged him with one murder and five attempted murders, \"as an indirect perpetrator.\" All his crimes are said to have been committed via the internet.Reports in the German media say one of his victims, a 13-year-old boy from the US, took his own life in real time online.A 14-year-old Canadian girl is alleged to have attempted to take her own life too.According to the charge sheet, in order to comply with Shahriar J's demands for increasingly violent content, the children seriously injured themselves or performed sexual acts on themselves in live chats in front of viewers.The defendant is accused of having made recordings of this in order to threaten the children with publication if they did not inflict even more serious self-harm on themselves in front of the camera.Because some of the alleged offences were committed when Shahriar J was a teenager himself, the trial is taking place behind closed doors.Before the trial began, the 21-year-old's defence lawyer, Christiane Yüksel, rejected the allegations as baseless and fabricated. She described the prosecution's claim of double indirect perpetration in the murder charge as \"experimental\".\"This construct of so-called indirect perpetration is, as the word suggests, a construct that is factually incorrect and cannot be proven,\" she said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trial starts of man accused of inciting teens to harm themselves",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/661f/live/aa428600-ab5d-11f0-b0f1-8b73bbc9408d.jpg"
      ],
      "datePublished": "2026-01-09T15:42:38.000Z",
      "dateModified": "2026-01-09T15:42:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Owner of Swiss ski resort bar held in custody after deadly New Year's Eve fire",
    "url": "https://www.bbc.com/news/articles/c4g0mq520zeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/75c5/live/b24ddce0-ed71-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-09T15:49:58.000Z",
    "description": "One of the co-owners of the Swiss bar where 40 people died in a fire on New Year's Eve has been detained.Swiss prosecutors said that Jacques Moretti, ",
    "body": "One of the co-owners of the Swiss bar where 40 people died in a fire on New Year's Eve has been detained.Swiss prosecutors said that Jacques Moretti, a French national, was a potential flight risk. The blaze at Le Constellation bar in Crans-Montana left 116 people injured. Many of the victims were aged under 20.It emerged this week that the bar in the ski resort had not undergone safety checks for five years.The decision to detain Jacques Moretti came after he and his French wife Jessica, who own the bar together, were on Friday questioned by prosecutors in the Swiss canton of Valais.Under Swiss law, the subject of an investigation is kept in custody until a court decision is made within 48 hours. The couple had been earlier placed under criminal investigation.They are both suspected of manslaughter by negligence, bodily harm by negligence and arson by negligence, the prosecutors' office in Valais said.The co-owners have said they are \"devastated\", pledging \"full co-operation\" with the ongoing investigation.The prosecutors have said they believe the fire started when people celebrating the New Year raised champagne bottles with sparklers attached, setting light to sound-insulating foam on the ceiling of the basement bar.On Friday, Switzerland staged a minute of silence on a national day of mourning for the victims of the fire. Church bells then rang across the country for five minutes.Trains and trams came to a halt and Zurich airport briefly paused operations.At a local commemoration staged in Crans-Montana, there was a standing ovation for firefighters.The news that the bar had not been inspected for five years has shocked families of the victims.Romain Jordan, who represents some of the families, said earlier this week the \"staggering number of breaches and shortcomings in the inspections raises the question of whether the municipality should be investigated with even greater urgency\".Venues like Le Constellation should have been checked annually, but Crans-Montana Mayor Nicolas Feraud said on Tuesday he could not explain why this had not been done for so long at that bar.\"We regret that - we owe it to the families and we will accept the responsibility,\" he said.He added that sparklers would be banned in local venues.Most of the victims of the fire were young - eight were under the age of 16.Many of the injured have severe burns and are being treated in Switzerland and other European countries.The funerals of some of those who died have been taking place.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Owner of Swiss ski resort bar held in custody after deadly New Year's Eve fire",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/75c5/live/b24ddce0-ed71-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-09T15:49:58.000Z",
      "dateModified": "2026-01-09T15:49:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC News quiz of the week: Which sport helped Timothée Chalamet win a Best Actor award?",
    "url": "https://www.bbc.com/news/articles/c74w3qx4j5no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3328/live/716fc2a0-ecb9-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-08T18:45:01.000Z",
    "description": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationHealthCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch L",
    "body": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationHealthCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch Live22 hours agoThis week, the US shocked the world by seizing Venezuelan leader Nicolás Maduro in a raid on his home, high street retailer Claire's financial troubles continued, and actress Ashley Tisdale spoke out against \"toxic mom groups\".But how much attention did you pay to what else happened in the world over the past seven days?Quiz collated by Ben Fell.Fancy some more? Test your memory of 2025 with our quiz of the year, try last week's quiz, or have a go at something from the archives.FilmUnited States",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC News quiz of the week: Which sport helped Timothée Chalamet win a Best Actor award?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3328/live/716fc2a0-ecb9-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-08T18:45:01.000Z",
      "dateModified": "2026-01-08T18:45:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US forces seize fifth Venezuela-linked oil tanker ",
    "url": "https://www.bbc.com/news/articles/cdxj28xd542o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/036b/live/8172cd70-ed70-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "Trending",
    "date": "2026-01-09T15:34:43.000Z",
    "description": "US forces have seized a fifth tanker in the Caribbean Sea, officials said, as Washington continues its efforts to control exports of Venezuelan oil.\"O",
    "body": "US forces have seized a fifth tanker in the Caribbean Sea, officials said, as Washington continues its efforts to control exports of Venezuelan oil.\"Once again, our joint interagency forces sent a clear message this morning: 'there is no safe haven for criminals,'\" US Southern Command said on X.The X post on Friday morning said that Marines and sailors in coordination with the Department of Homeland Security \"apprehended\" the Olina oil tanker.Homeland Security Secretary Kristi Noem said the Olina was \"another 'ghost fleet' tanker ship suspected of carrying embargoed oil\" and was seized after it \"departed Venezuela attempting to evade US forces\".  Noem posted a video online appearing to show troops dropping onto a ship from a helicopter. The tanker, the Olina, is on multiple countries' sanctions lists and the fifth vessel to be seized by the US in recent weeks.Maritime risk company Vanguard Tech said the vessel was attempting to break through the US naval blockade in the Caribbean. It added that the vessel's location tracker was last active 52 days ago, northeast of Curacao, and that \"the seizure follows a prolonged pursuit of tankers linked to sanctioned Venezuelan oil shipments in the region\".Earlier this week, the US said it seized two other tankers linked to Venezuelan oil exports in \"back-to-back\" operations in the North Atlantic and Caribbean.One of them was the Russian-flagged Marinera, which was seized with the help of the UK Royal Navy, who gave logistical support by air and sea.The Marinera is allegedly part of shadow fleet carrying oil for Venezuela, Russia and Iran, breaking US sanctions.US authorities alleged the second tanker - the M/T Sophia - was \"conducting illicit activities\".The moves come as the US seeks to choke off most exports of Venezuelan crude oil, and just days after its special forces seized Venezuelan President Nicolás Maduro in a lightning raid on his residence in Caracas.President Donald Trump  says Venezuela - which has the world's largest proven oil reserves - \"will be turning over\" up to 50 million barrels of oil worth some $2.8bn (£2.1bn) to the US.Secretary of State Marco Rubio has said that the oil would be sold \"in the marketplace at market rates\" and that the US would control how the proceeds were dispersed \"in a way that benefits the Venezuelan people\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US forces seize fifth Venezuela-linked oil tanker ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/036b/live/8172cd70-ed70-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-09T15:34:43.000Z",
      "dateModified": "2026-01-09T15:34:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Norfolk man who coerced woman into sex with 100 others jailed",
    "url": "https://www.bbc.com/news/articles/cp9jxv13m7po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d3b8/live/776f22d0-ed64-11f0-88e7-5d06f9172e94.jpg",
    "tag": "Trending",
    "date": "2026-01-09T13:03:32.000Z",
    "description": "Man jailed for making woman have sex with strangers3 hours agoClare Wordenat Norwich Crown CourtNorfolk PoliceProsecutors said more than 100 men were ",
    "body": "Man jailed for making woman have sex with strangers3 hours agoClare Wordenat Norwich Crown CourtNorfolk PoliceProsecutors said more than 100 men were involved in the abuse which was photographed and filmed by Rodney JohnstonA man who coerced a woman into having sex with more than 100 strangers over three decades has been jailed for a minimum term of 16 years. Rodney Johnston threatened the woman if she did not comply with his demands to engage in a range of sex acts with men at secluded countryside locations as well as in cars and in hotels, the court has heard.The 67-year-old, from Starston in Norfolk, was found guilty after a trial in September, which also heard he photographed and filmed the abuse.Sentencing him to life in prison at Norwich Crown Court, Judge Alice Robinson said the victim's impact statement was \"harrowing\" and showed \"the severe and lifelong impact\" of the abuse. Police found some 30,000 images and videos documenting the abuse.The court heard the coercion involved physical and verbal threats.'Rape in all but name'The judge said the victim was forced to \"go out\" several times a week. \"Going out became a byword for her being raped by strangers. This is rape in all but name,\" said the judge.Robinson said she believed Johnston would remain a danger to the victim for the rest of his life.  In a police statement released after sentencing, the woman said she had been left feeling \"used\" and \"terrified\" by the abuse. She said: \"I had no voice, no choice.\"I feel anxious about the future, but for the first time in decades I am free.\"Johnston was found guilty of multiple offences dating between 1994 and 2024, including:three counts of procuring a woman to have sexual intercourse by threats or intimidationtwo counts of causing a person to engage in sexual activity without consentone count of intimidation of a witnessThroughout the seven-week trial, Johnston denied all the charges and claimed the acts were consensual.However, police said evidence proved the woman's account that she was not a willing participant and had been coerced and exploited.He made connections through adult social networks and sent out bulk text messages to advertise times and places where men could have sex with the woman.Norfolk Police said he claimed many of these messages were him living out \"a fantasy\" and dismissed them as \"banter\".However, thousands of other messages and images, including messages the victim sent to a friend detailing the abuse, supported her account, detectives said.In a statement, the victim said Johnston \"took her out\" up to five nights a week to hotels or outdoor locations, despite insisting she did not want to go.She said she was disgusted afterwards and was threatened or punished if Johnston felt she was not being co-operative.'Disturbing abuse'Police said Johnston caused further distress to his victim when he broke the conditions of his bail, following his arrest in July 2024.Senior investigating officer Duncan Woodhams said the sentence was \"the result of painstaking work due to the sheer volume of evidence involved, and of course the courage of the victim telling us about what she endured\". \"We're grateful for her trust in us, allowing us to present the full scale of Johnston's prolonged, disturbing and truly awful abuse,\" he said.\"Our focus will now shift to establishing if any further offences have been committed and if so we'll conduct a thorough investigation to identify those responsible and do everything we can to bring them to justice.\" If you have been affected by this story or would like support then you can find organisations which offer help and information at the BBC Action Line.Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Norfolk man who coerced woman into sex with 100 others jailed",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d3b8/live/776f22d0-ed64-11f0-88e7-5d06f9172e94.jpg"
      ],
      "datePublished": "2026-01-09T13:03:32.000Z",
      "dateModified": "2026-01-09T13:03:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New York man jailed for hoax bomb calls to London venues",
    "url": "https://www.bbc.com/news/articles/c74w3kx40p0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4e2a/live/52424890-1ecd-11f0-8ec4-cb21354b4a30.jpg",
    "tag": "Trending",
    "date": "2026-01-09T15:37:48.000Z",
    "description": "40 minutes agoAmy ClarkeLondonGetty ImagesThe Metropolitan Police said that while not all calls connected, \"a significant number\" got throughA man has",
    "body": "40 minutes agoAmy ClarkeLondonGetty ImagesThe Metropolitan Police said that while not all calls connected, \"a significant number\" got throughA man has been jailed for a year after making a series of bomb hoax calls from New York to hospitals and other venues in London and across the UK.David Hart, 22, from West Winfield, New York, made 95 calls to UK numbers between late October and mid-November 2023, including 66 to London numbers.In November 2025, the United States District Court for the Northern District of New York sentenced him to 12 months in prison and two years of supervised release.Seven hospitals -  including Guy's and St Thomas' - were targeted, along with six bars, restaurants and supermarkets, two police control rooms and a cancer support centre.Hart also tried to call Westminster Abbey, but the calls went unanswered because it was night time in the UK.The Metropolitan Police said that while not all calls connected, \"a significant number\" did.During the conversations, Hart would usually claim he had planted a bomb at the location, and said it would soon explode.On one occasion, he told a recipient: \"I put a bomb in your guys' corridor bathroom\" and warned they had \"about 12 seconds to get out of that building\".Police described the calls as \"sustained and persistent\", sometimes lasting almost half an hour, adding that Hart often made multiple calls to the same victims.Some recipients were sceptical but still responded and took precautions expected in such circumstances. Venues were searched, and one hospital went into full lockdown while checks for explosives were carried out.In a video shared by the Met Police, Hart claimed he \"made a lot of prank calls\" but nothing \"threatening\".More related to this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New York man jailed for hoax bomb calls to London venues",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4e2a/live/52424890-1ecd-11f0-8ec4-cb21354b4a30.jpg"
      ],
      "datePublished": "2026-01-09T15:37:48.000Z",
      "dateModified": "2026-01-09T15:37:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK facing £28bn defence spending gap claims",
    "url": "https://www.bbc.com/news/articles/c14rj11ez5mo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/035e/live/b97f1980-ed70-11f0-8abc-8b61be694132.jpg",
    "tag": "Trending",
    "date": "2026-01-09T16:05:15.000Z",
    "description": "13 minutes agoPaul SeddonPolitical reporterGetty ImagesThe government is refusing to deny reports that plans to make Britain's armed forces \"war ready",
    "body": "13 minutes agoPaul SeddonPolitical reporterGetty ImagesThe government is refusing to deny reports that plans to make Britain's armed forces \"war ready\" will require billions more than it has allocated so far.The Ministry of Defence (MoD) believes it will require an extra £28bn over the next four years to meet its forecast costs, according to The Times and The Sun. The department's investment plan has been delayed, with Sir Keir Starmer reportedly ordering a rewrite of the proposals.The plan was initially supposed to have been completed in autumn last year, but could now not emerge until the spring. The document is due to set out how new equipment and defence infrastructure will be funded over the coming decade, following a wide-ranging review of Britain's capabilities published in June last year.The review pledged billions in extra spending for extra ammunition, next-generation fast jets, drones, and new attack submarines, as ministers pledged to move the UK to \"war-fighting readiness\".According to the reports, the projected £28bn shortfall was made by MoD officials in an internal assessment conducted last year.Sir Richard Knighton, the chief of the defence staff, delivered the forecast to Sir Keir, Chancellor Rachel Reeves in the run-up to Christmas at a meeting in Downing Street, it is reported.The prime minister's spokesman said he would not discuss \"specific meetings,\" but acknowledged that the armed forces were facing additional demands, including a potential deployment to Ukraine to police any deal to end its war with Russia.Asked several times if he could deny there was a £28bn spending gap, he said he could only reiterate the spending pledges already made by the government.Spending warningsThe MoD's budget is due to rise by 3.6% in real terms by 2029, under departmental spending plans fixed last year.The increase was weighted towards the long-term investment budget, which pays for new military kit, rather then the day-to-day budget that covers things like administration costs and salaries.This is not the first time that there have been warnings about the MoD's ability to fund its spending commitments.The investment plan is meant to replace decade-long \"equipment plans\" released on a rolling yearly basis until 2022, when the department halted publication whilst it assessed the effect of \"extraordinary inflation\" on its plans.An analysis published by the department in December 2023, under the previous government, found that the MoD's most recent equipment plan was forecast to exceed its budget by £16.9bn.A report by MPs published the following year said the biggest cause of that shortfall came from spiralling costs from maintaining the UK's nuclear weapons system, alongside inflation.The delay to the investment plan has also delayed the release of a separate document detailing yet to be specified \"productivity savings\" within the department worth £6bn between now and 2029. An MoD spokesperson said it was working \"flat out\" to finish the investment plan, adding that Labour had inherited an \"underfunded defence programme\" from the previous government. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK facing £28bn defence spending gap claims",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/035e/live/b97f1980-ed70-11f0-8abc-8b61be694132.jpg"
      ],
      "datePublished": "2026-01-09T16:05:15.000Z",
      "dateModified": "2026-01-09T16:05:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Luke Littler signs record sponsorship deal worth reported £20m",
    "url": "https://www.bbc.com/sport/darts/articles/c70leg9rdkpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/de58/live/bcf803b0-ed5c-11f0-9afe-032419c395ec.jpg",
    "tag": "Trending",
    "date": "2026-01-09T13:45:19.000Z",
    "description": "Image source, Getty ImagesImage caption, Luke Littler beat Gian van Veen 7-1 to win the World Darts ChampionshipByDavid WatkinsonBBC SportWorld number",
    "body": "Image source, Getty ImagesImage caption, Luke Littler beat Gian van Veen 7-1 to win the World Darts ChampionshipByDavid WatkinsonBBC SportWorld number one Luke Littler has signed a record sponsorship deal for a darts player worth a reported £20m.The 18-year-old, who claimed the £1m prize for winning the World Championship earlier this month, has signed a 10-year agreement with Target Darts.Target has described the deal as \"the largest agreement in darts history between a brand and a player\" and PA Media reports that it is worth up to £20m with potential bonuses and add-ons.BBC Sport has contacted Littler's representatives and Target Darts for comment.Littler has won two world titles and already has 10 major titles to his name.\"Target has believed in me from day one,\" said Littler, who is also managed by the company.\"From my playing career to my product range, we've built everything together and I'm really excited to commit to our partnership long-term and see where we can take this next.\"Target sells a range of equipment including Luke Littler darts, dartboards and playing shirts.Littler burst on to the scene at the 2024 World Championship, reaching the final but coming up short against Luke Humphries.He won the Premier League title in 2024 and went on to lift his first world title in January 2025 before retaining his crown.Only Phil Taylor, with 14, and Michael van Gerwen, on three, have won more PDC world titles than Littler, who is also just the fourth player to triumph in successive years.Target chairman Garry Plummer said: \"I met Luke at the BDO Youth World Championship Qualifier when he was 12, and that day his dad asked if we would sponsor him.\"We'd never taken on someone so young, but I saw something special in him and saying yes was easy.\"Littler is currently preparing for the World Series double-header in Bahrain and Saudi Arabia.No longer just a darts phenomenon but a star who transcends the sport - analysisBySam DruryBBC Sport journalistLuke Littler's impact on darts is hard to overstate.His run to the PDC World Championship final two years ago as a 16-year-old captured the imagination and helped create a new generation of darts fans.This latest deal shows that initial enthusiasm over Littler has remained, and even grown, as the teenager has gone on to dominate the sport.The prize money for the winner at the World Championship doubled to £1m this year and next the tournament will move from the West Hall to the larger Great Hall at Alexandra Palace, allowing an extra 70,000 spectators to attend across the competition.There can be little doubt that the emergence of Littler has played a part in both.He is no longer just a darts phenomenon but a sports star in the broader sense – and with this sponsorship deal, he is now getting paid as such.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Luke Littler signs record sponsorship deal worth reported £20m",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/de58/live/bcf803b0-ed5c-11f0-9afe-032419c395ec.jpg"
      ],
      "datePublished": "2026-01-09T13:45:19.000Z",
      "dateModified": "2026-01-09T13:45:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Two people wounded in shooting involving federal agents in Portland",
    "url": "https://www.bbc.com/news/articles/ckgn1y1zygxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c03b/live/c4d2bdd0-ecfa-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-09T02:51:30.000Z",
    "description": "Two people have been wounded in a shooting involving US federal agents in Portland, Oregon, say officials.The city's police department said in a state",
    "body": "Two people have been wounded in a shooting involving US federal agents in Portland, Oregon, say officials.The city's police department said in a statement that a man and woman had been taken to hospital and their conditions were unknown. The Department of Homeland Security (DHS) said the incident happened at 14:19 local time (22:19 GMT) with the traffic stop of a Venezuelan gang member, who \"attempted to run over\" agents with his car.The incident comes a day after a federal agent fatally shot a woman in Minneapolis, triggering protests around the US against federal law enforcement operations in US cities.\"The passenger of the vehicle and target is a Venezuelan illegal alien affiliated with the transnational Tren de Aragua prostitution ring and involved in a recent shooting in Portland,\" DHS said in a statement posted on X.\"When agents identified themselves to the vehicle occupants, the driver weaponized his vehicle and attempted to run over the law enforcement agents.\"Fearing for his life and safety, an agent fired a defensive shot. The driver drove off with the passenger, fleeing the scene.\"Portland Police said in their own statement that their officers were not involved in the incident, and were called after receiving reports of a shooting. The two people who were shot have not been identified, and police say they were discovered several blocks from the scene of the shooting.\"Officers applied a tourniquet and summoned emergency medical personnel,\" before they were taken to hospital, the statement said, adding that \"their conditions are unknown\".US media has cited police sources as saying the man and woman who were shot were a married couple. Portland District Attorney Nathan Vasquez, speaking from the scene of the shooting, told reporters he was there \"to monitor, to assist, and to make sure that there's a thorough and complete investigation\".He pledged to ensure \"that evidence is fully preserved and that - we're certainly hoping - that we can get all of the facts about what transpired here today\".His comments come after officials in Minnesota announced that the FBI would not include local investigators in their probe of the death on Wednesday of Renee Nicole Good, who was shot after officers alleged she attempted to run over agents. \"We are still in the early stages of this incident,\" said Portland Police Chief Bob Day on Thursday.\"We understand the heightened emotion and tension many are feeling in the wake of the shooting in Minneapolis, but I am asking the community to remain calm as we work to learn more.\"He told a news conference later the investigation into the incident in the Hazelwood neighbourhood was being led by the FBI.Portland Mayor Keith Wilson, a Democrat, called on Immigration and Customs Enforcement (ICE) to halt all operations in the city pending the investigation.\"We know what the federal government says happened here,\" he said. \"There was a time when we could take them at their word. That time is long past.\"He added: \"The administration is trying to divide us, to pit communities against each other. Portland, this is a moment to hold each other close.\"Portland has been the site of large anti-Trump protests in the past. On Wednesday night, Portland police arrested one protester who was charged with menacing after officers found him allegedly threatening another person with a knife.Lew Frederick, a Democratic state senator, told the BBC that local officials must be involved in the investigation into Thursday's shooting otherwise \"the community isn't going to trust that those results aren't impartial\".\"It's been clear for many weeks that there has been tensions increasing, and tense situations on the street,\" he said, referring to ongoing protests in the city against the Trump administration.\"And unfortunately, I do think, the, the resulting tragedy that occurred was foreseeable.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two people wounded in shooting involving federal agents in Portland",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c03b/live/c4d2bdd0-ecfa-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-09T02:51:30.000Z",
      "dateModified": "2026-01-09T02:51:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]