[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - (Another) Plan to Close Migrant Hotels - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mcbndg?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-10-28T19:41:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·28 Oct 2025,·34 mins(Another) Plan to Close Migrant HotelsNewscastAvailable for over a yearToday, hundreds of asylum seekers could be housed in two military sites in Inverness and East Sussex as the government seeks to end the use of hotels.\nMinisters are considering housing 900 men in the Cameron Barracks in Inverness and Crowborough army training camp in East Sussex. There are around 32,000 asylum seekers currently being housed in hotels. Adam and Chris discuss whether this will help with government’s pledge to end the use of asylum hotels by 2029.\nAnd, there are fears of mass killings as Sudan’s civil war appears to have reached a significant turning point. More than 150,000 people have died in the conflict across the country, and about 14 million have fled their homes. Adam is joined by chief international correspondent Lyse Doucet and Kholood Khair a Sudanese political analyst and director of Khartoum think tank Confluence Advisory.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers.\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Lucy Gape. The social producer was Joe Wilkinson. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - (Another) Plan to Close Migrant Hotels - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-10-28T19:41:00.000Z",
      "dateModified": "2025-10-28T19:41:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Americanswers…on 5 Live! Will Kamala Harris (and Donald Trump) run for president again? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mc3v1g?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-10-27T18:35:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·27 Oct 2025,·32 minsAmericanswers…on 5 Live! Will Kamala Harris (and Donald Trump) run for president again?AmericastAvailable for over a yearIt’s just over a year since the 2024 presidential election but attention is already turning to 2028 with both candidates from last year’s race expressing a desire to run again. Kamala Harris told the BBC over the weekend that she “wasn’t done” with public service, while Donald Trump said on Monday morning that he’d “love” to stand again for a third term. We answer your questions on whether Donald Trump plans to override the constitution for a third term in office, and whether he’d have support of the American public.\nMeanwhile, the president is back in construction, this time building a new ballroom at the White House, which has involved demolishing the 103-year-old East Wing in the process. We answer your questions on whether Trump is allowed to demolish parts of the White House and who’s actually paying for the changes. \nAnd, after Kamala Harris’s interview with the BBC, Justin and Anthony take a bit of time off air to chat through some of the issues she spoke about with Laura Kuenssberg and the circumstances surrounding Joe Biden’s eventual decision to withdraw from the election. \nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Anthony Zurcher, North America Correspondent\nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray with Grace Reeve. The technical producers were Jack Graysmark and Stephen Bailey. The series producer is George Dabby. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Americanswers…on 5 Live! Will Kamala Harris (and Donald Trump) run for president again? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-10-27T18:35:00.000Z",
      "dateModified": "2025-10-27T18:35:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-10-29T05:59:22.000Z",
    "description": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and p",
    "body": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-10-29T05:59:22.000Z",
      "dateModified": "2025-10-29T05:59:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Joe Swash: Forgotten Young Dads",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002l5hr?at_mid=IS4oPuz1uw&at_campaign=Joe_Swash_Forgotten_Young_Dads&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002l5hr&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Joe_Swash_Forgotten_Young_Dads&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0m8wnty.jpg",
    "tag": "Trending",
    "date": "2025-10-20T05:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeJoe Swash: Forgotten Young DadsJoe Swash: Forgotten Young DadsToo often dismissed, young dads across the UK are quietly redefining fatherhood. Joe Swash meets four men breaking stigmas and showing what it truly means to show up. Duration59 minsFirst shown8pm 20 Oct 2025Available for 11 monthsWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesBehind Bars: Sex, Bribes and MurderInside an illicit prison economy – fuelled by coercion and contrabandBlackmailed: The Sextortion KillersA sinister online underworld, and the devastating impact on its victims and families1hMissing in Paradise: Searching for SarmThe disappearance of Sarm Heslop. Was it a terrible accident, or something more sinister?Thailand: The Dark Side of ParadiseBeyond the golden beaches and bustling cities, Zara McDermott uncovers a riskier realityEastEnders Investigates: The ManosphereBehind the drama, an ugly truth. The devastating effects of misogyny and how to tackle it29 minsParanormalHaunting or hoax? Sian Eleri dives into the mystery of what was Wales' most haunted houseFresh CopsOn the front line of crime. The highs and lows of policing are all in a day’s workDear VivPaying tribute to drag royalty – the vivacious, the vibrant, The Vivienne59 minsConfessions of a Steroid GangThe dark side of self-improvement. Muscle, masculinity and a multi-million pound crimeSmall Town, Big RiotMobeen Azhar investigates what tipped a peaceful demonstration into a riot.Abused By My GirlfriendThe true story of Alex Skeel and the abusive relationship that left him days from death.50 minsLife and Death RowCapital punishment through the eyes of young people whose lives have been shaped by it.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Joe Swash: Forgotten Young Dads",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0m8wnty.jpg"
      ],
      "datePublished": "2025-10-20T05:00:00.000Z",
      "dateModified": "2025-10-20T05:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC 'deeply concerned' about journalist unable to leave Vietnam",
    "url": "https://www.bbc.com/news/articles/cvg70064d2vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/74b6/live/b84830c0-b444-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-28T22:27:22.000Z",
    "description": "The BBC said it was \"deeply concerned\" about the well-being of one its journalists who has been unable to leave Vietnam for several months.The Vietnam",
    "body": "The BBC said it was \"deeply concerned\" about the well-being of one its journalists who has been unable to leave Vietnam for several months.The Vietnamese national travelled to the country to visit family and renew their passport, but the document and their ID card have been withheld and they have been subjected to \"multiple days of questioning\", the corporation said in a statement.The BBC is urging Vietnamese authorities to allow the journalist to leave immediately and return to work by providing the renewed passport.It comes as general secretary of the Communist Party of Vietnam, To Lam, arrived in the UK on Tuesday, for a visit during which he is expected to meet Sir Keir Starmer.A Foreign Office spokesperson said the UK's \"position and track record defending media freedom is clear\".They added: \"We remain concerned by reported harassment of NGOs, journalists, and rights activists and communities in Vietnam and continue to raise these concerns directly with our Vietnamese counterpart.\"Vietnam is a one-party Communist state and has been one of south-east Asia's fastest-growing economies.But alongside its economic growth, the country has high levels of political censorship and a poor record on human rights.The Communist Party has a strong grip on the media in Vietnam. Media outlets and journalists risk sanctions and arrest for broaching sensitive topics and for criticising the government, while online content deemed to threaten Communist rule is blocked.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC 'deeply concerned' about journalist unable to leave Vietnam",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/74b6/live/b84830c0-b444-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-28T22:27:22.000Z",
      "dateModified": "2025-10-28T22:27:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hundreds of women allege sexual abuse during army medicals",
    "url": "https://www.bbc.com/news/articles/cn8v47dp4e4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e745/live/36991fa0-b037-11f0-a375-75de819286d1.jpg",
    "tag": "Trending",
    "date": "2025-10-29T07:57:42.000Z",
    "description": "19 minutes agoJonathan Beale,Defence correspondent and Christopher Mace,West of EnglandBBCOfficers are investigating allegations of sexual abuse datin",
    "body": "19 minutes agoJonathan Beale,Defence correspondent and Christopher Mace,West of EnglandBBCOfficers are investigating allegations of sexual abuse dating between the 1970s and 2016Hundreds of women who served in the British Army have come forward and alleged they were sexually abused while undergoing medical examinations during recruitment.Wiltshire Police is carrying out a nationwide investigation relating to medical checks carried out between the 1970s and 2016, which the Ministry of Defence says it is supporting fully.Defence sources have told the BBC medical examinations at the time were carried out by contracted doctors.The force said it was yet to identify suspects, but alleged abuse is thought to have taken place at multiple locations.Military police were first alerted to the allegations and handed the lead on the investigation to Wiltshire Police earlier this year, after the scale of the complaints became clear.Hundreds of women have already come forward with allegations of sexual abuse while undergoing medical examinations to join the Army.Wiltshire Police say their enquiries to date have revealed \"non-recent\" offending spanning several decades at various army locations.The Ministry of Defence has said it is alarmed by the allegations and praised those who have come forward for their bravery.The department also urged anyone with more information to contact Wiltshire Police.It is not yet clear whether this investigation will be expanded to include women who joined the Royal Navy and RAF.More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hundreds of women allege sexual abuse during army medicals",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e745/live/36991fa0-b037-11f0-a375-75de819286d1.jpg"
      ],
      "datePublished": "2025-10-29T07:57:42.000Z",
      "dateModified": "2025-10-29T07:57:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Woman left behind by cruise ship on Australian island found dead",
    "url": "https://www.bbc.com/news/articles/c62eww646wjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/36bc/live/aa670cc0-b457-11f0-a513-db66eea8f771.jpg",
    "tag": "Trending",
    "date": "2025-10-29T00:34:29.000Z",
    "description": "Australian authorities are investigating after an 80-year-old woman who was left behind on a Great Barrier Reef island by a cruise ship was found dead",
    "body": "Australian authorities are investigating after an 80-year-old woman who was left behind on a Great Barrier Reef island by a cruise ship was found dead.The woman had been hiking on Lizard Island, 250 km (155 miles) north of Cairns, with fellow passengers from the Coral Adventurer cruise ship on Saturday but is believed to have broken off from the group to have a rest.The ship left the island around sunset but returned several hours later after the crew realised the woman was missing. A major search operation found the woman's body on Sunday morning.The Australian Maritime Safety Authority (AMSA) said it is investigating and will meet the ship's crew when it docks in Darwin later this week.A spokesperson for AMSA said it was first alerted to the missing woman at around 21:00 local time on Saturday (05:00 GMT on Friday) by the ship's captain.The authority said it would work with other relevant agencies to investigate the case and that it takes the safety of passengers and crew onboard commercial vessels seriously.Coral Expeditions chief executive Mark Fifield said staff have contacted the woman's family and were offering support over the \"tragic death\".\"While investigations into the incident are continuing, we are deeply sorry that this has occurred and are offering our full support to the woman's family,\" Fifield said.The elderly Australian woman is understood to have joined a group hike to the island's highest peak, Cook's Look, before she decided she needed to rest, according to the Courier Mail.Traci Ayris was sailing near the island last weekend and told the Australian Broadcasting Corporation (ABC) that she saw a helicopter using a spotlight to search a walking trail on the island at around midnight on Saturday. She said about seven people with torches went to the island to search but it was called off at around 03:00 local time with a helicopter returning on Sunday morning when the body was found.\"We knew she was dead because they called everyone back from the search immediately,\" she told the ABC.\"And no-one went to the spot that the chopper was hovering over until later that day when the police arrived.\"Ayris said the incident was clearly distressing for crew and passengers.\"It was very sad in this paradise to have this tragedy occur. It should have been a happy time for that lovely lady.\"It is understood the woman was on the first stop of a 60-day cruise around Australia, with tickets costing in the tens of thousands of dollars for the journey.The Coral Adventurer caters for up to 120 guests with 46 crew, according to the company's website. It was purpose built to access remote areas of Australia's coast and is equipped with \"tenders\" - small boats used to take passengers on day excursions.Queensland police said a report will be prepared for the coroner in the \"sudden and non-suspicious death\" of the woman. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Woman left behind by cruise ship on Australian island found dead",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/36bc/live/aa670cc0-b457-11f0-a513-db66eea8f771.jpg"
      ],
      "datePublished": "2025-10-29T00:34:29.000Z",
      "dateModified": "2025-10-29T00:34:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "At least 64 killed in Rio's largest police raid on gangs",
    "url": "https://www.bbc.com/news/articles/c8x155engwpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f568/live/499421f0-b455-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-28T23:35:22.000Z",
    "description": "9 hours agoMimi SwabyGlobal affairs reporterAt least 64 people were killed in a police operation against the Red Command gang in Rio de Janeiro's nort",
    "body": "9 hours agoMimi SwabyGlobal affairs reporterAt least 64 people were killed in a police operation against the Red Command gang in Rio de Janeiro's northern suburbs - the largest and deadliest raid in the Brazilian state's history.Four police officers were among those killed during Operation Containment in the Alemão and Penha districts, state Governor Cláudio Castro said. More than 80 people were arrested.Fierce clashes erupted when about 2,500 security personnel moved in on Tuesday morning. The Red Command (Comando Vermelho) responded with gunfire, burning barricades and dropping bombs from drones, officials said. The UN Human Rights Office said it was \"horrified\" by the police operation, urging \"prompt and effective investigations\".The area of favelas near Rio's airport is considered to be the headquarters of one of Brazil's most powerful organised crime groups.State officials said at least 50 of those killed were \"indicated by police as suspected of being criminals\".Dozens of people were injured, including civilians caught in the crossfire.Locals have likened the hillside area - home to about 300,000 people - to a \"war zone\" since the operation began.Roads remain closed throughout the region.The Red Command group have been expanding their territory across the Rio state, increasing drug trafficking routes and control of the hillside favelas.Rio's police said more than 200kg (441lb) of drugs were seized in the raid, along with dozens of firearms.The joint operation by civil and military police comes after a year-long investigation.Dozens of the suspects are thought to be members of a faction from the Pará state who are currently hiding in Rio de Janeiro.Large-scale police operations are not uncommon in Brazil ahead of major international events in the South American nation. The UN climate summit COP30 is taking place in the northern city of Belem in November.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "At least 64 killed in Rio's largest police raid on gangs",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f568/live/499421f0-b455-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-28T23:35:22.000Z",
      "dateModified": "2025-10-28T23:35:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ben & Jerry's co-founder says Unilever blocked Palestine-themed ice cream",
    "url": "https://www.bbc.com/news/articles/c1lqeqv9j9no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fc4c/live/b3d3d5f0-b460-11f0-85b2-cb0a7dd6ae85.jpg",
    "tag": "Trending",
    "date": "2025-10-29T03:49:38.000Z",
    "description": "4 hours agoOsmond ChiaBusiness reporterThe co-founder of ice cream maker Ben & Jerry's says that its parent company Unilever blocked it from launching",
    "body": "4 hours agoOsmond ChiaBusiness reporterThe co-founder of ice cream maker Ben & Jerry's says that its parent company Unilever blocked it from launching an ice cream flavour that expressed \"solidarity with Palestine\".Ben Cohen announced that he will independently create the new flavour as part of a personal series highlighting causes the company has been barred from addressing publicly.Ben & Jerry's is known for its activism on social issues and has consistently spoken out on political, environmental and humanitarian matters - including the Israel-Gaza conflict.The BBC has contacted Unilever for comment.Mr Cohen's statement deepens the long-drawn dispute between the world-famous ice cream maker and Unilever, the British packaged goods giant which has owned Ben & Jerry's since 2000.The co-founders said Unilever and its ice cream arm Magnum, which is being spun off from its parent company, had unlawfully blocked their company from \"honouring its social mission\".Mr Cohen said in an Instagram video on Tuesday that he is creating a new watermelon-flavoured sorbet, calling for ideas for the product's name and what ingredients should be added.The watermelon has become a symbol for solidarity with Palestinians due to its colours, which are similar to those of the Palestinian flag – red, green, black and white. The American entrepreneur said Ben & Jerry's were prevented by Unilever from creating the dessert.\"I'm doing what they couldn't,\" Mr Cohen says from his set in a kitchen. \"I'm making a watermelon-flavoured ice cream that calls for permanent peace in Palestine and calls for repairing the damage that was done there.\"In 2021, Ben & Jerry's refused to sell its products in areas occupied by Israel. Its Israeli operation was sold by Unilever to a local licensee, allowing its ice cream to continue being sold in the occupied West Bank.The dessert series will be developed under Ben's Best, Mr Cohen's activist ice cream brand, he said in a statement to the press. The flavour is being produced independently of Ben & Jerry's, the statement said.Ben's Best was first setup in 2016 to support former US presidential candidate Bernie Sanders, with the flavour \"Bernie's Back\". Mr Cohen said he will develop other ice cream flavours that speak to the issues Ben & Jerry's was silenced from addressing publicly by Unilever.In September, co-founder Jerry Greenfield stepped down from Ben & Jerry's after decades at the company, citing concerns that its independence had been compromised following Unilever's decision to curb its social activism.At the time, Ben Cohen said that \"Jerry has a really big heart and this conflict with Unilever was breaking it.\"\"My heart leads me to continue to work inside the company to advocate for its independence so that it can actualise the social mission, the values that it was founded on and has maintained for over 40 years,\" he told the BBC's PM programme.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ben & Jerry's co-founder says Unilever blocked Palestine-themed ice cream",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fc4c/live/b3d3d5f0-b460-11f0-85b2-cb0a7dd6ae85.jpg"
      ],
      "datePublished": "2025-10-29T03:49:38.000Z",
      "dateModified": "2025-10-29T03:49:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Home Office has struggled to deal with crises, says Shabana Mahmood",
    "url": "https://www.bbc.com/news/articles/cp3d7ljx71do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/80dc/live/dda024b0-b43d-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-28T22:04:20.000Z",
    "description": "10 hours agoNick EardleyPolitical correspondentThe Home Office has failed to meet the challenge of \"crises\" it has faced over several years and is \"no",
    "body": "10 hours agoNick EardleyPolitical correspondentThe Home Office has failed to meet the challenge of \"crises\" it has faced over several years and is \"not yet fit for purpose\", the home secretary has told the BBC. Shabana Mahmood acknowledged that the department, which she was put in charge of last month, had \"a range of problems\" including procuring contracts and holding on to senior staff but said that she was \"determined to deliver\". Mahmood was talking to the BBC while overseeing a police operation on a high street in south London aimed at tackling migrants working illegally in the UK. She said a crackdown was \"starting to work\" adding that 8,232 people had been arrested for illegal working over the past year, a rise of 63%. The department is facing a plethora of challenges, including the housing of asylum seekers in hotels.  Mahmood said the Home Office \"obviously deals with emergency and crises issues on a regular basis, and I think over a long period of time has been found not to be able to rise to the scale of the challenge of those crises and those emergencies\".On the issue of illegal working, the home secretary said: \"It is clear that the enforcement of our rules has been lacking - and wasn't good enough or strong enough under the last government… The law hasn't kept pace with the changes to the ways in which people get work.\"She added: \"The numbers are still not where I want them to be. I want to go further and faster, but I think we've made progress, and the numbers at the moment are going in the right direction.\"The BBC spent two hours with officers carrying out spot checks on gig economy workers including delivery drivers. In that time, nobody was arrested for working illegally, although one man was detained for other offences.Ministers believe a crackdown on illegal working will help reduce pull factors that encourage people to enter the UK illegally and try to claim asylum.A report from MPs said this week that billions had been squandered on the hotels which accommodate asylum seekers and that urgent action was needed to reduce the bill.Mahmood confirmed she wanted to move some migrants to accommodation at army barracks in Inverness and East Sussex by the end of the year.She said: \"I know that asylum hotels are an absolute blight on our communities. I know that they've been the site of huge community tensions.\"We are working at pace to deliver new sites, I hope to be within two new military sites by the end of the year. Discussions are underway and well advanced in terms of planning for those moves.\"Mahmood did not say that the move would save the taxpayer money.Asked whether she might exercise a break clause in the government's contracts with the companies providing the hotels next spring, she said \"all options are on the table\".She added: \"I will need to look very carefully at the legal arrangements in those contracts and the options that are available to us and act in the best interests of our country, of our taxpayers as well.\"Some are sceptical the government will be able to find alternative accommodation to allow it to break the contracts.Mahmood's department has also faced intense pressure in recent weeks over other issues including the grooming gangs inquiry, the \"one in one out\" deal with France, small boats crossings and more.The home secretary said: \"It's obviously a department that has a range of problems… It obviously deals with emergency and crises issues on a regular basis, and I think over a long period of time has been found not to be able to rise to the scale of the challenge of those crises and those emergencies\".But she said she would work with Antonia Romeo, the new top civil servant in the department, to address those issues.Speaking on Monday, Conservative leader Kemi Badenoch said \"mistakes had been made\" in the Home Office under the previous Tory government but added that Labour's decision to scrap the Rwanda scheme - aimed at deterring asylum seekers from coming to the UK in small boats - had exacerbated illegal migration.\"Scrapping that scheme removed the deterrence, and meant that small boat crossings increased by 40%.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Home Office has struggled to deal with crises, says Shabana Mahmood",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/80dc/live/dda024b0-b43d-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-28T22:04:20.000Z",
      "dateModified": "2025-10-28T22:04:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hurricane Melissa: 'We are all terrified,' witnesses say in Jamaica",
    "url": "https://www.bbc.com/news/articles/c2drjx9r0l8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2e8e/live/42c145b0-b419-11f0-8af8-23f34058d4bc.jpg",
    "tag": "Trending",
    "date": "2025-10-29T00:35:51.000Z",
    "description": "8 hours agoJessica Rawnsley and Gabriela PomeroyGetty ImagesResidents and holidaymakers have described their terror as Hurricane Melissa pummelled Jam",
    "body": "8 hours agoJessica Rawnsley and Gabriela PomeroyGetty ImagesResidents and holidaymakers have described their terror as Hurricane Melissa pummelled Jamaica, the strongest storm to hit the Caribbean nation in modern history.Locals and tourists told the BBC how they hunkered down as the storm ripped roofs off buildings and cut power to about a third of the country's 2.8 million people.\"The doors are being blown off by the wind,\" said Kabien, a mother-of-three who runs a beauty salon in the town of Santa Cruz.With panic in her voice, she said: \"I am trying to use my own manpower to stop the wind blowing in the door.\"Follow live: Hurricane Melissa hits Jamaica with violent winds as authorities warn of 'catastrophic' floodingWhy Hurricane Melissa is so dangerousWatch: Strong winds and flying debris as Hurricane Melissa makes landfall\"There is water coming through the roof of the house,\" she said. \"I am not OK.\"Her three young children were \"very, very scared\", she added.Melissa made landfall on Tuesday afternoon in south-western Jamaica near the town of New Hope with wind speeds of 185 mph (295 km/h), according to the US National Hurricane Center (NHC).Originally a category five storm, it was downgraded to category three after it made landfall and swept across the island. Officials said it would continue to decrease in intensity, but remain extremely dangerous as it moves towards Cuba and then the Bahamas.Kyle Holmes, from Bolton, who is visiting Jamaica with his wife and young daughters, aged 7, 10, and 12, for a family wedding, told the BBC of the devastation wreaked by the storm.He said the hotel he was staying in - the Grand Palladium Resort, in the town of Lucea, half an hour from Montego Bay on the coast - looks like \"a disaster zone\".He said he barricaded the windows to the hotel room by placing all the furniture against them, and his family were safe after the \"worst experience ever\".Getty ImagesA man installs storm shutters in Portmore; preparations for Hurricane Melissa have been ongoing for days across JamaicaWinston Warren, who has been riding out the hurricane from inside his home in east Kingston, less than a kilometre from the ocean, told the BBC: \"There are times you just wonder - are the waves going to come crashing into your house.\"We've seen a lot of roofs blown off.\"Emma, who is on a family holiday in Jamaica from Essex, England, said the windows of their Montego Bay hotel had been smashed by high winds.\"We moved to a safe room as the children were petrified,\" she said. \"The windows have been blown through and the staff are working furiously to make us safe.\"We have all just moved to another room in the building as the glass in the lobby is unsafe. We are all terrified.\"Damion, a computer scientist living in Kingston, told the BBC he had woken on Tuesday to winds \"so strong you would not be able to stand up\" outside.Simon Johnson, 33, who lives in Harbour View in Kingston with his wife and two sisters, said the family had experienced hurricanes before - \"but not one of this size\".Living just 200m (650ft) from the harbour, he told the BBC he was \"feeling anxious\".They have stockpiled a week's worth of food, he added, but many of the supermarkets were empty and he could not find any bread in the neighbourhood.Getty Images'The birds have all gone'Officials warned people as the storm arrived to cover themselves with a mattress, move to an indoor room, and to wear a helmet if possible.Jamaican health officials also warned that flooding may displace crocodiles from their natural dwellings.Melissa is the strongest storm on record for the island nation - and the strongest globally this year.The NHC warned of \"catastrophic and life-threatening\" conditions once it landed in Jamaica, with torrential rainfall, deadly flash flooding and landslides.Three storm-related deaths were recorded on the Caribbean island, another three in Haiti and one in the Dominican Republic.Tourists in Jamaica described being \"stuck in limbo\" with the country's two international airports closed, flights cancelled and limited information from airlines.Rebecca Chapman, who travelled to Jamaica for her 25th wedding anniversary, said she had arrived on Thursday evening just as storm preparations began.She was staying in Lucea with her husband and their three teenage sons.\"The birds have all gone so it's all gone really quiet. It's like a ghost town,\" she told BBC Radio 4's Today programme before the storm hit on Tuesday.The Foreign Office has advised Britons in Jamaica to follow local authority advice, \"especially in the event of any evacuation orders\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hurricane Melissa: 'We are all terrified,' witnesses say in Jamaica",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2e8e/live/42c145b0-b419-11f0-8af8-23f34058d4bc.jpg"
      ],
      "datePublished": "2025-10-29T00:35:51.000Z",
      "dateModified": "2025-10-29T00:35:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Michelle Agyemang: England striker carried off on a stretcher in win against Australia",
    "url": "https://www.bbc.com/sport/football/articles/cx2nqqe5zdzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e701/live/f6cb9130-b443-11f0-a22b-d7545a1d4b2b.jpg",
    "tag": "Trending",
    "date": "2025-10-28T22:24:08.000Z",
    "description": "England manager Sarina Wiegman is \"not very positive\" about the injury to forward Michelle Agyemang, who was carried off on a stretcher with what appe",
    "body": "England manager Sarina Wiegman is \"not very positive\" about the injury to forward Michelle Agyemang, who was carried off on a stretcher with what appeared to be a knee injury during England's 3-0 win against Australia.Agyemang, 19, went down with an off-the-ball injury just 13 minutes after being brought on as a second-half substitute before being replaced by Chloe Kelly and left Pride Park on crutches.In her post-match news conference in Derby, Wiegman said she had not yet received any information on the injury but expressed concern. \"Of course it was an awful moment, it doesn't look good,\" she said. \"We don't know yet but I'm not very positive about what I've seen.\"Former Arsenal defender Jen Beattie said Wiegman's comments to the media were not a good sign.\"Sarina's comments said a lot because the manager will always be the first person that gets a little nod from the medical team. I think her whole demeanour spoke volumes,\" Beattie said on BBC Radio 5 Live.\"I don't want to speculate I just hope she's OK.\"Agyemang, who is currently on loan at Brighton from Arsenal, played a key role for the Lionesses in their Euro 2025 triumph.Goals from the bench in the quarter-final against Sweden and in the semi-final against Italy forced extra time and gave England a platform for victory.Her exploits in Switzerland led to her being nominated for the Kopa trophy, an award given to world's best under-21 female footballer.She has featured in five of Brighton's six Women's Super League games this season, starting each of those matches.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Michelle Agyemang: England striker carried off on a stretcher in win against Australia",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e701/live/f6cb9130-b443-11f0-a22b-d7545a1d4b2b.jpg"
      ],
      "datePublished": "2025-10-28T22:24:08.000Z",
      "dateModified": "2025-10-28T22:24:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What are the government's options on asylum seeker accommodation?",
    "url": "https://www.bbc.com/news/articles/c9d60ejn41wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/eaee/live/4cd5bb30-b40f-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-28T16:13:17.000Z",
    "description": "16 hours agoJack FenwickPolitical correspondentPA MediaWhere to house asylum seekers has become one of the fiercest topics of political debate since l",
    "body": "16 hours agoJack FenwickPolitical correspondentPA MediaWhere to house asylum seekers has become one of the fiercest topics of political debate since last year's general election.Ministers are considering housing 900 men in the Cameron Barracks in Inverness and Crowborough army training camp in East Sussex, as they seek to expand the use of military sites as an alternative to hotels. Small boat crossings have reached near-record levels and MPs on the Home Affairs Select Committee said the Home Office had squandered billions of pounds of taxpayers' money on asylum accommodation.The estimated cost of the government's 10-year asylum accommodation contracts has more than tripled, from £4.5bn to £15.3bn.Ministers inside the Home Office believe that ultimately this issue can only be solved by increasing removals of failed asylum seekers and deterring people from arriving on small boats in the first place.But while they attempt to implement policies to achieve those aims, the Home Office still has to find somewhere for the tens of thousands of people seeking asylum to stay.ArrivalWhen people arrive in the UK by crossing the Channel on small boats, they are generally sent to a processing centre at Manston in Kent.The site is located on the former RAF Manston base and was opened by the Home Office in February 2022 as a response to the increasing number of arrivals.Migrants are supposed to be held there for 24 hours, while officials carry out security and identity checks, but overcrowding has sometimes led to people being forced to stay on the site for weeks.In late 2022, thousands of migrants were placed in tents at Manston, leading to overcrowding and disease, including diphtheria.A Home Office inquiry is currently taking place into the conditions at Manston.The department is also seeking planning approval to improve the site and use it for processing asylum seekers into the 2030s.Initial accommodationAfter leaving Manston, asylum seekers are then sent to initial accommodation provided by the Home Office, while officials decide whether they are eligible for further support.These are supposed to be centres managed by specialist migrant help staff, but many asylum seekers are instead sent to hotels or hostels straight away.There are 1,750 places available in initial accommodation and the latest government data showed 1,665 of those places were occupied in June.Most asylum seekers will then be sent to longer-term accommodation, where they will stay while their asylum claim is being processed.Flats and HMOsUnder the contracts signed by the Home Office, asylum seekers are supposed to be housed in so-called dispersal accommodation.These are self-catered properties within communities and are usually local flats or houses in multiple occupation (HMOs), a type of rented accommodation where at least three individuals share the use of a bathroom and kitchen.The average cost of housing an asylum seeker in dispersal accommodation is £23.25 a night, making it by far the cheapest option.In 2019, the government signed 10-year contracts with three companies – Serco, Mears and Clearsprings – and tasked them with finding properties that can be used for dispersal accommodation.But since the number of small boat crossings began to rise significantly in 2022, there's been a shortage of this type of accommodation.Finding more of these properties became a big priority for the former Home Secretary Yvette Cooper and the latest government data shows that 66,234 people were in dispersal accommodation in June – around two-thirds of the total number of asylum seekers being housed.But the three companies tasked with finding these properties can make bigger profits from other types of accommodation – and the contracts drawn up by the Home Office don't include any penalties for the companies when they fail to hit their targets.Dispersal accommodation can impact local housing markets by effectively taking flats or HMOs out of general supply, something the Home Office acknowledges would cause frustrations within communities.Some concerns have been raised that protests targeting this type of accommodation could be difficult to police.HotelsHotels were only ever meant to be used as a stop-gap option when there was a temporary shortage of other accommodation.But increasing numbers of migrants crossing the Channel in small boats has meant hotels have become a regular, expensive and highly controversial feature of the UK's asylum accommodation system.They have led to soaring costs for the taxpayer and large profits for the three companies providing the accommodation.The average cost of housing an asylum seeker in a hotel is £144.98 a night, more than six times the price of dispersal accommodation.One of the reasons hotels are so much more expensive than other accommodation is because the asylum seekers being housed there are also given food.Under the contracts drawn up by the Home Office, providers are still paid even if the rooms are vacant.Asylum hotel use peaked under the Conservatives in September 2023 when 56,042 people were being housed.Latest government statistics show there were 32,059 asylum seekers being housed in hotels at the end of June – much lower than the peak, but 8% higher than when Labour came to power.The Home Office removed the need to consult local authorities about hotel use in 2020 and they've become lightning rods for protests.Sir Keir Starmer has pledged to end the use of hotels to house asylum seekers by 2029, but achieving that target will be a tough ask.Large sitesBoth Conservative and Labour governments have experimented with using larger sites to house asylum seekers.Hundreds of asylum seekers could be placed in disused military sites, as part of efforts to achieve the prime minister's pledge to end hotel use.Ministers hope to move asylum seekers into sites in Inverness and East Sussex by the end of next month, with discussions between the Home Office and the Ministry of Defence ongoing about other potential locations.The Home Affairs Select Committee has said that large sites such as these will not enable the government to drive down costs of asylum accommodation.The idea is also likely to be highly controversial in the local communities where the sites are chosen, but the Home Office hopes that military sites could act as a deterrent to people thinking of crossing the Channel.Disused military land has in the past been earmarked for housebuilding, but plans to build on these sites have repeatedly gone awry.The government has indicated that other disused sites such as empty tower blocks, student accommodation and industrial sites could also be used to house asylum seekers.What happens next?The government's contracts with Serco, Mears and Clearsprings run until 2029, but have break clauses which the government could trigger in March next year.Home Office ministers wanted to trigger break clauses in the previous set of contracts, but the department hadn't left itself enough time to plan for an alternative accommodation system.The housing department has been working with local councils to explore what that alternative system could look like.But some within the Home Office do not believe that an alternative would be ready by March and as recently as May, it was understood that there was no plan to trigger the break clauses next year.The Home Office needs to save £1bn from the cost of asylum accommodation by 2029, otherwise it may have to find cuts in other areas of its budget.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What are the government's options on asylum seeker accommodation?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/eaee/live/4cd5bb30-b40f-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-28T16:13:17.000Z",
      "dateModified": "2025-10-28T16:13:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Uxbridge triple stabbing: Dog walker killed and two injured",
    "url": "https://www.bbc.com/news/articles/c5ypkd57n97o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5d41/live/2be6de90-b496-11f0-88c2-2f88d87ba8c9.jpg",
    "tag": "Trending",
    "date": "2025-10-28T21:40:51.000Z",
    "description": "Dog walker dies in triple stabbing as arrest made11 hours agoJess Warren,BBC London and Aurelia Foster,BBC LondonFacebookWayne Broadhurst, who was nam",
    "body": "Dog walker dies in triple stabbing as arrest made11 hours agoJess Warren,BBC London and Aurelia Foster,BBC LondonFacebookWayne Broadhurst, who was named locally, died at the sceneA dog walker has died and another man has been seriously injured in a triple stabbing in west London.The 49-year-old, who has been named locally as Wayne Broadhurst, was treated by paramedics but died at the scene. A second man, 45, was hospitalised with life-changing injuries and a boy, 14, sustained non life-threatening or changing stab wounds, police said.An Afghan national, 22, was Tasered and arrested on suspicion of murder and attempted murder at Midhurst Gardens, Uxbridge, at 17:00 GMT on Monday.The Home Office confirmed the arrested man entered the UK in a lorry in November 2020, was granted asylum and leave to remain in 2022, and does not live in Home Office accommodation. He was taken to hospital as a precaution but has since been taken into police custody, the Met said.The attack is not being treated as terrorism, and detectives are working to establish any relationship between the suspect and the three victims, the Metropolitan Police said.George Tryfonidis/BBCEmergency services were called to Midhurst Gardens, Uxbridge, at 17:00 GMT on MondayOn Tuesday evening, about 100 people held a minute's silence by the cordon surrounding the scene.They applauded at the end and the group started to disperse shortly after.A large group of men, women and children laid flowers at the junction between Midhurst Gardens and Leybourne Road, and some lit candles.PA MediaCandles were lit and flowers were placed at the edge of the police cordonFootage posted online appeared to show the suspect walking along a residential street, before two police officers sprinted after him, one pointed a Taser and shouted \"drop the knife\" and \"get on the floor\".Several others joined them before the Taser was fired and the man fell to the ground.Ch Supt Jill Horsfall said: \"This was a shocking and senseless act of violence that has left one man dead and two others injured.\"Our thoughts are with the victim's family and friends at this unimaginably difficult time.\"PA MediaOne person was fatally stabbed and two were injured, the Met saidShe added: \"The incident will have understandably caused concern to the local community. \"I have deployed multiple officers to the local area, they will be here throughout the week to provide reassurance while detectives work intensely to piece together the circumstances.\"I understand that there has been a lot of speculation online following on from this incident. We ask that you rely on us for information, and that you do not share sensitive footage.\"The family of the deceased man have been told and are being supported by specially-trained officers, the Met said.PA MediaFlowers were left at the edge of the police cordonOn Tuesday, a neighbour in Uxbridge said the man who died was a bin man, and described him as \"the last person on Earth that you would think somebody would go for\".\"He's a bin man. I've been here two years and would see him walk past the window,\" she said.She added that on Monday he was \"just doing the normal dog walk he does every day.\"I still can't get over it. If he was five or 10 minutes later taking the dog out would the same thing have happened?\"She said she took some flowers and a box of shortbread over for his wife.\"Everybody's scared\", says Uxbridge resident after triple stabbingFour bunches of flowers were left near the police cordon, one of which was placed by a female neighbour from a nearby road who did not wish to be named.She said: \"Last night the police came down my road... I thought to myself 'oh my God I wonder what's happened'.She said she found out what happened early on Tuesday which made her feel \"absolutely sick\".She added: \"The area used to be lovely, over the years it's really gone downhill.\"I just thought I'd come down and put some flowers down for the family.\"'Horrendous'Another woman, who did not want to share her name, told BBC News: \"The man that was stabbing random people chased after two of my son's friends but they managed to escape.\"It's horrendous and just on our doorstep. It's frightening - my daughter couldn't sleep last night because she thought the man was going to come and attack her.\"Robin Stevens, 50, who lives on the other side of Midhurst Gardens, said he heard a lot of sirens on Monday evening and he found out what happened on Tuesday morning.He said he was \"shocked\", adding: \"I grew up on this street, I've lived on this street for 50 years and I've always known it to be quite a family orientated area.\"Wisam Salah, 18, who lives near the cordon, said \"everyone is really panicked\" after the incident.A Home Office spokesperson offered sympathies to those impacted by the \"horrific incident\" and are being updated by the Met as the investigation continues.\"The priority must now be for the police to investigate so those responsible can be brought to justice,\" they added.Anyone who saw or has information about the incident are asked to contact police.Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Uxbridge triple stabbing: Dog walker killed and two injured",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5d41/live/2be6de90-b496-11f0-88c2-2f88d87ba8c9.jpg"
      ],
      "datePublished": "2025-10-28T21:40:51.000Z",
      "dateModified": "2025-10-28T21:40:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]