[
  {
    "title": "The best albums and songs of 2025: Unexpected comebacks and operatic pop",
    "url": "https://www.bbc.com/news/articles/c9w7qgpnv14o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c893/live/9de13d30-db31-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-21T00:26:17.000Z",
    "description": "1 day agoMark Savage,Music correspondentandLola Schroer,Entertainment reporterBBC / Press / Getty ImagesThe year's biggest artists included (L-R): Ros",
    "body": "1 day agoMark Savage,Music correspondentandLola Schroer,Entertainment reporterBBC / Press / Getty ImagesThe year's biggest artists included (L-R): Rosalía, Jarvis Cocker, PinkPantheress, Bad Bunny and Addison RaeSongs about love, sex, tax and demon hunters ranked among the best music of 2025, according to a \"poll of polls\" conducted by BBC News.We compiled more than 30 end-of-year lists from leading music publications to come up with a \"super-ranking\" of the year's best albums and singles, with artists including Pulp, Lady Gaga and Chappell Roan joined by newcomers like pop singer Addison Rae and indie band Geese.In total, the critics named more than 200 records among their favourites, although the year's biggest-sellers failed to impress them.Taylor Swift's blockbuster album The Life Of A Showgirl only picked up a handful of nominations. The year's biggest single, Alex Warren's Ordinary, appeared in just one list of 2025's best songs.Instead, critics selected music that shifted the tectonic plates of pop... Here's a guide to their favourites.The 10 best albums of 202510) Addison Rae – AddisonAfter a shaky start in 2021, Addison Rae's music career took flight with this collection of shimmering, trance-like hymns to desire. The desire for touch, the desire for fame, the desire for inner peace.Unlike most modern pop albums, it's the work of just three people, with Rae and her collaborators Elvira Anderfjärd and Luka Kloser establishing a stylish, spacey and occasionally off-kilter sonic palette all of their own.Singles like Diet Pepsi and Headphones On felt simultaneously classic and futuristic, marking Rae out as pop's newest It Girl.Listen to Diet Pepsi: Sensual, hypnotic and calorie-free pop.9) Lily Allen – West End GirlHell hath no fury like a Lily Allen scorned.West End Girl is a savage and startlingly detailed portrait of a marriage being torn apart. Allen says some of the details have been exaggerated, but her pain is tangible amongst the artful pop beats and faux insouciance.The dirty laundry triggered an avalanche of press coverage when the album arrived in November, but the songs have lingered as everyone remembers just how well Allen can craft an intoxicating pop hook.Listen to Madeline: Where Allen confronts her partner's mistress, and recreates their texts.Lily Allen is 'vicious' and 'raw' on tell-all album8) Pulp – MorePulp's first album since 2001, More, somehow manages to sound as if it was recorded and shelved in their mid-90s heyday.The lyrics are the only giveaway that this is the work of a band in their late middle age - as Jarvis Cocker sings movingly about stagnation, divorce and mortality. \"You've gone from all you that could be to all that you once were,\" he laments on Slow Jam.Yet, at 62, he remains stubbornly committed to the transformative power of love. And the reception Pulp received at Glastonbury this summer went a long way to proving him right.Listen to Spike Island: A spiritual sequel to 1995's Sorted for E's & Wizz. Pulp reveal first album in 24 years7) Dijon – BabyWhat a wild year it's been for Dijon Duenas. After contributing to Bon Iver's Sable, Fable and Justin Bieber's acclaimed comeback, Swag, he scored two Grammy nominations for his second album, Baby.It's a dazzling, harmony-rich R&B record, that channel-hops between genres and moods like a television tuned to the twin spirits of Prince and D'Angelo.The album's central theme is the ecstasy and chaos of fatherhood, with Dijon addressing the title track to his firstborn, then imploring his wife to expand the family on the subtly-titled Another Baby! Sleepless nights have never sounded so good.Listen to Yamaha: A swirling 80s funk groove allows Dijon to submerge himself in the bliss of enduring love.6) FKA Twigs – EusexuaEusexua, FKA Twigs has said, is a word that describes \"the tingling clarity\" you get when you're struck by a new idea, when you kiss a stranger, or even \"the moment before an orgasm\".The album attempts to recreate that feeling with a series of abstract, futuristic soundscapes and deconstructed club tracks. Echoing Madonna's Ray of Light (most notably on Girl Feels Good), the hooks are as sharp as the dopamine is addictive.Listen to Girl Feels Good: A visceral ode to empowerment, femininity and healing on the dancefloor.5) CMAT - Euro-CountryCoronation Street! Social anxiety! Late stage capitalism! Jamie Oliver! Grief! Road rage!It's all there on Euro-Country, a riotously enjoyable romp through Ciara Mary-Alice Thompson's inner monologue. Along the way, she tackles everything from male suicide to the impossible beauty standards that had her \"trying to wax my legs with tape\" at the age of nine.Listen to Jamie Oliver Petrol Station: The only song of 2025 to address the need for tolerance through the prism of service station fast food.CMAT: I still face abuse over viral song4) Oklou – Choke EnoughFrench artist Oklou – aka Marylou Mayniel – described her debut album as a \"quest for meaning, of the need to be touched by anything\" in a world where our interactions are stripped of humanity and flattened onto a screen.Co-produced by Charli XCX collaborators AG Cook and Danny L Harle, it couldn't sound less bratty if it tried. It's an album of intimate, gauzy pop, almost entirely drumless and built around hypnotic musical loops that short-circuit your emotions. Unplug and absorb.Listen to Blade Bird: The album's swooning climax, based on a Basque poem about the tension between love and possession.3) Bad Bunny - Debí Tirar Más FotosHe might be Spotify's most-played artist of the year, but Puerto Rico's Bad Bunny makes no concessions to commercial trends. His sixth album is a jubilant love letter to the music of his homeland, mixing traditional genres like plena, salsa and bomba with the hip-swaying pulse of reggaeton.The irresistible grooves dare you not to get up and dance, while the lyrics agonise about gentrification and capitalism stealing the island's old magic. Listen to DtMF: A lament for the loved ones he's lost, the album's title track translates as, \"I should have taken more photos\".Why Bad Bunny is refusing to tour the US2) Geese – Getting KilledA savage and unpredictable record, Getting Killed was apparently recorded in just 10 days. It finds the four members of Brooklyn-based Geese patchworking the best bits of Radiohead, the Strokes, Captain Beefheart and the Velvet Underground into something entirely new and unpredictable.Frontman Cameron Winter anchors the chaos with his singular warble, and lyrics that swerve wildly between irreverence and incisiveness. Listen to Taxes: Defiant, taut and full of swagger, Winter chants: \"If you want me to pay my taxes / You'd better come over with a crucifix.\"1) Rosalía - LuxIf music brings us closer to God, Rosalía wants her music to bring God closer to us. The Spanish singer's fourth album is an exhilarating - and profoundly moving - exploration of the human condition, that asks why the earthly and the holy have to be so far apart.It's a monumental work. She devoted an entire year to the lyrics alone, singing in 14 languages, over music that sits at the lesser explored intersection of classical, flamenco and avant-pop.In an interview with the New York Times, Rosalía agreed she was \"demanding a lot\" from listeners, \"but I think that the more we are in the era of dopamine, the more I want the opposite\".Accordingly, it's an album that reveals fresh new treasures on every listen, as Rosalía argues we're all capable of grace and beauty. We just have to open our hearts.Listen to Reliquia: As staccato strings are sucked into a vortex of electronic distortion, Rosalía sings about the sacrifices she's made for art and love, and concludes it's better to contribute to the world than take from it.Radical and Riveting: Rosalía's Lux reviewedThe 10 best singles of 2025Getty ImagesGhanaian-American singer Amaarae was recognised for her single SMO10) Wednesday - Elderberry WineThere's a sense of unease bubbling under this gentle indie rock song, as though singer Karly Hartzman is perpetually on the brink of divulging an uncomfortable truth. Built around the metaphor of elderberries, a fruit that can heal or poison depending on how it's handled, the song captures the tension of staying in a relationship you know is toxic. 9) Kehlani - FoldedIntroduced by nostalgic strings, Folded became Kehlani's first Top 10 hit in her native US, blending classic R&B themes of heartbreak and longing with modern production. Using the simple act of folding an ex-lover's clothes as jumping off point, Kehlani captures the  emotional push-and-pull of saying goodbye.8) Addison Rae - Headphones OnAddison Rae is a student of pop, and Headphones On is her master thesis – a hymn to music that whisks you away from the world for three minutes of distracted, hypnotic solace.7) Amaarae - SMOA seduction, a come-on, a hedonistic exploration of physicality. \"Ginga me,\" Amaarae sings repeatedly over a throbbing electro groove - invoking both the Nigerian pidgin term \"ginger me\", which means something like \"excite me\", and ginga, the fluid, hip-swaying footwork of the Brazilian martial art Capoeira. You'll succumb and you'll enjoy it.6) Bad Bunny - Baile InolvidableThis boisterous, captivating salsa was recorded live with student musicians from Puerto Rico's Escuela Libre de la Música (take that, AI). But the celebratory atmosphere masks a broken heart, as Bad Bunny is reminded of the ex who taught him to dance. \"I thought I'd grow old with you,\" he laments.NetflixK-Pop Demon Hunters' effervescent soundtrack was a breakout hit 5) Huntr/x – GoldenSometimes a song escapes its origins and goes into orbit. Golden was the last song written for Netflix's hit animation K-Pop Demon Hunters, but its soaring chorus became an anthem for anyone striving to achieve their dreams. An Oscar nomination beckons.4) Chappell Roan - The SubwayTwo things you can expect from Chappell Roan are theatricality and emotional honesty. The Subway delivers both, becoming a map of loss that carries listeners through a breakup on the streets and subways of New York - capturing that confusing limbo of experiencing grief and loneliness, surrounded by hundreds of strangers.3) Lady Gaga - AbracadabraA triumphant return to the sound of her debut album, Abracadabra takes all the Lady Gaga tropes – Nonsense lyrics! Demonic synths! Gothic choruses! – and dials them up to 11. An absolute banger.2) Olivia Dean - Man I NeedOlivia Dean says Man I Need is a song \"about knowing how you deserve to be loved and not being afraid to ask for it\". The object of her affections just needs a nudge in the right direction, and this playful, soulful melody should easily set the romance on track.1) PinkPantheress - IllegalOne of pop's most overused clichés is that falling in love is intoxicating, just like drugs! So it's a credit to PinkPantheress that she's made the idea sound fresh – zoning in on the fraught awkwardness of hooking up, whether it's with a dealer or a potential new partner. \"It feels illegal,\" she frets, as her heartbeat races with the drumbeat of this smouldering dance-pop anthem.The methodologyBBC News compiled more than 30 year-end lists published by the world's most influential music magazines and critics - including the NME, Rolling Stone, Spain's Mondo Sonoro and France's Les Inrockuptibles.Records were assigned points based on their position in each list - with the number one album or single getting 20 points, the number two album receiving 19 points, and so on.The results were the closest we've ever seen. Just 52 points separated Rosalía's Lux from the number two album, Geese's Getting Killed. In the singles countdown, PinkPantheress was the runaway winner - but the rest of the field was tightly packed, reflecting a year where there haven't been many universally popular, culturally dominant songs.The publications we surveyed included: Albumism, Billboard, Buzzfeed, Clash, Complex, Consequence of Sound, Dazed, Daily Mail, Dork, Double J, Entertainment Weekly, Exclaim!, The Fader, Flood, The Forty Five, Gorilla vs Bear, The Guardian, Independent, LA Times, Les Inrocks, Line of Best Fit, MOJO, Mondo Sonoro, NME, New York Times, Paste Magazine, Pitchfork, Pop Matters, Rolling Stone, The Skinny, Slant, Stereogum, The Telegraph, Time Magazine, Time Out, The Times, Uncut and Vulture.Picture credits for the numbered images, in the 10-1 order shown: Columbia Records, BMG, Rough Trade, R&R / Warner, Atlantic Records, CMATBaby / AWAL, True Panther Sounds, Rimas Entertainment, Partisan / PIAS, Columbia Records.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The best albums and songs of 2025: Unexpected comebacks and operatic pop",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c893/live/9de13d30-db31-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-21T00:26:17.000Z",
      "dateModified": "2025-12-21T00:26:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Best Bits of Newscast's Podcast-a-Thon (Part Two) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mpq6t5?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-21T12:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·21 Dec 2025,·38 minsThe Best Bits of Newscast's Podcast-a-Thon (Part Two)NewscastAvailable for over a yearToday, we’re bringing you some of the best bits from Newscast’s 25-hour Podcast-A-Thon!\nBack in November, Adam was challenged by Pudsey Bear to record a 25-hour long episode of Newscast in aid of Children In Need. Members of the Newscast family dropped by throughout the day and night to cheer Adam on. Including when Laura and Paddy met Pudsey, voice coaching with Chris and a midnight snack session with Lyse Doucet chatting about how she spends her down time with her family in Canada. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Best Bits of Newscast's Podcast-a-Thon (Part Two) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-21T12:00:00.000Z",
      "dateModified": "2025-12-21T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Global News Podcast - First batch of Epstein files released - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mpt4lc?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mpt4ml.jpg",
    "tag": "Trending",
    "date": "2025-12-20T04:51:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·20 Dec 2025,·31 minsAvailable for 88 daysAfter months of political wrangling, parts of the long-awaited Epstein files have been released by the US Justice Department. The trove consists of thousands of documents related to the late sex-offender. Pictures include the former US President Bill Clinton, Andrew Mountbatten-Windsor - Britain's former prince, musicians Mick Jagger and Michael Jackson. Being named or pictured in the files is not an indication of wrongdoing. The justice department did not release all existing files, and the published ones were heavily redacted, prompting frustrated reactions from survivors of Epstein's abuse.\nAlso: the US carries out dozens of strikes against the Islamic State group in Syria. Anti-government youth protesters in South Korea are taking cues from the American right's MAGA movement. Italy announces a fee for tourists to visit the Trevi Fountain in Rome. Putin vows revenge on Ukraine after an oil tanker was blown up in the Mediterranean Sea. Palestinians tell the BBC they were sexually abused in Israeli prisons. And how a lost radio play by Tennessee Williams was found more than four decades after his death, and has now been heard for the first time.\nThe Global News Podcast brings you the breaking news you need to hear, as it happens. Listen for the latest headlines and current affairs from around the world. Politics, economics, climate, business, technology, health – we cover it all with expert analysis and insight.\nGet the news that matters, delivered twice a day on weekdays and daily at weekends, plus special bonus episodes reacting to urgent breaking stories. Follow or subscribe now and never miss a moment.\nGet in touch: globalpodcast@bbc.co.ukProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Global News Podcast - First batch of Epstein files released - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mpt4ml.jpg"
      ],
      "datePublished": "2025-12-20T04:51:00.000Z",
      "dateModified": "2025-12-20T04:51:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man arrested after two teens die in car crash with tree near Oxted",
    "url": "https://www.bbc.com/news/articles/c9d9221422zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2a5e/live/d7198a70-d9a2-11f0-adaa-f3e2bb1c1ebb.jpg",
    "tag": "Trending",
    "date": "2025-12-21T15:23:22.000Z",
    "description": "Arrest after two teenagers die in car crash with tree10 hours agoCraig BuchanSouth EastGetty ImagesPolice were called to Holland Road in the Hurst Gre",
    "body": "Arrest after two teenagers die in car crash with tree10 hours agoCraig BuchanSouth EastGetty ImagesPolice were called to Holland Road in the Hurst Green area of OxtedTwo teenage men have died after a car crashed into a tree, police said.Surrey Police said officers were called to reports of a serious crash involving a white Tesla on Holland Road, near the junction with Popes Lane, in the Hurst Green area of Oxted shortly before 22:00 GMT on Saturday.A 30-year-old man from Oxted was arrested on suspicion of causing death by dangerous driving and causing serious injury by dangerous driving.One teenager died at the scene and the second died later in hospital, said the force. A third teenage man remains in hospital with \"life-threatening injuries\".Surrey Police said the driver of the Tesla was taken to hospital with serious injuries.Holland Road was closed between the Popes Lane junction and the junction with Warren Lane while officers carried out enquiries on Sunday.Police urged witnesses and anyone with relevant dashcam footage to get in touch.Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man arrested after two teens die in car crash with tree near Oxted",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2a5e/live/d7198a70-d9a2-11f0-adaa-f3e2bb1c1ebb.jpg"
      ],
      "datePublished": "2025-12-21T15:23:22.000Z",
      "dateModified": "2025-12-21T15:23:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "King's Foundation chair and nominee peer admits 'misleading' doctorate claim",
    "url": "https://www.bbc.com/news/articles/cnv299l3zrno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0126/live/9a8f10a0-de81-11f0-b6eb-fb9209f47010.jpg",
    "tag": "Trending",
    "date": "2025-12-21T19:33:59.000Z",
    "description": "The chair of the King's Foundation Dame Ann Limb has admitted being \"misleading\" about her doctorate qualification.The education specialist, who was r",
    "body": "The chair of the King's Foundation Dame Ann Limb has admitted being \"misleading\" about her doctorate qualification.The education specialist, who was recently nominated for a life peerage by Labour, told the Sunday Times that she had not completed a PhD at the University of Liverpool, despite this appearing on her since-amended CV.\"To be completely upfront and honest about it, I never completed my PhD at Liverpool University,\" she told the newspaper, adding that she used the Doctor title because she had been conferred with honorary PhDs by other institutions.The BBC has contacted Dame Ann for comment. The King's Foundation declined to comment.Dame Ann was among nominees to the House of Lords announced by Downing Street earlier in December, having held a number of senior public and private roles.The King's Foundation - which offers courses in practical skills to young people - announced last week that she would be stepping down from her role as chair, which she had held since January, to become a peer.An old version of her online CV, seen by the BBC, refers to her with the \"Dr\" honorific and lists a PhD from the University of Liverpool  in 1978 as among her qualifications.She was referred to as Dr Ann Limb by the City & Guilds Foundation, which she also chairs, in 2020, and in the Queen's Birthday Honours list announcing her damehood in 2022.However, a new version of her CV - made in July 2024 - omits the Dr honorific and the supposed 1978 PhD, stating that she received honorary PhDs from Anglia Ruskin University and the University of Northampton.Her website still says that she began her teaching career in further education \"whilst undertaking a PhD at the University of Liverpool\".She told the Sunday Times: \"I have used the word 'Doctor'... because I have got several honorary PhDs and that's been clear to me that they're honorary.\"Perhaps my own website is not very helpful, I don't pay a lot of attention to it, but if there's anything misleading... on that I'm very happy to correct [it].\"The newspaper also reported she claimed to have gained an MA from the Institute of Linguistics, which she also admitted was untrue.Recipients of honorary doctorates tend not to use the Dr honorific despite technically being able to out of deference to those who have undertaken the academic work to receive a PhD. When approached for comment, a No 10 spokesperson directed the BBC to a document listing the reasons why Dame Ann had been nominated for a peerage.That document notes she has been the chair or non-executive director of several public, private and charity bodies.Dame Ann grew up in Moss Side in Manchester and is currently the pro-chancellor of the University of Surrey and chair of institutions including the Lloyds Bank Foundation.She was made a dame for services to young people and philanthropy, having spent much of her career in higher education.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "King's Foundation chair and nominee peer admits 'misleading' doctorate claim",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0126/live/9a8f10a0-de81-11f0-b6eb-fb9209f47010.jpg"
      ],
      "datePublished": "2025-12-21T19:33:59.000Z",
      "dateModified": "2025-12-21T19:33:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'No coherent plan for social mobility' and Strictly fix claim 'boshed'",
    "url": "https://www.bbc.com/news/articles/c2epy807plwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/526a/live/4a2d9330-ded0-11f0-b67b-690eb873de1b.png",
    "tag": "Trending",
    "date": "2025-12-22T00:57:35.000Z",
    "description": "13 minutes agoThe Guardian leads with an interview with the government's social mobility commissioner, Alun Francis, in which he says that the governm",
    "body": "13 minutes agoThe Guardian leads with an interview with the government's social mobility commissioner, Alun Francis, in which he says that the government lacks an \"overarching narrative\" to pull various social mobility policy strands together and urges Sir Keir Starmer to set out a clearer strategy. It also features a photo of people celebrating the winter solstice at Stonehenge.The Times also features a photo from the winter solstice, above a story reporting that Health Secretary Wes Streeting has suggested that the UK should join a customs union with Europe, despite Prime Minister Keir Starmer ruling out a change in policy. The Daily Mirror leads with a story on how a poll shows that ex-Strictly Come Dancing contestant Thomas Skinner's \"legal threat\" over his Strictly exit has \"taken a hit\" after a new poll suggests he was the least-popular dancer. It follows reports Skinner is suing the BBC over claims the vote was rigged against him. The BBC has rejected the allegation, saying Strictly's public vote was \"independently overseen and verified to ensure complete accuracy\".The Daily Mail leads with an investigation on how \"criminal migrants\" are reportedly avoiding justice by being smuggled out of the UK in lorries. It focuses on an Albanian man who the paper reports has been running a network helping people flee for £2,500.The i leads with a story on how almost 7,000 care home residents in England were told their contracts were being terminated with just 28 days notice last year.The Financial Times leads with a story on how UK firms attracted interest from international buyers eager to capitalise on cheap valuations this year. Overseas bidders agreed $142bn in takeovers of UK companies, according to data from the London Stock Exchange Group - a 74% rise from 2024.The Sun reports that Princess Beatrice will not join her \"scandal-hit dad\", Andrew Mountbatten-Windsor, for Christmas this year and will go skiing with friends instead. Andrew has faced years of scrutiny over his past friendship with convicted paedophile Jeffrey Epstein. He has repeatedly denied any wrongdoing in relation to Epstein.The Daily Telegraph leads with a story on how the new head of the equalities watchdog has criticised people who describe migration as a risk to the UK. It also has a story on how trail hunting will be banned in what the paper calls Labour's \"war on the countryside\". The Daily Express speaks to a woman who is calling for child abuse \"monsters\" to be named on a national register. Paula Hudgell's adopted son, Tony, was \"horrifically injured\" by his birth parents, the paper reports.And the Daily Star says it has \"teamed up\" with Kenyan darts star David Munyua. The paper has sponsored his shirt for his next clash in World Darts Championship.Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'No coherent plan for social mobility' and Strictly fix claim 'boshed'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/526a/live/4a2d9330-ded0-11f0-b67b-690eb873de1b.png"
      ],
      "datePublished": "2025-12-22T00:57:35.000Z",
      "dateModified": "2025-12-22T00:57:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Epidural kit shortage could last until March, regulator says",
    "url": "https://www.bbc.com/news/articles/c5ydznpyj58o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a4fd/live/c1a59f80-deb1-11f0-8ce7-9dd1e62bbc74.jpg",
    "tag": "Trending",
    "date": "2025-12-21T22:03:36.000Z",
    "description": "3 hours agoSharon BarbourHealth correspondentA shortage of epidural kits in the UK is expected to last until at least March, the government's medicine",
    "body": "3 hours agoSharon BarbourHealth correspondentA shortage of epidural kits in the UK is expected to last until at least March, the government's medicines regulator has warned.The Medicines and Healthcare products Regulatory Agency (MHRA) told healthcare providers in a patient safety alert earlier this month that the shortage followed manufacturing issues concerning epidural bags.Hospitals are being sent substitutes bags for the pain relief drug given to women in labour, while the Royal College of Anaesthetists is working with the NHS to advise hospitals on how to manage the situation.Medical staff have expressed concern about these plans, the BBC understands, though the NHS said women \"should come forward for care as usual\".The shortage arose after a major supplier stopped making epidural infusion bags, it is understood.The MHRA alert on 2 December said there was a \"range of alternative\" bags available during the \"affected period\", which will require a \"trust-wide approach to ensure safe implementation\".Hospitals are being sent substitutes - but these have higher drug doses and so need very careful managing.All trusts have been asked to create teams that ensure mother-and-baby safety.But hospital staff, pharmacists and anaesthetists - who administer epidurals to women during labour - have expressed concerns over the plans.The head of the Birth Trauma Association, Dr Kim Thomas, argued that \"there hasn't been enough communication\" on how to put together these teams.\"Leaving trusts to manage a situation like this is very unfair, because you're going to get different responses in different trusts,\" she explained. \"It's going to mean added stress and added work for staff who are already overworked particularly at this time of year.\"An NHS spokesperson said: \"The safety of women in the care of NHS maternity services remains a top priority.\"They added: \"There are a range of alternatives available and trusts are also sharing supplies with other nearby trusts where appropriate.\"Additional reporting by Hafsa Khalil",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Epidural kit shortage could last until March, regulator says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a4fd/live/c1a59f80-deb1-11f0-8ce7-9dd1e62bbc74.jpg"
      ],
      "datePublished": "2025-12-21T22:03:36.000Z",
      "dateModified": "2025-12-21T22:03:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Singing at school shouldn't just be for Christmas, teachers say",
    "url": "https://www.bbc.com/news/articles/c157de198k1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0db1/live/984e50f0-dc27-11f0-89ae-89110b9e802d.jpg",
    "tag": "Trending",
    "date": "2025-12-22T00:03:39.000Z",
    "description": "1 hour agoKate McGoughEducation reporterDan Nelson / BBCMany children find themselves singing at school in the run up to Christmas - at a nativity pla",
    "body": "1 hour agoKate McGoughEducation reporterDan Nelson / BBCMany children find themselves singing at school in the run up to Christmas - at a nativity play or carol concert, often with parents watching proudly on.But new data suggests singing is a much less common occurrence throughout the rest of the school year, especially after pupils leave primary school.Now, an association of music teachers says every school should have a choir, to help pupils embrace music after a years-long decline in its popularity as a GCSE subject.The government says it is investing in high quality music teaching and that a \"renewed curriculum\" will encourage more people to study it.In a recent survey, Teacher Tapp asked just under 10,000 teachers in England how often their whole school sang together in assembly. Over half of state secondary school teachers (57%) said their pupils never sang together in assembly, while just 13% of private secondary school teachers and only 4% of primary teachers said the same. Teachers were separately asked whether their schools had a choir. Just over a third (36%) of teachers at state secondaries reported having no choir at their school, compared to just 8% of private school secondary teachers.Having access to multiple school choirs was much more common at private schools, with three quarters (77%) of private secondary teachers saying their school had more than one choir, compared to 27% of state secondary teachers.Jackie Bowen, head teacher at The East Manchester Academy, says secondary school pupils can feel \"embarrassed - or that maybe it's not cool to sing like it was in primary school\".But she says singing and music are priorities at the school.Dan Nelson / BBCJackie Bowen says music is part of the fabric of school life for her pupils\"We know the intrinsic value of music, but also what it does for students' development, mental health, its impact on academic achievements,\" she says. \"So we've run lots of initiatives to try and break down barriers to music.\" The school offers a music hub at the school once a week, offering pupils time with specialist teachers from the Royal Northern College of Music. At lesson changeover, students hear classical music instead of the traditional bell. The school has also established its first gospel choir. Year 11 student Mercy, who's part of the choir, says she always wanted to continue singing at secondary school.\"In primary they say you have to sing, but when you come to secondary it's a choice, so most people don't do it,\" she says. \"I feel like we should all release our voices to the world. Whether you're good or not, just sing.\"Kate McGough / BBCMercy is part of her school's gospel choir and says she enjoys singingThere has been a 25% drop in pupils studying GCSE music at schools in England over the last fifteen years, despite an uptick in the most recent stats. That is partly down to the introduction of a progress measure for schools called the English Baccalaureate in 2010, which assessed schools based on how many pupils took English, maths, sciences, geography or history and a language - and how well they performed.The government recently announced that it would be changing the school curriculum in England to make it easier for more schools to offer arts subjects like music.There has been some improvement in recruiting new music teachers this year, but the levels still fall 35% short of government's target for trainee music teachers in the most recent stats.James Manwaring, president of the Music Teachers Association - which represents music teachers across both state and private schools - says every school should have a choir.\"All you need is a room and you need someone to lead it and you need students,\" says James, who is also the director of music at Windsor Learning Partnership - a multi-academy trust of six state schools.\"It's a shame to think some state schools aren't capitalising on that.\"He says changes to the school curriculum in England are \"very exciting\" for boosting music in schools, but says more funding and resources will be needed -  \"as well as retaining the wonderful music teachers we have out there\".Dan Nelson / BBCMusic teacher Rob Hatton set up the gospel choir for students at The East Manchester AcademyA Department for Education spokesperson said the government was committed to ensuring art, music and drama \"are no longer the preserve of a privileged few\".Ministers are \"investing millions\" to help schools invest in musical instruments and equipment, and \"supporting high quality music teaching through our Music Hubs\", they said. \"Our renewed curriculum will also give every young person the skills, knowledge and experiences needed to achieve and thrive, including encouraging more people to study music and other creative subjects.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Singing at school shouldn't just be for Christmas, teachers say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0db1/live/984e50f0-dc27-11f0-89ae-89110b9e802d.jpg"
      ],
      "datePublished": "2025-12-22T00:03:39.000Z",
      "dateModified": "2025-12-22T00:03:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "No evidence Reform broke electoral law, watchdog says",
    "url": "https://www.bbc.com/news/articles/cx2dv17g0r3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c40c/live/cadf9fe0-de6d-11f0-8028-e1a8a98194f5.jpg",
    "tag": "Trending",
    "date": "2025-12-21T13:12:58.000Z",
    "description": "12 hours agoHarry Farley,political correspondent,andFiona NimoniThe Electoral Commission has found no \"credible evidence of potential offences of elec",
    "body": "12 hours agoHarry Farley,political correspondent,andFiona NimoniThe Electoral Commission has found no \"credible evidence of potential offences of electoral law\" over Nigel Farage's election expenses.The watchdog said it would take no further action in a letter to Reform UK's treasurer, shared with the BBC.It comes after a former member of Farage's campaign team claimed Reform spent more than the £20,660 spending limit set in law.Essex Police said last week that it would not investigate the matter because more than a year had passed since the alleged offence.The election agent for Nigel Farage in Clacton, Peter Harris, said the complaint had been \"politically motivated\".\"The facts are clear, the process has been properly followed, and there is no basis for any further allegation, inference, or repetition of these claims,\" he added. The commission wrote in its letter that it had \"not identified any omissions of expenditure that ought to have been declared\" in Farage's campaign to be elected in his Clacton constituency.It added: \"We did not identify credible evidence of potential offences of electoral law. \"Therefore, our decision is to close our consideration of the matter following initial enquiries and take no further action.\"The claims of wrongdoing against Nigel Farage and his party were made by ex-Reform campaigner Richard Everett.He alleged the party failed to declare spending on some leaflets, banners, utility bills and the refurbishment of a bar in the Clacton constituency office.Documents were passed to the Metropolitan Police, which transferred the case to Essex Police.Earlier this week, an Essex Police spokeswoman said: \"Any prosecution for such an offence must commence within one year.\"She said an \"allegation around misreported expenditure by a political candidate\" in July 2024 was made on 5 December.\"It has been concluded that this report falls outside of the stated statutory time limit, and no investigation can take place,\" the spokeswoman added.Farage took over as leader of Reform UK in June 2024, about a month before the general election.He went on to win the seat of Clacton in Essex from the Conservatives with a majority of more than 8,000.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "No evidence Reform broke electoral law, watchdog says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c40c/live/cadf9fe0-de6d-11f0-8028-e1a8a98194f5.jpg"
      ],
      "datePublished": "2025-12-21T13:12:58.000Z",
      "dateModified": "2025-12-21T13:12:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pam Duncan-Glancy: Labour MSP to quit Holyrood over links to sex offender",
    "url": "https://www.bbc.com/news/articles/cq5q1xd21w3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/08b5/live/7cd406e0-de9c-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-21T19:12:05.000Z",
    "description": "Scottish Labour MSP Pam Duncan-Glancy will not seek re-election to Holyrood next year as she does not want her friendship with a convicted sex offende",
    "body": "Scottish Labour MSP Pam Duncan-Glancy will not seek re-election to Holyrood next year as she does not want her friendship with a convicted sex offender to \"become a distraction\". Earlier this month Duncan-Glancy stood down as the party's education spokeswoman after admitting an \"serious error of judgement\" over her links to Sean Morton.The Glasgow region MSP submitted her resignation after the Daily Record newspaper said she had maintained contact with Morton, a former Labour councillor who admitted having indecent images of children and extreme pornography in 2017.At the time Labour said she had done the right thing and it considered the matter closed.Duncan-Glancy, who was elected to Holyrood in 2021, had been selected to contest a Glasgow seat.But in statement, issued on Sunday, the MSP confirmed that she had withdrawn her candidacy.Duncan-Glancy said: \"While this has obviously been a very difficult decision - and it is the greatest honour of my life to represent Glasgow - I do not wish for a personal friendship to become a distraction.\"I am grateful to have had the opportunity to serve, and I remain committed to returning a Scottish Labour government next year.\"Morton, a former councillor for Fochabers Lhanbryde, was ordered to carry out unpaid work and put on the sex offenders register after he pled guilty to possessing two indecent child image offences.He had claimed the images were sent to him anonymously.A Scottish Labour spokesperson said: \"Pam Duncan-Glancy has withdrawn as a parliamentary candidate for the Glasgow Kelvin and Maryhill constituency.\"She has taken the decision to step aside as she does not wish recent stories to become a distraction from the work of the party or its priorities.\"The selection process will now be reopened so that a replacement candidate can be chosen.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pam Duncan-Glancy: Labour MSP to quit Holyrood over links to sex offender",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/08b5/live/7cd406e0-de9c-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-21T19:12:05.000Z",
      "dateModified": "2025-12-21T19:12:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US reportedly pursuing third oil tanker linked to Venezuela",
    "url": "https://www.bbc.com/news/articles/c99722j4lkgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2dac/live/280abdc0-de83-11f0-b6eb-fb9209f47010.jpg",
    "tag": "Trending",
    "date": "2025-12-21T23:19:23.000Z",
    "description": "The US Coast Guard is in \"active pursuit\" of another vessel in international waters near Venezuela as tensions in the region continue to escalate.US a",
    "body": "The US Coast Guard is in \"active pursuit\" of another vessel in international waters near Venezuela as tensions in the region continue to escalate.US authorities have already seized two oil tankers this month - one of them on Saturday. Sunday's pursuit related to a \"sanctioned dark fleet vessel that is part of Venezuela's illegal sanctions evasion\", a US official said. \"It is flying a false flag and under a judicial seizure order.\"Washington has accused Venezuela of using oil money to fund drug-related crime, while Venezuela has described the tanker seizures as \"theft and kidnapping\".US President Donald Trump last week ordered a \"blockade\" of sanctioned oil tankers entering and leaving the country.Venezuela - home to the world largest proven oil reserves - has accused the Trump administration of trying to steal its resources. US authorities have not yet officially confirmed Sunday's pursuit, and the exact location and name of the tanker involved is not yet known. As of last week, more than 30 of the 80 ships in Venezuelan waters or approaching the country were under US sanctions, according to data compiled by TankerTrackers.com.Saturday's seizure saw a Panamanian-flagged tanker boarded by a specialised tactical team in international waters. That ship is not on the US Treasury's list of sanctioned vessels, but the US has said it was carrying \"sanctioned PDVSA oil\". In the past five years the ship also sailed under the flags of Greece and Liberia, according to records seen by BBC Verify.\"These acts will not go unpunished,\" the Venezuelan government said in response to Saturday's incident. It added that it intended to file a complaint with the United Nations Security Council and \"other multilateral agencies and the governments of the world\".Venezuela is highly dependent on revenues from its oil exports to finance its government spending.In recent weeks, the US has built up its military presence in the Caribbean Sea and has carried out deadly strikes on alleged Venezuelan drug-smuggling boats, killing around 100 people.Sanctions also were placed on some of President Maduro's relatives and on businesses associated with what the US calls his illegitimate regime.Secretary of State Marco Rubio told reporters on Friday: \"It is clear that the current status quo with the Venezuelan regime is intolerable for the United States.\"He added that the goal of the Trump administration is to change that dynamic.  His comments were criticised by Venezuela's foreign minister who accused Rubio dragging the US down the path of \"regime changes\". It has provided no public evidence that these vessels were carrying drugs, and the military has come under increasing scrutiny from Congress over the strikes.The Trump administration has accused Venezuelan President Nicolás Maduro of leading a designated-terrorist organisation called Cartel de los Soles, which he denies.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US reportedly pursuing third oil tanker linked to Venezuela",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2dac/live/280abdc0-de83-11f0-b6eb-fb9209f47010.jpg"
      ],
      "datePublished": "2025-12-21T23:19:23.000Z",
      "dateModified": "2025-12-21T23:19:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Police watchdog may investigate West Midlands Police over Maccabi fan ban",
    "url": "https://www.bbc.com/news/articles/czxgqzvlx72o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f92e/live/4df1bd60-de9f-11f0-9ad2-17ea369782c4.jpg",
    "tag": "Trending",
    "date": "2025-12-21T20:35:42.000Z",
    "description": "The police watchdog says it may investigate West Midlands Police over its handling of the decision to ban Maccabi Tel Aviv fans from attending an Asto",
    "body": "The police watchdog says it may investigate West Midlands Police over its handling of the decision to ban Maccabi Tel Aviv fans from attending an Aston Villa game.The Independent Office for Police Conduct (IOPC) told the BBC it can exercise its power to investigate \"if evidence available to us appears to warrant\" it, but that it needed to assess that evidence \"before determining our next steps\".Its director Rachel Watson is quoted by the Sunday Times as saying she was willing to use the watchdog's \"power of initiative\" given the \"sensitivities\" of the case.Maccabi fans were prohibited from attending a 6 November match in Birmingham based on reports of hooliganism at other away games they attended.However, the government's adviser on antisemitism has since said that some of the intelligence the force used to come to the decision was \"inaccurate\".Lord Mann told the Home Affairs Committee earlier this month that some facts about the earlier matches had been changed to fit the decision.West Midlands Police also faced criticism over two of its high-ranking officers appearing to reiterate some of these inaccuracies before the committee.The IOPC tends to investigate cases that have been referred to it by individual police forces - usually when someone has died due to police action, or if a police officer is accused of a criminal offence.As such, instigating its own investigation without a referral is relatively rare.The IOPC is not yet investigating the force's decision, but a spokesperson said on Sunday: \"It is right for public confidence and police accountability that the force's involvement in the decision-making process is examined.\"They noted HM Inspectorate of Constabulary and Fire and Rescue Services was examining the risk assessment West Midlands Police carried out before the fixture and the extent to which the intelligence it gathered \"reflected the full information and intelligence picture\".They added that the Home Affairs Committee has asked the force for \"additional evidence\" relating to Chief Constable Craig Guildford and Assistant Chief Constable Mike O'Hara's committee appearance earlier this month.\"It is important for us to assess evidence related to these processes before determining our next steps.\"The IOPC spokesperson said it had written to West Midlands Police and the region's police and crime commissioner to \"seek assurances over what assessments they have made of any conduct\".They said this was important \"to understand why a formal referral has not been made\".MPs previously heard that the ban was based on information given to the force by Dutch police commanders concerning violence that broke out in Amsterdam last year during a Europa League match between Ajax and Maccabi.Following this, Dutch courts said evidence showed fans of the Israeli club faced violence, and also pointed out that the club's supporters pulled down Palestinian flags, vandalised taxis and chanted racist slogans against Arabs.Despite West Midlands Police saying the decision \"wasn't taken lightly\", senior MPs, including Prime Minister Sir Keir Starmer, said it amounted to antisemitism.Lord Mann told the Home Affairs Committee that there were several inaccuracies in West Midlands Police's intelligence report.He said it cited Maccabi fans \"pulling down Palestinian flags\" on match day in the Netherlands, when the incident occurred the night before. It also referred to a match between Maccabi and West Ham which never happened.The force also had to apologise over ACC O'Hara's repeated affirmation to the committee that representatives of the Jewish community had said they did not want Maccabi fans at the match, when they had said no such thing.This week, Maccabi Tel Aviv was fined €20,000 (£17,550) for \"racist and/or discriminatory behaviour\" by supporters during their game at Stuttgart in Germany on 11 December. Fans were also given a suspended one away match ban.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Police watchdog may investigate West Midlands Police over Maccabi fan ban",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f92e/live/4df1bd60-de9f-11f0-9ad2-17ea369782c4.jpg"
      ],
      "datePublished": "2025-12-21T20:35:42.000Z",
      "dateModified": "2025-12-21T20:35:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "In pictures: Druids descend on Stonehenge to mark winter solstice",
    "url": "https://www.bbc.com/news/articles/cn7k55jg2n3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fe16/live/2a70b380-de7e-11f0-b6eb-fb9209f47010.jpg",
    "tag": "Trending",
    "date": "2025-12-21T15:40:49.000Z",
    "description": "9 hours agoReutersThousands of revellers gathered at Stonehenge in Wiltshire on Sunday morning to welcome the sunrise on the winter solstice - the sho",
    "body": "9 hours agoReutersThousands of revellers gathered at Stonehenge in Wiltshire on Sunday morning to welcome the sunrise on the winter solstice - the shortest day of the year.Wearing Celtic clothing and elaborate, nature-inspired headdresses, druids and pagans danced around the Neolithic stone circle in Wiltshire thought to have been built by distant ancestors to align with the movements of the Sun.EPADruids and pagans danced near the Neolithic stone circle to mark the winter solsticeEPAThere was also singing before sunrise on the shortest day of the yearPA MediaSeveral pagans wore elaborate, nature-inspired headdressesPA MediaTraditional morris dancers also welcomed the sunrise EPAAs did a collection of drummersGetty ImagesPeople also gathered on Glastonbury Tor to see in the shortest day Getty ImagesThings can only get brighter from here: people celebrate the winter solstice as it marks the start of daylight hours getting longer instead of shorter",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "In pictures: Druids descend on Stonehenge to mark winter solstice",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fe16/live/2a70b380-de7e-11f0-b6eb-fb9209f47010.jpg"
      ],
      "datePublished": "2025-12-21T15:40:49.000Z",
      "dateModified": "2025-12-21T15:40:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Puppy farm and trail hunt ban promised in animal welfare strategy",
    "url": "https://www.bbc.com/news/articles/c93wxd27dvko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f093/live/e4e5de20-dcd5-11f0-bb5b-8b829d936cf4.jpg",
    "tag": "Trending",
    "date": "2025-12-21T22:30:19.000Z",
    "description": "3 hours agoMalcolm Prior,rural affairs producerandDuncan Kennedy,correspondentAn end to puppy farming and a possible ban on the use of electric shock ",
    "body": "3 hours agoMalcolm Prior,rural affairs producerandDuncan Kennedy,correspondentAn end to puppy farming and a possible ban on the use of electric shock dog collars are promised as part of a new animal welfare strategy being launched by the government on Monday. The strategy - which packages together new laws with legislative reforms and proposals - will also progress Labour's manifesto pledge to ban trail hunting in the countryside. The RSPCA has welcomed the plans to outlaw puppy farming but the Countryside Alliance has condemned the ban on trail hunting as \"another attack on the countryside\".Environment Secretary Emma Reynolds told the BBC there would be consultation on the trail-hunting ban, which was \"sometimes used as a smokescreen\" for illegal fox hunting. Puppy farming is the term used when breeders prioritise profit over animal health and welfare, often keeping large numbers of dogs in small pens and using them to produce multiple litters a year.Current dog breeding practices will be reformed to tackle puppy farming as part of what the government calls \"the biggest animal welfare reforms in a generation\". However, the whole strategy will not be delivered until the end of 2030.David Bowles, head of public affairs at the RSPCA, said the animal welfare charity was \"delighted\" at the strategy and added that the plans to ban puppy farming \"could be a real game-changer\".\"Puppy farming is one of the most insidious problems that the RSPCA faces.\"The government will need to write the legislation on that in this coming year and the RSPCA will work with them to make sure that there are no loopholes,\" he said.The government is also looking to ban the use of snare traps in the countryside and on Sunday confirmed it is to carry out a consultation on the proposed ban on trail hunting in the New Year.Trail hunting involves using a rag with a natural scent on to lay a trail ahead of a hunt, which is then followed by the hounds but live animal scents could be picked up by the pack instead.The secretary of state told the BBC that while Labour had previously banned fox hunting in 2004 \"we have seen that people are trying to get around that ban by using trail hunting in some cases\". \"Obviously that's also a problem of enforcement, it's not just the legislation, but we are determined to go further, which is why banning trail hunting is in the animal welfare strategy,\" she said.\"We know sometimes it is used as a smokescreen for fox hunting.\"But Tim Bonner, chief executive of the Countryside Alliance, said it was \"unbelievable\" that the government would be spending more parliamentary time on hunting.He said: \"Revisiting this pointless and divisive issue is completely unnecessary.\"People across the countryside will be shocked that after Labour's attack on family farms and its neglect of rural communities it thinks banning trail hunting and snares used for fox control are a political priority.\"Conservative chairman Kevin Hollinrake called the ban an \"attack on rural Britain and British culture\", accusing the government of \"punishing the law-abiding majority who support legal trail hunting\".The government is also looking at ending the use of \"confinement systems\" in farming including caged hens and pig farrowing crates, which are used to contain sows during birth and nursing.The use of slow-growing chickens will be promoted over the use of controversial so-called \"Frankenchickens\", a term used by animal welfare campaigners to describe fast-growing breeds.Anthony Field, head of Compassion in World Farming UK, said the government was \"raising the bar for farmed animal welfare\".The National Pig Association said it would be \"following the next steps closely\" on farrowing crates and was itself looking towards more flexible systems.The British Poultry Council have been approached by the BBC for comment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Puppy farm and trail hunt ban promised in animal welfare strategy",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f093/live/e4e5de20-dcd5-11f0-bb5b-8b829d936cf4.jpg"
      ],
      "datePublished": "2025-12-21T22:30:19.000Z",
      "dateModified": "2025-12-21T22:30:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]