[
  {
    "title": "Tracking UK migration: Small boats, asylum hotels and visas",
    "url": "https://www.bbc.com/news/articles/c70989jrdweo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a530/live/da608860-cb5a-11f0-a892-01d657345866.png",
    "tag": "Trending",
    "date": "2026-02-26T12:33:04.000Z",
    "description": "Track UK's latest migration numbers - including asylum, visas and small boats8 hours agoBBCHow does that sit alongside other key migration measures, i",
    "body": "Track UK's latest migration numbers - including asylum, visas and small boats8 hours agoBBCHow does that sit alongside other key migration measures, including overall immigration, small boat arrivals and visas granted? Scroll down to find out more about the latest key figures, and get answers to key questions on a range of topics.Produced by: Rob England, Libby Rogers, Jess Carr, John Walton, Becky Dale, Allison Shultes, Chris Kay, Steven Connor and Scott Jarvis. Graphics by: Jez Frazer, Zoe Bartholomew and Joy RoxasAbout the data*The figure for net migration will not sum exactly to the total of immigration minus emigration, because it is published as a rounded figure by the Office for National Statistics (ONS).Figures from government or other official sources used in this report can be revised retrospectively between publications. This page only displays data as it is presented in the latest release.ONS figures for immigration and emigration are update twice per year.Small boats figures from the Home Office are updated daily. Asylum, returns and visa figures from the Home Office are updated every three months. The number of people appealing against a refused asylum decision is updated every three months by the Ministry of Justice at a different time to other government figures on asylum. Immigration, emigration and net migrationFigures for net migration come from the ONS and use the internationally recognised definition of a long-term migrant: \"a person who moves to a country other than that of their usual residence for at least a year.\"Visas for legal migrationData for total entries via visas only includes those granted. It does not include people coming to the UK on a visitor visa or those on a transit visa - whose final destination is not the UK.Visa figures do not show if or when an individual arrived in the UK, but marks the point at which they were granted permission to do so.If someone was granted more than one visa within the year shown, each one is counted separately.The work category refers to new individuals linked to visas and permits, or the extension of an existing permission. This includes sub-categories such as seasonal, health and care, domestic and youth mobility visas.Study visas include all sponsored individuals by approved education providers in the UK, and those on short-term study visas.Family visas lets someone come to the UK or stay longer so they can live with close family members who are already here. It includes joining a spouse, partner, child or parent, or coming to care for a relative.The Other category refers to miscellaneous visas outside the categories of work, family and study. It includes humanitarian routes such as the Ukraine Sponsorship Scheme and the British National Overseas route.It also includes family permits for people from countries in the European Union or European Economic Area.Asylum applications and hotelsFigures for asylum seekers in hotels are published by the Home Office under the \"contingency accommodation - hotel\" category.The number of people in all other forms of accommodation includes those in non-hotel contingency accommodation, plus initial, dispersal and \"other\" accommodation.A scale is used to determine how close a local authority is from the average share of the population for an area in the UK. It compares the share in that area to the share across all areas in the UK that use that form of accommodation.Less than half = more than 50% below the average share of the populationLower than = between 25% to 50% below the average share of the population About the same as = within 25% of the average share of the populationHigher than = between 25% to 100% above the average share of the populationMore than double = more than 100% above the average share of the populationFigures on the backlog of people waiting for an initial decision on an asylum application include both applicants and dependants.The number of open appeals against refused asylum applications refers to individuals.Small boat crossings and other illegal arrivalsEntering the UK without permission is an offence under immigration law, but asylum seekers are generally not prosecuted for doing so if they claim asylum on arrival. In some cases, people have been prosecuted for entering the UK without permission alongside other offences, such as people smuggling or re-entering after deportation.The International Organization for Migration (IOM) collects figures for people who died or went missing while crossing from mainland Europe to the UK.These reports are based on  French and UK officials (such as police or coastguard) or media sources, and are considered an undercount by the IOM due to a lack of official statistics.The figures can include people who died in the Channel while crossing, but also those who died at any point while en route to a crossing point.Data for modern slavery only includes final decisions. Modern slavery includes any form of human trafficking, slavery, servitude or forced labour.Figures for other entries without permission are the sum of all irregular arrivals that were not by small boat, including inadequately documented air arrivals, recorded detections at UK ports and other recorded detections in the UK.Returns and deportations from the UKFigures on people who come to the UK but are denied entry at that point and then leave the country are not included in the number of returns in this page.People being returned after being convicted of a criminal offence includes people who are not British citizens who have been convicted in the UK of any criminal offence, or convicted abroad for a serious criminal offence.Returns involving the government include the Home Office categories of enforced returns (also known as deportations) as well as assisted and controlled voluntary returns.Independent returns are referred to by the government as other verified returns.UK migration compared with other countriesAsylum applications, immigration and emigration figures for European countries is the latest available data from Eurostat for the following countries:Austria, Belgium, Denmark, Finland, France, Germany, Greece, Ireland, Italy, Netherlands, Portugal, Spain, Sweden, Czechia, Estonia, Hungary, Latvia, Lithuania, Poland, Slovakia and Slovenia, Bulgaria, Romania, Norway, Switzerland and Croatia.Population figures for the UK are from ONS, National Records of Scotland and Northern Ireland Statistics and Research Agency 2024 mid-year estimates, and for Europe from Eurostat data as of 1 January 2024.In order to account for smaller populations and make European data comparable with the UK, when calculating figures for net migration and asylum applications, European countries with a population of less than one million have been excluded.Additionally, when calculating net migration, only countries which include asylum seekers or refugees in their immigration figures are included, these are:Austria, Belgium, Estonia, France, Germany, Greece, Ireland, Italy, Netherlands, Norway, Portugal, Slovenia, Spain, Switzerland.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tracking UK migration: Small boats, asylum hotels and visas",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a530/live/da608860-cb5a-11f0-a892-01d657345866.png"
      ],
      "datePublished": "2026-02-26T12:33:04.000Z",
      "dateModified": "2026-02-26T12:33:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential ch",
    "body": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Will The US Attack Iran? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n3jqc4?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-02-26T19:14:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·26 Feb 2026,·33 minsAvailable for over a yearToday, we discuss the indirect US-Iran talks happening in Geneva.\nThe talks are happening against a backdrop of increased tensions between the two countries, with the US sending what Trump calls an ‘armada’ to the region. President Trump has threatened to strike Iran if a nuclear deal isn’t agreed during the talks.\nWe also discuss President Trump’s State of the Union speech, happening a time where many Americans are feeling frustrated about the cost of living, and off the back of the supreme court striking down his tariff policy.\nAdam discusses all with economics editor Faisal Islam, chief North America correspondent Gary O’Donoghue and Panorama filmmaker Jane Corbin.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Shiler Mahmoudi.  The social producer was Joe Wilkinson and Gabriel Purcell-Davis. The technical producer was Rohan Madison. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Will The US Attack Iran? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-02-26T19:14:00.000Z",
      "dateModified": "2026-02-26T19:14:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Trump's big, long, State of the Union speech - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n32y2g?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-02-25T07:03:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·25 Feb 2026,·31 minsTrump's big, long, State of the Union speechAmericastAvailable for over a yearThe Americast team assembles for a late evening/early morning special as President Trump delivers the longest State of the Union address ever. On the agenda was a full-throated defence of the administration’s record, hailing a \"turnaround for the ages,” whilst playing down the Supreme Court's ruling against his signature tariff policy (with the judges themselves in the crowd).\nDespite the speech lasting nearly two hours,  there was little to suggest a change of course from Trump’s favourite taking points. He focused on the economy, immigration, the Democrats…. And the US men’s olympic hockey team.\nBut with growing voter dissatisfaction souring the polls, will Trump’s sales pitch be enough to counter sliding approval ratings and convince voters to stick with him for November's midterm election?\nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Sarah Smith, North America Editor\n• Anthony Zurcher, North America Correspondent\nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray, Grace Reeve and Kris Jalowiecki. The technical producer was Stephen Bailey. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Trump's big, long, State of the Union speech - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-02-25T07:03:00.000Z",
      "dateModified": "2026-02-25T07:03:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "No 10 will have no say on which Mandelson papers are released",
    "url": "https://www.bbc.com/news/articles/cp85j06ezyro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7fbe/live/b92e9af0-1340-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-26T18:24:18.000Z",
    "description": "2 hours agoBBCSenior MPs and peers will have the final say on whether sensitive information is published relating to Peter Mandelson's appointment and",
    "body": "2 hours agoBBCSenior MPs and peers will have the final say on whether sensitive information is published relating to Peter Mandelson's appointment and role as US ambassador.Parliament's Intelligence and Security Committee (ISC) said it had confirmed with the government that it alone would make the decision.The committee said agreement had been reached on which papers would be published, with hopes some could be released \"shortly\".Additionally, the Metropolitan Police and government have \"agreed a framework\" to determine which documents can be released without prejudicing a criminal investigation into Lord Mandelson.A UK government spokesperson said officials were \"proceeding at pace to publish the first tranche of documents in early March\" and \"working closely\" with the ISC to fulfil their requests.Lord Mandelson is under criminal investigation over allegations he passed sensitive information to convicted sex offender Jeffrey Epstein when he was a Labour minister.The peer was arrested by the Metropolitan Police on suspicion of misconduct in public office on Monday and later released on bail, pending further investigation.Lord Mandelson did not respond to requests for comment but the BBC understands his position is that he has not acted in any way criminally and that he was not motivated by financial gain.The Metropolitan Police has told the government not to release certain documents that could undermine its investigation.Prime Minister Sir Keir Starmer told MPs he wanted to release the documents but said he would not publish anything that could damage national security or diplomatic relations.The government was forced to hand over control of the process to the cross-party ISC following concern by MPs that Downing Street could have too much say in the process.On Thursday, the ISC said it had received a written guarantee that neither the prime minister nor the government would have the final say on what is considered too sensitive to disclose.Darren Jones, the chief secretary to the prime minister, told MPs on Monday that the first tranche of Lord Mandelson documents would be published in early March.Jones said police had already advised ministers that certain documents, including exchanges between Lord Mandelson and No 10, should not be published in the first tranche.The BBC understands that one specific exchange police have blocked from being released next month includes three questions Sir Keir put to Lord Mandelson about his friendship with Epstein prior to his appointment as US ambassador. The questions were related to his continued contact with Epstein after his first conviction for soliciting prostitution with a minor, reports that he had stayed at Epstein's home while the financier was in prison, and his association with a charity founded by Epstein associate Ghislaine Maxwell.Sir Keir has claimed the documents will show Lord Mandelson lied to him about the extent of his friendship with Epstein, which continued after he had been convicted in 2008.The BBC understands Lord Mandelson's view is that he answered questions about his relationship with Epstein in the vetting process accurately.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "No 10 will have no say on which Mandelson papers are released",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7fbe/live/b92e9af0-1340-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-26T18:24:18.000Z",
      "dateModified": "2026-02-26T18:24:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jeremy Corbyn set to become Your Party parliamentary leader",
    "url": "https://www.bbc.com/news/articles/cx2rxddwykno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e4a1/live/36433090-1315-11f1-b048-c9424b2cf5fd.jpg",
    "tag": "Trending",
    "date": "2026-02-26T14:00:49.000Z",
    "description": "6 hours agoRichard WheelerPolitical reporterEPA/ShutterstockJeremy Corbyn helped launch Your Party in 2025 with Zarah SultanaJeremy Corbyn is expected",
    "body": "6 hours agoRichard WheelerPolitical reporterEPA/ShutterstockJeremy Corbyn helped launch Your Party in 2025 with Zarah SultanaJeremy Corbyn is expected to become the parliamentary leader of Your Party after his supporters won control of the left-wing party's leadership committee.The former Labour leader's supporters, dubbed \"The Many\", won 14 of the 24 seats on the party's central executive committee (CEC) compared to seven seats for \"Grassroots Left\" supporters endorsed by former Labour MP Zarah Sultana.Corbyn said party members had voted for a \"mass, socialist party that takes the fight\" to Prime Minister Sir Keir Starmer and Reform UK leader Nigel Farage.Grassroots Left said Your Party must \"work together to become a party of and for the whole left, with no more witch-hunts or stitch-ups\".\"The Many\" stated that they would elect Corbyn as parliamentary leader if they won the CEC election.Your Party members previously chose to adopt a collective leadership model rather than a single leader, which avoided a direct leadership contest between Corbyn and Sultana.The two MPs launched the party last year to \"take on the rich and powerful\".Both Corbyn and Sultana were elected to the CEC.Corbyn, in a statement released after the results were announced, said: \"We have a precious opportunity to unite our movement around a bold vision for this country - one that believes in a more caring, equal and peaceful society for all.\"I look forward to working with all members to make this vision a reality.\"The Islington North MP said he wanted to \"build a positive and inclusive party where all members feel empowered to share their ideas\".In November, Your Party's conference approved allowing members to have dual membership in future.Coventry South MP Sultana did not attend the opening day of the conference in protest of the expulsion of some members who had retained their membership of other left-wing groups, such as the Socialist Workers Party.Grassroots Left, responding to the election results, said: \"All those who have been expelled should be reinstated. \"We now need a culture of mutual respect, open debate, and a shared focus on the real issues facing us: inequality, insecure work, crumbling public services, fascism, and a political establishment that keeps letting working people down.\"Sultana said members have sent a \"clear message\", including about the need for \"greater transparency and accountability\" and for party branches to be \"properly recognised and respected\".She said \"now is the time to work together\", adding: \"I remain committed to building a socialist, anti-imperialist, anti-Zionist party that is democratic, member-led, and focused on delivering real material change for our communities.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jeremy Corbyn set to become Your Party parliamentary leader",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e4a1/live/36433090-1315-11f1-b048-c9424b2cf5fd.jpg"
      ],
      "datePublished": "2026-02-26T14:00:49.000Z",
      "dateModified": "2026-02-26T14:00:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Danish PM calls snap election with Greenland issue centre-stage",
    "url": "https://www.bbc.com/news/articles/ckg3e63jwj8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/490b/live/75f78830-131a-11f1-b513-7d8d8ff19957.jpg",
    "tag": "Trending",
    "date": "2026-02-26T13:56:39.000Z",
    "description": "7 hours agoPaulin KolaEPATrump's plans to seize control of Greenland have dominated Danish politicsDanish Prime Minister Mette Frederiksen has announc",
    "body": "7 hours agoPaulin KolaEPATrump's plans to seize control of Greenland have dominated Danish politicsDanish Prime Minister Mette Frederiksen has announced early elections - hailing the next four years as \"decisive\" for her country.\"We as Danes and as Europeans will really have to stand on our own feet,\" Frederiksen told parliament. \"We need to define our relationship with the United States,\" she added. The past few months of Danish politics have been dominated by US President Donald Trump's threats to annex Greenland - a semi-autonomous Danish territory. Last month, Trump dropped threats to use force against the fellow Nato ally to seize the Arctic island he argues is necessary to defend against possible attacks from Russia and China.Announcing the decision to call early elections on 24 March, Prime Minister Frederiksen told parliament that security \"is and will remain the very foundation of Danish politics for many, many years to come\". \"We must rearm to ensure peace on our continent,\" she said. \"We must stick together in Europe, and we must secure the future of the Danish Commonwealth\" - Denmark, Greenland and the Faroe Islands.\"Whether I will continue to be your prime minister depends on how strong a mandate you give the Social Democrats,\" Frederiksen said mentioning her party, the lead partner in the current Danish coalition. Trump has claimed without evidence that it is \"covered with Russian and Chinese ships all over the place\". More than 100 US military personnel are permanently stationed at a US base in Greenland's north-western tip - a facility that has been operated by the US since World War Two.Under existing agreements with Denmark, the US has the power to bring as many troops as it wants to Greenland.But Trump has not abandoned his plans - he has said previously that the US needs to own Greenland to properly defend it - and talks continue over ways of establishing US control over the entire island. Both Denmark and Greenland have said they will not agree to cede sovereignty to the US. Their European allies have rallied to their support.The latest confrontation may come in the next few days if Trump follows through with an announcement that the US plans to send a boat filled with medical supplies to Greenland, alleging \"many people\" on the island are sick and \"not being taken care of\". Greenlandic Prime Minister Jens-Frederik Nielsen rejected the proposal, telling Trump that Greenland provides free healthcare for all citizens, unlike the US.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Danish PM calls snap election with Greenland issue centre-stage",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/490b/live/75f78830-131a-11f1-b513-7d8d8ff19957.jpg"
      ],
      "datePublished": "2026-02-26T13:56:39.000Z",
      "dateModified": "2026-02-26T13:56:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tracey Emin says her artwork My Bed would be 'tidy, clean and boring' if she made it today",
    "url": "https://www.bbc.com/news/articles/c8jxm2n9lm1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0aa4/live/0f317650-132a-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-26T15:07:39.000Z",
    "description": "5 hours agoPaul GlynnCulture reporter\"I could cry now\": Tracey Emin reacts to famous My Bed sculpture over 20 years onDame Tracey Emin has said her co",
    "body": "5 hours agoPaul GlynnCulture reporter\"I could cry now\": Tracey Emin reacts to famous My Bed sculpture over 20 years onDame Tracey Emin has said her controversial Turner Prize nominated 1998 artwork, My Bed, would be \"tidy\", \"clean\" and \"boring\" if she made it today.The sculpure, depicting a dirty, disheveled and debaucherous bedroom scene - complete with cigarettes, alcohol, underwear and condoms - caused a stir when it was first shown at London's Tate Gallery, almost 30 years ago.It was sold at auction by Christie's in 2014 for more than £2.5m, but has now been loaned back to Tate Modern for its new retrospective, Tracey Emin: A Second Life.The Londoner, 62, told the BBC the bed would be \"ridiculousy tidy\" if she made it again today, and the sheets would have a \"1600 thread count\" - a mark of high quality.Dame Tracy Emin's 1998 artwork, My Bed, is back on display at Tate Modern as part of a career retrospective which opens on FridayAsked by the BBC's Laura Kuenssberg, on her upcoming Sunday TV show, what would be next to the bed nowadays, the artist replied: \"My two cats, maybe a few love letters.\"And it would be ridiculously clean, with very, very beautiful sheets, very clean and very tidy.\"It would be so boring, actually.\"Luxurious bedsheets, a reflective Dame Tracey told Kuenssberg, is her \"reward\" for having lived through a much messier youth and young womanhood.'Disgusted and repulsed'Dame Tracey rose to fame in the 1990s as one of the Young British Artists (YBAs), alongside the likes of Damian Hirst and Sarah Lucas.They became known for their entrepreneurial spirit and bold use of unconventional materials, with some at the time saying they used \"shock tactics\" to create their art. My Bed, which was inspired by a sexual yet depressive phase in Dame Tracey's life, was much criticised at the time for featuring stained sheets, soiled knickers and used condoms, as well as empty vodka bottles and cigarette butts.But the artist re-stressed this week that it had, in fact, saved her life.She revealed she had been moved to tears by seeing it back on display.\"I think it's because I nearly lost my life in that bed,\" she said. \"That bed kept me alive. It's not an affectation, it's a real thing.\"When I got up from that bed and looked at it, what I saw, I was disgusted and repulsed at the fact that I'd been laying in it and then I realised that I shouldn't be because it had been holding me and keeping me alive.\"Dame Tracey would tell her younger self not to smokeNearly two years on, Dame Tracey told the BBC she still has the \"rebel\" in her, but that being a dame means she also now has \"a louder voice\".She spoke of her regrets around smoking, and feels as though she has \"a duty\" to speak out, as her works goes on display.\"The first thing I'd say to my younger self, when I was 13 and I took the first draw on that cigarette: 'Put it out and never do it again'.\"She added: \"I've feel now a duty to say a lot of things out loud, a lot, and to be fearless about it as well, because I think when you face death like that... you're told that you've possibly got six months to live, you start thinking about your life.\"Cigarettes after sexHer new show finds the artist reminiscing about \"what you would have done differently, what you regret\" and, she added, what you would do differently \"if you had another chance\".Her other main regret in life is the \"amount of sex\" she had, both as \"a child and as a teenager\", with older men, which she said was \"really bad\".She hopes her work tackles topics like child abuse, abortion, depression and suicide in a non-judgemental manner.\"If I'm talking about being abused as a child, if I talk sexually, if I'm talking about being [sic] teenage sex with older men - now it's called grooming, right? It wasn't when I was 14...\"If I'm talking about suicide, if I'm talking about depression, all of the abortion - all of these issues that I make work about are really relevant and really important.\"Dame Tracey said she's now feels \"hideously drunk\" on art when painting late at night or in the early hours of the morning, having previously felt \"too guilty to paint\" when she was younger.In a broad-ranging interview, the south Londoner - whose dad was a Turkish Cypriot - also spoke about immigration, the NHS and how, in her opinion, the UK has ended up in \"in a mess\", politically speaking.And while she doesn't believe AI will take her job as an artist, she said she thinks it is undermining truth in socety.She wants there to be more \"respect and regard\" for the arts because, she said, \"being creative and making art is a beautiful thing\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tracey Emin says her artwork My Bed would be 'tidy, clean and boring' if she made it today",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0aa4/live/0f317650-132a-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-26T15:07:39.000Z",
      "dateModified": "2026-02-26T15:07:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Soham murderer Ian Huntley seriously injured in prison attack",
    "url": "https://www.bbc.com/news/articles/c1mjx1grj3yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/db66/live/05f554b0-130e-11f1-801d-ed3cff6bf876.jpg",
    "tag": "Trending",
    "date": "2026-02-26T17:15:14.000Z",
    "description": "3 hours agoSima Kotecha,Senior UK correspondentandThomas MackintoshPA MediaIan Huntley is serving a life sentence for the murders of the two schoolgir",
    "body": "3 hours agoSima Kotecha,Senior UK correspondentandThomas MackintoshPA MediaIan Huntley is serving a life sentence for the murders of the two schoolgirlsSoham double murderer Ian Huntley is being treated for serious head injuries after he was attacked by another inmate in a prison workshop. The 52-year-old is serving a life sentence for murdering schoolgirls Holly Wells and Jessica Chapman in August 2002.The Prison Service confirmed a prisoner was taken from HMP Frankland, a high-security facility in County Durham, to hospital on Thursday morning.Durham Constabulary said a male prisoner in his mid-40s suspected of carrying out the attack was \"in detention\" but had not been arrested \"at this stage\".The Sun newspaper, which first reported the attack, said Huntley was beaten with a metal pole.An air ambulance was dispatched to HMP Frankland, but the North East Ambulance Service spokesperson said the injured inmate was taken to hospital by road.Durham Constabulary confirmed a police investigation is under way and that detectives are liaising with staff at the prison.\"Police were alerted to an assault which had taken place within HMP Frankland in Durham this morning,\" a Durham police spokesman said.\"A male prisoner suffered serious injuries during the incident and was transported to hospital.\"The deaths of 10-year-olds Jessica and Holly in the quiet Cambridgeshire town of Soham on 4 August 2002 shocked the country.PA MediaHolly Wells (left) and Jessica Chapman went missing on 4 August 2002 in Soham, CambridgeshireHuntley - originally from Grimsby - enticed both schoolgirls into his home and murdered them, before dumping their bodies in a ditch some 12 miles away.Suspicions were raised about Huntley after he gave detailed interviews to the media about Holly and Jessica.Two weeks after they disappeared, Holly and Jessica's bodies were found in a ditch near an air base in Lakenheath, Suffolk.Huntley, who was a caretaker at Soham Village College, was arrested and charged with their murders.During his trial at the Old Bailey, prosecutor Richard Latham QC described Huntley as \"ruthless\" and said Huntley's account of both deaths were \"desperate lies\".However, he admitted he had killed Jessica by putting his hand over her mouth to stop her screaming and that he had told lies to police to cover his tracks. Huntley also admitted dumping the girls' bodies in the ditch and trying to burn them.Huntley was convicted on 17 December 2003 following a trial at the Old Bailey. His girlfriend Maxine Carr, a teaching assistant at the girls' primary school, was also jailed in 2003 after being found guilty of conspiring to pervert the course of justice.She was freed from jail and given a new identity in May 2004.After his arrest, it emerged Huntley - now aged 52 - had been able to work with children despite being the subject of rape and sexual assault complaints.Huntley had been the subject of a series of complaints made to police in Humberside, where he had worked before.A subsequent inquiry led to criminal checks on anyone working with children.It is not the first time Huntley has been injured while serving time in prison.In 2008 Huntley was moved to HMP Frankland, a Category A high security men's prison.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Soham murderer Ian Huntley seriously injured in prison attack",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/db66/live/05f554b0-130e-11f1-801d-ed3cff6bf876.jpg"
      ],
      "datePublished": "2026-02-26T17:15:14.000Z",
      "dateModified": "2026-02-26T17:15:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Russia says it has handed over 1,000 Ukrainian soldiers' bodies",
    "url": "https://www.bbc.com/news/articles/cg7ed4rp7x5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b735/live/953979b0-12f7-11f1-9120-a910fc22c6ac.png",
    "tag": "Trending",
    "date": "2026-02-26T14:28:35.000Z",
    "description": "Russia and Ukraine exchange more than 1,000 soldiers' bodies6 hours agoPaulin KolaMedinski Instagram postThe peace talks have not produced any results",
    "body": "Russia and Ukraine exchange more than 1,000 soldiers' bodies6 hours agoPaulin KolaMedinski Instagram postThe peace talks have not produced any results, but prisoners and bodies have been exchangedRussia says it has handed over the remains of 1,000 soldiers to Ukraine and has received the bodies of 35 Russian soldiers in return.It comes as Ukraine's chief negotiator met US President Donald Trump's envoys in Geneva to discuss economic plans for the reconstruction of Ukraine after the war.Negotiators were also preparing a third round of US-led talks aimed at ending the conflict which has entered its fifth year - a trilateral meeting involving the Russian side, too. Hours before the Geneva talks, Russia launched 420 drones and 39 missiles in six different regions of Ukraine, injuring dozens of people, Ukraine's President Volodymyr Zelensky said.Vladimir Medinsky, a top aide of Russian President Vladimir Putin, announced the exchange of bodies in a short announcement on Telegram. He gave no details, but included an image showing bodies being unloaded from a truck. Hours later, Ukraine said it had received 1,000 bodies which, \"according to prior information from the Russian side, may belong to Ukrainian defenders\".The two sides have exchanged thousands of soldiers' bodies over the course of the conflict that began with Putin's decision to launch a full-scale invasion of Ukraine on 24 February 2022. The exchange is based on an agreement reached by the two sides during negotiations in Istanbul in June 2025. Moscow and Kyiv agreed to return the bodies of up to 6,000 soldiers each, as well as all sick and heavily wounded prisoners of war and those aged under 25.Kyiv and Moscow regularly publish estimates of the other side's losses, but do not detail their own.And from public sources, the BBC has confirmed the names of almost 186,000 people killed fighting on Russia's side in Ukraine. The true death toll is generally accepted to be much higher, as many deaths on the battlefield are not recorded.So even though estimates suggest more Russians are dying every day, Moscow has returned more bodies to Ukraine overall than it has received. No-one has explained the discrepancy, even though Russia has previously accused Ukraine of not abiding by the Istanbul agreement, and Ukraine has alleged Russian body returns were irregular and sometimes included Russians' remains - a charge Moscow has rejected.One possible explanation is that Russia captures more Ukrainian bodies given its troops have been on the attack most of the time and, therefore, more able to retrieve them from the battlefield.On the eve of the Geneva talks, President Zelensky had a telephone conversation with Trump and said he expected the Geneva meeting would lead to trilateral negotiations at the beginning of March - thus creating \"an opportunity to move talks to the leaders' level\". \"President Trump supports this sequence of steps,\" Zelensky said, adding: \"This is the only way to resolve all the complex and sensitive issues and finally end the war.\" Putin, for his part, has refused to meet Zelensky, describing him as illegitimate - an argument centring on the fact that no presidential election has been held in Ukraine, despite the expiry of Zelensky's term in March 2024.However, Ukraine's constitution bars holding elections under martial law - imposed in the wake of Putin's invasion of his neighbour.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Russia says it has handed over 1,000 Ukrainian soldiers' bodies",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b735/live/953979b0-12f7-11f1-9120-a910fc22c6ac.png"
      ],
      "datePublished": "2026-02-26T14:28:35.000Z",
      "dateModified": "2026-02-26T14:28:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Five tips to help you get your first job",
    "url": "https://www.bbc.com/news/articles/cg5n02zlynjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6f9f/live/6bcc5980-117b-11f1-ae0b-bf8115d77a66.jpg",
    "tag": "Trending",
    "date": "2026-02-26T11:28:18.000Z",
    "description": "9 hours agoStar McFarlaneBusiness reporterGetty ImagesThe UK unemployment rate among 16 to 24-year-olds is at the highest it's been in more than a dec",
    "body": "9 hours agoStar McFarlaneBusiness reporterGetty ImagesThe UK unemployment rate among 16 to 24-year-olds is at the highest it's been in more than a decade.Careers experts say there are some specific things younger people can do to find work.Whether you're looking for a Saturday job or your first full-time role, here are some tips to get you started.1. Focus on skills, not the jobIt does not matter what your first job is - the transferable skills you learn are more valuable for your future career than the job itself, experts say.For example, many senior roles require strong interpersonal and communication skills, and there are plenty of entry-level jobs that offer the opportunity to develop these, says Ghislaine Dell, head of careers at Bath University.\"Your client might be a customer coming into the local shop you work in or they might be a client that wants you to develop a new piece of software for them,\" she says. \"Either way, being able to show your ability to communicate well and deliver what they're asking for is really important.\"You shouldn't overthink your first job, agrees Charlotte Bosworth, chief executive of apprenticeship provider Lifetime Training, which works with brands like Nando's and B&Q as well as the Department for International Trade.\"Just hit the market - you're more employable when you're employed,\" she says.2. Use AI to prepare Employers are increasingly looking to recruit the next generation of staff with AI skills, and there are ways to use it to help prepare your job applications too.Put the job description and company website into an AI system and ask specific questions like \"What are the top five things this employer is looking for?\" suggests Ghislaine Dell.You can use these points to help draft your application, create structure and showcase your skills in the best way, she says.If you are invited for an interview, AI can also help you prepare by generating questions you might be asked based on the industry, company and the role you're applying for, Dell says.However, she warns against using AI to write your application for you.\"Employers want you to sound like you. They don't want you to sound like the people 10 years older than you that programmed the AI,\" she says.\"It's better to sound like you with a few mistakes than a perfect clone.\"3. Introduce yourself in personFor smaller or independent businesses – local cafes, shops or pubs, for example – introducing yourself in person can help show your confidence and willingness to learn more about the business, says Charlotte Bosworth.It's also useful for you to take a look at a range of different workplaces to get an idea of what kind of environment you might want to work in.\"Even if you have already put in an application online, going in and introducing yourself in person... asking questions about the role and showing an interest in the company… might just be the thing that puts your [CV] to the top of the pile,\" she says.It's even worth visiting places that haven't got a job advertised to register your interest so they think of you if any future roles do come up.4. Let your personality shine in cover letterA cover letter can be a great opportunity to tell prospective employers who you are and what you're passionate about.It is also a \"signal\" that you've taken time to do the application, says Baz Ramaiah, research and policy director at social enterprise Youth Employment UK.\"It's an opportunity to let your personality shine,\" he says.There are many reasons employers want to hire young people and your cover letter can spell out what you bring, adds Bosworth.\"Don't underestimate the unique fresh ideas, energy and eyes you will bring to a role, regardless of how much experience you have,\" she says.5. Find resources aimed at young peopleSearch for free online resources and groups aimed at helping young people into work.\"There are lots of accessible local groups, charities and organisations that help young people who are struggling to find work. The problem is a lot of people don't know they're there,\" says Ramaiah.There are also lots of free online courses which is another way to help you skill up for applications, he says.One organisation offering such courses is the King's Trust. For people aged 16 to 30, it provides free courses including work placement programmes in a range of industries, personal development programmes, and short courses on important interviewing and CV writing skills.Youth Employment UK also offers assistance to young people including career guidance and free online courses to help build confidence and skills, and the UK government offers tips and advice to help young people build experience and confidence, and find the right career.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Five tips to help you get your first job",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6f9f/live/6bcc5980-117b-11f1-ae0b-bf8115d77a66.jpg"
      ],
      "datePublished": "2026-02-26T11:28:18.000Z",
      "dateModified": "2026-02-26T11:28:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Record levels of rough sleepers in England, figures reveal",
    "url": "https://www.bbc.com/news/articles/cwy6pwyqyn5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/937f/live/1d5fa080-1325-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-26T11:37:56.000Z",
    "description": "'I'm going to stick at it until I get a home'9 hours agoAdam EleyBBC NewsPA MediaThe number of people sleeping rough in England is at its highest leve",
    "body": "'I'm going to stick at it until I get a home'9 hours agoAdam EleyBBC NewsPA MediaThe number of people sleeping rough in England is at its highest level since records began in 2010.Some 4,793 people were estimated to be sleeping on the streets on a single night last autumn, according to the latest snapshot figures released by the government on Thursday - a 3% increase from 2024.The number of female rough sleepers rose by 8% to 733, while there were 3,938 men and another 122 cases where the gender was not recorded.The government said £50m of funding, provided over three years, would be provided to councils and frontline homelessness services.London has the highest number of rough sleepers -1,277 - but the rate of rough sleeping rose steepest year-on-year in the north east of England, where numbers increased by 31% to 162.For the past seven years in Leeds, the Homeless Street Angels charity has been providing food, shoes, sleeping bags and blankets for rough sleepers.Each Thursday, dozens of people queue for support awaiting their arrival - and the charity says that demand is rising.\"It's getting worse and worse, week in, week out,\" the organisation's co-founder Becky Joyce says in the cold February air.\"[There are] a lot of new faces tonight, which is quite upsetting because the more people we think we get off the streets, the more people are coming on the streets.\"They currently make 240 food boxes each week, double the amount produced three years ago, handing them out as they make their way through the city's streets. Less than half way round their usual route, they run out of meals.Becky Joyce says demand for their support has risen sharplyJosh has been homeless for more than a year after losing his rented home.\"I have to walk two hours a day to come into town to get food,\" he says, preferring to find shelter outside of the city centre where he feels safer, sleeping in a one-man tent under a bridge.Josh says he has the \"determination\" to turn things around and is trying to apply for social housing. But without a phone, it can be difficult contacting his social worker and he struggles with the process.\"I'm going to keep sticking at it until I get a home,\" he says.Josh walks two hours into the city centre for a food parcelNot all the individuals the charity supports are rough sleepers - some will be sofa surfing, others may have recently moved into accommodation. Gareth, 31, was helped into accommodation six months ago.\"One day I just woke up and after a year-and-a-half on the streets I thought, 'I need to do something',\" he says, remembering how he approached a local charity for support.Most people Gareth encountered while he was sleeping on the streets were kind, but he says some made critical comments and stole his possessions in the night. Having a place to stay has been transformational.\"It makes you feel a better person,\" he says. Charities believe finding people accommodation is only half the battle. The next step is stopping people returning to the streets, and Gareth has come along as much for the mental health boost of seeing familiar faces as for the food parcel.But Homeless Street Angels says there is only so much it can do. It is regularly contacted by probation services requesting free sleeping bags and food parcels for those released from prison with nowhere to go.Over the past three years the number of people sleeping rough in Leeds has risen 75% - from 37 to 65 -according to the snapshot data, although the 2025 figure is down slightly on the 69 rough sleepers recorded in 2024.\"It's only me and my twin sister,\" says Becky Joyce. \"How long can we keep going when the need is getting bigger and bigger?\"Gareth says his quality of life has been transformed since he was helped into accommodationThe figures for 2025 are the highest since records began in 2010. The previous peak was in 2017.There was a 5% rise year-on-year on the number of people born in the UK sleeping rough. Charities say the figures are likely to underestimate the true scale of the issue, as only those sleeping rough on one single night in the autumn are counted.Separate data published on Thursday showed the number of families living in temporary accommodation has also reached a new high. Between July and September 2025, 134,760 households were living in hotels, B&Bs and flats – an increase of 6.9% on the same period in 2024.Of these households, 85,730 include children.The government has pledged to halve \"long-term rough sleeping\" by 2030 and prevent more households from becoming homeless in the first place.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Record levels of rough sleepers in England, figures reveal",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/937f/live/1d5fa080-1325-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-26T11:37:56.000Z",
      "dateModified": "2026-02-26T11:37:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "2026 Winter Olympics: Donald Trump joke 'overshadows' US women's success - Hilary Knight",
    "url": "https://www.bbc.com/sport/ice-hockey/articles/cwy89l9nz7jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b6f7/live/5b46f360-12f5-11f1-89c0-597e6cfce3ac.jpg",
    "tag": "Trending",
    "date": "2026-02-26T11:28:07.000Z",
    "description": "The men's team was criticised after several players appeared to laugh when Trump made his comment, but Knight said: \"I think there's a genuine level o",
    "body": "The men's team was criticised after several players appeared to laugh when Trump made his comment, but Knight said: \"I think there's a genuine level of support there and respect. That's being overshadowed by a quick lapse.\"The guys were in a tough spot, so I think it's a shame this storyline and narrative has kind of blown up and [is] overshadowing that connection and genuine interest in one another and cheering each other on.\"Knight, 36, ended her Olympic career with 15 goals, the most by any US male or female player.She said she hopes the Trump controversy proves to be a \"really good learning point, to really focus on how we talk about women, not only in sport but in industry\".She said: \"Women aren't less than, and their achievements shouldn't be overshadowed by anything else other than how great they are.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "2026 Winter Olympics: Donald Trump joke 'overshadows' US women's success - Hilary Knight",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b6f7/live/5b46f360-12f5-11f1-89c0-597e6cfce3ac.jpg"
      ],
      "datePublished": "2026-02-26T11:28:07.000Z",
      "dateModified": "2026-02-26T11:28:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Spain to check Gibraltar arrivals under post-Brexit border deal",
    "url": "https://www.bbc.com/news/articles/cgjz1x5e1xyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d002/live/659dd1d0-1327-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-26T17:45:33.000Z",
    "description": "3 hours agoPaul SeddonPolitical reporterGetty ImagesThe UK is to allow Spanish border guards to check the passports of travellers to Gibraltar, under ",
    "body": "3 hours agoPaul SeddonPolitical reporterGetty ImagesThe UK is to allow Spanish border guards to check the passports of travellers to Gibraltar, under a deal with the EU to create an open land border with Spain.The agreement is designed to bring certainty to the British overseas territory nearly a decade after the Brexit vote threw its status into doubt.It is due to come into force in April, when stricter controls at the border of the passport-free Schengen zone are due to come fully into force. Under the deal, Gibraltar will not officially join the zone, made up of 29 mainly EU countries including Spain.Instead, Spanish authorities will carry out a \"second line\" of Schengen border controls, following immigration checks conducted by Gibraltar officials.Spanish guards will have powers to arrest, search and interview travellers \"where it is justified in the course of border control,\" according to the treaty.The system should eventually allow for the removal of 'La Verja', the 1.2km (0.7 mile) chain link fence along Gibraltar's land border with Spain, which is crossed every day by around half of the Rock's workforce.It would mean the disappearance of \"the last wall in continental Europe,\" said Spanish Foreign Minister José Manuel Albares in a video clip welcoming the deal.The UK government is likening the new system to that in operation at London's St Pancras station, where Eurostar passengers are checked by both British and French border officials. British nationals make up a huge share of visitors travelling to Gibraltar for tourism, representing 86.5% of all departures from its airport in 2024, according to the territory's most recent tourism survey. Since Brexit, Spain has allowed Gibraltar residents to cross the border without having their passports stamped, but there have been periodic complaints from Gibraltar about Spanish police tightening checks.From April, Spain had been due to apply the EU's new automated border system, including biometric checks, at the border with Gibraltar, which the UK says would \"devastate\" Gibraltar's economy.Fabian Picardo, the territory's chief minister, has welcomed the agreement, adding it delivers \"the certainty our people and businesses need\".Gibraltar's government says it is hoping to provisionally apply the deal from 10 April, the date when the EU's new border system is scheduled to become fully operational after several previous setbacks.The deal will see the territory join the EU's customs union, and align its import taxes to those applied by Spain.Although Gibraltar will keep its zero-VAT regime, it will charge a new \"transaction tax\" on the customs value of goods imported into or made in the territory for sale there, which will start at 15% and rise to 17% by 2028.Picardo told BBC Radio 4's World At One it would mean some products in Gibraltar \"might become a little more expensive\" but said the agreement overall would increase traffic to the territory's shops. 'Operational overreach'Speaking in the Commons, Foreign Office minister Stephen Doughty said the deal was evidence of a \"new era of co-operation\" with the EU since Labour took office.His Conservative shadow Wendy Morton said the treaty required \"proper scrutiny\" and questioned how \"operational overreach\" from Spanish police could be avoided. The government also says a majority of goods destined for Gibraltar will be cleared by EU customs offices in Spain, in a deal designed to avoid the need for customs checks at the land border.As part of the deal, the UK and EU have agreed to make unspecified financial contributions towards a new fund to promote \"training and employment\" in the Spanish regions surrounding the territory.Gibraltar was not covered by the UK's 2021 trade deal with the EU, and the UK has previously described it as the \"last piece of the EU exit jigsaw\". The treaty implements a political deal agreed between the UK and EU in June last year, and confirms key details of how the new arrangements will work in practice. It has been published in draft form whilst legal teams complete final reviews and translation of the text. It will have to be ratified by both the UK and European Parliaments. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Spain to check Gibraltar arrivals under post-Brexit border deal",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d002/live/659dd1d0-1327-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-26T17:45:33.000Z",
      "dateModified": "2026-02-26T17:45:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bridgerton: Season four introduces first East Asian family",
    "url": "https://www.bbc.com/news/articles/c2k8zyq0qgzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/54bc/live/7f6643a0-1317-11f1-9120-a910fc22c6ac.jpg",
    "tag": "Trending",
    "date": "2026-02-26T12:46:40.000Z",
    "description": "Bridgerton's first East Asian family is a beautiful thing, say cast8 hours agoAbu Bakar Yasin,BBC Newsbeat andNaomi de Souza,BBC Newsbeat Liam Daniel ",
    "body": "Bridgerton's first East Asian family is a beautiful thing, say cast8 hours agoAbu Bakar Yasin,BBC Newsbeat andNaomi de Souza,BBC Newsbeat Liam Daniel / NetflixLady Araminta Gun, played by Harry Potter actor Katie Leung, appears in Bridgerton with her on-screen daughters Posy and Rosamund LiBridgerton having its first East Asian family is a \"beautiful thing\", say the newest stars of the hit Netflix show. As part two of season four lands, actors from the sparkling regency drama tell BBC Newsbeat it's been \"so special\" to be part of the cast.\"When I saw they were casting a whole family of East Asians it was like, 'that's crazy',\" says Isabella Wei, who plays Posy Li. \"I remember the feeling was really like: 'It's our time'.\" The new episodes see Posy and her sister Rosamund burst on to the scene with their formidable mother, Lady Araminta Gun, depicted by Harry Potter actor Katie Leung. NetflixYerin Ha (left) plays the romantic lead in season fourLeading the fourth season's fairy tale-inspired storyline is Benedict Bridgerton, played by Luke Thompson. The Bohemian second son has so far refused to settle down, but this all changes when he meets a masked lady in silver at a masquerade ball. The mysterious love interest turns out not, in fact, to be his heart's desire from society, but a maid called Sophie Baek.With viewers set to find out if the pair's simmering forbidden love can conquer all, Australian actress Yerin Ha, who plays Sophie, tells Newsbeat that representing her community is all she's \"ever wanted\". \"I've gone on a big journey to come back here and to be representing the East Asian community,\" she says. Sydney-born Ha previously said she resonates with challenges that Sophie faces, such as feeling like an outsider. \"I keep wanting to push the needle forward, so it's not a topic of conversation any more,\" she adds.PA MediaLuke Thompson and Yerin Ha attended the screening of Bridgerton season four, part two at London's Southbank on February 24For Katie Leung, who shot to fame as Cho Chang in the Harry Potter films, returning to the screen in a lead role as part of an East Asian family is not a path she saw herself taking. \"I definitely didn't think I would be here, Harry Potter was such a rare opportunity,\" says Katie. \"I always just felt like I never deserved it. Whereas I feel like I deserve it now, because I've worked hard to be here.\"Bridgerton, which is based on a series of novels, has been criticised for casting diverse actors whose background differs from characters in the books.For Isabella Wei, who plays Leung's on-screen daughter Posy Li, being in the show has been an \"amazing opportunity.\"\"All of us worked really hard to be here and put in the work on the show and it was just so special to be in a room with everyone who looked like you,\" says Wei. \"You get to spend so much time together on this glamorous British regency show where you're not meant to be there, and we are, and that is such a beautiful thing.\"NetflixMatchmaking mayhem returns in season four of BridgertonAs each Bridgerton season focuses on a new sibling, it's Thompson's turn to carry the storyline, but the heat isn't getting to him.\"I've had the time to sort of chill out,\" Thompson jokes. \"I didn't feel pressure because I feel like I had started building something in season one, and now we get to develop it,\" he says. In addition to breaking barriers of representation, Bridgerton is known for its gripping storylines - and fans will be waiting with bated breath to find out what becomes of Francesca Bridgerton and Michaela Stirling's romance.In season three Francesca wed John Stirling, played by Victor Alli, and the pair looked to live out a quiet marriage. However, after John introduces his wife Francesca to his cousin Michaela, played by Masali Baduza, a connection begins to grow between the pair.Netflix has confirmed that the pair will be involved in a romance - a twist Baduza admits came with a certain amount of pressure.\"But I am so honoured that I've been trusted to play Michaela,\" she says. \"I think she's such an important character, not only to me, but to a lot of young queer black women and queer people in general.\"I love feeling that people are happy seeing themselves represented on screen. \"I think that love comes in all shapes and sizes and everyone deserves to see their life reflected back to them.\"Bridgerton season four, part two, is available to stream on Netflix.Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bridgerton: Season four introduces first East Asian family",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/54bc/live/7f6643a0-1317-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-26T12:46:40.000Z",
      "dateModified": "2026-02-26T12:46:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]