[
  {
    "title": "Americast - Will Trump delay releasing the Epstein Files? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mhn68x?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-11-17T19:06:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·19 Nov 2025,·31 minsWill Trump delay releasing the Epstein Files?AmericastAvailable for over a yearDonald Trump says he will sign a bill to release the Epstein Files after it passed nearly unanimously through both houses of Congress. It’s a notable shift in position from the president, who’s come under increasing pressure from Republicans and Democrats to release all files held by the Justice Department on the convicted sex offender Jeffrey Epstein. Will Trump be able to turn this into a victory, and will he be able to repair the rift that’s been growing among sections of his MAGA base?\nJustin, Sarah and Marianna take a look at what we know so far about Epstein’s relationships with powerful figures in the US, and what we can expect to see from the Epstein Files once they’re released into the public domain.\nAnd we assess just how significant a moment this is in Donald Trump’s second term as president, the tactics he may deploy to turn it into a political victory, and why he told one female reporter to be ‘quiet, piggy’ when asked about the Epstein Files on Air Force One.\nHOSTS:\n- Justin Webb, Radio 4 presenter\n- Marianna Spring, Social Media Investigations Senior Correspondent\n- Sarah Smith, North America editor\nGET IN TOUCH:\n- Join our online community: https://discord.gg/qSrxqNcmRB\n- Send us a message or voice note via WhatsApp to +44 330 123 9480\n- Email Americast@bbc.co.uk\n- Or use #Americast\nThis episode was made by George Dabby, Grace Reeve and Laura Cain. The technical producer was Michael Regaard. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app.\nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155#\nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Will Trump delay releasing the Epstein Files? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-11-17T19:06:00.000Z",
      "dateModified": "2025-11-17T19:06:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Google Boss And The Massive AI Gamble - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mhdbrt?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-11-18T18:28:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·18 Nov 2025,·33 minsThe Google Boss And The Massive AI GambleNewscastAvailable for over a yearToday, the CEO of Google gives a rare interview to discuss AI, economic risk, climate change and much more. \nFaisal Islam has been speaking to Sundar Pichai, the head of Google’s parent company Alphabet, about the future of the AI bubble.\nThe tech boss warned that “no company is going to be immune” if the AI bubble bursts after its current period of boom. This comes as some analysts expressed fear that stock markets are heading for a repeat of the dotcom bubble burst of the late 1990s.\nThey also discussed the environmental cost of powering AI, the potential risks to jobs and whether the UK will benefit from the current boom. BBC economics editor Faisal Islam joins Adam in the studio.\nYou can listen to a longer version of the interview with Sundar Pichai here - https://www.bbc.co.uk/sounds/play/p0mh56kj\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Shiler Mahmoudi and Anna Harris. The social producer was Beth Pritchard. The technical producer was James Piper. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Google Boss And The Massive AI Gamble - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-11-18T18:28:00.000Z",
      "dateModified": "2025-11-18T18:28:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ford boss Lisa Brankin warns against taxing electric cars",
    "url": "https://www.bbc.com/news/articles/c5yp1ky55g1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2fcb/live/9c0670a0-c562-11f0-ac47-e3b40c46275e.jpg",
    "tag": "Trending",
    "date": "2025-11-20T00:03:09.000Z",
    "description": "Ford boss: 'Now is not the time to tax electric vehicles'4 hours agoJosh Martin,Business reporter and Sean Farrington,Business presenterBarry CroninTa",
    "body": "Ford boss: 'Now is not the time to tax electric vehicles'4 hours agoJosh Martin,Business reporter and Sean Farrington,Business presenterBarry CroninTaxes on electric vehicles may put drivers off buying them at a time when demand has \"lost momentum\", Ford's UK boss has warned.It comes after the BBC reported Chancellor Rachel Reeves could be considering new levies on EVs in the upcoming Budget.Ford UK's managing director Lisa Brankin told the BBC: \"It's certainly not the right time to do it.\"A Treasury spokesperson said: \"Fuel duty covers petrol and diesel, but there's no equivalent for electric vehicles. We want a fairer system for all drivers.\"The Chancellor has been reported to be considering a new pay-per-mile charge for electric vehicles from 2028.Ms Brankin told the BBC's Big Boss Interview podcast: \"That [policy], in the face of really fragile demand for electric vehicles, is just another brake.\"The admin task of calculating their mileage would put potential EV owners off making the switch, she says.\"It's really easy to sell people things they want,\" she says. \"It's hard to sell people things they don't want. \"Electric vehicles in some instances have gone from being a great thing to being something that we're trying to push people into.\"ReutersThe chancellor has been reported to be considering a new pay-per-mile charge for electric vehiclesFord sells the UK's most popular vehicle, the Ford Puma, while its commercial van the Transit holds the second-most-sold ranking.For years its Focus model was the UK's most-popular, but the US company axed the hatchback and the last Ford Focus rolled off factory lines in Germany last week.It employs around 6,000 people in the UK, with an engine plant in Dagenham and a transmission factory in Halewood. It hasn't manufactured a vehicle here since 2013.Ford like other car makers is under pressure to meet the UK's net zero plan, 80% of new car sales must be EVs by 2030 or face fines. The government has reinstated a grant worth up to £3,750 to encourage drivers to buy electric vehicles.Ford would not be able to reach that 80% target without government help, such as the grant, Ms Brankin said.Sales figures from car industry body, the Society of Motor Manufacturers and Traders (SMMT) show how far car makers have to go to reach the target.Fully-electric vehicles made up around 22.4% of total new car sales, data for 2025 up to 31 October shows. This time last year it was 18.1%.In September, the UK new car market experienced its best performance since 2020, driven by a surge in EV sales which hit a record high, according to SMMT figures.However, Ms Brankin pointed to heavy discounting across car sales forecourts as well as a lower resale value in the second-hand EV market as indicators that the market was \"distorted\".\"When that [target] was set a number of years ago, the outlook for demand around electric vehicles was buoyant and there seemed to be momentum behind electric vehicles. What we're seeing now is that customer demand is not in line with that ambition,\" Ms Brankin said.A large share of new EVs are sold to businesses for their employees and they benefit from lower rates of \"company car tax\" compared with diesel or petrol-fuelled options. Ms Brankin has urged the Chancellor to retain this tax benefit of companies \"greening\" their vehicle fleets.The shift to EVs could have consequences for the close-to 1,800 staff at the Ford diesel engine plant in Dagenham, which was the largest car factory in Europe when it was first built.Ms Brankin said Ford was yet to make any decisions about the future of the plant, which will build diesel engines up until 2030.\"We're working really hard on and what the next life of Dagenham looks like, \" she said but there was \"nothing that we've settled on at the moment.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ford boss Lisa Brankin warns against taxing electric cars",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2fcb/live/9c0670a0-c562-11f0-ac47-e3b40c46275e.jpg"
      ],
      "datePublished": "2025-11-20T00:03:09.000Z",
      "dateModified": "2025-11-20T00:03:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Vogue Williams and Tom Read Wilson join I'm A Celebrity... Get Me Out of Here!",
    "url": "https://www.bbc.com/news/articles/cj414xqj2e7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/83dd/live/b6c403c0-c545-11f0-b288-51552c83ad58.jpg",
    "tag": "Trending",
    "date": "2025-11-19T22:47:37.000Z",
    "description": "Vogue Williams and Tom Read Wilson enter TV jungle as I'm A Celebrity's late entrants5 hours agoSteven McIntoshEntertainment reporter ITVIrish TV pres",
    "body": "Vogue Williams and Tom Read Wilson enter TV jungle as I'm A Celebrity's late entrants5 hours agoSteven McIntoshEntertainment reporter ITVIrish TV presenter Vogue Williams and Celebs Go Dating receptionist Tom Read Wilson are to join I'm A Celebrity... Get Me Out Here!The late entrants were revealed on Wednesday night's instalment of the ITV show, and will be shown entering the camp on Thursday's episode.Williams said taking part in the series was a \"massive life experience\", adding that she doesn't normally go \"out of my comfort zone\".Read Wilson said he initially felt \"abject terror\" about taking part but is now \"feeling excited\" about entering the Australian jungle.The pair join fellow campmates, including Martin Kemp, Ruby Wax, Jack Osbourne and Kelly Brook, who have been in the jungle since the show's launch on Sunday.Williams, who is married to former Made In Chelsea star Spencer Matthews, said: \"I always thought I wouldn't do it, because I've gotten too comfortable in my life. I like to have eight hours of sleep, I like to eat nice things, I like to just chill out and I never put myself out of my comfort zone.\"Then when I turned 40, I started to get scared of ridiculous things. I didn't want to be this person. Doing this is such a massive life experience and it is not something you can pay to do.\"So now I am 40, I think it will be pretty cool to do I'm A Celebrity.\"The mother-of-three said she was \"very worried about missing the kids\" while in camp.\"I have never been away this long before and I spend such a huge amount of time with them,\" she explained. \"It will be my biggest struggle.\"ITVRead Wilson, who was also a contestant on the fifth series of The Voice UK in 2016 and then runner-up on Celebrity Best Home Cook in 2021, said he was \"feeling excited\" about entering the jungle.\"My first thought when they approached me about taking part was abject terror,\" said the 39-year-old. \"But I have got a very strict rule in life. If the only reason that you don't want to do it is fear, you must do it, whatever it is.\"I'm fearful as a porcupine and I am very nervous that my grey cells [brains] won't dance properly in camp, too. At home, I do a cryptic crossword every day, I always have a book on the go and I am a bit worried that my frontal lobes will drop off if I don't have a lubricant for it.\"He continued: \"I can be vague at times and I don't want to scatter brain cells over the camp.\"His role as a receptionist and client coordinator on Celebs Go Dating sees him greet the celebrities upon their arrival to the dating agency.He is also well known for his wide vocabulary and published a book about language in 2022.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Vogue Williams and Tom Read Wilson join I'm A Celebrity... Get Me Out of Here!",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/83dd/live/b6c403c0-c545-11f0-b288-51552c83ad58.jpg"
      ],
      "datePublished": "2025-11-19T22:47:37.000Z",
      "dateModified": "2025-11-19T22:47:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'North Sea stand-off' and 'Council tax hike for millions'",
    "url": "https://www.bbc.com/news/articles/c2lplzd41gvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5285/live/23468d20-c5a4-11f0-a892-01d657345866.png",
    "tag": "Trending",
    "date": "2025-11-20T00:58:05.000Z",
    "description": "3 hours agoThe activity of a Russian spy ship in the North Sea leads several front pages, with the Mirror quoting Defence Secretary John Healey in its",
    "body": "3 hours agoThe activity of a Russian spy ship in the North Sea leads several front pages, with the Mirror quoting Defence Secretary John Healey in its headline. He tells reporters the Yantar \"dangerously\" directed lasers to disrupt RAF pilots tracking its activity near UK waters. \"We see you, we know what you're doing,\" he warns Moscow.The Independent also leads with Healey in its headline, characterising his quotes as a \"stern threat to Putin\". Russia's Embassy in London says it is not undermining UK security and it has condemned Healey's statement as provocative. The Sun says the incident is causing tensions with Russia to escalate, as \"more damning revelations\" surface about a British man facing a war crimes charge for spreading what the paper calls \"sick Putin propaganda\".The i Paper reports local authorities in London and the South East will be allowed to raise their council tax without a public vote. The paper says the hikes are part of a \"major funding overhaul to protect services\" and suggests Whitehall grants will be diverted to areas in the North and the Midlands with \"greater needs\".Trans people could be banned from single-sex spaces based on how they look, according to an exclusive report in the Times. The paper says the guidance from the Equality and Human Rights Commission was handed to ministers three months ago, but is yet to be published.\"Starmer calls on Farage to address racism claims,\" says the Guardian, following its reporting on Wednesday which alleged the Reform UK leader had made racist comments when he was in school. Farage has denied making any of the comments and actions attributed to him by former pupils at Dulwich College, in south London, in the 1970s.Officials have spoken to the Daily Telegraph about a secret deal that has been \"thrashed out\" between the US and Russia in a recent \"flurry\" of talks. Sources familiar with the 28-point plan tell the paper Ukraine could be forced to cede control of the eastern Donbas region to Russia but retain ownership. Moscow would pay the nation an undisclosed rental fee. The Daily Mail says that public confidence in the economy under the Labour government is at \"rock bottom\", just one week out from the Budget. They lead with results from a YouGov poll, which finds only 4% of those surveyed rated economic conditions as \"fairly good\".Budget speculation also reaches the front page of the Daily Express, which says new analysis offers proof that the pension triple lock \"must stay\". The paper says that millions of people will suffer \"pensioner poverty\" if Chancellor Rachel Reeves \"bows to pressure and allows pensioners' incomes to be whittled away\".\"Home investors pull £26bn from top London stocks despite blistering rally,\" declares the Financial Times, warning that the Budget is fuelling nervousness in investors amid a \"heightened sense of impending doom\". However, the paper says that the FTSE 100 is on course for its best year since its rebound from the financial crisis in 2009.The Metro alleges that a prestigious fertility clinic has been hacked by a group with links to Russian President Vladimir Putin. The paper says the ransomware gang, Qilin, is believed to have infiltrated the clinic's computer systems last month.Adam Peaty and Holly Ramsey are pictured on the front page of the Daily Star, after the Olympic swimmer said his family were \"encouraging false claims\" ahead of the pair's upcoming nuptials.Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'North Sea stand-off' and 'Council tax hike for millions'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5285/live/23468d20-c5a4-11f0-a892-01d657345866.png"
      ],
      "datePublished": "2025-11-20T00:58:05.000Z",
      "dateModified": "2025-11-20T00:58:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paris court blocks auction of earliest-known calculator",
    "url": "https://www.bbc.com/news/articles/c2kpkq90ygno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7fc5/live/eeb76140-c5a0-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-11-20T02:03:14.000Z",
    "description": "One of the world's first calculating machines will not go to auction as scheduled, France, after a Paris court provisionally blocked the historic item",
    "body": "One of the world's first calculating machines will not go to auction as scheduled, France, after a Paris court provisionally blocked the historic item from being export.Auction house Christie's has confirmed it will not proceed with a bid for the machine La Pascaline, developed by the French mathematician Blaise Pascal in 1642.Valuations suggested the machine could fetch €2 to 3m (£1.77m to £2.65m). Christie's called it the \"most important scientific instrument ever offered at auction\".Scientists and researchers made a legal appeal to grant heritage protections to the historic instrument, arguing it should be classified as a \"national treasure\".Pascal was just 19 years old when he developed the earliest version of a calculator, Christie's said. There are only nine of these machines still in existence.\"It is the first attempt in history to substitute the human mind with a machine,\" the official collection description reads.\"Its invention marks a breakthrough, a 'quantum leap' whose importance and significance take on a very special meaning today\".La Pascaline was exhibited at Christie's venues in New York and Hong Kong throughout the year. The machine was included in Christie's auction of the library of the late Catalonia collector Léon Parcé, which also featured Pascal's philosophical piece Pensées and the first printed version of \"Pascal's wager\".On Wednesday, a Paris administrative court temporarily blocked an earlier export authorisation provided by France's culture minister in May. Two experts had signed off on the minister's certificate, including one from the Louvre Museum.The judge concluded there were \"serious doubts\" over the legality of the certificate, a statement from the Paris court said, adding the decision was provisional until a final judgment is delivered.In a statement to the AFP news agency, a Christie's spokesperson said: \"Given the provisional nature of this decision and in accordance with the instructions of its client, Christie's is suspending the sale of La Pascaline\". The court noted La Pascaline's historic and scientific value could qualify as a \"national treasure\" guaranteeing protections under the France's heritage code.French heritage group, Association Sites & Monuments, which was listed as an applicant, welcomed the decision.with additional reporting by Sebastian Usher, Global Affairs reporter",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paris court blocks auction of earliest-known calculator",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7fc5/live/eeb76140-c5a0-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-20T02:03:14.000Z",
      "dateModified": "2025-11-20T02:03:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Albanian PM accuses Mahmood of 'ethnic stereotyping'",
    "url": "https://www.bbc.com/news/articles/cge5e1xpgzyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bf7d/live/84b04210-c598-11f0-a807-c90a622aa179.jpg",
    "tag": "Trending",
    "date": "2025-11-19T23:14:25.000Z",
    "description": "5 hours agoSam FrancisPolitical reporterEPAAlbania's prime minister accused Home Secretary Shabana Mahmood of \"ethnic stereotyping\" after she singled ",
    "body": "5 hours agoSam FrancisPolitical reporterEPAAlbania's prime minister accused Home Secretary Shabana Mahmood of \"ethnic stereotyping\" after she singled out Albanian families in a speech about abuses of the asylum system.Edi Rama criticised Mahmood for telling MPs around 700 Albanian families were \"living in taxpayer-funded accommodation having failed their asylum claims\" as she announced major reforms on Monday.Rama called the number a \"statistical drop in the ocean of post-Brexit Britain's challenges\".Official data show the UK has deported more than 13,000 people to Albania since a returns deal was signed in 2022. Rama called the deal one of \"Europe's most successful partnerships on illegal migration.\"Mahmood's comments came as she announced major changes to the UK's \"out of control and unfair\" asylum system.Speaking in the House of Commons, Mahmood said: \"If we fail to deal with this crisis, we will draw more people down a path that starts with anger and ends in hatred.\"The reforms will make refugee status temporary, extend the wait for permanent settlement from five years to 20, and allow the removal of families with children who have no right to remain. Alongside tightening access to refugee status, the UK would create new legal routes to the UK, with an annual cap on numbers.As part of her speech, Mahmood told MPs \"we must remove those who have failed asylum claims, regardless of who they are\".\"There are, for instance, around 700 Albanian families living in taxpayer-funded accommodation having failed their asylum claims - despite an existing returns agreement, and Albania being a signatory to the European convention on human rights,\" she added.Posting on social media, Rama said: \"How can a Labour Home Secretary so poorly echo the rhetoric of the populist far-right – and single out 700 Albanian families, a statistical drop in the ocean of post-Brexit Britain's challenges – precisely at a moment when the UK and Albania have built one of Europe's most successful partnerships on illegal migration?\"\"Let us also be clear: Albanians are net contributors to the British economy, and the number of Albanians receiving UK benefits is very low relative to other communities. \"To single them out again and again is not policy - it is a troubling and indecent exercise in demagoguery.\"Official policy should never be driven by ethnic stereotyping. That is the very least humanity expects from the great Great Britain.\"Rama has repeatedly clashed with British politicians over their descriptions of Albanian nationals. In May, Sir Keir Starmer travelled to the Albanian capital Tirana only to be told by Rama he would not host UK \"return hubs\" for failed asylum seekers from other countries.During the same press conference, Rama accused the previous Conservative government of \"stigmatising\" Albanians and warning that \"cursing the Albanians was not a good idea, because the curse went back and they are now out of the parliament\".A combative figure on social media, Rama has also previously invited Reform UK leader Nigel Farage to come to Albania to debate his claim one in 50 Albanians in Britain were in prison. Rama dismissed the figure as \"bonkers\" and accused Farage of peddling \"post-truth Brexit playbook\" politics. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Albanian PM accuses Mahmood of 'ethnic stereotyping'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bf7d/live/84b04210-c598-11f0-a807-c90a622aa179.jpg"
      ],
      "datePublished": "2025-11-19T23:14:25.000Z",
      "dateModified": "2025-11-19T23:14:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reform MS Laura Anne Jones suspended from Senedd over racial slur",
    "url": "https://www.bbc.com/news/articles/crregkj885do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3bfc/live/1b27b380-c4a5-11f0-b1f8-8b57d1c9aaed.jpg",
    "tag": "Trending",
    "date": "2025-11-19T21:11:51.000Z",
    "description": "7 hours agoAdrian BrowneWales political reporterReform's only Welsh Parliament member has been banned from the Senedd chamber for 14 days after using ",
    "body": "7 hours agoAdrian BrowneWales political reporterReform's only Welsh Parliament member has been banned from the Senedd chamber for 14 days after using a racial slur to describe Chinese people.Laura Anne Jones apologised for breaking the parliament's code of conduct over her behaviour, including the offensive comments made in a WhatsApp chat in August 2023.In an emotional statement in the Senedd, she said investigations by police and Senedd standards commissioner, which cleared her of making fraudulent expenses claims, had a hugely detrimental effect on her mental health.The suspension, imposed by fellow Senedd members, stops her taking part in proceedings for two weeks and docks her pay.Senedd standards commissioner Douglas Bain found that Jones had both made offensive comments on WhatsApp and not taken action when one of her staff members had made separate offensive comments on the same messaging service.On Wednesday evening, standards committee chair, Labour's Hannah Blythyn, told the Senedd: \"The committee considers a breach of the code of conduct by any member of the Senedd a serious matter, and we are clear that inappropriate and offensive comments have no place in our Senedd or society.\"More widely, the conduct found in the commissioner's report fell far below the standards expected, and points to an office culture where there was little respect towards others or any consideration of what may be found offensive.\" Jones apologised for the WhatsApp exchanges, but said she had faced the expenses allegations she was cleared on for nearly two years.They \"had a negative impact on my family, especially my children, as well as a hugely detrimental impact on my own health and mental health,\" she said.She said the allegations had \"taken a significant toll on me, which led me to try and drown out that noise and nearly take my own life a number of times\".\"Hasten to say, I wouldn't wish what I've had to experience on my worst enemy,\" she added.Jones will be able to take her seat in the Senedd once more from Wednesday 3 December.Jones represents South Wales East in Wales' parliament, and was a Conservative member at the time of the allegations before defecting to Reform in July and giving the party a seat in Cardiff Bay for the first time.If you have been affected by the issues raised in this story, help and support is available via the BBC Action Line",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reform MS Laura Anne Jones suspended from Senedd over racial slur",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3bfc/live/1b27b380-c4a5-11f0-b1f8-8b57d1c9aaed.jpg"
      ],
      "datePublished": "2025-11-19T21:11:51.000Z",
      "dateModified": "2025-11-19T21:11:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Keir Starmer: Growing up as young man 'not easy' says PM in letter to son",
    "url": "https://www.bbc.com/news/articles/ckgkgnk7nyeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b5d2/live/a9b79940-c576-11f0-a892-01d657345866.png",
    "tag": "Trending",
    "date": "2025-11-19T21:51:29.000Z",
    "description": "6 hours agoSam FrancisPolitical reporterSir Keir Starmer/InstagramSir Keir Starmer has said it is \"not easy\" for young men \"growing up in this day and",
    "body": "6 hours agoSam FrancisPolitical reporterSir Keir Starmer/InstagramSir Keir Starmer has said it is \"not easy\" for young men \"growing up in this day and age\", in an open letter to his son to marking International Men's Day.The prime minister urged men to talk openly about their mental health, reflecting on his strained relationship with his own father who he \"never really  spoke\" to.His comments come as the government launched England's first men's health strategy, aimed at tackling issues predominantly faced by men such as suicide, alcohol abuse and problem gambling.In the letter to his 17-year-old son, who he has not publicly named, Sir Keir said there were \"pressures on young men that are difficult to talk about\".Sir Keir also spoke about his experience of not having \"a very close relationship with my own dad\" shaped his relationship with his own children.The prime minister has made much of his background, repeatedly mentioning in speeches his father was a toolmaker and his mother a nurse, who suffered from a debilitating form of arthritis known as Still's disease.In his letter, Sir Keir wrote that he and his father \"never really spoke\" and \"never really got to know each other\".The prime minister said spending time with his son was \"one of the highlights of my week\".\"You've grown into a confident, kind, wonderful young man. And I'm so proud of you,\" he wrote.\"If there's one hope I have, it's that we keep talking, keep learning from each other, keep helping each other.\"Sir Keir also acknowledged the strain his job places on family life, saying he is acutely aware of the \"huge sacrifices\" made by his wife and children since he entered Downing Street. \"The reason I do the job I do, and I know that means huge sacrifices for you, for your sister and your mum, is because I want the world for tomorrow's generation to be better,\" he said.In his letter, Sir Keir wrote that watching Adolescence, the hit Netflix series about a 13-year-old arrested for stabbing a classmate, with his son had helped shaped his perspective on the problems facing young men.The prime minister previously invited the shows creators to a Downing Street meeting to discuss the influence of toxic material online.Sir Keir also used his weekly Prime Minister's Questions (PMQs) session to mark International Men's Day.He praised fellow Labour MP Luke Charters for sharing his mental health battle after nearly losing his wife in the traumatic birth of their first child, saying others would \"be inspired to talk openly about their experiences\".PMQs however was dominated by preparations for what is looking to be a bruising Budget for the prime minister.Conservative leader Kemi Badenoch has said the government's Budget is unravelling before it has even been delivered, after the chancellor appeared to back away from raising income tax rates following weeks of damaging stories.Sir Keir has also been forced to deny he authorised attacks on cabinet colleagues after a flurry of briefings to the press claimed ministers, including Health Secretary Wes Streeting, were plotting leadership bids.As part of the new men's health stratergy, the government has promised £3.6m over the next three years to suicide prevention projects for middle-aged men in local communities where they are most at risk of taking their own lives.Suicide is one of the biggest killers of men under 50 and three-quarters of all suicides are in men.A three-year partnership with the Premier League will also embed mental health messaging into football matches and fan spaces. The Department of Health said men are less likely to seek help and more likely to smoke, drink, gamble and use drugs than women.Under the plans, a new levy will be charged on betting companies - while the government will trial ways to reduce cocaine and alcohol-related deaths, including workplace pilots to bring health checks into male-dominated industries.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Keir Starmer: Growing up as young man 'not easy' says PM in letter to son",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b5d2/live/a9b79940-c576-11f0-a892-01d657345866.png"
      ],
      "datePublished": "2025-11-19T21:51:29.000Z",
      "dateModified": "2025-11-19T21:51:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Instagram and Facebook-owner Meta notifies Australian teens of accounts shutdown",
    "url": "https://www.bbc.com/news/articles/cz919xyx7weo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/df66/live/e58d6e40-c567-11f0-ac47-e3b40c46275e.jpg",
    "tag": "Trending",
    "date": "2025-11-19T17:31:45.000Z",
    "description": "11 hours agoDearbail Jordan and Simon AtkinsonYounger Australian teenagers on Instagram, Facebook and Threads are being told their accounts will be sh",
    "body": "11 hours agoDearbail Jordan and Simon AtkinsonYounger Australian teenagers on Instagram, Facebook and Threads are being told their accounts will be shut down ahead of the country's social media ban for under-16s.Meta, which owns the three brands, said it had begun notifying users it believes to be between 13 and 15 years old by text, email and in-app messages that their accounts would start being deactivated from 4 December.The ban in Australia comes into force on 10 December. It affects a number of platforms which also include TikTok, YouTube, X and Reddit.Prime Minister Anthony Albanese said the \"world-leading\" ban was aimed at \"letting kids be kids\". Meta and other firms oppose the measure but said they would comply. Australia's internet regulator has estimated there are 150,000 Facebook users and 350,000 teens on Instagram in the 13-15 age bracket.From 4 December, children aged below 16 will not be able to create accounts on Meta's social media platforms. The company said it was asking young users to update their contact details so they could be notified when they became eligible to open an account. They can download and save their posts, videos and messages before their accounts are shut down.Meta said that teens who said they were old enough to use Instagram, Facebook and Threads could challenge the restriction by taking a \"video selfie\" to be used in facial age scans.They could also provide a driver's licence or other government issued-ID.All these verification methods were tested by the UK-based Age Check Certification Scheme (ACCS) earlier this year, in a report commissioned by the Australian state.While the ACCS said that all methods had their merits, it added: \"We did not find a single ubiquitous solution that would suit all use cases, nor did we find solutions that were guaranteed to be effective in all deployments.\"Social media platforms which fail to take \"reasonable steps\" to block under-16s face fines of up to A$50m (£25m). \"While we are working hard to remove all users who we understand to be under the age of 16 by 10 December, compliance with the law will be an ongoing and multi-layered process,\" Antigone Davis, vice-president and global head of safety at Meta, told Reuters Financial.Meta wants to see a law where under-16s have to get parental approval before they download a social media app. The firm told Australia's Seven News: \"Teens are resourceful, and may attempt to circumvent age assurance measures to access restricted services.\"But it said: \"We're committed to meeting our compliance obligations and are taking the necessary steps to comply with the law.\"Australia's e-Safety Commissioner, Julie Inman Grant, said the ban was aimed at proctecting teens \"from pressures and risks they can be exposed to while logged in to social media accounts\".In a move seemingly to avoid being included in the ban, gaming platform Roblox this week announced that children under 16 would be unable to chat to adult strangers.Mandatory age checks will be introduced for accounts using chat features, starting in December for Australia, New Zealand and the Netherlands, then the rest of the globe from January.The e-safety commissioner has published a list of which social media platforms will be impacted by the age ban.They are: FacebookInstagramKickRedditSnapchatThreadsTikTokX (formerly Twitter)YouTubePlatforms not included are:DiscordGitHubGoogle ClassroomLEGO PlayMessengerRobloxSteam and Steam ChatWhatsAppYouTube Kids",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Instagram and Facebook-owner Meta notifies Australian teens of accounts shutdown",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/df66/live/e58d6e40-c567-11f0-ac47-e3b40c46275e.jpg"
      ],
      "datePublished": "2025-11-19T17:31:45.000Z",
      "dateModified": "2025-11-19T17:31:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I'm always disappointed - Why you should stop being a perfectionist",
    "url": "https://www.bbc.com/news/articles/c5yl1y5gep8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/334e/live/1fb8b7d0-c56a-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-11-20T01:12:04.000Z",
    "description": "Perfectionism isn't all that perfect – how to stop it holding you back3 hours agoHannah KarpelBBC NewsBBC\"It feels like I am constantly setting myself",
    "body": "Perfectionism isn't all that perfect – how to stop it holding you back3 hours agoHannah KarpelBBC NewsBBC\"It feels like I am constantly setting myself up for failure or disappointment,\" says AswanPerfectionism has a great reputation. It's one of the most common answers used in a job interview to spin the dreaded \"What's your weakness?\" into a humblebrag.For many, it's about striving for excellence or working tirelessly to reach the highest standard.But what happens when these high (and sometimes unrelenting) expectations of yourself are exactly what's holding you back?\"I know perfectionism is an illusion, but I am always trying to chase it,\" admits 25-year-old Aswan.Even in the workplace, she feels the pressure, \"I know that I can make a mistake and I won't lose my job, yet I constantly feel like I'm one strike away from being fired\".It's an anxiety shared by many perfectionists, says health psychologist Dr Sula Windgassen. Speaking on the BBC Sounds podcast Complex, she explains: \"Poor self-esteem tends to go hand in hand with perfectionism because there is this fear of failing\".That fear often fuels procrastination. Aswan remembers taking her driving theory test: \"I got so pent up about passing it first time that when I failed by a couple of points I've never tried to get it back.\" That was almost four years ago.Perfectionism can be rooted in personality, but childhood experiences, school environments, and parental expectations can also shape what we grow up believing is \"good enough\".Breaking the cycleWhile perfectionism isn't a clinical diagnosis, its effects are very real - from anxiety and tiredness to stress-related physical symptoms such as a weakened immune system.Still, experts say the cycle can be broken. Dr Windgassen suggests beginning what's known in psychology as a behavioural experiment.It starts by asking yourself what you think will happen if the outcome isn't perfect - writing down your predictions, and then testing them in real time.Was the outcome as bad as you expected? And what positive things came from this new approach? It might be that you manage to go to sleep at 10pm rather than 1am, leaving you feeling more refreshed.Over the years, Dayna says she has learned to quiet her harsh inner criticFor 26-year-old Dayna, who describes herself as a \"former perfectionist\", it's a trait she is relieved to have left behind. She once sacrificed her wellbeing in pursuit of flawless results and it's something she never wants to repeat.\"I kept a journal to gain more self-awareness about my tendencies and read self-help books,\" says Dayna. \"I had to learn the hard way how to develop coping mechanisms and strategies to not sacrifice everything and that being a perfectionist is not a noble quality as I used to think it might be.\"At times, her harsh inner critic took over and eventually the path to perfectionism led to burnout.Looking back, Dayna remembers feeling chronically anxious and stressed.\"Right now I have become content with just trying my best and accepting that I can't always get the outcome I want but the outcome I get will be more than good enough and I am at peace with that now.\"Not all perfectionism is necessarily harmful. One form, known as perfectionistic striving, focuses on setting more ambitious personal goals. When these goals can be adapted in response to changing circumstances, they tend to cause less stress and lead to more positive outcomes. For example, an athlete setting tough goals, but cutting back on training when they're injured.But it still has its limitations. A research paper published in July 2025 by the British Psychological Society found that aiming for excessively high goals often leads to long working hours, with only marginal gains in performance.Working through these perfectionistic tendencies can be uncomfortable, says Dr Windgassen - but that discomfort is part of the process.\"That's not a sign that you shouldn't do it - it's a sign that you should,\" she says.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I'm always disappointed - Why you should stop being a perfectionist",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/334e/live/1fb8b7d0-c56a-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-20T01:12:04.000Z",
      "dateModified": "2025-11-20T01:12:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Top US officials in Ukraine for talks on ending war with Russia",
    "url": "https://www.bbc.com/news/articles/cvgdgrqwnq9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/66be/live/44cc5b80-c57e-11f0-9053-4f5f8839bda7.jpg",
    "tag": "Trending",
    "date": "2025-11-20T02:32:13.000Z",
    "description": "Senior Pentagon officials have arrived in Ukraine to \"discuss efforts to end the war\" with Russia, the US military has said.The team, led by US Army S",
    "body": "Senior Pentagon officials have arrived in Ukraine to \"discuss efforts to end the war\" with Russia, the US military has said.The team, led by US Army Secretary Dan Driscoll, is expected to meet Ukrainian President Volodymyr Zelensky in Kyiv on Thursday when he returns from a trip to Turkey.Reports began surfacing on Wednesday that the US and Russia had prepared a new peace plan, containing major concessions from Ukraine. Neither Washington nor Moscow has officially confirmed the plan.Earlier in the day, at least 26 people were killed in a Russian missile and drone attack on Ukraine's western city of Ternopil, officials there said. Russia launched a full-scale invasion of Ukraine in 2022. \"Secretary Driscoll and team arrived this morning in Kyiv on behalf of the administration on a factfinding mission to meet Ukrainian officials and discuss efforts to end the war,\" Army spokesman Col David Butler said in a statement.Driscoll is joined by the US Army's chief of staff Gen Randy George, top US army commander in Europe Gen Chris Donahue, and Srg Maj of the Army Michael Weimer.Driscoll and Gen George are the most senior US military officials to hold talks in the Ukrainian capital since President Donald Trump took office in January.An image on Wednesday showed Driscoll meeting and shaking hands with Ukrainian Defence Minister Denys Shmyhal.In a post on X afterwards, Shmyhal said: \"We focused on the next steps for implementing the historic defence agreements reached by President Zelensky and President Trump\".He also thanked Washington for \"approving the sale of a support package for the PATRIOT air-defence system worth approximately $105m (£80m)\".Earlier, a Ukrainian official told CBS, the BBC's US media partner, that talks on the trip would focus on the military situation on the ground - as well as plans for a possible ceasefire. The official - who was not named - said: \"Presidents Zelensky and Trump have already agreed to stop the conflict along the existing lines of engagement, and there are agreements on granting security guarantees\".It comes as a number of outlets are reporting that the US and Russia have privately drawn up proposals on how to end the war.Citing people familiar with the matter, Axios, the Financial Times and Reuters reported that the plans call for Kyiv to give up some territories and weapons, as well as to significantly cut Ukraine's Armed Forces.Trump's special envoy Steve Witkoff and Russian leader Vladimir Putin's envoy Kirill Dmitriev are believed to have been involved in working on the 28-point peace plan.The BBC has asked the White House and a representative for Witkoff to comment.Kremlin spokesman Dmitry Peskov appeared to downplay the reports.\"In this case, we have no additional innovations to what we call 'the spirit of Anchorage',\" he told Russia's state-run media on Wednesday - referring to the August summit between Putin and Trump in the US state of Alaska.Any agreements reached during the one-day meeting have not been made public.President Zelensky has repeatedly ruled out any territorial concessions to Russia.Kyiv and its Western allies, including the US, have been calling for an immediate ceasefire along the vast front line, but Moscow has ruled that out, repeating demands that Ukraine says amount to its de facto capitulation.Earlier this month, Russian Foreign Minister Sergei Lavrov said Moscow's pre-conditions for a peace deal - including ceding territory, tough curbs on the size of Ukraine's military and the country's neutrality - had not changed since Putin laid them out two months before the full-scale invasion.Meanwhile, a White House official confirmed to the BBC that special envoy to Ukraine Keith Kellogg will leave his post in January.He reportedly decided that this would be a natural end to his time in the post, which requires Senate approval beyond 360 days.Kellogg has been seen as an important advocate for Ukraine in the White House during a time when Trump has often appeared to side with Russia in the conflict. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Top US officials in Ukraine for talks on ending war with Russia",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/66be/live/44cc5b80-c57e-11f0-9053-4f5f8839bda7.jpg"
      ],
      "datePublished": "2025-11-20T02:32:13.000Z",
      "dateModified": "2025-11-20T02:32:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ex-Harvard president Larry Summers stops teaching while university investigates Epstein emails ",
    "url": "https://www.bbc.com/news/articles/ce868dmz2mdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d846/live/b4823b60-c598-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-11-20T02:44:38.000Z",
    "description": "2 hours agoMadeline Halpert and Brandon DrenonHarvard University professor Larry Summers is taking leave while the school investigates his and others'",
    "body": "2 hours agoMadeline Halpert and Brandon DrenonHarvard University professor Larry Summers is taking leave while the school investigates his and others' ties with late sex offender Jeffrey Epstein, a spokesperson confirmed.The former US treasury secretary and onetime Harvard president will stop teaching and step back as director of the Mossavar-Rahmani Center for Business and Government at the Harvard Kennedy School.A spokesperson told the BBC's US partner, CBS News, that Summers believes \"it's in the best interest of the Center\".Recently released emails indicate that Summers corresponded with Epstein until the day before the financier's 2019 arrest for the alleged sex trafficking of minors. In a statement to The Harvard Crimson, the university said it was \"conducting a review of information concerning individuals at Harvard included in the newly released Jeffrey Epstein documents\". The BBC has contacted Summers for comment on Harvard's new review.On Tuesday, Summers addressed his communication with Epstein to students in a class he had been teaching at Harvard.\"Some of you will have seen my statement of regret, expressing my shame with respect to what I did in communication with Mr. Epstein. And that I've said that I'm going to step back from public activity,\" Summers told his students, according to a video recorded by a student. \"I think it's very important to fulfill my teaching obligations. So with your permission, we're going to go forward and talk about the material in the class.\"But on Wednesday night, Summers spokesperson Steven Goldberg said in the statement provided to CBS that \"co-teachers will complete the remaining three class sessions of the courses he has been teaching with them this semester, and he is not scheduled to teach next semester\".The public fallout for Summers began after Congress released over 20,000 pages of documents from the so-called Epstein files last week, which included multiple emails between Epstein and Summers.Time stamps from the emails showed the two communicated up until the day before Epstein's arrest - a decade after he pleaded guilty for soliciting prostitution from an underage girl.A married father of six, Summers messaged Epstein in November 2018 seemingly asking for romantic advice related to his interest in someone he said viewed him as an \"economics mentor\".\"Think for now I'm going nowhere with her except economics mentor,\" Summers wrote in one exchange where Epstein referred to himself as Summers' \"wing man\".\"Am I thanking her or being sorry re my being married. I think the former,\" he wrote in another email.The emails also indicated that Summers and Epstein dined together frequently, with Epstein often trying to connect Summers to prominent global figures. No Epstein survivor has accused Summers of misconduct, and there is no publicly available evidence indicating that he was involved in any of Epstein's crimes.Summers announced earlier Wednesday that he was leaving the board of OpenAI, and the artificial intelligence company said it respected Summers' decision to resign. \"We appreciate his many contributions and the perspective he brought to the Board,\" OpenAI said. He joined the board of OpenAI, which makes ChatGPT, in 2023 - following a failed attempt to oust its chief executive, Sam Altman. Summers said in a statement to the BBC about the move that he was \"grateful for the opportunity to have served, excited about the potential of the company, and look forward to following their progress\".After the emails were shared with the public, Summers said he took \"full responsibility for my misguided decision to continue communicating with Mr Epstein\". He added that he wanted \"to rebuild trust and repair relationships with the people closest to me\".Summers held senior posts under two Democratic presidents; serving as treasury secretary under Bill Clinton, and as director of the National Economic Council under Barack Obama. He led Harvard from 2001 to 2006 and remains a professor there. The Center for American Progress, a liberal think tank in Washington where Summers was a senior fellow, also has confirmed that Summers is no longer affiliated with the organisation.Both chambers of Congress agreed on Tuesday to pass a measure to require the US justice department to release its files on Epstein, setting up the possible release of tens-of-thousands more documents. President Donald Trump signed the bill on Wednesday, after reversing his position on the issue following pushback from his supporters. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ex-Harvard president Larry Summers stops teaching while university investigates Epstein emails ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d846/live/b4823b60-c598-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-20T02:44:38.000Z",
      "dateModified": "2025-11-20T02:44:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Norwich MP Clive Lewis offers seat to Burnham for Starmer challenge",
    "url": "https://www.bbc.com/news/articles/c4gwgdyl52lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c9d2/live/3865df80-c563-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-11-19T18:14:52.000Z",
    "description": "10 hours agoPaul Moseley,Norfolk political reporter and Brian Wheeler,Political reporterLabour MP Clive Lewis has offered to give up his seat to allow",
    "body": "10 hours agoPaul Moseley,Norfolk political reporter and Brian Wheeler,Political reporterLabour MP Clive Lewis has offered to give up his seat to allow Andy Burnham to challenge Sir Keir Starmer for the Labour leadership.There has been ongoing speculation that Greater Manchester Mayor Burnham wants to take on Sir Keir for the top job, but he would need to be an MP to do so.Lewis told the BBC's Politics Live that he was willing to step down from his Norwich South seat to allow Burnham to return to the Commons and put \"country before party, party before personal ambition\".Burnham was contacted for comment. Number 10 declined to comment.Lewis, who has been an MP for 10 years, said he had spoken to Burnham, and when asked if he would give up his seat for him, he said it was \"a question I've asked myself\".He added: \"Do you know what? If I'm going to sit here and say country before party, party before personal ambition, then yes, I have to say yes, don't I.\"Last week, he said Sir Keir's position as prime minister was \"untenable\" and told Channel 4 News that Burnham should be given the chance to \"step up\".Later, the Sun's political editor Kate Ferguson said that Lewis had told her he had \"no plans to stand down\".She reported on X that he said: \"A hypothetical question was put to me, and my answer was consistent with what I've been saying, that I am serious about putting country before party.\"Lewis first won his seat in 2015, and last year he increased his majority to more than 13,000.But if he were to step down, any would-be successor would first need to win a selection contest before a by-election was held.Health Secretary Wes Streeting - who last week denied claims he was plotting a leadership bid of his own - told LBC he thought it was a \"peculiar\" move by the Norwich South MP. \"I've got a lot of time for Andy and I think we need our best players on the pitch,\" Streeting said. \"And whether he's doing that as mayor of Greater Manchester or whether he wants to come back into parliament in the next general election, that is an issue for Andy.\"I think it's a bit of a peculiar thing for Clive to have said to his own constituents, 'Oh, well, I'm not interested in being your MP, I'm happy to do a deal with someone'. \"I would just say from personal experience, don't take your voters for granted.\"In September, Burnham said he had \"no intention of abandoning Manchester\" but did not rule out challenging Sir Keir after a series of interviews in which he said colleagues had been urging him to stand.Two Manchester Labour MPs, Andrew Gwynne and Graham Stringer, ruled out standing down for him ahead of the party's conference in September.Sir Keir has, meanwhile, said he will lead Labour into the next general election. It came after a bruising time last week, when anonymous briefings were given to journalists that some cabinet ministers - including Streeting - were plotting to oust him.The ministers concerned have insisted this is not the case - but speculation continues about whether the PM will face a challenge in May, when Labour is expected to do badly in Scottish and Welsh elections, and in English local elections. Anyone mounting a leadership bid would have to secure the backing of 80 Labour MPs.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Norwich MP Clive Lewis offers seat to Burnham for Starmer challenge",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c9d2/live/3865df80-c563-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-19T18:14:52.000Z",
      "dateModified": "2025-11-19T18:14:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]