[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - (Another) Plan to Close Migrant Hotels - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mcbndg?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-10-28T19:41:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·28 Oct 2025,·34 mins(Another) Plan to Close Migrant HotelsNewscastAvailable for over a yearToday, hundreds of asylum seekers could be housed in two military sites in Inverness and East Sussex as the government seeks to end the use of hotels.\nMinisters are considering housing 900 men in the Cameron Barracks in Inverness and Crowborough army training camp in East Sussex. There are around 32,000 asylum seekers currently being housed in hotels. Adam and Chris discuss whether this will help with government’s pledge to end the use of asylum hotels by 2029.\nAnd, there are fears of mass killings as Sudan’s civil war appears to have reached a significant turning point. More than 150,000 people have died in the conflict across the country, and about 14 million have fled their homes. Adam is joined by chief international correspondent Lyse Doucet and Kholood Khair a Sudanese political analyst and director of Khartoum think tank Confluence Advisory.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers.\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Lucy Gape. The social producer was Joe Wilkinson. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - (Another) Plan to Close Migrant Hotels - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-10-28T19:41:00.000Z",
      "dateModified": "2025-10-28T19:41:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Americanswers…on 5 Live! Will Kamala Harris (and Donald Trump) run for president again? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mc3v1g?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-10-27T18:35:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·27 Oct 2025,·32 minsAmericanswers…on 5 Live! Will Kamala Harris (and Donald Trump) run for president again?AmericastAvailable for over a yearIt’s just over a year since the 2024 presidential election but attention is already turning to 2028 with both candidates from last year’s race expressing a desire to run again. Kamala Harris told the BBC over the weekend that she “wasn’t done” with public service, while Donald Trump said on Monday morning that he’d “love” to stand again for a third term. We answer your questions on whether Donald Trump plans to override the constitution for a third term in office, and whether he’d have support of the American public.\nMeanwhile, the president is back in construction, this time building a new ballroom at the White House, which has involved demolishing the 103-year-old East Wing in the process. We answer your questions on whether Trump is allowed to demolish parts of the White House and who’s actually paying for the changes. \nAnd, after Kamala Harris’s interview with the BBC, Justin and Anthony take a bit of time off air to chat through some of the issues she spoke about with Laura Kuenssberg and the circumstances surrounding Joe Biden’s eventual decision to withdraw from the election. \nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Anthony Zurcher, North America Correspondent\nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Rufus Gray with Grace Reeve. The technical producers were Jack Graysmark and Stephen Bailey. The series producer is George Dabby. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Americanswers…on 5 Live! Will Kamala Harris (and Donald Trump) run for president again? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-10-27T18:35:00.000Z",
      "dateModified": "2025-10-27T18:35:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Teenage cricketer dies in Melbourne after being hit by ball  ",
    "url": "https://www.bbc.com/news/articles/c0rp0w5y0zko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/aa3d/live/28995570-b53f-11f0-9ad7-5dd473fc10b0.jpg",
    "tag": "Trending",
    "date": "2025-10-30T04:54:37.000Z",
    "description": "An Australian teenager has died after he was hit by a cricket ball during a practice session in Melbourne.Ben Austin, 17, was training - with a helmet",
    "body": "An Australian teenager has died after he was hit by a cricket ball during a practice session in Melbourne.Ben Austin, 17, was training - with a helmet but no neck guard - in cricket nets in Ferntree Gully on Tuesday when he was hit in the neck by a ball thrown using a handheld ball launcher. Emergency workers attended the scene around 17:00 local time (06:00 GMT) before Ben was rushed to hospital in critical condition. He was put on life support but died on Thursday.Ben's dad Jace Austin said the family was \"utterly devastated\" by the death of \"our beautiful Ben\" while Cricket Victoria said the cricketing community across the country would be mourning the teenager's death.In a statement, Jace Austin shared details of his family's loss. \"For Tracey and I, Ben was an adored son, deeply loved brother to Cooper and Zach and a shining light in the lives of our family and friends,\" he said. \"This tragedy has taken Ben from us, but we find some comfort that he was doing something he did for so many summers - going down to the nets with mates to play cricket.\"He loved cricket and it was one of the joys of his life.\"Mr Austin said the family was also supporting Ben's teammate who was bowling in the nets when the accident happened.\"This accident has impacted two young men and our thoughts are with he and his family as well,\" he said.He also thanked the local cricketing community for their support since the accident and praised the first responders and medical staff who helped his son. Cricket Victoria chief executive officer Nick Cummins said it was an \"extremely challenging time\" for all involved.\"The ball hit him in the neck in a similar accident that Phil Hughes suffered 10 years ago,\" Mr Cummins said, according to the Australian Broadcasting Corporation (ABC).In 2014, Australian cricketer Phillip Hughes died after being struck on the neck by a ball while batting in the Sheffield Shield.His death, for which a coroner ultimately found no-one was to blame, sparked improvements to safety equipment for those playing the sport.The ball that hit Ben was apparently launched by a thrower using a handheld device, commonly used to accelerate the speed of the ball and ease the strain of bowling on the shoulders.In a statement, Cummins said: \"The entire cricketing community in Victoria - and nationally - is mourning this loss and it will be something that will stay with us for a long time.\"He described Ben as a talented player, popular teammate and captain who was well- known in under-18 circles in Melbourne's south east.\"It is heartbreaking to see a young life cut so short, while Ben was doing something that he loved so much,\" Mr Cummins said. Ben played for the Ferntree Gully Cricket Club who, in a social media post, paid tribute to the youngster as someone who brought joy to many. The club also called on friends and supporters to \"put your bats out for Benny\", mirroring a similar gesture that was made for Hughes.The Waverley Park Hawks Junior Football Club, for which Ben played more than 100 games, said he was \"kind\", \"respectful\" and a \"fantastic footballer\".\"Our club and community have lost a truly great young person who was developing into a fine young adult and his loss will be felt keenly by our club for many years to come.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Teenage cricketer dies in Melbourne after being hit by ball  ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/aa3d/live/28995570-b53f-11f0-9ad7-5dd473fc10b0.jpg"
      ],
      "datePublished": "2025-10-30T04:54:37.000Z",
      "dateModified": "2025-10-30T04:54:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-10-30T05:40:02.000Z",
    "description": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and p",
    "body": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-10-30T05:40:02.000Z",
      "dateModified": "2025-10-30T05:40:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lily Allen to tour West End Girl album in UK theatres",
    "url": "https://www.bbc.com/news/articles/cly91q251ljo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/161e/live/8b991510-b572-11f0-ba75-093eca1ac29b.jpg",
    "tag": "Trending",
    "date": "2025-10-30T10:40:53.000Z",
    "description": "2 hours agoSteven McIntoshEntertainment reporterSinger Lily Allen has announced she will perform her new album in its entirety when she tours the UK i",
    "body": "2 hours agoSteven McIntoshEntertainment reporterSinger Lily Allen has announced she will perform her new album in its entirety when she tours the UK in March 2026.West End Girl has become one of the most talked about albums of the year since its release last Friday, due to its candid lyrics.The album details some of the events that led to the breakdown of her marriage to US actor David Harbour, best known for appearing in Stranger Things. The tour will stop in Glasgow, Liverpool, Birmingham, Sheffield, Newcastle, Manchester, Nottingham, Cambridge, Bristol and Cardiff, before concluding with two nights at the London Palladium. Allen last toured between 2018 and 2019, following the release of her fourth studio album No Shame. She has only made occasional live appearances since then, such as appearing in Glastonbury sets by Olivia Rodrigo and Shy FX. However, in the intervening years, Allen has also become a successful stage actress, starring in the first production of 2:22 - A Ghost Story when it opened in the West End shortly after the pandemic.This period is what inspired the title of the album, West End Girl, and Allen appears to sing about how being cast the play sparked the chain of events that led to her separation from Harbour.In interviews, Allen has stressed the lyrics aren't necessarily the gospel truth - because she \"wasn't sure what was real, and what was in my head\" as she processed the end of the relationship.The album's lyrics, as well as interviews she gave at the time, suggest that Harbour was surprised and envious that Allen had secured a leading West End role without having to audition, and that his \"demeanour started to change\" after she was cast.She sings that starring in 2:22 led to a distance developing between the couple, both literally and metaphorically, which resulted in Harbour suggesting an open relationship.Allen sings on the record about how this led to an \"arrangement\" with Harbour where he could be with other women, but the rules were \"there had to be payment, it had to be with strangers\".But, before long, Allen hears of a relationship her husband appears to have with \"Madeline\" - a pseudonym - which falls outside their arrangement. Harbour has not publicly commented on the content of the album. However, he appears to still have a relationship with Allen and her children, and was seen taking her daughters to a theme park last weekend.All 14 songs on West End Girl were written by Allen, mainly in collaboration with her musical director Blue May.Allen has suggested that some of the songs are written \"in character\", saying that the lyrics \"could be considered autofiction\" - a genre that combines autobiography and fiction.She rose to fame in 2006 with her debut album Alright, Still, and had number one hits including Smile, The Fear, and her cover of Keane's Somewhere Only We Know, which was featured in a John Lewis advert.She had two number one albums in the UK, It's Not Me It's You and Sheezus, while her 2018 record No Shame was nominated for the Mercury Prize.She released a candid memoir, My Thoughts Exactly, in the same year, but took a break from music shortly afterwards, and began dating Harbour in 2019.The singer will perform West End Girl in the order the songs appear on the record for her tour in March.Tickets for the tour, which launches in March 2026, go on sale on 7 November. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lily Allen to tour West End Girl album in UK theatres",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/161e/live/8b991510-b572-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-30T10:40:53.000Z",
      "dateModified": "2025-10-30T10:40:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Daughter criticises Australia cruise operator after mother dies on island",
    "url": "https://www.bbc.com/news/articles/cwyndvj3640o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4410/live/3dade5e0-b560-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-30T02:10:16.000Z",
    "description": "Cruise operator 'failed' woman who was left on island and died, family says10 hours agoLana LamSydneySuppliedSuzanne Rees was found dead hours after h",
    "body": "Cruise operator 'failed' woman who was left on island and died, family says10 hours agoLana LamSydneySuppliedSuzanne Rees was found dead hours after her cruise boat left Lizard IslandThe daughter of a woman who was left behind by a cruise ship on a remote island and later found dead has accused the operator of a \"failure of care and common sense\".The body of Suzanne Rees, 80, was found by rescue workers on Lizard Island on the Great Barrier Reef on Sunday. The day before, she had been hiking on the island with her fellow passengers but was not on the ship when it left hours later.Katherine Rees said she was \"shocked and saddened\" that the Coral Adventurer left \"without my mum\", whom she described as healthy, active, a keen gardener and bushwalker.\"From the little we have been told, it seems that there was a failure of care and common sense,\" she said on Thursday.It's understood that Suzanne Rees, from New South Wales, was on the first stop of a 60-day cruise around Australia, which had left Cairns earlier this week.Passengers, who pay tens of thousands of dollars to join the cruise, were transported to the exclusive island for a day trip with the option of hiking or snorkelling.Suzanne joined a group hike to the island's highest peak, Cook's Look, but broke away from the others as she needed to rest. \"We understand from the police that it was a very hot day, and mum fell ill on the hill climb,\" Katherine said. \"She was asked to head down, unescorted. Then the ship left, apparently without doing a passenger count.\"At some stage in that sequence, or shortly after, mum died, alone.\"Katherine said she hoped a coronial inquiry would \"find out what the company should have done that might have saved Mum's life\".The Australian Maritime Safety Authority (Amsa) said it was investigating the death and would meet the ship's crew when it is due to dock in Darwin later this week.A spokesperson for Amsa said it was first alerted to the missing woman at around 21:00 local time (10:00 GMT) on Saturday by the ship's captain.A search party returned to the island a few hours later but efforts to find Suzanne were called off in the early hours of Sunday before a helicopter returned in the morning and found her body. On Wednesday, the chief executive of Coral Expeditions said the company was \"deeply sorry\" for the death and were offering their support to the Rees family. \"We are working closely with Queensland Police and other authorities to support their investigation. We are unable to comment further while this process is under way,\" Mark Fifield said. The Coral Adventurer caters for up to 120 guests with 46 crew, according to the company's website. It was purpose-built to access remote areas of Australia's coast and is equipped with \"tenders\" - small boats used to take passengers on day excursions.Incidents like this are rare, and cruise ships have systems to record which passengers are embarking or disembarking, Harriet Mallinson, cruise editor of travel website Sailawaze told the BBC.\"Sneaking ashore or [back] onboard just isn't an option,\" she said.Cruise lines take these procedures very seriously and have \"clever tech in place to prevent such incidents from happening. This is most likely a shocking - and tragic - one-off,\" Ms Mallinson added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Daughter criticises Australia cruise operator after mother dies on island",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4410/live/3dade5e0-b560-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-30T02:10:16.000Z",
      "dateModified": "2025-10-30T02:10:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Virgin cleared to challenge Eurostar on Channel Tunnel route",
    "url": "https://www.bbc.com/news/articles/cy8v5z15551o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ae7f/live/beb937b0-b561-11f0-b21a-99b56b1fa370.png",
    "tag": "Trending",
    "date": "2025-10-30T10:00:53.000Z",
    "description": "2 hours agoCharlotte EdwardsBusiness reporterVirgin Trains has moved closer to being able to run rail services through the Channel Tunnel after the re",
    "body": "2 hours agoCharlotte EdwardsBusiness reporterVirgin Trains has moved closer to being able to run rail services through the Channel Tunnel after the regulator approved its application to share a depot with Eurostar.The decision by the Office of Rail and Road (ORR) means Eurostar's monopoly on passenger services is set to be broken for the first time since the tunnel opened in 1994.Temple Mills railway storehouse in east London is the only depot in the UK able to accommodate the larger trains used in continental Europe and which is already linked to the cross-Channel line.Virgin aims to start running services from 2030. Eurostar said it was reviewing the decision and \"considering our next steps to ensure we can continue to grow\".\"Our priority is to deliver for passengers the benefits of the investments in a new fleet, jobs, and depot facilities that we recently announced,\" a Eurostar spokesperson said.Previously, the ORR had said the Temple Mills depot had enough space to either house an expanded Eurostar fleet or accommodate a rival company's trains – but not both.The regulator said a number of steps needed to be taken before new international services could run. Virgin needs to enter into a commercial agreement with Eurostar, will have to secure finance, access to track and stations, and have to get safety approvals from UK and EU authorities.But the ORR said its decision unlocked plans for around £700m of investment and could create 400 new jobs, describing it as \"a win for passengers, customer choice, and economic growth\".Sir Richard Branson, founder of the Virgin Group, said: \"The ORR's decision is the right one for consumers – it's time to end this 30-year monopoly and bring some Virgin magic to the cross-Channel route.\"Rail Minister Lord Hendy said he was \"incredibly pleased\" with the ORR's decision and called it a \"significant step forward\".\"Allowing Virgin Trains to share this vital facility will give passengers greater choice, better value and improve connectivity for millions, as well as drive innovation, lower fares and promote greener connections with Europe,\" he said.Martin Jones, deputy director of Access and International at the ORR, said: \"While there is still some way to go before the first new services can run, we stand ready to work with Virgin Trains as their plans develop.\"Several firms had wanted to start operating services between London and mainland Europe, including Spanish start-up Evolyn, Richard Branson's Virgin and a partnership between Gemini Trains and Uber.The ORR only approved Virgin's application on Thursday and rejected applications from Evolyn, Gemini and Trenitalia.Virgin said it planned to launch rail services from London St Pancras to Europe from 2030.This will include services to Paris Gare du Nord, Brussels-Midi and Amsterdam Centraal, with future plans to expand further across France, and into Germany and Switzerland.The plans would mean Virgin Trains returning to the rails for the first time since 2019, when the company lost its contract to Avanti West Coast.Virgin Trains had operated a service running from London Euston via Birmingham and Manchester to Scotland for 22 years before it was disqualified from bidding for the franchise.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Virgin cleared to challenge Eurostar on Channel Tunnel route",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ae7f/live/beb937b0-b561-11f0-b21a-99b56b1fa370.png"
      ],
      "datePublished": "2025-10-30T10:00:53.000Z",
      "dateModified": "2025-10-30T10:00:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dutch centrist liberals neck and neck in close finish with populist Wilders",
    "url": "https://www.bbc.com/news/articles/cpwvy4w875vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dc62/live/d0716cd0-b579-11f0-ba75-093eca1ac29b.jpg",
    "tag": "Trending",
    "date": "2025-10-30T11:13:37.000Z",
    "description": "1 hour agoPaul Kirby,Europe digital editor and Anna Holligan,Hague correspondent in LeidenReutersInitial exit polls had put D66 Leader Rob Jetten (lef",
    "body": "1 hour agoPaul Kirby,Europe digital editor and Anna Holligan,Hague correspondent in LeidenReutersInitial exit polls had put D66 Leader Rob Jetten (left) in the lead, while Geert Wilders' Freedom Party has lost groundRob Jetten's centrist-liberal party D66 are in a neck-and-neck race with anti-Islam populist Geert Wilders in the Dutch election, according to latest vote projections.With about 98% of votes counted, both D66 and Wilders' Freedom Party were  heading for 26 seats in the 150-member parliament, a projection from Dutch news agency ANP said on Thursday.Initial exit polls had put Jetten in the lead. \"Millions of Dutch people have turned a page; they've said goodbye to a politics of negativity,\" he told supporters.A downbeat Wilders had earlier conceded the result was not what he wanted, having lost 11 seats, but said he had still achieved his second best result ever.As the final few results trickled in on Thursday, Wilders took a narrow lead in the race, but it was so close that by the afternoon there were fewer than 2,000 votes between the two frontrunners. Both parties won less than 17% of the national vote.Three other parties were not far behind, including the conservative liberals on 22 seats, followed by the left-wing GreenLeft-Labour party and the Christian Democrats.Wilders led the polls throughout the election campaign, but after he pulled the plug on his own coalition in June in a row over asylum and migration, all the mainstream leaders made clear they did not wish to work with him again.He admits he has little hope of forming a government himself, but said on X on Thursday that if his party did top the vote he should have the first try. Even without a clear-cut victory, Jetten - who staged a remarkable campaign - would stand a stronger chance of leading the next administration.Only a few weeks ago, the polls put D66 on just 12 seats, but the photogenic, 38-year-old liberal leader capitalised on polished performances in a succession of TV debates and interviews. The fact that he also competed in a TV quiz show called The Smartest Person in the weeks leading to the vote only added to his public profile.EPARob Jetten, 38, led a highly polished campaign and outperformed his rivals in TV debatesJetten was careful not to claim victory on Wednesday night, despite the party mood among his supporters.The conservative liberal VVD of Dilan Yesilgöz was also heading for a successful night in third place and her party would be a good fit for any potential Jetten-led coalition.Going into Wednesday's election, voters knew the result would be on a knife-edge, as five parties were in the running to win. Wilders' PVV Freedom Party won 37 seats in November 2023, but many of those voters will have been put off by the realisation he would struggle to find parties to work with him again.It took seven months for Wilders to reach a deal with coalition partners in 2024, only to bring down the government 11 months later. Rob Jetten made clear he was looking for a broad-based coalition that was both \"stable and ambitious\", and he pointed out it was unprecedented for the winning party to score fewer than 30 seats in parliament.He named the Labour(PvdA)-GreenLeft of former European Commissioner Frans Timmermans as one potential coalition partner, along with Yesilgöz's conservative liberals and a revitalised Christian Democrat CDA.He is also likely to consider JA21, a populist right-wing party with 9 MPs, but his options are limited as he has to assemble a majority of at least 76 seats.SEM VAN DER WAL/ANP/AFPDilan Yesilgöz (R) also had a good election after good performances in TV debatesThe exit poll spelt bad news for Frans Timmermans, whose left-wing party had long been second in the polls and is now set to come fourth. \"Better times lie ahead,\" he promised his supporters late on Wednesday. \"Of course I'm hugely disappointed,\" he added, and announced he was stepping down and taking responsibility for the result.Timmermans and Wilders are both in their early 60s and entered politics at the same time, and there is now a sense that Dutch voters are prepared to try something new.Wilders, however, said he was going nowhere: \"You won't be rid of me until I'm 80.\" He remained bullish about his Freedom Party's performance: \"I would naturally rather have seen more seats... but we have still had our second best result.\"Matthijs Rooduijn of the University of Amsterdam said Wilders' party had lost the support of many of its moderate voters to other parties as well as many on the more radical side.But, he said, \"the losses could have been worse\", given that Wilders had himself broken up the last coalition and had campaigned less actively than his rivals.Anna Holligan/BBCSupporters of Jetten's centrist liberals were overjoyed with the surprise resultThere was palpable excitement as D66 supporters gathered for the results at a music venue in Leiden, a university city between Amsterdam and The Hague. As the exit polls became clear, the words \"yes, we can\" were voiced repeatedly as a kind of party mantra in the hall.Taking to the stage, the man now tipped to be the youngest prime minister in modern Dutch history told supporters \"we did it - the best result D66 has ever achieved\".\"We also know that millions of Dutch people voted for other parties, and I also feel a very heavy responsibility for [all of them],\" said Rob Jetten. \"We will do all we can in the coming years to show all the Dutch people that politics and government can be there for them again so they can think big again and act big again so the Netherlands can move forward.\"This election was partly fought on migration and overcrowded asylum centres, but the biggest issue for voters was the chronic housing shortage of almost 400,000 homes, in a population of 18 million.Jetten's party has said it will build 10 cities as part of its plan to tackle the crisis.\"It was a campaign of optimism, it shows the Dutch are tired of two years of standstill, we recognise big challenges and we want progress on those,\" said D66 supporter Eline. \"It shows the Dutch are craving a prime minister who is able to unite the country and tackle the major challenges our country and the world are facing.\"Another potential coalition partner for the liberals is the Christian Democrats, who only two years ago looked down and out with just a handful of seats. Now they are projected to win 18. \"What a fantastic result - two years ago we could not have dared to dream of this,\" CDA leader Henri Bontenbal told supporters as they chanted his name.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dutch centrist liberals neck and neck in close finish with populist Wilders",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dc62/live/d0716cd0-b579-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-30T11:13:37.000Z",
      "dateModified": "2025-10-30T11:13:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who is Rob Jetten, tipped to become youngest Dutch prime minister?",
    "url": "https://www.bbc.com/news/articles/cr7m0n890npo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/85cf/live/f3d37310-b544-11f0-981c-730b6d97cd1d.jpg",
    "tag": "Trending",
    "date": "2025-10-30T03:50:18.000Z",
    "description": "9 hours agoPaul KirbyEurope digital editorReutersRob Jetten became one of the youngest ministers in Dutch history under former PM Mark RutteRob Jetten",
    "body": "9 hours agoPaul KirbyEurope digital editorReutersRob Jetten became one of the youngest ministers in Dutch history under former PM Mark RutteRob Jetten's achievement in dragging his socially liberal D66 party from fifth place to the top of Dutch politics in less than two years has been extraordinary. But politically, all the stars were perfectly aligned for the 38-year-old to do so.The result of Wednesday's election is too close to call, with Jetten vying with anti-Islam populist Geert Wilders for the most seats in parliament.No other political leader commanded as much screen time during the campaign as Jetten and his smile and cheerful message resonated with voters, while his rivals sometimes struggled.Hardly a night went by without him on TV. When Wilders cancelled an appearance because of security fears, Rob Jetten seized the moment and took his place. He even featured in a TV quiz show recorded months ago called The Smartest Person.And his D66 party was untarnished by involvement in Wilders' ill-fated 11-month coalition, largely because Jetten had fared so poorly in the last election in 2023. The government collapsed last June when Wilders' party quit following a row over migration.But perhaps more than anything else, he was able to convey a positive message summed up by the slogan Het kan wel - an optimistic phrase that borrows from Barack Obama's \"Yes, we can\".It contrasted strongly with Wilders, who he accused of \"sowing division\".If his party does come top, Rob Jetten could become the Netherlands' first openly gay prime minister.A self-confessed politics nerd as a child, the young Jetten grew up in a small town in the southern province of Brabant and came out when he was young.Jetten has not made his private life part of his political identity, but five years ago he posted a video in which he read out a long list of homophobic messages from his phone, to prove why an international day against homophobia was important.Jetten is now engaged to Argentine hockey player, Nicolás Keenan, and they are due to marry next year.EPAJetten led a highly polished campaign and outperformed rivals in TV debatesHe was an early supporter of the centrist D66, which describes itself as progressive and socially liberal party, and officials soon spotted his potential.After a few years working for Dutch rail network ProRail, Jetten was elected as an MP in 2017 and had a couple of early experiences as leader before he served under long-serving prime minister Mark Rutte as climate minister.But not everything has worked out smoothly in Jetten's career. A parliamentary colleague complained he was \"pushy\" on the climate, and his big ambitions as minister were cut short when Russia's full-scale invasion of Ukraine sent energy prices soaring.He led D66's disastrous campaign in 2023 when the party came away with only nine seats, two years after his predecessor Sigrid Kaag managed second place after Rutte.Jetten was not yet as fluent in front of the cameras. Some media appearances he gave were criticised as dull, and one critic labelled him \"Robot Jetten\".\"Robot Jetten is going to be prime minister!\" one reporter said to him incredulously as his success became clear on Wednesday night.\"Sometimes it can work out really crazy in politics,\" Jetten replied with a broad grin.EPAJetten fought a close race against anti-Islam populist Geert WildersSupporters see him as a kind of mini-Mark Rutte, who is now head of Nato. And that comparison will suit Jetten fine, as many Dutch now look back warmly on the stability of the Rutte years, after two years of relative turmoil.Both men always appear cheerful and pragmatic, and both are notorious for getting by on precious little sleep. However, party colleague Roy Kramer noticed a difference: \"Rutte is a chatterbox, Jetten is a bit quieter,\" he told Dutch newspaper Het Parool.The liberal leader has big ambitions, and few challenges are more pressing than tackling the Netherlands' housing crisis, with a shortage of some 400,000 homes.Jetten wants to build 10 cities and complains Dutch governments have not really achieved anything impressive for the past 10 to 15 years. He is making big promises and will come under pressure to deliver.For Jetten to succeed he will need some of Rutte's teflon political coating that saw him through four governments.He has already survived one awkward moment in the campaign, when a joke about Crown Princess Amalia fell flat in front of 2,000 students in Rotterdam.\"I think the best way of promoting work in the military is being able to end up training with the Crown Princess. I bet a few guys in this audience would be interested in that,\" he said.The debate moderator hit back saying: \"what kind of sexist remark is that?\"Jetten later admitted it was inappropriate, but it appears to have done him no harm. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who is Rob Jetten, tipped to become youngest Dutch prime minister?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/85cf/live/f3d37310-b544-11f0-981c-730b6d97cd1d.jpg"
      ],
      "datePublished": "2025-10-30T03:50:18.000Z",
      "dateModified": "2025-10-30T03:50:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "No inquiry into 1974 IRA Birmingham pub bombings",
    "url": "https://www.bbc.com/news/articles/c8dr710m851o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fb8a/live/28ccdb30-b584-11f0-aeb3-8b84e9ca5314.png",
    "tag": "Trending",
    "date": "2025-10-30T12:09:10.000Z",
    "description": "The government has announced it will not establish a public inquiry into the IRA's 1974 Birmingham pub bombings.The attacks saw bombs detonated at the",
    "body": "The government has announced it will not establish a public inquiry into the IRA's 1974 Birmingham pub bombings.The attacks saw bombs detonated at the Mulberry Bush and Tavern in the Town pubs on 21 November 1974, killing 21 people and injuring 220.The killings remain unsolved. The convictions of six men, the so-called Birmingham Six, who were wrongly imprisoned for the crimes in 1975, were overturned in 1991 when the Court of Appeal ruled them unsafe.In a statement on Thursday, security minister Dan Jarvis said while he had deep sympathy with the families, \"after careful consideration\", the government would not commit to an inquiry. He said it was the government's \"firm belief\" that the existing Independent Commission for Reconciliation and Information Recovery could effectively investigate the incident.Julie Hambleton's sister, Maxine, was among the 21 killed in the bombing.Reacting to the announcement, she told the BBC: \"As long as there is breath in my body I will fight for justice.\"She had previously said a failure to hold the inquiry would be \"the epitome of moral and ethical turpitude\", adding only an inquiry would reveal the truth.Prime Minister Keir Starmer said in September that families of the victims would \"never be forgotten\", but cases would be looked at under a new legacy scheme agreed with the Irish government.While the IRA never officially admitted responsibility, it is widely believed to have been behind the attacks.An inquest in 2019 ruled the victims were unlawfully killed by the IRA, but did not determine the identities of those responsible.Mr Jarvis said the existing commission was created exclusively to investigate Troubles-related cases and operated independently from the government.\"The commission has been granted a wide range of powers to access information, including from government departments, the police, and the security and intelligence agencies,\" his statement said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "No inquiry into 1974 IRA Birmingham pub bombings",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fb8a/live/28ccdb30-b584-11f0-aeb3-8b84e9ca5314.png"
      ],
      "datePublished": "2025-10-30T12:09:10.000Z",
      "dateModified": "2025-10-30T12:09:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "First UK phones to get satellite connectivity in signal blackspots announced",
    "url": "https://www.bbc.com/news/articles/c993m88jer9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/00d9/live/f0fe5510-b57b-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-30T07:31:02.000Z",
    "description": "5 hours agoZoe KleinmanTechnology editorGetty ImagesVirgin Media O2 is set to become the first mobile network operator to offer UK customers automatic",
    "body": "5 hours agoZoe KleinmanTechnology editorGetty ImagesVirgin Media O2 is set to become the first mobile network operator to offer UK customers automatic connectivity via satellite in places without phone signal.O2 Satellite will be an optional service due to launch in the first half of 2026, following a partnership with Elon Musk's satellite business Starlink to offer the service.The firm has not yet revealed how much it will cost, but it will be an additional fee to pay each month.Enabled smartphones will automatically switch to satellite coverage in parts of the UK where no terrestrial signal is available - such as rural areas - but those who sign up will not be able to make phone calls via satellite to begin with.The service will only work with messaging, maps and location apps. O2 says this is because Starlink's current satellites do not support calls, although the next generation of them will.Calls made via WhatsApp, which uses data rather than phone signal, may work though. O2 intends to trial this before the service launches to the public.The satellites will effectively act like \"phone masts in the sky\", said Luke Pearce from analyst CCS Insight.\"In today's world, connectivity is no longer optional,\" he said.\"Whether it's emergency SOS in life-saving situations or keeping a software-defined vehicle online, people now expect constant access.\"Software-defined vehicles can receive over-the-air updates to improve their performance and features, but need internet connections to be able to do so.\"Satellite is the only technology that can truly close the coverage gap across mountains, oceans and rural areas,\" Mr Pearce added.Satellite battle takes offO2's move comes several months after rival Vodafone carried out a successful live video call via satellite from a mountain in Wales where there was no other signal. It claimed this was a UK first, but it has not yet revealed any plans to roll out satellite-to-device services to customers. Vodafone's tech worked with the satellite firm AST, which currently has six satellites in orbit and aims to have up to 60 by the end of 2026.Starlink, meanwhile, has more than 650 satellites and has already launched similar services with phone networks in other countries including Australia, New Zealand, the US, Canada and Japan.In the UK, Ofcom tweaked its regulations in September to enable satellite connectivity directly to smartphone devices.Currently it is only possible to use it to text emergency services from newer iPhone and Android handsets.But the use of low-earth orbit satellites for mobile communications has been criticised by astronomers, who say they pollute the night sky and make it more difficult to spot potential hazards such as asteroids.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "First UK phones to get satellite connectivity in signal blackspots announced",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/00d9/live/f0fe5510-b57b-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-30T07:31:02.000Z",
      "dateModified": "2025-10-30T07:31:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "England's most deprived areas named - with Jaywick topping list",
    "url": "https://www.bbc.com/news/articles/cly137089yyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/16c9/live/230237a0-b57e-11f0-b2a1-6f537f66f9aa.png",
    "tag": "Trending",
    "date": "2025-10-30T11:27:56.000Z",
    "description": "England's most deprived areas named - see how your area is affected58 minutes agoChristine Jeavans and Phil Leake,data journalists, BBC VerifyGetty Im",
    "body": "England's most deprived areas named - see how your area is affected58 minutes agoChristine Jeavans and Phil Leake,data journalists, BBC VerifyGetty ImagesJaywick near Clacton-on-Sea in Essex is among several coastal communities with high levels of deprivationJaywick, near Clacton-on-Sea in Essex, has been named the most deprived neighbourhood in England for the fourth consecutive time since 2010, new data shows.Seven areas in Blackpool are also among the 10 most deprived, alongside one in Hastings and one in Rotherham, according to stats published by the Ministry for Housing, Communities and Local Government (MHCLG) on Thursday.Half of the neighbourhoods in Middlesbrough are very deprived, making it the local authority with the highest proportion, ahead of Birmingham and Hartlepool.Deprivation is spread across the country, with 65% of local authorities containing at least one highly deprived neighbourhood, up from 61% in 2019.The MHCLG's Index of Multiple Deprivation looks at living conditions across an area - but does not mean that everyone in a highly deprived neighbourhood will be struggling, nor will all those in a less deprived area be well off.The new figures do not show whether an area has become more or less well off since the previous report, but instead can show patterns of how areas have changed relative to each other.There are pockets of deprivation surrounded by less deprived places in every region of England.Jaywick topped the list having been previously found to be the most deprived area in the last three reports, released in 2010, 2015 and 2019.The MHCLG found 82% of areas found to be the most deprived in 2025 were already in that category in 2019.The department used a number of weighted metrics to determine a neighbourhood's level of deprivation, including income, crime and barriers to housing.They are then assessed as more or less deprived compared to other neighbourhoods.The report found that Tower Hamlets and Hackney in London had the highest levels of income deprivation among households with children.Meanwhile, nine of the 10 local authority districts with the highest levels of income deprivation among older people are in London.The report is the latest in a long-running series that are used by central and local government and other bodies to target resources for local services.The government's recently announced Pride in Place funding - offering \"overlooked\" communities a share of £5bn - was allocated in part based on the deprivation figures from 2019.Areas with a history of heavy industry or mining are particularly affected, the report's authors highlight, along with parts of East London and several coastal towns including Jaywick.The former holiday resort was visited by the UN special rapporteur for extreme poverty as part of a fact-finding mission in 2018.And last year, its local district council, Tendring, agreed a £126m 20-year improvement plan.The previous Conservative government also used deprivation figures, along with other criteria, when deciding where would receive \"Levelling Up\" grants.Scotland, Wales and Northern Ireland also have Indices of Multiple Deprivation which are each published separately. No dates have yet been announced for these updates.How is deprivation measured?The Index of Multiple Deprivation ranks all of England's 33,755 neighbourhoods, each with an average of 1,500 people, by their deprivation score.The score is calculated from data on income, employment, education, crime, health and disability, barriers to housing and services, and the living environment.Once all the neighbourhoods are ranked, they are split into 10 equal groups called deciles, where the first decile is the 3,375 most deprived neighbourhoods and so on. We are using terms like \"highly deprived\" and \"most deprived\" to refer to this group of neighbourhoods. There are areas of deprivation throughout England and not everyone in a neighbourhood will experience deprivation equally.Additional reporting by Jess Carr, Libby Rogers and Lucy DadyMore on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "England's most deprived areas named - with Jaywick topping list",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/16c9/live/230237a0-b57e-11f0-b2a1-6f537f66f9aa.png"
      ],
      "datePublished": "2025-10-30T11:27:56.000Z",
      "dateModified": "2025-10-30T11:27:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Louvre: Five new suspects arrested over jewellery theft",
    "url": "https://www.bbc.com/news/articles/cz91jnyelq2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b4ae/live/6a3b8cd0-b564-11f0-b21a-99b56b1fa370.png",
    "tag": "Trending",
    "date": "2025-10-30T11:45:35.000Z",
    "description": "41 minutes agoKathryn ArmstrongReutersPrecious crown jewels were taken during the theft earlier this monthFive more suspects have been arrested over t",
    "body": "41 minutes agoKathryn ArmstrongReutersPrecious crown jewels were taken during the theft earlier this monthFive more suspects have been arrested over their involvement in the Louvre heist, Paris' public prosecutor has said.They were detained on Wednesday night in the Paris region during coordinated raids, according to Laure Beccuau. One of the suspects is thought to be part of the four-man team that carried out the heist, who were seen on CCTV. Two of the other alleged thieves have already been arrested and have \"partially recognised\" their involvement in the brazen theft, while the fourth person has not yet been caught. It is not clear what role the other newly arrested people allegedly played in the theft, but Beccuau told French radio station RTL on Thursday that they \"may eventually inform us about how the incident took place\".Beccuau said the arrests had been made in areas in and around Paris, including the  suburb of Seine-Saint-Denis.Phones and other objects found on the suspects during the raid were allowing investigators to study encrypted messages, she added.Those arrested can be detained for up to four days before being charged or released.How Louvre gang carried out France's most shocking theftFrench investigators are not giving many more details away at this stage but Beccuau said that DNA from one of those arrested on Wednesday night could be linked to the crime scene. \"We had him in our sights,\" she said of the main suspect. She specified that the latest arrests were not related to statements made by the previously detained suspects but to \"other elements of the case\".The authorities have previously said that the gang involved in the heist could be bigger than those who physically stole the jewels.Items worth €88m (£76m; $102m) were taken from the Louvre - the world's most-visited museum - on 19 October, when four thieves broke into the building in broad daylight. The precious jewels have not been recovered yet.Louvre MuseumLouvre MuseumThe Marie-Louise necklace and a pair of earrings were among the eight items stolen A tiara worn by the Empress Eugenie, wife of Napoleon III, was takenThe first two people who were arrested over the heist - both men in their thirties with criminal records - are thought to be the pair who used power tools to enter the museum's  Galerie d'Apollon (Gallery of Apollo) and steal some of the French crown jewels.They were taken into custody late last week. Beccuau told a press conference on Wednesday that one of the men was arrested as he tried to board a one-way flight to Algeria, but that the other man had not been planning to leave France, contrary to earlier media reports.There was no evidence at this stage to suggest the theft was an inside job, she added, confirming no accomplices worked at the museum. On the day of the heist, the robbers arrived at 09:30, just after the museum opened to visitors, Beccuau said at a press conference on Wednesday.The suspects arrived with a stolen vehicle-mounted mechanical lift to gain access to the Gallery of Apollo via a balcony close to the River Seine. The men used a disc cutter to crack open display cases housing the jewellery.Beccuau said the thieves were inside for four minutes and made their escape on two scooters waiting outside at 09:38, before switching to cars and heading east. Nobody had been threatened during the raid. France's justice minister said security protocols in the Louvre - one of the world's most famous museums - \"failed\" in preventing the theft. It was later revealed by the Louvre's director that the only camera monitoring the Gallery of Apollo was pointing away from a balcony the thieves climbed over to break in. Since the incident, security measures have been tightened around France's cultural institutions.The Louvre has transferred some of its most precious jewels to the Bank of France following the heist. They will now be stored in the Bank's most secure vault, 26m (85ft) below the ground floor of its elegant headquarters in central Paris.Watch: Two people leave Louvre in lift mounted to vehicle",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Louvre: Five new suspects arrested over jewellery theft",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b4ae/live/6a3b8cd0-b564-11f0-b21a-99b56b1fa370.png"
      ],
      "datePublished": "2025-10-30T11:45:35.000Z",
      "dateModified": "2025-10-30T11:45:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The dads helping daughters through their periods ",
    "url": "https://www.bbc.com/news/articles/cy8v5xn8gdvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b48d/live/ffb3cd90-b4fb-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-30T00:05:14.000Z",
    "description": "12 hours agoYasmin RufoBBC News ShutterstockWhen now 16-year-old Helen got her first period, it was her dad who helped her with it as he was the paren",
    "body": "12 hours agoYasmin RufoBBC News ShutterstockWhen now 16-year-old Helen got her first period, it was her dad who helped her with it as he was the parent who happened to be at home. Chatting about periods with young people can be awkward, even more so if you don't experience them yourself, but Helen says her dad had always spoken openly about what to expect which made that first time much easier.Dads \"can't tell you how it actually feels or how it can affect your life sometimes, but they can still provide advice and talk about it,\" she says.Yet talking about periods can still feel like uncomfortable for many and even today, it's often left to mothers to handle.Helen's father John Adams is one of a growing number of dads who are challenging the unfounded stigma.John was a stay-at-home parent when his two daughters - now 16 and 12 - were younger, and said some parents he'd spoken to felt too uncomfortable to talk to their kids about periods.\"They were waiting for them to learn about it at school, but I don't believe it's just a teacher's job to talk about this.\"John spoke to both daughters about what they might experience, the level of pain they could be in and the various sanitary product options.\"Men maybe blunder in but they go in without that baggage and just sort of talk about things practically,\" he tells BBC Radio 5 Live's Time of the Month. John, who now works in education, admits he's no expert but he spoke to his wife and mother about it and used books and online resources to guide him.'You can't hide from it'For him, periods are a matter of health, not embarrassment and while the idea of dads discussing menstruation still divides opinion, John says it's important to \"be there and approachable for your children\".As a widowed father, Roy had no choice. He has been raising his daughter alone after his wife died from cancer.He started talking about periods when she was nine, by going through some books with her about what to expect.  \"Initially the colour drained from her face, but we spoke about it openly.\"Later, he showed his daughter a pad and demonstrated how she should stick it onto her pants and suggested she have a test drive of one.\"Things are scary when you don't know what's going on. \"I'm preparing my daughter for life and part of that is periods, sex, boyfriends, relationships. It's all difficult but you can't hide from it.\"For many women, the memory of their first period is far less open. Hannah Routledge, who works for the not-for-profit group Hey Girls, which works to stop period poverty, remembers hers with discomfort. \"I started my periods really young. I was only 10,\" she says. \"I went to a school that had no provision, no bins even.\"Hannah RoutledgeHannah Routledge says Pads for Dads offers resources and guidance to help fathers talk about periodsHey Girls launched its Pads for Dads campaign in 2019, offering free guidance and resources to help fathers have those early talks.\"It was designed to break the stigma around periods for dads and parents in general,\" she explains. \"Don't wait for a big conversation, it's about having lots of smaller ones, making sure you've got products in the house and just being supportive.\"Hannah says it's also essential parents talk to their sons about periods to make them aware. Dr Nighat Arif, a GP who specialises in women's health, started talking to her six-year-old son when he found one of her tampons in the bathroom.\"I said 'This is something that mummy uses because she bleeds'\".  Initially, this made him anxious, but she told him it was normal and happened to all women every month.Hannah says attitudes are changing fast and has even noticed a shift in her own dad who would have once avoided period conversations but now \"if his granddaughters needed something or wanted to have that conversation, I think he'd be much more open\". Reducing workplace stigmaConsultant gynaecologist Dr Christine Ekechi, who works in the NHS, says there's often a double standard when it comes to parents talking to their children about puberty.\"There are so many single mothers with sons and we don't tell them they cannot talk to their sons about puberty and adolescence and about protective sex.\"So why do we still have this hang up if it's the other way around?\"An increase in openness at home also has wider effects and Dr Ekechi believes informed fathers make better colleagues and leaders too.This can help reduce period stigma in the workplace and improve menstrual equity at work. Above all though, \"it's a fantastic way to improve a bond between a father and a daughter,\" she says.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The dads helping daughters through their periods ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b48d/live/ffb3cd90-b4fb-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-30T00:05:14.000Z",
      "dateModified": "2025-10-30T00:05:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]