[
  {
    "title": "Bruno Fernandes injury: What are Manchester United's options?",
    "url": "https://www.bbc.com/sport/football/articles/c1dz1exq616o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ae99/live/352a0ff0-df42-11f0-a5e8-050d4171e402.jpg",
    "tag": "Trending",
    "date": "2025-12-22T15:56:54.000Z",
    "description": "Manchester United are still evaluating the full extent of the injury captain Bruno Fernandes sustained during the 2-1 defeat at Aston Villa.Manager Ru",
    "body": "Manchester United are still evaluating the full extent of the injury captain Bruno Fernandes sustained during the 2-1 defeat at Aston Villa.Manager Ruben Amorim thinks the midfielder is set for a spell on the sidelines - but will be hoping the damage is not too bad. Fernandes pulled up at the end of the first half and felt his hamstring, before continuing and coming off at the break.Any absence would be particularly notable given the Portuguese playmaker's remarkable availability record since joining from Sporting in January 2020.From his debut in a goalless draw against Wolves to the Villa defeat, United have played 221 Premier League games - and Fernandes has featured in 212, including 208 starts.Of the nine matches Fernandes has missed, two were because he was rested ahead of key European matches, including last season's defeat at Brentford in May. Four were because of suspension - so just three have been a result of injury or illness. His longest absence was two games in a row at the end of the 2023-24 campaign, but he still recovered before the FA Cup final victory over Manchester City.The bad news for Amorim is United have lost the past four league games Fernandes has missed and five of the past six.While we still do not know how long Fernandes will be out, here are United's next seven games:26 December (20:00 GMT) v Newcastle (h)30 December (20:15 GMT) v Wolves (h)4 January (12:30 GMT) v Leeds (a)7 January (20:15 GMT) v Burnley (a)11 January (1630 GMT) v Brighton (h) - FA Cup third round17 January (12:30 GMT) v Man City (h)25 January (16:30 GMT) v Arsenal (a)So what are Amorim's options if his talisman is ruled out?Amorim has stressed all season Mainoo is in direct competition with Fernandes as they are most similar in styles. In theory, this is the chance for the 20-year-old to show his manager he has been wrong to leave him out so often. However, Amorim said Mainoo missed the defeat at Villa with a calf problem and was unlikely to be fit to face Newcastle. Conspiracy theorists had suggested Mainoo was left out as a result of the \"Free Kobbie Mainoo\" T-shirt his half-brother wore during the 4-4 draw with Bournemouth.Yet this course of action would be to ignore Amorim's admission his own brother did something similar during his own career, which led to him having to apologise and distance himself from what had happened. Amorim has not said how long Mainoo will be out for.On the assumption veteran Brazil midfielder Casemiro, 33, will return from suspension against Newcastle, there is a chance Manuel Ugarte will partner him. Yet, like Mainoo and Fernandes, Ugarte and Casemiro have tended to compete for the same position. The last time the pair started together in the league was last season in a 0-0 draw against Manchester City in April. There is also an unhappy statistic to consider United have not won any of the past nine league games in which Uruguay midfielder Ugarte has started - a record beaten at the club only by Brazilian Kleberson. Lisandro Martinez replaced Fernandes at half-time at Villa Park. Primarily a defender, Amorim previously said he would only consider Martinez as a midfield option \"in an emergency\".This situation probably meets the criteria, and Martinez was arguably Amorim's most effective performer at Villa Park. Still, neither Ugarte nor Martinez have the creative qualities that would ideally fit in alongside Casemiro.When Mount arrived from Chelsea, Erik ten Hag felt he could operate as a number eight. Mount can create and playing him alongside Casemiro could offer Joshua Zirkzee a chance to fit in as a number 10. Amorim feels Mount is better in the number 10 role but, as with Martinez, needs must in an emergency. The England man has also played at wing-back, so the United head coach clearly admires his flexibility. The other key element is Mount is in form, having scored against Crystal Palace and Wolves recently.Fletcher made his debut at Villa Park and has the attributes Amorim needs. Like his dad Darren - the former United and Scotland midfielder - Fletcher has lots of energy. He also has a good passing range and has made big strides over the past few months. However, it would be asking a lot to put the 18-year-old England youth international into the cauldron of a Premier League game from the start.Since Amorim's arrival, he has attempted to get United playing his specific system, rarely straying away from his philosophy.By taking a system-first approach, Amorim looks for specific qualities from his players in each position, asking them to adapt to what he wants, rather than altering his system to fit the players at his disposal.Looking at his system and what he wants from his midfielders may help explain how he navigates the next few months.Amorim opts for a 3-2-4-1 shape that does not rely on having the majority of the ball.At the start of his tenure, Amorim looked to build-up short, but to his credit has opted to play long from the keeper more often - which suits the players he has. This requires players able to cover distance and win second balls.His side are asked to carry out passing routines too with patterns of play often ending in United's midfielders playing through-balls over the top for attackers running in behind.The midfield duo therefore need to be able to carry out these instructions.Amorim's preferred midfield duo of Casemiro and Fernandes provides clues to what he asks from his midfielders.Casemiro's role is more positionally strict - screening the defence, breaking up play and getting up and down the pitch to close the distance between defence and attack when the ball is played long.Fernandes is given licence to contribute in attack but, like Casemiro, has the ability to run hard up and down the pitch, getting back to defend when needed.Both players have a tendency to play direct passes into attackers running in behind whilst taking few touches in midfield - qualities that fit Amorim's tactical plan.The other midfield options must therefore fit into either Casemiro or Fernandes' roles, with Ugarte being the most likely back-up to Casemiro while Mount, Martinez and Mainoo possess some of the quality to do Fernandes' job.Given the constraints around the Africa Cup of Nations and United's injuries, the other option is for Amorim to tweak his system. This is not something he has done yet at Old Trafford, but - when asked about a shortage of wing-backs - he hinted he could, depending \"on the way we play in that particular week, if we have to change for a back four, we change for a back four\".The shortage of midfielders could force his hand in the same way.If United are to move to four at the back, with three in midfield, the obvious player to benefit would be Mainoo. The England man has struggled to displace either Casemiro or Fernandes given the specific tactical demands Amorim asks for in this system. And the United boss believes Mainoo's strengths and weaknesses are more suited to a midfield three.\"The problem is that we are playing with two [midfielders] and you guys see Kobbie in a different way to what I am seeing,\" he said.\"Maybe if you play with three midfielders, not with just two. But with three, Kobbie will have more minutes.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bruno Fernandes injury: What are Manchester United's options?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ae99/live/352a0ff0-df42-11f0-a5e8-050d4171e402.jpg"
      ],
      "datePublished": "2025-12-22T15:56:54.000Z",
      "dateModified": "2025-12-22T15:56:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Best Bits of Newscast's Podcast-a-Thon (Part Two) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mpq6t5?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-12-21T12:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·21 Dec 2025,·38 minsThe Best Bits of Newscast's Podcast-a-Thon (Part Two)NewscastAvailable for over a yearToday, we’re bringing you some of the best bits from Newscast’s 25-hour Podcast-A-Thon!\nBack in November, Adam was challenged by Pudsey Bear to record a 25-hour long episode of Newscast in aid of Children In Need. Members of the Newscast family dropped by throughout the day and night to cheer Adam on. Including when Laura and Paddy met Pudsey, voice coaching with Chris and a midnight snack session with Lyse Doucet chatting about how she spends her down time with her family in Canada. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Best Bits of Newscast's Podcast-a-Thon (Part Two) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-12-21T12:00:00.000Z",
      "dateModified": "2025-12-21T12:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Global News Podcast - First batch of Epstein files released - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mpt4lc?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mpt4ml.jpg",
    "tag": "Trending",
    "date": "2025-12-20T04:51:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·20 Dec 2025,·31 minsAvailable for 87 daysAfter months of political wrangling, parts of the long-awaited Epstein files have been released by the US Justice Department. The trove consists of thousands of documents related to the late sex-offender. Pictures include the former US President Bill Clinton, Andrew Mountbatten-Windsor - Britain's former prince, musicians Mick Jagger and Michael Jackson. Being named or pictured in the files is not an indication of wrongdoing. The justice department did not release all existing files, and the published ones were heavily redacted, prompting frustrated reactions from survivors of Epstein's abuse.\nAlso: the US carries out dozens of strikes against the Islamic State group in Syria. Anti-government youth protesters in South Korea are taking cues from the American right's MAGA movement. Italy announces a fee for tourists to visit the Trevi Fountain in Rome. Putin vows revenge on Ukraine after an oil tanker was blown up in the Mediterranean Sea. Palestinians tell the BBC they were sexually abused in Israeli prisons. And how a lost radio play by Tennessee Williams was found more than four decades after his death, and has now been heard for the first time.\nThe Global News Podcast brings you the breaking news you need to hear, as it happens. Listen for the latest headlines and current affairs from around the world. Politics, economics, climate, business, technology, health – we cover it all with expert analysis and insight.\nGet the news that matters, delivered twice a day on weekdays and daily at weekends, plus special bonus episodes reacting to urgent breaking stories. Follow or subscribe now and never miss a moment.\nGet in touch: globalpodcast@bbc.co.ukProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Global News Podcast - First batch of Epstein files released - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mpt4ml.jpg"
      ],
      "datePublished": "2025-12-20T04:51:00.000Z",
      "dateModified": "2025-12-20T04:51:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oppenheimer",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002p1fr?at_mid=8PiucSontB&at_campaign=Oppenheimer&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002p1fr&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Oppenheimer&at_bbc_team=BBC&at_creation=Film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0mlb4dr.jpg",
    "tag": "Trending",
    "date": "2025-12-21T23:52:18.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeOppenheimerOppenheimerContains some strong language and some sexual content.Deals with SuicideThe life of J Robert Oppenheimer, the physicist appointed by the US in the race to develop the atomic bomb before the Nazis. But winning that race comes at a cost. Duration2h 49mFirst shown2023Available for 29 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesRaging BullRobert De Niro stars in Martin Scorsese's acclaimed brutal biopic of boxer Jake LaMotta2h 2mUniversity ChallengeGreen Templeton College, Oxford v Darwin College, Cambridge. Two Oxbridge sides clash29 minsThe Heroes of TelemarkCome frozen hell or high adventure. Kirk Douglas in a true story of wartime derring-do2h 5mMastermindContenders take questions on sportsman CB Fry, emperor Nero and People Just Do Nothing29 minsGlobal EyeThe team goes undercover to expose an illegal prostitution ring in Dubai.29 minsOnly ConnectPear Trees v Caraxian. They lost their first-round match, but return for another go29 minsHell or High WaterJustice isn't a crime. Two Texan brothers resort to dangerous measures to save the ranch1h 36mQI XLWeird and Wonderful with with Melanie Bracewell, Patrick Kielty and Roisin Conaty44 minsWorld War ZFight. Survive. Repeat. A zombie pandemic spreads across the world, one bite at a time1h 46mAmazing Hotels: Life Beyond the LobbyGiles Coren and Monica Galetti work in some of the most extraordinary hotels in the world.Richard Osman's House of GamesJimi Famurewa, Harriet Kemsley, Colin Murray and Sara Pascoe face more trivia questions.29 minsWhisky Galore!Eddie Izzard stars in a new take on the classic comedy1h 31m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oppenheimer",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0mlb4dr.jpg"
      ],
      "datePublished": "2025-12-21T23:52:18.000Z",
      "dateModified": "2025-12-21T23:52:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Élysée Palace staff member to stand trial over theft of precious tableware ",
    "url": "https://www.bbc.com/news/articles/cz0n51p00jmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a65d/live/1beced00-df38-11f0-b6a6-1bf5f87ee304.jpg",
    "tag": "Trending",
    "date": "2025-12-22T15:35:58.000Z",
    "description": "5 hours agoEmily AtkinsonGetty ImagesA senior staff member at France's presidential palace will stand trial over the alleged theft of precious tablewa",
    "body": "5 hours agoEmily AtkinsonGetty ImagesA senior staff member at France's presidential palace will stand trial over the alleged theft of precious tableware, including Baccarat Champagne glasses and Sèvres porcelain plates. Around 100 objects that were reported missing from the presidential collection were allegedly later found in the locker, car and home of Thomas M, who is reported to be the Élysée Palace's chief butler. He will stand trial alongside two others. Investigators say they found some of the items - thought to be worth between €15,000 and €40,000 (£13,000 and £35,000) - on his Vinted account. It comes just months after the Louvre Museum in Paris suffered a brazen heist in which jewels worth €88m (£76m) were taken. French media reported that Thomas M's role as head butler and keeper of precious silver involved setting the tables at state dinners and other prestigious events.He is accused of siphoning off the items over several months and falsifying the records to cover his tracks.Also among the alleged stolen goods are solid silver cutlery and a René Lalique figurine.The inventory kept by Thomas M suggested he was planning to steal more goods, prosecutors say.The Élysée has already posted a job advertisement to find his replacement, according to French media outlet TF1 Info. Officials at Sèvres - France's state-owned porcelain factory - also identified some of their items on online auction sites, including a plate embossed with an air force stamp and ashtrays.Thomas M was arrested on Tuesday 16 December on suspicion of theft, alongside his partner Damien G - a collector and manager of an online auction company.A third man, Ghislain M, was arrested a day later, accused of receiving stolen goods. His \"passion\" for rare antiques has been put forward by his lawyer as being behind his alleged involvement.According to Le Parisien - which first reported on the case - he was working as a guard at the Louvre at the time and has been barred from returning until the trial is completed.The trial is scheduled for February.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Élysée Palace staff member to stand trial over theft of precious tableware ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a65d/live/1beced00-df38-11f0-b6a6-1bf5f87ee304.jpg"
      ],
      "datePublished": "2025-12-22T15:35:58.000Z",
      "dateModified": "2025-12-22T15:35:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Barry Manilow to undergo surgery for 'cancerous spot' on lung",
    "url": "https://www.bbc.com/news/articles/c62dvg1zn95o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2406/live/c0372180-df58-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2025-12-22T17:25:06.000Z",
    "description": "Singer-songwriter Barry Manilow has revealed he will undergo surgery to remove a cancerous spot on his lung.Manilow, one of the biggest stars of the 7",
    "body": "Singer-songwriter Barry Manilow has revealed he will undergo surgery to remove a cancerous spot on his lung.Manilow, one of the biggest stars of the 70s and 80s, said it was \"pure luck\" that doctors found the spot early when he had an MRI following weeks of bronchitis.The 82-year-old, known for a string of hits including Copacabana, Could It Be Magic and Mandy, said doctors do not believe it has spread and he will not need chemotherapy or radiation.In a statement on Instagram, he said: \"As many of you know I recently went through six weeks of bronchitis followed by a relapse of another five weeks.\"Even though I was over the bronchitis and back on stage at the Westgate Las Vegas, my wonderful doctor ordered an MRI just to make sure that everything was OK.\"The MRI discovered a cancerous spot on my left lung that needs to be removed.\"It's pure luck (and a great doctor) that it was found so early. That's the good news.\"He went on to say the \"bad news\" is that after finishing his latest run of concerts, he is \"going into surgery to have the spot removed\".\"The doctors do not believe it has spread and I'm taking tests to confirm their diagnosis.\"So that's it. No chemo. No radiation. Just chicken soup and I Love Lucy reruns.\"He issued a reminder to people that \"if you have even the slightest symptom\" to get tested.Manilow said he will need a month to recover and his arena concerts planned for January will be rescheduled.He said he was \"counting down the days\" until he can return to performing.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Barry Manilow to undergo surgery for 'cancerous spot' on lung",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2406/live/c0372180-df58-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-22T17:25:06.000Z",
      "dateModified": "2025-12-22T17:25:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fuel profit margins still persistently high, says watchdog",
    "url": "https://www.bbc.com/news/articles/c2dzk4kz722o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9a92/live/cb36e890-df26-11f0-9dac-b79514ec4a2d.jpg",
    "tag": "Trending",
    "date": "2025-12-22T14:29:52.000Z",
    "description": "6 hours agoEmer MoreauBusiness reporterDrivers could be paying more than they should for petrol and diesel after the UK's competition watchdog said fu",
    "body": "6 hours agoEmer MoreauBusiness reporterDrivers could be paying more than they should for petrol and diesel after the UK's competition watchdog said fuel profit margins remain at \"persistently high levels\" despite prices at the pump having fallen.The Competition and Markets Authority (CMA) also challenged retailers' claims that this was a result of higher operating costs, and said competition in the sector was \"weak\".However, the Petrol Retailers Association said falling fuel prices were an indication of healthy competition.The CMA's report was published as the government prepares to launch its \"fuel finder\" scheme, which will allow drivers to compare real-time fuel prices.Petrol was 136.8p per litre last week, according to government tracking, while diesel was 146.1p per litre.The CMA report found that fuel prices had fallen \"significantly\" since it last studied the issue in 2023, largely due to lower oil prices.However, it said profit margins on fuel for both supermarket and non-supermarket retailers were \"historically high\".\"Average fuel margins on a percentage basis have continued to increase for both supermarket and non-supermarket retailers,\" it said.The report noted fuel retailers' arguments that their operating costs had increased, but if this were the case, \"we would expect to see this reflected in declining profit margins\".The CMA said if there was more competition, drivers would see better fuel prices at the pump.Retailers will have to sign up to the planned fuel finder scheme and report price changes within 30 minutes of them being implemented.The CMA said the finder would be accessible through apps and satnavs, and allow drivers to easily compare prices.\"In turn, this should incentivise retailers to compete harder for customers, placing downward pressure on prices.\"The CMA will take action against retailers who breach the conditions of the fuel finder, which could include fines.Dan Turnbull, senior director of markets at the CMA, said: \"Fuel margins remain at persistently high levels – and our new analysis shows operating costs do not explain this. \"We know fuel costs are a big issue for drivers, especially at this time of year with millions making journeys across the country.\"The Petrol Retailers Association (PRA) said it would \"continue to work constructively with the CMA\" and would engage with the fuel finder scheme.Gordon Balmer, the executive director of the PRA, said: \"Operating costs alone do not account for higher fuel margins, yet retailers continue to face steep rises in labour, taxation, energy and crime.\"Comparisons with historic margins overlook these significant cost increases. \"Pump prices are considerably lower than the peaks observed in 2022 and 2023, corresponding with falls in wholesale fuel prices, indicating strong competition between retailers.\"Both the RAC and the AA said drivers were being overcharged for fuel.The AA said that, since November, the wholesale cost of petrol has fallen more than 7p per litre but the average petrol pump price had fallen by just two-thirds of a penny.\"It comes as millions of drivers take to the road for Christmas and are being overcharged for their fuel,\" the motoring body said.\"Drivers are being taken for a ride at the pumps, as the CMA clearly illustrates.\"RAC head of policy Simon Williams said: \"Many drivers won't be surprised to hear that they're still paying too much for their fuel, especially judging by the complaints we receive about large price variations from area to area.\"He said retailers' arguments of higher operating costs had \"now been clearly rejected\" by the CMA.\"We sincerely hope the new fuel finder scheme, combined with ongoing scrutiny from the CMA, finally leads to increased competition and lower forecourt prices for drivers right across the country.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fuel profit margins still persistently high, says watchdog",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9a92/live/cb36e890-df26-11f0-9dac-b79514ec4a2d.jpg"
      ],
      "datePublished": "2025-12-22T14:29:52.000Z",
      "dateModified": "2025-12-22T14:29:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zendaya and Tom Holland in surprise Leicestershire curry house stop",
    "url": "https://www.bbc.com/news/articles/c4g9j2wzg5qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fca9/live/13441670-df37-11f0-b6a6-1bf5f87ee304.jpg",
    "tag": "Trending",
    "date": "2025-12-22T15:44:37.000Z",
    "description": "4 hours agoDan Hunt,East MidlandsandBen Jackson,BBC Radio LeicesterEverest Lounge Market HarboroughTom Holland and Zendaya visited Everest Lounge in M",
    "body": "4 hours agoDan Hunt,East MidlandsandBen Jackson,BBC Radio LeicesterEverest Lounge Market HarboroughTom Holland and Zendaya visited Everest Lounge in Market HarboroughA restaurant owner said his staff were \"absolutely starstruck\" after a surprise visit by two Hollywood A-listers.Pradip Karanjit said Tom Holland and Zendaya dined with friends at his restaurant in Market Harborough, Leicestershire, on Saturday. They had been in the area to see a theatre show.Mr Karanjit, who runs Everest Lounge in St Mary's Road, said his team were happy to accommodate the couple despite the restaurant being fully booked.He added the pair - who star in the most recent Spider-Man film - did not come across as \"Hollywood royalty\", but were just a \"normal young couple\" going for a meal.He said Holland tucked into a chicken tikka masala, pilau rice and a garlic naan, while Zendaya enjoyed a chana saag bengan, paneer shaslik starter with a side of saag aloo.Getty ImagesZendaya and Tom Holland both starred in Spider-Man: No Way Home Holland and Zendaya, both 29, have starred in a number of blockbusters alongside Spider-Man: No Way Home. Zendaya rose to fame on the Disney Channel and has since starred in Dune, Challengers, Malcolm & Marie and the TV series Euphoria.Holland played the lead role in Billy Elliot the Musical in the West End as a child, and has since appeared in Uncharted, Cherry and The Devil All The Time.His role as Spider-Man saw him star in three of the superhero films alongside Zendaya, as well as other appearances in the Marvel Cinematic Universe.\"We were fully booked for Saturday so we were exceptionally pleased that we were able to accommodate them for the evening and that's where everything started,\" Mr Karanjit said.\"My staff were absolutely starstruck and we were, in a way, in panic mode but throughout the service they remained really professional.\"Mr Karanjit told the BBC he was not in the restaurant when the couple visited, but said his phone went \"really hot\" with calls asking about their visit - and he had to phone the restaurant to confirm the news.\"I missed the whole experience, but it was something for Harborough itself and our restaurant as well,\" he added.Theatre fansThe couple had been in the area to watch a production of The Sound of Music at Leicester's Curve theatre on Saturday.Holland had also been in the audience for My Fair Lady at the same venue in 2024.A spokesperson for Curve said: \"It's the second year Tom has been to see one of our shows. We were very excited to see them.\"After the 2024 visit, cast member Minal Patel told the BBC it was \"great\" to have someone of Holland's profile watching the performance.\"It's testament to a place like Curve to have people like him come and see a show,\" he said.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zendaya and Tom Holland in surprise Leicestershire curry house stop",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fca9/live/13441670-df37-11f0-b6a6-1bf5f87ee304.jpg"
      ],
      "datePublished": "2025-12-22T15:44:37.000Z",
      "dateModified": "2025-12-22T15:44:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chris Rea obituary: A life on the road",
    "url": "https://www.bbc.com/news/articles/c51y93wqv5po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4109/live/6ec31250-df49-11f0-b67b-690eb873de1b.jpg",
    "tag": "Trending",
    "date": "2025-12-22T15:05:31.000Z",
    "description": "Chris Rea: The car enthusiast whose love of driving inspired his songs5 hours agoEmma PetrieGetty ImagesChris Rea: \"Most of the songs are different pe",
    "body": "Chris Rea: The car enthusiast whose love of driving inspired his songs5 hours agoEmma PetrieGetty ImagesChris Rea: \"Most of the songs are different people's love stories inside cars\"The rock and blues singer, Chris Rea spent countless hours on the road, and his love of cars and driving was the inspiration behind many of his songs. He recorded 25 solo albums, two of which topped the UK albums chart. His distinctive gravelly voice and slide guitar-playing are preserved in songs such as Road to Hell, Auberge, On the Beach and Driving Home for Christmas.Christopher Anton Rea was born in Middlesbrough in the north-east of England in 1951 to an Italian father and Irish mother and was one of seven children. The family was known locally for Camillo's Ice cream factory and cafes, owned by his father Camillo Rea.Driving Home for Christmas singer Chris Rea dies aged 74Chris worked in the cafes as a teenager and took his driving test in one of his dad's ice cream vans. When he was asked to do an emergency stop, the examiner fell off the box he was sitting on and cut his leg. Rea said: \"I had to take him to the hospital but he still passed me.\"He was still working for his father when he bought his first guitar, a 1961 Hofner V3 in his early 20s.Rea said that at the time he was \"meant to be developing my father's ice cream cafe into a global concern, but I spent all my time in the stockroom playing slide guitar\".Getty ImagesChris Rea: \"The road always becomes a metaphor for where we are going in life.\"He played with local groups The Elastic Band, and Magdalene, but it was The Beautiful Losers which shone the spotlight on Rea, and he secured a solo recording deal with Magnet Records.His first studio album was Whatever Happened to Benny Santini?, released in 1978. The lead single, Fool (If You Think It's Over), was a big hit in the US, reaching number one on the (adult) contemporary singles Billboard chart, earning him a best new artist  nomination at the Grammy Awards.Michael Levey, co-founder of Magnet records, remembers him as \"more of a thoughtful, introspective poet than a natural pop performer\".One of Rea's childhood dreams had been to write and compose music for films. He achieved both with his movie La Passione in 1996. Rea also wrote the score and title track for the Soft Top Hard Shoulder film and starred in the comedy Parting Shots in 1999.Getty Images\"Music and cars fit together very well\" Rea explainedRea was building a reputation for his slide guitar playing when his record company insisted on releasing Driving Home for Christmas in 1986. He said: \"I didn't need a Christmas song hanging around at that point. I did everything I could to get them not to release that record. Thankfully they did!\"The song's inspiration dates back to a difficult year for him personally.  In 1978 Rea had come to the end of his record contract and had parted ways with his manager. The record company wouldn't pay for a train ticket for him to get from London to his home to Middlesbrough so his wife drove down to pick him up in her old Austin Mini.On the way back up, it started snowing and they kept getting stuck in traffic and Rea said: \"I'd look across at the other drivers, who all looked so miserable. \"Jokingly, I started singing - We're driving home for Christmas... then, whenever the street lights shone inside the car, I started writing down the lyrics.\"Getty ImagesRea began learning to play guitar at the age of 21\"It's one of those moments that songwriters get - sometimes you can spend years and years writing. That one was five to 10 minutes. When you have a successful song, you don't remember thinking about it - it just comes out.\"He didn't sing the song live until December 2014 after his crew badgered him to do it. He hired 12 snow cannons and let them off during the song.\"We put three feet of artificial snow in the stalls. The venue charged me £12,000 to clean it up!\"Getty ImagesRea released his first solo album in 1978Bad traffic on the intersection between the M4 and the M25 was also the inspiration for Road to Hell.Rea's musical journey was brought to a temporary stop when he was diagnosed with pancreatic cancer aged 33.He had a procedure which resulted in the removal of part of his pancreas, the duodenum, the gall bladder and part of his liver. He was also a type 1 diabetic and had problems with his kidney.His health problems made him reassess his career - he never toured America despite his popularity.  \"I was never a rock star or pop star and all the illness has been my chance to do what I'd always wanted to do with music,\" he said.In 1997, that included recording Let's Dance with his good friend Bob Mortimer for Middlesbrough Football Cub's FA Cup Final. In one of Mortimer's appearances on the BBC's comedy series Would I Lie to You, Mortimer claimed that Rea cracked an egg into a bath for him after they'd finished recording it at his studio. The clip about whether that was a truth or lie went viral.Rea was happy to admit that he was a vehicle addict with a huge love of cars, and travelling in them helped inspire some of his music. He owned and raced various vintage cars including a 1957 Morris Minor 1000 police car. He was friends with Eddie Jordan, owner of the Jordan Formula 1 team, and once helped out in the pit lane.\"I had the whole uniform. He put me in charge of the tyre-warmer for the rear right tyre of Eddie Irvine's car\".Getty ImagesRea on his European tour of Road Songs For Lovers in 2017In 2016 he suffered a stroke, but still recovered enough to record and tour his 24th album: Road Songs for Lovers.Rea said he spent an awful lot of time on the road travelling to London.  \"I see couples in cars - are they married, workmates, having an affair?\" he mused.The musician liked to write about the simple things in life: \"You get ideas for songs and you're actually on a road - the road always becomes a metaphor for where we're going in life,\" he once said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chris Rea obituary: A life on the road",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4109/live/6ec31250-df49-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-22T15:05:31.000Z",
      "dateModified": "2025-12-22T15:05:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why do we stop singing when we reach secondary school?",
    "url": "https://www.bbc.com/news/articles/c157de198k1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0db1/live/984e50f0-dc27-11f0-89ae-89110b9e802d.jpg",
    "tag": "Trending",
    "date": "2025-12-22T00:03:39.000Z",
    "description": "20 hours agoKate McGoughEducation reporterDan Nelson / BBCMany children find themselves singing at school in the run up to Christmas - at a nativity p",
    "body": "20 hours agoKate McGoughEducation reporterDan Nelson / BBCMany children find themselves singing at school in the run up to Christmas - at a nativity play or carol concert, often with parents watching proudly on.But new data suggests singing is a much less common occurrence throughout the rest of the school year, especially after pupils leave primary school.Now, an association of music teachers says every school should have a choir, to help pupils embrace music after a years-long decline in its popularity as a GCSE subject.The government says it is investing in high quality music teaching and that a \"renewed curriculum\" will encourage more people to study it.In a recent survey, Teacher Tapp asked just under 10,000 teachers in England how often their whole school sang together in assembly. Over half of state secondary school teachers (57%) said their pupils never sang together in assembly, while just 13% of private secondary school teachers and only 4% of primary teachers said the same. Teachers were separately asked whether their schools had a choir. Just over a third (36%) of teachers at state secondaries reported having no choir at their school, compared to just 8% of private school secondary teachers.Having access to multiple school choirs was much more common at private schools, with three quarters (77%) of private secondary teachers saying their school had more than one choir, compared to 27% of state secondary teachers.Jackie Bowen, head teacher at The East Manchester Academy, says secondary school pupils can feel \"embarrassed - or that maybe it's not cool to sing like it was in primary school\".But she says singing and music are priorities at the school.Dan Nelson / BBCJackie Bowen says music is part of the fabric of school life for her pupils\"We know the intrinsic value of music, but also what it does for students' development, mental health, its impact on academic achievements,\" she says. \"So we've run lots of initiatives to try and break down barriers to music.\" The school offers a music hub at the school once a week, offering pupils time with specialist teachers from the Royal Northern College of Music. At lesson changeover, students hear classical music instead of the traditional bell. The school has also established its first gospel choir. Year 11 student Mercy, who's part of the choir, says she always wanted to continue singing at secondary school.\"In primary they say you have to sing, but when you come to secondary it's a choice, so most people don't do it,\" she says. \"I feel like we should all release our voices to the world. Whether you're good or not, just sing.\"Kate McGough / BBCMercy is part of her school's gospel choir and says she enjoys singingThere has been a 25% drop in pupils studying GCSE music at schools in England over the last fifteen years, despite an uptick in the most recent stats. That is partly down to the introduction of a progress measure for schools called the English Baccalaureate in 2010, which assessed schools based on how many pupils took English, maths, sciences, geography or history and a language - and how well they performed.The government recently announced that it would be changing the school curriculum in England to make it easier for more schools to offer arts subjects like music.There has been some improvement in recruiting new music teachers this year, but the levels still fall 35% short of government's target for trainee music teachers in the most recent stats.James Manwaring, president of the Music Teachers Association - which represents music teachers across both state and private schools - says every school should have a choir.\"All you need is a room and you need someone to lead it and you need students,\" says James, who is also the director of music at Windsor Learning Partnership - a multi-academy trust of six state schools.\"It's a shame to think some state schools aren't capitalising on that.\"He says changes to the school curriculum in England are \"very exciting\" for boosting music in schools, but says more funding and resources will be needed -  \"as well as retaining the wonderful music teachers we have out there\".Dan Nelson / BBCMusic teacher Rob Hatton set up the gospel choir for students at The East Manchester AcademyA Department for Education spokesperson said the government was committed to ensuring art, music and drama \"are no longer the preserve of a privileged few\".Ministers are \"investing millions\" to help schools invest in musical instruments and equipment, and \"supporting high quality music teaching through our Music Hubs\", they said. \"Our renewed curriculum will also give every young person the skills, knowledge and experiences needed to achieve and thrive, including encouraging more people to study music and other creative subjects.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why do we stop singing when we reach secondary school?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0db1/live/984e50f0-dc27-11f0-89ae-89110b9e802d.jpg"
      ],
      "datePublished": "2025-12-22T00:03:39.000Z",
      "dateModified": "2025-12-22T00:03:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chris Rea, Driving Home for Christmas and Road to Hell singer, dies at 74",
    "url": "https://www.bbc.com/news/articles/c8r3ne23e4go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2ced/live/65224300-df4f-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-22T17:07:09.000Z",
    "description": "3 hours agoEmma SaundersCulture reporterGetty ImagesChris Rea pictured in his studio in 2005Chris Rea, the musician behind the festive classic Driving",
    "body": "3 hours agoEmma SaundersCulture reporterGetty ImagesChris Rea pictured in his studio in 2005Chris Rea, the musician behind the festive classic Driving Home for Christmas, has died at the age of 74.The singer died on Monday in hospital following a short illness, a spokesperson for his family said.A statement on behalf of his wife and two children read: \"It is with immense sadness that we announce the death of our beloved Chris. \"He passed away peacefully in hospital earlier today following a short illness, surrounded by his family.\"Chris Rea: The car enthusiast whose love of driving inspired his songsThe blues-influenced star had a string of hits included Auberge, On the Beach, Fool (If You Think It's Over), Let's Dance and Road to Hell.Paying tribute on X, Middlesborough FC said: \"We're deeply saddened to learn of the passing of Chris Rea. A Teesside icon. Rest in peace, Chris.\"Rea's 1980s smash Driving Home for Christmas tells the story of a weary traveller making his way home in heavy traffic.This year, it has been brought to new audiences as the backdrop to the M&S Food Christmas advert.Getty ImagesIn 2020, the singer's social media platforms posted a chat between the Rea and his friend and fellow Middlesbrough native Bob Mortimer, explaining how he came to write the track.Rea said he was on the dole at the time, his manager had just left him and he had been banned from driving. His then-girlfriend Joan (who he met when they were both 16 and went on to marry) had to pick him up in London in her mini and drive him home. That's what inspired the song, which was written in 1978, 10 years before it was released as a single in 1988.Asked about what he thinks of when he hears the song, the singer joked about how it bought him \"that lovely little holiday in the Maldives\".The song has since been covered by artists including Engelbert Humperdinck and Stacey Solomon.Rea was good friends with Mortimer and in 1997 they recorded Let's Dance for Middlesbrough Football Club's FA Cup Final.But alongside the singer-songwriter's success, he had suffered with various bouts of ill-health over the years.He had his pancreas removed a few years after being diagnosed with pancreatic cancer at the age of just 33 in 1994, which meant he developed type 1 diabetes. He later had a stroke in 2016.Rea (centre) appeared on Mortimer & Whitehouse: Gone Christmas Fishing in 2020The star never forgot his roots, telling Saga magazine last year: \"I've always had a difficult relationship with fame, even before my first illness. \"None of my heroes were rock stars. I arrived in Hollywood for the Grammy Awards once and thought I was going to bump in to people who mattered, like Ry Cooder or Randy Newman. But I was surrounded by pop stars.\"He added: \"The celeb thing has gone totally wrong in the sense that everyone has tried to top each other. They don't put the work in.\"Speaking of his wife in the same interview, he said: \"Our golden moment is each morning when there is an elbow fight over whose turn it is to make the coffee. \"Then there are the large mugs of fresh coffee, BBC Breakfast news or Sky and we gaze out of the window over the countryside for an hour and we are still 16. We are lucky to still have that feeling.\"Rea was born in 1951 in Middlesbrough to an Italian father and Irish mother, and had six siblings. He began his working life helping out with his family's ice-cream business.\"To be Irish Italian in a coffee bar in Middlesbrough – I started my life as an outsider,\" he later said.Getty ImagesOnce he found the guitar, he soon began playing in various bands and released his debut album Whatever Happened To Benny Santini? in 1978.His commercial breakthrough came in the 1980s, as two of his studio albums - The Road To Hell (1989) and Auberge (1991) - went to number one in the UK.He returned to his blues roots in his later years while facing his health challenges.After his stroke nine years ago, he recovered to launch a new album, Road Songs For Lovers, in 2017.He took the album on the road at the end of that year but had to cancel a number of shows after he collapsed mid-song while performing at the New Theatre in Oxford.Rea released a new album in October 2025, titled The Christmas Album, featuring a remaster of Driving Home For Christmas as well as other festive tracks. Paying tribute to Rea following his death, journalist Tony Parsons described him as a \"top man\" and \"hugely underrated songwriter\".TV personality Lizzie Cundy, who appeared in the music video for a 2009 version of Driving Home For Christmas, said that she was \"so sad\" to hear the musician had died.\"I loved every minute and was an honour to work with him and be in his iconic music video,\" she said. \"He will always be an inspiration and legend to me.\"Andy McDonald, Labour MP for Middlesbrough and Thornaby East, said he was \"very saddened\" to hear the news of Rea's death.In a post on X, he said: \"Chris, a most cherished son of Middlesbrough, will live on through his wonderful music. My sincere condolences to his family.\"Rea and his wife Joan shared two daughters, Josephine and Julia. He credited his family with helping him to cope after his ill health.\"It's music and family with me. I'm only one of four, that's how I am,\"  Rea once said. \"I'm 25% of a unit. It's always been that way and we like it that way. In between that there's music.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chris Rea, Driving Home for Christmas and Road to Hell singer, dies at 74",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2ced/live/65224300-df4f-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-22T17:07:09.000Z",
      "dateModified": "2025-12-22T17:07:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Husband and 5 other men charged with sex offences against ex-wife",
    "url": "https://www.bbc.com/news/articles/c78vgm0e3zzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/daa9/live/5d620bd0-df5b-11f0-a7ad-b72dffdf9dfd.jpg",
    "tag": "Trending",
    "date": "2025-12-22T17:58:28.000Z",
    "description": "2 hours agoSarah TurnnidgeWest of England GettyAll six men are due to appear in court on Tuesday A husband and five other men have been charged with a",
    "body": "2 hours agoSarah TurnnidgeWest of England GettyAll six men are due to appear in court on Tuesday A husband and five other men have been charged with a string of sexual offences against his ex-wife over a 13-year period. Philip Young, formerly of Swindon but now living in Enfield, has been charged with 56 sexual offences, including rape and administering a substance with intent to stupefy/overpower to allow sexual activity.The 49-year-old has also been charged with voyeurism, possession of indecent images of children and possession of extreme images.Five other men have also been charged with offences against his ex-wife, 48-year-old Joanne Young, who has waived her right to anonymity.All six men are due to appear at Swindon Magistrates' Court on Tuesday.Mr Young, who police described as a white British national, has been remanded in custody.The five other men are on bail.Their names and charges are: Norman Macksoni, 47, of Wood End Close, Sharnbrook. Police described him as a black British national. He has been charged with one count of rape and possession of extreme imagesDean Hamilton, 47, of no fixed abode. Police said he was a white British national. He has been charged with one count of rape and sexual assault by penetration and two counts of sexual touchingConner Sanderson Doyle, 31, of Crofton Road, Swindon. Police said he was a white British national who had been charged with sexual assault by penetration and sexual touchingRichard Wilkins, 61, of Tattershall, Toothill, Swindon. He was described by police as a white British national and he has been charged with one count of rape and sexual touchingMohammed Hassan, 37, of Torun Way, Swindon. Police described him as a British Asian male. He has been charged with sexual touchingDet Supt Geoff Smith, of Wiltshire Police, described the charges as a significant update in a \"complex and extensive\" investigation.He added that Ms Young was being supported by specially trained officers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Husband and 5 other men charged with sex offences against ex-wife",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/daa9/live/5d620bd0-df5b-11f0-a7ad-b72dffdf9dfd.jpg"
      ],
      "datePublished": "2025-12-22T17:58:28.000Z",
      "dateModified": "2025-12-22T17:58:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US pauses offshore wind projects over national security concerns",
    "url": "https://www.bbc.com/news/articles/cd74lyr094vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/50ac/live/93cbbcb0-df61-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-22T18:51:00.000Z",
    "description": "1 hour agoBernd Debusmann Jrat Mar-a-LagoThe US is immediately pausing leases for offshore wind energy projects currently being built near the Atlanti",
    "body": "1 hour agoBernd Debusmann Jrat Mar-a-LagoThe US is immediately pausing leases for offshore wind energy projects currently being built near the Atlantic coastline, citing security concerns. In a statement, the Department of the Interior said it was pausing five large-sale projects to look into how windmills could interfere with radar and create other risks to east coast cities.President Donald Trump has long opposed wind energy, saying it is unreliable and drives up costs, and attempted to stop all projects when he returned to office. Interior Secretary Doug Burgum has said wind farms have no future in the US energy grid. Renewable energy companies, as well as state leaders, have expressed alarm over the administration's stance.In its statement, the Department of the Interior said the pause \"addresses emerging national security risks, including the rapid evolution of the relevant adversary technologies, and the vulnerabilities created by large-scale offshore wind projects with proximity near our east coast population centres\".The five wind farms now on pause are being constructed off the coast of New York, Virginia, Massachusetts, Rhode Island, and Connecticut.Specifically, the announcement noted that officials are concerned about radar interference \"clutter\" that can obscure real moving targets or, conversely, create false ones. It added that a radar's threshold for false-alarm detection could be increased to reduce some clutter, but only at the risk of missing actual targets. The wind projects could make it difficult to \"determine what's friend and foe in our airspace\", Burgum said in an interview with Fox Business on Monday, where he cited drone strikes between Russia and Ukraine and between Iran and Israel as examples. Dominion Energy, the company behind the Virginia wind farm, said its project is far offshore and \"does not raise visual impact concerns.\"\"The project's two pilot turbines have been operating for five years without causing any impacts to national security,\" it said in a statement. Connecticut Governor Ned Lamont, a Democrat, described the pause as an \"erratic\" move that \"will drive up the price of electricity in Connecticut and throughout the region\". \"This project is nearing completion and providing good-paying clean energy jobs,\" he added. \"Businesses and residents deserve economic predictability, yet with the administration's constant starts and stops they're left with the opposite.\"Earlier in December, a federal judge struck down an attempt by President Trump to ban new wind power projects in the US, calling it \"arbitrary and capricious and contrary to law\". On the first day of his administration in January, Trump issued a memorandum halting permits and new leases until a federal review could be undertaken. Five months later, 17 US states led by New York sued the administration, calling the ban an \"existential\" threat to the US wind industry. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US pauses offshore wind projects over national security concerns",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/50ac/live/93cbbcb0-df61-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-22T18:51:00.000Z",
      "dateModified": "2025-12-22T18:51:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jimmy Kimmel criticises 'fascism' in Channel 4's Alternative Christmas Message",
    "url": "https://www.bbc.com/news/articles/cr4d9n13z0eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/be30/live/9fa53a90-df32-11f0-b6a6-1bf5f87ee304.jpg",
    "tag": "Trending",
    "date": "2025-12-22T13:46:23.000Z",
    "description": "Jimmy Kimmel to say 'fascism has had a great year' in Channel 4 Christmas message6 hours agoSteven McIntoshEntertainment reporterUS chat show host Jim",
    "body": "Jimmy Kimmel to say 'fascism has had a great year' in Channel 4 Christmas message6 hours agoSteven McIntoshEntertainment reporterUS chat show host Jimmy Kimmel will say 2025 has been \"a really great year for fascism\", when he delivers this year's Alternative Christmas Message on Channel 4.The presenter's ABC talk show was briefly taken off air in September after comments he made about the shooting of Charlie Kirk.The host's suspension led to a debate in the US about freedom of speech and freedom of the press. Kimmel was reinstated a week after his removal.The full quote from his address will say: \"From a fascism perspective, this has been a really great year.\"In a statement, Channel 4 said his address \"comes at the end of a year when US politics has featured heavily in news and current affairs programming\".The presenter has been one of President Trump's most high-profile and vocal critics for the last decade.The British network said Kimmel will \"reflect on the past few months in a deeply personal and characteristically jovial address\", following his \"return to air and his much-publicised criticism of the US administration\".Channel 4 has broadcast an \"alternative\" holiday address to the monarch's message, which airs on BBC One and ITV, since 1993.Stars to have previously delivered the alternative message include Sir Stephen Fry, Danny Dyer, Katie Piper, Sharon Osbourne and Jamie Oliver.But it has also often been fronted by political personalities or figures who have been in the news, such as the President of Iran, Mahmoud Ahmadinejad; whistle-blower Edward Snowden; and Afghan war veteran Major Andrew Stockton.Channel 4 has not released any further quotes from Kimmel's address other than his line about fascism, but he is expected to strike a similar tone as he did last week when presenting the last episode of his talk show for the year.He told viewers: \"This has been a strange year. It's been a hard year. We've had some lows, we've had some highs. For me, maybe more than any year in my life.\"\"But on behalf of all of us at the show, I just want to say that we appreciate your support, your enthusiasm.\"And not just for watching. This year you literally pulled us out of a hole, and we cannot thank you enough, personally, professionally.\"The comic's abrupt suspension came after threats by the federal TV regulator, the Federal Communications Commission (FCC) to revoke ABC's broadcast licence. The body is chaired by President Trump appointee, Brendan Carr.The US President had welcomed Kimmel's suspension and suggested that some TV networks should have their licences \"taken away\".President Trump and his supporters praised the decision to take Kimmel's show off air, which came after pressure on ABC and its owner Disney from the White House and the president's supporters.Jimmy Kimmel's Alternative Christmas Message will air on Channel 4 at 17:45 GMT on Christmas Day, two hours after the King's Christmas Message on ITV and BBC One.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jimmy Kimmel criticises 'fascism' in Channel 4's Alternative Christmas Message",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/be30/live/9fa53a90-df32-11f0-b6a6-1bf5f87ee304.jpg"
      ],
      "datePublished": "2025-12-22T13:46:23.000Z",
      "dateModified": "2025-12-22T13:46:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]