[
  {
    "title": "Russian general killed by car bomb in Moscow, officials say",
    "url": "https://www.bbc.com/news/articles/c8jwn9wznx1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2429/live/f2cd8ea0-df2f-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2025-12-22T15:10:28.000Z",
    "description": "1 hour agoAlex BoydandLaura GozziBBC Russia Editor Steve Rosenberg on scene of Moscow car bombingA Russian general has been killed in a car bombing in",
    "body": "1 hour agoAlex BoydandLaura GozziBBC Russia Editor Steve Rosenberg on scene of Moscow car bombingA Russian general has been killed in a car bombing in Moscow, officials have said.Russia's Investigative Committee said Lt Gen Fanil Sarvarov died on Monday morning after an explosive device planted under a car detonated.He is the third military official to have been killed in bomb attacks in the Russian capital over the last year.Sarvarov, 56, was the head of the armed forces' operational training department, the committee said.It added one theory being investigated was that the bomb was planted with the involvement of Ukrainian intelligence services. Ukraine has not commented.Sarvarov died in hospital as a result of his injuries, the committee said, adding it had opened an investigation into murder and illegal trafficking of explosives.Investigators have been sent to the scene, in a car park near an apartment block in the south of Moscow.Images from the area show a badly damaged white Kia Sorento with the doors blown out, surrounded by other vehicles. According to Russian media, Sarvarov previously took part in combat operations during the Ossetian-Ingush conflict and the Chechen wars in the 1990s and early 2000s, and also led operations in Syria between 2015-2016. ReutersInvestigators could be seen working at the scene on Monday morningVladimir Putin was informed of Sarvarov's death immediately, Kremlin spokesman Dmitry Peskov said.Since Russia launched its full-scale invasion of Ukraine in February 2022, a number of military officials and high-profile individuals have been targeted in the Russian capital.Darya Dugina, the 29-year-old daughter of a prominent nationalist figure and Putin close ally, was killed in a suspected car bombing in 2022.Gen Yaroslav Moskalik was killed in a car bomb attack last April, while Gen Igor Kirillov died in December 2024 when a device hidden in a scooter was detonated remotely.A Ukrainian source later told the BBC that Kirillov was killed by Ukraine's security service, though this was never confirmed on the record. As a matter of policy, Ukraine never officially admits or claims responsibility for targeted attacks.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Russian general killed by car bomb in Moscow, officials say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2429/live/f2cd8ea0-df2f-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-22T15:10:28.000Z",
      "dateModified": "2025-12-22T15:10:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "British woman detained in Iran shares pain in Christmas poem",
    "url": "https://www.bbc.com/news/articles/cx25rvkm8x7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/263c/live/af336030-defc-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2025-12-22T14:45:08.000Z",
    "description": "2 hours agoCaroline HawleyCorrespondentA British woman jailed in Iran for almost a year has spoken of the pain of separation from her family in a poig",
    "body": "2 hours agoCaroline HawleyCorrespondentA British woman jailed in Iran for almost a year has spoken of the pain of separation from her family in a poignant Christmas message written in her cell.\"At a time when we should be connected, we find ourselves alone, down, dejected,\" Lindsay Foreman wrote in a poem entitled A Sad Voice From Evin Prison - A Christmas Poem. A recording of her reading the message to her son on the phone from a noisy prison corridor has been shared with the BBC. It is the first time her voice has been heard publicly since her arrest.She spoke of a \"family torn apart\" and said that grief \"has made a home from the hole in our heart\".Ms Foreman, 53, said she wrote the poem for her family \"and for anyone who has lost someone and when Christmas may not be such a happy time\".She and her husband Craig were on the trip of a lifetime, by motorbike, from Spain to Australia when they were arrested by Iranian authorities in January and accused of espionage – charges the family say are \"ludicrous\".They had visas for Iran, a tour guide and a pre-approved itinerary.Ms Foreman had been asking people along the route what constitutes a good life, and those questions appear to form the basis of the regime's accusations against the couple.They are currently being held separately in Iran's notorious Evin jail in Tehran, where Nazanin Zaghari-Ratcliffe was previously imprisoned.Their family say the cells are overcrowded, unsanitary and vermin-infested, with inadequate washing facilities and hygiene supplies.\"They are in unimaginable conditions,\" Ms Foreman's son Joe Bennett told the BBC, describing rats running around as they cooked.He said the couple were not receiving enough food and were losing weight.  Mr Bennett's stepfather, Craig Foreman, is said to be suffering constant dental pain but has not been allowed to see a dentist.After going on hunger strike last month, the couple are now being allowed almost daily phone calls with their family.But Mr Bennett says that, despite her attempts to put a brave face on for him, he has heard his mother crying and begging to get home.Both his mother and step-father are being \"slowly broken\" and in \"growing distress\", he says.He has called on the UK government to \"come out and defend them\" and say publicly that they are not spies.A spokesperson for the Foreign Office said in response:  \"We are deeply concerned by reports that Craig and Lindsay Foreman have been charged with espionage in Iran.\"We continue to raise this case directly with the Iranian authorities.\"Foreign Secretary Yvette Cooper is understood to have raised the case when she spoke to her Iranian counterpart, Abbas Araqchi, last Friday.The UK government advises against all travel to Iran.\"Having a British passport or connections to the UK can be reason enough for the Iranian authorities to detain you,\" it warns.Lindsay and Craig Foreman have appeared in court several times but have not been officially convicted or tried.Ms Foreman wrote in her poem to her family: \"We wish that we could be together. To hug and hold each other forever.\"For Joe Bennett, it is hard to contemplate the next few days without them.\"It's horrendous,\" he said. \"They were the life and soul of Christmas.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "British woman detained in Iran shares pain in Christmas poem",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/263c/live/af336030-defc-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-22T14:45:08.000Z",
      "dateModified": "2025-12-22T14:45:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fuel profit margins still persistently high, says watchdog",
    "url": "https://www.bbc.com/news/articles/c2dzk4kz722o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9a92/live/cb36e890-df26-11f0-9dac-b79514ec4a2d.jpg",
    "tag": "Trending",
    "date": "2025-12-22T14:29:52.000Z",
    "description": "2 hours agoEmer MoreauBusiness reporterDrivers could be paying more than they should for petrol and diesel after the UK's competition watchdog said fu",
    "body": "2 hours agoEmer MoreauBusiness reporterDrivers could be paying more than they should for petrol and diesel after the UK's competition watchdog said fuel profit margins remain at \"persistently high levels\" despite prices at the pump having fallen.The Competition and Markets Authority (CMA) also challenged retailers' claims that this was a result of higher operating costs, and said competition in the sector was \"weak\".However, the Petrol Retailers Association said falling fuel prices were an indication of healthy competition.The CMA's report was published as the government prepares to launch its \"fuel finder\" scheme, which will allow drivers to compare real-time fuel prices.Petrol was 136.8p per litre last week, according to government tracking, while diesel was 146.1p per litre.The CMA report found that fuel prices had fallen \"significantly\" since it last studied the issue in 2023, largely due to lower oil prices.However, it said profit margins on fuel for both supermarket and non-supermarket retailers were \"historically high\".\"Average fuel margins on a percentage basis have continued to increase for both supermarket and non-supermarket retailers,\" it said.The report noted fuel retailers' arguments that their operating costs had increased, but if this were the case, \"we would expect to see this reflected in declining profit margins\".The CMA said if there was more competition, drivers would see better fuel prices at the pump.Retailers will have to sign up to the planned fuel finder scheme and report price changes within 30 minutes of them being implemented.The CMA said the finder would be accessible through apps and satnavs, and allow drivers to easily compare prices.\"In turn, this should incentivise retailers to compete harder for customers, placing downward pressure on prices.\"The CMA will take action against retailers who breach the conditions of the fuel finder, which could include fines.Dan Turnbull, senior director of markets at the CMA, said: \"Fuel margins remain at persistently high levels – and our new analysis shows operating costs do not explain this. \"We know fuel costs are a big issue for drivers, especially at this time of year with millions making journeys across the country.\"The Petrol Retailers Association (PRA) said it would \"continue to work constructively with the CMA\" and would engage with the fuel finder scheme.Gordon Balmer, the executive director of the PRA, said: \"Operating costs alone do not account for higher fuel margins, yet retailers continue to face steep rises in labour, taxation, energy and crime.\"Comparisons with historic margins overlook these significant cost increases. \"Pump prices are considerably lower than the peaks observed in 2022 and 2023, corresponding with falls in wholesale fuel prices, indicating strong competition between retailers.\"Both the RAC and the AA said drivers were being overcharged for fuel.The AA said that, since November, the wholesale cost of petrol has fallen more than 7p per litre but the average petrol pump price had fallen by just two-thirds of a penny.\"It comes as millions of drivers take to the road for Christmas and are being overcharged for their fuel,\" the motoring body said.\"Drivers are being taken for a ride at the pumps, as the CMA clearly illustrates.\"RAC head of policy Simon Williams said: \"Many drivers won't be surprised to hear that they're still paying too much for their fuel, especially judging by the complaints we receive about large price variations from area to area.\"He said retailers' arguments of higher operating costs had \"now been clearly rejected\" by the CMA.\"We sincerely hope the new fuel finder scheme, combined with ongoing scrutiny from the CMA, finally leads to increased competition and lower forecourt prices for drivers right across the country.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fuel profit margins still persistently high, says watchdog",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9a92/live/cb36e890-df26-11f0-9dac-b79514ec4a2d.jpg"
      ],
      "datePublished": "2025-12-22T14:29:52.000Z",
      "dateModified": "2025-12-22T14:29:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Avatar: Fire and Ash tops US box office on debut but down on The Way of Water opener ",
    "url": "https://www.bbc.com/news/articles/cly5jrrj227o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f63a/live/32ec9db0-df2f-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-22T12:19:24.000Z",
    "description": "4 hours agoEmma SaundersCulture reporterAvatar: Fire and Ash, the third outing in James Cameron's blockbuster sci-fi adventure series, has topped the ",
    "body": "4 hours agoEmma SaundersCulture reporterAvatar: Fire and Ash, the third outing in James Cameron's blockbuster sci-fi adventure series, has topped the US and Canada box office on its opening weekend.The latest in the franchise took an estimated $88m (£65.5m), but that was significantly down on the $134m (£100m) that Avatar: The Way of the Water took on its opening weekend in 2022.However, the Avatar franchise is known for its longevity at the box office, so its opening weekend figure will probably increase significantly in the coming weeks.Both 2009's Avatar, which was considered groundbreaking for its revolutionary use of technology, and sequel The Way of the Water, held on to the top box office spot for seven consecutive weeks.\"The openings are not what the Avatar movies are about. It's what they do after they open,\" David A Gross of Franchise Entertainment Research said.The film took £9m at the UK and Ireland box office, and reached a global total of $345m (£257m), compared with The Way of Water's global figure of $441m (£328m).The film once again stars Zoe Saldaña as Na'vi warrior Neytiri and and Sam Worthington as ex-Marine Jake Sully, who have to fight off a new enemy after threats to their family's life on Pandora.The latest Avatar adventure has received decidedly mixed reviews from critics.Empire's Ben Travis was a fan, giving it four out of a possible five stars, describing it as \"truly epic cinema.\"While noting that \"anyone hoping for a seismic shift in the overall saga should recalibrate their expectations,\" he added: \"Still, this is about the most spectacular spectacle you could ever ask for - utterly transportive, technically masterful. \"It's near-unfathomable that barely anything on screen actually exists; so photo-real, you never even think about it. And it's all in service to myth-making at the highest level, Cameron and crew weaving entire new tapestries with unparalleled imagination.\"The London Evening Standard's Nick Howells gave it the same rating, describing the film as \"three hours and 15 minutes of unsurpassed cinematic pyrotechnics\".He added: \"Cameron has taken 3D cinema to another wild dimension with a gloriously intense experience that will, frankly, leave you deliriously exhausted.\"But others were left underwhelmed.Time Magazine's Stephanie Zacharek headline was scathing in her review, headlined: \"Avatar used to be revolutionary. Three movies in, the franchise has lost its wonder.She added: \"Avatar: Fire and Ash never lets you forget you're looking at a screen, especially as hour three starts ticking by. Cameron's vision is no longer the future, but a nostalgia trip, a very expensive form of deja vu. Movie magic can take many forms, but rarely is it as calculated as this, confusing awe with stupor.\"Robbie Collin of the Daily Telegraph concurred, his headline describing his experience of the film \"like watching £300m of glitter tipped into a fish tank.\"He added; \"The mind-numbing third film in James Cameron's mega-franchise proves he's stuck in a creative cul-de-sac.\"The film also opened in the UK on Friday, with its box office weekend takings due to be revealed early this week.Cameron has previously said there will be five Avatar films in total, but recently rowed back a little on this plan, teasing: \"Let's do another interview in a year and then I'll tell you what my plans are.\"He completed the scripts for Way of Water and Fire and Ash 10 years ago and started filming both movies simultaneously in 2017.The Aliens and Titanic director told USA Today: \"For me, it's been a 10-year cycle, and this is the culmination of a single story arc.\"So I feel done. I mean, I could stop now or I could continue in the Avatar world. And there are reasons to do that; inquiring minds want to know what happens next. That's cool if the fans want to see more and if we make enough money on this film.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Avatar: Fire and Ash tops US box office on debut but down on The Way of Water opener ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f63a/live/32ec9db0-df2f-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-22T12:19:24.000Z",
      "dateModified": "2025-12-22T12:19:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why do we stop singing when we reach secondary school?",
    "url": "https://www.bbc.com/news/articles/c157de198k1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0db1/live/984e50f0-dc27-11f0-89ae-89110b9e802d.jpg",
    "tag": "Trending",
    "date": "2025-12-22T00:03:39.000Z",
    "description": "16 hours agoKate McGoughEducation reporterDan Nelson / BBCMany children find themselves singing at school in the run up to Christmas - at a nativity p",
    "body": "16 hours agoKate McGoughEducation reporterDan Nelson / BBCMany children find themselves singing at school in the run up to Christmas - at a nativity play or carol concert, often with parents watching proudly on.But new data suggests singing is a much less common occurrence throughout the rest of the school year, especially after pupils leave primary school.Now, an association of music teachers says every school should have a choir, to help pupils embrace music after a years-long decline in its popularity as a GCSE subject.The government says it is investing in high quality music teaching and that a \"renewed curriculum\" will encourage more people to study it.In a recent survey, Teacher Tapp asked just under 10,000 teachers in England how often their whole school sang together in assembly. Over half of state secondary school teachers (57%) said their pupils never sang together in assembly, while just 13% of private secondary school teachers and only 4% of primary teachers said the same. Teachers were separately asked whether their schools had a choir. Just over a third (36%) of teachers at state secondaries reported having no choir at their school, compared to just 8% of private school secondary teachers.Having access to multiple school choirs was much more common at private schools, with three quarters (77%) of private secondary teachers saying their school had more than one choir, compared to 27% of state secondary teachers.Jackie Bowen, head teacher at The East Manchester Academy, says secondary school pupils can feel \"embarrassed - or that maybe it's not cool to sing like it was in primary school\".But she says singing and music are priorities at the school.Dan Nelson / BBCJackie Bowen says music is part of the fabric of school life for her pupils\"We know the intrinsic value of music, but also what it does for students' development, mental health, its impact on academic achievements,\" she says. \"So we've run lots of initiatives to try and break down barriers to music.\" The school offers a music hub at the school once a week, offering pupils time with specialist teachers from the Royal Northern College of Music. At lesson changeover, students hear classical music instead of the traditional bell. The school has also established its first gospel choir. Year 11 student Mercy, who's part of the choir, says she always wanted to continue singing at secondary school.\"In primary they say you have to sing, but when you come to secondary it's a choice, so most people don't do it,\" she says. \"I feel like we should all release our voices to the world. Whether you're good or not, just sing.\"Kate McGough / BBCMercy is part of her school's gospel choir and says she enjoys singingThere has been a 25% drop in pupils studying GCSE music at schools in England over the last fifteen years, despite an uptick in the most recent stats. That is partly down to the introduction of a progress measure for schools called the English Baccalaureate in 2010, which assessed schools based on how many pupils took English, maths, sciences, geography or history and a language - and how well they performed.The government recently announced that it would be changing the school curriculum in England to make it easier for more schools to offer arts subjects like music.There has been some improvement in recruiting new music teachers this year, but the levels still fall 35% short of government's target for trainee music teachers in the most recent stats.James Manwaring, president of the Music Teachers Association - which represents music teachers across both state and private schools - says every school should have a choir.\"All you need is a room and you need someone to lead it and you need students,\" says James, who is also the director of music at Windsor Learning Partnership - a multi-academy trust of six state schools.\"It's a shame to think some state schools aren't capitalising on that.\"He says changes to the school curriculum in England are \"very exciting\" for boosting music in schools, but says more funding and resources will be needed -  \"as well as retaining the wonderful music teachers we have out there\".Dan Nelson / BBCMusic teacher Rob Hatton set up the gospel choir for students at The East Manchester AcademyA Department for Education spokesperson said the government was committed to ensuring art, music and drama \"are no longer the preserve of a privileged few\".Ministers are \"investing millions\" to help schools invest in musical instruments and equipment, and \"supporting high quality music teaching through our Music Hubs\", they said. \"Our renewed curriculum will also give every young person the skills, knowledge and experiences needed to achieve and thrive, including encouraging more people to study music and other creative subjects.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why do we stop singing when we reach secondary school?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0db1/live/984e50f0-dc27-11f0-89ae-89110b9e802d.jpg"
      ],
      "datePublished": "2025-12-22T00:03:39.000Z",
      "dateModified": "2025-12-22T00:03:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zendaya and Tom Holland in surprise Leicestershire curry house stop",
    "url": "https://www.bbc.com/news/articles/c4g9j2wzg5qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fca9/live/13441670-df37-11f0-b6a6-1bf5f87ee304.jpg",
    "tag": "Trending",
    "date": "2025-12-22T15:44:37.000Z",
    "description": "31 minutes agoDan Hunt,East MidlandsandBen Jackson,BBC Radio LeicesterEverest Lounge Market HarboroughTom Holland and Zendaya visited Everest Lounge i",
    "body": "31 minutes agoDan Hunt,East MidlandsandBen Jackson,BBC Radio LeicesterEverest Lounge Market HarboroughTom Holland and Zendaya visited Everest Lounge in Market HarboroughA restaurant owner said his staff were \"absolutely starstruck\" after a surprise visit by two Hollywood A-listers.Pradip Karanjit said Tom Holland and Zendaya dined with friends at his restaurant in Market Harborough, Leicestershire, on Saturday. They had been in the area to see a theatre show.Mr Karanjit, who runs Everest Lounge in St Mary's Road, said his team were happy to accommodate the couple despite the restaurant being fully booked.He added the pair - who star in the most recent Spider-Man film - did not come across as \"Hollywood royalty\", but were just a \"normal young couple\" going for a meal.He said Holland tucked into a chicken tikka masala, pilau rice and a garlic naan, while Zendaya enjoyed a chana saag bengan, paneer shaslik starter with a side of saag aloo.Getty ImagesZendaya and Tom Holland both starred in Spider-Man: No Way Home Holland and Zendaya, both 29, have starred in a number of blockbusters alongside Spider-Man: No Way Home. Zendaya rose to fame on the Disney Channel and has since starred in Dune, Challengers, Malcolm & Marie and the TV series Euphoria.Holland played the lead role in Billy Elliot the Musical in the West End as a child, and has since appeared in Uncharted, Cherry and The Devil All The Time.His role as Spider-Man saw him star in three of the superhero films alongside Zendaya, as well as other appearances in the Marvel Cinematic Universe.\"We were fully booked for Saturday so we were exceptionally pleased that we were able to accommodate them for the evening and that's where everything started,\" Mr Karanjit said.\"My staff were absolutely starstruck and we were, in a way, in panic mode but throughout the service they remained really professional.\"Mr Karanjit told the BBC he was not in the restaurant when the couple visited, but said his phone went \"really hot\" with calls asking about their visit - and he had to phone the restaurant to confirm the news.\"I missed the whole experience, but it was something for Harborough itself and our restaurant as well,\" he added.Theatre fansThe couple had been in the area to watch a production of The Sound of Music at Leicester's Curve theatre on Saturday.Holland had also been in the audience for My Fair Lady at the same venue in 2024.A spokesperson for Curve said: \"It's the second year Tom has been to see one of our shows. We were very excited to see them.\"After the 2024 visit, cast member Minal Patel told the BBC it was \"great\" to have someone of Holland's profile watching the performance.\"It's testament to a place like Curve to have people like him come and see a show,\" he said.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zendaya and Tom Holland in surprise Leicestershire curry house stop",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fca9/live/13441670-df37-11f0-b6a6-1bf5f87ee304.jpg"
      ],
      "datePublished": "2025-12-22T15:44:37.000Z",
      "dateModified": "2025-12-22T15:44:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chris Rea obituary: A life on the road",
    "url": "https://www.bbc.com/news/articles/c51y93wqv5po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4109/live/6ec31250-df49-11f0-b67b-690eb873de1b.jpg",
    "tag": "Trending",
    "date": "2025-12-22T15:05:31.000Z",
    "description": "Chris Rea: The car enthusiast whose love of driving inspired his songs1 hour agoEmma PetrieGetty ImagesChris Rea: \"Most of the songs are different peo",
    "body": "Chris Rea: The car enthusiast whose love of driving inspired his songs1 hour agoEmma PetrieGetty ImagesChris Rea: \"Most of the songs are different people's love stories inside cars\"The rock and blues singer, Chris Rea spent countless hours on the road, and his love of cars and driving was the inspiration behind many of his songs. He recorded 25 solo albums, two of which topped the UK albums chart. His distinctive gravelly voice and slide guitar-playing are preserved in songs such as Road to Hell, Auberge, On the Beach and Driving Home for Christmas.Christopher Anton Rea was born in Middlesbrough, North Yorkshire in 1951 to an Italian father and Irish mother and was one of seven children. The family was known locally for Camillo's Ice cream factory and cafes, owned by his father Camillo Rea.Driving Home for Christmas singer Chris Rea dies aged 74Chris worked in the cafes as a teenager and took his driving test in one of his dad's ice cream vans. When he was asked to do an emergency stop, the examiner fell off the box he was sitting on and cut his leg. Rea said: \"I had to take him to the hospital but he still passed me.\"He was still working for his father when he bought his first guitar, a 1961 Hofner V3 in his early 20s.Rea said that at the time he was \"meant to be developing my father's ice cream cafe into a global concern, but I spent all my time in the stockroom playing slide guitar\".Getty ImagesChris Rea: \"The road always becomes a metaphor for where we are going in life.\"He played with local groups The Elastic Band, and Magdalene, but it was The Beautiful Losers which shone the spotlight on Rea, and he secured a solo recording deal with Magnet Records.His first studio album was Whatever Happened to Benny Santini?, released in 1978. The lead single, Fool (If You Think It's Over), was a big hit in the US, reaching number one on the (adult) contemporary singles Billboard chart, earning him a best new artist  nomination at the Grammy Awards.Michael Levey, co-founder of Magnet records, remembers him as \"more of a thoughtful, introspective poet than a natural pop performer\".One of Rea's childhood dreams had been to write and compose music for films. He achieved both with his movie La Passione in 1996. Rea also wrote the score and title track for the Soft Top Hard Shoulder film and starred in the comedy Parting Shots in 1999.Getty Images\"Music and cars fit together very well\" Rea explainedRea was building a reputation for his slide guitar playing when his record company insisted on releasing Driving Home for Christmas in 1986. He said: \"I didn't need a Christmas song hanging around at that point. I did everything I could to get them not to release that record. Thankfully they did!\"The song's inspiration dates back to a difficult year for him personally.  In 1978 Rea had come to the end of his record contract and had parted ways with his manager. The record company wouldn't pay for a train ticket for him to get from London to his home to Middlesbrough so his wife drove down to pick him up in her old Austin Mini.On the way back up, it started snowing and they kept getting stuck in traffic and Rea said: \"I'd look across at the other drivers, who all looked so miserable. \"Jokingly, I started singing - We're driving home for Christmas... then, whenever the street lights shone inside the car, I started writing down the lyrics.\"Getty ImagesRea began learning to play guitar at the age of 21\"It's one of those moments that songwriters get - sometimes you can spend years and years writing. That one was five to 10 minutes. When you have a successful song, you don't remember thinking about it - it just comes out.\"He didn't sing the song live until December 2014 after his crew badgered him to do it. He hired 12 snow cannons and let them off during the song.\"We put three feet of artificial snow in the stalls. The venue charged me £12,000 to clean it up!\"Getty ImagesRea released his first solo album in 1978Bad traffic on the intersection between the M4 and the M25 was also the inspiration for Road to Hell.Rea's musical journey was brought to a temporary stop when he was diagnosed with pancreatic cancer aged 33.He had a procedure which resulted in the removal of part of his pancreas, the duodenum, the gall bladder and part of his liver. He was also a type 1 diabetic and had problems with his kidney.His health problems made him reassess his career - he never toured America despite his popularity.  \"I was never a rock star or pop star and all the illness has been my chance to do what I'd always wanted to do with music,\" he said.In 1997, that included recording Let's Dance with his good friend Bob Mortimer for Middlesbrough Football Cub's FA Cup Final. In one of Mortimer's appearances on the BBC's comedy series Would I Lie to You, Mortimer claimed that Rea cracked an egg into a bath for him after they'd finished recording it at his studio. The clip about whether that was a truth or lie went viral.Rea was happy to admit that he was a vehicle addict with a huge love of cars, and travelling in them helped inspire some of his music. He owned and raced various vintage cars including a 1957 Morris Minor 1000 police car. He was friends with Eddie Jordan, owner of the Jordan Formula 1 team, and once helped out in the pit lane.\"I had the whole uniform. He put me in charge of the tyre-warmer for the rear right tyre of Eddie Irvine's car\".Getty ImagesRea on his European tour of Road Songs For Lovers in 2017In 2016 he suffered a stroke, but still recovered enough to record and tour his 24th album: Road Songs for Lovers.Rea said he spent an awful lot of time on the road travelling to London.  \"I see couples in cars - are they married, workmates, having an affair?\" he mused.The musician liked to write about the simple things in life: \"You get ideas for songs and you're actually on a road - the road always becomes a metaphor for where we're going in life,\" he once said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chris Rea obituary: A life on the road",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4109/live/6ec31250-df49-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-22T15:05:31.000Z",
      "dateModified": "2025-12-22T15:05:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gold and silver hit records as investors hunt for safety",
    "url": "https://www.bbc.com/news/articles/cd74ldr2zryo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/299d/live/b4e710a0-df13-11f0-8db4-97f4d263443d.jpg",
    "tag": "Trending",
    "date": "2025-12-22T14:35:14.000Z",
    "description": "2 hours agoJosh MartinBusiness reporterThe gold price has hit another record high, trading above $4,400 (£3,275) an ounce for the first time.The price",
    "body": "2 hours agoJosh MartinBusiness reporterThe gold price has hit another record high, trading above $4,400 (£3,275) an ounce for the first time.The price of the precious metal has risen on expectations the US central bank will cut interest rates further next year, analysts said.Gold started the year worth $2,600 an ounce, but geopolitical tensions, the Trump tariffs and expectations of rate cuts have added to investor demand for safe haven assets, such as gold and other commodities.The prices of other precious metals also rose on Monday, with silver hitting a record high as well.The gold price has risen more than 68% this year, the highest increase since 1979, according to Adrian Ash, director of research at gold bullion marketplace BullionVault.2025 has seen \"slow-burning trends around interest rates, around war and trade tensions\", Mr Ash said, which have helped to push up the price of gold.\"The precious metals market says that President Trump has really triggered something – and gold has gone crazy this year.\"You've got the trade war, the attacks on the US Federal Reserve and you've got geopolitical tensions, all of those provocations come from Trump,\" he said.After passing the $4,400 an ounce mark on Monday, the spot price of gold hit a high of $4,426.66.Lower interest rate expectations typically mean lower returns for investments such as bonds, so investors look to commodities such as gold and silver to get a return, but also diversify their portfolios.The consensus among analysts currently is that the US will lower interest rates twice in 2026.Another factor adding to demand is that central banks globally are expanding their own physical holdings of gold as a way to counter economic turbulence, reduce reliance on the US dollar, and diversify their own portfolios, according to analysis from Goldman Sachs, which predicted the pattern would continue in 2026.The steady increase in the price of gold across the year could be because it is seen as a way for traders to help shield themselves from the threat of inflation and economic turmoil, Anita Wright, chartered financial planner at Ribble Wealth Management, said.\"When confidence in financial assets and policy stability starts to wobble, gold tends to respond first as the primary monetary metal,\" Ms Wright said.A weaker US dollar has also helped push gold prices higher by making the metal cheaper for overseas buyers.Other precious metals have also had record years. The price of silver also hit a record of $69.44 an ounce on Monday.For 2025 so far, silver is up 138% year-to-date and platinum is at a 17-year high, vastly outperforming gold, underpinned by strong and supply constraints, according to analysts. Unlike gold, the other precious metals are also used widely in industrial manufacturing which helps stoke demand.Separately, oil prices rose on Monday, after the US ordered a \"blockade\" last week of sanctioned oil tankers entering and leaving Venezuela.The price of Brent crude rose $1.31 to $61.78 a barrel, while US oil was up $1.25 at $57.77. However, both measures look set to end 2025 at prices lower than where they started the year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gold and silver hit records as investors hunt for safety",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/299d/live/b4e710a0-df13-11f0-8db4-97f4d263443d.jpg"
      ],
      "datePublished": "2025-12-22T14:35:14.000Z",
      "dateModified": "2025-12-22T14:35:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jimmy Kimmel criticises 'fascism' in Channel 4's Alternative Christmas Message",
    "url": "https://www.bbc.com/news/articles/cr4d9n13z0eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/be30/live/9fa53a90-df32-11f0-b6a6-1bf5f87ee304.jpg",
    "tag": "Trending",
    "date": "2025-12-22T13:46:23.000Z",
    "description": "Jimmy Kimmel to say 'fascism has had a great year' in Channel 4 Christmas message3 hours agoSteven McIntoshEntertainment reporterUS chat show host Jim",
    "body": "Jimmy Kimmel to say 'fascism has had a great year' in Channel 4 Christmas message3 hours agoSteven McIntoshEntertainment reporterUS chat show host Jimmy Kimmel will say 2025 has been \"a really great year for fascism\", when he delivers this year's Alternative Christmas Message on Channel 4.The presenter's ABC talk show was briefly taken off air in September after comments he made about the shooting of Charlie Kirk.The host's suspension led to a debate in the US about freedom of speech and freedom of the press. Kimmel was reinstated a week after his removal.The full quote from his address will say: \"From a fascism perspective, this has been a really great year.\"In a statement, Channel 4 said his address \"comes at the end of a year when US politics has featured heavily in news and current affairs programming\".The presenter has been one of President Trump's most high-profile and vocal critics for the last decade.The British network said Kimmel will \"reflect on the past few months in a deeply personal and characteristically jovial address\", following his \"return to air and his much-publicised criticism of the US administration\".Channel 4 has broadcast an \"alternative\" holiday address to the monarch's message, which airs on BBC One and ITV, since 1993.Stars to have previously delivered the alternative message include Sir Stephen Fry, Danny Dyer, Katie Piper, Sharon Osbourne and Jamie Oliver.But it has also often been fronted by political personalities or figures who have been in the news, such as the President of Iran, Mahmoud Ahmadinejad; whistle-blower Edward Snowden; and Afghan war veteran Major Andrew Stockton.Channel 4 has not released any further quotes from Kimmel's address other than his line about fascism, but he is expected to strike a similar tone as he did last week when presenting the last episode of his talk show for the year.He told viewers: \"This has been a strange year. It's been a hard year. We've had some lows, we've had some highs. For me, maybe more than any year in my life.\"\"But on behalf of all of us at the show, I just want to say that we appreciate your support, your enthusiasm.\"And not just for watching. This year you literally pulled us out of a hole, and we cannot thank you enough, personally, professionally.\"The comic's abrupt suspension came after threats by the federal TV regulator, the Federal Communications Commission (FCC) to revoke ABC's broadcast licence. The body is chaired by President Trump appointee, Brendan Carr.The US President had welcomed Kimmel's suspension and suggested that some TV networks should have their licences \"taken away\".President Trump and his supporters praised the decision to take Kimmel's show off air, which came after pressure on ABC and its owner Disney from the White House and the president's supporters.Jimmy Kimmel's Alternative Christmas Message will air on Channel 4 at 17:45 GMT on Christmas Day, two hours after the King's Christmas Message on ITV and BBC One.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jimmy Kimmel criticises 'fascism' in Channel 4's Alternative Christmas Message",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/be30/live/9fa53a90-df32-11f0-b6a6-1bf5f87ee304.jpg"
      ],
      "datePublished": "2025-12-22T13:46:23.000Z",
      "dateModified": "2025-12-22T13:46:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New Trump envoy says he will serve to make Greenland part of US",
    "url": "https://www.bbc.com/news/articles/ckgmd132ge4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c234/live/86265f70-df43-11f0-b67b-690eb873de1b.jpg",
    "tag": "Trending",
    "date": "2025-12-22T15:49:12.000Z",
    "description": "28 minutes agoJames Landale,Diplomatic correspondentandRachel HaganDonald Trump has sparked a fresh row with Denmark after appointing a special envoy ",
    "body": "28 minutes agoJames Landale,Diplomatic correspondentandRachel HaganDonald Trump has sparked a fresh row with Denmark after appointing a special envoy to Greenland, the vast Arctic island he has said he would like to annex.Trump announced on Sunday that Jeff Landry, the Republican governor of Louisiana, would become the US's special envoy to Greenland, a semi-autonomous part of the Kingdom of Denmark.Gov Landry said in a post on X it was an honour to serve in a \"volunteer position to make Greenland a part of the US\".The move has angered Copenhagen, which said it would will call the US ambassador for \"an explanation\". Greenland's prime minister said the island must \"decide our own future\" and its \"territorial integrity must be respected\".Since returning to the White House in January, Trump has revived his long-standing interest in Greenland, citing its strategic location and mineral wealth. He has refused to rule out using force to secure control of the island, a stance that has shocked Denmark, a Nato ally that has traditionally enjoyed close relations with Washington.Greenland, home to about 57,000 people, has had extensive self-government since 1979, though defence and foreign policy remain in Danish hands. While most Greenlanders favour eventual independence from Denmark, opinion polls show overwhelming opposition to becoming part of the US.Denmark's Foreign Minister, Lars Lokke Rasmussen, described the appointment of Landry as \"deeply upsetting\" and warned Washington to respect Danish sovereignty.He told Danish broadcaster TV2: \"As long as we have a kingdom consisting of Denmark, the Faroe Islands and Greenland, we cannot accept actions that undermine our territorial integrity.\"Greenland's Prime Minister, Jens-Frederik Nielsen, said the territory was willing to cooperate with the US and other countries, but only on the basis of mutual respect.He said: \"The appointment of a special envoy does not change anything for us. We decide our own future. Greenland belongs to Greenlanders, and territorial integrity must be respected.\"Writing on social media, the US president said Landry understood how \"essential Greenland is to our national security\" and would advance US interests.The significance of this appointment is both the US presumption that Greenland is separate to Denmark and the new appointee's assertion that he will help the island become part of the US. Envoys are informal appointments and unlike official diplomats, do not have to be approved by the host country.What this appointment shows is that Trump's ambition to control Greenland remains undimmed. As with his military and rhetorical aggression towards Venezuela, it indicates Trump is determined to gain greater control over what his recent National Security Strategy called \"the Western hemisphere\", a sphere of influence that he hopes will cover the whole of the Americas.Landry has previously voiced his opinion on Greenland, writing on his personal X account in January: \"President Donald J. Trump is absolutely right! We need to ensure that Greenland joins the United States. GREAT for them, GREAT for us! Let's get it done!\"Landry is a military veteran and former police officer who was a US Congressman and Louisiana's attorney general before being elected governor in 2023.  He said his new role would not affect his duties as governor. The dispute over his appointment comes as strategic competition in the Arctic grows, with melting ice opening new shipping routes and increasing access to valuable mineral resources. Greenland's location between North America and Europe also makes it central to US and Nato security planning. The US has maintained a base in Greenland since World War Two, after invading to establish military and radio stations across the territory after the Nazis occupied Denmark during the conflict.Vice-President JD Vance visited the base in March as he asked Greenland's people to \"cut a deal with the US\".The US reopened a consulate in Nuuk, the capital of Greenland, in 2020 - during Trump's first term - after closing it in 1953. A number of European countries, as well as Canada, have honorary general consulates in Greenland.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New Trump envoy says he will serve to make Greenland part of US",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c234/live/86265f70-df43-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-22T15:49:12.000Z",
      "dateModified": "2025-12-22T15:49:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US lawmakers threaten Pam Bondi with contempt action over unreleased Epstein material",
    "url": "https://www.bbc.com/news/articles/cdd5j9jdvy9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8820/live/61a374f0-df2d-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2025-12-22T11:27:54.000Z",
    "description": "Watch: Images, cassettes and high-profile figures - What's in the latest Epstein files?A pair of US lawmakers have threatened legal action against US ",
    "body": "Watch: Images, cassettes and high-profile figures - What's in the latest Epstein files?A pair of US lawmakers have threatened legal action against US Attorney General Pam Bondi, after her deadline to release all government files related to the late convicted sex offender Jeffrey Epstein was met only in part. The release of the Department of Justice (DoJ) documents was highly anticipated but in the end, only a portion of the available material was made public.A leading campaigner on the issue, Republican congressman Thomas Massie, said he could try to bring contempt proceedings against the attorney general as a result.The DoJ insists it is complying with its legal obligations, and Bondi herself has said she is part of \"the most transparent administration in American history\".The phrase \"Epstein files\" refer to the trove of information that was amassed by the US justice department during its two criminal investigations into Epstein.A law that compelled the release of the full trove was signed by US President Donald Trump in November, after pressure from his supporters and members of his own Republican Party. Friday was the deadline for the release of the material. Although some material was released, there were many redactions and other information was withheld - which angered Massie and his allies, as well as survivors of Epstein's abuse. Trump himself is yet to comment.The DoJ has said that more material will follow in the coming weeks. But speaking to CBS programme Face the Nation on Sunday, Massie suggested that the justice department was \"flouting the spirit and the letter of the law\".He went on to say: \"The quickest way, and I think most expeditious way, to get justice for these victims is to bring inherent contempt against Pam Bondi, and that doesn't require going through the courts.\"Inherent contempt is a little-used legal recourse that can be used by either the Senate or House - the upper and lower chambers of Congress respectively - which has not been invoked for nearly a century, according to the American Bar Association.Massie added that \"Ro Khanna and I are talking about and drafting that right now\", referring to a Democratic congressman who has also been prominent in the campaign for the release of the full Epstein files.Speaking to the same programme, Khanna gave further detail on how the contempt proceedings could work. \"We're building a bipartisan coalition, and it would fine Pam Bondi for every day that she's not releasing these documents,\" he said.Unlike an impeachment effort - another option that would be theoretically available to critics of Bondi - the contempt move would only require support from the House of Representatives, Massie pointed out. Bondi's deputy Todd Blanche was defiant during an interview with another broadcaster on Sunday.Asked by the Meet the Press programme on NBC News whether he took threats from Congress members seriously, the deputy attorney general said: \"Not even a little bit. Bring it on. We are doing everything we're supposed to be doing to comply with the statute.\"Blanche pointed to the magnitude of the task. \"You're talking about a million or so pages of documents,\" he said. \"Virtually all of them contain victim information.\" He continued: \"And if by complying with the statute we don't produce everything on Friday, we produce things next week and the week after, that's still compliance with the statute.\"Speaking to the same programme, another member of Khanna's party, Democratic Senator Tim Kaine, said contempt or impeachment efforts would be \"premature\".\"We have tools in appropriations bills and other tools to force compliance if somebody is dragging their feet and I'd rather focus on those tools,\" Kaine said.Blanche said elsewhere on Sunday that certain Epstein-related files that were originally released on Friday were later removed by the DoJ from its website because of concerns raised by victims.One of those files - an image featuring Trump - was later reinstated after review, said Blanche.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US lawmakers threaten Pam Bondi with contempt action over unreleased Epstein material",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8820/live/61a374f0-df2d-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-22T11:27:54.000Z",
      "dateModified": "2025-12-22T11:27:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Warmer seas bring record number of octopuses to UK waters",
    "url": "https://www.bbc.com/news/articles/c709gz3k9k9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c1b8/live/f1505290-df31-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2025-12-22T12:49:25.000Z",
    "description": "'Year of octopus' declared after warmer seas leads to record UK numbers3 hours agoJonah FisherEnvironment correspondentWatch: Octopuses filmed by dive",
    "body": "'Year of octopus' declared after warmer seas leads to record UK numbers3 hours agoJonah FisherEnvironment correspondentWatch: Octopuses filmed by divers off the coast of Cornwall this yearA wildlife charity has declared 2025 \"the Year of the Blooming Octopus\" after record numbers were spotted off the south-west coast of England.In its annual marine review the Wildlife Trusts says octopus numbers were this summer at their highest level since 1950.Warmer winters, which are linked to climate change, are thought to be responsible for the population spike, which is known as a \"bloom\".The charity's findings are backed up by official figures which show that more than 1,200 tonnes of octopus was caught by fishermen in UK waters in the summer of 2025. The Wildlife Trusts/Kirsty AndrewsThe Wildlife Trusts says the highest number of octopuses has been seen off the south coast of Devon and Cornwall since 1950. It's a dramatic increase on previous years. Only once since 2021 has more than 200 tonnes of octopus been landed.Experts say most of those spotted are Octopus vulgaris a species commonly seen in the warmer Mediterranean Sea. Wildlife Trusts volunteers in Cornwall and Devon reported an increase in sightings of more than 1,500 percent on 2023 figures along one stretch of the south coast. \"It really has been exceptional,\" says Matt Slater from the Cornwall Wildlife Trust. \"We've seen octopuses jet-propelling themselves along. We've seen octopuses camouflaging themselves, they look just like seaweeds. \"We've seen them cleaning themselves. And we've even seen them walking, using two legs just to nonchalantly cruise away from the diver underwater.\"It's unclear at this point whether the rise in numbers is permanent or cyclical,  which would mean octopus numbers returning to more typical levels after this year's bloom. The eight-armed cephalopods eat shellfish such as lobster, crabs and scallops so the Wildlife Trusts warn that if population numbers remain high, both fishing and eating habits may have to change.\"They are having an impact on those (shellfish) species around our shores. And as a consequence, they will be having an impact on our fishing industry who target those species as well,\" Ruth Williams the head of marine for The Wildlife Trusts told the BBC's Today programmme. \"But there are opportunities and our fishing industry are doing some research into that at the moment to try and evolve with the changing fisheries that we're seeing as a result of climate change.\"Government data shows crab landings down on previous years but catches of lobster, crawfish and scallops stable.Wildlife Trusts of South and West Wales/Lynne NewtonA record number of puffins were recorded on Skomer Island in Pembrokeshire this year. Alongside good news for octopus lovers, the Wildlife Trusts' marine review contains more sobering news.The Trusts say this year was bookended by environmental disasters, with a collision between an oil tanker and a container ship in the North Sea in March spilling huge quantities of plastic resin pellets, and nearly 4.5 tonnes of bio-beads released from a water treatment plant in Sussex in November.There was some better news for wildlife elsewhere, with a record 46,000 puffins recorded on Skomer, Pembrokeshire, while the charismatic black and white bird has made a comeback on the Isle of Muck following conservation efforts by Ulster Wildlife Trust to remove invasive brown rats.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Warmer seas bring record number of octopuses to UK waters",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c1b8/live/f1505290-df31-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-22T12:49:25.000Z",
      "dateModified": "2025-12-22T12:49:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hundreds attend Stone Roses' Mani's star-studded Manchester funeral",
    "url": "https://www.bbc.com/news/articles/cr5zj532002o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/06ea/live/a592b950-df41-11f0-a8dc-93c15fe68710.jpg",
    "tag": "Trending",
    "date": "2025-12-22T13:39:45.000Z",
    "description": "3 hours agoPaul GlynnCulture reporterGetty ImagesFamily, friends and fans of Gary \"Mani\" Mounfield have turned out in force in Manchester to bid farew",
    "body": "3 hours agoPaul GlynnCulture reporterGetty ImagesFamily, friends and fans of Gary \"Mani\" Mounfield have turned out in force in Manchester to bid farewell to the much-loved bass player of The Stone Roses and Primal Scream.Some of the biggest names of British 80s and 90s music, including his former bandmates Ian Brown and Bobby Gillespie, as well as Oasis frontman Liam Gallagher, were all in attendance for the service at Manchester Cathedral.Former Manchester United footballers Sir David Beckham and Gary Neville also attended. Fans lined the streets as the funeral cortege went from the star's home in Heaton Moor in Stockport to Manchester city centre.PAMani's former Stone Roses bandmates John Squire and Alan \"Reni\" Wren carried his coffin out of the cathedral with the help of Liam Gallagher and Primal Scream's Bobby GillespieReutersIan Brown and Primal Scream guitarist Andrew Innes with Wren'Beautiful soul and spirit'The Stone Roses singer Brown led the tributes with a eulogy, saying his bandmate was like \"a brother to me\" and a \"beautiful human being\".Pausing briefly as he went into church, Brown said he was there to celebrate \"what a beautiful human being that he was\".Asked what Mounfield meant to him, the singer said: \"Everything. He's a brother to me, a musical comrade... a beautiful soul and spirit.\"He added that the bass player \"was able to laugh his way through any darkness\" and was \"the life and soul of any room he was in\".Brown, whose speech was played to the gathered masses outside - many of whom wearing bucket hats and Stone Roses T-shirts - was applauded after suggesting he should start a campaign for a lasting statue for his old bandmate. \"A fifty foot gold statue of Mani in the city,\" he said.'R kid'Hundreds of fans gathered outside the cathedral and applauded as the cortege arrived, preceded by a guard of scooter riders as The Stone Roses track I Wanna Be Adored played on speakers.Mounfield's coffin - decorated with the classic paint splashed artwork from band's first album - was carried into the cathedral as family and friends followed, with more applause from the crowd.A Manchester United scarf also adorned his coffin, which was next to a wreath bearing the affectionate Mancunian term: \"R kid\".PAPADavid Beckham bids farewell to one of his musical heroesPAThe cortege arrived preceded by a guard of scooter riders, a nod to Mani's love of Mod cultureMounfield's bass playing was an integral part of The Stone Roses' \"baggy\" sound - as heard on tracks like Fools Gold. He joined another seminal group, Primal Scream, in 1996 and played with them for 15 years, before rejoining his old band for a series of reunion gigs.Primal Scream frontman Gillespie followed Brown in giving his eulogy.He recalled having first met Mani at the legendary Hacienda nightclub in Manchester.\"He made me feel a million dollars,\" noted Gillespie. \"He was like that with everyone.\"He added: \"His enthusiasm and positivity was contagious.\"Other Manchester musicians at the service included Paul \"Bonehead\" Arthurs from Oasis, Mike Joyce from The Smiths and Peter Hook of New Order, who played in a band called Freebass with Mani and the late Andy Rourke. Bez from the Happy Mondays was also in attendance at the funeral, which was a veritable Who's Who of legendary music figures from the city.Speaking to BBC Radio Manchester, music journalist John Robb described Mani as being \"very much the heart and soul of Manchester\".\"He was something that's very typically Mancunian, very typically northern as well, you know, beyond the borders of Manchester,\" he said.\"The overarching trend is how many people say what a brilliant bloke he was to bump into.\"Getty Images'Mani' (second left)  with the rest of The  Stone Roses in 1992With Mani on bass, Brown on vocals, John Squire on guitar and Alan \"Reni\" Wren on drums, The Stone Roses were at the forefront of the \"Madchester\" indie scene of the late 1980s and early 90s, which peaked with a famous gig at Spike Island in Widnes.They released their beloved eponymous debut album in 1989.The LP featured such classic songs as I Wanna Be Adored, She Bangs The Drums and I Am The Resurrection, all underpinned by the grooves of Mani's basslines.It was named the greatest British album of all time by the Observer in 2004 and by the NME two years later.Its harder-rocking follow-up Second Coming came out in 1994. Both albums reached the top five in the UK.After the group disbanded in 1996, Mani joined Scottish rock band Primal Scream, first playing on their album Vanishing Point, released a year later, where his bass playing was a key part of krautrock-influenced lead single Kowalski.Mounfield would go on to record four more albums with Primal Scream before leaving in 2011 to reform The Stone Roses.The band released two further singles in 2016, but no full-length album followed and the group disbanded once more in 2017 after some old tensions resurfaced.The Stone Roses played a number of UK gigs over 2016 and 2017 before their split, including a concert at Glasgow's Hampden Park, which would end up being the classic line-up's final concert.Brown told the crowd: \"Don't be sad that it's over, be happy that it happened.\"'Beautiful person'Mani tributes: 'He was just a sound guy'Mounfield died last month - aged 63 - peacefully in his sleep of \"respiratory issues\" linked to the long-standing lung condition, emphysema, coroners confirmed to the Manchester Evening News. His wife Imelda died in November 2023, three years after she was diagnosed with bowel cancer. The couple have twin boys, who were born in 2013.Only last month, the bassist attended the funeral of another Manchester icon, Ricky Hatton, at the same cathedral.His death came after he announced an in-conversation tour of UK venues, which would have seen him recount his experiences and memories in The Stone Roses and Primal Scream from September next year.Squire last week shared a new piece of artwork in honour of his friend; while another band associated with the city, Doves, paid their own tribute during a weekend gig at Manchester Apollo, calling Mani a \"beautiful person\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hundreds attend Stone Roses' Mani's star-studded Manchester funeral",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/06ea/live/a592b950-df41-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-22T13:39:45.000Z",
      "dateModified": "2025-12-22T13:39:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Aerial footage shows scale of damage from Shropshire 'sinkhole'",
    "url": "https://www.bbc.com/news/videos/c62n9694lgxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9486/live/9eadb1d0-df4b-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "Trending",
    "date": "2025-12-22T14:56:36.000Z",
    "description": "A major incident has been declared at a Shropshire canal where a giant hole has emerged.  Aerial footage appears to show that the structural integrity",
    "body": "A major incident has been declared at a Shropshire canal where a giant hole has emerged.  Aerial footage appears to show that the structural integrity of a stretch of waterway in Whitchurch has given way, raising flooding fears.Boats were left either stricken in the cavity or left teetering on the edge of the drop.Fifty firefighters were deployed to the scene. There are no reports of casualties, according to police.The Canal and River Trust has blamed the issue on what it described as an \"embankment failure\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Aerial footage shows scale of damage from Shropshire 'sinkhole'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9486/live/9eadb1d0-df4b-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-22T14:56:36.000Z",
      "dateModified": "2025-12-22T14:56:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Two Banksy artworks appear at Centre Point tower and Bayswater ",
    "url": "https://www.bbc.com/news/articles/c62d16q93x4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f6b4/live/56067af0-df48-11f0-bc84-7b55a945c58f.jpg",
    "tag": "Trending",
    "date": "2025-12-22T15:44:07.000Z",
    "description": "Two identical Banksy murals appear in London 33 minutes agoNicky Ford,Tottenham Court Road, London,Aurelia FosterandJess Warren,LondonBanksyBanksy's l",
    "body": "Two identical Banksy murals appear in London 33 minutes agoNicky Ford,Tottenham Court Road, London,Aurelia FosterandJess Warren,LondonBanksyBanksy's latest mural was first spotted on Queen's Mews, Bayswater, on MondayElusive street artist Banksy has confirmed he is behind a new mural that has appeared in Bayswater, west London.The image depicts two children lying on the ground dressed in wellington boots, coats and winter bobble hats, one of them pointing upwards towards the sky.It has been painted on to a wall above a row of garages on Queen's Mews and was first spotted on Monday. The BBC understands Banksy is also responsible for an identical mural that appeared outside the Centre Point tower in central London on Friday, although his representatives have only confirmed the Bayswater work as his.The artist, whose identity is not publicly known, announced his new work by posting an image to his Instagram account on Monday afternoon.PA MediaPeople have been posing for photographs next to the Bayswater artworkThis mural outside the Centre Point building appears to be identical to the west London artworkSpeaking about the Centre Point mural, artist Daniel Lloyd-Morgan told the BBC  said he believed the location was chosen to make a point about child homelessness. \"Everybody is having a good time but there are a lot of children who are not having a good time at Christmas,\" he said.Mr Lloyd-Morgan said that people walking past the artwork were \"ignoring it\", adding: \"It's a busy area. Quite poignant that people aren't stopping. They walk past homeless people and they don't see them lying on the street.\"\"It's kind of like they're stargazing,\" he said. \"It's quite fitting that the kids are pointing up like they're looking at the North Star.\"Banksy enthusiast Jason Tomkins, said he also believed it was a \"clear statement on homelessness\".The Centre Point tower, at 101-103 New Oxford Street, has been a historic focal point for housing protests. Originally built as an office block in 1963, the Centre Point tower next to Tottenham Court Road underground station, remained unoccupied for over a decade, angering social justice campaigners.The homelessness charity Centrepoint was named as a response to the building by founder Rev Ken Leech, who described the tower as \"an affront to the homeless\". The block has since been converted into multimillion-pound luxury flats.Banksy has not commented on the relevance of the location for either of the new works.BanksyBanksy's \"Season's greetings\" appeared in Port Talbot  in 2018Mr Tomkins said he believed the artwork depicted the same character as one of Banksy's previous works.\"In 2018 he painted in Port Talbot, and the little boy is identical to child that has been painted here,\" he said.\"This is quite unusual for him to use the same little boy again, because he has never done that.\"PA MediaArtwork appeared on a wall by the Royal Courts of Justice building in September showing a protester holding a blank blood-spattered signThe Centre Point piece follows Banksy's September mural in London, which showed a protester lying on the ground holding a blood-spattered placard while a judge, in a wig and gown, loomed over him, wielding a gavel. It was scrubbed off the Queen's Building, in the Royal Courts of Justice complex days after it appeared.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two Banksy artworks appear at Centre Point tower and Bayswater ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f6b4/live/56067af0-df48-11f0-bc84-7b55a945c58f.jpg"
      ],
      "datePublished": "2025-12-22T15:44:07.000Z",
      "dateModified": "2025-12-22T15:44:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]