[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Banned in the 80s: Moments That Shook Music",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002k85n?at_mid=XZLfF6kcDM&at_campaign=Banned_in_the_80s_Moments_That_Shook_Music&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002k85n&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Banned_in_the_80s_Moments_That_Shook_Music&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0m3w047.jpg",
    "tag": "Trending",
    "date": "2025-09-27T21:22:31.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistBanned in the 80s: Moments That Shook MusicContains very strong language.Contains discriminatory languageDocumentary revealing the untold stories behind the most controversial music of the 1980s, featuring Frankie Goes to Hollywood, Queen, George Michael, N.W.A, Madonna and others. Duration55 minsFirst shown27 Sep 2025Available for 11 monthsWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesWhen Bruce Springsteen Came to BritainBorn in the USA, made in the UK. The Boss explains why Britain is so special to him59 minsSimple Minds: Everything Is PossibleDaring to dream. The inspirational story of Scotland's biggest band1h 27mSimon & Garfunkel: The Harmony GameInspiration – and separation. The stormy relationship that created beautiful music1h 11mWham!: Last Christmas Unwrapped40 years a festive favourite. Andrew, Pepsi and Shirlie revisit Wham!’s winter wonderland59 minsWhen Tina Turner Came to BritainLet’s stay together. From 60s starlet to 80s comeback queen, a career built in Britain59 minsDionne Warwick: Don't Make Me OverWhat the world needs now... How a sublime voice found a second life as a call for change1h 32mBryan Ferry and Roxy Music: A Musical HistoryDocumentary exploring the music of rock band Roxy Music and its frontman Bryan Ferry.58 minsCarole King and James Taylor: Just Call Out My NameLong ago and far away. Two sensational solo artists created the perfect partnership1h 33mLive Aid at 40: When Rock ’n’ Roll Took on the WorldNot just for one day. The creation and legacy of a concert that changed everythingSharon & Ozzy Osbourne: Coming HomeRock legend Ozzy's final chapter as Birmingham’s favourite son - and family - return home59 minsMr Blue Sky: The Story of Jeff Lynne and ELOThe pioneer of progressive pop – from the Brum beat scene to huge hits all over the world57 minsSince Yesterday: The Untold Story of Scotland's Girl BandsPopstars, punks and pioneers. Defiant trailblazers who rocked a mostly male music world1h 30m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Banned in the 80s: Moments That Shook Music",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0m3w047.jpg"
      ],
      "datePublished": "2025-09-27T21:22:31.000Z",
      "dateModified": "2025-09-27T21:22:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Israel-Gaza: Why Is Hamas Recalling Fighters? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0m83h8w?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-10-11T18:17:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·11 Oct 2025,·27 minsIsrael-Gaza: Why Is Hamas Recalling Fighters?NewscastAvailable for over a yearToday, we look at the progress of the Trump peace plan for Israel and Gaza as Hamas recalls 7,000 fighters to reassert control over Gaza amid fears of renewed internal violence.\nThe Hamas mobilisation had been widely anticipated amid growing uncertainty about who will govern Gaza once the war ends.\nThe ceasefire appears to have held but Israeli hostages and Palestinian prisoners are yet to be released. \nLaura and Paddy speak with international editor Jeremy Bowen about the latest.\nPlus, Laura explains how the contest to become deputy leader of the Labour party could be seen as a verdict on Keir Starmer.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Laura Kuenssberg and Paddy O’Connell. It was made by Chris Flynn and Adam Chowdhury. The social producer was Joe Wilkinson. The technical producer was Jack Graysmark. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Israel-Gaza: Why Is Hamas Recalling Fighters? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-10-11T18:17:00.000Z",
      "dateModified": "2025-10-11T18:17:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-10-13T03:11:18.000Z",
    "description": "Updated 4 hours agoBritain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this ",
    "body": "Updated 4 hours agoBritain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-10-13T03:11:18.000Z",
      "dateModified": "2025-10-13T03:11:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Big Cases - Murdered by his Grandparents",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002j88v?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0lz3f5r.png",
    "tag": "Trending",
    "date": "2025-10-03T15:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistThe Big Cases - Murdered by his GrandparentsContains some upsetting scenes.The tragic case of two-year-old Ethan, who was killed by his grandparents. A police investigation unraveled a horrific story of brutal abuse by those who should have cared for and nurtured him. Duration29 minsFirst shown3 Oct 2025Available for 11 monthsWatchlistAudio DescribedSign LanguageEpisodesEpisodes EpisodesThis episodeMurdered by his GrandparentsThe Sycamore Gap - From Roots to RuinAn ancient tree, symbolising a community, is chopped down overnight. Who did it and why?26 minsThe Aristocrat, the Convict and the Missing BabyAn aristocrat and her convict partner go on the run with their newborn, ending in tragedy.29 minsThe Predator Who Fled to ParadiseThe shocking tale of a predator who fled to paradise for almost three decades.25 minsThe Bus Stop MurderThe tragic story of a schoolgirl who was stabbed to death in a row about a teddy bear.27 minsNeighbour, Friend, KillerWendy Buckney knew about her neighbour's past but wanted to give him a second chance.21 minsThe Mistaken Identity Murders The shocking story of two innocent teenagers murdered in a case of mistaken identity.30 minsMy Husband the MonsterThe shocking story of Gisele Pelicot, raped by strangers her husband invited to abuse her.29 minsTortured Behind Closed DoorsThe tragic story of Sara Sharif who was brutally killed by her father and stepmother.35 minsStabbed After SchoolThe shocking story of how a teenage relationship ended in murder. 28 minsThe Abuser HeadteacherThe story of a respected head who abused his power and became a convicted sex offender.29 minsCrushed: The Six Year NightmareSix years after surviving a horror smash, Monika died. It was time for justice, again.21 minsThe House Party MurderHow a house party turned into a murder scene - the fatal stabbing of Mikey Roynon.28 minsKiller In The AtticWhen a man is stabbed to death outside a nightclub, armed police search for his killer.25 minsThe Dance Floor MurderThe story of footballer Cody Fisher who was stabbed to death in a nightclub in Birmingham.26 minsThe Executioner Next DoorThe true story of the Army’s killer agent inside the IRA.\n25 minsThe Nottingham AttacksIn the summer of 2023, the lives of three families changed forever.29 minsHeld Captive And Left To DieShakira Spencer was tortured and starved by people she considered friends.23 minsKilled In The ParkBrianna Ghey was stabbed to death - two teenagers tried to get away with murder.26 minsThe Student Who Never Came HomeKidnapped and murdered while on a gap year in France. Is it finally time for justice?25 minsThe Doping WardThe hospital unit where patients were drugged to keep them 'quiet and compliant'.26 minsKilled By My BoyfriendThe story of a young mum killed by her boyfriend of eight weeks.22 minsThe Commons CriminalThe MP who rose from obscurity to being imprisoned for fraud. The story of Jared O'Mara.23 minsThe Missing MumLinda Razzell was murdered by her husband in 2002 - will he now reveal where her body is?22 minsDeadly InfluenceThe story of a social media influencer, her mum and a murder plot.26 minsUnmasking a FugitiveThe story of Nicholas Rossi, the US fugitive who came to the UK with a new identity.30 minsKilled on DutyThe story of how a handcuffed prisoner shot dead Sgt Matt Ratana in 2020.21 minsThe Killing in the LaneLilia Valutyte died from a single stab wound in her chest. Who killed the nine-year-old?17 minsKilled on Christmas EveElle Edwards was shot dead as she celebrated at Christmas in a murder that shocked the UK32 minsThe Sunshine ScammerThe bogus travel agent who conned hundreds of holidaymakers and her own family.28 mins30 Years For JusticeNikki Allan's murder shocked Sunderland. Why did it take so long to catch her killer?26 minsCaught In The CrossfireNine year old Olivia Pratt-Korbel was killed when shots were fired into her family home.28 minsThe Lie That Destroyed a TownThe story of false accusations about being the victim of a grooming gang.30 minsHomegrown TerroristCould the Manchester Arena bombing have been stopped?24 minsTwenty Minutes Of TerrorA gunman kills five people within minutes. Could the shootings have been prevented?20 minsFound Under the FloorThe story of Bennylyn and Jellica who were murdered after starting a new life in the UK.23 minsPagination controlsPrevious1Page 1 of 22Page 2 of 2Next",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Big Cases - Murdered by his Grandparents",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0lz3f5r.png"
      ],
      "datePublished": "2025-10-03T15:00:00.000Z",
      "dateModified": "2025-10-03T15:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Government shutdown: 'Painful' job cuts to come if impasse drags on, warns Vance",
    "url": "https://www.bbc.com/news/articles/cp3d554053lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d2db/live/92ba0ab0-a79f-11f0-8e16-57fbf5e657fe.jpg",
    "tag": "Trending",
    "date": "2025-10-12T22:15:32.000Z",
    "description": "US Vice-President JD Vance has warned of further workforce cuts in addition to the thousands of jobs already axed if the government shutdown is not re",
    "body": "US Vice-President JD Vance has warned of further workforce cuts in addition to the thousands of jobs already axed if the government shutdown is not resolved.\"The longer this goes on, the deeper the cuts are going to be,\" Vance told Fox News. \"To be clear, some of these cuts are going to be painful.\"Democrats said Republicans were punishing people by refusing to attach health insurance subsidies to the spending bill.Hundreds of thousands of federal employees are already on leave without pay as the shutdown approaches its third week. No congressional vote is scheduled that could reopen the government.  The standoff began on 1 October after Democrats rejected a short-term funding bill. They want the budget to include an extension of federal subsidies for health insurance under the Affordable Care Act.The Trump administration announced on Friday that seven agencies, including the CDC, had started firing over 4,000 staff.But some of those CDC layoff notices were sent in error, a spokesman for the US health department, which oversees the CDC, told the BBC.Those CDC employees \"have all been notified that they are not subject to the reduction in force\", Andrew Nixon said.Out of about 1,300 CDC workers who were fired on Friday, around 700 were reinstated on Saturday, the employees' union told CNN.Essential workers like federal law enforcement officers and air traffic controllers are required to continue working without pay. But the Trump administration is making an exception for some essential workers: US service members.Trump directed Secretary of War Pete Hegseth to find available funds to get troops their wages this week - and Hegseth delivered.The Department of Defence is taking about $8bn (£6bn) from \"unobligated research development testing and evaluation funds\" to pay military personnel on 15 October if the funding lapse is not resolved, a Pentagon official told the BBC.Senator Mark Kelly, an Arizona Democrat, stood by the Democratic line on Sunday, saying on NBC's Meet the Press that he won't back down from his party's demand to reinstate federal healthcare subsidies in the budget now, not later. And as for the layoffs, Kelly said Republicans \"don't have to do this, they don't have to punish people\".Republican Senator Lindsey Graham of South Carolina told NBC's Meet the Press that he will not vote to extend the subsidies. Vance blamed the Democrats when speaking to Fox, saying: \"This is not a situation we relish, [these layoffs] are not something we're looking forward to, but the Democrats have dealt us a pretty difficult set of cards.\"As lawmakers continue battling over the budget, more government services are feeling the effect of the shutdown. Several Smithsonian museums, research centres and the National Zoo in Washington DC closed on Sunday after funding to keep them open ran out. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Government shutdown: 'Painful' job cuts to come if impasse drags on, warns Vance",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d2db/live/92ba0ab0-a79f-11f0-8e16-57fbf5e657fe.jpg"
      ],
      "datePublished": "2025-10-12T22:15:32.000Z",
      "dateModified": "2025-10-12T22:15:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shooting at crowded South Carolina bar leaves four dead",
    "url": "https://www.bbc.com/news/articles/c87y79y8g4qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/69b5/live/0dc88030-a7ad-11f0-8424-3d1859d87bbf.jpg",
    "tag": "Trending",
    "date": "2025-10-12T21:52:47.000Z",
    "description": "A mass shooting at a crowded bar in the southern US state of South Carolina has left four people dead and at least 20 injured, officials said. Hundred",
    "body": "A mass shooting at a crowded bar in the southern US state of South Carolina has left four people dead and at least 20 injured, officials said. Hundreds of people were gathered at the popular bar on St Helena Island in the early hours of Sunday morning when gunfire broke out, leading multiple victims and witnesses to run to nearby businesses for shelter, according to the Beaufort County Sheriff's office. Four people were declared dead at the bar and at least 20 were injured, including four who were sent to local hospitals in critical condition, the sheriff's office said. The incident is still under investigation, and the sheriff's office is looking into possible suspects, it said. When police and first responders arrived, they found several people suffering from gunshot wounds, the sheriff's office said in a statement. It's not clear if the shooting was random or targeted, and a spokesperson for the sheriff's office declined to share more details. Robert Adams, who lives up the street from the bar, told the Island Packet, a local outlet, that he heard automatic gunfire that sounded \"like a machine gun\". A cook who works at the bar told the outlet he \"heard a lot of shots\" fired. The bar where the shooting took place, Willie's Bar and Grill, offers Gullah-inspired cuisine and says on its website that it aims to spread the \"heartwarming spirit of the Gullah Geechee culture\". The Gullah Geechee people are descendants of Africans who were enslaved on plantations along the south-eastern US coast, including in South Carolina. Willie's did not immediately respond to a request for comment from the BBC. \"COMPLETELY HEARTBROKEN to learn about the devastating shooting in Beaufort County,\" South Carolina Republican Representative Nancy Mace wrote on X. \"Our prayers are with the victims, their families, and everyone impacted by this horrific act of violence.\"Congressman James Clyburn, a Democrat of South Carolina, wrote on X that he's \"devastated\" by the \"senseless tragedy\".In 2022, there was another shooting at the same location, then the Island Grill, that left two people with non-life-threatening gunshot wounds, according to the Island Packet. Earlier this month, two separate shootings at South Carolina State University, about 100 miles (160km) north of St Helena Island, left one person dead and another injured. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shooting at crowded South Carolina bar leaves four dead",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/69b5/live/0dc88030-a7ad-11f0-8424-3d1859d87bbf.jpg"
      ],
      "datePublished": "2025-10-12T21:52:47.000Z",
      "dateModified": "2025-10-12T21:52:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Murder arrest over deaths in Stafford of children aged 2 and 3",
    "url": "https://www.bbc.com/news/articles/c78n8y3mlxko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/84e5/live/eae1f310-a803-11f0-92db-77261a15b9d2.jpg",
    "tag": "Trending",
    "date": "2025-10-12T20:51:44.000Z",
    "description": "11 hours agoVanessa PearceWest Midlands andRebecca Woodin StaffordBBCForensic investigation officers were brought in after the deaths of the children,",
    "body": "11 hours agoVanessa PearceWest Midlands andRebecca Woodin StaffordBBCForensic investigation officers were brought in after the deaths of the children, who were found in Corporation StreetA girl and boy pronounced dead at a property in Stafford on Sunday morning were aged two and three, police have confirmed amid a murder investigation.The youngest, Meraj Ul Zahra, was discovered along with Abdul Momin Alfaateh at a home on Corporation Street at about 07:30 BST.Both were injured and unresponsive, Staffordshire Police said.A 43-year-old woman from the Stafford area, arrested on suspicion of murder, remained in custody, the force added.The children's next of kin have been informed and are being supported by specially trained officers. In a statement, the force said the incident had been referred to the Independent Office for Police Conduct (IOPC).An IOPC spokesperson said: \"We were notified by Staffordshire Police of the death of two children in Stafford on Sunday 12 October where there was recent police contact prior to their death.\"We understand a referral is being made by the force, which once received, we will assess before deciding whether further action may be required by us.\"PA MediaThe road was sealed off as investigators worked at the scene\"We are working hard to understand more about what happened leading up to these two children tragically losing their lives,\" said Det Insp Kirsty Oldfield.She added: \"We ask that people do not speculate at this stage as it is distressing for family and friends and could hinder our inquiries.\"Luke Browne, who lives on the street, said he had seen a forensic van and a police car parked there as he left for work on Sunday morning.\"It's very sad,\" he said, \"children dying is a horror. It's quite painful to hear [about] it.\"The 61-year-old book shop owner added: \"I've only lived there a year but everybody I've met has been lovely.\"Sebastian Grzesiak, who also lives nearby, said he too was shocked. \"It's a very quiet and friendly street,\" he said. Neighbour Sebastian Grzesiak said he had been shocked to learn of the deathsA cordon remains in place at the scene. \"We understand that this incident may cause concern in the local community,\" added Det Insp Oldfield.\"There is no threat to the wider public.\"Part of Corporation Street remains closed Officers were called to the home by West Midlands Ambulance Service which attended at 07:26 BST.\"Sadly, it quickly became apparent nothing could be done to save [the children] and they were confirmed dead at the scene,\" an ambulance service spokesperson said. Anyone with information that could help with the investigation is asked to contact Staffordshire Police. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Murder arrest over deaths in Stafford of children aged 2 and 3",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/84e5/live/eae1f310-a803-11f0-92db-77261a15b9d2.jpg"
      ],
      "datePublished": "2025-10-12T20:51:44.000Z",
      "dateModified": "2025-10-12T20:51:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man charged after allegedly stalking Ed Davey and family",
    "url": "https://www.bbc.com/news/articles/c77d702znm4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9188/live/c3b1dca0-a76e-11f0-93e3-054bcb63bc18.jpg",
    "tag": "Trending",
    "date": "2025-10-12T13:54:25.000Z",
    "description": "A man has been charged with stalking after allegedly targeting leader of the Liberal Democrats Sir Ed Davey and his family over a period of several mo",
    "body": "A man has been charged with stalking after allegedly targeting leader of the Liberal Democrats Sir Ed Davey and his family over a period of several months.Inigo Rowland, who is also charged with possession of a flick-knife, is accused of turning up at the Kingston and Surbiton MP's south-west London home \"unannounced\" and on \"numerous\" occasions between June and October, according to a court list.The 58-year-old from Surbiton appeared at Wimbledon Magistrates' Court on 7 October and was remanded into custody, the Met Police said.Sir Ed, 59, and his wife Emily have a 17-year-old son called John, who has a neurological condition and learning difficulties, and a daughter, Ellie.Sir Ed won the south-west London constituency of Kingston and Surbiton in 1997 and lost his seat in 2015. He regained it in 2017 and became party leader three years later.A Met Police spokesperson said Mr Rowland was arrested on 6 October in relation to offences alleged to have taken place between June and October.He is due to appear again at Wimbledon Magistrates' Court on Tuesday.A spokesperson for the Liberal Democrats said: \"We cannot provide any details at this time; Ed's number-one priority is the safety of his family.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man charged after allegedly stalking Ed Davey and family",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9188/live/c3b1dca0-a76e-11f0-93e3-054bcb63bc18.jpg"
      ],
      "datePublished": "2025-10-12T13:54:25.000Z",
      "dateModified": "2025-10-12T13:54:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says Ukraine may get Tomahawk missiles to use against Russia",
    "url": "https://www.bbc.com/news/articles/c93xpqgzkv0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/222d/live/597d8190-a7d7-11f0-928c-71dbb8619e94.jpg",
    "tag": "Trending",
    "date": "2025-10-13T03:40:00.000Z",
    "description": "US President Donald Trump is considering sending Tomahawk long-range cruise missiles to Ukraine, saying it would provide \"a new step of aggression\" in",
    "body": "US President Donald Trump is considering sending Tomahawk long-range cruise missiles to Ukraine, saying it would provide \"a new step of aggression\" in its war with Russia.When asked on Air Force One if he would send Tomahawks to Ukraine, Trump replied \"we'll see... I may\".It follows a second phone call at the weekend between Trump and Ukrainian President Volodymyr Zelensky, who pushed for stronger military capabilities to launch counter-attacks against Russia.Moscow has previously warned Washington against providing long-range missiles to Kyiv, saying it would cause a major escalation in the conflict and strain US-Russian relations.Tomahawk missiles have a range of 2,500 km (1,500 miles), which would put Moscow within reach for Ukraine.Trump spoke to reporters as he flew to Israel. He said he would possibly speak to Russia about the Tomahawks requested by Ukraine. \"I might tell them [Russia] that if the war is not settled, that we may very well, we may not, but we may do it.\"\"Do they [Russia] want Tomahawks going in their direction? I don't think so,\" the president said.Kyiv has made multiple requests for long-range missiles, as it weighs up striking Russian cities far from the front lines of the grinding conflict.In their phone calls Zelensky and Trump discussed Ukraine's bid to strengthen its military capabilities, including boosting its air defences and long-range arms. Ukrainian cities including Kyiv have come under repeated heavy Russian bombardment with drones and missiles. Russia has particularly targeted Ukraine's energy infrastructure, causing power cuts.Last month, Trump's special envoy to Ukraine Keith Kellogg suggested the US president had authorised strikes deep into Russian territory, telling Fox News \"there are no such things as sanctuaries\" from attacks in the Russia-Ukraine war.Russia, which launched its full-scale invasion of Ukraine in February 2022, downplayed the chances of Tomahawks changing the course of the war.Kremlin spokesperson Dmitry Peskov said last month: \"Whether it's Tomahawks or other missiles, they won't be able to change the dynamic.\"Follow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weekly US Politics Unspun newsletter. Readers in the UK can sign up here. Those outside the UK can sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says Ukraine may get Tomahawk missiles to use against Russia",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/222d/live/597d8190-a7d7-11f0-928c-71dbb8619e94.jpg"
      ],
      "datePublished": "2025-10-13T03:40:00.000Z",
      "dateModified": "2025-10-13T03:40:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lloyds warns car finance scandal could cost it £2bn",
    "url": "https://www.bbc.com/news/articles/cq6zr733917o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/faa0/live/374f7d90-a803-11f0-95f1-bf5aa59f64b9.jpg",
    "tag": "Trending",
    "date": "2025-10-13T08:03:30.000Z",
    "description": "Lloyds Banking Group is setting aside an additional £800m for car finance compensation claims, bringing the total amount allocated by the bank for red",
    "body": "Lloyds Banking Group is setting aside an additional £800m for car finance compensation claims, bringing the total amount allocated by the bank for redress to nearly £2bn.The company said that the number of eligible claims is expected to be higher than previously thought.Millions of drivers who bought cars on finance with hidden commission payments between 2007 and 2024 may be eligible for redress.The Financial Conduct Authority (FCA) published details of its proposed compensation scheme last week.The FCA said payouts could be due on around 14 million unfair deals, averaging at about £700 each.This could result in lenders paying out a total of £8.2bn in compensation.The payouts are over commission arrangements between lenders and dealers, unfair contracts, and inaccurate information given to car buyers.Lloyds said in a statement: \"Based on the FCA proposals in their current form, the potential impact is at the adverse end of the range of previous expected outcomes.\"It said it was setting aside an additional £800m for redress based on \"the increased likelihood of a higher number of historical cases... being eligible for redress\".It said its \"best estimate\" of the total cost of redress was £1.95bn.The proposed scheme would be free to access for consumers, although the interest they receive on redress will be much lower than that paid following the payment protection insurance (PPI) scandal.That scandal cost Lloyds £22bn.The FCA estimates that 44% of all motor finance agreements made since 2007 will be eligible for payouts.But a ruling at the Supreme Court in August limited the breadth of these cases.The FCA advises anyone who wants to make a complaint to get in touch with their lender or broker, and has this guidance on how to complain.But the Finance and Leasing Association, the body that represents the lending industry, has said the FCA is \"overcompensating\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lloyds warns car finance scandal could cost it £2bn",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/faa0/live/374f7d90-a803-11f0-95f1-bf5aa59f64b9.jpg"
      ],
      "datePublished": "2025-10-13T08:03:30.000Z",
      "dateModified": "2025-10-13T08:03:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chilworth mum warns against modified e-bikes after home destroyed",
    "url": "https://www.bbc.com/news/articles/cj3yk5xvjgmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bc0a/live/af3be870-a795-11f0-8c9e-87f67f3eb58c.jpg",
    "tag": "Trending",
    "date": "2025-10-13T05:00:15.000Z",
    "description": "Heartbreak after modified e-bike fire destroys home3 hours agoCash MurphySouth EastBBCEmma Wills moved in to the Chilworth property five months before",
    "body": "Heartbreak after modified e-bike fire destroys home3 hours agoCash MurphySouth EastBBCEmma Wills moved in to the Chilworth property five months before the fireA mother has warned about the perils of modified e-bikes after a fire left her family homeless and killed one of her kittens.Emma Wills, from Chilworth in Surrey, moved in to the property five months before a modified e-bike charging in her living room caught fire at the end of January.\"To go from a fresh start to losing everything so quickly has been devastating,\" she said.The e-bike, which belonged to a family friend, had recently been modified using a conversion kit bought online.According to new research from consumer safety charity Electrical Safety First, a total of 23% of UK push-bike owners surveyed were considering turning their push-bike into an e-bike.Conversion kits are cheaper to buy than a fully manufactured e-bike but come with huge risks, the charity has said.Electrical Safety FirstMrs Wills said the fire destroyed all the \"sentimental keepsakes\" that remind her of her late mother  Giuseppe Capanna, its product safety engineer, said: \"Kits made up of substandard components can cause devastating fires. \"At present, technology has outpaced regulation meaning there are no existing safety standards for conversion kits.\"Mrs Wills, who has three children, said: \"I lost my mum in 2021, so all the memories and sentimental keepsakes I had of her are gone. \"They can never be replaced, and that breaks my heart.\"Electrical Safety FirstMrs Wills said losing the family kitten was \"heartbreaking\" She added: \"It's had a huge impact on my two youngest children. They don't want to go out anymore. \"It doesn't just affect one part of your life, it affects everything.\"Mrs Wills said losing the kitten, which had been hand-reared by the family from four-weeks-old, was \"heartbreaking\".In 2024, the Office for Product Safety and Standards received 170 reports of e-bike fires, with 45% confirmed to be from converted e-bikes.The actual number is expected to be much higher as not all fire and rescue services notify OPSS of blazes involving consumer products.More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chilworth mum warns against modified e-bikes after home destroyed",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bc0a/live/af3be870-a795-11f0-8c9e-87f67f3eb58c.jpg"
      ],
      "datePublished": "2025-10-13T05:00:15.000Z",
      "dateModified": "2025-10-13T05:00:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gaza City clashes between Hamas and clan members leave 27 dead",
    "url": "https://www.bbc.com/news/articles/cg5e551j593o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0d7f/live/a78844b0-a7ff-11f0-b741-177e3e2c2fc7.jpg",
    "tag": "Trending",
    "date": "2025-10-12T18:32:42.000Z",
    "description": "14 hours agoRushdi AbualoufGaza correspondent in IstanbulAt least 27 people have been killed in fierce clashes between Hamas security forces and armed",
    "body": "14 hours agoRushdi AbualoufGaza correspondent in IstanbulAt least 27 people have been killed in fierce clashes between Hamas security forces and armed members of the Dughmush family in Gaza City, in one of the most violent internal confrontations since the end of major Israeli operations in the enclave.Masked Hamas gunmen exchanged fire with clan fighters near the city's Jordanian hospital, witnesses said.A senior official in the Hamas-run interior ministry said security units surrounded them and engaged in heavy fighting to detain them. The ministry said eight its members were killed in \"an armed assault by a militia\".Medical sources said 19 Dughmush clan members and eight Hamas fighters had been killed since fighting began on Saturday.Eyewitnesses said the clashes erupted in the Tel al-Hawa neighbourhood in southern Gaza City after a Hamas force of more than 300 fighters moved to storm a residential block where Dughmush gunmen were entrenched.Residents described scenes of panic as dozens of families fled their homes under heavy gunfire, many of them displaced multiple times during the war. \"This time people weren't fleeing Israeli attacks,\" one resident said. \"They were running from their own people.\"The Dughmush family, one of Gaza's most prominent clans, has long had a tense relationship with Hamas, and its armed members have clashed with the group on several occasions in the past.The Hamas-run interior ministry said its forces were seeking to restore order, warning that \"any armed activity outside the framework of the resistance\" would be dealt with firmly.Both sides traded accusations over who was responsible for triggering the clashes.Hamas earlier said Dughmush gunmen killed two of its fighters and wounded five others, prompting the group to launch an operation against them.However, a source from the Dughmush family told local media that Hamas forces had come to a building that once served as the Jordanian Hospital, where the family had taken refuge after their homes in the al-Sabra neighbourhood were destroyed in the recent Israeli attack.The source claimed that Hamas sought to evict the family from the building to establish a new base for its forces there.Hamas has recalled about 7,000 members of its security forces to reassert control over areas of Gaza recently vacated by Israeli troops, according to local sources.Reports suggest armed Hamas units have already deployed across several districts, some wearing civilian clothes and others in the blue uniforms of the Gaza police. The Hamas media office denied it was deploying \"fighters in the streets\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gaza City clashes between Hamas and clan members leave 27 dead",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0d7f/live/a78844b0-a7ff-11f0-b741-177e3e2c2fc7.jpg"
      ],
      "datePublished": "2025-10-12T18:32:42.000Z",
      "dateModified": "2025-10-12T18:32:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "London buses infested with cockroaches, drivers say",
    "url": "https://www.bbc.com/news/articles/cwynyq3vv34o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1c60/live/28e583e0-a7fd-11f0-92db-77261a15b9d2.jpg",
    "tag": "Trending",
    "date": "2025-10-13T05:01:20.000Z",
    "description": "3 hours agoTom EdwardsLondon transport and environment correspondentLondon Bus ForumsA cockroach under a London bus seatMany buses in London are infes",
    "body": "3 hours agoTom EdwardsLondon transport and environment correspondentLondon Bus ForumsA cockroach under a London bus seatMany buses in London are infested with cockroaches according to drivers, who want the issue resolved immediately.Drivers say a number of buses and their rest areas are infested with cockroaches and say the insects need eradicating.Images and video sent to BBC London show cockroaches on buses and in eating areas. In one video, filmed on 8 October, cockroaches can be seen in a driver's food container in the rest area.Bus safety campaigners have written to transport bosses highlighting the problem. Transport for London (TfL) says such instances are rare and it has launched an urgent investigation.London Bus ForumsA cockroach on a London bus Kevin Mustafa, a London bus safety campaigner, said: \"The current state is untenable for drivers who already face demanding working conditions. Swift, transparent and decisive action will go a long way toward restoring trust, ensuring safety, and maintaining public confidence in London's bus services.\"London bus drivers are reporting persistent issues with cockroaches and unsanitary conditions onboard their vehicles. This is not a matter of occasional nuisance — many drivers describe infestations, and the situation is starting to pose real health, safety and wellbeing risks.\"London Bus ForumsA cockroach on a piece of official TfL documentation Campaigners want a deep clean of all buses more frequently, and the use of insecticidal treatments, heat treatments, improved vacuuming and sealed barriers in known hotspots.Drivers also want pest-control measures put in place. The London Bus Forums group said: \"The cockroach reports are not isolated. They point to a wider failure to maintain safe and clean conditions for bus drivers.\"This is a public health issue affecting both staff and passengers. That's why drivers will be marching on 5 November to demand safer conditions and the adoption of the Bus Drivers Bill of Rights.\"London Bus ForumsImages sent to BBC London show examples of cockroaches on London busesAbout five million bus journeys are made every day in the capital. There are 675 bus routes served by over 8,700 buses, almost all of which are operated by private companies under contract to Transport for London.BBC London contactVideo sent to BBC London shows cockroaches moving in the bus footwellA TfL spokesperson said: \"We are committed to working together with operators to provide a clean environment for staff and customers. \"Most TfL welfare facilities are cleaned multiple times a day, and at a minimum daily, to maintain hygiene and safety standards. All buses are also cleaned every night before entering service and reports such as these are rare.\"We take any report seriously and are urgently investigating the specific incidents that have been raised.\"As with any reports, we will take appropriate action as part of the investigation, which can include taking buses out of service for inspection, deep cleans and treatment with specialist equipment if necessary.\"We would like to reassure staff that our operators would never take action against people raising concerns about welfare or safety and encourage any driver with concerns to contact their employer, their union, or contact us directly.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "London buses infested with cockroaches, drivers say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1c60/live/28e583e0-a7fd-11f0-92db-77261a15b9d2.jpg"
      ],
      "datePublished": "2025-10-13T05:01:20.000Z",
      "dateModified": "2025-10-13T05:01:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China accuses US of 'double standards' over tariff threat",
    "url": "https://www.bbc.com/news/articles/cn828kg8rmzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4ee2/live/d603cc70-a754-11f0-86ee-bde5491c9148.jpg",
    "tag": "Trending",
    "date": "2025-10-13T04:57:37.000Z",
    "description": "3 hours agoStephen McDonellChina correspondent andNick Edserbusiness reporterDonald Trump's latest threat to impose an additional 100% tariff on Chine",
    "body": "3 hours agoStephen McDonellChina correspondent andNick Edserbusiness reporterDonald Trump's latest threat to impose an additional 100% tariff on Chinese goods is \"a typical example of US double standards\", China's government has said.A commerce ministry spokesperson also said China could introduce its own unspecified \"countermeasures\" if the US president carries out his threat, adding it was \"not afraid\" of a possible trade war.On Friday, Trump hit back at Beijing's move to tighten its rules for rare earths exports, accusing it  of \"becoming very hostile\" and trying to hold the world \"captive\". He also threatened to pull out of a meeting with China's President Xi Jinping later this month.But on Sunday, Trump wrote: \"Don't worry about China, it will all be fine!\" \"Highly respected President Xi just had a bad moment. He doesn't want Depression for his country, and neither do I. The U.S.A. wants to help China, not hurt it!!!\" Trump said in a post on social media, without elaborating further. Trump's comments on Friday rattled financial markets, with the S&P 500 share index closing down 2.7%, its steepest fall since April.On Monday, the Shenzhen Component Index in mainland China was down by more than 2.5%, while Hong Kong's Hang Seng was around 3.5% lower.The president's words renewed fears of a trade war between the US and China.In May, the two sides had agreed to drop triple-digit tariffs on each others' goods. which had raised the prospect of trade halting between the two countries.This left US tariffs on Chinese goods facing an added 30% levy compared with the start of the year, while US goods entering China face a 10% tariff.China's response - released by the commerce ministry in the form of written responses to journalist's questions - echoed language from the height of the recent trade conflict.They criticised US export restrictions on chips and semi-conductors as well as defending China's own export controls on rare earths as \"normal actions\" to safeguard national security and that of all nations.The spokesperson said that for \"a long time\", the US had \"overstretched the concept of national security, abused export control measures\" and \"adopted discriminatory practices against China\".\"Resorting to tariff threats is not the right way to engage with China,\" the spokesperson said.\"China's position on a tariff war has always been consistent: we do not want one, but we are not afraid of one.\"Last week, China announced it was tightening export controls on rare earths and other materials critical for advanced tech manufacturing.This was seen as key move, as the country processes about 90% of the world's rare earths, which are used in goods such as solar panels and smartphones.The recent comments from Washington and Beijing are being seen by some as a means of strengthening positions ahead of future trade talks.It is unclear whether a meeting between Trump and Xi, expected at a summit in South Korea later this month, will still proceed.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China accuses US of 'double standards' over tariff threat",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4ee2/live/d603cc70-a754-11f0-86ee-bde5491c9148.jpg"
      ],
      "datePublished": "2025-10-13T04:57:37.000Z",
      "dateModified": "2025-10-13T04:57:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]