[
  {
    "title": "Newsnight - Prince Andrew & the Epstein Scandal: The Newsnight Interview",
    "url": "https://www.bbc.co.uk/iplayer/episode/m000c1j4/newsnight-prince-andrew-the-epstein-scandal-the-newsnight-interview?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p09rxk1n.jpg",
    "tag": "Trending",
    "date": "2025-10-17T18:00:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeNewsnightPrince Andrew & the Epstein Scandal: The Newsnight InterviewNewsnight - Prince Andrew & the Epstein Scandal: The Newsnight InterviewIn a Newsnight special, Emily Maitlis interviews the Duke of York as he speaks for the first time about his relationship with convicted paedophile Jeffrey Epstein. Duration58 minsFirst shown9pm 16 Nov 2019Available for over a yearWatchlistAudio DescribedSign LanguageEpisodesEpisodes EpisodesThe Duke of York Loses His TitlesPrince Andrew stays Prince Andrew but loses the rest of his royal honours.30 minsStarmer Condemns Israeli Football BanThe PM attacks plans to ban Israeli football fans from Villa Park over safety concerns.30 minsWhy hasn’t more been done to protect children?The head of the investigation into child sexual abuse in England and Wales speaks.32 minsGavin Williamson v Boris JohnsonBoris Johnson's decision to close schools in 2021 was 'panicked', says Gavin Williamson.30 minsWhat Next for Gaza?As an historic ceasefire comes into effect, what will happen next in Gaza?30 minsDonald Trump: Global Peacemaker or American Autocrat?The Gaza ceasefire agreement looks set to be completed. With Nick Watt.30 minsGaza peace within reach?A ceasefire in Gaza, with peace seemingly in reach after two years of conflict.30 minsDid Kemi Badenoch Charm Her Party?Has Kemi Badenoch done enough to see off the plotters for her crown?30 minsKemi: I'll Slash the DeficitKemi Badenoch will dangle the prospect of tax cuts in her big conference speech tomorrow.30 minsKemi Badenoch: are voters listening?The Tories have policies, but do they have anyone's attention?30 minsHome Secretary: Palestine Marches are 'Un-British'Should protests against the Palestine Action ban this weekend be called off?30 minsManchester Synagogue KillingsA man kills two people outside a Manchester synagogue on Yom Kippur.30 minsRacism and misogyny exposed in London's policeAn undercover BBC investigation reveals racism and misogyny by police officers.30 minsStarmer takes the fight to Farage: Will it work?Has Sir Keir Starmer silenced his critics by taking the fight to Reform, and what's next?30 mins29/09/2025Insights and global interviews on the crucial news stories of the day.30 minsLabour's Liverpool Revamp - Will It Work?Keir Starmer takes on Nigel Farage's Reform UK with ID cards. With Paddy O'Connell.30 mins'Strip the Duchess of York of her title' say Virginia Giuffre's family...Sarah Ferguson faces calls to be stripped of her title from Virginia Giuffre's family.30 minsZelensky's UN plea to stop PutinZelensky warns the United Nations that Putin must be stopped or their war will spread.30 minsTrump’s shift on UkraineTrump suddenly announces that he thinks Ukraine can win back all its land taken by Russia.30 minsTrump’s 'Dangerous' Autism ClaimPresident Trump urges pregnant women to stop taking paracetamol. With Victoria Derbyshire.30 minsKimmel Axed: Where is this heading?The left and the entertainment world react to the cancelling of Jimmy Kimmel.30 minsTrump Visit Turns PoliticalDay two of the President Trump's state visit and the ceremonial gives way to politics.31 minsThe Trump State VisitPresident Trump gets the red carpet treatment at Windsor Castle. With Victoria Derbyshire.30 minsTrump touches down in the UKAmid the pomp of Trump's visit, what will success look like for No.10 and the White House?30 minsEmbattled Starmer prepares to welcome the PresidentHow does the prime minister maintain his own special relationship with President Trump?30 minsStarmer's September bluesKeir Starmer's backbenchers ask whether he can survive to the next election.30 minsUS after the Charlie Kirk assassinationHow will America be affected by its most high-profile political murder in decades?30 minsCharlie Kirk shot deadCharlie Kirk is assassinated by a gunman in Utah. What does it mean for America?31 minsIsrael Strikes DohaWhere do the Israeli strikes on Doha leave the peace process? With Paddy O’Connell.30 minsThe Battle for the Labour Deputy LeadershipLabour MPs are jostling for votes as they prepare to crown a new deputy leader.30 minsRayner and a ReshuffleHow damaged is the prime minister's government after Angela Rayner's resignation?40 minsRayner on the brink?As we learn more about the deputy prime minister's stamp duty row, can she hang on?30 minsCan Rayner Survive?Angela Rayner is having to explain how she failed to pay £40,000 in stamp duty.30 minsGreen Party’s New Leader on NewsnightNew Green Party leader Zack Polanski talks to Victoria Derbyshire.30 minsWill the PM’s Reshuffle Work?The prime minister says his shake-up will allow him to drive through his priorities.30 minsEpping hotel ruling: a real win for the government?Victory for the government over housing refugees at the Bell Hotel.30 minsPagination controlsPrevious1Page 1 of 72Page 2 of 73Page 3 of 74Page 4 of 75Page 5 of 7...7Page 7 of 7Next",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newsnight - Prince Andrew & the Epstein Scandal: The Newsnight Interview",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p09rxk1n.jpg"
      ],
      "datePublished": "2025-10-17T18:00:00.000Z",
      "dateModified": "2025-10-17T18:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ukrainecast - Q&A: Tomahawk missiles, the drone race, and Ukrainian Halloween - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0m91pv4?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0kwvwyl.jpg",
    "tag": "Trending",
    "date": "2025-10-16T17:10:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·16 Oct 2025,·27 minsQ&A: Tomahawk missiles, the drone race, and Ukrainian HalloweenUkrainecastAvailable for over a yearAs Volodymyr Zelensky prepares to make his latest pitch to Donald Trump at the White House on Friday, the US is yet to announce a decision on the delivery of long range Tomahawk missiles to Ukraine. Could Washington have given the green light behind the scenes already? Are Ukrainian claims of frontline counteroffensives being exaggerated? And which side is coming out on top when it comes to drone technology?\nTo answer your questions, Lucy is joined by BBC Verify’s Olga Robinson and Mikey Kay from The Security Brief on the BBC news channel. The team also discuss Russian attacks on energy infrastructure, Nato military exercises and Halloween celebrations in Ukraine.\nToday’s episode is presented by Lucy Hockings.\nThe producers were Laurie Kalus and Julia Webster. The technical producer was Jonny Baker. The social producer was Joe Wilkinson. The series producer is Chris Flynn. The senior news editor is Sam Bonham.\nEmail Ukrainecast@bbc.co.uk with your questions and comments. You can also send us a message or voice note via WhatsApp, Signal or Telegram to +44 330 1239480\nYou can join the Ukrainecast discussion on Newscast’s Discord server here: tinyurl.com/ukrainecastdiscordProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ukrainecast - Q&A: Tomahawk missiles, the drone race, and Ukrainian Halloween - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0kwvwyl.jpg"
      ],
      "datePublished": "2025-10-16T17:10:00.000Z",
      "dateModified": "2025-10-16T17:10:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-10-17T04:59:32.000Z",
    "description": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and p",
    "body": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-10-17T04:59:32.000Z",
      "dateModified": "2025-10-17T04:59:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newspaper headlines: 'Andrew gives up titles' and 'Banned old Duke of York'",
    "url": "https://www.bbc.com/news/articles/cvgk7g3mlm3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1540/live/c74a2200-abb5-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-18T04:03:38.000Z",
    "description": "10 minutes agoMost papers lead with Prince Andrew giving up his titles, including the Duke of York. The Times writes that the decision marks a \"fall f",
    "body": "10 minutes agoMost papers lead with Prince Andrew giving up his titles, including the Duke of York. The Times writes that the decision marks a \"fall from grace\" over his links to the late convicted paedophile Jeffrey Epstein and alleged links to a Chinese spy.Prince Andrew will retain the title of a prince because, as the son of a monarch, it is his \"birthright\", the Daily Express reports. His former wife Sarah Ferguson will no longer be the Duchess of York. In his statement, Prince Andrew wrote that he had agreed to stop using his titles because he had \"always put my duty to my family and country first\", the Daily Telegraph reports. King Charles III is said to be \"glad\" about the outcome, the paper reports.\"Andrew falls on his sword\" is the headline for the Daily Mail, which reports that Prince Andrew's decision came after \"intense pressure\" from the King. The prince will also be stepping down from membership of the Order of the Garter, which the paper describes as the country's \"most ancient order of chivalry\".\"Banned old Duke of York\" is the Daily Star's take. The paper says reports suggest the decision comes after the King reached \"tipping point\" over Prince Andrew's involvement with Epstein.The Sun also splashes its front page with the same headline, reporting that the Prince of Wales was also involved in telling Prince Andrew to give up his titles.The i weekend says that while Prince Andrew and Sarah Ferguson will lose their titles, their daughters Princesses Beatrice and Eugenie are unaffected. The paper reports that despite the move, a private lease agreement with the Crown Estate means the prince can stay in residence at Royal Lodge in Windsor.The Financial Times leads with the latest meeting between US President Donald Trump and Ukrainian President Volodymyr Zelensky to discuss ending the Ukraine war. It marks the pair's third meeting this year and comes a day after Trump held a phone call with Russian President Vladimir Putin. The paper reports that Zelensky appealed to Trump to provide Ukraine with Tomahawk missiles, saying the US leader \"now has a big chance to finish this war\".Chancellor Rachel Reeves says she \"can't leave welfare untouched\" as the Treasury is considering axing up to £1bn in tax breaks for cars for disabled people, reports the Guardian. When asked about benefits, the paper quotes an interview Reeves gave to Channel 4 on Friday, saying, \"We have to do reform in the right way and take people with us\".Finally, the Daily Mirror teases an exclusive interview with former England footballer Paul Gascoigne on his struggle with alcohol addiction.Prince Andrew features on most of the front pages, after announcing he’ll give up his titles, including the Duke of York. \"Fall from grace\" says the Times. The Daily Mirror calls it a \"royal bombshell\". The i Weekend says Buckingham Palace has sent Prince Andrew into \"exile\", as it tries to end the \"distractions\" amid the continuing controversy about his links to the sex offender Jeffrey Epstein. \"Andrew falls on his sword\" says the Daily Mail, which reports that the prince's decision came after \"intense pressure\" from the King. Both the Sun and the Daily Star use the headline \"the banned old Duke of York\".The Daily Telegraph reports the King is said to be \"glad\" Prince Andrew has agreed to give up his titles. The Guardian says the agreement was made after high-level meetings at Buckingham Palace as aides were said to have finally reached a \"tipping point\". The papers also report that the prince used his announcement to say he \"vigorously\" denies the allegations against him.The Daily Express welcomes the news in its leader column saying \"common sense has prevailed\". The Daily Mail says it was a \"long time coming\" but the prince has \"finally done the right thing\". The Daily Mirror notes that it took pressure from the King to push him \"grudgingly into action\". The papers sums up by saying \"what a final and apt humiliation\".According to the Sun, the chancellor is looking at raising taxes on electric vehicle drivers. The paper says proposals are being drawn up as EV drivers do not pay fuel duty, but still contribute to congestion and wear and tear on the roads. The Treasury is said to be keen to ensure all drivers pay their \"fair share\", but no decisions have been made yet.And the Daily Telegraph reports that fishing is to be offered on the school curriculum for the first time. Students are going to be able to study a course called Angling and Countryside as an equivalent to GCSE, BTEC and A-Levels. The chief executive of the Angling Trust, Jamie Cook, tells the paper the qualification will offer a route into the natural world for young people.Related Internet Links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newspaper headlines: 'Andrew gives up titles' and 'Banned old Duke of York'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1540/live/c74a2200-abb5-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-18T04:03:38.000Z",
      "dateModified": "2025-10-18T04:03:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "George Santos: 'Have a great life!' Trump orders prison release of disgraced ex-congressman",
    "url": "https://www.bbc.com/news/articles/cy5q3439xpqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/93db/live/56e06400-abb2-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-17T23:04:31.000Z",
    "description": "US President Donald Trump has commuted the sentence of George Santos, a former Republican congressman serving seven years in prison for fraud and iden",
    "body": "US President Donald Trump has commuted the sentence of George Santos, a former Republican congressman serving seven years in prison for fraud and identify theft, ordering his immediate release. In a post on social media, Trump said Santos \"has been horribly mistreated\", adding: \"Therefore, I just signed a Commutation, releasing George Santos from prison, IMMEDIATELY. Good luck George, have a great life!\"The former lawmaker was only the sixth in US history to be expelled from Congress, after a damning ethics report in 2023. Santos, who admitted to stealing the identities of 11 people - including from his own family members, is currently serving his sentence at a minimum-security jail in New Jersey.In April when Santos was sentenced a judge told him: \"You got elected with your words, most of which were lies.\"He reportedly cried in court and begged for forgiveness, saying: \"I cannot rewrite the past, but I can control the road ahead.\"Prosecutors argued that the novice politician had lied about his background and misused campaign funds to finance his lifestyle.In his post, Trump justified the move by criticising a Democratic lawmaker, Senator Richard Blumenthal, whom he accused of fabricating his US military service. \"This is far worse than what George Santos did, and at least Santos had the Courage, Conviction, and Intelligence to ALWAYS VOTE REPUBLICAN!\" Trump wrote.Trump has previously called for an investigation into Blumenthal over the claim. The Democrat has acknowledged that he misspoke on numerous occasions about his time in the military, but has said the mishaps were more than a decade old. \"This allegation of 15 years ago has been really rejected by the voters of Connecticut three times, overwhelmingly reelecting me,\" Blumenthal told CNN earlier this month. A lawyer for Santos told the Associated Press that it remains unclear when his client would be released.\"The defence team applauds President Trump for doing the right thing,\" said Andrew Mancilla.\"The sentence was far too long.\"Santos's downfall began in 2022, after the New York Times published an investigation revealing the freshman congressman had lied about his CV, including having a university degree and working for Citigroup and Goldman Sachs.From there, the lies continued to pile up, including allegations that he stole money from a fundraiser for a dying dog and that he lied about his mother surviving the 9/11 terrorist attacks. Shortly afterwards, local and federal officials began to investigate.He was eventually charged with 23 federal felony crimes, and in 2023 became the first expelled member of Congress in more than 20 years, and only the sixth in history.A report from the House ethics panel accused him of misusing campaign funds for personal benefits, including Botox and subscriptions on the OnlyFans website.Santos defeated a Democratic incumbent in 2022, flipping the district that encompasses parts of New York's Long Island and Queens, where he grew up.Earlier this week, Santos published an open letter to Trump in the South Shore Press newspaper in Long Island, repeating his plea to be pardoned. The letter, which was titled a \"passionate plea to President Trump\" asked for \"the opportunity to return to my family, my friends, and my community.\"He wrote that he had been kept in solitary confinement after a death threat in August, and apologised for his actions. \"Mr President, I am not asking for sympathy. I am asking for fairness - for the chance to rebuild,\" he wrote.\"I know I have made mistakes in my past. I have faced my share of consequences, and I take full responsibility for my actions. \"But no man, no matter his flaws, deserves to be lost in the system, forgotten and unseen, enduring punishment far beyond what justice requires.\"Trump has issued pardons to at least two other former Republican lawmakers since returning to office in January.In May, he pardoned former congressman Michael Grimm, who pleaded guilty in 2014 to tax crimes.He also pardoned former Connecticut Governor John Rowland, who pleaded guilty in 2004 to corruption and fraud charges.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "George Santos: 'Have a great life!' Trump orders prison release of disgraced ex-congressman",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/93db/live/56e06400-abb2-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-17T23:04:31.000Z",
      "dateModified": "2025-10-17T23:04:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Galleri test: Exciting results from blood test for 50 cancers ",
    "url": "https://www.bbc.com/news/articles/c205g21n1zzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f714/live/07276060-aba5-11f0-bba9-81f28efa2a1e.jpg",
    "tag": "Trending",
    "date": "2025-10-17T22:02:31.000Z",
    "description": "6 hours agoFergus WalshMedical editorA blood test for more than 50 types of cancer could help speed up diagnosis according to a new study.Results of a",
    "body": "6 hours agoFergus WalshMedical editorA blood test for more than 50 types of cancer could help speed up diagnosis according to a new study.Results of a trial in north America show that the test was able to identify a wide range of cancers, of which three quarters don't have any form of screening programme.More than half the cancers were detected at an early stage, where they are easier to treat and potentially curable.The Galleri test, made by American pharmaceutical firm Grail, can detect fragments of cancerous DNA that have broken off a tumour and are circulating in the blood.The trial followed 25,000 adults from the US and Canada over a year.  Nearly one in a 100 of those tested had a positive result and in 62% of these cancer was later confirmed.  The test correctly ruled out cancer in over 99% of those who tested negative.  When combined with breast, bowel and cervical screening it increased the number of cancers detected overall seven-fold.  Crucially, three quarters of cancers detected were for those which have no screening programme such as ovarian, liver, stomach bladder and pancreas.The blood test correctly identified the origin of the cancer in 9 out of 10 cases.These impressive results suggest the blood test could eventually have a major role to play in diagnosing cancer earlier.Scientists not involved in the research say more evidence is needed to show whether the blood test reduces deaths from cancer.The topline results are to be released at the European Society for Medical Oncology congress in Berlin, but the full details have yet to be published in a peer reviewed journal.Much will depend on the results of a three-year trial involving 140,000 NHS patients in England, which will be published next year.The NHS has previously said that if the results are successful, it would extend the tests to a further one million people.The lead researcher, Dr Nima Nabavizadeh, Associate Professor of Radiation Medicine at Oregon Health & Science University said the latest data show that the test could \"fundamentally change our approach to cancer screening, helping to detect many types of cancer earlier, when the chance of successful treatment or even cure are the greatest\".But Clare Turnbull, Professor of Translational Cancer Genetics at The Institute of Cancer Research, London, said: \"Data from randomised studies, with mortality as an endpoint, will be absolutely essential to establish whether seemingly earlier-stage detection by Galleri translates into benefits in mortality.\"Sir Harpal Kumar, President of Biopharma at Grail, told the BBC: \"We think these results are very compelling.  The opportunity in front of us is that we can find many more cancers - and many of the more aggressive cancers - at a much earlier stage when we have more effective and potentially curative treatments.\"Naser Turabi of Cancer Research UK said: \"Further research is needed to avoid overdiagnosing cancers that may not have caused harm. The UK National Screening Committee will play a critical role in reviewing the evidence and determining whether these tests should be adopted by the NHS.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Galleri test: Exciting results from blood test for 50 cancers ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f714/live/07276060-aba5-11f0-bba9-81f28efa2a1e.jpg"
      ],
      "datePublished": "2025-10-17T22:02:31.000Z",
      "dateModified": "2025-10-17T22:02:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Orionid meteor shower peaks next week: When and where to see it ",
    "url": "https://www.bbc.com/weather/articles/c70196602g2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/84b3/live/7ea45a90-9de4-11f0-a561-d7c24224dfc6.jpg",
    "tag": "Trending",
    "date": "2025-10-17T23:58:22.000Z",
    "description": "How and when to see the Orionids meteor showerImage source, Getty ImagesByShireen Jordan BBC WeatherPrepare yourself for a fireworks spectacle this co",
    "body": "How and when to see the Orionids meteor showerImage source, Getty ImagesByShireen Jordan BBC WeatherPrepare yourself for a fireworks spectacle this coming week as the Orionids grace our night sky with the peak of their annual display.The Orionid meteor shower happens 60 miles up in space and is thought to be one of the most impressive displays of the celestial calendar. They are known for being bright and fast and will be visible between until 7 November, peaking for about seven days around the 22 October.The best viewing conditions will be between midnight and dawn.What are the Orionids?Image source, Chris HornbyImage caption, Meteors are often referred to as shooting starsThe Orionids are fast-moving meteors travelling at a speed of around 41 miles per second.They have long streaks of light and originate from the well- known Halley's Comet as it follows its orbit around the Sun. The comet itself only passes by Earth roughly every 75 years, with the next date expected to be the summer of 2061.As Earth passes through debris left by the comet, tiny particles the size of a grain of sand burn up in our atmosphere and leave a streak of light through the sky.  They can appear faint but they leave a distinctive light trail. Larger meteors will produce bright trails. Sometimes meteors can even appear brighter than the planet Venus – these are called fireballs, external.How can I watch the Orionids?Image source, Getty ImagesImage caption, Meteor showers are usually named after a star or constellation that is close to where the meteors appear to originate in the skyThe radiant is the point in the sky from which the meteors appear to originate, and for the Orionids this is the constellation of Orion.Orion rises in the east after midnight, just to the north of its red-tinged star Betelgeuse. To track down Orion, external, look out for a line of three bright stars, close together, known as Orion's Belt.The quality of the display is measured by how many meteors are visible every hour - known as the zenithal hourly rate. There could be around 15 meteors an hour during the peak of the Orionids around the 22 October travelling at speeds of 148,000mph (238,000km/h).For the best viewing conditions, find a dark spot, away from city lights after midnight with an unobstructed wide, open sky. Let your eyes adjust to the dark and look towards the constellation of Orion. You will not need binoculars or a telescope as the shower will be visible to the naked eye.Will the skies be clear?The arrival of low cloud this week means that opportunities for viewing the shower may be limited.Expect areas of fog, showers interspersed with brighter spells and some thunderstorms. As areas of low pressure continue to sweep in from the Atlantic, there is the potential for the arrival of stormy weather mid-week, which may make it too dangerous to spend any length of time outdoors.But as the peak is just after the new Moon on 21 October, a viewing window may be possible for some when the cloud breaks with no moonlight pollution.Keep across your local forecast on the BBC Weather website or app.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Orionid meteor shower peaks next week: When and where to see it ",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/84b3/live/7ea45a90-9de4-11f0-a561-d7c24224dfc6.jpg"
      ],
      "datePublished": "2025-10-17T23:58:22.000Z",
      "dateModified": "2025-10-17T23:58:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump-Zelensky meeting: Use of Tomahawk missiles in Russia war unclear",
    "url": "https://www.bbc.com/news/articles/c93dqew8l3xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e77b/live/0f8fc3a0-ab87-11f0-a7be-25e543799ac8.jpg",
    "tag": "Trending",
    "date": "2025-10-17T22:57:44.000Z",
    "description": "Zelensky guarded on Tomahawk missile talks with Trump after White House meeting5 hours agoBernd Debusmannat the White House andJohn SudworthKyivGetty ",
    "body": "Zelensky guarded on Tomahawk missile talks with Trump after White House meeting5 hours agoBernd Debusmannat the White House andJohn SudworthKyivGetty ImagesPresident Volodymyr Zelensky appears to have come away empty-handed from a White House meeting after US President Donald Trump indicated he was not ready to supply sought-after Tomahawk cruise missiles to Ukraine.Zelensky said after the cordial bilateral that he and Trump had talked about long-range missiles, but decided not to make statements on the issue \"because the United States does not want an escalation\".Following the meeting, Trump took to social media to call for Kyiv and Moscow to \"stop where they are\" and end the war.The Trump-Zelensky meeting came a day after Trump spoke with Russian President Vladimir Putin by phone, and agreed to meet him in Hungary soon.Zelensky believes using Tomahawks to strike at Russian oil and energy facilities would severely weaken Putin's war economy. While Trump did not rule it out, his tone at the White House on Friday was non-committal. \"Hopefully they won't need it, hopefully we'll be able to get the war over without thinking about Tomahawks,\" the US president said, adding that America needed the weapons.Trump said sending the missiles would be \"an escalation, but we'll be talking about it\".Asked by the BBC if the Tomahawks had prompted Putin to meet Trump, the US president said: \"The threat of that [the missiles] is good, but the threat of that is always there.\"Trump tells BBC Putin 'wants to make a deal', cites threat of TomahawksThe Ukrainian leader suggested his country could offer drones in exchange for the Tomahawks, prompting smiles and nodding from Trump.Zelensky also complimented Trump on his role in securing the first phase of a peace deal in the Middle East, suggesting the US leader could build on that momentum to help end Russia's war in Ukraine. Outside afterwards, Zelensky was asked by a reporter if he thought Putin wanted a deal or was just buying time with the planned meeting with Trump in Budapest. \"I don't know,\" he said, adding that the prospect of Ukraine having Tomahawks had caused Russia to be \"afraid because it is a strong weapon\".Asked if he was leaving Washington more optimistic that Ukraine would get the Tomahawks, he said: \"I am realistic.\"In a post on X, Zelensky said he had called European leaders to share details of the meeting with Trump, adding that the \"main priority now is to protect as many lives as possible, guarantee security for Ukraine, and strengthen all of us in Europe.\"UK Prime Minister Keir Starmer said the call with European leaders was \"productive\" and promised that \"the UK will continue to send humanitarian aid and military support\".In recent days, Trump had shown an openness to the idea of selling the Tomahawks, although Putin warned that such a move would further strain the US-Russian relationship.On Thursday, Trump said \"great progress\" was made during a phone call with Putin, with the pair agreeing to face-to-face talks soon in Hungary.Asked whether Zelensky would be involved in those talks, Trump said before his meeting sitting alongside the Ukrainian president that there was \"bad blood\" between Putin and Zelenksy.\"We want to make it comfortable for everybody,\" he said. \"We'll be involved in threes, but it may be separated.\" He added that the three leaders \"have to get together\". Watch: How might Tomahawk missiles change the Ukraine-Russia war?Trump said his call, the first with Putin since mid-August, was \"very productive\", adding that teams from Washington and Moscow would meet next week.Trump had hoped a face-to-face summit in Alaska in August would help convince Putin to enter into comprehensive peace talks to end the war, but that meeting failed to produce a decisive breakthrough.They spoke again days later when Trump interrupted a meeting with Zelensky and European leaders to call Putin.Back in Ukraine, the BBC spoke on Friday to a couple repairing the small store they own in a suburb of Kyiv, after it was obliterated by Russian missiles last month.When the store-owner, Volodymyr, was asked about Trump's forthcoming summit meeting with Putin, he began to say: \"We appreciate all support\".But he stepped away as tears welled up in his eyes. After a long pause, he composed himself and started again.\"Truth and democracy will win, and all the terrorism and evil will disappear,\" he said. \"We just want to live, we don't want to give up, we just want them to leave us alone.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump-Zelensky meeting: Use of Tomahawk missiles in Russia war unclear",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e77b/live/0f8fc3a0-ab87-11f0-a7be-25e543799ac8.jpg"
      ],
      "datePublished": "2025-10-17T22:57:44.000Z",
      "dateModified": "2025-10-17T22:57:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Prince Andrew gives up his title as Duke of York",
    "url": "https://www.bbc.com/news/articles/cgqlyw9g7weo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5efd/live/52b0ac90-ab7c-11f0-92a8-7dbabb20e321.jpg",
    "tag": "Trending",
    "date": "2025-10-17T22:35:32.000Z",
    "description": "6 hours agoSean CoughlanRoyal correspondentPrince Andrew is giving up his titles, including the Duke of York, he has announced in a personal statement",
    "body": "6 hours agoSean CoughlanRoyal correspondentPrince Andrew is giving up his titles, including the Duke of York, he has announced in a personal statement.He has been under increasing pressure over his links with sex offender Jeffrey Epstein, with calls for Buckingham Palace to take action against him.That now seems to have resulted in the prince deciding to voluntarily hand back his titles and to give up membership of the Order of the Garter, the oldest and most senior order of chivalry in Britain.In his statement he said he continued to \"vigorously deny the accusations against me\".\"In discussion with the King, and my immediate and wider family, we have concluded the continued accusations about me distract from the work of His Majesty and the Royal Family,\" said a statement from Prince Andrew.\"I have decided, as I always have, to put my duty to my family and country first.\"I stand by my decision five years ago to stand back from public life.\"With His Majesty's agreement, we feel I must now go a step further. I will therefore no longer use my title or the honours which have been conferred upon me. As I have said previously, I vigorously deny the accusations against me.\"Andrew's decision to stop using his titles was made in consultation with William, Prince of Wales, as well as the King.He will remain a prince - but will cease to be the Duke of York, a title received from his mother, the late Queen Elizabeth.Andrew had already ceased to be a \"working royal\" and had lost the use of his HRH title and no longer appeared at official royal events. His role now will be even more diminished.The prince has faced a series of scandals over recent years, including a court case he settled with Virginia Giuffre, questions about his finances and his involvement with an alleged Chinese spy.His ex-wife will be known as Sarah Ferguson and no longer Duchess of York, but their daughters will continue to have the title of princess. He is expected to stay in his Windsor home, Royal Lodge, on which he has his own private lease which runs until 2078.Prince Andrew has faced intense scrutiny over his links with disgraced financier Epstein, more recently including questions about when he had really cut off contact.In a now-infamous BBC Newsnight interview in 2019, Prince Andrew said that he had severed all links with Epstein after they had been photographed together in New York in December 2010.But emails sent in February 2011 later emerged suggesting that he had privately stayed in touch with Epstein, including swapping a message: \"Keep in close touch and we'll play some more soon!\"There had been growing frustration in Buckingham Palace at the scandals that continued to surround the prince.Next week a posthumous memoir by Virginia Giuffre, who took her own life earlier this year, will be published, which is likely to cast further attention on Prince Andrew's involvement with her and Epstein.Ms Giuffre claimed that she was one of many vulnerable girls and young women who had been sexually exploited by Epstein and his circle of wealthy connections.She alleged that Andrew had sex with her at his friend Ghislaine Maxwell's house in London in 2001, when Ms Giuffre was 17 years old.Her memoir describes two other occasions on which she alleges she had sex with Andrew - in Epstein's townhouse in New York and on Epstein's private island in the US Virgin Islands.Prince Andrew made a financial payment to Ms Giuffre in an out-of-court settlement in 2022, after she had brought a civil case against him. He denies all the accusations made against him.Speaking to BBC Newsnight following the announcement that Andrew was giving up his titles, Sky Roberts, Ms Giuffre's brother, said the news had brought mixed emotions, but that his late sister \"would be very proud\" of the development.\"We have shed a lot of happy and sad tears today. I think happy because in a lot of ways this vindicates Virginia,\" Mr Roberts said.\"All the years of work that she put in is now coming to some sort of justice,\" he added.Sky also called on the King to \"potentially go ahead and take out the 'Prince' in the Andrew.\"Also speaking to BBC Newsnight, Epstein accuser Haley Robson said it was a \"bittersweet\" moment.Ms Robson said Ms Giuffre \"started this fight and we're going to see it through\", adding that \"I really wish that she could have been here to see all of what she started\".\"Having him [Prince Andrew] step down and be stripped of his titles is something that is long delayed, and it is very appropriate, and kudos to King Charles,\" Ms Robson said.Andrew withdrew from Royal Family events last Christmas after an alleged Chinese spy who he was linked to was named in a High Court judgement.His office said nothing sensitive had ever been discussed with Yang Tengbo, also known as Chris Yang, who became a close advisor on Andrew's business ventures.In 2022, Andrew was repeatedly named in a court dispute between a Turkish millionaire and her former business adviser.There were no suggestions of wrongdoing by the prince, but the court case highlighted the prince as receiving payments in a complex set of financial deals. A gift of £750,000 was returned to the Turkish millionaire by the prince.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Prince Andrew gives up his title as Duke of York",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5efd/live/52b0ac90-ab7c-11f0-92a8-7dbabb20e321.jpg"
      ],
      "datePublished": "2025-10-17T22:35:32.000Z",
      "dateModified": "2025-10-17T22:35:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Red Cross retrieves another body of dead hostage in Gaza, Israel says ",
    "url": "https://www.bbc.com/news/articles/c5yp3eq9knvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/49fc/live/1f4416d0-abbd-11f0-ba8e-234eb9581682.jpg",
    "tag": "Trending",
    "date": "2025-10-17T21:51:00.000Z",
    "description": "Israel's military says another coffin containing the remains of a dead hostage which was handed over to the Red Cross in Gaza is now back in Israel.Po",
    "body": "Israel's military says another coffin containing the remains of a dead hostage which was handed over to the Red Cross in Gaza is now back in Israel.Posting on X, the Israel Defense Forces (IDF) urged the public to \"act with sensitivity and wait for the official identification, which will first be communicated to the families\".This was echoed by a statement from the prime minister's office, which asked people to \"refrain from spreading rumours and information that is not official\".Hamas has returned nine of the 28 deceased hostages that were still in Gaza this week - the latest one will be the tenth if forensic testing confirms the identity of the remains matches those of a hostage.In a statement on Friday night, the International Committee of the Red Cross (ICRC) said its team had taken \"all possible measures to ensure the deceased are managed with respect\", and that Israeli forensic authorities would now have the task of identifying the remains in Tel Aviv.There has been fury in Israel that Hamas has not returned all of the bodies, in line with last week's ceasefire deal - though the US has downplayed the suggestion it amounts to a breach.On Friday night, the IDF again stressed that Hamas must \"uphold the agreement and take the necessary steps to return all the hostages\".Hamas has said it remained committed to the ceasefire, including \"keenness to hand over all remaining corpses\".The Palestinian group accused Israeli Prime Minister Benjamin Netanyahu of impeding its ability to search for hostages' remains by not allowing heavy machinery and diggers into Gaza. It has blamed Israel for making the task of finding bodies difficult, because Israeli strikes have reduced so many buildings to rubble.BBC Verify - Aid group suspends Gaza operations after ceasefireUS plays down claims Hamas is violating ceasefire dealSpeaking on Thursday at a memorial for victims of the Hamas-led 7 October 2023 attack, Netanyahu said he was \"determined\" to secure the return of all the dead hostages, and that the country would continue to fight terrorism with \"full force\".As part of the US-brokered ceasefire deal, Israel freed 250 Palestinian prisoners in Israeli jails and 1,718 detainees from Gaza.After Hamas said it was unable to retrieve all the bodies, two senior Trump advisers said preparations to move to the next phase of the ceasefire deal were continuing.The advisers told reporters that the US government did not so far believe that Hamas had broken the agreement by not retrieving more remains, and said the group had acted in good faith by sharing information with interlocutors.While the full text of the agreement between Israel and Hamas has not been made public, a leaked version which appeared in Israeli media appeared to allow for the possibility that not all of the bodies would be immediately accessible.The Israeli military launched a campaign in Gaza in response to the attack, in which Hamas-led gunmen killed about 1,200 people in southern Israel and took 251 others hostage.At least 67,967 people have been killed by Israeli attacks in Gaza since then, according to the territory's Hamas-run health ministry, whose figures are seen by the UN as reliable.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Red Cross retrieves another body of dead hostage in Gaza, Israel says ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/49fc/live/1f4416d0-abbd-11f0-ba8e-234eb9581682.jpg"
      ],
      "datePublished": "2025-10-17T21:51:00.000Z",
      "dateModified": "2025-10-17T21:51:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who is Prince Andrew? The royal who has given up his titles",
    "url": "https://www.bbc.com/news/articles/c4g7zn96nevo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f548/live/f5e8ce70-ab94-11f0-ba75-093eca1ac29b.jpg",
    "tag": "Trending",
    "date": "2025-10-17T21:09:37.000Z",
    "description": "7 hours agoGetty ImagesPrince Andrew will no longer use his royal titles, including the Duke of York, after discussions with his brother, King Charles",
    "body": "7 hours agoGetty ImagesPrince Andrew will no longer use his royal titles, including the Duke of York, after discussions with his brother, King Charles III.The prince had already returned military titles and royal patronages in 2022, and stopped using the title His Royal Highness in an official capacity, after he was accused of sexual abuse in a civil case in the US.He later settled the case brought against him by Virginia Giuffre, a victim of sex trafficking and abuse by Jeffrey Epstein, who alleged the prince sexually abused her when she was under the age of 18 - something the prince has consistently denied.The prince's announcement came days before the posthumous memoir of Ms Giuffre was due for release - almost six months after she took her own life in April 2025.Who is Prince Andrew?The 65-year-old prince is the third child of the late Queen Elizabeth II and he is eighth in line to the throne.His elder siblings are his brother King Charles and his sister Anne, the Princess Royal.He is divorced from Sarah Ferguson - who lost her title as Duchess of York when the prince stopped using his own royal title - with whom he has two daughters, Princess Beatrice and Princess Eugenie.Getty ImagesWhat was Prince Andrew accused of?The Duke of York was accused of sexual abuse in a civil case in the US.In court documents, Virginia Giuffre said she was the victim of sex trafficking and abuse by Jeffrey Epstein from the age of 16.Part of her abuse involved being lent out to other powerful men - including Prince Andrew, she alleged.Ms Giuffre says the prince sexually assaulted her on three occasions when she was under the age of 18.Prince Andrew has consistently denied all the allegations against him. He said in an interview with BBC Newsnight in 2019 that he had no recollection of ever meeting Ms Giuffre.On 15 February 2022 a letter filed to the US district court said the duke and Ms Giuffre had reached an out-of-court settlement.It said the duke - who made no admission of liability - would pay an undisclosed sum to Ms Giuffre.Prince Andrew settles US civil sex assault casePrince Andrew loses military titles and use of HRHWhere does Prince Andrew get his money from?It is thought Prince Andrew received an annual sum from the Sovereign Grant - which covers official duties - until 2019, when he stood down as a working Royal.However, the amount was not made public and it is not known whether he subsequently received money from his late mother the Queen Elizabeth II's - or later his brother King Charles' - private funds.Royal sources say the King cut off Andrew's funding last year.In 2007, the prince sold his Sunninghill Park home for £15m - £3m more than the asking price - to Timor Kulibayev, the son-in-law of the then-president of Kazakhstan. The 12-bedroom house near Windsor Castle had been given to the prince as a wedding present from Queen Elizabeth.He lives in the Royal Lodge in Windsor, a Grade II-listed property, but that's leased from the Crown Estate and is not an asset that could be sold.There have been repeated calls for Prince Andrew to be removed from the 30-room mansion but he has his own independent lease with the Crown Estate that lasts until 2078. Much of the costs of moving there were front-loaded when he took on the property in 2003 and there is little obvious incentive for Andrew to leave now.Prince Andrew seems to have cultivated his own independent sources of funding since leaving public life, including business connections with China, the Gulf States and a recently curtailed project with a Dutch start-up company. He has proved financially resilient, despite what must be significant costs in paying for his own security.What titles has Prince Andrew given up?Prince Andrew will remain a prince as it is a title from his birth, as the son of the monarch, with the titles he has since lost only given to him later in life.He will no longer be called the Duke of York, which he was given when he got married in 1986, and has given up membership of the Order of the Garter.Additionally, Prince Andrew is also giving up the titles of Earl of Inverness and Baron of Killyleagh.In 2022 it was announced he would no longer use his title of His Royal Highness, or HRH, in any official capacity - though like Harry and Meghan, he would still retain the title privately.The duke had a 22-year career in the Royal Navy, and served as a helicopter pilot during the 1982 Falklands War. He also commanded the mine countermeasures vessel HMS Cottesmore.Michael Dunlea/PA MediaPrince Andrew has given up his membership of the Order of the GarterHis military appointments were suspended after he stepped back from public duties in 2019.He also lost a series of UK military titles including colonel of the Grenadier Guards,  honorary air commodore of RAF Lossiemouth and colonel-in-chief of the Royal Irish Regiment.What patronages were returned?The job of a royal patron is to bring publicity to a cause or service.The prince used to be a patron to about 200 charities and organisations.But after the controversial BBC interview in 2019, in which he denied allegations that he had sex with Ms Giuffre, many chose to cut ties with him. They included the Outward Bound Trust, English National Ballet, Royal Philharmonic Orchestra and London Metropolitan University.Prince Andrew had still been left with dozens of other patronages - including being a patron or member of prestigious golf clubs, schools and cultural trusts.But these were later returned to his mother, Queen Elizabeth II, and were to be redistributed to other members of the Royal Family.Getty ImagesWhat other roles has Prince Andrew had?After retiring from the Navy, Prince Andrew served as the UK's special representative for trade and investment for 10 years.But he gave up the title after he was criticised over his friendship with Jeffrey Epstein, who was sentenced to 18 months in prison in 2008 for soliciting a minor for prostitution.He had also attracted criticism for combining business with pleasure on his overseas trips, and some newspapers gave him the nickname \"Airmiles Andy\".The prince's judgement was also questioned for holding meetings with former Libyan leader Colonel Muammar Gaddafi's son Saif, and for entertaining the son-in-law of Tunisia's ousted president Zine El Abidine Ben Ali at Buckingham Palace.And in November 2010, a secret cable published on Wikileaks revealed a US ambassador wrote that he spoke \"cockily\" during an official engagement, leading a discussion that \"verged on the rude\".From 2011 to 2019, Prince Andrew was a working Royal.One focus was Pitch@Palace - an initiative he started to help entrepreneurs seeking investment.In 2020 it removed Prince Andrew's name from its website, after prominent supporters distanced themselves amid revelations about his friendship with Epstein.Questions were raised about his judgement after it was alleged a \"close confidant\" was a Chinese spy.The prince said he had \"ceased all contact\" with the businessman after being advised to do so by the government.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who is Prince Andrew? The royal who has given up his titles",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f548/live/f5e8ce70-ab94-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-17T21:09:37.000Z",
      "dateModified": "2025-10-17T21:09:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Can Putin's Flying Kremlin travel to through EU airspace to Budapest?",
    "url": "https://www.bbc.com/news/articles/ckgkd40yypwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cbff/live/da86c3f0-ab6f-11f0-9045-ff945a3371d8.jpg",
    "tag": "Trending",
    "date": "2025-10-17T17:57:56.000Z",
    "description": "10 hours agoPaul KirbyEurope digital editorGAVRIIL GRIGOROV/POOL/AFPPutin flew to Alaska in his specially modified Il-96 plane in AugustThe summit has",
    "body": "10 hours agoPaul KirbyEurope digital editorGAVRIIL GRIGOROV/POOL/AFPPutin flew to Alaska in his specially modified Il-96 plane in AugustThe summit has not been set in stone, but if Russia's Vladimir Putin does go to Budapest to meet US President Trump in the next two weeks, he would need to clear a few hurdles first.When Putin travelled to Alaska for his Anchorage summit in August, the US granted special permission for the presidential plane - a modified Ilyushin Il-96 airliner dubbed the \"Flying Kremlin\" that has four engines and is bristling with defence systems.Russian planes are banned from US airspace, and from EU airspace too. So if Putin does fly to Budapest he would need special dispensation if he decided to fly over an EU member state.It is perfectly possible, but landlocked Hungary is not the easiest destination to get to for a Russian president who rarely sets foot abroad and has not travelled to the EU for years.\"For now, of course, it's not clear,\" says Kremlin spokesman Dmitry Peskov. \"What we do have is the willingness of the presidents to hold such a meeting.\"Days after Putin ordered Russia's full-scale invasion of Ukraine in February 2022, the EU froze the assets of both its leader and Foreign Minister Sergei Lavrov.A blanket ban was also imposed on all Russian aircraft flying through the airspace of all 27 EU countries. Hungary and many of its neighbours are Nato member states too.Putin has also been accused by the International Criminal Court (ICC) of war crimes of unlawfully deporting and transferring of Ukrainian children to Russia.So there are complications, although Hungary believes they can all be sorted out. Hungary is in the process of pulling out of the ICC anyway.Putin and Hungary's Viktor Orban, probably his closest ally in the EU, have already discussed the planned summit over the phone, and Hungarian Foreign Minister Peter Szijjarto has told reporters \"we will of course ensure that he can enter Hungary, hold successful talks here, and then return home\".Getty ImagesHungary's Viktor Orban is one of Putin's closest allies in the EUThe EU is unlikely to create obstacles either.Its executive commission has said any meeting that moves forward \"a just and lasting peace for Ukraine\" is welcome and it supports President Trump's efforts towards that.One of the main drivers for its latest proposed sanctions on Russia - the 19th package so far - is to bring the Russians to the negotiating table, it says. And it points out there's no travel ban on Putin, only an asset freeze.The biggest sticking point is how Russia's leader will fly from Moscow to Budapest. Clearly he will not be buying an Air Serbia ticket to Belgrade and catching the train to Hungary, which may be the most direct route to take.He will want his Il-96 plane to guarantee his safety, but that will probably mean using the airspace of an EU and Nato member state and obtaining permission to break the EU's ban on Russian planes.European Commission spokeswoman Anitta Hipper said on Friday that \"in terms of the direction of travel, member states can give derogations but it must be given by member states individually\".Nato has also referred the issue to respective national authorities, and as Trump is involved they may acquiesce.Even with dispensation, a look at the map shows Putin may have to take a circuitous route. Ukraine is out of the question, and probably Poland too because of Warsaw's icy relations with Moscow.Perhaps the most direct route goes via the eastern coast of the Black Sea and Turkey, through Bulgaria and either Serbia or Romania into Hungary.Serbia's president, Aleksandar Vucic, knows Putin well and Air Serbia has direct flights to Moscow over EU airspace. Serbia is a candidate to join the EU but is not a member.It is the EU countries, Bulgaria or perhaps Romania, that would need to give consent, and they would have to escort Putin's plane through their airspace.Romania has what is set to become the biggest Nato base in Europe, and Bulgaria is also building a Nato base as part of efforts to shore up the defensive alliance's eastern flank.The BBC has approached the foreign ministries of both countries for comment.If Putin wants to play it even more safely, he could fly via Turkey, around the south coast of Greece and then up through Montenegrin airspace before going over Serbia. But it is a far longer route.Anadolu via Getty ImagesPutin's Ilyushin plane has been dubbed the \"Flying Kremlin\"Budapest is not then the easiest of venues, even if it works very well for Viktor Orban, who has long had good relations with both Putin and Donald Trump.\"It's a leader that we like,\" said Trump on Friday, \"he likes him, I like him.\"A high-profile international summit will do Orban no harm at all, as he is trailing in the polls before elections next spring.Within hours of Budapest being named as a venue, Orban was on the phone to Putin and declared on his Facebook page: \"Preparations are in full swing!\"Orban has little time for the EU's backing of Ukraine and he was quick to make clear Brussels would have nothing to do with the talks.\"Since the EU is pro-war, it is logical that it will be left out of this peace process,\" he told Hungarian radio on Friday.European leaders will have other ideas when they see him at next week's summit in Brussels next week.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Can Putin's Flying Kremlin travel to through EU airspace to Budapest?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cbff/live/da86c3f0-ab6f-11f0-9045-ff945a3371d8.jpg"
      ],
      "datePublished": "2025-10-17T17:57:56.000Z",
      "dateModified": "2025-10-17T17:57:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "After all those scandals, why did Prince Andrew quit his titles now?",
    "url": "https://www.bbc.com/news/articles/c3ep8gd1qv3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4730/live/a803c280-abbe-11f0-a705-a564fdd057f2.jpg",
    "tag": "Trending",
    "date": "2025-10-17T21:53:26.000Z",
    "description": "6 hours agoSean CoughlanRoyal correspondentGetty ImagesAfter so many scandals, Prince Andrew has given up the use of his titles and honours.He can no ",
    "body": "6 hours agoSean CoughlanRoyal correspondentGetty ImagesAfter so many scandals, Prince Andrew has given up the use of his titles and honours.He can no longer sign off as the Duke of York, or put \"KG\", a Knight of the Garter, after his name, with a flourish of medieval chivalry. The Earl of Inverness and Baron Killyleagh are also scratched off his list of titles, with \"Andrew Inverness\" a name he'd sometimes used in his business dealings.But what's caused this sudden announcement? Particularly as this dramatic move, removing the remaining vestiges of his royal life, comes with an assertion of his innocence and that he continued to \"vigorously deny the accusations against me\".PA MediaPrince Andrew will no longer be at the Order of the Garter ceremoniesPrince Andrew has voluntarily given up the use of his titles - but he was clearly under pressure to jump before he was pushed.This way, the changes in his status are kept in-house and there doesn't have to be the intervention of Parliament, which would have needed to legislate to take away his title as Duke of York.That would have been messy, but the Palace was already sending signals it was prepared to take action, and it was confident that Parliament, and popular opinion, would have supported such a change.Allowing Andrew to voluntarily give up his titles, which theoretically remain in place, gave him a way out, still holding on to a little of the disappearing vapour trail of his pride.But it's no secret that Buckingham Palace was exasperated with the scandals surrounding Prince Andrew and what a royal source calls the \"constant parade of headlines\". He was one of their \"Dukes of Hazard\" that kept making news for all the wrong reasons.Questions about Andrew's links to sex offender Jeffrey Epstein were drowning out the work of the rest of the Royal Family. That was on top of unanswered questions about Andrew's finances and his connections to an alleged Chinese spy.ReutersPrince Andrew and King Charles at the funeral of the Duchess of Kent last monthNext week will see an historic state visit by the King and Queen to meet Pope Leo at the Vatican, and there was a deep irritation that such a solemn occasion was going to be overshadowed by lurid stories about Andrew and Epstein.According to royal sources, a \"tipping point\" had been reached and something had to be done. Arguably that should have happened earlier. But that would also have meant the Palace publicly accepting that it had a responsibility for Prince Andrew, when it had so long argued that as a \"non-working royal\", his problems were his own to resolve.But this latest move shows a recognition that even if Andrew isn't a royal responsibility, it's still their reputation he's been damaging.What added to the sense of this no longer being a tenable position was an email published last weekend that showed Prince Andrew had stayed in touch with Epstein longer than he had claimed in his BBC Newsnight interview.A royal source said this was a significantly different moment when there were such clear \"fault lines\" exposed in Prince Andrew's version of events.Curiously, the same email had been partially published in January - again showing that Andrew had not cut ties to Epstein when he had claimed - but this time in October the impact has been like the pebble that has started an avalanche.It followed a similar awkwardness for Sarah Ferguson, where a private email contradicted her own public claims to have cut links with Epstein.And it added to the pressure from extracts published from a posthumous memoir of Virginia Giuffre, the Epstein victim who had reached a financial settlement with Prince Andrew, and had earlier this year taken her own life.Getty ImagesVirginia Giuffre's memoir raises more questions about Andrew and EpsteinMs Giuffre's memoir, to be published next week, once again casts Andrew into toxic associations with Epstein.And the book's accusation that Prince Andrew was \"entitled\" echoed the title of a recent biography of Prince Andrew, by Andrew Lownie, that took another wrecking ball to his reputation.It's been a landslide of bad news, month after month, that showed no sign of losing momentum. He'd become the disastrous football manager, or the damaged political leader, who had no obvious way of being removed. Particularly when it was like a football manager whose brother was the chairman.There's always a tension between protecting an institution and a reluctance to remove the individuals within it. Even more so when the institution is also a family. It's where the Godfather movies meet the Crown.But something had to be done, and in the end, Andrew has handed back the keys to his royal life and walked away. More could still emerge in the United States in the trawling of documents related to Epstein.Ominously for Prince Andrew, among those quick to respond on Friday evening was the leading Democrat on the US House Oversight Committee that has been pushing for the release of Epstein material.Robert Garcia, whose colleagues recently revealed documents showing an \"Andrew\" getting massages on Epstein's private jet, said: \"His decision to give up his royal titles is long overdue.\"\"We know rich and powerful men used their money and power to abuse girls and young women, and to shield themselves from justice. Prince Andrew's decision is just the beginning in the committee's work to deliver justice for the survivors.\"Prince Andrew has always denied wrongdoing but this has become a global story.When US President Trump arrived for his state visit, it was a picture of Andrew and Epstein that protesters projected on to the walls of Windsor Castle.Prince Andrew's decision to step away from his remaining titles will also mean he stays in step with his ex-wife, who is no longer the Duchess of York. They are back to where they began when they first met - as Prince Andrew and Sarah Ferguson.They still live together and as Prince Andrew has his own long lease on Royal Lodge, they'll carry on there as before. The King had already financially cut off Prince Andrew, so there isn't any change there, he'll have to find his own funding.But by voluntarily stepping back, rather than being stripped of their honours, it means that their daughters will carry on with the titles of princess.Prince Andrew won't be at the royal Christmas gathering in Sandringham this year. And the guessing game about seeing him at the Order of the Garter parade won't happen again.But are the questions about his conduct really over?",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "After all those scandals, why did Prince Andrew quit his titles now?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4730/live/a803c280-abbe-11f0-a705-a564fdd057f2.jpg"
      ],
      "datePublished": "2025-10-17T21:53:26.000Z",
      "dateModified": "2025-10-17T21:53:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lamborghini swerves away from all-electric future",
    "url": "https://www.bbc.com/news/articles/clykvq2955qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d984/live/fe4e1280-ab78-11f0-adb1-afd098d794f7.jpg",
    "tag": "Trending",
    "date": "2025-10-17T21:45:04.000Z",
    "description": "6 hours agoTheo LeggettInternational Business CorrespondentGettyThe boss of Lamborghini said enthusiasm for electric cars was decliningThe boss of Lam",
    "body": "6 hours agoTheo LeggettInternational Business CorrespondentGettyThe boss of Lamborghini said enthusiasm for electric cars was decliningThe boss of Lamborghini has said its customers still want \"the sound and the emotion\" of internal combustion engines, and the company will use them in its cars for at least the next decade.Speaking to the BBC at the Italian supercar-maker's London showroom, chief executive Stephan Winkelmann said enthusiasm for electric cars was declining - creating an opportunity to focus on hybrid power instead.Lamborghini will decide in the next month whether a long-planned new model, the Lanzador, will be all-electric, or merely a plug-in hybrid, he said.Mr Winkelmann insisted the business was socially responsible, but added that as a low-volume manufacturer, its actions would have a limited impact on the environment.Lamborghini is a luxury brand ultimately owned by the Volkswagen Group. It currently has three main models.The Temerario and Revuelto are supercars. Both are plug-in hybrids, combining powerful petrol engines with electric motors. They can run in all-electric mode, but only for very short distances.The Urus is a luxury SUV, currently available as a plug-in hybrid and as a conventional petrol-powered car. Less exotic and certainly less ostentatious than the supercars, it nevertheless makes up more than half of the company's sales.There is also a limited edition 'super-sports' car: the Fenomeno, which has a top speed of more than 215mph. Only 30 will be built, each costing at least €3m (£2.6m) before taxes.Two years ago, Lamborghini announced plans for an all-electric successor to the Urus, which would have been available from 2029. However, the plan was recently shelved, with the electric model now not expected before 2035.It had also planned to make a brand new battery-powered grand tourer (GT), to be called the Lanzador. However, the future of that project is also deeply uncertain.Lamborghini chief executive Stephan Winkelmann \"We still need to decide whether we are going full electric, the decision we took some years ago, or seeing whether in the new environment this should also be a plug-in hybrid\", said Mr Winkelmann.The new environment he referred to is a perceived waning of interest in electric cars among high-end buyers.\"Today enthusiasm for electric cars is going down\", he explained. \"We see a huge opportunity to stay with internal combustion engines and a battery system much longer than expected\".Continuing to use internal combustion engines for another 10 years, he said, would be \"paramount for the success of the company\". Customers, he insisted, still hankered after the noise and fury of a conventional motor.\"This is something they want, they still want the sound and the emotion of an internal combustion engine\", he said.It's an approach that contrasts with that of Lamborghini's Italian arch-rival Ferrari, which is pushing ahead with its own plans for a first all-electric car.The aptly-named Elettrica is due to be unveiled next year, though the company showed off some key components at its Capital Markets Day earlier this month.It will be sold alongside conventional and hybrid models.Ferrari chief executive Benedetto Vigna said it would have driving traits that were \"unique in the heart, in the soul of our clients.\"Getty ImagesThere are questions about whether the Lanzador model - pictured here as a concept model in 2023 - will be fully electric Mr Winkelmann insisted his own company was not ignoring the ongoing pressure to cut emissions.\"We are selling 10,000 cars in a world that is producing 80 million cars a year, so our impact in terms of CO2 emissions is not that important\", he said.\"For sure, we are socially responsible, but it doesn't really make a lot of difference\".The sale of new petrol and diesel cars, including plug-in hybrids, is due to be banned in both the the EU and the UK from 2035.However, in the EU, there has been intense lobbying from some manufacturers for the transition to electric cars to be given more time, in order to \"acknowledge current industrial and geopolitical realities\".If that happens, internal combustion engines could remain on the market beyond the current deadline.Meanwhile the UK's rules provide an exemption for \"low volume\" manufacturers who register fewer than 2,500 new cars each year.This would currently cover Lamborghini, which sold just 795 cars here last year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lamborghini swerves away from all-electric future",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d984/live/fe4e1280-ab78-11f0-adb1-afd098d794f7.jpg"
      ],
      "datePublished": "2025-10-17T21:45:04.000Z",
      "dateModified": "2025-10-17T21:45:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]