[
  {
    "title": "Murder and MI5: the extraordinary battle over what stays secret",
    "url": "https://www.bbc.com/news/articles/c1w94v205y2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/121e/live/0b789990-faab-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-26T00:25:19.000Z",
    "description": "Murder and MI5: How an extraordinary battle erupted over what the state keeps secret20 hours agoDaniel De SimoneInvestigations correspondent BBCListen",
    "body": "Murder and MI5: How an extraordinary battle erupted over what the state keeps secret20 hours agoDaniel De SimoneInvestigations correspondent BBCListen to Daniel read this storyPaul Thompson was shot dead while being driven home in a taxi through Belfast in April 1994. He was murdered in a sectarian attack by loyalist paramilitaries who had set out to kill Catholics.The taxi driver was a friend who was collecting a fare at another address in the Springfield Park area in the west of the city. But no one at the address had rung the taxi firm. The call is suspected to have been a deliberate decoy by the killers who wanted to lure a taxi as prey. Paul was not specifically targeted. They could not have known he would ask for a lift or be in the area.One resident described hearing a heavy burst of gunfire after 23:00, running to the car and finding Paul.Members of a banned loyalist terror group, the Ulster Defence Association, using the cover name Ulster Freedom Fighters, claimed responsibility for the killing. During the Troubles in Northern Ireland, the group repeatedly murdered Catholic civilians like Paul.Family Handout/PA WireMembers of a banned loyalist terror group, the Ulster Defence Association, using the cover name Ulster Freedom Fighters, claimed responsibility for killing Paul, who was nicknamed TopperOn the morning of the day that Paul was killed, locals had told police about a hole in a barrier – known as the 'Peace Line' – which separated the largely Catholic Springfield Park area from a largely Protestant neighbouring area. The residents were concerned the breach could give loyalist paramilitaries access to launch an attack.The hole was not fixed. After the murder, those responsible escaped through it.An inquest into Paul's death was opened in 1995 but never concluded. No-one has ever been held to account. There has never been a full investigation.Left by themselves to fight for answers, his mother Margaret and brother Eugene, both now dead, came to suspect collusion between British security forces and informants – meaning state agents - in the group responsible.In 2024, a coroner decided to release to the family a summary of secret information held by the police. This was said by the coroner to be of central relevance to the case and the police supported the move. But the British government and MI5 argued this would prejudice national security and mounted a legal challenge.PA MediaPaul Thompson was killed by the UDA, which used the cover name of the Ulster Freedom FightersThe case, which centred on who had the power to decide to release the information, reached the Supreme Court last summer, with Paul Thompson's brother, Eugene, tuning in to hearings from a hospice, as he neared death from cancer.The case is widely viewed as a major test of the state's policy of neither confirming nor denying (NCND) information involving national security.Who decides what is secret?The NCND policy is a position adopted by the government and security services when responding to questions about sensitive matters. It means there will be no confirmation, no denial, and no acknowledgement that the information requested is true, false, or even exists.Eugene Thompson's barrister, Monye Anyadike-Danes KC, said the family had concluded the murder happened because the authorities were colluding with the \"very group that actually perpetrated the killing\". She said Eugene was \"trying to find out why his younger brother was murdered\" and felt a \"deep responsibility\".PA MediaEugene Thompson, who has since died, spent years trying to find out the truth about his brother's deathEugene, she added, believed the public should be able to trust that those who kill will be held accountable, especially when they are agents of the state. She asked the judges not to let the NCND policy be used to \"conceal the involvement of state parties in the killing of an ordinary citizen\".Just before Christmas, the court ruled that the government's assessment of damage to national security \"should have been accepted by the coroner\" unless it was plainly irrational or there was no supporting evidence.The justices found the coroner had failed to understand it was \"solely\" for the government to make submissions on national security, not the chief constable of the Police Service of Northern Ireland (PSNI), Jon Boutcher, who had argued for the release of the summary of police files.PA WireJon Boutcher argued for the release of the summary of police filesPaul Thompson's case is part of a battle over the truth and whether it can be told. The battle concerns official secrets, often connected to state agents, and it pits bereaved families and senior police officers against the government and the security service, MI5.It raises a profound question: can the state, especially when it is implicated in killing, be trusted as the arbiter of what should remain secret?The spycatcher who was himself a spyOther cases in the coming months will force these issues further into the spotlight – and they come at a time when MI5's integrity is under significant scrutiny.Yet the Supreme Court's ruling in the Thompson case creates a precedent that says the government and MI5 can withhold information from bereaved families, for national security reasons, even when the police want it to be disclosed.Grainne Teggart, from Amnesty International, described it as a \"grim day for truth\" and part of a pattern of \"national security being used as a shield to cover up and conceal the state's role in very serious crimes such as murder and other serious human rights violations.\"The government, by contrast, welcomed the court's \"unanimous judgment\".\"This is a highly complex case with wide-ranging implications,\" it said. \"The government will therefore take time to fully consider all aspects of this judgment.\"The Supreme Court's ruling in the Thompson case has created a precedentDuring the Troubles, the state made widespread use of informants, otherwise known as agents, who were tasked with carrying out actions and often paid. Agents existed in the IRA and in loyalist paramilitary groups. They were run by the police, the army, and MI5.The former Met Police chief Lord Stevens, who led UK government-commissioned investigations into collusion in Northern Ireland between the 1980s and 2000s, once said that of 210 people arrested during his enquiries, only three were not state agents.Collusion occurred in a number of ways, he said, ranging from the state withholding intelligence and evidence from investigators, to state agents being involved in murder. In some cases agents told the authorities in advance about planned attacks but nothing was done to stop them.One of the most notorious agents was codenamed Stakeknife. It has been publicly known for more than 20 years that Stakeknife was a man called Freddie Scappaticci. He died under MI5 protection in 2023 having never been charged with any of the many murders and other crimes to which he is linked.Pacemaker Press/ PAFreddie Scappaticci, or Stakeknife, died under MI5 protection in 2023Scappaticci was a senior figure in the IRA's internal security unit, which was tasked by IRA leaders with identifying and killing British agents in the organisation. But, with the spycatcher himself a spy, the result was one British agent killing other agents, or people accused of being agents, and the state repeatedly not intervening to save them.Intelligence agencies and historic wrongdoingA long-running police investigation into Stakeknife, Operation Kenova, was forbidden from officially naming Scappaticci in its final report, published in December, despite the fact that his identity was widely known.The head of the Kenova team, Sir Iain Livingstone, pleaded with Northern Ireland Secretary Hilary Benn for the right to name Scappaticci in his report, but Benn said he would decide after the Supreme Court ruling in the Paul Thompson case, which came later in December.That ruling has, in effect, strengthened Benn's power to stop him being named. If permission is granted, a revised version of the Kenova report can be published.Jon Boutcher, who was Livingstone's predecessor leading the Kenova investigation, has described the situation preventing Scappaticci being named as a \"pantomime\". It leads to the truth being \"suppressed,\" he argues, with \"profound and severe adverse impacts on victims and families, legitimate public discussion and debate, media freedom, open justice and public confidence in state agencies and the criminal justice system\".PA WireThe integrity of MI5, which is currently led by Sir Ken McCallum, is under scrutinyBoutcher, the PSNI chief constable, is involved in a significant and extraordinary stand-off with the government and MI5 over NCND.He has called for reform of the policy, a principle he fully supports but believes is being wrongly applied and has become a dogma that can be used to conceal wrongdoing.He has recommended the policy is reviewed to ensure it is applied proportionately and only where genuinely necessary for the protection of life or national security. The government has not yet responded to the call for a review of the policy.Boutcher has directly asked whether NCND's continued application on Stakeknife amounts to it being used as a tool for covering up things that should never have happened.\"I question whether this decision protects agents, or rather does it actually protect the government and intelligence agencies from accountability for historical wrongdoing.\"More from InDepthIn the Paul Thompson case he argued that he, as chief constable, rather than the government, had the right to allow the coroner to release a summary of police files. The high court and court of appeal backed his position before it was ultimately rejected by the Supreme Court.During the hearings, government barrister Sir James Eadie KC said Boutcher was being \"thoroughly disingenuous\" and that \"politics is being played with national security\". He argued the government is best placed to make assessments on national security, as only it has access to the full range of necessary advice. The principal advice, in this context, is from MI5.The argument the government is best informed seemed somewhat at odds with the fact the MI5 officer whose sworn statement was provided to support the case had not read the relevant underlying material.For the chief constable of Northern Ireland to be at loggerheads with MI5 is \"unprecedented\" says veteran investigative journalist, John Ware, who has reported on the Troubles since the 1970s.\"If anybody had told me even 10 years ago that there would come a time when the chief constable of the PSNI and the Security Service were at loggerheads, I would have fallen off my stool,\" he says.Trust, state secrecy and the publicBoutcher has a raised a stark question: can the authorities who played a role in the events, including MI5, be trusted to decide whether to tell the public about what happened, when doing so could leave them exposed?He has also indirectly raised this question about the legal system itself - due to its own role in the Stakeknife case.Scappaticci helped create a legal precedent on state secrecy that is routinely cited by the government to this day.In 2003, he sought a judicial review over the then government's refusal to publicly deny media reports that he was Stakeknife.But Scappaticci was bluffing and did not actually want to succeed, since if the government was ordered to tell the truth, he would have been confirmed as Stakeknife. Scappaticci was engaged in a pretence to help shore up his reputation: publicly fighting a legal case, while hoping – and expecting – he would lose.VCG via Getty ImagesMany families of those killed or injured in the Troubles are still fighting through the courtsHowever, the government feared Scappaticci would win because a judge would assume he was not Stakeknife and force ministers to be honest.Jon Boutcher has now confirmed an extraordinary fact: the judge who heard the case did so after being secretly briefed on the real identity of Stakeknife.That judge, the then Lord Chief Justice of Northern Ireland, Lord Carswell, ultimately allowed the government to maintain NCND, creating the legal precedent on the policy.\"The full facts about this and the government's explanation will never be known while it is able to hide behind the shield of NCND,\" Boutcher has said.There is a second extraordinary fact: the government barrister who did the secret briefing was Philip Sales, who as Lord Sales was one of the Supreme Court justices in the Paul Thompson case. This fact was uncovered by the journalist John Ware.This is an issue because it is Lord Sales' ruling in the Thompson case which has a central bearing over whether Scappaticci can be named and more details revealed about what went on, including Lord Sales' own role.I asked the Supreme Court whether, given Lord Sales' role in the Scappaticci matter, if it was appropriate for him to have heard the Thompson case.In a statement, the court said: \"Great care is taken in the selection of the panels which will hear a case at the UK Supreme Court.\"A Justice will not deal with a case where it is considered there is a conflict of interest and individual Justices are careful to ensure that they have none.\"The cases of Seamus Dillon and Sean BrownTwo further cases that touch on the potential release of information about the role of the state during the Troubles are also before the Supreme Court.Troubles-related inquests were shut down in 2024 with the passing of the Legacy Act, which created a new body called the Independent Commission for Reconciliation and Information Recovery (ICRIR) to examine relevant cases, including those being investigated by police.The families of four men who were either killed or injured during the Troubles won a further legal victory, when the Northern Ireland Court of Appeal ruled the government has too much veto power over the disclosure of material by the ICRIR.Lady Chief Justice Siobhan Keegan said that the provision in the Act giving the Northern Ireland secretary \"the final say\" on disclosure of sensitive national security information by the ICRIR would risk undermining public confidence in the body.The UK government's appeal will be ruled on by the Supreme Court in the coming months. The lead respondent in the case is Martina Dillon, whose husband Seamus was killed in 1997.PA WireMartina Dillon's husband Seamus was killed in 1997 by the paramilitary Loyalist Volunteer Force (LVF)The paramilitary Loyalist Volunteer Force (LVF) claimed responsibility. A coroner had opened an inquest on the basis there was evidence of collusion by state authorities, but the inquest was halted by the Legacy Act. No-one has ever been held accountable.The government has also registered an appeal in another key case.Sean Brown was also murdered in 1997 by members of the LVF. The 61-year-old father-of-six was abducted as he locked the gates at a sports club in County Londonderry. There were investigative failures by police and no-one has been brought to justice.PA MediaSean Brown, a father of six, was abducted as he locked the gates at a sports clubDecades later, a coroner issued a summary of secret material stating that \"a number of the individuals linked through intelligence to the murder were agents of the state.\" Sean's family want a public inquiry, and have won judgments over the past two years at the High Court and Court of Appeal. The government, which was found to have acted unlawfully by refusing a public inquiry, has registered an appeal to the Supreme Court on the basis the issue has constitutional significance regarding who should order inquiries.'The state viewed itself as above the law'At its heart, this vast battle over secrecy centres on two core claims by the state: that only the government and MI5 can ultimately be fully trusted on national security, and that their decisions on what information to release are solely about protecting the public.But these claims have been undermined by MI5's actions and omissions in several recent cases, all during the leadership of MI5's current director general, Sir Ken McCallum.A public inquiry into the 2017 Manchester Arena bombing, which killed 22 people, concluded that MI5 had not given an \"accurate picture\" of the key intelligence it held about the suicide bomber who carried out the attack. The inquiry chairman only uncovered what MI5 had done through his own persistent investigations during secret evidence sessions.The government has been resisting calls by families bereaved by the Manchester Arena attack for MI5 officers to be fully included in planned new legislation - known as the Hillsborough Law - that's designed to stop cover-ups and enforce truth-telling by public officials.Getty ImagesA public inquiry into the Manchester Arena bombing concluded that MI5 had not given an \"accurate picture\" of key intelligence it heldAnother ongoing case is an example of how MI5's evidence cannot always be taken at face value: MI5 gave false evidence to three courts about having maintained its NCND secrecy policy in relation to an abusive neo-Nazi agent who attacked his girlfriend with a machete. But MI5 had in fact told me the man was an agent when attempting to prevent me from investigating him. After MI5 apologised, we then showed that inquiries into what happened by MI5 and the government were deficient and unreliable, with further falsehoods provided to the court. This prompted the most senior judge in England and Wales to dismiss MI5's explanations and led the prime minister to order a new investigation, which will report this year.In the Stakeknife investigation, MI5 disclosed key documents years after enquiries began, aer Scappaticci had died and charging decisions had been made, and at a point when the Legacy Act banned police from investigating further. The new material revealed MI5 had greater and earlier knowledge of Stakeknife than detectives had previously been told, including that MI5 had been involved in tasking him. The lead detective said it was a \"significant failure on the part of MI5\". A review commissioned by MI5 found no deliberate wrongdoing.Cover-ups and failures to disclose information have a long history in Northern Ireland. Lord Stevens, recalling his investigations, has said: \"I was misled deliberately, I was criminally obstructed from doing my job by the Royal Ulster Constabulary and military, whilst MI5 failed to disclose information.\"Judge Pomerance, who was senior counsel on another major investigation, concluded bluntly: \"The state viewed itself as above the law\".The battle of bereaved familiesLast July, days before Eugene Thompson died, Jon Boutcher delivered a letter of apology on behalf of PSNI. He apologised for the police's failure to take action that may have prevented Paul Thompson's murder, and for failures in the investigation, including not properly pursuing suspects.Mark Thompson from Relatives for Justice (no relation of Paul and Eugene Thompson) says the apology was \"important\" but that Eugene was by this stage \"very ill\".Thompson familyJust before he died, Eugene Thompson (right) received an apology for police failings over the murder of his brother Paul (left). Their mother Margaret is also picturedMark had watched the Supreme Court hearings with Eugene on a laptop in his hospice and describes the experience as \"tough\". Eugene was \"praying and hoping that before he died the judgment could be made\", Mark says.Bereaved families caught up in these cases have had to battle for decades, trying to fill voids left by the lack of proper investigations by the state.\"You became an investigator, tracking down witnesses. You became an expert in the law in that field. And you fought your own case tooth and nail.\"Eugene Thompson became an \"accidental lawyer and expert in his own case\", he says, as he campaigned for answers about why his brother Paul was murdered.\"I think if we take anything from the legacy of him, it's the example of never giving up.\"Top image credit: PA MediaEmail: security.investigations@bbc.co.ukSignal: @investigation.56Click here to learn how to use SecureDrop, an anonymous whistleblowing tool that works only in the Tor browser and follow the advice to stay secure.BBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. You can now sign up for notifications that will alert you whenever an InDepth story is published - click here to find out how",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Murder and MI5: the extraordinary battle over what stays secret",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/121e/live/0b789990-faab-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-26T00:25:19.000Z",
      "dateModified": "2026-01-26T00:25:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Labour Block Andy Burnham From Standing - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mx4v36?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-01-25T21:33:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·25 Jan 2026,·15 minsLabour Block Andy Burnham From StandingNewscastAvailable for over a yearToday, Andy Burnham has said he is \"disappointed\" after being blocked from standing as a candidate for the upcoming parliamentary by-election in Gorton and Denton by Labour's ruling body.\nAs a directly elected mayor, Burnham had to get approval from Labour's national executive committee (NEC), after he applied to be a candidate on Saturday.\nBut Labour said the party had decided to deny him permission to stand to \"avoid an unnecessary mayoral election, which would use substantial amounts of taxpayers' money and resources\".\nAdam and Chris are here to discuss what it means and what might happen next. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers.\nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nThe presenters were Adam Fleming and Chris. It was made by Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Labour Block Andy Burnham From Standing - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-01-25T21:33:00.000Z",
      "dateModified": "2026-01-25T21:33:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Are ICE immigration agents acting outside the law? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct8bz1?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-01-23T16:16:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·23 Jan 2026,·30 minsAre ICE immigration agents acting outside the law?AmericastAvailable for over a yearDonald Trump came into power with a promise to carry out the “largest mass deportation programme in history”.  One year on, ICE (Immigration and Customs Enforcement) raids in US cities are one of biggest political issues dividing America right now, with questions over how ICE agents are behaving and who they are targeting.\nIn this episode, Anthony, Marianna and Justin look at whether ICE agents are going beyond their remit, and is public opinion starting to turn against the president? \nWe focus on Minneapolis after the killing of 37 year old Renee Nicole Good two weeks ago, who was shot dead by an ICE officer.  Anti-ICE protests have been ongoing within the city, and this week, the Vice President JD Vance who was visiting Minneapolis called for Democrats to co-operate with the Trump agenda.  \nJustin talks to John Sandweg, former Acting Director of ICE under President Obama who gives us his insight into how ICE agents are being vetted and recruited, plus the wider impact of diverting billions of dollars into Trump’s enforcement operations.  \nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Anthony Zurcher, North America Correspondent\n• Marianna Spring, Social Media Investigations Senior Correspondent \nGUEST: \nJohn Sandweg, former Acting Director of ICE under President Obama \nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Purvee Pattni and Laura Cain. The technical producer was Mike Regaard. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Are ICE immigration agents acting outside the law? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-01-23T16:16:00.000Z",
      "dateModified": "2026-01-23T16:16:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Three charged over alleged intifada chants at pro-Palestinian protest",
    "url": "https://www.bbc.com/news/articles/cr571jqdy9ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/157d/live/f802ccc0-fad0-11f0-a21a-e9b091602ead.jpg",
    "tag": "Trending",
    "date": "2026-01-26T16:11:51.000Z",
    "description": "4 hours agoLucy ManningSpecial correspondentGetty ImagesFile photo of police outside the MoJ building during a protest in November 2025Three pro-Pales",
    "body": "4 hours agoLucy ManningSpecial correspondentGetty ImagesFile photo of police outside the MoJ building during a protest in November 2025Three pro-Palestinian demonstrators have been charged with stirring up racial hatred over alleged chants calling for an intifada at a protest in central London last month.The man and two women charged are Abdallah Alanzi, 24, Haya Adam, 21, and Azza Zaki, 60. All are from London.They were charged on Monday with using threatening, abusive or insulting words or behaviour intended to stir up racial hatred or where it was likely to be stirred up.The trio were arrested on 17 December 2025 at a protest outside the Ministry of Justice. They will appear at Westminster Magistrate's Court on 23 February. The Metropolitan Police says its Public Order Crime team considered chants made about an intifada as well as other chanting during the protest.Hours before the protest, the Met and Greater Manchester Police had announced it would take stronger action against chanting at these demonstrations in the aftermath of the Bondi attack in Australia - where two gunmen targeted a Hannukah celebration, killing 15 people and injuring dozens more.  The two forces said they would now start arresting people for chanting \"globalise the intifada\", the Arabic word for \"uprising\".At the time they said: \"The context has changed. Words have meaning and consequence. We will act decisively and make arrests.\"Jewish community groups welcomed the tougher stance as they believed the demonstrations, held regularly since the October 7th 2023 attacks in Israel,  had turned into \"hate marches\" inciting violence against Jewish people.But pro-Palestinian organisations said it was an attempt to suppress freedom of speech and protest.A Crown Prosecution Service spokesperson said: \"Our prosecutors have worked to establish that there is sufficient evidence to bring this case to court and that it is in the public interest to pursue criminal proceedings.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Three charged over alleged intifada chants at pro-Palestinian protest",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/157d/live/f802ccc0-fad0-11f0-a21a-e9b091602ead.jpg"
      ],
      "datePublished": "2026-01-26T16:11:51.000Z",
      "dateModified": "2026-01-26T16:11:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Suella Braverman accuses Tories of betrayal as she defects to Reform UK",
    "url": "https://www.bbc.com/news/articles/c1evq263e49o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5bb7/live/5336e750-fabf-11f0-b385-5f48925de19a.gif",
    "tag": "Trending",
    "date": "2026-01-26T18:41:16.000Z",
    "description": "2 hours agoPaul Seddon,political reporter andKate Whannel,political reporterSuella Braverman says she is joining Reform as 'a better Britain is possib",
    "body": "2 hours agoPaul Seddon,political reporter andKate Whannel,political reporterSuella Braverman says she is joining Reform as 'a better Britain is possible'Former Home Secretary Suella Braverman has accused the Conservatives of \"betrayal\" as she became the latest MP from the party to defect to Reform UK.She is the third sitting Tory MP to join Nigel Farage's party in the last eleven days, and takes Reform's tally of MPs to eight.At a press conference following her defection, Braverman said she had felt \"politically homeless for the best part of two years\" pointing to differences over areas including Brexit and immigration. Her defection comes hot on the heels of Robert Jenrick and Andrew Rosindell, who also left the Conservatives earlier this month. Responding to her defection, the Conservative Party said it was \"always a matter of when, not if, Suella would defect\". \"There are some people who are MPs because they care about their communities and want to deliver a better country. There are others who do it for their personal ambition,\" the spokesman added.The party's initial statement also said: \"The Conservatives did all we could to look after Suella's mental health, but she was clearly very unhappy.\"They later issued a corrected statement which removed the sentence, saying the original lines were \"a draft version\" which had been \"sent out in error\".Braverman said the reference to her mental health was \"a bit pathetic\" and \"more signs of a bitter and desperate party that seems to be in free-fall\".Responding to questions about when she decided to leave the Conservatives, Braverman compared the process to \"a divorce\".\"Gradually there is an erosion of trust and the breakdown of affiliation, love even, if you can call it that,\" she said.She accused the Conservatives of failing on Brexit while delivering \"out-of-control immigration\" and high taxes. She said \"the final straw came in the last few days\" as there appeared to be a \"concentrated effort, a witch hunt to hound out right-wingers\".She urged local Conservative activists in her constituency of Fareham and Waterlooville – who she acknowledged would feel \"upset and disappointed\" – to join her at Reform.Asked about suggestions that Reform was accepting too many former Conservatives, Farage said: \"We need the experience of people who were on the front line – that is the one commodity we are short of.\"A major figure on the right of the party under the last government, Braverman has long been seen as a potential Reform defector at Westminster. But her unveiling as Reform's latest recruit came as a surprise announcement by Farage during an event to launch a party group for military veterans in London.An MP since 2015, Braverman was attorney general under Boris Johnson and became home secretary under Liz Truss in September 2022.She was forced to step down from the role a month later, after it emerged she had sent an official document to a Tory colleague using her personal email.Rishi Sunak re-appointed her to the position just six days later upon entering Downing Street, but sacked her the following year, over an article accusing the Metropolitan Police of bias in the policing of pro-Palestinian protests in London. Farage said he had been talking to Braverman for \"just over a year\" about the possibility of defecting and that she had \"reached the view that actually the centre-right of British politics needs to unify around Reform\".He said her record as home secretary had been \"utterly useless\".\"They all were utterly useless because they were stuck within the ECHR [European Convention on Human Rights],\" he told reporters.\"The government was a failure but she's now prepared to put her hands up and say, 'we got it wrong'.\"The ECHR has been blamed by some politicians for making it harder to deport illegal migrants. The Labour government is in negotiations over how the treaty is interpreted.Braverman said the Conservatives' pledge to leave the convention altogether was \"a lie\".  In addition to the four sitting Conservative MPs who have now switched to Reform, around 20 former Tory MPs have made the move since the general election, including former ministers Nadhim Zahawi, Nadine Dorries and Jake Berry. Henry Smith - one of those ex-MPs to make the switch - said Braverman had tried to \"steer the last government in a Conservative direction\" but had been \"very much stopped in her tracks\". Speaking to Matt Chorley on BBC Radio 5 Live, the former Crawley MP said that while the Conservative leadership \"might be making noises to the right\", many Conservative MPs were \"quite frankly more comfortable in a much more Liberal Democrat position\".Appearing on the same programme, Conservative MP Sir Bernard Jenkin said: \"People like Suella and Rob Jenrick are leaving the Conservative Party just at the time when Kemi is sorting all these things out, and she's beginning to pull us up in the polls. \"Maybe it's because she's doing better that they're leaving.\"Labour Party chair Anna Turley said: \"Nigel Farage is stuffing his party full of the failed Tories responsible for the chaos and decline that held Britain back for 14 years.\"Liberal Democrat deputy leader Daisy Cooper said \"Farage has recruited yet another Conservative minister with selective amnesia - one who complains about broken Britain while conveniently forgetting they helped break it.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Suella Braverman accuses Tories of betrayal as she defects to Reform UK",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5bb7/live/5336e750-fabf-11f0-b385-5f48925de19a.gif"
      ],
      "datePublished": "2026-01-26T18:41:16.000Z",
      "dateModified": "2026-01-26T18:41:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Revolution Bars to enter administration with 2,200 jobs at risk",
    "url": "https://www.bbc.com/news/articles/cly10jjmg92o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8d64/live/d24d6f30-fada-11f0-a21a-e9b091602ead.jpg",
    "tag": "Trending",
    "date": "2026-01-26T17:19:13.000Z",
    "description": "3 hours agoArchie MitchellRevel CollectiveThe owner of Revolucion de Cuba and Peach Pubs is to go into administration, putting as many as 2,200 jobs a",
    "body": "3 hours agoArchie MitchellRevel CollectiveThe owner of Revolucion de Cuba and Peach Pubs is to go into administration, putting as many as 2,200 jobs at risk.Revel Collective, the parent company which has 62 pubs and bars across the UK, put itself up for sale in October after facing what it called \"a continued period of external challenges\".The company said on Monday that discussions with a buyer are \"well advanced\" but it had filed to enter administration, with shareholders in the company to be left with nothing after the sale.Its pubs and bars will stay open through the process, but it has been suspended from trading on London's junior AIM stock exchange.Revel Collective, chaired by former Pizza Express boss Luke Johnson, said administrators will be appointed within 10 days.In a statement, it confirmed the deals being considered will wipe out shareholders and that it was entering administration to \"protect creditors\", such as banks.In December it said it had found \"a significant number\" of potential buyers, and was publicly linked with hospitality groups including bar and club owner Neos Hospitality.An announcement on a sale is expected in the coming days.When it put itself up for sale last autumn, Revel Collective blamed  \"challenging economic conditions\" and decisions taken by Chancellor Rachel Reeves in Labour's first Budget after coming to power in 2024.That October, the chancellor increased national insurance contributions for employers and announced a rise in the minimum wage. Revel Collective also hit out at Labour's decision to increase duties on spirits, which it said will cost more than £4m each year across the group.A turnaround plan, which saw it shut 15 loss-making bars, was not enough to revive its fortunes, the company said.It is the latest high street firm to sound the alarm over higher taxes and staffing costs, with figures published on Monday revealing a surge in closures at the end of 2025.Data from consumer research firm NIQ showed that 382 hospitality firms shut up shop in the final three months of the year, more than four each day. The UK ended the year with 98,914 hospitality sites, it said.Karl Chessell, director of hospitality operators and food at NIQ, said \"relentless increases in operating costs\" are taking a severe toll on the sector.Pubs, restaurants and other hospitality firms have warned a crisis facing the sector will deepen when changes to how business rates are calculated come into effect in April.The chancellor is expected to water down the planned changes for pubs, which industry groups warned would see mass closures without a government rethink.She is facing pressure to go further and ensure any package of support benefits the whole hospitality sector, not only pubs.The Treasury has been approached for comment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Revolution Bars to enter administration with 2,200 jobs at risk",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8d64/live/d24d6f30-fada-11f0-a21a-e9b091602ead.jpg"
      ],
      "datePublished": "2026-01-26T17:19:13.000Z",
      "dateModified": "2026-01-26T17:19:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sadie Frost says Mail put 'price on my head' for stories",
    "url": "https://www.bbc.com/news/articles/c0jv6le6l3po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1405/live/c2201bd0-faee-11f0-a47f-d352a7d9988a.jpg",
    "tag": "Trending",
    "date": "2026-01-26T18:03:13.000Z",
    "description": "2 hours agoMaia DaviesYui Mok/PA WireFrost became emotional in the witness box and said it had been \"distressing\" to relive the eventsSadie Frost said",
    "body": "2 hours agoMaia DaviesYui Mok/PA WireFrost became emotional in the witness box and said it had been \"distressing\" to relive the eventsSadie Frost said the Daily Mail put a \"price on my head\" for stories as she told a court she had been \"violated\" by journalists allegedly hacking her voicemail for information.The actress became emotional as she gave evidence in her case against the paper's publisher - which includes a claim that a reporter learned about her terminated pregnancy through a private investigator.She told the High Court she knew \"100%\" that other stories had been obtained through hacking because they matched her voicemails \"word for word\". In a written statement, she said the alleged activity had made her believe she \"could not trust anyone\". Associated Newspapers Limited (ANL) has denied all wrongdoing in relation to Frost and and six other claimants, including Prince Harry. In court, Frost accused Mail reporters of bugging a call in 2002 to her then-husband, actor Jude Law, which revealed that their two-year-old daughter had swallowed part of an ecstasy tablet at a children's party. Frost broke down in tears as she recalled the press attention that followed.She had been \"mortified\" when she found out her landline had allegedly been listened to, she said in her statement, adding that it had brought \"suffering\" to her and her children.Frost and the other claimants have accused Associated Newspapers of \"grave breaches of privacy\" over a 20-year period.Her claim relates to 11 articles and two \"episodes\" of alleged unlawful information gathering for articles that were not published, including one about her pregnancy.David Sherborne, representing Frost, said she had discovered she was pregnant in 2003, which was unplanned and later terminated. He said she had only disclosed the termination to the father, Jackson Scott, and \"maybe\" a close friend.The barrister claimed Katie Nicholl, then the Mail on Sunday's showbiz editor, \"must\" have found out about the situation through unlawful information gathering. He added that her notes referred to a private investigator who had charged her £400.Antony White KC, for the publisher, said the payment was not linked to the pregnancy and that Nicholl had been told about the pregnancy by a freelance journalist with sources close to Frost.During cross-examination, Frost told the court: \"There was obviously a price on my head. The Daily Mail had said they were interested in Sadie Frost.\"When White suggested that members of Frost's family had provided information to the press and this would \"likely\" have encouraged her friends to do the same, Frost said she did not agree.Concluding her evidence, she said it had been \"demanding and very distressing having to relive what I didn't want to relive\".She said: \"For my children to see what I've been going through, it makes me sad - but they've been so supportive, and I've done it for them.\"Frost said in her written statement that was \"so angry\" the publisher \"thought it was okay to profit from someone going through so much pain without a thought for me or my children\".She said she did not know she had a potential claim against the publisher until 2019 and that ANL \"must be held accountable\".White argued that Frost's claims were \"wholly without any foundation in the evidence before the court\". He said the stories were sourced \"entirely legitimately\" and that her social circle was \"known to be 'leaky'\", with family members regularly giving information to the press.He said the claimants are \"clutching at straws\" and that the claims have been brought too late.Privacy cases must usually be brought within six years of the alleged breach, unless victims can show they could not bring a case at the time. The other claimants in the case against ANL are:Sir Elton John and his husband David FurnishActress Liz HurleySir Simon Hughes, the former Liberal Democrat MPBaroness Doreen Lawrence, a campaigner whose son Stephen Lawrence was murdered in a racist attack in south London in 1993They have accused ANL of \"clear, systematic and sustained use of unlawful information gathering\" for stories between 1993 and \"beyond\" 2018, including through private investigators and blagging.ANL has denied allegations of unlawful information gathering.The case continues and is expected to last nine weeks.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sadie Frost says Mail put 'price on my head' for stories",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1405/live/c2201bd0-faee-11f0-a47f-d352a7d9988a.jpg"
      ],
      "datePublished": "2026-01-26T18:03:13.000Z",
      "dateModified": "2026-01-26T18:03:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "David and Victoria Beckham seen in Paris after Brooklyn row",
    "url": "https://www.bbc.com/news/articles/cn9zqwvnx9ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/90b3/live/071bee00-fade-11f0-a47f-d352a7d9988a.jpg",
    "tag": "Trending",
    "date": "2026-01-26T18:48:40.000Z",
    "description": "1 hour agoSteven McIntoshEntertainment reporterThe Beckham family has made its first joint public appearance since an Instagram post from Brooklyn Bec",
    "body": "1 hour agoSteven McIntoshEntertainment reporterThe Beckham family has made its first joint public appearance since an Instagram post from Brooklyn Beckham confirmed a rift in the family.Last week, Brooklyn said in a statement he had no wish to reconcile with his family and accused his parents of attacking him and his wife in the press.On Monday, Sir David and Lady Beckham were joined by three of their four children - Romeo, Cruz and Harper - during an appearance at Haute Couture Fashion Week in Paris.It comes before Lady Beckham received a new accolade by becoming a Knight of the Order of Arts and Letters.The honour is awarded by the French Ministry of Culture, and recognises the individual contributions of artists, writers, and cultural figures to the arts and literature.The fashion designer and former Spice Girl is receiving an honour that has previously been given to actresses Zoe Saldaña and Selena Gomez, director Denis Villeneuve and actor Jude Law.Although this is the Beckhams' first appearance as a family since Brooklyn's Instagram statement, several of them have been pictured individually in recent days.Lady Beckham attended her bandmate Emma Bunton's 50th birthday over the weekend, while Sir David appeared at the World Economic Forum in Davos last week.Meanwhile, Romeo appeared at US designer Willy Chavarria's show in Paris, while Cruz announced a mini-tour with his band in the UK and Europe.In his Instagram post, Brooklyn Peltz Beckham said he does not want to \"reconcile\" with his family and accused his parents of \"attacking\" him and his wife Nicola Peltz Beckham in the press.Brooklyn, the Beckhams' eldest child, alleged his parents tried \"endlessly to ruin\" his relationship, and accused his mother Victoria of hijacking their first wedding dance.The Beckhams have not commented on the row, but Sir David, speaking generally about social media in Davos on Tuesday, said that children are \"allowed to make mistakes\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "David and Victoria Beckham seen in Paris after Brooklyn row",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/90b3/live/071bee00-fade-11f0-a47f-d352a7d9988a.jpg"
      ],
      "datePublished": "2026-01-26T18:48:40.000Z",
      "dateModified": "2026-01-26T18:48:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Google to pay $68m to settle lawsuit claiming it recorded private conversations",
    "url": "https://www.bbc.com/news/articles/c4g38jv8zzwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/502e/live/c4d06200-fade-11f0-8165-918f1a8ba904.jpg",
    "tag": "Trending",
    "date": "2026-01-26T18:37:42.000Z",
    "description": "2 hours agoLaura CressTechnology reporterGetty ImagesGoogle has agreed to pay $68m (£51m) to settle a lawsuit claiming it secretly listened to people'",
    "body": "2 hours agoLaura CressTechnology reporterGetty ImagesGoogle has agreed to pay $68m (£51m) to settle a lawsuit claiming it secretly listened to people's private conversations through their phones.Users accused Google Assistant - a virtual assistant present on many Android devices - of recording private conversations after it was inadvertently triggered on their devices.They claimed the recordings were then shared with advertisers in order to send them targeted advertising.The BBC has contacted Google for comment. But in a filing seeking to settle the case, it denied wrongdoing and said it was seeking to avoid litigation.Google Assistant is designed to wait in standby mode until it hears a particular phrase - typically \"Hey Google\" - which activates it.The phone then records what it hears and sends the recording to Google's servers where it can be analysed.People use it for various reasons, ranging from simple questions about the weather to interacting with smart devices like lights and televisions. The firm says it does not send audio anywhere while it is in standby mode.But the lawsuit claimed Google Assistant would sometimes turn on by mistake - the phone thinking someone had said its activation phrase when they had not - and recorded conversations intended to be private.They alleged the recordings were then sent to advertisers for the purpose of creating targeted advertising.Class actionThe proposed settlement was filed on Friday in a California federal court, and requires approval by US District Judge Beth Labson Freeman.The claim has been brought as a class action lawsuit rather than an individual case - meaning if it is approved, the money will be paid out across many different claimants.Those eligible for a payout will have owned Google devices dating back to May 2016.But lawyers for the plaintiffs may ask for up to one-third of the settlement - amounting to about $22m in legal fees.It follows a similar case in January where Apple agreed to pay $95m to settle a case alleging some of its devices were listening to people through its voice-activated assistant Siri without their permission.The tech firm also denied any wrongdoing, as well as claims that it \"recorded, disclosed to third parties, or failed to delete, conversations recorded as the result of a Siri activation\" without consent.More from the BBC",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Google to pay $68m to settle lawsuit claiming it recorded private conversations",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/502e/live/c4d06200-fade-11f0-8165-918f1a8ba904.jpg"
      ],
      "datePublished": "2026-01-26T18:37:42.000Z",
      "dateModified": "2026-01-26T18:37:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK loses measles elimination status",
    "url": "https://www.bbc.com/news/articles/cgjw0xegxglo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bc61/live/c0e563a0-fac7-11f0-9951-335577236554.jpg",
    "tag": "Trending",
    "date": "2026-01-26T15:04:44.000Z",
    "description": "5 hours agoNick TriggleHealth correspondentThe UK has lost its measles elimination status, the World Health Organization has announced.The move was ba",
    "body": "5 hours agoNick TriggleHealth correspondentThe UK has lost its measles elimination status, the World Health Organization has announced.The move was based on the spread of cases in 2024 when there were 3,600 suspected cases.Elimination status means there is no sustained transmission so this decision was largely expected, given the scale of the outbreaks in 2024.There were more than 1,000 cases last year as well. The move is also a reflection of the fact vaccination rates are below the 95% threshold required to achieve herd immunity - when enough people in a community are vaccinated against a disease, making it hard for the pathogen to spread.The UK was first declared measles-free in 2017, but lost the status two years later, before regaining it after spread of the virus was almost halted completely in 2021 - although that was mainly because social distancing during the pandemic.Outbreaks in late 2023 meant measles started spreading more quickly again, leading to the surge in cases in 2024.Vaccination uptake at the end of 2024 was 92% for the first dose and just below 85% for the second dose.Dr Vanessa Saliba, consultant epidemiologist at UKHSA, said: \"Infections can return quickly when childhood vaccine uptake falls - measles elimination is only possible if all eligible children receive two MMRV doses before school.\"The NHS is making vaccination easier, including offering the second MMRV dose earlier at a new 18-month appointment to boost uptake and support elimination goals.\"She said older children and adults could still get vaccinated as the NHS offered catch-up jabs.Dr Bharat Pankhania, from the University of Exeter, said: \"Measles is an infection that can be prevented by vaccine - and it's extremely concerning that in the UK we now have pockets of low or no vaccine uptake. \"We urgently need to remedy this situation.\"Pankhania said that needed to include easier access to GPs, more health visitors who can immunise babies in their homes and countering wrong information about vaccine safety.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK loses measles elimination status",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bc61/live/c0e563a0-fac7-11f0-9951-335577236554.jpg"
      ],
      "datePublished": "2026-01-26T15:04:44.000Z",
      "dateModified": "2026-01-26T15:04:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Over 700,000 graduates out of work and on benefits, analysis suggests",
    "url": "https://www.bbc.com/news/articles/c1klry2rjm0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9b63/live/a32388a0-facd-11f0-a21a-e9b091602ead.jpg",
    "tag": "Trending",
    "date": "2026-01-26T16:03:08.000Z",
    "description": "4 hours agoBeth RoseDisability affairs reporterMore than 700,000 university graduates are out of work and claiming welfare benefits, new analysis by a",
    "body": "4 hours agoBeth RoseDisability affairs reporterMore than 700,000 university graduates are out of work and claiming welfare benefits, new analysis by a think tank suggests.The Centre for Social Justice (CSJ) said 400,000 graduates were not in work and claiming Universal Credit, according to the latest statistics.There were 240,000 graduates who said they could not work due to health reasons, the think tank said, with that figure having more than doubled since 2019.The government says it is investing money in getting young people into work, and has commissioned a review into \"what's holding the younger generation back\".The CSJ used the Office for National Statistics' Labour Force Survey, in combination with data from the Department for Work and Pensions, to analyse figures from before and after the Covid pandemic.It said 707,000 graduates aged 16 to 64 were out of work and claiming one or more benefits in 2024, an increase of more than 200,000 - or 46% - since 2019.The number of those claiming Universal Credit was 400,000, while almost 240,000 of the 700,000 said they were off work due to sickness – a figure which has more than doubled from 117,000 since 2019, the CSJ said.Universal Credit is a means-tested benefit and aims to help with living costs for people of working age who are on a low income, out of work, or unable to work. About 8.3 million people claimed the benefit in October 2025, according to government figures.The CSJ, which was founded by Conservative MP Sir Iain Duncan Smith, said about 110,000 graduates under the age of 30 now claim at least one benefit without being in work.The latest graduate labour market statistics, published in June, suggest 88% of working-age graduates in England were in employment in 2024. The figure for non-graduates was 68%.But Sir Iain said the out-of-work figures showed the consequences of an education system \"obsessed\" with university, which he said overlooked vocational training and a changing job market.The CSJ said in its report that one in three British students on a university course receive vocational training.It also said level four apprentices earn £5,000 more on average than university graduates after five years.Daniel Lilley, a senior researcher with the CSJ, said young people needed to be given \"the opportunity to succeed and fuel key industries with the domestic skills they need to grow\".A government spokesperson said: \"Graduate inactivity is at its lowest rate on record, but we're determined to go further to support young people into work and gain the skills they need to succeed. \"Through our new Jobs Guarantee, we're helping young people who are out of work find paid placements, with employers such as E.ON, JD Sports, Tesco and TUI having already pledged their support.\"We're investing £1.5bn to get hundreds of thousands of young people earning or learning, including through an expansion of apprenticeships and training.\"We've also commissioned the former Health Secretary Alan Milburn to lead a review to get to the root of what's holding the younger generation back, because we believe in tackling this complex issue with urgency.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Over 700,000 graduates out of work and on benefits, analysis suggests",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9b63/live/a32388a0-facd-11f0-a21a-e9b091602ead.jpg"
      ],
      "datePublished": "2026-01-26T16:03:08.000Z",
      "dateModified": "2026-01-26T16:03:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nigella Lawson to replace Prue Leith on The Great British Bake Off",
    "url": "https://www.bbc.com/news/articles/cgk80pzxkexo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f381/live/7d93baa0-faba-11f0-b385-5f48925de19a.jpg",
    "tag": "Trending",
    "date": "2026-01-26T13:10:34.000Z",
    "description": "7 hours agoSteven McIntoshEntertainment reporterTV chef Nigella Lawson will replace Dame Prue Leith on The Great British Bake Off, broadcaster Channel",
    "body": "7 hours agoSteven McIntoshEntertainment reporterTV chef Nigella Lawson will replace Dame Prue Leith on The Great British Bake Off, broadcaster Channel 4 has confirmed.Dame Prue has been a judge on the reality baking competition since 2017, but announced last week that she would leave the series adding: \"Now feels like the right time to step back\".Lawson, who will join Paul Hollywood as a judge, said in a statement: \"I'm uncharacteristically rather lost for words right now.\"Of course it's daunting to be following in the footsteps of Prue Leith and Mary Berry before her, great dames both, but I'm also bubbling with excitement.\"She added: \"The Great British Bake Off is more than a television programme, it's a National Treasure – and it's a huge honour to be entrusted with it.\"I'm just thrilled to be joining the team and all the new bakers to come, I wish the marvellous Prue all the best, and am giddily grateful for the opportunity!\"Dame Prue said she was \"thrilled\" that Nigella would be taking over her role in the tent. \"She's sassy, fun and she knows her onions - and her croissants, cake and crumble,\" Dame Prue added.Channel 4 controller Ian Katz said the broadcaster was \"incredibly excited about the marriage of two great British icons: Bake Off and Nigella\".Dame Prue was hired for Bake Off after the series jumped from the BBC to Channel 4 in 2016.She replaced Dame Mary, who left the show along with presenters Mel Giedroyc and Sue Perkins after the move.The programme will return for its 17th series later this year, with Lawson and Hollywood alongside current hosts Alison Hammond and Noel Fielding.Writing after Lawson's appointment was rumoured last week, the Guardian's Stuart Heritage said that The Great British Bake Off has \"lost its way\" and \"become slightly long in the tooth over the last half decade or so\".He added Lawson would give the show a shot in the arm, writing: \"She is spectacularly British, and manages to balance the sort of familiarity that will reassure existing viewers with a level of international first-name recognition that might even end up growing the audience.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nigella Lawson to replace Prue Leith on The Great British Bake Off",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f381/live/7d93baa0-faba-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-26T13:10:34.000Z",
      "dateModified": "2026-01-26T13:10:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mahmood unveils plans to reform 'broken' policing in England and Wales",
    "url": "https://www.bbc.com/news/articles/cp37lryxq4eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/63db/live/047fc7b0-fad0-11f0-a422-4ba8a094a8fa.png",
    "tag": "Trending",
    "date": "2026-01-26T19:08:29.000Z",
    "description": "Massive overhaul of England and Wales policing announced 1 hour agoDaniel Sandford and Thomas MackintoshUK correspondentEPAThe home secretary has anno",
    "body": "Massive overhaul of England and Wales policing announced 1 hour agoDaniel Sandford and Thomas MackintoshUK correspondentEPAThe home secretary has announced a blueprint for reforming what she called the \"broken\" policing model in England and Wales.Shabana Mahmood confirmed the shake-up will create a new National Police Service (NPS) to fight the most complex cross-border crime and could also see the number of local forces in England and Wales cut by about two-thirds.She told the House of Commons she also intends to make better use of technology - including the \"largest-ever rollout of facial recognition\". \"This government's reforms will ensure we have the right policing in the right place,\" Mahmood said.The home secretary told Parliament that Monday's 106-page white paper represented \"the most significant changes to policing in this country in nearly 200 years\".As part of the changes, Home Office is funding 40 more Live Facial Recognition vans after the technology proved successful in South Wales and London, making them available in all parts of England and Wales. There are also plans to set up a new National Centre for AI in policing. The idea is to develop new AI tools for police officers to help with things like going through CCTV footage and transcribing and redacting documents.Mahmood previously unveiled plans in November to get rid of elected Police and Crime Commissioners, and recently spoke of plans to create a National Police Service, referred to as the British FBI, which she said will free up forces to tackle everyday crime - plans which are now confirmed.The proposed new NPS will bring together the existing National Crime Agency (NCA) and Counter Terrorism Policing, as well as take in some functions currently carried out by the National Police Chiefs' Council (NPCC), the National Police Air Service (NPAS), and the College of Policing. It was also confirmed that the power to sack chief constables will return to the home secretary, and that a a licence to practise for police officers - similar to the one for doctors - would be created.On the merging of police forces, the Home Office said the precise number and nature of each force will be the subject to a review that will report back to Mahmood in the summer.Labour's Avon and Somerset Police and Crime Commissioner Clare Moody welcomed the review – but urged caution.She told the BBC: \"There does need to be careful analysis of what this will deliver. Not just for numbers, but how this will this support our neighbourhoods.\"In response, Conservative shadow home secretary Chris Philp said the government's statement \"was striking for what it did not say\", pointing at falling national police numbers since Labour came to power.  He also told the Commons the Tories would oppose the plans to merge forces.Philp said: \"Her plan includes mandating the merger of police forces, and briefings over the weekend suggest a reduction from 43 down to 10 or 12\".  \"Such huge forces will be remote from the communities they serve,\" he said. \"Resources will be drawn away from villages and towns towards large cities.\"Home Office sources insist that reducing the number of forces will not make policing less local, and its focus is on reducing duplication and the huge disparities in performance between forces. Scotland merged its eight forces in April 2013 to create Police Scotland. The Police Service of Northern Ireland (PSNI) was established in November 2001. It replaced the Royal Ulster Constabulary (RUC) as part of the Good Friday Agreement reforms.HM chief inspector of constabulary, Sir Andy Cooke, said the \"ambitious set of reforms is welcome and required\".National Police Chiefs' Council chairman Gavin Stephen said having a national police service in the form of the NPS would consolidate money and decision making, and was \"really important\". \"You've got rapidly changing new technologies which show huge promise, then you can't get them rolled out because there are too many decision makers in the system,\" he said.Mahmood told Parliament the NPS will be run by a National Police Commissioner accountable to the home secretary. Officials say that they hope to have the NPS fully operational some time in the next parliament.Supporting the proposed new NPS and its wide remit, Graeme Biggar, the director general of the National Crime Agency said: \"The threat is changing, it is becoming more complex and more interconnected. \"Terrorism, hostile state threats, and organised crime gangs increasingly overlap.\"However, representative body the Police Federation, said that \"fewer forces alone will not guarantee better policing\". The body's national chair Tiff Lynch said it was \"particularly concerned about the concept of a 'licence to practise'\" for police officers. A Home Office source told the BBC: \"The charge rate for home burglary is 2.8% Hertfordshire and 13% in South Wales. Where you live determines the service you get from your force.\"Mahmood's new proposals are titled \"From Local to National: A New Model for Policing\" and the ambition is to provide a police service council ward by council ward.\"Getty ImagesA recent trial of Live Facial Recognition technology in Croydon has helped cut robbery and shoplifting and led to more than 100 arrests, according to the MetThe white paper says: \"A system designed in the 1960s, based around 43 local police forces, is no longer fit for purpose.\"In order to help local police officers the government is promising to cut \"excessive\" bureaucracy so that officers are no long \"fighting crime with one hand tied behind their backs\".Officials hope to pass the legislation to make police mergers more straightforward in this parliament and to get through at least one \"pathfinder\" merger before the next election.But they concede the majority of mergers would happen in the next parliament.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mahmood unveils plans to reform 'broken' policing in England and Wales",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/63db/live/047fc7b0-fad0-11f0-a422-4ba8a094a8fa.png"
      ],
      "datePublished": "2026-01-26T19:08:29.000Z",
      "dateModified": "2026-01-26T19:08:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Asylum seeker found guilty of raping woman, 18, in Nottinghamshire park",
    "url": "https://www.bbc.com/news/articles/clyw6vg79dgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4d0a/live/13976350-fad2-11f0-a21a-e9b091602ead.jpg",
    "tag": "Trending",
    "date": "2026-01-26T17:40:48.000Z",
    "description": "3 hours agoPA MediaSheraz Malik was convicted by a jury at Birmingham Crown CourtAn asylum seeker has been found guilty of two counts of raping an 18-",
    "body": "3 hours agoPA MediaSheraz Malik was convicted by a jury at Birmingham Crown CourtAn asylum seeker has been found guilty of two counts of raping an 18-year-old woman in a park in Nottinghamshire.A trial at Birmingham Crown Court heard the woman had been drinking at Sutton Lawn park in Sutton-in-Ashfield when she was attacked by Sheraz Malik, shortly after being raped by another man he was with, who has yet to be identified.Malik, 28, had claimed the sex was consensual, but the jury returned unanimous guilty verdicts on two counts of rape and a not guilty verdict on a third.It can be now reported that Malik is an asylum seeker who was born in Pakistan and lived in Italy, Germany and France before coming to the UK.Judge Simon Ash KC adjourned the case for a mention hearing on 6 February so a date for sentencing Malik - who lived at an address in Bath Street in Sutton-in-Ashfield at the time - could be fixed.A reporting restriction was put in place at Nottingham Crown Court in September last year, preventing any mention of the defendant's immigration status until the trial had concluded.Police said another suspect was still being \"relentlessly\" sought in relation to the case.Nottinghamshire Live reported that the case had prompted protests in the town with Lee Anderson, Reform UK MP for Ashfield, posting about it on social media.After the MP highlighted the suspect's background on his Facebook and X accounts, demonstrators gathered to demand tighter rules on immigration.Counter-protesters also turned out, but media outlets in attendance including the BBC reported these were outnumbered.Protests related to the case were held last summerWarning: This article includes details that some readers may find distressingProsecution counsel Nicholas Corsellis KC previously told the court the woman had been drinking at the park with a male friend, and was drunk when she met Malik and a group of other men, who she had never seen before.Her friend asked the group to \"look after\" her while he went to meet another friend and one of Malik's associates took the woman to an isolated area of the park so she could go to the toilet, the court heard.Corsellis said: \"The first man forcibly raped her before bringing her back to the group.\"The defendant then decided he wished to have sex with her and took his turn to take her to a secluded spot, where he physically struck her while raping her.\"The jury were told Malik had grabbed her by the neck and hair as he raped her, and afterwards she sent a Snapchat message to a friend saying \"please help me\".\"The one you told to look after me tried to rape me... and the one with the black T-shirt,\" the message said.\"Please help, I can't cope, I feel like killing myself.\"Corsellis told the jury that the complainant was \"alone, drunk and was obviously a vulnerable person\".GoogleThe woman told police she was attacked in Sutton Lawn park in NottinghamshireMalik, who gave evidence in English during the trial, said he had been playing cricket with a group of other men and smoking cannabis in the park before the attack.He denied he had slapped her at any point and claimed the woman had told him \"I really like you\" and \"I really enjoyed it\".Later in his evidence, Malik was asked why a different name had been used to book him a coach ticket to leave the Nottinghamshire area after the attack.He said a friend had booked the ticket for him, adding that the Home Office was \"giving me £50 for every week\".Addressing Malik in the dock, the judge said: \"You have been convicted of very serious charges and I will need to sentence you in due course.\"The case will next be listed on 6 February to fix a sentence date.\"I have ordered a pre-sentence report to assess the level of dangerousness. You must engage with the probation service when they seek to engage with you.\"You will be remanded into custody at this stage.\"In a statement after the sentencing, Nottinghamshire Police confirmed Malik was a Pakistani national who followed proceedings through a Pashto interpreter.The force said the investigation remained a priority.Det Insp Nicole Milner said: \"As is always the case for investigations of this nature, there are many people involved and they have all played a part to bring Malik to justice.\"I particularly want to acknowledge the work of Det Con Malgorzata Kacprzycka and Det Sgt Barry Haines, who have been crucial in bringing Malik to justice.\"Above all, I also want to acknowledge the bravery and resilience of the victim.\"She has shown great courage throughout and helped us to build a very strong case against Malik, whose version of events lacked credibility from the start.\"As a result of her evidence, the jury was able to see through his lies and to convict him on three counts of rape.\"More on this storyRelated internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Asylum seeker found guilty of raping woman, 18, in Nottinghamshire park",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4d0a/live/13976350-fad2-11f0-a21a-e9b091602ead.jpg"
      ],
      "datePublished": "2026-01-26T17:40:48.000Z",
      "dateModified": "2026-01-26T17:40:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]