[
  {
    "title": "Housebound",
    "url": "https://www.bbc.co.uk/iplayer/episode/m00248vd/housebound?at_mid=ufxtMosb0P&at_campaign=Housebound&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m00248vd&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Housebound&at_bbc_team=BBC&at_creation=film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0jxpgzt.jpg",
    "tag": "Trending",
    "date": "2024-10-21T00:21:04.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeHouseboundHouseboundContains strong language, graphic violence and some upsetting scenes.A young woman is placed under house arrest in her childhood home. A series of strange goings-on lead her to suspect that something evil may be lurking within its walls. Duration1h 46mFirst shown2014Available for 9 monthsWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesIn FabricMarianne Jean-Baptiste stars. A killer dress that doesn’t just turn heads, it takes lives1h 50mHalloweenThe trick is to stay alive. Jamie Lee Curtis stars in John Carpenter's iconic horror1h 26mThe HauntingSceptic or believer? You may not believe in ghosts... but you can't deny terror1h 47mLet It SnowThey were warned. A thrill-seeking couple fight for survival against nature and a killer1h 21mGhost StoriesBe careful what you believe in. A supernatural skeptic faces a trio of terrifying tales1h 31mMiseryShe's his number-one fan. Adaptation of Stephen King's terrifying tale, stars Kathy Bates1h 42mCarrieYou're invited to the ultimate prom... Sissy Spacek stars in Stephen King's iconic horror1h 34mHis HouseWhen ghosts follow, they never leave. A refugee couple are tormented by a sinister force1h 25mCat PeopleA woman's mysterious origins hide a curse which threatens to destroy those close to her.1h 10mHorror ExpressA frozen creature runs amok onboard the Trans-Siberian Express.1h 24mScreamDo you like scary movies? The Wes Craven's franchise that redefined horror1h 42mEscape RoomFind the clues or die. For six strangers, their darkest secret may be the key to survival1h 33m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Housebound",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0jxpgzt.jpg"
      ],
      "datePublished": "2024-10-21T00:21:04.000Z",
      "dateModified": "2024-10-21T00:21:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Big Cases - The Bodies in the Suitcases",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002lsdp?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0m9v1bc.jpg",
    "tag": "Trending",
    "date": "2025-10-24T18:30:00.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeThe Big CasesThe Bodies in the SuitcasesThe Big Cases - The Bodies in the SuitcasesContains some upsetting scenes.When two suitcases are abandoned by a man behaving strangely on a bridge in Bristol, the shocking contents lead police to a brutal double murder scene. Duration29 minsFirst shown24 Oct 2025Available for 11 monthsWatchlistAudio DescribedSign LanguageEpisodesEpisodes EpisodesThis episodeThe Bodies in the SuitcasesMurdered by his GrandparentsThe tragic case of two-year-old Ethan who was abused and killed by his grandparents.29 minsThe Sycamore Gap - From Roots to RuinAn ancient tree, symbolising a community, is chopped down overnight. Who did it and why?26 minsThe Aristocrat, the Convict and the Missing BabyAn aristocrat and her convict partner go on the run with their newborn, ending in tragedy.29 minsThe Predator Who Fled to ParadiseThe shocking tale of a predator who fled to paradise for almost three decades.25 minsThe Bus Stop MurderThe tragic story of a schoolgirl who was stabbed to death in a row about a teddy bear.27 minsNeighbour, Friend, KillerWendy Buckney knew about her neighbour's past but wanted to give him a second chance.21 minsThe Mistaken Identity Murders The shocking story of two innocent teenagers murdered in a case of mistaken identity.30 minsMy Husband the MonsterThe shocking story of Gisele Pelicot, raped by strangers her husband invited to abuse her.29 minsTortured Behind Closed DoorsThe tragic story of Sara Sharif who was brutally killed by her father and stepmother.35 minsStabbed After SchoolThe shocking story of how a teenage relationship ended in murder. 28 minsTrying to Kill HollyThe case of a plot to kidnap, rape, and murder TV presenter Holly Willoughby.16 minsThe Abuser HeadteacherThe story of a respected head who abused his power and became a convicted sex offender.29 minsCrushed: The Six Year NightmareSix years after surviving a horror smash, Monika died. It was time for justice, again.21 minsThe House Party MurderHow a house party turned into a murder scene - the fatal stabbing of Mikey Roynon.28 minsKiller In The AtticWhen a man is stabbed to death outside a nightclub, armed police search for his killer.25 minsThe Dance Floor MurderThe story of footballer Cody Fisher who was stabbed to death in a nightclub in Birmingham.26 minsThe Executioner Next DoorThe true story of the Army’s killer agent inside the IRA.\n25 minsThe Nottingham AttacksIn the summer of 2023, the lives of three families changed forever.29 minsHeld Captive And Left To DieShakira Spencer was tortured and starved by people she considered friends.23 minsKilled In The ParkBrianna Ghey was stabbed to death - two teenagers tried to get away with murder.26 minsThe Student Who Never Came HomeKidnapped and murdered while on a gap year in France. Is it finally time for justice?25 minsThe Doping WardThe hospital unit where patients were drugged to keep them 'quiet and compliant'.26 minsKilled By My BoyfriendThe story of a young mum killed by her boyfriend of eight weeks.22 minsThe Commons CriminalThe MP who rose from obscurity to being imprisoned for fraud. The story of Jared O'Mara.23 minsThe Missing MumLinda Razzell was murdered by her husband in 2002 - will he now reveal where her body is?22 minsDeadly InfluenceThe story of a social media influencer, her mum and a murder plot.26 minsUnmasking a FugitiveThe story of Nicholas Rossi, the US fugitive who came to the UK with a new identity.30 minsKilled on DutyThe story of how a handcuffed prisoner shot dead Sgt Matt Ratana in 2020.21 minsThe Killing in the LaneLilia Valutyte died from a single stab wound in her chest. Who killed the nine-year-old?17 minsKilled on Christmas EveElle Edwards was shot dead as she celebrated at Christmas in a murder that shocked the UK32 minsThe Sunshine ScammerThe bogus travel agent who conned hundreds of holidaymakers and her own family.28 mins30 Years For JusticeNikki Allan's murder shocked Sunderland. Why did it take so long to catch her killer?26 minsCaught In The CrossfireNine year old Olivia Pratt-Korbel was killed when shots were fired into her family home.28 minsThe Lie That Destroyed a TownThe story of false accusations about being the victim of a grooming gang.30 minsHomegrown TerroristCould the Manchester Arena bombing have been stopped?24 minsPagination controlsPrevious1Page 1 of 22Page 2 of 2Next",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Big Cases - The Bodies in the Suitcases",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0m9v1bc.jpg"
      ],
      "datePublished": "2025-10-24T18:30:00.000Z",
      "dateModified": "2025-10-24T18:30:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The Global Story - If China attacked Taiwan, what would Trump do? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct7178?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mc0hvk.jpg",
    "tag": "Trending",
    "date": "2025-10-27T10:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·27 Oct 2025,·26 minsAvailable for over a yearPresident Trump is in Asia this week to strike deals with several countries, including with China. \nOne of the big questions overshadowing the trip is Taiwan’s future. China has long vowed to \"reunify\" with self-governing Taiwan and has not ruled out the use of force.  \nOn Sunday, Secretary of State Marco Rubio said the US wouldn’t abandon the island in exchange for a favourable deal with China. But a tug of war has been playing out inside the Trump administration over whether a military battle for Taiwan – if China did try to seize it – would be in America’s best interests.  \nWe speak to writer and analyst James Crabtree about what to expect from Trump’s visit to Asia and where Taiwan goes from here. \nProducers: Viv Jones and Xandra Ellin \nExecutive producer: James Shield \nMix: Travis Evans \nSenior news editor: China Collins \nImage: Taiwanese people observe the changing of honor guards in Liberty Square in Taipei. Ritchie B Tongo/EPA-EFE/REX/Shutterstock.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Global Story - If China attacked Taiwan, what would Trump do? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mc0hvk.jpg"
      ],
      "datePublished": "2025-10-27T10:00:00.000Z",
      "dateModified": "2025-10-27T10:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Epping Sex Offender Arrested, But Has The Damage Been Done? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mby30y?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-10-26T14:13:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·26 Oct 2025,·36 minsEpping Sex Offender Arrested, But Has The Damage Been Done?NewscastAvailable for over a yearToday, we look at the rearrest of migrant sex offender Hadush Kebatu, and discuss what his mistaken release means for confidence in the government.\nKebatu had been mistakenly released on Friday from HMP Chelmsford, where he was serving a 12-month sentence for sexually assaulting a 14-year-old girl and a woman in Epping, Essex.\nWe also discuss an apology from Reform UK MP Sarah Pochin, after she said: “it drives me mad when I see adverts full of black people, full of Asian people”.\nLabour cabinet minister Wes Streeting has called the comment racist. Pochin says “My comments were phrased poorly and I apologise for any offence caused, which was not my intention.”\nAnd we look at Laura’s interview with Former US Vice-President Kamala Harris, in which said said she was 'concerned' she did not ask Biden to quit the presidential race.\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenters were Paddy O’Connell and Laura Kuenssberg. It was made by Chris Flynn with Sophie Millward. The social producer was Darren Dutton. The technical producer was Frank McWeeny. The weekend series editor is Chris Flynn. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Epping Sex Offender Arrested, But Has The Damage Been Done? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-10-26T14:13:00.000Z",
      "dateModified": "2025-10-26T14:13:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-10-27T05:59:57.000Z",
    "description": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and p",
    "body": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-10-27T05:59:57.000Z",
      "dateModified": "2025-10-27T05:59:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Katy Perry and Justin Trudeau pictured holding hands at Paris event",
    "url": "https://www.bbc.com/news/articles/c7v8rmv2ygdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9f4a/live/5d9968f0-b33c-11f0-aa13-0b0479f6f42a.png",
    "tag": "Trending",
    "date": "2025-10-27T11:49:08.000Z",
    "description": "Singer Katy Perry and former Canadian Prime Minster Justin Trudeau appear to have confirmed their relationship after being photographed holding hands ",
    "body": "Singer Katy Perry and former Canadian Prime Minster Justin Trudeau appear to have confirmed their relationship after being photographed holding hands at an event in Paris. Celebrity news site TMZ published the photographs and video footage of the pair walking hand-in-hand before getting into a car. Trudeau is seen helping the singer into the back seat as photographers called out.Neither Perry nor Trudeau have publicly commented on their relationship. But speculation has been growing for weeks with multiple pictures of the two together.Trudeau  was seen attending Perry's concert earlier this year, fuelling rumours of a romance with the pop star.The appearance in Paris coincided with Perry's 41st birthday over the weekend and appeared to mark their first public outing as a couple.Representatives for Perry and Trudeau's Liberal party did not immediately respond to the BBC's request for comment. During a recent tour in London, Perry did appear to allude to her relationship status.  After a fan proposed to her from the audience during a performance, the singer joked: \"I wish you'd asked me 48 hours ago.\" This was just days after photographs of her and Trudeau were first published online.Perry was previously in a long-term relationship with actor Orlando Bloom. The pair, who were together for a decade and share a daughter, separated over the summer.Trudeau, who served as prime minister of Canada from 2015 to 2025, was previously married to Sophie Grégoire for 18 years before the couple split up in the summer of 2023. They share three children.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Katy Perry and Justin Trudeau pictured holding hands at Paris event",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9f4a/live/5d9968f0-b33c-11f0-aa13-0b0479f6f42a.png"
      ],
      "datePublished": "2025-10-27T11:49:08.000Z",
      "dateModified": "2025-10-27T11:49:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brigitte Macron: Trial begins for 10 accused of sexist cyber-bullying of president's wife",
    "url": "https://www.bbc.com/news/articles/ce3knel0895o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/563d/live/5e280f00-b329-11f0-9c26-756530926d22.jpg",
    "tag": "Trending",
    "date": "2025-10-27T11:59:48.000Z",
    "description": "Ten people accused of sexist cyber-bullying of the French president's wife, Brigitte Macron, are due to go on trial this week in Paris.The defendants ",
    "body": "Ten people accused of sexist cyber-bullying of the French president's wife, Brigitte Macron, are due to go on trial this week in Paris.The defendants are accused of spreading unsubstantiated claims over her gender and sexuality, as well as making \"malicious remarks\" about the 24-year age gap between Brigitte and her husband, Emmanuel Macron.If found guilty, the defendants face up to two years' imprisonment.Among the ten people due to appear in the dock on Monday and Tuesday are an elected official, a gallery owner and a teacher, according to French media.Two of them - self-styled independent journalist Natacha Rey and internet fortune-teller Amandine Roy – were found guilty of slander last year for claiming that France's first lady had never existed, and that her brother Jean-Michel Trogneux had changed gender and started using her name.But a court of appeals later acquitted Rey and Roy on the grounds that their statements did not constitute defamation. Mrs Macron and her brother are appealing the decision.A conspiracy theory centred around the notion that Brigitte Macron is a transgender woman has been swirling since her husband won a first term in office in 2017.The unsubstantiated claims over Mrs Macron's gender have been gaining ground in the US, mostly promoted by right-wing influencer Candace Owens.Last July the Macrons filed a lawsuit against Owens, alleging that she \"disregarded all credible evidence disproving her claim in favour of platforming known conspiracy theorists and proven defamers\".Speaking to the BBC's Fame Under Fire podcast, the Macrons' lawyer in the case, Tom Clare, said that Brigitte Macron had found the claims \"incredibly upsetting\" and they were a \"distraction\" to the French president.\"It is incredibly upsetting to think that you have to go and subject yourself, to put this type of proof forward,\" he said.Emmanuel Macron has said pursuing legal action against Owens was about \"defending his honour\" and that the influencer had peddled false information \"with the aim of causing harm, in the service of an ideology and with established connections to far-right leaders.\"Mrs Macron first met her now-husband when she was a teacher at his secondary school. The couple ended up marrying in 2007, when Mr Macron was 29 and Mrs Macron was 54.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brigitte Macron: Trial begins for 10 accused of sexist cyber-bullying of president's wife",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/563d/live/5e280f00-b329-11f0-9c26-756530926d22.jpg"
      ],
      "datePublished": "2025-10-27T11:59:48.000Z",
      "dateModified": "2025-10-27T11:59:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Banned in the 80s: Moments That Shook Music",
    "url": "https://www.bbc.co.uk/iplayer/episode/m002k85n?at_mid=XZLfF6kcDM&at_campaign=Banned_in_the_80s_Moments_That_Shook_Music&at_medium=display_ad&at_campaign_type=owned&at_nation=NET&at_audience_id=SS&at_product=iplayer&at_brand=m002k85n&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Banned_in_the_80s_Moments_That_Shook_Music&at_bbc_team=BBC",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0m3w047.jpg",
    "tag": "Trending",
    "date": "2025-09-27T21:22:31.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeBanned in the 80s: Moments That Shook MusicBanned in the 80s: Moments That Shook MusicContains very strong language.Contains discriminatory languageDocumentary revealing the untold stories behind the most controversial music of the 1980s, featuring Frankie Goes to Hollywood, Queen, George Michael, N.W.A, Madonna and others. Duration55 minsFirst shown27 Sep 2025Available for 11 monthsWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesWhen Bruce Springsteen Came to BritainBorn in the USA, made in the UK. The Boss explains why Britain is so special to him59 minsSimple Minds: Everything Is PossibleDaring to dream. The inspirational story of Scotland's biggest band1h 27mSimon & Garfunkel: The Harmony GameInspiration – and separation. The stormy relationship that created beautiful music1h 11mWham!: Last Christmas Unwrapped40 years a festive favourite. Andrew, Pepsi and Shirlie revisit Wham!’s winter wonderland59 minsWhen Tina Turner Came to BritainLet’s stay together. From 60s starlet to 80s comeback queen, a career built in Britain59 minsDionne Warwick: Don't Make Me OverWhat the world needs now... How a sublime voice found a second life as a call for change1h 32mCarole King and James Taylor: Just Call Out My NameLong ago and far away. Two sensational solo artists created the perfect partnership1h 33mLive Aid at 40: When Rock ’n’ Roll Took on the WorldNot just for one day. The creation and legacy of a concert that changed everythingSharon & Ozzy Osbourne: Coming HomeRock legend Ozzy's final chapter as Birmingham’s favourite son - and family - return home59 minsMr Blue Sky: The Story of Jeff Lynne and ELOThe pioneer of progressive pop – from the Brum beat scene to huge hits all over the world57 minsSince Yesterday: The Untold Story of Scotland's Girl BandsPopstars, punks and pioneers. Defiant trailblazers who rocked a mostly male music world1h 30mTangled Up with Dylan: The Ballad of AJ WebermanDocumentary chronicling the life, times and crimes of Bob Dylan obsessive AJ Weberman.1h 16m",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Banned in the 80s: Moments That Shook Music",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0m3w047.jpg"
      ],
      "datePublished": "2025-09-27T21:22:31.000Z",
      "dateModified": "2025-09-27T21:22:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mpox cases in Europe prompt vaccine reminder",
    "url": "https://www.bbc.com/news/articles/cp856rvv41eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f941/live/df2ce440-b342-11f0-9ae5-dfa34b074568.jpg",
    "tag": "Trending",
    "date": "2025-10-27T15:06:08.000Z",
    "description": "1 hour agoPhilippa RoxbyHealth reporterUK health officials are encouraging gay, bisexual and other men who have sex with men to make sure they are vac",
    "body": "1 hour agoPhilippa RoxbyHealth reporterUK health officials are encouraging gay, bisexual and other men who have sex with men to make sure they are vaccinated against mpox, as a strain called 'clade Ib' shows early signs of local spread in some European countries.The UK Health Security Agency (UKHSA) says it is aware of small numbers of cases of this strain of mpox - formerly known as monkeypox - in Spain, Italy, Portugal and the Netherlands, as well as the US.Mpox is usually a mild infection but it can be severe and getting vaccinated is the best protection, the UKHSA says.Charities also urged vaccination before travelling to Winter Pride events in Europe this autumn.\"The ways in which we are seeing mpox continue to spread globally is a reminder to come forward for the vaccine, if you are eligible,\" said Dr Katy Sinka, head of sexually transmitted infections at UKHSA.In the UK, there is a routine mpox vaccination programme already in place for gay, bisexual and other men who have sex with men.The vaccine is recommended if you're at higher risk of getting mpox.This is mainly men who have sex with men, and those who:have multiple sexual partnershave group sexvisit sex-on-premises venuesThe mpox vaccine is also recommended for people who work at sex-on-premises venues, such as cleaning staff and anyone who has had or will have close contact with someone who has mpox, the NHS website says.Although the vaccine hasn't been tested against clade Ib mpox, it is known to be effective in protecting against another strain called clade II.As a result, health officials says vaccine protection is expected.Vaccination is now available from sexual health services. NHS advice is to call a sexual health clinic about the mpox vaccine before going along.Common symptoms of mpox include a skin rash or lesions filled with pus, which can last from two to four weeks.Mpox can also cause a fever, headaches, muscle aches, back pain, tiredness and swollen lymph nodes.It's a virus that spreads from person to person through close physical contact, coughs or sneezes and touching infected clothing, bedding or towels.In 2022, there was a global outbreak of clade II mpox which affected many countries worldwide and particularly gay, bisexual and other men who have sex with men (GBMSM).To date, there have been 16 cases of mpox clade Ib in the UK - all in England. But no evidence of spread within the GBMSM community. All cases have had direct or indirect links to travel to countries where that strain is circulating.Spain reported its first locally-acquired cases earlier this month, and another four cases were reported to the European Centre for Disease Prevention and Control (ECDC) among men in Italy, Portugal and the Netherlands. All five had mild symptoms. The ECDC says the cases had no travel history, which suggests \"a different pattern of transmission\" and indicates \"that transmission may be occurring in sexual networks among men who have sex with men in several EU/EEA countries\".  Previously reported clade I mpox cases in Europe - around 30 - were all imported or had clear links to these imported cases.Richard Angell OBE, chief executive of the Terrence Higgins Trust, said: \"With Winter Pride season soon upon us across Europe, those travelling to these events would be wise to get vaccinated, at least once, if not twice.\"Most people will be offered two doses, usually at least 28 days apart.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mpox cases in Europe prompt vaccine reminder",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f941/live/df2ce440-b342-11f0-9ae5-dfa34b074568.jpg"
      ],
      "datePublished": "2025-10-27T15:06:08.000Z",
      "dateModified": "2025-10-27T15:06:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man wins 'substantial damages' over portrayal in Steve Coogan Richard III film",
    "url": "https://www.bbc.com/news/articles/cdegzx9w16ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4a6e/live/5bc18460-b32b-11f0-ba75-093eca1ac29b.png",
    "tag": "Trending",
    "date": "2025-10-27T14:39:28.000Z",
    "description": "2 hours agoLaura Hammond,East Midlands and Lizo Mzimba,Entertainment correspondentThe Lost KingThe film told the story of the search for Richard III's",
    "body": "2 hours agoLaura Hammond,East Midlands and Lizo Mzimba,Entertainment correspondentThe Lost KingThe film told the story of the search for Richard III's remains in 2012A university academic is to be awarded \"substantial damages\" after a court ruled the portrayal of him in a Steve Coogan film about the discovery of a Richard III's remains did have a defamatory meaning.Richard Taylor sued the comedian, who wrote the film The Lost King, as well as production company Baby Cow, and Pathe Production.It was announced on Monday that Mr Taylor, who was unhappy about the way his character was portrayed, had been successful in his claim.The film, which told the story of the search for the Plantagenet monarch under a Leicester council car park in 2012, will now carry a message at the front of the film, and defamatory comments not repeated.Mr Taylor launched High Court action claiming the film had made him appear \"misogynistic\" and \"weasel-like\".Speaking to the BBC outside the Royal Courts of Justice following the court's decision, Mr Taylor said: \"I'm really pleased that we have finally established that the film is a defamatory portrayal of me - baseless in its depiction of me and a distortion of the search for Richard III.\"And I don't let that detract from what was a fantastic piece of teamwork, a collaborative experience where university academics and amateurs came together to search for Richard III.\"But it's fantastic now, that we have established in court that The Lost King is a misleading, defamatory, untrue portrayal of what happened in Leicester back in 2012.\"SuppliedRichard Taylor's lawyers described the settlement as a \"defamation David and Goliath moment\"The Lost King focused on the role of historian Philippa Langley in the search, which involved archaeologists from the University of Leicester.Mr Taylor was the deputy registrar of the University of Leicester at the time and was later played in the film by actor Lee Ingleby.In June, Judge Jaron Lewis ruled the film portrayed Mr Taylor as having \"knowingly misrepresented facts to the media and the public\" about the discovery, and as being \"smug, unduly dismissive and patronising\", which could be defamatory.The case was due to proceed to trial, but lawyers for Mr Taylor told a hearing on Monday that the parties had settled the claim.As well as agreeing to a financial settlement, the defendants are to add a card to the front of the film in versions in England and Wales.The card will read: \"Whilst in this film there is a character called Richard Taylor who is shown to be an employee of the University of Leicester, the portrayal of him is fictional and does not represent the actions of the real Mr Taylor, who was employed by the University of Leicester as its deputy registrar, and acted with integrity during the events portrayed.\"No edits or cuts to the film were part of the settlement, the defendants said. 'Remarkable contribution'In a statement after the hearing, Mr Taylor - now the chief operating officer at Loughborough University - added: \"Whilst it is clear to me that the defendants were misled as to the events of the discovery, they made a deliberate choice to accept those accounts, failing to speak or check basic facts.\"Our work is twisted into a false caricature of university elitism, ivory towers and self-interest.\"Mr Taylor said Philippa Langley's initiation of the project and \"driving confidence\" had made it possible for Richard III to be found. He added: \"Hers was a remarkable contribution. But it did not extend to leading the archaeological search or scientific analysis, for which she was neither qualified nor experienced to lead.\"I could have dropped Philippa's approach for help into the waste bin when it arrived in 2011, and there have been days over the last three years when I wished that I had. \"But I didn't, and my decision to deploy the resources and expertise of the university enabled this search to happen.\"'A real warning'Daniel Jennings, defamation partner at Shakespeare Martineau, which represented Mr Taylor, described it as a \"defamation David and Goliath moment\".He said: \"Individuals often feel unable to speak up against large corporations and well-known personalities, but this win demonstrates that there is recourse when wrongs have been committed.\"We live in an era of documentaries, podcasts and very public investigative journalism and there's a growing trend for film and television productions to be labelled as 'true accounts' to grab audience attention and generate media buzz around new releases.\"Mr Taylor's win should act as a real warning for anything looking to use those tactics.\"The law is very clear and there are defined routes to compensation for individuals who find themselves misrepresented.\"PA MediaSteve Coogan's lawyers previously said the film was not a literal portrayal of eventsA joint statement from Pathe Productions, Baby Cow Productions and Steve Coogan added: \"As a distributor and producer recognised for bringing complex, real-life stories to audiences, we are deeply aware of the responsibility that comes with such portrayals and approach each project with care, integrity, and a commitment to authenticity. \"We remain incredibly proud of this film and are pleased this matter has now been settled. \"As part of the agreement, no material editorial changes will be made to the film beyond an onscreen clarification at the beginning of the film.\"Additional reporting by Dan Martin More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man wins 'substantial damages' over portrayal in Steve Coogan Richard III film",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4a6e/live/5bc18460-b32b-11f0-ba75-093eca1ac29b.png"
      ],
      "datePublished": "2025-10-27T14:39:28.000Z",
      "dateModified": "2025-10-27T14:39:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump does not rule out seeking third term - but says he will not use VP loophole",
    "url": "https://www.bbc.com/news/articles/c797q57ple9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/38d4/live/025ab950-b349-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "Trending",
    "date": "2025-10-27T15:22:03.000Z",
    "description": "55 minutes agoBernd Debusmann Jrat the White HouseUS President Donald Trump has not ruled out the possibility of seeking a third term for the White Ho",
    "body": "55 minutes agoBernd Debusmann Jrat the White HouseUS President Donald Trump has not ruled out the possibility of seeking a third term for the White House, saying he would \"love to do it\". But Trump rejected the possibility of running for vice-president in 2028 - an idea floated by some supporters as a way for him to circumvent the US constitution that bars the president from running for a third term.Speaking to reporters during his trip to Asia, Trump described the idea as \"too cute\" and said it \"wouldn't be right\". It is unclear what method he would use to run again. Last week, former Trump strategist Steve Bannon said that a \"plan\" was in place to secure the 79-year-old president another term. Speaking to reporters aboard Air Force One on his way to Japan from Malaysia, Trump said that while he would \"be allowed\" to run again as vice-president, he had no plans to do so.\"I think people wouldn't like that,\" he said. \"It's too cute. It wouldn't be right.\" Talking about the possibility of a third term, Trump said: \"I haven't really thought about it. But I have the best poll numbers that I've ever had.\" Additionally, Trump also suggested vice-president JD Vance and Secretary of State Marco Rubio as potential successors, calling them \"unstoppable\".\"All I can tell you is that we have a great group of people, which they don't,\" he added, referrring to Democrats.Can Trump serve a third term as US president?The 22nd amendment of the US constitution bars presidents from seeking a third term. Repealing the amendment would require approval from two-thirds of both the House of Representatives and the Senate, or a constitutional convention called by  two-thirds of state legislatures - a process viewed as highly unlikely.Last week, former Trump adviser Steve Bannon - who remains a vocal supporter - claimed there was a \"plan\" to secure a third term for Trump.\"Trump is going to be president in '28, and people ought to just get accommodated with that,\" Bannon told  The Economist. \"At the appropriate time, we'll lay put what the plan is.\" In March, Trump told CNBC he would \"probably not\" run again, though he later said  he was \"not joking\" about the possibility. It is still unclear which Democrats intend to run for the White House in 2028, although several have already expressed an interest. On Sunday, California Governor Gavin Newsom told CBS, the BBC's US partner, that  he would \"be lying\" if he said he was not giving serious thought to a presidential bid. Former vice-president Kamala Harris also told the BBC she may run again and that she could \"possibly\" be president in the future. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump does not rule out seeking third term - but says he will not use VP loophole",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/38d4/live/025ab950-b349-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-27T15:22:03.000Z",
      "dateModified": "2025-10-27T15:22:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chancellor hints at tax and spend shift to cushion Budget",
    "url": "https://www.bbc.com/news/articles/c9v1r7zeekro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3295/live/7bc51b60-b30c-11f0-86d7-1f99098a746f.jpg",
    "tag": "Trending",
    "date": "2025-10-27T15:37:27.000Z",
    "description": "38 minutes agoSimon JackBusiness editor The chancellor has confirmed both tax rises and spending cuts are options as she aims to give herself more fin",
    "body": "38 minutes agoSimon JackBusiness editor The chancellor has confirmed both tax rises and spending cuts are options as she aims to give herself more financial breathing space in November's Budget.Speaking at a gathering of business leaders in Saudi Arabia, Rachel Reeves said she wanted to ensure the UK had \"sufficient headroom\" to provide resilience against future shocks.The implication is that the £9.9bn buffer she allowed herself in last year's budget is not sufficient to provide resilience against changing circumstances.Reeves did not rule out the possibility of tax rises when asked if she was considering them ahead of the Budget, adding that economic growth would be \"a big part of the Budget story\".\"But we are looking, of course, at tax and spending to ensure that we both have resilience against future shocks by ensuring we've got sufficient headroom, and also just ensuring that those fiscal rules are adhered to,\" she said in an address at Fortune Magazine's global forum in Riyadh.The big question is whether the importance she places on increasing that buffer is enough to make her break manifesto pledges not to increase rates of income tax, VAT or employees' national insurance. Previous insistence that those promises would stand appear to have been weakened recently to a commitment to keep taxes on working people \"as low as possible\".Earlier this month, the Institute for Fiscal Studies think tank estimated the chancellor would need to find £22bn to make up the government finance shortfall.Rachel Reeves is to meet ministers from Saudi Arabia and Qatar on Monday and Tuesday - the first UK chancellor to visit the Gulf in six years.A series of two-way trade and investment deals are expected to be announced during her visit to the Future Investment Initiative (FII) in Riyadh, dubbed the \"Davos in the Desert\".The government is keen to promote the UK as a stable and attractive place to do business for the countries that make up the Gulf Co-operation Council (GCC). After meeting senior Saudi royals on Monday she will join dozens of UK and international CEOs on Tuesday during the FII event.Following a trade deal with India, a tariff deal with the US and a closer reset with the EU, the chancellor is keen to press ahead with a trade deal with the GCC, which includes Kuwait, the UAE, Qatar and Saudi Arabia.Reeves said: \"Our number one priority is growth, so I am taking Britain's offer of stability, regulatory agility and world-class expertise directly to one of the world's most important trade and investment hubs, making that case in our national interest.\"However, even by the government's own estimates, such a deal would add only £1.6bn a year to UK GDP, which is less than a tenth of 1%.Meanwhile, Barclays Bank announced it will restart investment banking in Saudi Arabia as part of its \"broader Middle East growth strategy\", with plans to open an office in Riyadh next year. The move comes more than a decade after the banking giant pulled out of the oil-rich region.Back in the UK, there are warnings the government's flagship Employment Rights Bill will deter job creation.The bill, which will be considered by the House of Lords on Tuesday, would allow workers new rights and protections on sick pay and unfair dismissal from their first day on the job, is facing criticism from unexpected quarters.The Resolution Foundation, which has enjoyed the ear of the Labour Party for many years, has joined a chorus of business voices warning that conferring additional rights and protections would \"inhibit hiring\" at a time of rising workplace vacancies.On Friday, 13 business groups, including the CBI, Make UK and the Federation of Small Business, wrote a letter urging support in the House of Lords for an amendment that would bring in the new rights after six months.While the government has been praised in business circles for concluding trade deals, some say it has done a better job convincing foreign investors than reassuring UK businesses, many of which have been hit with a £25bn tax rise in the last budget and are fearful of potential further tax rises in her next one.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chancellor hints at tax and spend shift to cushion Budget",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3295/live/7bc51b60-b30c-11f0-86d7-1f99098a746f.jpg"
      ],
      "datePublished": "2025-10-27T15:37:27.000Z",
      "dateModified": "2025-10-27T15:37:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reform MP's comments 'ugly' but intention was not racist, Farage says",
    "url": "https://www.bbc.com/news/articles/c78z4eyvnx1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/09cf/live/6cfb6a20-b335-11f0-8c7d-e3b2a8158887.jpg",
    "tag": "Trending",
    "date": "2025-10-27T15:20:44.000Z",
    "description": "55 minutes agoBecky MortonPolitical reporterNigel Farage has said Reform MP Sarah Pochin did not intend to be racist when she complained about adverts",
    "body": "55 minutes agoBecky MortonPolitical reporterNigel Farage has said Reform MP Sarah Pochin did not intend to be racist when she complained about adverts being \"full\" of black and Asian people.The Reform UK leader said the way she worded her comments was \"wrong and ugly\" but they were made \"in a broader context of DEI [diversity, equity and inclusion] madness in the advertising industry\".Pochin has apologised for her remarks, saying they were \"phrased poorly\" but maintained that many adverts were \"unrepresentative of British society\".It comes after Prime Minister Sir Keir Starmer branded the comments racist, with both Labour and the Liberal Democrats calling for Farage to suspend her from the parliamentary party.Asked during a press conference on grooming gangs if he accepted Pochin's comments were racist, Farage said: \"I am unhappy with what she has done...\"I understand the basic point but the way she put it, the way she worded it, was wrong and was ugly.\"And if I thought that the intention behind it was racist then I would have taken a lot more action than I have to date.\"Earlier Sir Keir said Pochin's comments were \"shocking racism\" and \"the sort of thing that'll tear our country apart\".\"Nigel Farage has some questions to answer. Because either he doesn't consider it racist, which in my view is shocking in itself, or he does think it's racist and he's shown absolutely no leadership,\" he told BBC North West Tonight.Labour chairwoman Anna Turley has written to Farage to ask if he endorses Pochin's comments and whether he will withdraw the Reform UK whip from her - meaning she would sit as an independent MP.With Labour trailing Reform UK in the polls, Sir Keir has stepped up his attacks on the party in recent weeks.This is the second time he has accused the party of racism, after using the label to describe Reform's immigration policy last month.Pochin was speaking during a TalkTV phone-in on Saturday, when she said she agreed with a caller who complained about the \"demographics\" of advertising.The Runcorn and Helsby MP said the viewer was \"absolutely right\" and \"it drives me mad when I see adverts full of black people, full of Asian people\".She said that it did not reflect society and \"your average white person\" is \"not represented anymore\".In a social media post later on Saturday, Pochin said her comments \"were phrased poorly and I unreservedly apologise for any offence caused, which was not my intention\".\"The point I was making is that many British TV adverts have gone DEI [diversity, equity and inclusion] mad and are now unrepresentative of British society as a whole,\" she said.She cited a Channel 4 study which found that the proportion of adverts featuring black people jumped after the rise of the Black Lives Matter movement, from 37% in 2020 to 51% in 2022.\"Representation should reflect the diversity of modern Britain, but it should also be proportionate and inclusive of everyone,\" she added.The Liberal Democrats have also called on Farage to suspend Pochin from the party, while urging the government and the Conservatives to back a parliamentary motion rebuking the MP for her \"racist and inexcusable remarks\". The party's home affairs spokesman Max Wilkinson said: \"Sarah Pochin's remarks were blatantly racist. \"Decent MPs from across party lines should now come together to condemn this disgraceful behaviour and show the public that this will never be tolerated by Parliament.\"He also accused Conservative shadow home secretary Chris Philp of being \"spineless\" for \"failing to immediately call out Pochin's racist remarks for what they were\".Asked about her comments on Sunday, Philp told the BBC: \"It's certainly not language that I would use and I don't think politicians should speak in those terms.\"He later told LBC the way Ms Pochin made her comments was \"racist\", adding: \"She should absolutely not have said that. It was completely wrong.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reform MP's comments 'ugly' but intention was not racist, Farage says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/09cf/live/6cfb6a20-b335-11f0-8c7d-e3b2a8158887.jpg"
      ],
      "datePublished": "2025-10-27T15:20:44.000Z",
      "dateModified": "2025-10-27T15:20:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dundee grooming gang jailed for raping and sexually abusing women",
    "url": "https://www.bbc.com/news/articles/cvg8791y4xxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/856e/live/c11b19b0-b336-11f0-ba75-093eca1ac29b.jpg",
    "tag": "Trending",
    "date": "2025-10-27T14:54:14.000Z",
    "description": "1 hour agoGraeme OgstonBBC Scotland NewsPolice ScotlandAlexandra Bugonea (top left), Catalin Dobre (bottom left), Cristian Urlateanu (top right), Remu",
    "body": "1 hour agoGraeme OgstonBBC Scotland NewsPolice ScotlandAlexandra Bugonea (top left), Catalin Dobre (bottom left), Cristian Urlateanu (top right), Remus Stan (bottom right) and ringleader Marian Cumpanasoiu (centre)A Romanian grooming gang led by a \"winking, smirking pimp\" have been jailed for raping and sexually abusing 10 women in flats across Dundee.The four men and one woman plied their victims - aged between 16 and 30 - with drugs at various properties between 2021 and 2022.Ringleader Marian Cumpanasoiu, 38, along with Remus Stan, 35, Cristian Urlateanu, 41, Catalin Dobre, 45, and Alexandra Bugonea, 35, were previously convicted of 30 charges at the High Court in Glasgow.Cumpanasoiu was sentenced to 24 years, Urlateanu to 20 years, Stan to 12 years, Dobre to 10 years and Bugonea to eight years.Judge Lord Scott said that a number of the group \"deflected and minimised\" their offending against vulnerable victims.He added: \"By offering them an unending supply of mostly free crack cocaine you exacerbated their vulnerabilities and proceeded to exploit them for your own sexual gratification and in some cases for financial gain.\"No doubt you assumed rightly for some time that the drug-related lifestyles of the women meant that you were not reported or detected.\"The judge said that the gang used the vulnerability of the women \"to try to attack their credibility\". Lord Scott continued: \"It may be you thought that no-one cared for your victims meaning you could do whatever you wanted to them without consequence. If so, events have proved you wrong.\"Each of the women found the strength to give evidence despite their difficulties and have taken steps to move on from that stage in their lives.\"Judge Lord Scott told the gang during their sentencing that they exacerbated the vulnerability of the young womenThe judge said it would be a matter for the Home Office but it was likely the gang would be deported on completion of their sentences.Three gang members - Urlateanu, Dobre and Bugonea - fled the country but were traced and extradited back to Scotland from Belgium and the Czech Republic for their trial last December.Jurors in the six-week trial heard harrowing testimony about how the gang preyed on the women, most of whom were already troubled by personal issues.Cumpanasoiu was found guilty of 10 charges of rape, while Urlateanu was convicted of six rapes.Cumpanasoiu was also convicted of a charge under the Human Trafficking Act, by forcing a woman into prostitution, and two charges of brothel keeping.Stan was found guilty of four rapes while Dobre was found guilty of two rapes.Alexandra Bugonea was convicted of one rape and illegal sexual activity with another.Crown OfficeA bed inside the brothel on Bright Street, DundeePolice Scotland uncovered the gang's activities during an operation focusing on the trafficking of woman to Dundee from eastern Europe to work as prostitutes.But officers discovered vulnerable local women were also being groomed with gifts and drugs, including crack cocaine.Some members of the gang worked in legitimate jobs as food delivery drivers, but were also grooming a succession of young women from the local area.  The women were forced to have sex with the gang, and encouraged to recruit friends to come to the properties with the promise of drugs.Victims were plied with whisky and crack cocaine as well as being made to take part in \"sex games\".The gang was led by Cumpanasoiu, who was described as a \"winking, smirking pimp\" who behaved with a \"predatory nature\" towards women.Following the sentencing, the Crown Office released mobile phone footage of Cumpanasoiu in his car singing along to the 50 Cent song P.I.M.P.Crown OfficeA knife which belonged to Marian CumpanasoiuOne of the victims was forced into prostitution after Cumpanasoiu and Stan set up a profile of her on a website and drove her to meet men to have sex with.This victim was said to have been sold a \"pipe dream\" of how she could make \"lots of money\" from selling her body.But Cumpanasoiu was said to be angry at one stage at her not earning enough.A video was found on his phone recording the victim climbing a tree.Cumpanasoiu was said to have threatened: \"Because you do not make money, you stay all day in the tree.\"He and Stan also raped the woman.The rapes took place at properties in DundeeCumpanasoiu was described by one victim as \"absolutely relentless\" and another was left feeling \"disgusted\" by him.Cumpanasoiu claimed he only gave another of the young women crack cocaine to be \"polite\".Alexandra Bugonea, who was a prostitute in Dundee, admitted having \"sex parties\" at her flat and described them as having a \"fun atmosphere\".But one victim described seeing Bugonea semi-naked and teaming up with her then-boyfriend Cristian Urlateanu to rape.Quizzed about sexually assaulting any of the victims, Bugonea said: \"I am a woman - why would I have a plan to rape her?\"She also denied women only visited due to their drug issues, claiming she believed they were \"friends\".There was also testimony of how Urlateanu, Stan and Dobre raped another woman.DI Scott Carswell led the investigation into the gangLord Scott said Cumpanasoiu had \"lied, denied and deflected\" and \"shown no meaningful insight or remorse\".The court heard he was key to the identification, targeting and recruitment of women for sexual exploitation and supplied them with crack cocaine.The judge also said Cumpanasoiu presented  a \"high threat of harm to women\".His 24-year sentence will be split between a 20-year custodial term and a four-year extension.Urlateanu's sentence was also divided between an 18-year custodial term and a two-year extension.Meanwhile, Bugonea wept in the dock after she was jailed for eight years.The jury heard she had difficult childhood experiences and may too have been exploited by others.But the court heard her involvement, whether deliberate or not, may have helped to lure some of the victims and assure them that they would be safe.Non-harassment orders were granted which prohibit the group from contacting their victims for an indefinite period. They were also put on the sex offenders register.Stan was separately given a five-year trafficking exploitation order.Fiona Kirkby, procurator fiscal for high court sexual offences, said: \"This gang ruthlessly exploited vulnerable women for their own gain, without any regard for the suffering and trauma they caused.\"These were truly reprehensible crimes, and the victims must be commended for their courage in speaking out.\"Det Ch Insp Scott Carswell thanked the force's partners who supported the victims throughout the investigation.He also urged people to contact officers directly if they have any concerns.Det Ch Insp Carswell added: \"Victims are often vulnerable, they may be trapped with limited freedom or options, and sometimes they may not realise that they are in fact victims.\"That call can be the first step in freeing someone from slavery and exploitation.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dundee grooming gang jailed for raping and sexually abusing women",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/856e/live/c11b19b0-b336-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-27T14:54:14.000Z",
      "dateModified": "2025-10-27T14:54:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]