[
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Google Boss And The Massive AI Gamble - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mhdbrt?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-11-18T18:28:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·18 Nov 2025,·33 minsThe Google Boss And The Massive AI GambleNewscastAvailable for over a yearToday, the CEO of Google gives a rare interview to discuss AI, economic risk, climate change and much more. \nFaisal Islam has been speaking to Sundar Pichai, the head of Google’s parent company Alphabet, about the future of the AI bubble.\nThe tech boss warned that “no company is going to be immune” if the AI bubble bursts after its current period of boom. This comes as some analysts expressed fear that stock markets are heading for a repeat of the dotcom bubble burst of the late 1990s.\nThey also discussed the environmental cost of powering AI, the potential risks to jobs and whether the UK will benefit from the current boom. BBC economics editor Faisal Islam joins Adam in the studio.\nYou can listen to a longer version of the interview with Sundar Pichai here - https://www.bbc.co.uk/sounds/play/p0mh56kj\nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Shiler Mahmoudi and Anna Harris. The social producer was Beth Pritchard. The technical producer was James Piper. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Google Boss And The Massive AI Gamble - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-11-18T18:28:00.000Z",
      "dateModified": "2025-11-18T18:28:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Americanswers… on 5 Live! Has Donald Trump changed his mind on the Epstein Files? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mh6kdc?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2025-11-17T19:06:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·17 Nov 2025,·24 minsAmericanswers… on 5 Live! Has Donald Trump changed his mind on the Epstein Files?AmericastAvailable for over a yearOn Sunday night Donald Trump told Republicans in the House of Representatives to vote in favour of releasing files relating to the late convicted sex offender Jeffrey Epstein “because we have nothing to hide”. It’s a striking change in position from the president who has so far resisted pressure from Democrats and Republicans in his own party who have been demanding that all files relating to Epstein be released into the public domain. \nOne of the Republicans calling for their release is the conservative firebrand and Republican congresswoman Marjorie Taylor Greene, who was once one of Trump’s most faithful supporters. After stepping up her demands to see the files released, she now appears to have lost the president’s backing who called her a “traitor” and a “disgrace” to the Republican Party. We answer your questions on why the pair have fallen out.\nAnd, we answer your questions on why there’s been another presidential pardon, this time for the UK billionaire Joe Lewis, whose family trust owns Tottenham Hotspur Football Club. Sarah, Anthony, Justin and Marianna all joined Matt Chorley on 5 Live today to answer these questions and plenty more.\nHOSTS:\n* Matt Chorley, 5 Live presenter \n* Sarah Smith, North America Editor\n* Justin Webb, Radio 4 presenter\n* Anthony Zurcher, North America correspondent\n* Marianna Spring, Social Media Investigations correspondent\nGET IN TOUCH:\n* Join our online community: https://discord.gg/qSrxqNcmRB\n* Send us a message or voice note via WhatsApp to +44 330 123 9480\n* Email Americast@bbc.co.uk\n* Or use #Americast\nThis episode was made by George Dabby with Grace Reeve and Laura Cain. The technical producer was Michael Regaard. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app.\nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155\nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nUkrainecast: https://www.bbc.co.uk/sounds/brand/p0bqztzm\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Americanswers… on 5 Live! Has Donald Trump changed his mind on the Epstein Files? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2025-11-17T19:06:00.000Z",
      "dateModified": "2025-11-17T19:06:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oasis fan's death at Wembley was 'tragic accident', inquest told",
    "url": "https://www.bbc.com/news/articles/ce9dkk3y7g9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/32a3/live/28f64e00-8ee9-11f0-a84b-ed021aa99e21.jpg",
    "tag": "Trending",
    "date": "2025-11-19T12:15:22.000Z",
    "description": "8 hours agoMarcus WhiteSouth of EnglandThe death of an Oasis fan who fell from height at a concert at Wembley Stadium was a \"tragic accident\", a pre-i",
    "body": "8 hours agoMarcus WhiteSouth of EnglandThe death of an Oasis fan who fell from height at a concert at Wembley Stadium was a \"tragic accident\", a pre-inquest review has heard.Lee Claydon, 45, from Bournemouth and known to his family by his middle name Clive, fell from an upper level at the end of the show on 2 August.At Barnet Coroner's Court, Det Sgt James Raffin, of the Metropolitan Police, told the hearing it was no longer being treated as a criminal case. \"We do not suspect any third party involvement,\" he said. \"This, from everything we have seen, was a tragic accident.\"Mr Claydon had been drinking but a toxicology report revealed \"no concerns\", the officer told the court.He said the force had also ruled out the possibility of suicide.Det Sgt Raffin added: \"From a police point of view, I would say our investigation is complete.\"The officer said he was aware the family had concerns over the \"circumstances on the night\" and that he would pass these on to officials at Brent Council.The father of three was pronounced dead at a Wembley medical centre at 22:38 BST, an initial hearing in September was told.The preliminary cause of death was given as \"multiple bodily injuries\".The fall happened during a run of stadium shows for the rock band's sell-out Live '25 reunion tour - their first since splitting in 2009.Oasis previously said in a statement: \"We are shocked and saddened to hear of the tragic death of a fan at the show.\"Mr Claydon's father, Clive, paid a tribute to his son, describing him as a \"lovely bloke\" and a \"hard-working family man\".Senior Coroner Andrew Walker said the full inquest would take place on 26 February.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oasis fan's death at Wembley was 'tragic accident', inquest told",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/32a3/live/28f64e00-8ee9-11f0-a84b-ed021aa99e21.jpg"
      ],
      "datePublished": "2025-11-19T12:15:22.000Z",
      "dateModified": "2025-11-19T12:15:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gustav Klimt painting becomes second most expensive artwork sold at auction",
    "url": "https://www.bbc.com/news/articles/cm2emm4737zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2512/live/c3b79e00-c533-11f0-9839-6584ec7afe70.jpg",
    "tag": "Trending",
    "date": "2025-11-19T09:55:50.000Z",
    "description": "A portrait by the Austrian artist Gustav Klimt was sold for $236.4m (£179m) in New York on Tuesday, making it the second most expensive piece ever sol",
    "body": "A portrait by the Austrian artist Gustav Klimt was sold for $236.4m (£179m) in New York on Tuesday, making it the second most expensive piece ever sold at auction. Six people took part in a 20-minute bidding battle for the Portrait of Elisabeth Lederer which was painted between 1914 and 1916. Auction house Sotheby's has not disclosed the buyer's identity.The portrait was looted by the Nazis and almost destroyed in a fire in World War Two, but was rescued in 1948. The artwork was returned to Lederer's brother, Erich, a friend and subject of Klimt's contemporary, Egon Schiele. The piece remained in Lederer's possession for most of his life, before he sold it in 1983, according to Sotheby's. The painting shows Lederer, an heiress and the daughter of one of Klimt's patrons, wearing a white robe and standing in front of a blue tapestry covered in Asian motifs. The Nazis, who annexed Austria in 1938, looted the Lederer art collection but left family portraits behind, says the National Gallery of Canada. Estée Lauder heir Leonard A Lauder made it part of his private collection in 1985, where it was displayed in his Fifth Avenue home in New York. Tuesday's sale shot past expectations, with the painting predicted to sell for  $150m before the auction. The second highest sale for a Klimt on record was Lady with a Fan, which sold for $108.8m in 2023 in London. Several other Klimt works in Lauder's collection were auctioned at the same event, including Flowering Meadow and Forest Slope at Unterach am Attersee, which fetched between $60m and $80m each. The most expensive artwork ever sold at auction was Salvator Mundi, attributed to  Leonardo da Vinci, which sold in 2017 for $450.3m.Tuesday also saw a sculpture of a fully functioning gold toilet by the conceptual artist Maurizio Cattelan picking up $12.1m just an hour after the record-breaking Klimt sale.The 101-kg toilet received just one bid. Sotheby's said that the buyer was a famous American brand.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gustav Klimt painting becomes second most expensive artwork sold at auction",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2512/live/c3b79e00-c533-11f0-9839-6584ec7afe70.jpg"
      ],
      "datePublished": "2025-11-19T09:55:50.000Z",
      "dateModified": "2025-11-19T09:55:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Larry Summers resigns from OpenAI board after Epstein emails made public",
    "url": "https://www.bbc.com/news/articles/ce868dmz2mdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bda7/live/8d653c50-c546-11f0-88be-3bc2aea1a256.jpg",
    "tag": "Trending",
    "date": "2025-11-19T13:32:11.000Z",
    "description": "Former US treasury secretary Larry Summers is stepping down from the board at OpenAI, a week after a tranche of emails between him and late convicted ",
    "body": "Former US treasury secretary Larry Summers is stepping down from the board at OpenAI, a week after a tranche of emails between him and late convicted sex offender Jeffrey Epstein was released. Summers said in a statement to the BBC that he was \"grateful for the opportunity to have served, excited about the potential of the company, and look forward to following their progress\".Summers, who was also once the president of Harvard University, said on Monday that he would be stepping back from public commitments over his ties to Epstein. The recently released emails showed Summers communicated with Epstein until the day before Epstein's 2019 arrest for the alleged sex trafficking of minors.In a statement, the artificial intelligence company said it respected Summers' decision to resign. \"We appreciate his many contributions and the perspective he brought to the Board,\" OpenAI said. The news comes after both chambers of Congress agreed on Tuesday to pass a measure to require the US justice department to release its files on Epstein. The measure will then head to the desk of US President Donald Trump for approval. He has said he plans to sign the bill, after reversing his position on the issue following pushback from his supporters. A batch of Epstein-related emails released by the House Oversight Committee last week mentioned a number of high-profile figures in the financier's former circle, without indicating any legal wrongdoing by those figures.The emails indicated that Summers and Epstein dined together frequently, with Epstein often trying to connect Summers to prominent global figures. After the emails were shared with the public, Summers said he took \"full responsibility for my misguided decision to continue communicating with Mr Epstein\". He added that he wanted \"to rebuild trust and repair relationships with the people closest to me\".Summers held senior posts under two Democratic presidents; serving as treasury secretary under Bill Clinton, and as director of the National Economic Council under Barack Obama. He led Harvard from 2001 to 2006 and remains a professor there. When announcing his step-down from public commitments earlier on Monday, he said he would continue his teaching commitments.Following Summers' announcement on Monday, the Center for American Progress, a liberal think tank in Washington where Summers was a senior fellow, confirmed that Summers was no longer affiliated with the organisation.Summers joined the board of OpenAI, which makes ChatGPT, in 2023 - following a failed attempt to oust its chief executive Sam Altman. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Larry Summers resigns from OpenAI board after Epstein emails made public",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bda7/live/8d653c50-c546-11f0-88be-3bc2aea1a256.jpg"
      ],
      "datePublished": "2025-11-19T13:32:11.000Z",
      "dateModified": "2025-11-19T13:32:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israeli strikes in Gaza kill 25 Palestinians, health ministry says",
    "url": "https://www.bbc.com/news/articles/c62e27j69q9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ee12/live/26ae8300-c572-11f0-92f5-0fd46a9dc2cf.jpg",
    "tag": "Trending",
    "date": "2025-11-19T18:45:35.000Z",
    "description": "1 hour agoRushdi Abualouf,Gaza correspondent, in Istanbul and David GrittenAt least 25 Palestinians have been killed in Israeli strikes across the Gaz",
    "body": "1 hour agoRushdi Abualouf,Gaza correspondent, in Istanbul and David GrittenAt least 25 Palestinians have been killed in Israeli strikes across the Gaza Strip, the Hamas-run health ministry has said. Ten people, including a woman and a young girl, were killed when a ministry of religious endowments building in the eastern Zeitoun neighbourhood of Gaza City was hit, according to rescuers.The Israeli military said it had struck \"Hamas terrorist targets\" after it said gunmen had opened fire towards an area where its soldiers were operating in the southern city of Khan Younis, in violation of the five-week-old ceasefire agreement.There was no immediate comment from Hamas.The flare-up of violence comes after the UN Security Council passed a resolution that endorsed US President Donald Trump's Gaza peace plan to end two years of devastating war.Mahmoud Bassal, a spokesman for Gaza's Hamas-run Civil Defence agency, told the BBC that Israeli air, drone and artillery strikes hit several locations in Gaza City and Khan Younis shortly after sunset on Wednesday.The attacks marked a sharp escalation after several days of relative calm, he said.The Civil Defence reported that the strike in Zeitoun caused severe damage to the religious endowments ministry's building and surrounding structures, and posted a video showing its rescue workers appearing to find two people buried under rubble.Photos published by the Anadolu news agency meanwhile showed the bodies of three young children reportedly recovered from the scene.In a separate incident in Gaza City, one person was killed and several others were wounded when a drone struck a group of people at Shejaiya junction on Salah al-Din Street, Gaza's main north-south road, according to Mr Bassal.He said another person was killed when a tank shell struck a house belonging to the Balboul family in Shejaiya's Mushtaha Street, which is also in eastern Gaza City.In Khan Younis, three people were killed and a number were wounded in a strike on a group inside a sports club run by the UN agency for Palestinian refugees (Unrwa), he added.In a statement, the Israel Defense Forces (IDF) said that \"several terrorists opened fire toward the area where IDF soldiers are operating in Khan Younis\" earlier on Wednesday.\"This action constitutes a violation of the ceasefire agreement. No IDF injuries were reported,\" it added. \"In response, the IDF began striking Hamas terrorist targets across the Gaza Strip.\"Israeli public broadcaster Kan cited a security source as saying the targets of the strikes were the commander of the Zeitoun Battalion of Hamas's military wing, the Izz al-Din al-Qassam Brigades, and the commander of its naval force.On Monday, the UN Security Council passed a resolution that sought to shore up the fragile ceasefire, which took effect on 10 October.Member states authorised the creation of a transitional governance body called the Board of Peace, which will be chaired by President Trump, and a temporary International Stabilisation Force (ISF), which will be tasked with ensuring \"the process of demilitarizing the Gaza Strip\".Trump hailed the resolution as \"a moment of true historic proportion\".A Hamas statement reiterated that the group would not give up its weapons without a Palestinian state, arguing its fight against Israel was legitimate \"resistance\".Israel's ambassador to the UN stressed the importance of disarmament, saying that his country would \"not stop or let up\" until Hamas no longer presented \"a threat\".The Israeli military launched an offensive in Gaza in response to the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.At least 69,500 people have been killed in Israeli attacks in Gaza since then, including 280 during the ceasefire, according to the territory's Hamas-run health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israeli strikes in Gaza kill 25 Palestinians, health ministry says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ee12/live/26ae8300-c572-11f0-92f5-0fd46a9dc2cf.jpg"
      ],
      "datePublished": "2025-11-19T18:45:35.000Z",
      "dateModified": "2025-11-19T18:45:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Instagram and Facebook-owner Meta notifies Australian teens of accounts shutdown",
    "url": "https://www.bbc.com/news/articles/cz919xyx7weo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/df66/live/e58d6e40-c567-11f0-ac47-e3b40c46275e.jpg",
    "tag": "Trending",
    "date": "2025-11-19T17:31:45.000Z",
    "description": "3 hours agoDearbail Jordan and Simon AtkinsonYounger Australian teenagers on Instagram, Facebook and Threads are being told their accounts will be shu",
    "body": "3 hours agoDearbail Jordan and Simon AtkinsonYounger Australian teenagers on Instagram, Facebook and Threads are being told their accounts will be shut down ahead of the country's social media ban for under-16s.Meta, which owns the three brands, said it had begun notifying users it believes to be between 13 and 15 years old by text, email and in-app messages that their accounts would start being deactivated from 4 December.The ban in Australia comes into force on 10 December. It affects a number of platforms which also include TikTok, YouTube, X and Reddit.Prime Minister Anthony Albanese said the \"world-leading\" ban was aimed at \"letting kids be kids\". Meta and other firms oppose the measure but said they would comply. Australia's internet regulator has estimated there are 150,000 Facebook users and 350,000 teens on Instagram in the 13-15 age bracket.From 4 December, children aged below 16 will not be able to create accounts on Meta's social media platforms. The company said it was asking young users to update their contact details so they could be notified when they became eligible to open an account. They can download and save their posts, videos and messages before their accounts are shut down.Meta said that teens who said they were old enough to use Instagram, Facebook and Threads could challenge the restriction by taking a \"video selfie\" to be used in facial age scans.They could also provide a driver's licence or other government issued-ID.All these verification methods were tested by the UK-based Age Check Certification Scheme (ACCS) earlier this year, in a report commissioned by the Australian state.While the ACCS said that all methods had their merits, it added: \"We did not find a single ubiquitous solution that would suit all use cases, nor did we find solutions that were guaranteed to be effective in all deployments.\"Social media platforms which fail to take \"reasonable steps\" to block under-16s face fines of up to A$50m (£25m). \"While we are working hard to remove all users who we understand to be under the age of 16 by 10 December, compliance with the law will be an ongoing and multi-layered process,\" Antigone Davis, vice-president and global head of safety at Meta, told Reuters Financial.Meta wants to see a law where under-16s have to get parental approval before they download a social media app. The firm told Australia's Seven News: \"Teens are resourceful, and may attempt to circumvent age assurance measures to access restricted services.\"But it said: \"We're committed to meeting our compliance obligations and are taking the necessary steps to comply with the law.\"Australia's e-Safety Commissioner, Julie Inman Grant, said the ban was aimed at proctecting teens \"from pressures and risks they can be exposed to while logged in to social media accounts\".In a move seemingly to avoid being included in the ban, gaming platform Roblox this week announced that children under 16 would be unable to chat to adult strangers.Mandatory age checks will be introduced for accounts using chat features, starting in December for Australia, New Zealand and the Netherlands, then the rest of the globe from January.The e-safety commissioner has published a list of which social media platforms will be impacted by the age ban.They are: FacebookInstagramKickRedditSnapchatThreadsTikTokX (formerly Twitter)YouTubePlatforms not included are:DiscordGitHubGoogle ClassroomLEGO PlayMessengerRobloxSteam and Steam ChatWhatsAppYouTube Kids",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Instagram and Facebook-owner Meta notifies Australian teens of accounts shutdown",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/df66/live/e58d6e40-c567-11f0-ac47-e3b40c46275e.jpg"
      ],
      "datePublished": "2025-11-19T17:31:45.000Z",
      "dateModified": "2025-11-19T17:31:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shabana Mahmood hints at shake-up of 'irrational' police structure",
    "url": "https://www.bbc.com/news/articles/cj9790jw34po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2911/live/dd5ea250-c569-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-11-19T17:20:57.000Z",
    "description": "3 hours agoDaniel SandfordUK correspondentThe Home Secretary Shabana Mahmood has hinted that she is thinking of changing how policing in England and W",
    "body": "3 hours agoDaniel SandfordUK correspondentThe Home Secretary Shabana Mahmood has hinted that she is thinking of changing how policing in England and Wales is organised.She told a conference of police leaders \"the structure of our police forces is, if we are honest, irrational\".Mahmood said \"disparities in performance\" meant that policing in England and Wales was a \"postcode lottery\".Some police chiefs want the number of forces to be reduced. Currently, there are 43  in England and Wales. The government is expected to publish a White Paper on the future of policing next month.The home secretary was talking at a conference of police leaders organised by the National Police Chiefs' Council (NPCC) and the Association of Police and Crime Commissioners (APCC). Last week the Home Office announced that the role of Police and Crime Commissioner (PCC) would be abolished. Mahmood told delegates on Wednesday the position \"had not worked\".She told the conference \"I was a reformer at the Ministry of Justice. I will be a reformer at the Home Office too.\"Mahmood told the delegates - mostly senior officers and Police and Crime Commissioners: \"The structure of our police forces is, if we are honest, irrational.\"We have loaded critical functions like the national police air service and vetting onto local forces, drawing attention away from neighbourhood policing.\"We have 43 forces tackling criminal gangs who cross borders, and the disparities in performance in forces across the country have grown far too wide, giving truth to the old store that policing in this country is a postcode lottery.\"She said the government's plans would be laid out in a White Paper due in December, saying she wanted to see \"that national policing is world class without distracting local forces from neighbourhood policing\".\"The detail will follow,\" she said. She did not stay behind to answer questions.Some police chiefs favour a reduction in the number of forces. In July, Gavin Stephens, NPCC chair, said: \"A smaller number of police forces, supported by a national policing organisation, would enable us to make decisions far quicker and maximise funding to invest in technology and our workforce.\"But some local PCCs have opposed the idea of force mergers. Last week the Policing Minister Sarah Jones said the role would be abolished. PCCs are elected officials, but elections have often had a limited turnout. The role was created by the Conservative-Liberal Democrat coalition government in 2012.The home secretary said in her speech on Wednesday: \"I believe the position of a Police and Crime Commissioner, unfortunately, has not worked.\"Without necessary investment in creating a public profile, too many voters were unaware of the existence of the position, or its occupant.\"Police forces are also waiting for the latest funding settlement which is due in early December.Paul Sanford, Chief Constable of Norfolk Constabulary and Chair of the NPCC Finance Coordination Committee, said: \"Policing is in a state of financial distress.\"We are seeing declining financial resilience across all forces.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shabana Mahmood hints at shake-up of 'irrational' police structure",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2911/live/dd5ea250-c569-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-19T17:20:57.000Z",
      "dateModified": "2025-11-19T17:20:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cornwall woman among five killed in snowstorm in Chile",
    "url": "https://www.bbc.com/news/articles/cy8v08109l2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0d5f/live/25b4eb20-c54e-11f0-931b-0140a9c2c0ce.jpg",
    "tag": "Trending",
    "date": "2025-11-19T14:56:03.000Z",
    "description": "5 hours agoChloe ParkmanSouth WestVisit Isles of ScillyVictoria Bond is among five killed in a snowstorm in ChileA British woman is among five people ",
    "body": "5 hours agoChloe ParkmanSouth WestVisit Isles of ScillyVictoria Bond is among five killed in a snowstorm in ChileA British woman is among five people who have died in a snowstorm in Chilean Patagonia.Victoria Bond, 40, a public relations consultant from Cornwall, was named by authorities in Chile as among those killed in the tourist hotspot of Torres del Paine National Park, in the south of the country.Along with Ms Bond, two German and two Mexican citizens died in the snowstorm, according to Jose Antonio Ruiz, the presidential delegate of the Magallanes region of southern Chile. Their bodies were found on Tuesday.Visit Isles of Scilly chairman Andrew Sells said the organisation, which Ms Bond worked for, was \"utterly devastated\" by her death.Visit Isles of Scilly said Ms Bond had headed up its public relations for more than six years and was on a \"trip of lifetime\" with friends in Argentina and Chile.She was out hiking when she became trapped in the storm, the organisation said.Mr Sells said she had \"worked tirelessly\" in her role to promote the islands, 28 miles off the Cornish coast, and was an \"integral part\" of the team. He said: \"She was always a joy to work with, and I cannot praise her work too highly. She is an enormous loss to the community.\"Euan Rodger, executive vice-chairman of Visit Isles of Scilly, said the organisation was \"heartbroken\".\"She brought life, energy, and an infectious enthusiasm to every project, making her a true joy to work alongside,\" he said.'Leaves a huge hole'Adrian Jones, who worked with Ms Bond promoting the Roseland Festival in Cornwall, paid tribute to her as \"lovable, witty and creative\".\"She was a doer... she had ideas and she saw them through,\" he said.\"She will leave a huge hole in Portscatho... she lived in Newquay but she spent a lot of the time in Portscatho.\"He described her as adventurous.\"Unbelievably sad as it may seem, she was doing what she lived life for,\" he said.'Intense' snowfallChilean officials said the search for victims had ended and the focus was now on repatriating the bodies and liaising with foreign consulates.Chilean President Gabriel Boric Font paid tribute to search and rescue teams who worked in \"intense\" snowfall and winds reaching speeds of up to 118mph (190km/h).He said in a post on X: \"To the families, friends, and loved ones of the five individuals of Mexican, German, and British nationalities who tragically lost their lives in the incident that occurred in Torres del Paine, I extend my deepest condolences.\"Know that you have the full support and collaboration of Chilean authorities and institutions during these difficult times.\"The Foreign, Commonwealth and Development Office said: \"We are supporting the family of a British woman who has died following an incident in Chile and are in contact with the local authorities.\"Related internet links",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cornwall woman among five killed in snowstorm in Chile",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0d5f/live/25b4eb20-c54e-11f0-931b-0140a9c2c0ce.jpg"
      ],
      "datePublished": "2025-11-19T14:56:03.000Z",
      "dateModified": "2025-11-19T14:56:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Altrincham bar bans solo-drinkers to 'protect customers' ",
    "url": "https://www.bbc.com/news/articles/cnve4eypg8zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f5d5/live/ec59bcb0-c4a4-11f0-b1f8-8b57d1c9aaed.jpg",
    "tag": "Trending",
    "date": "2025-11-19T06:14:43.000Z",
    "description": "'I've banned solo drinkers from my bar'14 hours agoLynette HorsburghNorth WestGreensmith PhotographyCarl Peters says he takes pride in how safe his cu",
    "body": "'I've banned solo drinkers from my bar'14 hours agoLynette HorsburghNorth WestGreensmith PhotographyCarl Peters says he takes pride in how safe his customers feel in AlibiThe owner of a cocktail and karaoke bar where solo drinkers are banned says he is baffled by the furore it has caused on social media as the policy is \"for the safety of all guests\".Carl Peters said the no-single-entry policy after 21:00 had been in place since the opening of Alibi in Altrincham, Greater Manchester, in 2022.He told the BBC it was to \"mitigate risk\" and \"protect his customers\" from being \"mithered\" by solo drinkers.He posted a reel on Instagram earlier this month about the policy after saying someone had accused him of discrimination. He said he was \"astounded\" by the ensuing criticism, describing his venue as an \"inclusive and safe environment\".The ban got a mixed response from Instagram users with one commenter saying she \"always feels safe in Alibi\", while another described the policy as \"narrow minded\", adding if he finishes work late and goes for a drink himself \"he has never once mithered anyone and... happy in my own company\".Alibi/InstagramA man claimed the policy was \"discrimination\", Mr Peters saysMr Peters explained there were two reasons why he introduced the policy.Firstly, if someone on their own has a seizure or an accident with no-one with them \"in a late night busy bar environment, it's an absolute nightmare for us to deal with\".He said also \"sometimes if you let people in on their own, the reason why they're on their own is that they've got no-one to talk to, so they start mithering other groups\".\"So what we do as a venue is we just eliminate that.\"He added: \"Unless you're with a group and we know who you're with, then you're not coming in.\" Mr Peters added he took \"pride that his customers feel safe in his venue\" so was \"astounded\" it was now being criticised on social media. More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Altrincham bar bans solo-drinkers to 'protect customers' ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f5d5/live/ec59bcb0-c4a4-11f0-b1f8-8b57d1c9aaed.jpg"
      ],
      "datePublished": "2025-11-19T06:14:43.000Z",
      "dateModified": "2025-11-19T06:14:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Good for mortgages, bad for food prices - how inflation dip affects you",
    "url": "https://www.bbc.com/news/articles/c1wlrw8ygvxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9234/live/3aa10aa0-c530-11f0-89b2-992f173b35b9.jpg",
    "tag": "Trending",
    "date": "2025-11-19T12:21:44.000Z",
    "description": "8 hours agoKevin PeacheyCost of living correspondentGetty ImagesWalk around your local supermarket and you'll struggle to find much that's healthy for",
    "body": "8 hours agoKevin PeacheyCost of living correspondentGetty ImagesWalk around your local supermarket and you'll struggle to find much that's healthy for your finances on the shelves - food price rises are accelerating.The cost of the weekly shop is, and will continue to be, a worry for millions of people.Beyond just food, prices of goods and services in general are going up, but the rate of those price rises has slowed.And that is likely to bring better news for the cost of borrowing, in particular mortgage rates for homeowners and first-time buyers.Are prices going up or down?Prices pretty much always rise. Official statistics chart the movement in the cost of hundreds of goods and services in the UK.It is the rate of increase that is crucial, and that inflation rate is published every month by the Office for National Statistics (ONS).On Wednesday, the ONS said the rate of inflation had fallen to 3.6%, which means prices are rising more slowly than they were and will foster hope that inflation has peaked.Delve a little further into the data, and there are more details about what is behind the latest trends. For example, fish, vegetables, chocolate and confectionary were among the products that rose in price, although fruit prices fell slightly.Recent research by the Bank of England found that people on average are still buying the same amount of food, but paying more for it. That said, they are changing the way they shop.\"Concerns about rising food costs and utility bills still dominate conversations,\" it said.\"Households continue to change their shopping habits to reduce spending, such as buying more vegetables and reducing meat consumption.\"Getty Images\"Staples like bread, meat and potatoes all cost more than they did even a month ago,\" says Danni Hewson, head of financial analysis at investment platform AJ Bell.But she does point to a silver lining - the dip in the inflation rate means the Bank of England is now more likely to cut interest rates in December.The Bank uses its benchmark interest rate - which heavily influences the cost of borrowing for households and businesses - to try to bring inflation to its target rate of 2%.\"Inflation remains well above the Band of England's happy place of 2%,\" says Alice Haine, personal finance analyst at Bestinvest.But, she says, the latest figures could pave the way for a sixth interest rate cut since August last year.The prospect of an interest rate cut has seen lenders make changes already. In recent weeks, many major lenders have lowered their rates for people getting a new fixed-rate mortgage or renewing their current one.\"There has been particular emphasis placed on rates for home movers with some of the best rates available for purchases,\" says David Hollingworth, of mortgage brokers L&C.Data from the financial information service Moneyfacts shows that the average rate on a new two-year fixed deal has fallen to 4.88%, and is down to 4.93% for the average five-year fixed deal.Average rates for those only able to put down a deposit of 5% or 10% - often first-time buyers - are now looking lower than they have been at any time in the last two or three years.Why are lenders cutting rates now?Inflation is only one factor in lenders' decisions to cut mortgage rates now.Generally, Christmas is a quiet time for the housing market as potential buyers and sellers concentrate on turkey and trimmings instead.So, they may be lowering rates in a bid to stimulate custom. The same cannot be said for savings rates. \"Competition has been scarce,\" says Caitlyn Eastell, from Moneyfacts. That is compounded by the fact that many of those buyers, sellers and savers have put plans on hold until they find out what happens in the Budget delivered by Chancellor Rachel Reeves on 26 November.The Budget looms large over the housing market, with talk of taxation on high value properties, as well as over economic activity in general. Reeves wants to introduce measures to lower the rate of inflation, and help people with the cost of living. However, she also needs to bring in more money or cut government spending to meet her own fiscal rules.It is a delicate balancing act that will affect individual and family finances, affecting the money people have to spend in the supermarket and the appetite they have to save, as well as buy or sell a home. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Good for mortgages, bad for food prices - how inflation dip affects you",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9234/live/3aa10aa0-c530-11f0-89b2-992f173b35b9.jpg"
      ],
      "datePublished": "2025-11-19T12:21:44.000Z",
      "dateModified": "2025-11-19T12:21:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "When will the Epstein files be released now that the Senate has agreed to make them public?",
    "url": "https://www.bbc.com/news/articles/cq50nvq8znvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b279/live/8ea738c0-c573-11f0-8c06-f5d460985095.jpg",
    "tag": "Trending",
    "date": "2025-11-19T17:12:37.000Z",
    "description": "When will the Epstein files be released and will they be redacted? 3 hours agoBernd Debusmann Jr,at the White House and Nardine SaadReutersSurvivors a",
    "body": "When will the Epstein files be released and will they be redacted? 3 hours agoBernd Debusmann Jr,at the White House and Nardine SaadReutersSurvivors and family members talk about Jeffrey Epstein files The US Congress has approved a measure to force the US Justice Department to release all files pertaining to its investigation into convicted paedophile Jeffrey Epstein. The bipartisan bill, which calls for the release of the files \"in a searchable and downloadable format\" within 30 days, cleared the Senate after it was overwhelmingly passed by the House of Representatives on Tuesday. It next needs the sign-off of President Donald Trump. The president urged fellow Republicans on Sunday to vote for the release of the records - abruptly reversing course after previously trying to draw a line under the controversy. He had faced push-back from Epstein victims and a brewing revolt from rank-and-file Republicans demanding the trove of documents be unsealed.Congress' lower chamber began debating the measure on Tuesday morning and voted within hours. Several of Epstein's victims spent the day on Capitol Hill advocating for the bill's passage. Nearly all the House lawmakers voted in favour of the resolution, which passed  427-1. Clay Higgins, a Louisiana Republican, was the only lawmaker who voted against the bill. Two Republicans and three Democrats did not vote.The House Oversight Committee has already made public thousands of documents from the Epstein estate relating to the late financier, but the resolution passed on Tuesday covers material currently in the possession of the justice department.Those records could, in theory, include files about imprisoned Epstein co-conspirator Ghislaine Maxwell, as well as figures - including government officials - mentioned in the case. It could also include internal justice department documents. When will Trump sign the bill? On Wednesday morning, the Senate confirmed that it had passed the Epstein bill and sent it to Trump.The president has indicated he will sign the measure, though it is unclear exactly when he will do so. On his Truth Social platform on Tuesday night, he posted that he did not care when the Senate passed the bill.He urged Republicans not to lose sight of \"all of the Victories that we've had\" under his presidency.Once the US president signs the measure, the justice department will have 30 days to release its materials on Epstein.But there are obstacles to the files being shared even if Trump signs the bill.  The House bill said the justice department can hold back any documents that \"jeapordise an active federal investigation or ongoing prosecution, provided that such withholding is narrowly tailored and temporary\". That could potentially lead to delays, given that Trump has called for investigations into Epstein's links with prominent Democrats, such as Bill Clinton and Larry Summers, \"to determine what was going on with them, and him\".Clinton has strongly denied he had any knowledge of Epstein's crimes, whereas Summers has apologised for his \"misguided decision\" to continue communicating with Epstein until 2019.\"That's a potential hurdle,\" Jonathan Entin, a constitutional law professor at Case Western Reserve University in Ohio, told the BBC. \"If, in fact, this is a serious investigation, presumably the prosecutors will not want everything out there while they're sorting out whether they bring charges.\" For those who have campaigned for the release of the files, anything short of full disclosure is likely to spark further questions and even outrage. Several Republican lawmakers have expressed worries that Trump's order to the justice department to investigate Epstein's ties could slow the release of the files.Thomas Massie, a Kentucky congressman, vowed that he and fellow Republican dissident Marjorie Taylor Greene, of Georgia, would \"absolutely\" go to the floor of the House and read out the names of \"some of the men\" in the files if the records were not duly released by the justice department.Watch: How much do Americans care about the Epstein story?Will the files be redacted?In addition to possible delays, the public is also likely to see lots of redactions in any release of new Epstein documents. In the tranche of files released by the House Oversight Committee last week, names and phone numbers were frequently blacked out to protect privacy. The latest bill says the attorney general can \"withhold or redact\" records that include victims' names, medical files and other personal information that \"would constitute a clearly unwarranted invasion of personal privacy\".\"Simply letting anything out could reveal a lot of private information that's not relevant or appropriate for public consumption,\" Prof Entin said. The attorney general can also withhold classified material and images of sexual abuse.The justice department has already said that a \"large volume\" of its 300 gigabytes of data from Epstein investigations includes images and videos of minors and thousands of downloaded videos and images of child sex abuse.Other information in the documents could be protected by grand jury secrecy rules, which the latest bill does not explicitly address.US Attorney General Pam Bondi said on Wednesday morning when asked about the Epstein files during an unrelated news conference: \"We'll continue to follow the law with maximum transparency, while protecting victims.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "When will the Epstein files be released now that the Senate has agreed to make them public?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b279/live/8ea738c0-c573-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-19T17:12:37.000Z",
      "dateModified": "2025-11-19T17:12:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Norwich MP Clive Lewis offers seat to Burnham for Starmer challenge",
    "url": "https://www.bbc.com/news/articles/c4gwgdyl52lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c9d2/live/3865df80-c563-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "Trending",
    "date": "2025-11-19T18:14:52.000Z",
    "description": "2 hours agoPaul Moseley,Norfolk political reporter and Brian Wheeler,Political reporterLabour MP Clive Lewis has offered to give up his seat to allow ",
    "body": "2 hours agoPaul Moseley,Norfolk political reporter and Brian Wheeler,Political reporterLabour MP Clive Lewis has offered to give up his seat to allow Andy Burnham to challenge Sir Keir Starmer for the Labour leadership.There has been ongoing speculation that Greater Manchester Mayor Burnham wants to take on Sir Keir for the top job, but he would need to be an MP to do so.Lewis told the BBC's Politics Live that he was willing to step down from his Norwich South seat to allow Burnham to return to the Commons and put \"country before party, party before personal ambition\".Burnham was contacted for comment. Number 10 declined to comment.Lewis, who has been an MP for 10 years, said he had spoken to Burnham, and when asked if he would give up his seat for him, he said it was \"a question I've asked myself\".He added: \"Do you know what? If I'm going to sit here and say country before party, party before personal ambition, then yes, I have to say yes, don't I.\"Last week, he said Sir Keir's position as prime minister was \"untenable\" and told Channel 4 News that Burnham should be given the chance to \"step up\".Later, the Sun's political editor Kate Ferguson said that Lewis had told her he had \"no plans to stand down\".She reported on X that he said: \"A hypothetical question was put to me, and my answer was consistent with what I've been saying, that I am serious about putting country before party.\"Lewis first won his seat in 2015, and last year he increased his majority to more than 13,000.But if he were to step down, any would-be successor would first need to win a selection contest before a by-election was held.Health Secretary Wes Streeting - who last week denied claims he was plotting a leadership bid of his own - told LBC he thought it was a \"peculiar\" move by the Norwich South MP. \"I've got a lot of time for Andy and I think we need our best players on the pitch,\" Streeting said. \"And whether he's doing that as mayor of Greater Manchester or whether he wants to come back into parliament in the next general election, that is an issue for Andy.\"I think it's a bit of a peculiar thing for Clive to have said to his own constituents, 'Oh, well, I'm not interested in being your MP, I'm happy to do a deal with someone'. \"I would just say from personal experience, don't take your voters for granted.\"In September, Burnham said he had \"no intention of abandoning Manchester\" but did not rule out challenging Sir Keir after a series of interviews in which he said colleagues had been urging him to stand.Two Manchester Labour MPs, Andrew Gwynne and Graham Stringer, ruled out standing down for him ahead of the party's conference in September.Sir Keir has, meanwhile, said he will lead Labour into the next general election. It came after a bruising time last week, when anonymous briefings were given to journalists that some cabinet ministers - including Streeting - were plotting to oust him.The ministers concerned have insisted this is not the case - but speculation continues about whether the PM will face a challenge in May, when Labour is expected to do badly in Scottish and Welsh elections, and in English local elections. Anyone mounting a leadership bid would have to secure the backing of 80 Labour MPs.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Norwich MP Clive Lewis offers seat to Burnham for Starmer challenge",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c9d2/live/3865df80-c563-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-19T18:14:52.000Z",
      "dateModified": "2025-11-19T18:14:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ultra-processed food is global health threat, experts warn",
    "url": "https://www.bbc.com/news/articles/cy4pjjzd784o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a0dc/live/7ab81ae0-c565-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2025-11-19T12:53:04.000Z",
    "description": "7 hours agoPhilippa RoxbyHealth reporterAction is needed now to reduce ultra-processed food (UPF) in diets worldwide because of their threat to health",
    "body": "7 hours agoPhilippa RoxbyHealth reporterAction is needed now to reduce ultra-processed food (UPF) in diets worldwide because of their threat to health, say international experts in a global review of research.They say the way we eat is changing - with a move away from fresh, whole foods to cheap, highly-processed meals - which is increasing our risk of a range of chronic diseases, including obesity and depression.Writing in The Lancet, the researchers say governments need \"to step up\" and introduce warnings and higher taxes on UPF products, to help fund access to more nutritious foods.However some scientists say this review can not prove that UPFs directly cause health harms and more research and trials are needed to show that.Ultra-processed foods are defined as containing more than five ingredients you would not find at home in your kitchen cupboard, such as emulsifiers, preservatives, additives, dyes and sweeteners. Examples of UPFs include sausages, crisps, pastries, biscuits, instant soups, fizzy drinks, ice cream and supermarket bread. Surveys indicate these industrially-manufactured foods are on the rise in diets around the world, worsening the quality of what we eat with too much sugar and unhealthy fats and a lack of fibre and protein.This review of evidence on the impact of UPFs on health, carried out by 43 global experts and based on 104 long-term studies, suggests these foods are linked to a greater risk of 12 health conditions.These include type 2 diabetes, cardiovascular disease, kidney disease, depression and dying prematurely from any cause.Review author Prof Carlos Monteiro, from the University of Sao Paulo in Brazil, who set up the Nova classification system for categorising food, said the growing consumption of ultra-processed foods \"is reshaping diets worldwide, displacing fresh and minimally processed foods and meals\".\"This change in what people eat is fuelled by powerful global corporations who generate huge profits by prioritising ultra-processed products, supported by extensive marketing and political lobbying to stop effective public health policies to support healthy eating,\" he added.Co-author Dr Phillip Baker, from the University of Sydney, said the answer was \"a strong global public health response - like the coordinated efforts to challenge the tobacco industry\".The review acknowledges a lack of clinical trials showing exactly how UPFs damage health - but says that should not delay action to protect people worldwide from potential health harms.Some scientists have commented that it is difficult to untangle the effects of UPFs in people's diets from other factors in people's lives, such as lifestyle, behaviour and wealth.Critics of the Nova classification system say it relies too much on the level of processing in foods, and not on how nutritious that particular food is. For example, wholegrain bread, breakfast cereals, low-fat yoghurts, baby formula milk and fish fingers all count as ultra-processed but have lots of good in them.Prof Kevin McConway, emeritus professor of applied statistics at the Open University, said: \"A study like this can find a correlation, but it can't be certain about cause and effect.\"He said there was still \"room for doubt and for clarification from further research\".\"It seems to me likely that at least some UPFs could cause increases in the risk of some chronic diseases. But this certainly doesn't establish that all UPFs increase disease risk.\"It is still not clear what it is about ultra-processed foods that could be causing or contributing to diseases.Prof Jules Griffin, from the University of Aberdeen, said there were some positive sides to food processing, and more research to understand how it influences our health was \"urgently needed\".The Food and Drink Federation (FDF), which represents the industry, says UPFs can form part of a balanced diet, like frozen peas and wholemeal bread.\"Companies have been making a series of changes over many years to make the food and drink we all buy healthier, in line with government guidelines,\" says Kate Halliwell, chief scientific officer at the FDF.The amount of sugar and salt in products on sale in shops and supermarkets has gone down by a third since 2015, she added.The UK's Scientific Advisory Committee on Nutrition said earlier this year that the association between higher consumpton of ultra-processed foods and adverse health outcomes was \"concerning\".But it added it was \"unclear\" whether these foods are unhealthy due to processing or because many of them are high in calories, saturated fat, salt and free sugars.Current UK government advice on diet is to eat more fruit, vegetables and fibre, and cut back on sugar, fat and salt.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ultra-processed food is global health threat, experts warn",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a0dc/live/7ab81ae0-c565-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-19T12:53:04.000Z",
      "dateModified": "2025-11-19T12:53:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]