[
  {
    "title": "Winter Olympics 2026 schedule and day-by-day guide",
    "url": "https://www.bbc.com/sport/articles/c338y36kngzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f362/live/71510460-0220-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-17T10:28:35.000Z",
    "description": "Bobsleigh: Two-man heats three and four (18:00)Can anyone stop the Germans and in particular pilot Francesco Friedrich, who is vying for a record fift",
    "body": "Bobsleigh: Two-man heats three and four (18:00)Can anyone stop the Germans and in particular pilot Francesco Friedrich, who is vying for a record fifth bobsleigh gold? The 35-year-old led a German 1-2-3 in this event in 2022 but this season Friedrich's long-time rival Johannes Lochner has had a decisive edge on the World Cup circuit. That was the case in runs one and two too, with Lochner leading Friedrich by 0.80. The British sled, featuring Brad Hall and Taylor Lawrence, are down in eighth, 0.40 off the medals. Freestyle skiing: Men's big air final (18:30-19:50)New Zealand's Luca Harrington will be aiming to add the Olympic title to the world title and World Cup title he won last season. He was fifth in qualification. But defending champion Birk Ruud of Norway is unlikely to give up his crown without a fight, and he qualified in third. USA's Mac Forehand and Austria's Matej Svancer were the top two in qualification. \"It's not so much about unfinished business,\" continued the American. \"It's more about making peace.\" Her main rivals are likely to be Croatian 21-year-old and slalom World Cup winner Zrinka Ljutic and Camille Rast, who last year became the first Swiss racer since 1991 to win the slalom world title.Snowboard: Men's slopestyle final (10:20-11:40) The last of the snowboard events at these Games should be a fascinating contest. Canadian veteran Mark McMorris, who has won slopestyle bronze at the last three Olympics, returns for a crack at an elusive gold, along with 2018 Olympic champion Red Gerard. Japan have a crop of exciting young stars.Snowboard: Women's slopestyle final (13:30-14:50 - re-arranged from Tuesday because of weather)British teenager Mia Brookes was a potential medal hope in this event but she is not in the final after finishing 16th in qualification. Reigning Olympic and world champion Zoi Sadowski-Synnott of New Zealand topped qualification, ahead of the Netherlands' Melissa Peperkamp. The rest of the field were at least nine points behind the pair. The riders have three runs to impress the judges, with their best score counting.Ski mountaineering: Women's and men's sprint finals (12:55 and 13:15)Bormio is synonymous with downhill skiing but some athletes will also be attempting to go uphill in the only new sport at these Winter Olympics – ski mountaineering, or skimo for short. Skiers race up and down a steep course on skis, 'skins' (strips of fabric attached to the bottom of skis) and on foot, putting on or taking off their equipment in transition areas between sections. Two of the three golds on offer will be decided today in the sprint races, which consist of several knockout contests. France's Emily Harrop, whose parents are British but who was born and bred in the French Alps, is the women's favourite (heats start at 08:50), with the men's heats at 09:30.Figure skating: Women's free skate (18:00-22:10)The women's figure skating is always one of the highlights of any Winter Olympics, but in 2022 it was one of the most upsetting events. It concluded with 15-year-old Kamila Valieva leaving the ice distressed after an error-strewn performance that followed her positive drugs test. The contest for gold in Milan-Cortina promises to be an intriguing battle – reigning world champion Alysa Liu and revitalised team-mate Amber Glenn are aiming to become the first USA winner of this title for 24 years, while Japan's three-time former world champion Kaori Sakamoto is hoping for a first Olympic gold in her farewell season. But could the latest young Russian talent Adeliia Petrosian – who will be competing as a neutral athlete – emerge as a contender?Ice hockey: Women's gold medal game (18:10) Thursday's final will almost certainly be the latest chapter in the increasingly bitter rivalry between the two dominant teams in women's hockey, Canada and the USA. The pair have contested six of the seven gold medal matches at the Olympic and met in 23 of 24 finals at World Championship level. The Canadians usually have the edge when it matters most and claimed their fifth Olympic crown in 2022.Freestyle skiing: Women's halfpipe run one and two (18:30-20:25)Zoe Atkin, one of Britain's biggest medal hopes at these Games, begins her quest to emulate big sister Izzy and win an Olympic medal. The 23-year-old Stanford University student is the reigning world champion and also the joint-winner of the overall World Cup title last season. However, she will face a strong field, including China's defending champion Eileen Gu and Li Fanghui, who was the other major force in the 2024-25 campaign.Freestyle skiing: Women's ski cross (09:00-12:35) The exciting sport of ski cross involves plenty of drama and the last Olympics was no exception, as Switzerland's Fanny Smith well knows. She was demoted from bronze in the aftermath of her race, only for the decision to eventually be overturned – she received her medal more than a year later. Now the reigning world champion, Smith again faces Sweden's Sandra Naeslund and Canada's Marielle Thompson, the gold and silver medallists from Beijing.Ice hockey: Men's semi-finals (15:40 & 20:10)The Milano Santagiulia Ice Hockey Arena is host to a semi-final double header, with the two winners advancing to Sunday's final and the losers playing off for bronze. Canada are nine-time Olympic champions, while the USA last took the title in 1980.Freestyle skiing: Men's halfpipe final (18:30-20:05)Expect a thrilling contest for gold. With New Zealand's 2022 gold medallist Nico Porteous announcing last summer that he was stepping away from the sport, there is a gap to be filled – and the title could stay in Kiwi hands as 19-year-old Finley Melville Ives is the current world champion. Alex Ferreira won silver in 2018 and bronze in 2022, and fellow American Nick Goepper has his sights set on winning a medal at a fourth consecutive Games, having made the slopestyle podium in 2014, 2018 and 2022.Curling: Women's gold medal game (10:05-13:20)This event proved the highlight – and saving grace – of Britain's Winter Olympics four years ago, when Eve Muirhead and her team clinched GB's only gold of the Games on the final day in Beijing. With only one member of that gold-winning quintet competing in Milan-Cortina, a repeat might be unlikely.Ice hockey: Men's gold medal game (13:10)Each of the last three men's ice hockey finals has produced a different winner – so could a new name be added to the roll of honour at the Milano Santagiulia Ice Hockey Arena? Canada have claimed a record nine Olympic golds and the return of NHL players is a boost to their chances. That also applies to the USA, who haven't won the title since 1980's 'Miracle on Ice', while Finland are the reigning champions.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winter Olympics 2026 schedule and day-by-day guide",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f362/live/71510460-0220-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-17T10:28:35.000Z",
      "dateModified": "2026-02-17T10:28:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential ch",
    "body": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Is It The End Of The Global Order As We Know It? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n1g1c9?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-02-16T16:41:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·16 Feb 2026,·31 minsIs It The End Of The Global Order As We Know It?NewscastAvailable for over a yearToday, the government is considering accelerating planned increases to defence spending. \nThe news comes after the PM dropped some heavy hints that he was ready to spend more on defence during his speech at the Munich Security Conference on Saturday. \nKatya Adler and James Landale drop by to explain how America is trying to rewrite the global order… and get Europe to sign on and Joe Pike explains why spending more on defence is never politically straightforward.\nPlus, Joe and Adam discuss the government’s decision to scrap it’s plans to postpone elections for 30 councils after recieving “legal advice”. They also review the government’s latest proposals to crack down on online safety for children and Starmer’s response to claims that a Labour Think Tank paid a private investigator to look into journalists. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Anna Harris with Shiler Mahmoudi. The social producer was Joe Wilkinson. The technical producer was Mike Regaard. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Is It The End Of The Global Order As We Know It? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-02-16T16:41:00.000Z",
      "dateModified": "2026-02-16T16:41:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Americast - Will the US Supreme Court stand up to Trump? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct8bz4?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg",
    "tag": "Trending",
    "date": "2026-02-13T15:15:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·13 Feb 2026,·30 minsWill the US Supreme Court stand up to Trump?AmericastAvailable for over a yearWill Donald Trump be legally allowed to proceed with key elements of his second term agenda - such as imposing global trade tariffs, ending birthright citizenship and the right to sack heads of independent agencies? As the Supreme Court prepares to rule on the legality of major policies from the Trump administration, we look at whether the court will stand up to Donald Trump, or further expand the power of the US presidency?  \nJustin and Anthony are joined by Kate Shaw, former Supreme Court clerk, and Professor of Law at the University of Pennsylvania’s Carey Law School.  We look at how SCOTUS (Supreme Court of the United States) has dealt with former presidents, and discuss criticism that the current makeup of SCOTUS justices are making Trump the most powerful president in US history.  \nHOSTS: \n• Justin Webb, Radio 4 presenter\n• Anthony Zurcher, North America Correspondent\nGUEST:\nKate Shaw, former Supreme Court clerk, Professor of Law at the University of Pennsylvania’s Carey Law School and co-host of the Strict Scrutiny podcast \nGET IN TOUCH: \n• Join our online community: https://discord.gg/qSrxqNcmRB \n• Send us a message or voice note via WhatsApp to +44 330 123 9480\n• Email Americast@bbc.co.uk\n• Or use #Americast \nThis episode was made by Purvee Pattni with Grace Reeve and Kris Jalowiecki. The technical producer was Mike Regaard. The series producer is Purvee Pattni. The senior news editor is Sam Bonham.\nIf you want to be notified every time we publish a new episode, please subscribe to us on BBC Sounds by hitting the subscribe button on the app. \nYou can now listen to Americast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Americast”. It works on most smart speakers.\nUS Election Unspun: Sign up for Anthony’s BBC newsletter: https://www.bbc.co.uk/news/world-us-canada-68093155 \nAmericast is part of the BBC News Podcasts family of podcasts. The team that makes Americast also makes lots of other podcasts, including Newscast and Ukrainecast. If you enjoy Americast (and if you're reading this then you hopefully do), then we think that you will enjoy some of our other pods too. See links below.\nNewscast: https://www.bbc.co.uk/sounds/series/p05299nl\nRadical: https://www.bbc.co.uk/sounds/brand/p0gg4k6r\nThe Global Story: https://www.bbc.co.uk/sounds/brand/w13xtvsdProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Americast - Will the US Supreme Court stand up to Trump? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0j72y80.jpg"
      ],
      "datePublished": "2026-02-13T15:15:00.000Z",
      "dateModified": "2026-02-13T15:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Italian toddler in critical condition after transplanted heart 'burned by frostbite'",
    "url": "https://www.bbc.com/news/articles/cpqw24v4dn9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b14b/live/2e29c4f0-0c12-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-17T12:43:57.000Z",
    "description": "4 hours agoLaura GozziGetty ImagesTop doctors will meet at the Monaldi hospital in Naples to decide whether the child is suitable for a new transplant",
    "body": "4 hours agoLaura GozziGetty ImagesTop doctors will meet at the Monaldi hospital in Naples to decide whether the child is suitable for a new transplantA toddler in Italy remains in critical condition after undergoing a transplant with a damaged heart.The organ, which was transported south from the from the city of Bolzano to Naples in December, was reportedly placed in an unsuitable container and in direct contact with dry ice, leading to severe tissue damage. The box also lacked a thermometer that could alert the medical team to the low temperature.The heart, which came from another young boy who drowned, arrived \"burned by frostbite,\" the child's family's lawyer, Francesco Petruzzi, said.Prosecutors have opened an investigation into the incident and six medics have been placed under formal investigation.The heart transplant went ahead in December but the child, who is just over two years old, had to be placed on life support shortly afterwards. He is now in a \"stable but critical condition\", according to the hospital where he is being treated.The longer the boy is kept on life support, the more serious the complications to his lungs, liver and kidneys could be.On Wednesday, a team of specialist doctors from major hospitals around Italy will convene to decide whether the child's current conditions make him suitable for a new transplant.\"I am not giving up,\" his mother Patrizia Mercolino told Italian media, adding she hoped the child could still be eligible for another donor heart.She has appealed to the Pope for help in finding a new organ for her son.Her lawyer said that if the doctors deemed another transplant not viable, the family would seek a third opinion.\"We must absolutely clarify what happened,\" said health minister Orazio Schillaci. \"We owe it to the child, to the family, but also to all Italians.\"\"We have an excellent national health service which has been able to handle and almost always resolve complex situations. So, I believe citizens should not lose faith.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Italian toddler in critical condition after transplanted heart 'burned by frostbite'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b14b/live/2e29c4f0-0c12-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-17T12:43:57.000Z",
      "dateModified": "2026-02-17T12:43:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ex-priest receives second lifetime ban for child sexual abuse",
    "url": "https://www.bbc.com/news/articles/c0e5gdvj719o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/77ba/live/868f0810-0c00-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-17T15:10:16.000Z",
    "description": "2 hours agoSteve SwannHome Affairs reporterBBCDavid Tudor has received a second lifetime ban from the Church of EnglandEx-Church of England priest Dav",
    "body": "2 hours agoSteve SwannHome Affairs reporterBBCDavid Tudor has received a second lifetime ban from the Church of EnglandEx-Church of England priest David Tudor has received a second lifetime ban from ministry after a tribunal found he groomed and sexually abused a 15-year-old girl in Surrey in the 1980s.It is the second time he has been convicted by a church tribunal of sexual abuse.The first ban was in October 2024 after he admitted sexually abusing two girls between 1982 and 1989.Now the tribunal is publishing its reasons and punishment after it found the former priest guilty of misconduct last November.Tudor's misconduct was \"egregious and of the utmost seriousness\" showing a \"deliberate and damaging failure to comply with the high standards of Christian behaviour\", the Southwark Bishops' Disciplinary Tribunal found.In a unanimous decision, the panel of five said it was \"satisfied that it is more likely than not that the Respondent (David Tudor) had sexual intercourse\" with a girl identified as \"Z\" when she was 15.The ruling outlined how Z had attended St Bede's school in Redhill in the 1980s where Tudor was chaplain and an RE teacher. She also went to his church and the youth club he ran from the parsonage where he lived in Reigate.\"She was looking for a father figure to speak to and confide in and from whom to get guidance,\" the tribunal said.Instead, the tribunal found that between April and September 1984, the priest - who was then 29 and had been in ministry for six years - groomed and sexually assaulted Z on multiple occasions when she was 15.\"This was not an opportunistic single event but a course of sexual misconduct in the context of grooming over a six-month period,\" the tribunal found.Z told the tribunal that when she confided in friends, they persuaded her to speak to the then Area Bishop of Croydon Wilfred Wood, and that he told her that Tudor \"was getting help with his behaviour\".She believed that because she told the Bishop, he would \"sort it out\".The judgement shows the police only became involved in early 1987 following a report to them by Z's parents.Tudor was subsequently charged and put on trial in 1988. He admitted having sex with Z when she was 16, but denied it had happened when she was 15.He was acquitted of the allegation that he had sexual intercourse with Z when she was under 16. But the following year, the Bishop of Southwark suspended him for five years following a finding of misconduct.We revealed how Archbishop of York Stephen Cottrell, then Bishop of Chelmsford, allowed Tudor, whom he described as a \"Rolls Royce priest\", to remain in post as a vicar under him for nine years - despite knowing about his history of sexual misconduct. Tudor, who refused to attend this latest hearing, had claimed the victim was being untruthful to claim compensation, and claimed her complaint \"was being used as a stick to beat the church.\"This was rejected by the tribunal panel which found Z \"gave a clear, consistent and cogent account of these events\" eloquently describing the effect that \"being groomed and abused when she was so young has had upon her throughout her life.\" In a victim impact statement, Z had explained this included an attempt to take her own life because of the \"intense shame and guilt\" she had felt.Z told the tribunal she had assumed Tudor \"would never be permitted to exercise a priestly ministry again and it came as a shock to find out in June 2023 that he had been exercising ministry in Canvey Island for many years.\"The decision referred to \"a particularly shocking aspect of events\" being the hate mail delivered to Z's home after the criminal trial in the 1980s, forcing the family to move house.  It added that Z had lost her Christian faith because of Tudor's abuse. According to the tribunal, this was \"a serious and grievous consequence particularly because this has happened through the misconduct of a priest.\"Following this latest penalty decision, Bishop of Southwark, Rt Rev Christopher Chessun said: \"It takes extraordinary courage to speak out and bring forward a complaint, and so I am grateful to the woman who shared her experience of David Tudor's harmful actions, and I apologise unreservedly for the pain and trauma he has caused.\"We are continuing to support and work with Independent Reviewers who are undertaking a Safeguarding Practice Review jointly commissioned by the National Safeguarding Team, and the dioceses of Chelmsford and Southwark.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ex-priest receives second lifetime ban for child sexual abuse",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/77ba/live/868f0810-0c00-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-17T15:10:16.000Z",
      "dateModified": "2026-02-17T15:10:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'A sad day' - curling cheating row at Winter Games unsettles Canadians",
    "url": "https://www.bbc.com/news/articles/c9dne166pwlo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ce46/live/f0dc41b0-097b-11f1-9479-1f22ed0be724.jpg",
    "tag": "Trending",
    "date": "2026-02-17T10:21:08.000Z",
    "description": "6 hours agoAna Faguy,Washington DCandEloise Alanna,MontrealWatch: 'Integrity in sport is important' - Canadians react to Olympic curling cheating rowA",
    "body": "6 hours agoAna Faguy,Washington DCandEloise Alanna,MontrealWatch: 'Integrity in sport is important' - Canadians react to Olympic curling cheating rowA scandal at the Winter Olympics has left the Canadian curling teams on the defensive and Canadians reeling over the crack in their country's polite persona.Over the weekend, Canadian curler Marc Kennedy had an expletive-filled outburst after Sweden accused him of cheating during a match, and later said his team might be the target of a \"premeditated\" attack by their rivals.Kennedy was accused of \"double-touching\" - touching the stone a second time after initially releasing it down the ice. The next day, Canadian women's captain Rachel Holman was accused of using the same move. Both have denied the accusations, but Canada's curling teams, who historically have dominated the sport, now face questions over their tactics. While the curlers have shown their anger over the situation during matches, fans of the sport and Canadians have questioned whether the team acted in the spirit of curling.In a country well known for its \"niceness\", the cheating row has stung for some. The BBC asked tourists and locals in Montreal what they made of it. \"It's a sad day for Canadian sport,\" said Tim Gray, from Alberta. \"Integrity in the sport is important, even if you have to call it on yourself.\"\"As Canadians, we aren't supposed to do these things,\" said Samar, from Ontario.Without sportsmanship, said Dwayne from British Columbia, it's not sport any more.There was a more nuanced take at the Royal Montreal Curling Club.One of the curling instructors, Ankara Leonard, said the publicity could be good for the sport by generating interest.She added: \"Do I think [Kennedy's] finger affects the rock? No I do not. Do I think we have to play within the rules? Yes.\"The controversy began on Friday when Swedish player Oskar Eriksson accused Kennedy of double-touching. As the game continued, Kennedy and Eriksson got into a verbal back-and-forth that included expletives. Their exchange quickly went viral as a video emerged that appeared to show Kennedy pushing the stone with his finger after releasing it.Kennedy got a verbal warning from World Curling for using foul language, but he was not formally charged with cheating by the governing body. ReutersCanada's Marc Kennedy was accused of double-touching stones when he released themThe next day, Kennedy said: \"I probably could have handled it better. But we're human out there and there's a lot of emotions. I'm not going to apologise for defending my teammates and standing up for myself.\" \"I've curled my whole life, never once with the intention of getting an advantage through cheating,\" he added. An opinion piece in the Canadian news outlet, the Globe and Mail, pointed to some of the frustration felt back home\"These Canadian curling teams are not fun bad guys. They come off like the sort of competitors who need so desperately to win that they will do anything - even things that are pointless - in order to get there.\"Cathal Kelly, the writer of the opinion piece, continued: \"There's an easy way out of this - stop struggling. Stop acting like our curling reputation matters more than our national one. Be the bigger man and woman, even if you don't think you did anything wrong.\"AFP via Getty ImagesCanada's Rachel Homan slammed the officials' decision to remove her stoneThere was a second cheating row on Saturday when match officials accused the Canadian women's team of the same double-touch violation.  Rachel Homan said there was a \"zero percent chance\" there had truly been a violation, as she and her teammates looked on in frustration. The Canadians lost to the Swiss, 8-7.On Sunday, Great Britain's men's team was accused of the same violation. Both Homan and British men's curler Bobby Lammie had stones removed from play due to alleged violations.Homan later slammed the officials' decision to remove her stone during a defeat to Switzerland, saying it was \"insane\".All of the incidents led World Curling to clarify that double-tapping is not allowed.\"During forward motion, touching the granite of the stone is not allowed. This will result in the stone being removed from play,\" they said.World Curling does not use video to review play, but they did send two officials to monitor how players released their stones in subsequent games. Curling columnist and Olympian Tomi Rantamaki, in an article for The Curling News, warned that Canada's dominance in the world of curling means its players should be mindful of the influence they have.\"Young players in Finland, Korea, Italy, Sweden - everywhere - often copy what Canadian teams do. They copy the athlete's delivery, the sweeping, the tactics, the communication,\" Rantamaki wrote. \"And they copy the behaviour.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'A sad day' - curling cheating row at Winter Games unsettles Canadians",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ce46/live/f0dc41b0-097b-11f1-9479-1f22ed0be724.jpg"
      ],
      "datePublished": "2026-02-17T10:21:08.000Z",
      "dateModified": "2026-02-17T10:21:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Police identify suspect in Rhode Island ice rink shooting",
    "url": "https://www.bbc.com/news/articles/c75e7wqqq6no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6c65/live/d2ef7ff0-0c0f-11f1-ad4b-755d3b02c9a5.jpg",
    "tag": "Trending",
    "date": "2026-02-17T15:47:53.000Z",
    "description": "60 minutes agoGetty ImagesThe shooting happened at the Dennis M Lynch Arena in Pawtucket, about five miles (8km) north of the state capital, Providenc",
    "body": "60 minutes agoGetty ImagesThe shooting happened at the Dennis M Lynch Arena in Pawtucket, about five miles (8km) north of the state capital, ProvidencePolice have identified the suspect in a shooting at a high school ice hockey game in Rhode Island that killed two people and injured three others.Pawtucket Police Chief Tina Goncalves said Robert Dorgan, who also used the name Roberta and the surname Esposito, died of an apparent self-inflicted gunshot wound inside the Dennis M Lynch Arena on Sunday.\"It appears that this was a targeted event, that it may be a family dispute,\" Goncalves said. She did not provide details about the identity of the victims.Video of the incident showed shots were fired while players were on the rink, sparking panic as the teams scrambled to leave the arena.Goncalves said a bystander \"stepped in and interjected\" and \"that's probably what led to a swift end of this tragic event\".After the incident, hockey players and their families described their fear after gunfire broke out. Melissa Dunn, whose son played for one of the hockey teams, said she saw paramedics performing CPR in the stands of the arena after she ran back inside to find her son. \"You don't know what's going on at first,\" Dunn said. \"You just hear the loud noises. And we're used to the kids banging on the board with their skates, so we thought it was that at first.\"She said she screamed for her son to duck and avoid gunfire. \"We ran out of the rink… your first thought is 'where's my kid?'\" she said. \"I tried to get back in the rink, and I actually got back in there to find out where he was, and I saw them doing CPR in the stands and it was just really disturbing.\"Olin Lawrence, a high school hockey player who was on the ice at the time of the shooting, told reporters he ran inside the locker room when he heard shots being fired.\"I went down and then I ran,\" he said. \"We pressed against the door and just tried to stay safe down in there. It was very scary. We were very nervous. It was a lot of shots.\"The shooting happened at the Dennis M Lynch Arena in Pawtucket, about five miles (8km) north of the state capital, Providence, and about 45 miles south of Boston.\"Our state is grieving again,\" Rhode Island Governor Dan McKee said, referring to a shooting in December at Brown University. \"As governor, a parent and a former coach, my heart breaks for the victims, families and everyone impacted by the devastating shooting at Lynch Arena in Pawtucket.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Police identify suspect in Rhode Island ice rink shooting",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6c65/live/d2ef7ff0-0c0f-11f1-ad4b-755d3b02c9a5.jpg"
      ],
      "datePublished": "2026-02-17T15:47:53.000Z",
      "dateModified": "2026-02-17T15:47:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "France releases seized Russian 'shadow fleet' tanker after fine paid",
    "url": "https://www.bbc.com/news/articles/c8xy4dl2xwgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b57c/live/b62e6760-0bfa-11f1-b726-1d6e709ef554.jpg",
    "tag": "Trending",
    "date": "2026-02-17T14:20:33.000Z",
    "description": "2 hours agoJessica RawnsleyGetty ImagesThe oil tanker, named Grinch, under the watch of the French navy near MarseilleFrance says it has released an o",
    "body": "2 hours agoJessica RawnsleyGetty ImagesThe oil tanker, named Grinch, under the watch of the French navy near MarseilleFrance says it has released an oil tanker suspected of being part of Russia's sanctions-busting \"shadow fleet!\" after its owner paid a fine.French Foreign Minister Jean-Noël Barrot said the vessel, named Grinch, was \"leaving French waters\" on Tuesday having paid a penalty of \"several million euros\".The tanker was seized by French forces in the Mediterranean in January and then diverted to the port city of Marseille. It had set sail from Murmansk in northern Russia and was flying under a Comoros flag, officials said.Moscow's so-called shadow fleet is a clandestine network of tankers used to evade Western sanctions on Russian oil exports by using aged tankers with obscure ownership or insurance.Many Western countries imposed sanctions on Russian oil after it launched a full-scale invasion of Ukraine in 2022.\"Circumventing European sanctions comes at a price. Russia will no longer be able to finance its war with impunity through a ghost fleet off our coasts,\" Barrot said in a post on X.He added: \"The tanker Grinch will leave French waters after shelling out several million euros and three weeks of costly immobilisation at Fos-sur-Mer. Let's keep it up.\"\"As part of a guilty plea procedure the company that owns the vessel was sentenced by the Marseille judicial court to a financial penalty of confiscation,\" the public prosecutor's office and regional maritime authorities said in a statement.The exact amount the vessel's owner was fined was unclear.While estimates vary, data from the monitoring group TankerTrackers.com suggests the fleet currently consists of 1,468 vessels, roughly triple its size at the time of Russia's full-scale invasion of Ukraine four years ago.The vessels tend to be old and are often poorly maintained. Details of ownership and management are deliberately opaque - names, identification numbers and flags are frequently changed.Efforts have been stepped up to tackle shadow fleets in recent months and a number of sanctioned tankers have been seized.Moscow denounced the move, saying no state had the right to use force against vessels properly registered in other states' jurisdictions.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "France releases seized Russian 'shadow fleet' tanker after fine paid",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b57c/live/b62e6760-0bfa-11f1-b726-1d6e709ef554.jpg"
      ],
      "datePublished": "2026-02-17T14:20:33.000Z",
      "dateModified": "2026-02-17T14:20:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Can ice baths, gua shas and caffeine cream really depuff your face?",
    "url": "https://www.bbc.com/news/articles/ce8wd6pzl72o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7b40/live/556ec230-0c13-11f1-be16-f95144af7a04.jpg",
    "tag": "Trending",
    "date": "2026-02-17T15:14:28.000Z",
    "description": "Viral face depuffing tricks - skin experts reveal if they work1 hour agoYasmin RufoBBC NewsGetty ImagesFrom plunging your face into bowls of ice water",
    "body": "Viral face depuffing tricks - skin experts reveal if they work1 hour agoYasmin RufoBBC NewsGetty ImagesFrom plunging your face into bowls of ice water to rolling frozen tools across your cheeks, social media is full of quick fixes promising to depuff your face in minutes.While these techniques look convincing on screen, dermatologists say many of them are misunderstood, overhyped and at best, temporary. Consultant dermatologist Dr Aiza Jamil says facial puffiness is usually caused by fluid retention and common triggers include high salt and alcohol intake, allergies and lack of sleep. Dr Tina Tian, also a consultant dermatologist explains most viral hacks fall into three categories - cold exposure, massage and temporary tightening effects.They can \"genuinely reduce visible swelling and provide relief but the key word is temporary - they won't permanently change facial structure\". So what actually helps with facial puffiness, and what's more myth than miracle? Here's the truth about three common treatments.1. Cold therapy Getty ImagesCold exposure causes blood vessels to constrictIf you've ever hovered over a sink debating whether to dunk your face into a bowl of ice water, you're not alone. The \"ice facial\" has become a social media rite of passage and is half beauty hack, half endurance challenge.Tina explains the appeal comes from the fact that the \"cold exposure causes blood vessels to constrict, which can reduce swelling\".This is the logic behind ice facials, cryo globes and refrigerated sheet masks but Tina says you don't need a dramatic ice plunge to get the benefit as a chilled compress or even a splash of cold water can do the job. Aiza adds that it can give you a \"slightly tighter, fresher appearance, particularly in the morning\" but results are temporary and the effect \"lasts hours rather than days\". Tina says there's also a fine line between refreshing and overdoing it as \"very aggressive ice exposure can irritate sensitive skin or trigger rosacea, so keep it gentle\". 2. Facial rollers Getty ImagesIt's important to use the tools gently, says TinaOnce niche spa tools, facial rollers and gua sha stones are now bathroom staples for many of us. Promoted as sculpting devices, they've built a reputation for lifting and contouring but Aiza says they \"do not permanently tighten skin, change skin structure, or remove fat\". She adds that it's best to see them as a \"soothing tool\".They can however help with reducing facial puffiness temporarily. \"A gentle massage encourages lymphatic drainage and reduces fluid pooling if used regularly,\" Tina says. When you roll or glide these products across the skin, you're helping stagnant fluid move away from the face and towards the lymph nodes, where it can drain naturally. Tina adds that cooling the tools can boost the results so some people choose to keep them in the fridge. If done properly, it's unlikely to cause you any harm, but Tina warns that \"too much pressure can cause bruising or broken capillaries, so be gentle\".3. Caffeine creamsGetty ImagesYou've probably seen caffeine eye cream everywhere - it's recommended by influencers, stacked in skincare aisles and tucked into \"morning routine\" videos promising instant bright eyes. The skin around the eyes is especially prone to swelling because fluid can collect there easily.Unlike many beauty trends, Tina says this one does have some evidence behind it. \"Caffeine is a mild vasoconstrictor [narrows blood vessels], so caffeine-containing eye creams can genuinely reduce puffiness,\" she says. Caffeine temporarily shrinks blood vessels and less dilation means less visible swelling. Aiza adds that it can help \"reduce fluid retention and some under-eye darkness\". If you're going to use an eye cream, Tina recommends looking for one with hydrating ingredients alongside the caffeine as that supports skin quality. She adds that you can also keep the cream in the fridge or even \"apply it with the back of a cold spoon\". Aiza says DIY alternatives like using a cold spoon or chilled tea bags \"works similarly by temporarily reducing swelling and soothing skin\".Tina agrees and says these methods follow the same principle \"but can provide a lesser effect\".While caffeine eye cream can help reduce puffiness, Tina says it's more important to focus on the cause. \"Reduce evening salt and alcohol, treat allergies properly, prioritise sleep and slightly elevate your head at night. Most puffiness isn't a medical issue and will settle on its own but Tina says that \"if it's persistent, worsening, painful or associated with other symptoms such as breathlessness or swelling elsewhere in the body, it should be assessed medically\". ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Can ice baths, gua shas and caffeine cream really depuff your face?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7b40/live/556ec230-0c13-11f1-be16-f95144af7a04.jpg"
      ],
      "datePublished": "2026-02-17T15:14:28.000Z",
      "dateModified": "2026-02-17T15:14:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Health agency issues cold health alert as Arctic air sweeps the UK",
    "url": "https://www.bbc.com/news/articles/cdxgew324r9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/146c/live/44b5f020-0c05-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-17T12:06:53.000Z",
    "description": "Cold health alert issued as temperatures fall across the UK5 hours agoSimon King,Lead Weather PresenterandMalu CursinoPA MediaYellow weather warnings ",
    "body": "Cold health alert issued as temperatures fall across the UK5 hours agoSimon King,Lead Weather PresenterandMalu CursinoPA MediaYellow weather warnings for ice and snow have been issued in parts of the UKThe UK Health Security Agency (UKHSA) has issued a yellow cold health alert for most of England, as north-westerly winds have brought a drop in temperature for many parts the country.The alert comes ahead of the Met Office's yellow warnings for snow and rain in parts of England and Wales, which will come into effect on Wednesday.During Monday night temperatures dipped as low as -7.2C (19F) in the Highlands and Tuesday night could bring similar figures across parts of eastern Scotland. Although earlier warnings for snow and ice expired on Tuesday morning, the Met Office warned commuters to remain vigilant due to the risk of black ice and slippery conditions.The UKHSA's yellow cold health alert covers all of England except London and the South East. The alert will be in place from 18:00 on Tuesday until 18:00 on Friday.The agency warns that the weather is likely to have \"minor impacts on health and social care services, including increased use of healthcare services and a greater risk to life of vulnerable people\".A yellow weather warning for snow across most of Wales and parts of western England will come into effect at 16:00 on Wednesday and will be in place until 06:00 on Thursday.A separate yellow warning for rain will be in place for much of the south of England from 06:00 on Wednesday until Thursday at 08:00.How to drive safely in icy weatherTuesday has been a mostly dry with some spells of sunshine. But with temperatures only reaching 3C to 7C and a brisk north-westerly wind, it felt colder - particularly in eastern areas where wind the chill made it feel close to freezing.Temperatures are set to fall close to freezing for most of the UK on Wednesday morning. In parts of northern and north-east Scotland, temperatures could fall to -8C. Icy stretches are likely.Weather conditions will become more unsettled again on Wednesday with a band of rain pushing in from the south and west. This could bring a mix of rain, sleet and hill snow, according to the Met Office. The forecaster said the system is being monitored closely with the potential for further snow warnings.Later in the week, conditions are expected to turn milder, and although further showers are forecast, drier spells in between are also expected.Getty ImagesA flooded playground in the Chertsey area of Surrey, where a flood warning is in placeMeanwhile, 65 flood warnings and 178 flood alerts have been issued by the Environment Agency across England on Tuesday - concentrated in the south and the Midlands - following a long spell of wet weather.Two flood alerts were in place in Wales on Tuesday for the lower Severn catchment in Powys, and south Pembrokeshire.Jonathan Day, flood duty manager at the Environment Agency, said more than 24,000 homes and businesses have been protected but about 330 flooded.With further heavy rain forecast for southern England and South Wales on Wednesday, and the ground already saturated, more flood warnings or alerts could be issued.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Health agency issues cold health alert as Arctic air sweeps the UK",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/146c/live/44b5f020-0c05-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-17T12:06:53.000Z",
      "dateModified": "2026-02-17T12:06:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tax calculator: How will freeze on thresholds hit your take-home pay?",
    "url": "https://www.bbc.com/news/articles/c99k7djlklyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a282/live/678b8360-0b58-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-17T07:10:15.000Z",
    "description": "9 hours agoTommy Lumby,Business data journalistandPhil Leake,Data journalistBBCWages have been rising faster than prices for the last two-and-a-half y",
    "body": "9 hours agoTommy Lumby,Business data journalistandPhil Leake,Data journalistBBCWages have been rising faster than prices for the last two-and-a-half years - the longest stretch since the 2008 financial crisis.Use our calculator below to see how your pay could be affected.Tax thresholds are the points at which you start paying more income tax and National Insurance on each extra pound you earn, as your salary rises.You pay no income tax on the first £12,570, which is known as the personal allowance.You then pay 20% on earnings between £12,571 and £50,270 - the basic rate - and 40% on anything between £50,271 and £125,140, which is the higher rate. Anything above £125,140 is taxed at 45%.If you earn more than £100,000 after accounting for certain tax reliefs, you start to lose £1 from your personal allowance for every £2 you earn over that point.Governments have historically raised tax thresholds in line with inflation, to try to ensure your take-home pay keeps up with the cost of living.Weekly earnings across Britain grew at an annual rate of 0.8% between October and December after accounting for inflation, the latest Office for National Statistics (ONS) data shows.That means growth in average salaries has now consistently beaten the pace of price rises since July 2023.But thresholds have been frozen for the whole of that period and will remain stuck into the next decade.According to our calculations, the freeze in thresholds will add £465 to the 2030-31 income tax and National Insurance bill for someone currently earning £39,000, which is the salary of the average UK worker.Of that, £227 would be due to the extended freeze announced by the current Chancellor Rachel Reeves in November.Someone on £50,000 would pay an estimated £1,309 more, of which £704 would be because of the extension from 2028-29.You can read more about how the calculator works in the final section of this article.Freezing thresholds is often called a stealth tax by economists because it increases the tax take without a government having to put up rates.Both Labour and Conservative governments have used it to raise additional revenue. Extra money from tax receipts helps pay for public services such as the NHS, schools and welfare spending.Most earners will pay more because of the freeze. But people whose pay rises move them across the thresholds into the basic and higher rates are likely to see the biggest jumps in what they owe.But this only goes up to 2028-29, so does not include the period covered by the extended freeze.Thresholds were initially frozen in 2022 by former Conservative Chancellor Rishi Sunak, who paused them until 2026.The Conservatives later extended that for a further two years, before Reeves announced she would keep it in place until 2031.By 2030-31, official forecaster the Office for Budget Responsibility (OBR) estimates an additional 5.2 million people will be paying the basic rate of income tax because of threshold freezes first introduced in 2022-23.An estimated 4.8 million more will be paying the higher rate, and 600,000 more the additional rate.It forecasts that the freezes to income tax thresholds will generate £56bn in revenue in 2030-31. Of that, £12bn will be down to Reeves's extension.Additional reporting by Lucy Dady and Jess CarrHow the calculator worksThis calculator estimates how much extra tax and National Insurance contributions (NICs) you will pay in 2030-31 due to frozen tax thresholds.Using official forecasts produced by the OBR for the November 2025 Budget, it estimates the extra amount you could pay compared with if thresholds had been allowed to rise from 2026-27, and how much of that is down to the current government's extension of the freeze from 2028-29.The calculator does not store your results.What does the calculator not take into account?This calculator is designed to give you an idea of how much frozen tax thresholds could affect how much tax you pay over time, but there are various other factors that can determine your tax bill.For example, if you are over the state pension age, you could be exempt from paying NICs. You can also get tax relief on pension contributions.There are various other taxes you could pay, and tax credits and allowances you could potentially claim, which this calculator does not take into account.It applies to employees working in England, Wales and Northern Ireland only. Scotland has different tax bands and thresholds.It does not apply to self-employed workers, who are taxed differently.How does it calculate how my earnings will rise?It assumes your salary will rise in line with the OBR's financial year forecasts for average weekly earnings growth each year. These forecasts are the OBR's best estimate of how wages across the labour market will rise in the future, and actual wage growth could be different.It also assumes your salary remains regular. If it fluctuates or you change jobs, this could affect how your earnings rise.How does it calculate how tax thresholds will rise?The calculator uses the same Consumer Prices Index (CPI) inflation figures the OBR uses to estimate how tax thresholds would rise in the future. Actual inflation could be higher or lower.The personal allowance (PA) is rounded up to the nearest £10, and the basic rate limit is rounded up to the nearest £100. The additional rate threshold rises in line with the PA, which means your PA goes down by £1 for every £2 you earn over £100,000.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tax calculator: How will freeze on thresholds hit your take-home pay?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a282/live/678b8360-0b58-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-17T07:10:15.000Z",
      "dateModified": "2026-02-17T07:10:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Challenge to Met Police's Freemason disclosure rule thrown out",
    "url": "https://www.bbc.com/news/articles/cly86125nqno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bafc/live/ef988a90-d698-11f0-a892-01d657345866.jpg",
    "tag": "Trending",
    "date": "2026-02-17T15:20:00.000Z",
    "description": "Legal challenge to Met's Freemasons policy thrown out1 hour agoDominic Casciani,Home and Legal CorrespondentandAdriana Elgueta,LondonPA MediaFreemason",
    "body": "Legal challenge to Met's Freemasons policy thrown out1 hour agoDominic Casciani,Home and Legal CorrespondentandAdriana Elgueta,LondonPA MediaFreemasons are a fraternal society that emerged from medieval European stonemason guild traditions, and dates back over 600 yearsAn attempt by Freemasons to stop the Metropolitan Police from forcing staff to declare whether they are or have been members of the organisation has been thrown out by the High Court despite claims it breaches human rights.Mr Justice Chamberlain said the policy was a lawful and proportionate way for Scotland Yard to maintain and enhance public trust in policing.Three bodies representing Freemasons in England, Wales, the Isle of Man and the Channel Islands, as well as two serving police officers who are members of the organisation, had sought to overturn the rule.They argued that the disclosure order breached members' right to privacy, free speech and was discrimination under equality laws.  The attempted legal challenge came after the Met announced in December that officers and police staff would be required to declare internally if they were part of an organisation that had a \"confidential membership, hierarchical structures and requires members to support and protect each other\".The declaration would not be public, but Met bosses told staff that they needed to know because  \"long-standing concerns\" meant that public and staff confidence \"must take precedence over the secrecy of any membership organisation\".The new policy was immediately applied to membership of the Freemasons - and most of the 397 declarations so far have been from members of the organisation.Police chiefs told the High Court that the policy was imposed because they were concerned about the possibility of corruption if personnel were not transparent about their membership. \"It is plausible that membership of organisations such as the Freemasons between two officers, or between an officer and a member of the public they are dealing with, may give rise to a conflict of loyalties or otherwise be relevant to independence, equality, transparency and trust in police,\" Commander Simon Messinger told the court in a witness statement. \"A declaration could be relevant to a live criminal or misconduct investigation, or could shed light on the appropriateness of an officer or member of staff participating in a current posting. \"If we do not have the declaration information, we cannot assess or mitigate the risks of actual or perceived bias impacting such decisions.\"'Unduly stigmatising'Launching the attempt to overturn the policy, the United Grand Lodge of England and the other claimants argued that the Met had no power under police regulations to force officers to disclose membership of an organisation that was part of their private life.They further argued that the policy unlawfully interfered with officers' rights to privacy, free speech and assembly under the European Convention on Human Rights.The decision to impose the policy was also said to be discrimination against a Freemason officer's beliefs under the Equality Act - and the force also had no right to hold the private information under data protection laws.But in a 17-page ruling on Tuesday, Mr Justice Chamberlain said none of the claims made were  \"reasonably arguable\" - putting a stop to the case before it got to a full hearing.  The senior judge said the policy was not discriminatory or \"unduly stigmatising\" against Freemasons. Even if the Freemasons had been right, and the policy did interfere with officers' human rights, it was proportionate for police chiefs to ask for disclosures because they were legitimately aiming to maintain and enhance public trust. Responding to the ruling, Commander Simon Messinger said: \"We had been prepared to robustly defend our decision through the courts, so today's judgment is welcome.\"Both victims of crime and those reporting wrongdoing must have trust and confidence there is no risk that investigations are tainted by such issues. We have prioritised this over any organisation's desire to maintain secrecy.\"The United Grand Lodge of England (UGLE), the Order of Women Freemasons and the Honourable Fraternity of Ancient Freemasons said in a statement that they were \"disappointed\" but had received assurances that only a small number of staff would have access to the list of members. Speaking on behalf of the three groups, Adrian Marsh, grand secretary of UGLE, said: \"We maintain that we have an obligation to protect our members from discrimination, which, in our view, will do nothing to improve on the Metropolitan Police's delivery on its mandate to keep London safe by reducing crime, building public trust and upholding high standards.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Challenge to Met Police's Freemason disclosure rule thrown out",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bafc/live/ef988a90-d698-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2026-02-17T15:20:00.000Z",
      "dateModified": "2026-02-17T15:20:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why are some students claiming Covid compensation from universities?",
    "url": "https://www.bbc.com/news/articles/c3wl19wy22vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/300a/live/e8362fa0-0bfe-11f1-b726-1d6e709ef554.jpg",
    "tag": "Trending",
    "date": "2026-02-17T15:53:25.000Z",
    "description": "38 minutes agoGetty ImagesThousands of students and graduates are bringing legal action against their universities, over the quality of teaching and l",
    "body": "38 minutes agoGetty ImagesThousands of students and graduates are bringing legal action against their universities, over the quality of teaching and learning during Covid lockdowns.Pre-action letters were sent to 36 universities as part of the Student Group Claim, saying students did not receive the full education they paid for during the pandemic.Universities UK, which represents more than 140 institutions, said Covid was an \"unprecedented challenge\" and the sector had to adapt quickly and creatively to support students.So why are these legal challenges starting now and what might be the outcome?Why are students claiming?The latest tranche of pre-action letters follows a settlement between University College London (UCL) and about 6,000 of its students, who were also part of the Student Group Claim.That case had been due to go to trial this year, but ended out of court with a confidential settlement, so we don't know the details of the outcome.UCL has not admitted any liability and said it had \"worked diligently to deliver teaching and student support in unprecedented circumstances\".Now, pre-action letters - official documents warning of potential legal proceedings if a dispute is not resolved - have been sent to 36 other institutions.Those letters allege that students missed out on the full education they paid for, and other university experiences, because of the Covid lockdowns.\"It's very simple, in English law if you paid for a five-star holiday and received a one-star holiday, you are entitled to compensation,\" Shimon Goldwater, a partner at Asserson Solicitors, said.During the pandemic, most university teaching shifted online for long periods of time, with students either returned home or locked down in university accommodation.Access to shared campus facilities was restricted, which caused particular issues for students on practical courses or those who required specialist resources.Graduation ceremonies were virtual or delayed, and graduates entered a job market that was only just recovering from the pandemic.What are they asking for?The letters to the universities act as a notice that the claimants intend to seek damages for learning which students claim they paid for but did not actually receive.If the university disagrees, court proceedings could follow.One of the pre-action letters seen by the BBC says former students are seeking redress for the academic years 2019-20, 2020-21 and 2021-22.It is hard to know how likely it is that any or all of the student claims will be successful, or how much they could be entitled to if they are.Goldwater, one of the lawyers for the Student Group Claim, told Radio 4's PM programme that \"the people we are representing would only require relatively modest amounts of compensation compared with universities' budgets\".\"Typically a student who was an undergraduate at university during the pandemic, we say would be entitled to around £5,000,\" he said. \"That's what they would be claiming as an estimate.\"In the UCL case, the university did not admit any liability and the details of the settlement remain confidential, with neither the institution nor lawyers for the students able to discuss it.Who is claiming?More than 170,000 students and graduates from 36 universities are involved in the latest claims, which have been set into motion by the pre-action letters.Goldwater has said lawyers are only claiming on behalf of students signed up to the Student Group Claim.While the next stage is to pursue claims against the 36 universities, other universities could face action in the future, Goldwater said.He added that students could register to be updated as to whether claims will be brought against their university. The deadline for student claims relating to Covid is in September 2026.Which universities are affected?The case against UCL involved 6,000 students and was due to be heard in court in March.However, the deal now appears to have opened the way for large-scale legal action against the university sector.The 36 universities to have received a pre-action letter are:University of BathUniversity of BirminghamBirmingham City UniversityUniversity of BristolCardiff UniversityCity St George's, University of LondonCoventry UniversityDe Montfort UniversityUniversity of East AngliaUniversity of ExeterImperial College LondonUniversity of KentKing's College LondonUniversity of LeedsLeeds Beckett UniversityUniversity of LiverpoolLiverpool John Moores UniversityLondon School of Economics and Political ScienceLoughborough UniversityThe University of ManchesterManchester Metropolitan UniversityNewcastle UniversityUniversity of NottinghamNottingham Trent UniversityNorthumbria UniversityUniversity of PortsmouthQueen Mary University of LondonUniversity of ReadingUniversity of SheffieldSheffield Hallam UniversityUniversity of SouthamptonSwansea UniversityUniversity of the Arts LondonUniversity of The West of EnglandUniversity of WarwickUniversity of YorkWhat could happen next?It is hard to know how these cases will proceed, but it is likely that it could take some time.The 2026 trial date for the UCL case had been set in July 2024, and that had followed months of previous court hearings and letters between the lawyers representing each side.The other universities which are now involved will have a chance to respond to the lawyers for the Student Group Claim who issued the pre-action letters before any further proceedings can begin.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why are some students claiming Covid compensation from universities?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/300a/live/e8362fa0-0bfe-11f1-b726-1d6e709ef554.jpg"
      ],
      "datePublished": "2026-02-17T15:53:25.000Z",
      "dateModified": "2026-02-17T15:53:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "MPs may investigate Andrew over trade envoy claims",
    "url": "https://www.bbc.com/news/articles/c93wkxgydy2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b408/live/46f9c370-0bf6-11f1-b726-1d6e709ef554.jpg",
    "tag": "Trending",
    "date": "2026-02-17T11:43:50.000Z",
    "description": "5 hours agoAnna LamcheGettyMPs may investigate Andrew Mountbatten-Windsor for his conduct while working as a trade envoy for the UK, the chairman of t",
    "body": "5 hours agoAnna LamcheGettyMPs may investigate Andrew Mountbatten-Windsor for his conduct while working as a trade envoy for the UK, the chairman of the cross-party Business and Trade Committee has said.Speaking to BBC Radio 4's Today programme, Liam Byrne said his committee would meet next Tuesday to decide \"how we might or might not take this investigation forward\".The latest files released by the US Department of Justice appear to show the former prince forwarded sensitive government documents and commercial information to the convicted sex offender Jeffrey Epstein. Andrew has always denied any wrongdoing.MPs are taking the allegations \"acutely seriously\", Byrne said. \"And I can guarantee you that MPs are not in the market for letting anything slip through the cracks,\" he added.\"My job as the chair is to make sure that the options are on the table in front of them when we consider it next week when Parliament resumes.\"The former Duke of York served as a UK trade envoy between 2001 and 2011. In this role he travelled globally and enjoyed privileged access to senior government and business contacts around the world.In 2010, Andrew appears to have forwarded government reports from visits to Vietnam, Singapore and China to Epstein, according to the recently published files. Under official guidance, trade envoys have a duty of confidentiality over sensitive, commercial, or political information about their official visits. Being named in the Epstein files is not an indication of misconduct. Andrew has previously strongly denied any wrongdoing in his associations with Epstein and rejected any suggestion he used his time as trade envoy to further his own interests.Earlier in February, Thames Valley Police confirmed it was assessing whether there are grounds to investigate a complaint by the anti-monarchy group Republic, which reported Mountbatten-Windsor for suspected misconduct in public office and breach of official secrets.Byrne said parliamentary recess meant the Business and Trade Committee had not yet had a chance to consider the allegations about Andrew, but added he was working to ensure \"the committee's got options in front of them when they meet on Tuesday for how we might or might not take this investigation forward\". He said he couldn't \"pre-judge\" the committee's decision about whether an investigation was necessary, but added: \"At this stage, all I can say is nothing is off the table\".In theory select committees - cross-party groups of MPs covering specific policy areas - have the power to force witnesses to attend a session to answer questions.However, this does not apply to members of the Royal Family and such an appearance would be unprecedented.In practice, there are few repercussions if someone does refuse to attend.Bryne, the MP for Birmingham Hodge Hill and Solihull North, is the latest person to suggest the former Duke of York could face an investigation for his conduct while serving as a UK trade envoy.Byrne's comments come as the National Police Chiefs' Council (NPCC) announced a new national group has been set up to support UK police forces that are \"assessing allegations\" following the publication of the Epstein files.It is understood the national coordination group will bring together affected forces to ensure consistency. The group is not an investigative team, and each force will remain responsible for any potential offences that occurred within their jurisdiction.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "MPs may investigate Andrew over trade envoy claims",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b408/live/46f9c370-0bf6-11f1-b726-1d6e709ef554.jpg"
      ],
      "datePublished": "2026-02-17T11:43:50.000Z",
      "dateModified": "2026-02-17T11:43:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]