[
  {
    "title": "The Global Story - How Giorgia Meloni became Trump's best friend in Europe - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/w3ct714t?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0mbkpq5.jpg",
    "tag": "Trending",
    "date": "2025-10-24T09:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsWorld Service,·24 Oct 2025,·26 minsAvailable for over a yearGiorgia Meloni is Italy’s first female Prime Minister, and her political star has risen rapidly - from working class roots in Rome, to becoming one of the most important and divisive leaders in Europe. \nA populist whose party has roots in Italian fascism, and who takes a hard right stance on migration and family values, she has formed a kinship with Donald Trump, who this month alone has promoted her autobiography and her speeches online, and called her “beautiful” on stage. \nIn today’s episode, journalist Barbara Serra joins us to discuss Meloni’s increasingly crucial role in US-European relations. \nProducers: Hannah Moore and Valerio Esposito \nExecutive producer: James Shield \nMix: Travis Evans \nSenior news editor: China Collins\nPhoto: YOAN VALAT/POOL/EPA/ShutterstockProgramme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The Global Story - How Giorgia Meloni became Trump's best friend in Europe - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0mbkpq5.jpg"
      ],
      "datePublished": "2025-10-24T09:00:00.000Z",
      "dateModified": "2025-10-24T09:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - The Week: A Historic By-Election, Prince Andrew And Digital ID - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0mbn61j?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2025-10-24T13:52:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·24 Oct 2025,·43 minsThe Week: A Historic By-Election, Prince Andrew And Digital IDNewscastAvailable for over a yearToday, Plaid Cymru have won a by-election in an area Labour haven’t lost in for 100 years. \nAdam and Chris discuss what it means for Welsh Labour, and for Reform who came second. \nPlus they are joined by Alex and Joe to round up the political week. Is the political pressure on Prince Andrew’s living situation sustainable? Is Keir Starmer re-thinking how to sell digital id? And, Newscast welcomes a major celebrity into the studio. \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenter was Adam Fleming. It was made by Jack Maclaren with Joe Wilkinson. The social producer was Sophie Millward. The technical producer was Ricardo McCarthy . The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - The Week: A Historic By-Election, Prince Andrew And Digital ID - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2025-10-24T13:52:00.000Z",
      "dateModified": "2025-10-24T13:52:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Play: Cooler Than Me?",
    "url": "https://www.bbc.com/weather/articles/cwy5r7xwq8xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png",
    "tag": "Trending",
    "date": "2025-10-24T04:53:40.000Z",
    "description": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and p",
    "body": "Britain's true national sport is complaining about the weather. But does the Sun really shine brighter everywhere else, or is this quite a green and pleasant land after all?Compare your location to cities across the world, and find out if you're forecast to become the BBC's next star meteorologist.You can find the latest forecast on the BBC Weather website.Want to know how Cooler Than Me? works? Read the FAQ.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Play: Cooler Than Me?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/f38a/live/f93d7200-7e81-11f0-a34f-318be3fb0481.png"
      ],
      "datePublished": "2025-10-24T04:53:40.000Z",
      "dateModified": "2025-10-24T04:53:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and th",
    "body": "Image caption, The BBC News app is available for Android and iOS devicesWith the latest news and analysis from our journalists around the world and the unique human stories behind current events, we've got the best of our journalism in one place on the BBC News app.Features include: News, features and analysisRead top stories and breaking newsWatch live and developing news coverageGet news and weather local to youFollow news that's important to youGet alerts for top storiesWe would like to know what you think of the new app - click here to give us your feedback.Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC News quiz of the week: Whose crown was stolen from the Louvre?",
    "url": "https://www.bbc.com/news/articles/cly9qjq7xn5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/65e6/live/c532e5c0-b01e-11f0-ba75-093eca1ac29b.jpg",
    "tag": "Trending",
    "date": "2025-10-23T18:42:31.000Z",
    "description": "21 hours agoThis week, millions of people took part in \"No Kings\" protests against President Donald Trump's policies in cities across the US, Amazon W",
    "body": "21 hours agoThis week, millions of people took part in \"No Kings\" protests against President Donald Trump's policies in cities across the US, Amazon Web Services almost broke the internet, and Strictly fans were stunned by presenters Tess Daly and Claudia Winkleman announcing their departure.But how much attention did you pay to what else happened in the world over the past seven days?Quiz collated by Ben Fell.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC News quiz of the week: Whose crown was stolen from the Louvre?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/65e6/live/c532e5c0-b01e-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-23T18:42:31.000Z",
      "dateModified": "2025-10-23T18:42:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Men jailed over arson attack for Russia on Ukrainian business in London",
    "url": "https://www.bbc.com/news/articles/c04g5x1wq5vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/648b/live/b2e99120-b0eb-11f0-a072-177e9709dffa.jpg",
    "tag": "Trending",
    "date": "2025-10-24T15:36:23.000Z",
    "description": "38 minutes agoDaniel Sandford,UK correspondent, the Old Bailey and Andre Rhoden-PaulMetropolitan PoliceJake Reeves, left, was brought into the plot by",
    "body": "38 minutes agoDaniel Sandford,UK correspondent, the Old Bailey and Andre Rhoden-PaulMetropolitan PoliceJake Reeves, left, was brought into the plot by Dylan Earl Six men have been jailed for their parts in a Russian-ordered arson attack on a London warehouse providing aid to Ukraine. The fire at industrial units in Leyton, east London, on 20 March 2024, caused £1.3m in damage. Ringleader Dylan Earl was recruited by the Wagner Group, a mercenary organisation that acts on behalf of the Russian state and is proscribed by the UK government as a terrorist organisation. He was sentenced to 17 years in prison. Before his arrest, he was also plotting to kidnap a wealthy Russian dissident. Earl, 21, from Leicestershire, admitted a National Security Act offence, along with Jake Reeves, 24, from Croydon who was jailed for 12 years. The pair are the first to be convicted of offences under the National Security Act 2023. The other four men sentenced were:  Nii Mensah, 23, from Thorton Heath, who streamed the attack, was jailed for 10 years forJakeem Rose, 23, from Croydon, who set the buildings alight, was jailed for nine years for Ugnius Asmena, 21, of no fixed address, who arranged the getaway car and was there on the night, was jailed for eight years Ashton Evans, 20, from South Wales, was jailed for nine years failing to tell police what he knew about a planned kidnapping.Earl was recruited by a Wagner operative on Telegram where he told his handler he was keen to carry out a series of \"mission\", of which Leyton would be the first, the court previously heard. He then brought in other men to carry out the arson attack. The Ukrainian-owned warehouse they targeted had been used to send goods to Ukraine, including Starlink satellite terminals, and it required eight fire crews with 60 firefighters to get the blaze under control. Earl was supposed to receive £9,000 for his role but was paid less because he carried out the plan early without his handler's sign-off.On Friday, Judge Mrs Justice Cheema-Grubb described the case as a \"planned campaign of terrorism and sabotage\" in the interests of the Russian state. Police footage shows arson attack ringleader's arrest",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Men jailed over arson attack for Russia on Ukrainian business in London",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/648b/live/b2e99120-b0eb-11f0-a072-177e9709dffa.jpg"
      ],
      "datePublished": "2025-10-24T15:36:23.000Z",
      "dateModified": "2025-10-24T15:36:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Teenagers appear in court over Transport for London cyber attack",
    "url": "https://www.bbc.com/news/articles/cj97ekz07ezo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bc73/live/85c61a30-b0e4-11f0-9528-b741acdabbc2.jpg",
    "tag": "Trending",
    "date": "2025-10-24T14:41:02.000Z",
    "description": "2 hours agoNeil HendersonSouthwark Crown CourtTwo teenagers have appeared in court facing computer hacking charges, in connection with last year's cyb",
    "body": "2 hours agoNeil HendersonSouthwark Crown CourtTwo teenagers have appeared in court facing computer hacking charges, in connection with last year's cyber attack on Transport for London (TfL).Thalha Jubair, 19, from east London, and Owen Flowers, 18, from Walsall in the West Midlands, were charged with conspiring to commit unauthorised acts under the Computer Misuse Act.They appeared at a hearing at Southwark Crown Court on Friday, and spoke only to confirm their names. Judge Tony Baumgartner scheduled a further hearing for 21 November, with a trial date set for 8 June 2026.The cyber attack caused three months of disruption to TfL last year, and affected live Tube information, online journey history, and payments on the Oyster app.The teenagers were arrested by the National Crime Agency (NCA) and City of London Police on 16 September, and were charged two days later.The NCA said it believed the hack, which began on 31 August last year, was carried out by members of cyber-criminal group Scattered Spider.TfL said the hack cost £39m in damage and disruption.Following the hack, TfL wrote to around 5,000 customers to say there may have been unauthorised access to their personal information such as bank account numbers, emails and home addresses.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Teenagers appear in court over Transport for London cyber attack",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bc73/live/85c61a30-b0e4-11f0-9528-b741acdabbc2.jpg"
      ],
      "datePublished": "2025-10-24T14:41:02.000Z",
      "dateModified": "2025-10-24T14:41:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK weather: Weekend cold snap could bring first snowfall for some",
    "url": "https://www.bbc.com/weather/articles/cn40jdp7v98o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/2964/live/9261a960-b0d2-11f0-bf5a-11e181bfe30d.jpg",
    "tag": "Trending",
    "date": "2025-10-24T12:53:22.000Z",
    "description": "First snowfall of season possible for some as weekend cold snap arrivesImage source, GettyImage caption, Showers are expected to turn wintry over hill",
    "body": "First snowfall of season possible for some as weekend cold snap arrivesImage source, GettyImage caption, Showers are expected to turn wintry over hills in the north UK this weekendByStav DanaosLead Weather PresenterTemperatures across the UK are set to fall this weekend, triggering the first snowfall of the season for some areas.This coincides with the end of British Summer Time as the clocks go back with the weather reflecting the shift towards a more wintry feel. Temperatures will be below average with strong, gusty winds making it feel especially cold and raw.This change in weather is driven by the position of Storm Benjamin in the North Sea, drawing down a cold Arctic northerly airflow across the UK.Image caption, Cold arctic air will affect all of the UK this weekendBeware the biting windIn the wake of Storm Benjamin, the UK will come under the influence of a brisk northerly wind, which could reach gale force at times along eastern counties on Saturday.Frequent showers are expected in coastal areas—especially along north-facing shores.Whilst there will be some autumnal sunshine, temperatures are set to dip slightly below average for the time of year, with daytime highs ranging between just 8 and 11C.But with that biting, Arctic wind it could feel up to 5C colder, especially on the east coast of Scotland and north-east England.Where will it snow?If showers fall over high ground - mainly above 400m - there is the chance these will turn to snow.This is most likely over the highest ground in Scotland where a few centimetres of snow accumulation are possible. There may also be a touch of wintriness over the highest hills of northern England, Wales, and Northern Ireland.But it's all change again next week.A change in wind direction will bring milder temperatures. Then by the end of the week, heavy rain and strong winds look likely.You can keep up to date with the weather where you are on the BBC Weather app or by checking the forecast online.Click here to play 'Cooler than me?'",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK weather: Weekend cold snap could bring first snowfall for some",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/2964/live/9261a960-b0d2-11f0-bf5a-11e181bfe30d.jpg"
      ],
      "datePublished": "2025-10-24T12:53:22.000Z",
      "dateModified": "2025-10-24T12:53:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "When do the clocks go back in 2025?",
    "url": "https://www.bbc.com/weather/articles/cm2zdzwy12do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/1bfd/live/86ab46f0-adab-11f0-ba75-093eca1ac29b.jpg",
    "tag": "Trending",
    "date": "2025-10-20T12:07:41.000Z",
    "description": "When do the clocks change in the UK and why do we follow daylight saving time?Image source, Getty ImagesByBen RichLead Weather PresenterUpdated 20 Oct",
    "body": "When do the clocks change in the UK and why do we follow daylight saving time?Image source, Getty ImagesByBen RichLead Weather PresenterUpdated 20 October 2025Love it or loathe it the moment is almost here when the clocks go back by one hour in the UK. It happens in the early hours of Sunday 26 October and marks the end of British Summer Time (BST) and a return to Greenwich Mean Time (GMT). You have probably already noticed that the nights are drawing in - in fact we are currently losing four or five minutes of daylight every day.However, there's nothing this subtle with the clock change, as sunset leaps forward by an hour in one one go.What time do the clocks go back?The clock change happens at 02:00 BST on Sunday 26 October in the UK. The clocks will go forward again at 01:00 GMT on 29 March 2026, when we return to BST.The easy way to remember which way the clocks change is the phrase \"spring forward, fall back\".In other words, we turn the time forward an hour in spring and back an hour in fall - or autumn.What is Daylight Saving Time?Changes to the clocks have been taking place for well over a century. The first country to make use of Daylight Saving Time (DST) was Germany, in 1916 during World War One.It was intended to maximise evening daylight meaning less heating and lighting was needed, reducing fuel consumption during wartime.Many other countries followed suit just a few weeks later, including the UK where it was named British Summer Time.The time shift has mostly continued ever since, although during a short period in World War Two there was British Double Summer Time, where the clocks went forward by two hours.An experiment between 1968 and 1971 trialled year-round BST and there continue to be some debates about whether the UK should wind its clocks forward permanently.Image source, BBC Weather Watchers / Rainbow WatcherImage caption, A permanent switch to BST would mean lighter evenings but darker mornings - especially in winterArguments for keeping the time zone in summer mode include a potential boost in economic productivity as well as a possible reduction in evening road accidents.It would also eliminate the minor disruption caused to sleep patterns by the annual gaining - and losing - of an hour.However, it would also mean some very gloomy winter mornings, especially in Scotland.In Edinburgh and Glasgow the sun does not rise until around 08:45 GMT in the second half of December, which would equate to 09:45 BST.It would leave Scottish commuters and schoolchildren making their winter morning journeys in darkness - bringing increased risks on the roads.Will my clock change automatically?Image source, GettyMost smartphones, digital devices and even modern cars will adjust the time automatically when GMT begins.However analogue clocks will need switching manually, especially important if you are relying on an old-fashioned alarm clock to wake you up.And if you are anything like me the clock on the oven will present a particular challenge.What countries have Daylight Saving Time?We are certainly not alone in switching time zones twice a year.Most of North America and Europe observes Daylight Saving Time, although only small parts of Asia, Oceania, South America and Africa take part.However different countries change their clocks on different dates.For example in the USA the switch takes place on 2 November this year, while in Egypt it happens on 30 October.One benefit of an earlier sunset is that it might be easier to get out and capture it on camera.If you do, feel free to sign up and send your photos to BBC Weather Watchers.Click here to play 'Cooler than me?'",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "When do the clocks go back in 2025?",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/1bfd/live/86ab46f0-adab-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-20T12:07:41.000Z",
      "dateModified": "2025-10-20T12:07:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Prince Andrew took money from firm linked to ripped-off pensioners",
    "url": "https://www.bbc.com/news/articles/cy5qrp2wne4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4dbe/live/0993d9e0-b042-11f0-a51e-ef517030d0bd.jpg",
    "tag": "Trending",
    "date": "2025-10-24T09:00:29.000Z",
    "description": "7 hours agoBilly Kenber,Politics investigation correspondent and Phil Kemp,Political reporter Prince Andrew was paid tens of thousands of pounds by a ",
    "body": "7 hours agoBilly Kenber,Politics investigation correspondent and Phil Kemp,Political reporter Prince Andrew was paid tens of thousands of pounds by a British businessman linked to a wealth management company which ripped off pension savers.The King's brother, who last week said he would no longer use his titles including the Duke of York, has long faced questions about his finances and how he is funding his lifestyle.He stepped down as a working royal in 2019 because of his association with the sex offender Jeffrey Epstein and no longer receives any money from the King.Although his finances remain opaque, details of some of his arrangements and controversial business associates have occasionally emerged from court cases.Prince Andrew did not respond to requests for comment.Documents from the High Court in London show that Andrew received £60,500 from a British businessman, Adrian Gleave in December 2019, a few weeks after the BBC Newsnight interview which led to his withdrawal from public life.The payments came to light in a High Court case brought by an elderly Turkish millionaire, Nebahat Isbilen, who claimed money she had paid to Andrew and his ex-wife Sarah Ferguson had been misappropriated by a business adviser.That money was funnelled through a British company owned by Mr Gleave, Alphabet Capital Limited.According to an \"agreed statement of facts signed by or on behalf of the Duke and Duchess, Mr Gleave and Alphabet\", Mr Gleave's company Alphabet had \"previously made, and might in the future make, substantial payments to HRH Prince Andrew the Duke of York\".The payments Prince Andrew received directly from Mr Gleave and his businesses, which were also sent via Alphabet Capital, came months after the businessman had stepped down as a director of SVS Securities - a company which had been ordered to stop trading by the financial regulator over pension mis-selling allegations.SVS Securities collapsed in August 2019, days after the Financial Conduct Authority (FCA) had ordered it to stop regulated activities. Clients' pension funds were found to have been invested in high-risk bonds against their interests in order to generate large commissions for SVS. Some investments made on the basis of the undisclosed commissions then defaulted, leaving customers with substantial losses. Investors were also charged large fees to withdraw funds in an effort to boost profits, the FCA found.Mr Gleave, 55, was head of business development at SVS, which he had joined in 2013. He remained a registered director on the FCA's register until late July 2019, less than two weeks before the regulator's intervention. He had been a company director registered with Companies House until a couple of months earlier, although on LinkedIn he claims to have left the business in November 2018.Three SVS directors were later banned and fined by the FCA but Mr Gleave was not one of them. Two are appealing the decision. The Financial Services Compensation Scheme has paid out more than £41m to former SVS customers.At the time of his dealings with Prince Andrew, Mr Gleave also ran a number of caravan and mobile home parks in Northern Ireland and England. At one point, he was reported to have worked out of one of the parks, a retirement village for over-55s on the east coast of Northern Ireland.Ten of the parks have since gone into administration and Mr Gleave, who did not respond to a request for comment, now works for a renewable energy company with a focus on AI and crypto financing.Neither Prince Andrew nor Mr Gleave have ever explained the reason for the payments or the nature of any contractual relationship between the two men.Baroness Margaret Hodge, a former chair of the Commons public accounts committee, said Mr Gleave's business background raised questions for Prince Andrew about his judgement and financial dealings.\"This is yet another instance where a dose of transparency would help answer legitimate questions about the origins of the money and the purpose of the payment,\" she said.\"Without those answers any sceptical person would be worried that there might be some financial wrongdoing taking place and this would risk sullying the reputation of the Royal family,\" she added.As well as the payments he made himself, Mr Gleave's company, Alphabet Capital, was also used to funnel significant sums which had originated from Ms Isbilen to Prince Andrew and his ex-wife Sarah, court documents show.Ms Ferguson was paid £50,000 by Alphabet Capital in February 2020. It has previously been reported that she was paid £20,000 by Alphabet for a role advising the company and that she also received more than £200,000 to cover work she had done as a brand ambassador for a US solar energy company.Prince Andrew was separately given £750,000 directly by Ms Isbilen, money which he has repaid.Another £10,000 was paid from Alphabet Capital to the couple's daughter, Eugenie. This, along with a £15,000 payment from Ms Isbilen's business adviser has previously been described by Eugenie as a gift from a \"long-standing family friend\" which she said was to pay for a surprise birthday party for her mother, Sarah.Alphabet Capital filed accounts claiming it was a dormant company at the time of the payments. These were later corrected but listed a turnover of just £80,000.Prince Andrew and Mr Gleave did not respond to requests for comment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Prince Andrew took money from firm linked to ripped-off pensioners",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4dbe/live/0993d9e0-b042-11f0-a51e-ef517030d0bd.jpg"
      ],
      "datePublished": "2025-10-24T09:00:29.000Z",
      "dateModified": "2025-10-24T09:00:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China spy case witness removed 'enemy' from evidence under Tories",
    "url": "https://www.bbc.com/news/articles/cn095n9qd87o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/99b2/live/668aeee0-a3b3-11f0-9871-a159926144cf.jpg",
    "tag": "Trending",
    "date": "2025-10-24T15:58:54.000Z",
    "description": "16 minutes agoJoshua NevettPolitical reporterA key witness in the China spying case removed the term \"enemy\" from the final draft of a witness stateme",
    "body": "16 minutes agoJoshua NevettPolitical reporterA key witness in the China spying case removed the term \"enemy\" from the final draft of a witness statement submitted to prosecutors, because it did not reflect government policy at the time.In a letter to MPs, deputy national security adviser Matthew Collins said the word \"enemy\" was included in the draft witness statement written when the Conservatives were in power.But he said he told police investigating the case he could not call China an \"enemy\" as this \"did not reflect government policy\".Prime Minister Sir Keir Starmer has been accused by the Conservatives of allowing the case to collapse earlier this year by not describing China as a threat to national security.The PM's official spokesperson said Collins' letter and evidence by others published today \"underline the position the government has set out repeatedly\".\"The position throughout has been clear that what is relevant in a criminal case of this nature is the government's position at the time of the alleged offences,\" the spokesperson said.Downing Street officials say these documents are proof that there was no political interference from the current government, no minister or special adviser was involved in the evidence, and witness statements could not be shared.These are all things the Conservatives have been arguing to the contrary.The focus now turns on the Conservatives and the Crown Prosecution Service (CPS) in the ongoing row about who was to blame for the collapse of the trial.Responding to the new evidence, Conservative leader Kemi Badenoch argued \"the point is that the alleged spies were charged under a Conservative government\" and they were \"let off under a Labour government\".She said she had labelled China as a \"threat to our economy\" and while she was in office.The Liberal Democrats said the latest revelations \"make a mockery of the Conservative leadership's faux outrage\" and urged Badenoch to \"answer some of the very questions she's been so keen to ask\".Charges against Christopher Cash and Christopher Berry - who deny the allegations - were dropped in September.Director of Public Prosecutions Stephen Parkinson, who heads the CPS, said the case fell apart because evidence could not be obtained from the government referring to China as a national security threat.The Joint Committee on the National Security Strategy, which is made up of senior MPs and peers, launched an inquiry last week and has published evidence from Collins and others.It's expected that evidence submitted to Parliament by the director of public prosecutions will also be published later today.Among those giving evidence at a hearing next week will be Collins, who provided prosecutors with three witness statements - two written while the Conservatives were in power and one under Labour.The three statements were published by the government last week.In his first witness statement, submitted on 22 December 2023, Collins described the UK's policy towards China, as it stood under the then-Tory government.He said China posed an \"epoch-defining challenge\", in language that mirrored government policy at the time, as outlined in the Integrated Review Refresh 2023.Collins - the deputy director of national security (DNSA) - has now submitted evidence in a letter to the committee before appearing in front of MPs.Cash and Berry were charged under the Official Secrets Act 1911.Under the legislation, anyone accused of spying can only be prosecuted if the information they passed on was useful to an enemy.In his letter, Collins said Counter Terrorism Police (CTP) requested that he act as a witness in the case in August 2023, including to support the \"enemy\" description needed to mount a prosecution under the 1911 Act.Collins said his legal counsel worked with junior officials to prepare \"a draft text which could form the basis of a witness statement\".He said he reviewed the \"draft wording and amended the statement to ensure factual accuracy and that it was in line with current government policy\".In his letter, Collins wrote: \"These amendments reflected the DNSA's assessment of the evidence provided by operational partners based on his professional experience in advising the prime minister on national security threats, and to accurately represent the government's view of the range of national security threats posed by China.\"Drafts of a statement provided to DNSA included the term 'enemy' but he removed this term from the final draft as it did not reflect government policy.\"Collins said he sent a final version of the draft to the prime minister at the time, Rishi Sunak, and his special advisers.He said at this point, police were told he \"could not call China an 'enemy' as this did not reflect government policy\".Collins said prosecutors were made \"aware of this in December 2023, which was before charges were brought\".He said police asked him to provide two further witness statements, which he submitted in February and August this year.Collins said when police requested the third witness statement, it was \"made clear by CTP that they were only asking for the government's view of the threat from China at the material time that the offences were committed\".Labour's Attorney General Lord Hermer has also submitted evidence to the same committee.In it, he revealed he was informed on 3 September that prosecutors were dropping the case - but was told not to alert other ministers, including the prime minister.Lord Hermer said he received routine updates from the CPS in August indicating the trial was expected to proceed.But during a meeting on 3 September, DPP Parkinson confirmed the decision to drop the case.Lord Hermer said at the DPP's request, he kept the information confidential until police and defendants were informed.The attorney general said \"there is nothing unusual\" in the law officers \"being requested to keep information about individual prosecution decisions confidential even from senior colleagues\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China spy case witness removed 'enemy' from evidence under Tories",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/99b2/live/668aeee0-a3b3-11f0-9871-a159926144cf.jpg"
      ],
      "datePublished": "2025-10-24T15:58:54.000Z",
      "dateModified": "2025-10-24T15:58:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Mind-boggling' poker fraud used X-ray tables, high-tech glasses and NBA players",
    "url": "https://www.bbc.com/news/articles/cz6nd9wnzn6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/aaad/live/9999e380-b0d4-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "Trending",
    "date": "2025-10-24T11:18:44.000Z",
    "description": "5 hours agoNardine SaadNBAE via Getty Images / ReutersFormer NBA player Damon Jones (left) and basketball coach Chauncey Billups were arrested in conn",
    "body": "5 hours agoNardine SaadNBAE via Getty Images / ReutersFormer NBA player Damon Jones (left) and basketball coach Chauncey Billups were arrested in connection with the schemeCelebrities, professional sports stars and wealthy gamblers sat at a table hoping to win big in a game of Texas Hold 'Em.But they didn't know it was nearly impossible. They were \"fishes\" allegedly being targeted by the mafia in an elaborate poker gambling scheme that included X-ray card tables, secret cameras, analysers in chip trays and sunglasses and contact lenses that could read their hand. In what sounds like an Ocean's Eleven film plot, prosecutors say these \"unwitting\" victims were cheated out of at least $7m (£5.25m) in poker games - with one person losing at least $1.8m.The scheme, which US prosecutors described as \"reminiscent of a Hollywood movie\", was dismantled in a sprawling federal investigation that led to more than 30 arrests, including members of La Cosa Nostra crime families, Portland Trail Blazers basketball coach Chauncey Billups and former National Basketball Association (NBA) player Damon Jones. FBI director Kash Patel called it a \"mind-boggling\" fraud scheme that cheated victims in New York, Miami, Las Vegas and other US cities. Arrests in the scheme were announced on Thursday along with those in an alleged basketball betting plot, in which professional NBA players are accused of faking injuries to influence betting odds. The underground poker scheme started as early as 2019, prosecutors say, and was allegedly operated by the mafia - specifically by members of notorious crime families, including Bonnano, Gambino, Lucchese and Genovese. A cut of the profits, prosecutors say, helped fund their criminal enterprise. Former professional athletes, described by prosecutors as \"face cards\", were enlisted to help in the scheme and entice victims into playing. Lured in by the opportunity to play with a high-profile celebrity - such as Billups or Jones - a wealthy, \"unwitting victim\" would be recruited for illegal, underground poker games where tens of thousands of dollars were on the line, prosecutors allege. Unbeknownst to the lured-in players - referred to in the scheme as a \"fish\" - everyone surrounding them was in on the elaborate scam - from the players to the dealers, even the technology used to shuffle the deck and count the chips, according to a lengthy federal indictment. Sophisticated wireless technology was also used to deceive the players during the games, most commonly in Texas Hold 'Em.What we know about gambling arrestsAn X-ray poker machine was employed to read facedown cards and a rigged card-shuffling machine was also used in the plot, prosecutors sayThe technology was everywhere - an X-ray table that read any face-down card, analysers inside chip trays, a rigged shuffling machine that read cards and predicted who would have the best hand, and pre-marked cards that allowed those wearing special sunglasses and contact lenses to read what was in everyone's hands. Secretive cameras - built into tables and light fixtures - also helped convey information to those helping in the plot, authorities say. Then there was also a sophisticated method of communicating and rigging the game, prosecutors allege. Information from the game would be sent to an off-site conspirator - called an \"operator\" by prosecutors - who then would send information to another player sitting at the table who was in on the scheme - who prosecutors call a \"quarterback\" or \"driver\". That person would then secretly signal to others, prosecutors allege, effectively stealing money and making it impossible for victims to win. Texts from the US justice department's evidence suggest the \"quarterback\" would either touch the $1,000 poker chip, tap his chin, wrist or arm to signal which conspirator had the best hand. If the victim had the best hand, the \"quarterback\" would touch his black chips.The texts also appear to show that at times conspirators agreed to lose some hands in order to keep victims at the gambling table for longer.US Department of JusticeAnother series of texts suggests participants in the scheme avoided suspicion of cheating by swapping in players and losing money to co-conspirators.Authorities estimate that each game would leave a victim out of tens or hundreds of thousands of dollars.Prosecutors say the defendants allegedly laundered the funds from the scheme through cryptocurrency, cash exchanges and shell companies. A cut of the profits went to those who helped in the plot, prosecutors say, and some allegedly went to fund the mafia's criminal enterprise. \"This alleged scheme wreaked havoc across the nation, exploiting the notoriety of some and the wallets of others to finance the Italian crime families,\" said FBI Assistant Director in Charge Christopher Raia.Billups, who was accused of being a face card in the fixed card games, was arrested in Portland and was placed on leave by the NBA. The Portland Trail Blazers said in a statement that they were aware of the allegations involving their head coach and were \"fully co-operating with the investigation\".Jones was arrested in relation to both the poker and NBA injuries scheme. He is charged with two counts each of wire fraud conspiracy and money laundering conspiracy.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Mind-boggling' poker fraud used X-ray tables, high-tech glasses and NBA players",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/aaad/live/9999e380-b0d4-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-24T11:18:44.000Z",
      "dateModified": "2025-10-24T11:18:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Armed police handcuff teen after AI mistakes crisp packet for gun in US",
    "url": "https://www.bbc.com/news/articles/cgjdlx92lylo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/db61/live/e50a8580-b0d5-11f0-bf5a-11e181bfe30d.jpg",
    "tag": "Trending",
    "date": "2025-10-24T14:24:00.000Z",
    "description": "2 hours agoLiv McMahon and Imran Rahman-Jones,Technology reportersA US teenager was handcuffed by armed police after an artificial intelligence (AI) s",
    "body": "2 hours agoLiv McMahon and Imran Rahman-Jones,Technology reportersA US teenager was handcuffed by armed police after an artificial intelligence (AI) system mistakenly said he was carrying a gun - when really he was holding a packet of crisps. \"Police showed up, like eight cop cars, and then they all came out with guns pointed at me talking about getting on the ground,\" 16-year-old Baltimore pupil Taki Allen told local outlet WMAR-2 News. Baltimore County Police Department said their officers \"responded appropriately and proportionally based on the information provided at the time\".It said the AI alert was sent to human reviewers who found no threat - but the principal missed this and contacted the school's safety team, who ultimately called the police.But the incident has prompted calls by some for the schools' procedures around the use of such technology to be reviewed.Mr Allen told local news he had finished a bag of Doritos after football practice, and put the empty packet in his pocket.He said 20 minutes later, armed police arrived. \"He told me to get on my knees, arrested me and put me in cuffs,\" he said.Baltimore County Police Department told BBC News Mr Allen was handcuffed but not arrested.\"The incident was safely resolved after it was determined there was no threat,\" they said in a statement.Mr Allen said he now waits inside after football practice, as he does not think it is \"safe enough to go outside, especially eating a bag of chips or drinking something\".In a letter to parents, school principal Kate Smith said the school's safety team \"quickly reviewed and cancelled the initial alert after confirming there was no weapon\".\"I contacted our school resource officer (SRO) and reported the matter to him, and he contacted the local precinct for additional support,\" she said.\"Police officers responded to the school, searched the individual and quickly confirmed that they were not in possession of any weapons.\"However, local politicians have called for further investigation into the incident.\"I am calling on Baltimore County Public Schools to review procedures around its AI-powered weapon detection system,\" Baltimore County local councilman Izzy Pakota wrote on Facebook.Omnilert, the provider of the AI tool, told BBC News: \"We regret this incident occurred and wish to convey our concern to the student and the wider community affected by the events that followed.\"It said its system initially detected what appeared to be a firearm and an image of it was subsequently verified by its review team.This, Omnilert said, was then passed to the Baltimore County Public Schools (BCPS) safety team along with further information \"within seconds\" for their assessment.The security firm said its involvement with the incident ended once it was marked as resolved in its system - adding it had \"operated as designed\" on the whole.\"While the object was later determined not to be a firearm, the process functioned as intended: to prioritise safety and awareness through rapid human verification,\" it said.Omnilert says it is a \"leading provider\" of AI gun detection - citing a number of US schools among its case studies on its website.\"Real-world gun detection is messy,\" it states.But Mr Allen said: \"I don't think no chip bag should be mistaken for a gun at all.\"The adequacy of AI to accurately identify weapons has been subject to scrutiny.Last year, a US weapons scanning company Evolv Technology was banned from making unsupported claims about its products after saying its AI scanner, used in thousands of US schools, hospitals and stadiums entrances, could detect all weapons.BBC News investigations showed these claims to be false.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Armed police handcuff teen after AI mistakes crisp packet for gun in US",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/db61/live/e50a8580-b0d5-11f0-bf5a-11e181bfe30d.jpg"
      ],
      "datePublished": "2025-10-24T14:24:00.000Z",
      "dateModified": "2025-10-24T14:24:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lily Allen is 'vicious' and 'raw' on her tell-all break-up album",
    "url": "https://www.bbc.com/news/articles/c5ypgze4l2zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a87b/live/26e85960-b0c6-11f0-a4e2-3dc7e4914bd9.jpg",
    "tag": "Trending",
    "date": "2025-10-24T11:45:55.000Z",
    "description": "4 hours agoMark SavageMusic correspondentGetty ImagesLily Allen has had two previous UK number one albumsAs break-up albums go, Lily Allen's new recor",
    "body": "4 hours agoMark SavageMusic correspondentGetty ImagesLily Allen has had two previous UK number one albumsAs break-up albums go, Lily Allen's new record West End Girl is one for the history books.Written and recorded in just 10 days, it's a real-time account of her shock, grief, confusion and anger, as her four-year marriage to actor David Harbour fell apart, amid accusations of infidelity.In interviews, Allen has stressed the lyrics aren't necessarily the gospel truth - because she \"wasn't sure what was real, and what was in my head\" as she processed the end of the relationship.But critics have lavished praise on the record, calling it a \"jaw-dropping\" and \"brutal\" act of \"personal exorcism\", while praising Allen's gift for melody, on songs that span  flamenco, bossa nova, and \"infectious pop\".'Rooted in darkness'West End Girl is the star's first album in seven years, following 2018's Mercury Prize-nominated No Shame. Speaking to Perfect Magazine earlier this week, Allen said she had continued writing in the intervening years, but had struggled to feel \"emotionally attached\" to the material.\"I just didn't think it was any good,\" she said, before confessing: \"It's easier to write funny things that are rooted in darkness or anger or... terminal hatred.\"West End Girl marries all of those emotions to pithy, witty storytelling that's been Allen's trademark since her debut, Alright, Still in 2006.ReutersLily Allen and her ex-husband, Stranger Things actor David Harbour, pictured in 2022Narratively, it begins with the singer falling in love, moving to New York with her two daughters, and setting up home in \"a nice little rental near a sweet little school\".But the first signs of trouble begin when she's cast in a West End Play (Allen received a Laurence Olivier nomination for her stage debut in 2:22 A Ghost Story, in 2021).\"That's when your demeanour started to change,\" she sings, as clouds gather over the breezy musical backdrop. \"You said that I'd have to audition, I said 'You're deranged'\".As the album progresses, the relationship continues to sour. Her husband disappears for weeks on end, and Allen, or the character she is portraying, reluctantly accepts the conditions of an open marriage.\"He had an arrangement, be discreet and don't be blatant / There had to be payment, it had to be with strangers.\"It all blows up when she finds text messages, and she says: \"Is it just sex or is there emotion?\"In one of the album's most brutal scenes, Allen, or her character, visits an apartment where she believed her husband was practising karate, only to discover a room scattered with sex toys and \"a shoebox full of handwritten letters from brokenhearted women\".When she finally ends the relationship, she's bewildered and wounded by his indifference, wondering over and over, \"why won't you beg for me?\"It's only on the two final tracks where she accepts the need to move on and burn her bridges. \"I will not absorb your shame, it's you who put me through this,\" she sings over a  stripped-bare beat on Let You W/in. \"I can walk out with my dignity if I lay my truth out on the table.\"'Sharp, pithy pop'The musician has been careful to clarify that some of the songs are written \"in character\", saying that the lyrics \"could be considered autofiction\" - a genre that combines autobiography and fiction.Harbour has also been circumspect about the end of the marriage. \"I'm protective of the people and the reality of my life\", he told GQ magazine in April.\"There's no use in that form of engaging [with tabloid news] because it's all based on hysterical hyperbole.\"But reviews of West End Girl have understandably focused on the lyrics.It is \"a brutal, tell-all masterpiece,\" said The Independent's Hannah Ewens in a five star review. \"This musical of deceit and suffering puts her in the starring role, seizing control of her narrative and holding little back.\"\"Despite the heartache, or perhaps because of it, she sounds artistically reinvigorated,\" argued Adrian Thrills in the Daily Mail, awarding the album four stars. \"There's a touch too much auto-tune on her voice at times, but no doubting her ability to convey raw emotion with sharp, pithy pop.\"It's a \"victorious comeback\" that represents the star \"at her very best\", said the NME's Ali Shutler. \"There's a lot of grief and misery [but] Allen's always had a knack for making devastation sound exciting.\"\"Anyone who's been betrayed will welcome the bravery of her honesty,\" wrote Helen Brown in The Telegraph, \"while no doubt counting their blessings not to live in the emotionally detached celebrity world of sad sex and lonely mansions.\"\"It's hard not to wonder whether West End Girl is going to get the reception it deserves,\" noted The Guardian's Alexis Petridis, calling it a \"great pop album regardless of the subject matter\". \"Perhaps some listeners will view it as too personal to countenance. Or perhaps fans who have grown up alongside Allen, now 40, will find something profoundly relatable in the story it has to tell.\"BMG Music/PAWest End Girl is a pun on the singer-turned-stage star's west London rootsWest End Girl will no doubt fuel a renewed tabloid frenzy over Allen's love life. Heck, I've just spent 800 words summarising her account of the relationship. But in her own words, the album was necessary. At the start of the year, she took time off her hit BBC podcast Miss Me? to deal with her spiralling mental health and checked into rehab. \"The feelings of despair that I was experiencing were so strong,\" she told Vogue. \"The last time that I felt anything like that, drugs and alcohol were my way out, so it was excruciating to sit with those [feelings] and not use them.\"Writing West End Girl, it seems, was her way of coping, of healing and, just maybe, of settling scores. \"If what you're doing isn't provocative, what's the point?\" she told Perfect Magazine.  \"And if it's not scary, what's the point? I'm not here to be mediocre. \"My strength is my ability to tell a story. And so I'm going to lean into that. I have to. It's all I have.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lily Allen is 'vicious' and 'raw' on her tell-all break-up album",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a87b/live/26e85960-b0c6-11f0-a4e2-3dc7e4914bd9.jpg"
      ],
      "datePublished": "2025-10-24T11:45:55.000Z",
      "dateModified": "2025-10-24T11:45:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Waitrose offers job to autistic worker it had previously rejected",
    "url": "https://www.bbc.com/news/articles/cgkzgpkm5ryo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dc5d/live/cf9ae970-af17-11f0-904a-f9028cea88d6.jpg",
    "tag": "Trending",
    "date": "2025-10-24T10:08:03.000Z",
    "description": "Waitrose has reversed its decision not to offer paid work to an autistic man after initially saying he had to stop stacking shelves at the store where",
    "body": "Waitrose has reversed its decision not to offer paid work to an autistic man after initially saying he had to stop stacking shelves at the store where he had volunteered for four years.In July, Frances Boyd asked whether her 28-year-old son Tom Boyd could be given a job at the supermarket in Cheadle Hulme, Greater Manchester, but her request was eventually rejected by Waitrose head office.On Thursday, rival chain Asda said it wanted to offer Tom paid shifts at its Cheadle Hulme store.Responding to Waitrose's U-turn, Frances said: \"We are going to think about it and decide whether it is in Tom's best interests to return... and are having further discussions with Waitrose.\"A spokesman for Waitrose said: \"We'd like to welcome Tom back, in paid employment, and are seeking support from his family and the charity to do so. \"We hope to see him back with us very soon.\"We care deeply about helping people into the workplace who might otherwise not be given a chance.\"As such, we warmly welcomed Tom and his support worker into our Cheadle Hulme branch to gain experience and build his confidence.\"We have policies in place to support volunteering, and are investigating what's happened in Tom's situation.\"Frances said she had been \"overwhelmed\" by how people had responded to her talking about her son's experiences.Tom, who has limited communication skills, was praised for his work ethic by managers.\"He gave over 600 hours of his time purely because he wanted to belong, contribute, and make a difference,\" said his mum.Frances praised and thanked staff at Waitrose's Cheadle Hulme store for supporting him, adding: \"They included him and were absolutely brilliant.\"I think he was just under the radar - all was running smoothly until it went to head office.\"Tom and his mum have been backed by Greater Manchester mayor Andy Burnham.He posted on X that Tom had received \"truly terrible\" treatment and promised to \"support him to find another placement that works\".Burnham said the Greater Manchester Combined Authority \"would encourage all employers - including Waitrose - to sign up to our brand new Bee Neuroinclusive Code of Practice\".Speaking with Frances, who broke the news of Tom's Asda job offer on BBC Radio Manchester, the Labour mayor said: \"Good on you for raising awareness because we need a huge awareness campaign here.\"She accepted his offer to become an advocate for the campaign.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Waitrose offers job to autistic worker it had previously rejected",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dc5d/live/cf9ae970-af17-11f0-904a-f9028cea88d6.jpg"
      ],
      "datePublished": "2025-10-24T10:08:03.000Z",
      "dateModified": "2025-10-24T10:08:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]