[
  {
    "title": "Just Mercy",
    "url": "https://www.bbc.co.uk/iplayer/episode/m001sxzv/just-mercy?at_mid=6Bcfozucbt&at_campaign=Just_Mercy&at_medium=display_ad&at_campaign_type=owned&at_audience_id=SS&at_product=iplayer&at_brand=m001sxzv&at_ptr_name=bbc&at_ptr_type=media&at_format=image&at_objective=consumption&at_link_title=Just_Mercy&at_bbc_team=BBC&at_nation=NET&at_creation=Film",
    "image": "https://ichef.bbci.co.uk/images/ic/1200x675/p0gt2kdj.jpg",
    "tag": "Trending",
    "date": "2026-02-01T02:00:37.000Z",
    "description": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News         ",
    "body": "        Homepage    Accessibility links   Skip to content   Accessibility Help     BBC Account      Notifications        Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live               More menu             Search iPlayer              Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food        Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live         Close menu      \niPlayer NavigationiPlayer Accessibility Help;;Channels Sub NavigationBBC OneBBC TwoBBC ThreeBBC FourBBC Radio 1CBBCCBeebiesBBC ScotlandBBC NewsBBC ParliamentBBC AlbaS4CCategoriesCategory Sub NavigationDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAudio DescribedSignedNorthern IrelandScotlandWalesCBeebiesCBBCDrama & SoapsFilmsComedyDocumentariesSportNewsEntertainmentMusicFoodLifestyleHistoryScience & NatureArtsFrom the ArchiveAccessible alternative formatsAudio DescribedSignedRegionsNorthern IrelandScotlandWalesChildren’sCBeebiesCBBCA-ZTV GuideWatchlistHomeJust MercyJust MercyContains very strong language.In 1988, attorney Bryan Stevenson courageously chooses to fight injustice, armed with nothing but a Harvard law degree and the resolve to help people whose lives are literally on the line.  Duration2h 7mFirst shown2019Available for 19 daysWatchlistAudio DescribedSign LanguageMore Like ThisMore Like This EpisodesGet OutYou may be invited, doesn't mean you're welcome. Terror with Daniel Kaluuya1h 38mRetreatNo neighbours. No help. No escape. Tense thriller with Cillian Murphy and Thandie Newton1h 25mTillHow a mother's pain shaped a nation. Based on the real-life lynching of a teen in 50s USA2hThe BlackeningThey can't all die first, but stereotypes can kill. Satirical slasher with a stellar cast1h 31mMiami ViceNo rules. No law. No order. Thrilling action starring Colin Farrell and Jamie Foxx2h 1mRushEveryone's driven by something. The ruthless rivalry between Formula One's Hunt and Lauda1h 51mThe NotebookYou never forget first love. A sweeping love story with Ryan Gosling and Rachel McAdams1h 55mOne LifeOn the eve of WWII, one man did the impossible. Sir Nicholas Winton's inspiring true tale1h 40mDefianceAn act of vengeance that became a journey of hope. True WWII thriller with Daniel Craig2h 5mThe Last Letter from Your LoverFelicity Jones stars in a romance for the ages. Some love stories deserve a second chance1h 41mWhat's Love Got to Do with It?Lily James and Shazad Latif star. Two friends look for lasting love in the modern world1h 43mThe Night ManagerStylish. Devilish. Deadly. John le Carré's twisted spy thriller with Tom Hiddleston",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Just Mercy",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1200x675/p0gt2kdj.jpg"
      ],
      "datePublished": "2026-02-01T02:00:37.000Z",
      "dateModified": "2026-02-01T02:00:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The ghost ships in the English Channel and the question of what to do about them",
    "url": "https://www.bbc.com/news/articles/c07jnmgy8jmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/37ac/live/9dd85410-0695-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-11T00:17:37.000Z",
    "description": "13 hours agoPaul Adams,Diplomatic CorrespondentandKayleen Devlin,BBC VerifyBBCOn 26 January, staff in an office in Mumbai received an urgent e-mail fr",
    "body": "13 hours agoPaul Adams,Diplomatic CorrespondentandKayleen Devlin,BBC VerifyBBCOn 26 January, staff in an office in Mumbai received an urgent e-mail from a crew member aboard a tanker off the coast of Singapore.The email, purportedly written on behalf of five colleagues aboard the tanker sailing under the name Beeta, contained a litany of complaints: crew members, it was alleged, had not been paid and were being treated \"like animals\"; and provisions were running low.The staff in Mumbai worked for the International Transport Workers Federation (ITF), the world's leading organisation representing seafarers, and were used to dealing with complaints from all corners of the globe.But what caught their eye was the fact that the emails hadn't just been copied to multiple ITF offices, but also to sanctions enforcement bodies in several countries.\"The vessel is sanctioned and blacklisted,\" the sailor wrote.He said he had discovered that the vessel calling itself the Beeta was in fact an American-sanctioned tanker called the Gale.The sailor and his colleagues were desperate to leave.\"I've been at sea for many years,\" he told the BBC when we contacted him. \"I know what's right and wrong.\"Inadvertently, the crew member had found himself involved in a problem at the heart of some of today's most contentious geopolitical issues: a surging number of tankers, transporting Russian and Iranian oil, operating outside maritime rules, using a variety of methods to conceal their identities.This \"shadow fleet\", as it's known, is growing fast.ITFThis image shows the American sanctioned tanker called the GaleEstimates vary, but the latest data from the monitoring group TankerTrackers.com says the fleet currently consists of 1,468 vessels, roughly triple its size at the time of Russia's full-scale invasion of Ukraine four years ago.That's about 18-19% of the total internationally trading tanker fleet, carrying approximately 17% of all seaborne crude, says Michelle Wiese Bockman, senior maritime intelligence analyst at Windward AI.The phenomenon that first emerged in the 2010s, as North Korea and Iran sought to evade international sanctions, has proliferated, leaving western governments scrambling to keep up.So what can those governments do when countries circumvent or flout the rules to export oil and use the profits to fuel engines of war or repression?'Modern-day slavery'Definitions vary - as do names: it's also been called the \"dark\" or \"ghost\" fleet - but shadow vessels generally exhibit some or all of a particular set of characteristics.They tend to be old, averaging an age of around 20 years, and are often poorly maintained. Details of ownership and management are deliberately opaque - names, identification numbers and flags are frequently changed. Insurance is below Western standards and sometimes fake.Vessels frequently switch off or manipulate their automatic identification system (AIS), making them harder to track.Seamen, recruited on contracts that typically last six to nine months, don't always know what they're getting into.\"I didn't understand what shadow fleet vessels actually were,\" Russian engineer Denis told us, after serving aboard an EU- and UK-sanctioned tanker, Serena, for several months last year.Serena is currently flying under the flag of Cameroon. While Denis was aboard, it was flying a false Gambian flag.Denis says he realised the Serena was under sanctions only when he went aboard. But like many seamen, he says he needed the work.\"Once they're at sea, they've got them prisoner on board,\" says Nathan Smith, an ITF inspector familiar with the Serena.Smith has heard numerous stories of abuses aboard shadow vessels.\"It's a modern-day slavery,\" he says.Over the course of months spent sailing between Russia and China, the reality of life aboard a shadow vessel became increasingly apparent to Denis.\"Things began to deteriorate very quickly because no spare parts were sent,\" he said. \"The radar on the bridge hadn't been working for over a year, the life-saving equipment wasn't working and there were numerous faulty fire sensors.\"During a stop at the Russian port of Vladivostok, last October, the crew tried, without success, to repair a davit, a small specialised crane used to lower the tanker's life boats into the water. Denis says a port official nevertheless issued a certificate of successful inspection. The BBC has approached the Port of Vladivostok for comment.Denis says he never found out who owned the Serena or who crew members could contact to raise complaints.It's notoriously difficult to establish ownership of shadow fleet vessels. Ships have registered owners, which are often shell companies or entities set up to manage a single vessel. The names of real, or \"beneficial\" owners are frequently hidden. We have tried to make contact with the owners of the Gale and Serena, but without success. In the case of the Gale, it has proved impossible to establish the identity of the beneficial owner.Crews are poorly protected throughout the industry, with unpaid wages and abandonment by owners all-too frequent. But Denis says shadow vessels are the worst.\"Now I'll be more careful,\" he says. \"I've learned to identify dangerous vessels that I won't work on any more.\"The ships brought back from the deadDeep within the murky recesses of the shadow fleet also lurks a category experts have dubbed \"zombie ships\" - vessels which steal the identity of dead ships in order to hide their true identity.After being sanctioned, a zombie ship often disappears from tracking systems, later reappearing under a new name, using a stolen nine-digit International Maritime Organisation (IMO) number from a scrapped or decommissioned vessel.The ship's AIS tracking system, which uses transponders to continuously broadcast its location, is re-programmed to imitate the previous vessel.With the dead tanker's identity magically resurrected, the zombie ship continues to ply its trade, free from sanctions.The Gale is one such ship.According to the global trade intelligence company Kpler, the tanker, currently flying a false Gambian flag, has assumed multiple identities since being sanctioned by the US last year for its involvement in the export of sanctioned Iranian oil.After a period sailing under the false identity Sea Shell, using a different stolen IMO number, the Gale again changed identities, re-emerging as Beeta and loading a cargo of Iranian oil on 31 January.According to TankerTrackers.com, which uses satellite imagery, AIS data and shoreline photography to follow the movement of crude oil, the shipment was delivered by another US-sanctioned vessel via a ship-to-ship transfer, a procedure commonly used by shadow-fleet vessels involved in the shipment of sanctioned oil.Copernicus Sentinel 2, 2026Satellite imagery shows the Gale (Beeta) loading a cargo of Iranian oil in a ship-to-ship tranferThe ship-to-ship transfer took place south of the Riau Archipelago, around 150 miles east of Singapore.Windward AI's Michelle Wiese Bockmann calls the area \"an epicentre of maritime lawlessness\", where dozens of tankers gather to store or transfer Iranian oil.Bockmann says China imported 1.8 million barrels per day of sanctioned Iranian crude per day in 2025. The BBC has contacted the Chinese embassy for a response.\"None of it was traced,\" she says, \"because tankers hide their loading and the oil has come on four or five tankers, deliberately to obscure the origin and destination of the cargo.\"The Gale's history and behaviour mark it out as a classic zombie ship.A computer screenshot taken on board by the crew member who contacted the ITF appears to give instructions on how to fake the ship's location, a process known as spoofing.Two other screenshots, taken on 26 January, show the spoofing at work.One displays the tanker's actual location, east of Singapore. The second, taken just five minutes later, shows a fake location, around 2,800 miles away, off the coast of the Indian state of Gujarat.\"The confirmed linkage between Gale, Sea Shell, and Beeta, alongside fabricated AIS position history and prior impersonation, is consistent with deliberate identity manipulation,\" says Ana Subasic, an analyst at the global trade intelligence company Kpler.The BBC has no reason to believe the Serena is a zombie vessel, but the ship's former engineer says he saw equipment that would enable the Serena to fake its position.\"I spoke with the bridge officers about turning off the AIS and other manipulation,\" Denis told us. \"We had equipment on board to change the vessel's position. I think this equipment is only used for sanctioned cargo.\"What can be done?Such practices, coupled with the knowledge that Russian and Iranian oil revenues continue to fuel conflict in Ukraine and the Middle East, are driving an urgent debate in western capitals about how to respond.Donald Trump's recent actions in Venezuela – seizing seven tankers since early December as part of a pressure campaign on the regime of then president Nicolás Maduro – has shown that one solution is the simple application of force.The operation to chase and capture one vessel, the Russian-flagged tanker Marinera, took the US military, including a coastguard vessel and special forces, on a two-week chase far out into the North Atlantic.The Marinera, previously known as the Guyanese-flagged Bella 1, was wanted by the US for transporting sanctioned oil from both Venezuela and Iran.Getty ImagesBella 1, renamed Marinera, was intercepted in the early hours of 7 JanuaryThe change of name and flag was designed to provide the tanker with a measure of international protection.Upping the ante further, Russia took the highly unusual step of requesting that the US call off its pursuit and said it had dispatched a submarine to escort the tanker, which was empty at the time. The Russian Foreign Ministry said there was not \"any basis\" to allege the tanker was sailing \"without a flag\" or \"under a false flag\".Undeterred by the possibility of an international incident or by the possible accusation of piracy on the high seas, the US intercepted the Marinera in international waters between Iceland and the UK in the early hours of 7 January.Getty ImagesThe Russian-flagged Marinera - seen in January in Burghead, Scotland - was wanted by the US for transporting sanctioned oil from both Venezuela and IranFor the first time, the UK got involved, sending an RAF surveillance aircraft and a Royal Navy support ship to help the operation.Defence Secretary John Healey said the action was \"in full compliance with international law\" and said the UK was \"stepping up activity against shadow vessels\".Perhaps spurred on by Washington's assertive approach, there is some evidence that European partners are willing to take more robust action too.Two weeks after the Marinera episode, France launched an operation in the Mediterranean to seize the Grinch, another Russia-linked tanker suspected of violating international sanctions.ReutersA French navy boat stopping the Grinch oil tankerOnce again, the UK was involved. A Royal Navy patrol boat, HMS Dagger, shadowed the Grinch, as it passed through the Strait of Gibraltar.With at least one sanctioned vessel passing through the English Channel every day, according to experts, speculation is mounting that the UK might soon conduct its own interceptions.Healey recently told MPs that \"further military options\" were being explored.For some, it can't come soon enough.\"There's obviously huge frustration in the policy-maker circles in Brussels and London that Russia is continuing to sell its oil,\" says Tom Keatinge, founding director of the Centre for Finance and Security at the Royal United Services Institute (Rusi) in London.Keatinge runs a maritime sanctions task force at Rusi, bringing together representatives from industry and government. Some participants, he sees, are keen to see more forthright action.\"We have people… who like jumping out of helicopters on ropes,\" he says. \"And that community has thus far been kept firmly in its box.\"He adds: \"Put bluntly, no one's had the balls to look at what is often a 50-50 call and say 'We'll send the boys in'.\" The MoD said: \"Deterring, disrupting and degrading the Russian shadow fleet is a priority for this government.\"But the constraints are considerable.\"You've got a bunch of consequences that you need to be ready to deal with,\" Keatinge says. \"The first is you've got an absolutely enormous vessel. What the hell do you do with that?\"Once seized, tankers need to be maintained, with engines running and a skeleton crew on board. The appetite for holding such vessels, particularly older ones that might pose an environmental risk, is minimal.The Marinera remains moored in the Moray Firth, with other US-seized vessels being held off the coast of Texas and Puerto Rico.\"If you look at the very high costs that the US is probably incurring at the moment to have two tankers off Houston, awaiting legal action, it's not something you take lightly,\" says Bockmann.A problem of resourcesThen there's the question of what to do with the oil itself.Again, Trump's approach is blunt: confiscate it.The president says 50 million barrels have been taken so far, as the US assumes control of Venezuela's oil industry.\"Venezuela is going to get some and we're going to get some,\" he said in a recent interview.The president's European allies are unlikely to follow suit.\"That would probably be a step too far for the Foreign Office,\" says Keatinge.So would Ukraine's increasingly direct approach. In recent months, Kyiv has targeted at least seven Russian shadow fleet tankers, using a variety of drones and mines.ReutersA Ukrainian sea drone shows the Dashan, a tanker part of Russia's so-called \"shadow fleet\", being struck by another sea drone in the Black SeaMost of Ukraine's attacks have been in the Black Sea, but one tanker, the Qendil, was hit and critically damaged while passing through the Mediterranean in December. Another tanker, the Mersin, was attacked and immobilised off the coast of Senegal in late November. Kyiv has not commented on reports that it carried out the attack.Most of the international effort so far has been more bureaucratic than kinetic: sanctioning hundreds of vessels, persuading countries such as The Gambia, Sierra Leone and Comoros, among others, to tighten their regulations, and addressing the issue of insurance.The number of falsely flagged ships globally more than doubled last year to over 450, according to the IMO, the BBC reported in November.Last year, the European Commission introduced new rules requiring all vessels entering EU waters to provide proof of insurance.The UK has a similar, voluntary reporting scheme, but shadow fleet vessels often ignore it or alter course when challenged.Ultimately, the sheer number of shadow vessels poses a simple problem of resources.But with Russian ships sometimes suspected of involvement in the monitoring or sabotage of undersea cables, there's an added national security dimension.In late January, the UK and thirteen other countries with Baltic and North Sea coastlines issued a coordinated warning that AIS manipulation, along with interference with Global Navigation Satellite Systems represented a growing threat to maritime safety and security.Vessels sailing under flags of convenience, the statement said, \"may be treated as a ship without nationality\", under the terms of the UN Convention on the Law of the Sea, a reminder to anyone paying attention that existing laws already provide for the detention and seizure of ships.Windward AI's Bockmann says the Trump administration's actions over Venezuela have shown European leaders what can be done.\"There's definitely a low threshold [for intervention] building for the darkest of the dark fleet,\" she says.More from InDepthThe net is gradually closing on Russian oil. Last October, the Trump administration imposed sanctions on the country's two largest oil companies, Lukoil and Rosneft.The EU's next sanctions package against Russia may include a full ban on maritime services, making it impossible for European tankers to transport Russian oil under the legal price cap currently in place.Around 30% of Russia's maritime oil exports are currently carried on EU-owned vessels.But for Russia and Iran, war and sanctions are the mothers of invention. As the net tightens, you can be sure that the world's burgeoning fleet of shadow vessels will continue to operate in the dark.Top picture: Getty ImagesBBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. Emma Barnett and John Simpson bring their pick of the most thought-provoking deep reads and analysis, every Saturday. Sign up for the newsletter here",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The ghost ships in the English Channel and the question of what to do about them",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/37ac/live/9dd85410-0695-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-11T00:17:37.000Z",
      "dateModified": "2026-02-11T00:17:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The BBC News app keeps you informed with live and breaking news you can trust",
    "url": "https://www.bbc.co.uk/news/10628994?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg",
    "tag": "Trending",
    "date": "2025-04-30T14:04:28.000Z",
    "description": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential ch",
    "body": "Depending on the contract you have, data charges may apply for accessing the internet on your mobile device.If you are not sure about the potential charges, please ask your mobile network provider. You may find some costs are included in your existing price plan or that you can opt for a data package that gives reduced charges for accessing the internet.The BBC does not charge you to access mobile content.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The BBC News app keeps you informed with live and breaking news you can trust",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11843/production/_130074717_bbcnewsfaqs.jpg"
      ],
      "datePublished": "2025-04-30T14:04:28.000Z",
      "dateModified": "2025-04-30T14:04:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Newscast - Has Keir Starmer Saved His Job (For Now)? - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/p0n09735?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg",
    "tag": "Trending",
    "date": "2026-02-10T20:50:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsNews,·10 Feb 2026,·44 minsHas Keir Starmer Saved His Job (For Now)?NewscastAvailable for over a yearToday, Keir Starmer says that he will \"never walk away from the country that I love” after surviving a turbulent 24 hours that saw the Scottish Labour leader Anas Sarwar call for him to step down. \nSpeaking to the BBC, his energy secretary Ed Miliband said the Labour Party had \"looked over the precipice” and decided to back their leader leading to a rallying of support from the cabinet and other senior party figures. \nSo, the Prime Minister is in the clear for now, but is he truly safe? Alex and James break down another turbulent 24 hours in Westminster before catching up with Daniela Relph senior royal correspondent and Caitríona Perry, BBC News chief presenter in Washington to discuss the wider fallout from the Epstein files in the US and for the royal family.  \nYou can now listen to Newscast on a smart speaker. If you want to listen, just say \"Ask BBC Sounds to play Newscast”. It works on most smart speakers. \nYou can join our Newscast online community here: https://bbc.in/newscastdiscord\nGet in touch with Newscast by emailing newscast@bbc.co.uk or send us a WhatsApp on +44 0330 123 9480.\nNew episodes released every day. If you're in the UK, for more News and Current Affairs podcasts from the BBC, listen on BBC Sounds: https://bbc.in/4guXgXd\nNewscast brings you daily analysis of the latest political news stories from the BBC. The presenters were James Cook and Alex Forsyth. It was made by Anna Harris with Shiler Mahmoudi and Chloe Scannapieco. The technical producer was Philip Bull. The assistant editor is Chris Gray. The senior news editor is Sam Bonham.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Newscast - Has Keir Starmer Saved His Job (For Now)? - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0l7jnbt.jpg"
      ],
      "datePublished": "2026-02-10T20:50:00.000Z",
      "dateModified": "2026-02-10T20:50:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Winter Olympics 2026 schedule and day-by-day guide",
    "url": "https://www.bbc.com/sport/articles/c338y36kngzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f362/live/71510460-0220-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-10T21:08:09.000Z",
    "description": "Fear and Gibson target GB's first medal - Wednesday's guideImage caption, Updated 10 February 2026The 25th Winter Olympics will feature almost 3,000 a",
    "body": "Fear and Gibson target GB's first medal - Wednesday's guideImage caption, Updated 10 February 2026The 25th Winter Olympics will feature almost 3,000 athletes from 90 countries competing for 116 medals at Milan-Cortina. Team GB have sent 53 athletes to the Games with plenty of medal potential.Here is your guide to what is happening each day and who to look out for.All times GMT.Day five: Wednesday, 11 February Medals: SevenMedal events: Men's Super-G (10:30-12:50); Men's Nordic combined (09:00-13:35); Women's moguls (10:00-14:15); Women's biathlon 15km (13:15-15:10); Men's speed skating 1000m (17:30-19:00); Luge doubles (16:30-19:40); Figure skating ice dance (18:30-22:15).Daily highlightsAlpine skiing: Men's super-G (10:30-12:50)Swiss speedster Marco Odermatt will be the man to beat if the 2025 season is anything to go by – the 28-year-old finished almost 300 points clear of his nearest rival Vincent Kriechmayr of Austria in the World Cup rankings and also claimed the World Championship title in February. Shocks do occur in this sport, however, like Ryan Cochran-Siegle's silver in Beijing four years ago. The American won't be a medal favourite in Milan but every time he's reached a World Cup podium it has been on Italian snow.Ice hockey: Men's preliminary round (15:40)  The opening game of the men's ice hockey is a high-profile clash between Finland and Slovakia, the 2022 gold and bronze medallists respectively. The return of NHL players to the Olympics for the first time since 2014 means team rosters will be stacked with world-class talent. Both sides will be vying to win Group B as that would mean they advance directly to the quarter-finals without having to contest an extra match in the play-off round.Luge: Men's & women's doubles (16:00)Officially, women's doubles is the only new luge event at these Olympics but technically men's doubles is one too, as it was previously open to both sexes, albeit it was always men who took part. The women's event might offer an opportunity for a rare non-German winner, with Austria's Selina Egle and Lara Kipp winning the last two world titles. In the men's doubles, Germany's Tobias Wendl and Tobias Arlt are aiming to win gold for a remarkable fourth consecutive Games. There are two runs in each event, with the women's second run at 17:53 and the men's second run at 18:44.Curling: Men's round robin (18:05-21:05)Britain's men, skipped by Bruce Mouat, had a phenomenal 2024-25 campaign, winning the world title and becoming the first rink ever to win four Grand Slam events in one season. Now they are targeting the Olympic title that has so far eluded them, although they came mightily close in 2022, losing to Sweden in the gold medal match. GB begin their campaign against China, who had to come through the last-chance qualifying competition in December.Figure skating: Ice dance – free dance (18:30-22:05)Britain's Lilah Fear and Lewis Gibson have their eyes on the podium as the ice dance reaches its conclusion. Duos from the USA and France are likely to battle it out for gold and silver but Fear and Gibson, who won World Championship bronze last year, are hoping to become the first British figure skaters since Torvill and Dean in 1994 to earn an Olympic medal. Britain's Phebe Bekker and James Hernandez will also be competing.Good to knowUSA's Chloe Kim has overcome a recent injury to begin her quest for a third straight Olympic gold in the women's snowboard halfpipe, with qualification at 09:30. This will be the first Olympic men's snowboard halfpipe competition (18:30) since 2002 that hasn't featured USA superstar Shaun White. The top 12 qualifiers in the men's and women's events advance to the final.Can anyone stop the Dutch in the men's 1000m speed skating (17:30)? They have won gold in this event at each of the past three Games, with the now-retired Thomas Krol taking the title in 2022.Defending champion Jakara Anthony bids to become the first Australian to win two Winter Olympic gold medals in the women's moguls final (13:15).Day six: Thursday, 12 FebruaryMedals: NineMedal events: Men's moguls (09:00-12:35); Women's Super-G (10:30-12:50); Women's cross-country 10km interval (12:00-14:00); Men's snowboard cross (09:00-14:25); Women's speed skating 5000m (17:30-19:10); Mixed Luge team relay  (17:30-18:55); Women's snowboard halfpipe (18:30-20:20); Women's 500m and men's 1000m short track (19:15-21:20).Daily highlightsSkeleton: Men's heats one and two (08:30-11:00)Beijing 2022 marked the first Winter Olympics in which Great Britain failed to win a medal in skeleton but there is every hope of putting that right in Milan-Cortina. Matt Weston dabbled with rugby and taekwondo before finding skeleton but could now become Britain's first male Olympic champion in the sport. Image source, Getty ImagesImage caption, Weston was 15th on his Olympic debut in Beijing but has made huge progress sinceTwo-time reigning world champion Weston dominated at the World Cup this season, while team-mate Marcus Wyatt is also among the medal contenders at these Games. The first two of four runs take place today (08:30 and 10:08) on the new track in Cortina, with the final the next day.Alpine skiing: Women's Super-G (10:30)This event promises to be one of the most entertaining – and open – of the entire Games. Home hopes lie with all-rounder Sofia Goggia, while 2018 Olympic champion Ester Ledecka, Breezy Johnson, and Emma Aicher are in good form.Mexico's Sarah Schleper, soon to be 47, will be making all kinds of history as she competes in her seventh Winter Olympics. She'll be the oldest female alpine skier ever to compete at the Games, and the first woman to compete at three or more Winter Olympics for two different nations, having represented the USA from 1998 to 2010. Furthermore, her teenage son Lasse Federico Gaxiola has also been selected in alpine skiing, making them the first mother and son to compete at the same edition of an Olympic Winter Games.Snowboard: Women's halfpipe final (18:30-20:05)American Chloe Kim is aiming to become the first woman to win three consecutive Olympic gold medals in the halfpipe. The 25-year-old American took two years off after winning gold in Beijing but picked up right where she left off on her return. She comes to Milan-Cortina as the reigning world champion and the favourite for gold, and says she's \"good to go\" despite dislocating her shoulder in early January.Short track: Women's 500m & men's 1000m (19:15-20:50)It could be a good day for hosts Italy. Veteran skater Arianna Fontana, competing in her sixth Olympics, is bidding for a third consecutive gold in the shortest of the short track distances. Anything can happen in the unpredictable sport of short track, which provided one of the all-time famous Winter Olympic moments when Australian Steven Bradbury took gold in the men's 1000m in 2002 after the other competitors wiped out. That final will also be held tonight and Italy have a live-wire contender in Pietro Sighel. Britain's Niall Treacy will be hoping to make an impression over his favoured distance.Good to knowWomen's curling gets under way, with Rebecca Morrison leading Great Britain's team, who start their campaign against China at 18:05. In men's curling, Britain face a rematch of the 2022 Olympic final – which they lost – against Niklas Edin's Sweden rink (13:05).Buoyed by the availability of NHL players for the first time since 2014, Canada and the USA play their opening group games in the men's ice hockey. Nine-time gold medallists Canada take on the Czech Republic at 15:40 while the USA – who haven't lifted the title since 1980 – face Latvia at 20:10.The luge team relay (17:30) is always an entertaining watch and has been extended to four legs at these Games, with the addition of women's doubles. Germany have won gold all three previous times it has been held and will be favourites once again.The fast-paced and exciting snowboard cross begins with the men's competition today (09:00). Huw Nightingale goes for Britain.Day seven: Friday, 13 FebruaryMedals: SevenMedal events: Men's cross-country 10km (11:00-12:55); Women's snowboard cross  (09:00-14:10) Men's biathlon 10km sprint (13:00-14:40); Men's speed skating 10,000m (15:30-17:10); Men's snowboard halfpipe (18:30-20:20) Men's skeleton (18:30-21:20); Men's figure skating (18:00-22:15).Daily highlightsSnowboard: Women's snowboard cross (09:00-14:05)Britain's former world champion Charlotte Bankes has enjoyed plenty of success in snowboard cross but the Winter Olympics have so far produced only frustration. Bankes, who was born in Hemel Hempstead but grew up in the French Alps, has competed at three previous Games (twice for France) but is yet to make the final. She has overcome recent injury to get back to the top of the World Cup podium so she should have every chance in Livigno.Figure skating: Men – free skate (18:00-22:10)We are likely to see the Olympic coronation of two-time world champion Ilia Malinin, who remains the only skater to have landed the incredibly difficult quad Axel in competition and is probably one of the hottest favourites of these Games. If the American's free skate is anything like the routine that clinched the Grand Prix Trophy in December, it should be spectacular. That routine featured an astonishing seven quadruple jumps.Skeleton: Men's heats three and four (18:30-21.20)Will Friday the 13th be a lucky one for either Matt Weston or Marcus Wyatt, who are both vying to become Britain's first male Olympic skeleton champion? The final two runs of the competition (18:30 and 20:05) will decide the medals with reigning world champion Weston already having a win on the Cortina track under his belt this season. The women's competition also begins today (15:00), with Tabby Stoecker, Amelia Coltman and Freya Tarbit all competing for Team GB.Snowboard: Men's halfpipe final (18:30-20:05) American legend Shaun White may have retired but there will still be plenty of gasp-inducing acrobatics as riders drop into the pipe to show off their bag of tricks. Reigning world and X Games champion Scotty James won bronze in 2018 and silver in 2022 – is it finally the Australian's time to grab gold?Good to knowWomen's ice hockey enters the knockout phase, with two quarter-finals taking place. The second round of group games in the men's tournament also gets under way, with four fixtures, including Finland against Sweden at 11:10. The Finns are the reigning champions, while Sweden finished fourth in Beijing. Both have named squads packed full of NHL talent.Britain's men's curling team face hosts Italy at 09:05, while in women's curling, GB take on South Korea at 13:05.Day eight: Saturday, 14 February Medals: EightMedal events: Women's dual moguls (09:30-11:05), Women's cross-country relay (11:00-13:00); Men's giant slalom (09:00-14:20); Women's biathlon 7.5k sprint (13:00-14:35); Women's speed skating team pursuit (15:00-17:05); Women's skeleton (17:00-19:50), Men's ski jumping large hill (17:45-20:05); Women's short track 3000m relay (19:15-22:10).Daily highlightsAlpine skiing: Men's giant slalom (run one 09:00; run two 12:30)Switzerland's Marco Odermatt has claimed four successive World Cups in this event and is attempting to do something that not even greats like Marcel Hirscher and Hermann Maier could manage – back-to-back Olympic gold medals in giant slalom. The only man to achieve this feat was an Italian – Alberto Tomba in Calgary 1988 and Albertville 1992 – so could the slopes of Bormio in the extreme north of the country prove a lucky omen for the Swiss superstar?Freestyle skiing: Women's dual moguls (09:30-11:00) Today we'll see the first-ever Olympic champion in dual moguls, in which skiers compete head-to-head on adjacent courses. The USA's Jaelin Kauf, who was the silver medallist in the moguls in Beijing, is the reigning world champion. However, she could face tough competition from teammate Tess Johnson.Skeleton: Women's heat three and four (17:00-19:50)It's the conclusion of the women's skeleton. This is an event that has traditionally been a very fruitful one for Great Britain, which has won medals on all but one of the six occasions the event has been held. Can Tabby Stoecker, Amelia Coltman or Freya Tarbit emulate the likes of Lizzy Yarnold, Amy Williams and Shelley Rudman?Image source, Getty ImagesImage caption, Muir has recovered from knee and shoulder surgery which kept her out of action for a yearFreestyle skiing: Women's big air qualification (18:30-20:45)Britain's Kirsty Muir begins her campaign to better the fifth-place finish she achieved on her Olympic debut four years ago when aged just 17. Also likely to be in the field are China's California-born defending champion Eileen Gu, Beijing 2022 silver medallist Tess Ledeux of France and the sport's latest sensation, 18-year-old Flora Tabanelli. The Italian teenager, who won the Youth Olympic title in 2024, is the reigning world champion and has made a swift recovery from an ACL injury.Good to knowThe two remaining women's ice hockey quarter-finals take place, while in the men's preliminary round there's a rematch of the 2022 bronze medal game, won by Slovakia against Sweden (11.10am GMT).Round robin matches of the men's and women's curling continue, with Great Britain's women up against current world champions Canada at 09:05. Bruce Mouat's rink face the Czechs at 13:05.Britain's Niall Treacy will be among the competitors in the men's short track speed skating 1500m, with the quarter-finals getting under way at 7.15pm.Day nine: Sunday, 15 FebruaryMedals: NineMedal events: Men's biathlon 12.5km pursuit (10:15-11:00); Men's dual moguls (09:30-11:05); Men's cross-country relay (11:00-13:00); Mixed team snowboard (10:00-14:05); Women's giant slalom (09:00-14:20); Women's biathlon 10km pursuit (13:45-15:00); Men's speed skating team pursuit (15:00-17:05); Mixed team skeleton (17:00-19:00); Women's ski jumping - large hill (17:45-20:05).Daily highlightsAlpine skiing: Women's giant slalom (run one 09:00; run two 12:30)     After a 10th-place finish in Pyeongchang, Sweden's Sara Hector shocked many by taking giant slalom gold in Beijing. She became the first Swedish woman to win the Olympic title in this event since Pernilla Wiberg at Albertville 1992 and was helped by Mikaela Shiffrin's inability to complete a run.Freestyle skiing: Men's dual moguls (09:30-11:00)Can moguls king Mikael Kingsbury become the first-ever men's Olympic dual moguls champion? The Canadian is a five-time world champion in the discipline, and has won the last four, a run stretching back to 2019. His biggest rival is likely to be the only other man to have won the dual moguls world title in the past decade: Japan's Ikuma Horishima.Snowboard: Snowboard cross mixed team (12:45-14:00)This event made its debut in 2022, with American Lindsey Jacobellis capping a memorable Games by clinching her second gold alongside fellow veteran Nick Baumgartner. Charlotte Bankes and Huw Nightingale finished sixth but went on to win the world title in 2023 and will be competing again today.Skeleton: Mixed team (17:00-19:00)The mixed team is a new event at these Winter Olympics. This is good news for Great Britain, presented with another medal chance in a sport that they have traditionally excelled in. The make-up of their two pairs is yet to be confirmed but Tabby Stoecker and Matt Weston have won silver at the past two World Championships and Britain will be hoping at least two of their squad are standing on the podium today.Ski jumping: Women's large hill (17:45)A landmark evening for ski jumping, with women competing for the first time in the large hill event. Slovenia's Nika Prevc, 20, may prove the woman to beat, having won gold on both the normal and large hill at last year's World Championships.Good to knowThe first day of competition in bobsleigh features the opening two women's monobob heats (09:00), in which British shot put champion Adele Nicoll will make her Olympic debut.The preliminary round of the men's ice hockey concludes with four games, including the USA against Germany (20:10). Only the three group winners plus the runner-up with the best record advance directly to the quarter-finals, with the other eight teams instead going into a play-off round.It's a busy day for Britain in men's curling – they play Germany at 09:05 and then return to the Cortina Curling Stadium to meet Switzerland at 18:05. At 13:05, the British women's team have a tricky fixture against Anna Hasselborg's Sweden. The long-established Swedish rink were 2018 Olympic champions before losing out to Team GB's Eve Muirhead and co in the 2022 semi-finals.Female figure skaters often hit their peak while teenagers but (sporting) life really did begin at 40 for Canadian pairs skater Deanna Stellato-Dudek, who along with Maxime Deschamps won her first world title at that age in 2024. Now 42, she and 34-year-old Deschamps will be among the medal contenders in the figure skating pairs, which starts today with the short programme (18:45). Anastasia Vaipan-Law and Luke Digby are Britain's first competitors in the Olympics pairs since 2014.Day 10: Monday, 16 FebruaryMedals: SixMedal events: Women's short track 1000m (10:00-12:30); Men's slalom (09:00-14:20); Men's ski jumping super team (18:00-20:05); Women's freeski big air (18:30-20:05); Women's bobsleigh monobob (18:00-21:15); Pairs figure skating (19:00-22:10).Daily highlightsAlpine skiing: Men's slalom (run one 09:00; run two 12:30)Dave 'the Rocket' Ryding will compete in this event at his fifth and final Games. The 38-year-old slalom specialist became the first British alpine skier to win World Cup gold in 2022 and earlier this year he sealed the nation's best World Championship result by a male since 1934 by finishing sixth. However, he is not expected to reach the podium. Clement Noel of France is the defending Olympic champion, Switzerland's Loic Meillard the 2025 world champion and Henrik Kristoffersen is the most successful slalom skier ever produced by Norway, although Olympic gold has so far eluded him.Image source, Getty ImagesImage caption, Brookes first tried snowboarding aged only 18 monthsSnowboard: Women's slopestyle qualifying (09:30-11:35)Britain's Mia Brookes was too young to qualify for the last Winter Olympics but won the world title the following year, aged 16. Now just turned 19, she finally has her chance to grab Olympic glory and the rider from Sandbach, Cheshire, will be aiming to book her spot in tomorrow's final. Maisie Hill, who is back to her best after suffering a horrific training crash three years ago, will also represent Britain. Later today (13:00), the men's qualification takes place, with Txema Mazet-Brown Britain's only competitor.Bobsleigh: Women's monobob heats three and four (18:00)The first bobsleigh medal is up for grabs at the Cortina Sliding Centre. Kaillie Humphries won the inaugural monobob title at the 2022 Games, claiming her third Olympic gold – and first since switching allegiance from Canada to the USA. A fourth gold medal here would equal the record in Olympic bobsleigh.Freestyle skiing: Women's big air final (18:30-19:50)Kirsty Muir was the youngest member of Team GB in 2022, coming a brilliant fifth in the final, and the 21-year-old Scot will be hoping to be in the mix again. But it looks like being a high-class field that will include defending champion Eileen Gu and Beijing 2022 silver medallist Tess Ledeux of France. And all Italian eyes will be on Flora Tabanelli, who won the 2025 world title aged just 17 – the skier from Bologna is the reigning Youth Olympic champion in big air, and now has her eyes on the senior title.Good to knowWomen's ice hockey reaches the semi-final stage (15:40 and 20:10). Barring any surprises, Canada and the USA will be kept apart and will be red-hot favourites to advance to the final. Six of the seven previous women's gold medal games have been contested by those two countries.It's a busy Monday for Team GB in women's curling – Rebecca Morrison's rink play Denmark at 09:05 and Switzerland at 18:05. In men's curling, Britain's quest for gold continues with Team Mouat meeting Norway at 13:05.The figure skating pairs event reaches its conclusion (19:00), with reigning world champions Riku Miura and Ryuichi Kihara aiming to win Japan's first Olympic title in the discipline. The pair finished seventh at the last Games but have since finished either first or second at the last four World Championships. Anastasia Vaipan-Law and Luke Digby are competing for Great Britain.Day 11: Tuesday, 17 February Medals: SevenMedal events: Men's Nordic combined (09:00-13:35); Women's snowboard slopestyle (12:00-13:50); Men's biathlon 4 x 7.5km relay (13:30-15:10); Men's and women's speed skating team pursuit (13:30-16:25); Men's two-man bobsleigh (18:00-21:10); Men's freeski big air (18:30-22:05).Daily highlightsSnowboard: Women's slopestyle final (12:00-13:35)British teenager Mia Brookes has already won the world title and is now aiming to become an Olympic champion on snow, something no Briton had achieved prior to these Games. The 19-year-old will be putting her tricks up against some talented rivals, set to include the Japanese contingent and reigning Olympic and world champion Zoi Sadowski-Synnott of New Zealand. The riders have three runs to impress the judges, with their best score counting.Bobsleigh: Two-man heats three and four (18:00)Can anyone stop the Germans and in particular pilot Francesco Friedrich, who is vying for a record fifth bobsleigh gold? The 35-year-old led a German 1-2-3 in this event in 2022 but this season Friedrich's long-time rival Johannes Lochner has had a decisive edge on the World Cup circuit. The British sled, featuring Brad Hall and Taylor Lawrence, will be among those seeking to end Germany's stranglehold.Freestyle skiing: Men's big air final (18:30-19:50)New Zealand's Luca Harrington will be aiming to add the Olympic title to the world title and World Cup title he won last season. But defending champion Birk Ruud of Norway is unlikely to give up his crown without a fight, while the home crowd will be behind Miro Tabanelli, a 21-year-old Italian who claimed X Games gold in 2025.Good to knowWomen's figure skating begins with the short programme (17:45). It should be an intriguing competition with the likes of three-time former world champion Kaori Sakamoto up against the returning Alysa Liu, who dethroned the Japanese skater at last year's World Championships, and her American team-mate, the rejuvenated Amber Glenn. Britain's Kristen Spours, who has overcome a serious back injury to make it to Milan, will also be competing.Curling round robin matches continue. Britain's women have a rest day, with the men up against Canada (18:05), the only country to have won the men's Olympic title more than once. However, the last time they earned gold was 2014. Day 12: Wednesday, 18 FebruaryMedals: EightMedal events: Men's and women's cross-country team sprint (08:45-12:15); Women's aerials (10:30-12:05); Men's snowboard slopestyle (12:00-13:50); Women's slalom (09:00-14:20); Women's biathlon 4 x 6km relay (13:45-15:20); Men's 500m and women's 3000m short track (19:15-21:00).Daily highlightsAlpine skiing: Women's slalom (run one 09:00; run two 12:30)\"I don't want Beijing to be the reason that I'm scared of the Olympics,\" said former double Olympic champion Mikaela Shiffrin. \"For the past few years, it has been a little bit.\" The 30-year-old endured a nightmare 2022, failing to finish the slalom, giant slalom and the slalom portion of the combined. Image source, Getty ImagesImage caption, Shiffrin became the youngest slalom gold medallist in Olympic history with her victory in Sochi in 2014\"It's not so much about unfinished business,\" continued the American. \"It's more about making peace.\" Her main rivals are likely to be Croatian 21-year-old and slalom World Cup winner Zrinka Ljutic and Camille Rast, who last year became the first Swiss racer since 1991 to win the slalom world title.Snowboard: Men's slopestyle (11:30-13:10) The last of the snowboard events at these Games should be a fascinating contest. Canadian veteran Mark McMorris, who has won slopestyle bronze at the last three Olympics, returns for a crack at an elusive gold, along with 2018 Olympic champion Red Gerard. Japan have a crop of exciting young stars.Good to knowIt's the quarter-finals in men's ice hockey, with the four winners from the previous day's play-off games taking on the four teams with the best record in the group stage.In curling, Great Britain's women return after a rest day to face the USA at 09:05 and Japan at 18:05. Britain's men meet the USA at 13:05 in the last of their round-robin matches.There'll be plenty of breathtaking acrobatics on display as the women's aerials final takes place (10:30). Can 35-year-old five-time Olympian Xu Mengtao of China retain her title?Day 13: Thursday, 19 February Medals: SevenMedal events: Men's aerials (10:30-12:05); Men's and women's ski mountaineering sprints (08:50-13:45); Men's Nordic combined team sprint (09:00-14:00); Men's 1500m speed skating (15:30-17:10); Women's ice hockey (18:10-21:10); Women's figure skating (1800-2215).Daily highlightsSki mountaineering: Women's and men's sprint finals (12:55 and 13:15)Bormio is synonymous with downhill skiing but some athletes will also be attempting to go uphill in the only new sport at these Winter Olympics – ski mountaineering, or skimo for short. Skiers race up and down a steep course on skis, 'skins' (strips of fabric attached to the bottom of skis) and on foot, putting on or taking off their equipment in transition areas between sections. Two of the three golds on offer will be decided today in the sprint races, which consist of several knockout contests. France's Emily Harrop, whose parents are British but who was born and bred in the French Alps, is the women's favourite (heats start at 08:50), with the men's heats at 09:30.Figure skating: Women's free skate (18:00-22:10)The women's figure skating is always one of the highlights of any Winter Olympics, but in 2022 it was one of the most upsetting events. It concluded with 15-year-old Kamila Valieva leaving the ice distressed after an error-strewn performance that followed her positive drugs test. The contest for gold in Milan-Cortina promises to be an intriguing battle – reigning world champion Alysa Liu and revitalised team-mate Amber Glenn are aiming to become the first USA winner of this title for 24 years, while Japan's three-time former world champion Kaori Sakamoto is hoping for a first Olympic gold in her farewell season. But could the latest young Russian talent Adeliia Petrosian – who will be competing as a neutral athlete – emerge as a contender?Ice hockey: Women's gold medal game (18:10) Thursday's final will almost certainly be the latest chapter in the increasingly bitter rivalry between the two dominant teams in women's hockey, Canada and the USA. The pair have contested six of the seven gold medal matches at the Olympic and met in 23 of 24 finals at World Championship level. The Canadians usually have the edge when it matters most and claimed their fifth Olympic crown in 2022.Freestyle skiing: Women's halfpipe run one and two (18:30-20:25)Zoe Atkin, one of Britain's biggest medal hopes at these Games, begins her quest to emulate big sister Izzy and win an Olympic medal. The 23-year-old Stanford University student is the reigning world champion and also the joint-winner of the overall World Cup title last season. However, she will face a strong field, including China's defending champion Eileen Gu and Li Fanghui, who was the other major force in the 2024-25 campaign.Good to knowIt's the final day of the curling round robin stage, with the semi-final line-ups to be determined and – in the case of the men's competition – played on the same day. Britain's women, led by Rebecca Morrison, face hosts Italy in their final round at 13:05 while Bruce Mouat and his GB men's team will be hoping to be involved in the men's semi-finals (18:05).Image source, Getty ImagesImage caption, Stolz made his Olympic debut in Beijing aged 17Prepare for some gravity-defying tricks and jumps in the men's aerials final (10:30). Switzerland's Noe Roth has won the past two world titles but has not managed to land on the podium at either of the past two Olympics. A medal in Milano-Cortina would emulate his mother Colette Brand, who won aerials bronze in Nagano in 1998. Qi Guangpu is the defending champion.The men's speed skating 1500m (15:30) is regarded as one of speed skating's blue riband contests and is known by afficionados as the 'king's race'. US star Jordan Stolz, 21, came into these Games targeting gold in the 500m, 1000m and 1500m, with this competition potentially giving him the chance of a famous hat-trick. He has won all five of this season's World Cup races over 1500m.Day 14: Friday, 20 FebruaryMedals: SixMedal events: Women's ski cross (09:00-12:40); Men's biathlon 15km (13:15-14:20); Women's speed skating 1500m (15:30-17:10); Men's ski halfpipe (18:30-20:20); Women's short track 1500m and men's short track 5000m relay (19:15-21:40).Daily highlightsFreestyle skiing: Women's ski cross (09:00-12:35) The exciting sport of ski cross involves plenty of drama and the last Olympics was no exception, as Switzerland's Fanny Smith well knows. She was demoted from bronze in the aftermath of her race, only for the decision to eventually be overturned – she received her medal more than a year later. Now the reigning world champion, Smith again faces Sweden's Sandra Naeslund and Canada's Marielle Thompson, the gold and silver medallists from Beijing.Ice hockey: Men's semi-finals (15:40 & 20:10)The Milano Santagiulia Ice Hockey Arena is host to a semi-final double header, with the two winners advancing to Sunday's final and the losers playing off for bronze. Canada are nine-time Olympic champions, while the USA last took the title in 1980.Freestyle skiing: Men's halfpipe final (18:30-20:05)Expect a thrilling contest for gold. With New Zealand's 2022 gold medallist Nico Porteous announcing last summer that he was stepping away from the sport, there is a gap to be filled – and the title could stay in Kiwi hands as 19-year-old Finley Melville Ives is the current world champion. Alex Ferreira won silver in 2018 and bronze in 2022, and fellow American Nick Goepper has his sights set on winning a medal at a fourth consecutive Games, having made the slopestyle podium in 2014, 2018 and 2022.Good to knowIt's semi-finals day in the women's curling (13:05) and, as the defending champions, Team GB will be hoping to be involved. However, Jen Dodds is the only returning member of the successful GB quintet in 2022, and Rebecca Morrison's 2026 rink will probably be hopeful rather than expectant of reaching this stage. It's also the bronze-medal match in the men's curling (18:05).Day 15: Saturday, 21 FebruaryMedals: 10Medal events: Men's team aerials (09:45-11:35); Men's ski cross (09:00-12:40); Men's cross-country 50km mass start (10:00-13:05); Mixed ski mountaineering relay (12:30-13:50); Women's biathlon 12.5km mass start (13:15-14:15); Men's and women's speed skating mass start (14:00-17:00); Women's ski halfpipe (18:30-20:20); Women's two-woman bobsleigh (18:00-21:10); Men's curling (1805-2135).Daily highlightsFreestyle skiing: Men's ski cross final (09:00-12:35)Beijing champion Ryan Regez suffered a torn ACL followed by a loss of form but his world title win last year shows he is now back to his best. His biggest threat could be Canada's Reece Howden, who has won the World Cup title in both of the past two years.Bobsleigh: Two-woman heats three and four (18:00 & 20:03)Germany's Laura Nolte won this event in 2022 aged 23, becoming the youngest female pilot to take gold. Since then, she and brakewoman Deborah Levi have been a model of consistency on the World Cup circuit. The USA's Kaillie Humphries won this event in 2010 and 2014 and could run Nolte close.Image source, Getty ImagesImage caption, Atkin was ninth in the event at Beijing 2022Curling: Men's gold-medal game (18:05-21:20)Britain's Team Mouat will be hoping to be involved as the men's curling reaches its conclusion. The quartet who competed in the 2022 final are all back in Milan-Cortina and determined to upgrade the silver they took home last time to gold, which would be Britain's first in Olympic men's curling since 1924. The bronze medal game in the women's curling starts at 13:05 GMT.Freestyle skiing: Women's halfpipe final (18:30-20:05)Can Britain's Zoe Atkin dethrone China's Eileen Gu as the Olympic champion? The US-born 21-year-old is the reigning world champion but will be up against a stacked field, likely to also include Li Fanghui, her biggest rival last season and the skier with whom she shared the overall 2024-25 World Cup title.Good to knowAs well as the conclusion of the two-woman event, the opening two heats of the four-man bobsleigh take place (09:00 and 10:57). Germany – particularly pilot Francesco Friedrich – have monopolised major titles in recent years but the British crew driven by Brad Hall also have podium aspirations.The most gruelling event in the Winter Olympics is cross country skiing's 50km mass start (10:00). The men's medals will be decided on Saturday and current world champion Johannes Hosflot Klaebo is the red hot favourite. Team GB's Andrew Musgrave is competing in his fifth Winter Olympics.Day 16: Sunday, 22 FebruaryMedals: FourMedal events: Men's four-man bobsleigh (09:00-12:20); Women's cross-country 50km mass start (09:00-12:35); Women's curling (12:05-13:35); Men's ice hockey (12:40-15:40)Daily highlightsBobsleigh: Four-man heats three and four (09:00 & 11:12)History beckons for German great Francesco Friedrich on the final day of the Games. The 35-year-old arrived in Italy with four Olympic titles so, depending on how he fared in the earlier two-man event, he will be vying to become the first athlete to win five or even six bobsleigh golds. His biggest rival may be Germany's second crew, headed by Johannes Lochner, but Team GB could also be in podium contention, with the sled piloted by Brad Hall having recorded encouraging results occasionally at the top level.Image source, Getty ImagesImage caption, Finland celebrate after beating the Russian Olympic Committee team 2-1 in the final in BeijingCurling: Women's gold medal game (10:05-13:20)This event proved the highlight – and saving grace – of Britain's Winter Olympics four years ago, when Eve Muirhead and her team clinched GB's only gold of the Games on the final day in Beijing. With only one member of that gold-winning quintet competing in Milan-Cortina, a repeat might be unlikely.Ice hockey: Men's gold medal game (13:10)Each of the last three men's ice hockey finals has produced a different winner – so could a new name be added to the roll of honour at the Milano Santagiulia Ice Hockey Arena? Canada have claimed a record nine Olympic golds and the return of NHL players is a boost to their chances. That also applies to the USA, who haven't won the title since 1980's 'Miracle on Ice', while Finland are the reigning champions.Good to knowWith all events completed, at 19:00 it's time for the Closing Ceremony of the XXV Winter Olympic Games, which will take place in the iconic Arena, a Roman amphitheatre in the historic city of Verona. Milan Cortina will say arrivederci and perform the traditional handover to the team from the French Alps, where the 2030 Games will be held.Related topicsShort Track SkatingCurlingLugeSpeed SkatingWinter SportsNordic CombinedIce HockeyAlpine SkiingCross-Country SkiingBobsleighBiathlonSkeletonSnowboardingWinter OlympicsSki JumpingFreestyle SkiingFigure Skating",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winter Olympics 2026 schedule and day-by-day guide",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f362/live/71510460-0220-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-10T21:08:09.000Z",
      "dateModified": "2026-02-10T21:08:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Radical with Amol Rajan - Children in Care: How to Fix the Fostering Crisis (Louise Allen) - BBC Sounds",
    "url": "https://www.bbc.co.uk/sounds/play/m002q39v?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg",
    "tag": "Trending",
    "date": "2026-01-22T06:00:00.000Z",
    "description": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     ",
    "body": "          Home            News            Sport            Weather            iPlayer            Sounds            Bitesize     CBeebies     CBBC     Food         Home     News     Sport     Business     Innovation     Culture     Travel     Earth     Video     Live          Use BBC.com or the new BBC App to listen to BBC podcasts, Radio 4 and the World Service outside the UK.Find out how to listen to other BBC stationsEpisode detailsRadio 4,·22 Jan 2026,·56 mins,·Available for over a yearAs the government prepares to introduce a strategy to boost fostering in England, Amol speaks to foster carer and author Louise Allen about the crisis in the system and what it will take to fix it.  \nAt the end of March 2024 there were 83,630 children in care in England, of whom 56,390 were being fostered, but there is a shortfall of around 6,000 foster carers nationwide. \nIn this episode Louise explains why we need to be more honest about the realities of caring for often vulnerable kids and focus on retaining foster carers rather than recruiting new ones.  \nShe also explains why there needs to be more practical support like providing a cleaner for every fostering household so that they can focus on emotionally supporting the children in their care. \n(00:03:10) Why is there a fostering crisis?\n(00:06:20) Why do we have so many children in care?\n(00:08:49) Louise's story: growing up in care\n(00:16:13) The effect of smartphones\n(00:20:08) Why is there a shortage of foster carers?\n(00:23:37) Why do people foster?\n(00:27:28) The recruitment process\n(00:30:33) Foster care v residential care\n(00:33:10) What is the fostering allowance?\n(00:39:09) Louise's RADICAL ideas\n(00:45:06) The government's fostering reforms\n(00:47:30) The importance of giving children social capital\n(00:52:19) Amol's reflections\nGET IN TOUCH \n* WhatsApp: 0330 123 9480 \n* Email: radical@bbc.co.uk \nEpisodes of Radical with Amol Rajan are released every Thursday and you can also watch them on BBC iPlayer: https://www.bbc.co.uk/iplayer/episodes/m002f1d0/radical-with-amol-rajan \nAmol Rajan is a presenter of the Today programme on BBC Radio 4. He is also the host of University Challenge on BBC One. Before that, Amol was media editor at the BBC and editor at The Independent. \nRadical with Amol Rajan is a Today Podcast. It was made by Lewis Vickers with Anna Budd. Digital production was by Gabriel Purcell-Davis. Technical production was by Dave O'Neill. The editor is Sam Bonham. The executive producer is Owenna Griffiths.Programme WebsiteMore episodes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Radical with Amol Rajan - Children in Care: How to Fix the Fostering Crisis (Louise Allen) - BBC Sounds",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024x576/p0lgrqgm.jpg"
      ],
      "datePublished": "2026-01-22T06:00:00.000Z",
      "dateModified": "2026-01-22T06:00:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "More than 180 survivors 'engaged' in Harrods abuse compensation scheme",
    "url": "https://www.bbc.com/news/articles/crrx5v42ng2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cd51/live/344868a0-06f9-11f1-8c27-3385375e2319.jpg",
    "tag": "Trending",
    "date": "2026-02-11T12:12:45.000Z",
    "description": "39 minutes agoEllie PriceNews correspondentBBCMore than 180 survivors of abuse by the former Harrods owner Mohammed Al Fayed are currently \"engaged\" i",
    "body": "39 minutes agoEllie PriceNews correspondentBBCMore than 180 survivors of abuse by the former Harrods owner Mohammed Al Fayed are currently \"engaged\" in its compensation scheme, the company has said.The luxury retailer said it has already paid out compensation to more than 50 women.The scheme, which was opened last March, will close to new submissions on 31 March.In October, Harrods said it had set aside more than £60m in its plan to compensate  victims of alleged historical abuse.The compensation scheme will award each eligible claimant damages of £200,000, though victims who agree to be assessed by a consultant psychiatrist could receive up to £385,000 in compensation plus treatment costs. Survivors who are not assessed by a psychiatrist will receive lower payments.Applications submitted by 31 March will continue to be processed after that deadline.The department store also said it will continue offering counselling support after the deadline, including from its so-called Independent Survivor Advocate.Human rights campaigner Dame Jasvinder Sanghera was appointed by Harrods for the Advocate role in 2024, promising to meet as many survivors as possible and guide them through the retailer's compensation process.Justice for Harrods Survivors, which represents some victims, said only a \"truly independent\" process could address the needs of survivors.Multiple women have accused Al Fayed, who owned the luxury store between 1985 to 2010, of rape and sexual assault. The Met Police said that 146 people have come forward to report a crime in their investigation into Al Fayed.As well as its flagship store in Knightsbridge, London, the Harrods Group operates smaller stores at London's Heathrow and Gatwick airports, as well as a small chain of beauty stores. KP Law, who represents more than 260 survivors, has been critical of the Redress Scheme citing concerns Harrods retain \"complete control\" of the scheme.Tom Fletcher, a specialist lawyer at Irwin Mitchell, which is supporting some victims,  said it is pleased to have secured settlements for some of the firm's clients. He said: \"Whilst no amount of money will ever be enough, the amounts of compensation recovered under the scheme recognises the significance of the abuse our clients went through while also allowing them funds to access the specialist support they require to try and move forward with their lives the best they can.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "More than 180 survivors 'engaged' in Harrods abuse compensation scheme",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cd51/live/344868a0-06f9-11f1-8c27-3385375e2319.jpg"
      ],
      "datePublished": "2026-02-11T12:12:45.000Z",
      "dateModified": "2026-02-11T12:12:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Britney Spears sells rights to entire music catalogue ",
    "url": "https://www.bbc.com/news/articles/c0ljwyy7rrko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c6bd/live/2072d720-06f4-11f1-9972-d3f265c101c6.jpg",
    "tag": "Trending",
    "date": "2026-02-11T03:26:37.000Z",
    "description": "9 hours agoNardine Saad,Los AngelesandClaire KeenanReutersBritney Spears has sold the rights to her music catalogue.Pop superstar Britney Spears has s",
    "body": "9 hours agoNardine Saad,Los AngelesandClaire KeenanReutersBritney Spears has sold the rights to her music catalogue.Pop superstar Britney Spears has sold the rights to her entire music catalogue, the BBC has learned. Spears, 44, is said to have sold to independent music publisher Primary Wave on 30 December for around $200m (£146m).The singer - whose protracted conservatorship long dictated her personal and professional life - is known for the hits ...Baby One More Time, Oops!... I Did It Again, Toxic and Gimme More.Primary Wave did not immediately respond to the BBC's requests for comment. Representatives for Spears declined to comment.In January 2024, the singer said she would \"never return to the music industry\". Her last song was a duet released with Elton John in 2022. Primary Wave has also acquired rights to the estates of Notorious BIG, Prince and Whitney Houston. Details of the sale and the exact price of Spears' catalogue have not been made public. High-profile artists such as Bruce Springsteen, Justin Bieber, Justin Timberlake, and Shakira recently sold their catalogues too. Springsteen sold his back catalogue to Sony in 2021 for $500m, and Bieber reportedly signed a $200m deal with Hipgnosis Songs Capital in 2023.The publisher was founded 20 years ago by music executive Lawrence Mestel after purchasing 50% of Kurt Cobain's portion of the Nirvana catalogue. Spears is one of the best-selling female artists, with more than 150 million records sold worldwide. Her catalogue includes nine studio albums since her debut in 1999. The sale comes after a tumultuous few years for the singer, who in 2021 ended a 13-year-long conservatorship – a legal guardianship that saw her finances and personal life controlled by her father. The singer published her memoir in 2023 titled The Woman in Me, which detailed her struggles living under the conservatorship. Her ex-husband Kevin Federline released his own memoir, You Thought You Knew, at the end of 2025. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Britney Spears sells rights to entire music catalogue ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c6bd/live/2072d720-06f4-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-11T03:26:37.000Z",
      "dateModified": "2026-02-11T03:26:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chris Mason: Smiles of a survivor as Starmer attempts his latest reset",
    "url": "https://www.bbc.com/news/articles/czj198mk0l8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1155/live/c67eea70-0715-11f1-b5e2-dd58fc65f0f6.jpg",
    "tag": "Trending",
    "date": "2026-02-11T04:19:58.000Z",
    "description": "9 hours agoChris MasonPolitical editorGetty ImagesThe prime minister wore the smiles of a survivor and his team wore expressions of relief.The Panshan",
    "body": "9 hours agoChris MasonPolitical editorGetty ImagesThe prime minister wore the smiles of a survivor and his team wore expressions of relief.The Panshanger Community Centre in Welwyn Garden City, Hertfordshire, was bedecked with Union flag bunting and plastic chairs.I was there as it was my turn to conduct what is known as a pool interview on behalf of all of the broadcasters.At the start of the year, Sir Keir Starmer had hoped trips like this would be a regular focus.On the first day back in January he invited us reporters to a similar community centre in Reading. But loads of the questions were about Venezuela and Greenland.A later planned trip was postponed and a news conference held in Downing Street instead, such were the dominance and volume of international news.Sir Keir has long been keen to talk about the cost of living, but the opportunity cost of chaos, both international and then domestic, has made that a whole lot harder. The space to be heard gets squeezed.A cabinet minister expressed this frustration to me the other day: they felt there was evidence slowly emerging of things picking up economically, but not the capacity to talk about it.Maybe, just maybe, they may get a chance now.The magnitude of Monday, the genuine peril the prime minister faced, meant that many including some officials in Downing Street thought for at least a while that Sir Keir might have to announce his resignation before the day was out - as our chief political correspondent, Henry Zeffman, reports here.But the scale and imminence of the threat prompted the depth and breadth of hastily expressed and (potentially time-limited) support we then saw from the cabinet and later from MPs.It has cleared some political air for Sir Keir for now.But the fundamentals, the catalysts that drove events towards this week's crescendo, remain unaltered.An unpopular government led by an unpopular prime minister will continue to prompt those on his own side to ponder alternative leaders, unless it and he respectively become less unpopular pretty quickly.But it is also true that for many, many Labour MPs, whatever their view of their leader, the prospect of a turbulent leadership contest, while in government, feels irresponsible and potentially very damaging to them.And yet tricky imminent elections point to headaches on the horizon.In the meantime Downing Street has to deal with the consequences of how the last few weeks have played out.The prime minister is having to make the best of things with Anas Sarwar, Labour's leader in Scotland, who publicly called for him to resign. Sir Keir still wants Sarwar to become Scotland's first minister. But the Labour campaign looks awkward, to put it gently, given the two men are at odds on the fundamental of whether Sir Keir is up to being prime minister.Then there is the Health Secretary Wes Streeting, who appears to be able to get away with rather a lot while remaining in the cabinet. Streeting's decision, off his own bat, to publish his text exchanges with Lord Mandelson prompted the prime minister to issue a coded rebuke of his health secretary. By publicly underlining the importance of a \"managed process\" for the release of material relating to the former ambassador, he was signalling Streeting's unilateral release of exchanges clearly wasn't.It is a reminder of just how much material is due to be published relating to Lord Mandelson in the coming months, with huge potential for embarrassment personally and diplomatically.For now, though, the prime minister appears fired up.The adrenalin, frustration and anger provoked by recent days was visible publicly, which is rare for Sir Keir.How much changes now, and how much you notice, are two of the key questions as the prime minister attempts to reset, yet again.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chris Mason: Smiles of a survivor as Starmer attempts his latest reset",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1155/live/c67eea70-0715-11f1-b5e2-dd58fc65f0f6.jpg"
      ],
      "datePublished": "2026-02-11T04:19:58.000Z",
      "dateModified": "2026-02-11T04:19:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nancy Guthrie: Police search Arizona home of person detained in connection with case",
    "url": "https://www.bbc.com/news/articles/cr5l4yy3ezmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/51c5/live/7b03dca0-071e-11f1-811d-d70cdc846ab3.jpg",
    "tag": "Trending",
    "date": "2026-02-11T08:53:27.000Z",
    "description": "Police release man detained in connection to Nancy Guthrie disappearance4 hours agoKoh EweGetty ImagesSavannah Guthrie and her siblings have released ",
    "body": "Police release man detained in connection to Nancy Guthrie disappearance4 hours agoKoh EweGetty ImagesSavannah Guthrie and her siblings have released videos on social media pleading for their mother's releasePolice have released a man hours after they detained him in connection to the disappearance of Nancy Guthrie, the mother of US news anchor Savannah Guthrie, CBS News, the BBC's US partner, has reported.After taking the man into custody at a traffic stop, police searched his home in Rio Rico, south of Tucson, Arizona, sources familiar with the investigation told CBS News.After his release, the man, identified only as Carlos, told reporters outside his home that he did not know who Nancy Guthrie was. \"I don't follow the news,\" he said.Guthrie, 84, was abducted from her home near Tucson more than a week ago, sparking a widespread search and desperate appeals from her family. \"I hope they get the suspect, because I'm not it,\" Carlos said, according to a video posted on X by CBS reporter Andres Gutierrez.Carlos, reportedly a deliveryman, said he had been driving around and noticed authorities were following him.He added that the officers did not ask him any questions and made him wait for hours in a car park.A woman who identified herself as his mother-in-law earlier said that he had nothing to do with the case.\"They're just invading my property,\" she was quoted as saying by CBS.The Pima County Sherrif's Department had confirmed police were conducting a court-authorised search at a location in Rio Rico, south of Tucson, Arizona.The news of the detention came hours after the FBI released images and videos of a masked person at Nancy Guthrie's doorstep on the night of her disappearance. Authorities said the individual was armed.\"As of this morning, law enforcement has uncovered these previously inaccessible new images showing an armed individual appearing to have tampered with the camera at Nancy Guthrie's front door the morning of her disappearance,\" FBI Director Kash Patel said in a statement on X.He said authorities had been working to recover images from the home surveillance system that \"may have been lost, corrupted, or inaccessible due to a variety of factors - including the removal of recording devices\".The two short videos show the person approach the front door of Nancy Guthrie's home, then check the camera before moving away, picking up some vegetation from the ground and using it to cover the camera lens.Savannah Guthrie shared the new video on Instagram. \"Someone out there recognises this person,\" she said on Tuesday. \"We believe she is still out there. Bring her home.\"ReutersPolice search the home of a person who was detained in connection to Nancy Guthrie's disappearanceA senior official told CBS that the White House was monitoring the situation in Tucson closely. Speaking to reporters on Tuesday, White House press secretary Karoline Leavitt said that US President Donald Trump had reviewed the surveillance footage. Trump's initial reaction to the footage was \"pure disgust\", Leavitt said in response to a question at the press briefing.\"The President directed me to please encourage all Americans with any information to call the FBI,\" she added.US President Donald Trump, who ordered federal authorities to help in the investigation, previously called the case \"very unusual\".Guthrie was last seen at her home in Catalina Foothills, an affluent neighbourhood roughly 6 miles (10km) north-east of Tucson, on the evening of 31 January, when family members dropped her off after dinner.FBIThe FBI has released images and videos of a masked person at Nancy Guthrie's doorstepAuthorities are investigating a series of ransom notes that could have been from her abductors, including one that contained two deadlines: 5 February and 9 February.Savannah Guthrie and her siblings have released several videos on social media pleading for their mother's release.The latest video was posted on Monday - the reported ransom deadline. In it, Savannah Guthrie pleads for the public to help locate her missing mother. \"I just want to share a few thoughts as we enter another week of this nightmare,\" she said in a the video posted on Instagram. \"She was taken, and we don't know where. And we need your help.\"The family has warned about their mother's ill health, saying that her health and heart were \"fragile\" and she \"lives in constant pain\".\"She is without any medicine. She needs it to survive. She needs it not to suffer,\" the news anchor said in a video posted on Instagram.Officials have also warned that Nancy Guthrie may be in dire health without her medication.Authorities said on the night of her disappearance, the app on her pacemaker - an implanted cardiac device - disconnected from her phone.Police also said they found blood on Guthrie's porch and analysis confirmed it was hers.The FBI is offering a $50,000 (£36,000) reward for information on the case.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nancy Guthrie: Police search Arizona home of person detained in connection with case",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/51c5/live/7b03dca0-071e-11f1-811d-d70cdc846ab3.jpg"
      ],
      "datePublished": "2026-02-11T08:53:27.000Z",
      "dateModified": "2026-02-11T08:53:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Children bombarded with weight loss drug ads online, says report",
    "url": "https://www.bbc.com/news/articles/c89kl834nv9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4eff/live/c60eff20-06a8-11f1-8222-ad34ef3f6330.jpg",
    "tag": "Trending",
    "date": "2026-02-11T09:49:13.000Z",
    "description": "3 hours agoLaura CressTechnology reporterFiordaliso via Getty ImagesChildren are routinely exposed to adverts for weight loss injections and pills onl",
    "body": "3 hours agoLaura CressTechnology reporterFiordaliso via Getty ImagesChildren are routinely exposed to adverts for weight loss injections and pills online, according to a report by the children's commissioner for England.It found young people were \"bombarded\" with ads for products which claimed to change their bodies and appearance, despite this kind of advertising being banned.Dame Rachel de Souza said the posts were \"immensely damaging\" to young people's self-esteem and called for a ban on social media advertising to children.A spokesperson for the media regulator Ofcom said it did not tolerate \"tech firms prioritising engagement over children's online safety\".Dame Rachel's report used a survey of 2,000 children aged 13-17 about the potentially harmful products they saw online, alongside two focus groups.Respondents said they also saw products promoting weight loss such as diet food or drinks, as well as skin-lightening products which can be illegal to sell in the UK.Other contributors said beauty content online was \"unavoidable\" - including posts promoting cosmetic procedures such as lip fillers.Dr Peter Macaulay, a senior lecturer in Psychology at the University of Derby said ending advertising to children on social media was a \"necessary step\", and he believed regulation should go even further.\"Alongside restrictions, we need stronger platform accountability, better enforcement of age-appropriate design, and education that helps children understand and critically navigate online pressures,\" he said.'Urgent action needed'Several solutions were suggested within Dame Rachel's report, including amending the Online Safety Act (OSA) to include a \"clear duty of care\" for social media platforms to stop showing adverts to children.The Online Safety Act aims to make the internet safer for people in the UK, especially children, through a set of laws and duties that online platforms must follow. It is implemented and enforced by Ofcom.It requires firms to remove harmful material quickly when it is identified.Dame Rachel also suggested adding changes to Ofcom's Children's Code of Practice to \"explicitly protect children from body stigma content\".But according to Ofcom, this is already part of the Code under \"non-designated content\".\"Body stigma content can be incredibly harmful to children, which is why our codes require sites and apps to protect children from encountering it, and to act swiftly when they become aware of it,\" a spokesperson for the regulator said.And Dame Rachel called for stronger regulation and enforcement of online sales of age-restricted products - suggesting the government should consider restricting children's access to some social media platforms.\"Urgent action is needed to create an online world that is truly safer by design,\" said Dame Rachel.\"We cannot continue to accept an online world that profits from children's insecurities and constantly tells them they need to change or must be better.\"A government spokesperson said it was \"always clear\" the OSA wasn't the end of the conversation.They added the government had recently launched a national consultation on \"bold measures to protect children online\", including potentially banning social media for under 16s.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Children bombarded with weight loss drug ads online, says report",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4eff/live/c60eff20-06a8-11f1-8222-ad34ef3f6330.jpg"
      ],
      "datePublished": "2026-02-11T09:49:13.000Z",
      "dateModified": "2026-02-11T09:49:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kingsbury School: Boy, 13, questioned after two students stabbed",
    "url": "https://www.bbc.com/news/articles/c4g0rnvpr1no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c25a/live/f67a3ee0-072f-11f1-811d-d70cdc846ab3.jpg",
    "tag": "Trending",
    "date": "2026-02-11T12:35:13.000Z",
    "description": "Boy, 13, questioned over double school stabbing16 minutes agoAurelia FosterLondonBBCThe school's headteacher said the incident was a \"deeply traumatic",
    "body": "Boy, 13, questioned over double school stabbing16 minutes agoAurelia FosterLondonBBCThe school's headteacher said the incident was a \"deeply traumatic event for the whole school community\"Police are continuing to question a 13-year-old boy arrested on suspicion of attempted murder, as counter terrorism officers lead an investigation into the stabbing of two boys at a school in north-west London.Officers were called to Kingsbury High School in Brent, at 12:40 GMT on Tuesday, to find a 13-year-old and a 12-year-old had been attacked.The two are believed to be in a serious condition, the Metropolitan Police said.Det Ch Supt Luke Williams said due to  \"surrounding circumstances\", the investigation was being led by counter terrorism officers, although it has not been declared a terrorist incident.Speaking in the House of Commons, Prime Minister Sir Keir Starmer described the stabbing as an \"appalling attack\" and said his thoughts were with the two children, and all of those affected.\"We thank the police for their rapid response. It's important now that we give them the space to pursue their investigation,\" he added.BBC Home Affairs Correspondent Daniel Sandford said it was understood that some had heard the attacker saying words like \"Allahu Akbar\" - or similar - meaning \"God is greatest\" in Arabic, during the incident.There are reports that people may have been sprayed with a substance, although it is not believed to have been noxious. The suspect left the scene following the stabbing, but was later arrested and a weapon was recovered, police said.During the police press conference on Tuesday, Williams said police were \"keeping an open mind as to any motivation behind the attack\".\"However, due to the surrounding circumstances, the investigation is now being led by officers from counter terrorism policing London, who are working closely with our local officers in response to this incident,\" he added.Police are understood to be examining the suspect's devices and going through dozens of witness accounts.PA MediaDet Ch Supt Luke Williams updated media at the school on Tuesday eveningSimon Theodorou, a parent of a child at the school, told the Telegraph the attacker \"managed to get his way in by climbing over a wall\".He also claimed one of the victims \"pulled the fire alarm to get help\", praising the boy as \"a hero\".The head teacher of the school, Alex Thomas, said the incident was \"a deeply traumatic event for the whole school community\", in a letter to parents and carers.\"I fully appreciate that this will be very upsetting news to hear and, as you can imagine, this has been a deeply traumatic event for the whole school community,\" he said.\"The situation is under control, but a live investigation is taking place. We are working closely with the authorities and I will provide further updates as soon as I am able to share confirmed information. Please keep the students and their families in your thoughts.\"He added the Lower School would be closed on Wednesday and students should stay at home, but the Upper School would be open for students in Years 10-13.'They're children'Some pupils were seen leaving in tears on Tuesday evening after being spoken to by police.The father of one pupil said children were obviously \"traumatised by what happened in front of them\".Reporting from the scene on Wednesday morning, BBC Radio London journalist  Gem O'Reilly said pupils arriving at the school said they felt nervous and distressed following the attacks.Other pupils have said they were scared to walk to school.Local man Moeen, a former pupil, told the BBC: \"I feel very sad for them and their family...the age of 13 is just for playing...they're children\".He said local people had been left feeling \"unsafe\". \"I am very worried - they have to do something,\" he added.'Parents' worst nightmare'Dawn Butler, MP for Brent East, said: \"The whole school community - the parents, the wider community - are deeply shocked by this.\"There has been a lot of support given to the school, obviously that will have to be ongoing.\"\"It's a parent's worst nightmare to think they are sending their child to school and something may well happen to them.\"Brent Council leader Muhammed Butt thanked the emergency services and school staff for their \"swift\" response, adding: \"Our thoughts and prayers are with those who have been injured, their families and the whole school community.\"Mayor of London Sir Sadiq Khan has urged anyone with information to contact the police, adding: \"There is no honour in staying silent.\"However on Wednesday, the government confirmed it was not considering installing mandatory metal detectors in schools.Asked about knife arches - a walk‑through metal detector - Minister for School Standards, Georgia Gould, told BBC Breakfast it was not something the government was looking into at the moment.\"But we are taking action on knife violence and in a whole range of ways, in terms of training, in terms of investment, in terms of support for young people,\" she added.Kingsbury High School is an academy school serving children aged 11 to 18, with both upper and lower sites.Alumni include singer George Michael, jazz musician Courtney Pine, Floyd Steadman - the first black captain of the Saracens rugby team - and writer Ekow Eshun. More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kingsbury School: Boy, 13, questioned after two students stabbed",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c25a/live/f67a3ee0-072f-11f1-811d-d70cdc846ab3.jpg"
      ],
      "datePublished": "2026-02-11T12:35:13.000Z",
      "dateModified": "2026-02-11T12:35:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Woman who murdered, cut up and buried partner in Derby jailed",
    "url": "https://www.bbc.com/news/articles/cr5l453g1npo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/71e3/live/561a81a0-0728-11f1-811d-d70cdc846ab3.jpg",
    "tag": "Trending",
    "date": "2026-02-11T12:31:37.000Z",
    "description": "20 minutes agoGeorge TorrDerbyDerbyshire PoliceAnna Podedworna was convicted of murder by a jury on TuesdayA woman who murdered her partner before cut",
    "body": "20 minutes agoGeorge TorrDerbyDerbyshire PoliceAnna Podedworna was convicted of murder by a jury on TuesdayA woman who murdered her partner before cutting her body in two and burying her remains in the back garden of a house more than 15 years ago has been jailed for life.Anna Podedworna contacted Derbyshire Police last year, telling them Izabela Zablocka's body would be found buried in Princes Street, Derby.In Derby Crown Court on Wednesday, she was sentenced to life in prison with a minimum term of 21 years for murder.Derbyshire PoliceIzabela Zablocka's remains were discovered in a garden - almost 15 years after she was reported missingSentencing Podedworna, the judge, Mrs Justice Williams KC said: \"It is clear from the evidence in this trial that Izabela was a loved family member, who enjoyed a close bond with her mother, grandmother and her daughter Kasia.\"She stayed in regular contact with family members back in Poland... but Izabela did not call her daughter as Kasia expected on 4 September 2010, the day of her 10th birthday.\"As a result of your violent, manipulative and cruel actions, Kasia grew up not knowing what happened to her beloved mother who had suddenly vanished from her life without any explanation.\"Had it not been for the steadfast persistence of the family, who did not give up hope on uncovering what happened, it's likely your crimes would have remained undetected.\"You have shown no remorse. You do not deserve credit for belatedly contacting the police in May 2025 – you only did this to put forward a false account of Izabela's death.\"Derbyshire PoliceIzabela Zablocka was described in court as a loving mother who was \"extremely close\" to her family back in PolandWarning: This article contains details that some readers may find distressingThe jury was told the two women had moved to the UK together from Poland in search of work and lived in the Normanton area of Derby.The prosecution said Zablocka phoned her mother in Poland on 28 August 2010 and was not heard from again.Prosecutor Gordon Aspden KC said shortly after this call, Zablocka was murdered by Podedworna, who \"dismembered Izabela's body by cutting it in half with a large knife\".Police discovered the defendant had previously been employed as a \"skilled butcher\", and her work involved \"deboning, and portioning out turkey carcasses using a large knife\".The court heard the body was buried in the back garden, before concrete hardstanding was then laid over the top.Zablocka's body was buried in the garden of a house in Princes StreetIn May 2025, Zalewski requested an interview with Podedworna and he flew to Derby to challenge her on the doorstep of her Boyer Street home.She denied any knowledge of her whereabouts but the court heard she \"cracked\" under \"mounting pressure\" and emailed Derbyshire Police telling them where to find the body.A full scale search of the Princes Street property in Normanton led to Izabela's remains being found.Derbyshire PoliceIzabela's daughter Kasia, now an adult, told the court through a victim impact statement she had been haunted throughout her childhood wondering where her mother was In a victim impact statement read out by the court, Kasia said the impact of her mother's disappearance had been traumatic throughout her life.\"As a young child I was incredibly close to my mother, she was my whole world, so the fact she simply vanished from my life without a single word of explanation was a horrific experience for me,\" the statement added.\"This sudden void left a deep wound in my psyche which has stayed with me until this day.\"The worst part was the soul-crushing uncertainty. For years, I didn't know why she left me.\"Instead of playing with friends I was constantly wondering where my mother was and why she stopped calling me. I felt abandoned.\"Even though I lived in limbo for years, in my heart, I always knew my mother didn't leave me on purpose.\"Podedworna said she acted in self-defence when she killed Izabela, but the jury and the judge rejected that claim. In mitigation, Clive Stockwell KC, for Podedworna, said: \"Something must have happened to make this defendant of previous good character behave in the way that she did.\"She has two children aged 11 and six and they will live the best part of their life without their mother.\"'Challenging and distressing'But Mrs Justice Williams said: \"Brutalising her remains was consistent of killing in anger with a partner you came to despise.\"You carried on your life as if nothing untowards happened. You lied to Izabela's mother and your own mother about her disappearance, you lied to the police when a missing persons report was lodged.\"Over the years you continued to lie.\"Det Insp Kane Martin, who led the investigation, said it had \"been particularly challenging and distressing from the outset\".\"Izabela's family have had to learn about the unimaginable horrors Anna Podedworna inflicted upon her in a very public manner, so many years after she was taken away.\"After being killed in her own home in August of 2010 Izabela was brutally and horrifically dismembered by the woman she loved.\"Anna Podedworna, by her own admission acted like a monster – I don't think my words can describe her actions and her behaviour towards Izabela any better.\"After killing Izabela, she cut her into two, treating her no differently to another piece of meat at work.  She then waited for night to fall, to dig a grave in the garden of their home and buried Izabela there.\"She then removed all trace of Izabela – lying and obstructing justice in the years that followed,\" he said.Martin said officers had \"worked hard through this complex investigation – in Poland and the UK - to seek the truth for Izabela's family and have remained focused and motivated to achieve justice for Izabela\".\"Izabela was a much-loved mother, daughter, and granddaughter – nothing can bring her back but it is my hope that today's sentencing allows her family to lay her memory to rest,\" he added.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Woman who murdered, cut up and buried partner in Derby jailed",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/71e3/live/561a81a0-0728-11f1-811d-d70cdc846ab3.jpg"
      ],
      "datePublished": "2026-02-11T12:31:37.000Z",
      "dateModified": "2026-02-11T12:31:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC in Tehran as Iran marks 47th anniversary of Islamic revolution",
    "url": "https://www.bbc.com/news/videos/cewz2lxq2gvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6356/live/6f152e40-073b-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "Trending",
    "date": "2026-02-11T12:34:41.000Z",
    "description": "Authorities in Iran have put on a show of strength to mark the 47th anniversary of the Islamic revolution, weeks after they used unprecedented force t",
    "body": "Authorities in Iran have put on a show of strength to mark the 47th anniversary of the Islamic revolution, weeks after they used unprecedented force to put down anti-government protests. The BBC is visiting Tehran for the first time since the crackdown, during which at least 6,490 protesters were killed across the country, according to human rights activists. The BBC's chief international correspondent Lyse Doucet says the bunting lining the capital's streets and large crowds of government supporters embody the image of the nation the government wants to see on the streets: Iranians coming out to show their support for the Islamic Republic and the revolution. Our correspondent is reporting from Tehran on condition that none of her material is used on the BBC's Persian Service. These restrictions apply to all international media organisations operating in Iran.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC in Tehran as Iran marks 47th anniversary of Islamic revolution",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6356/live/6f152e40-073b-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-11T12:34:41.000Z",
      "dateModified": "2026-02-11T12:34:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Winter Olympics: Sturla Holm Laegreid apologises after confession",
    "url": "https://www.bbc.com/sport/articles/c1mj9mpz7p5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cd72/live/1580f920-072e-11f1-811d-d70cdc846ab3.jpg",
    "tag": "Trending",
    "date": "2026-02-11T11:49:32.000Z",
    "description": "On Wednesday, Norway's state broadcaster NRK shared a statement by Laegreid in which he apologised both to his ex-girlfriend and Botn. \"I deeply regre",
    "body": "On Wednesday, Norway's state broadcaster NRK shared a statement by Laegreid in which he apologised both to his ex-girlfriend and Botn. \"I deeply regret bringing up this personal story on what was a day of celebration for Norwegian biathlon,\" Laegreid told NRK - Norway's state broadcaster. \"I am not quite myself these days, and I am not thinking clearly. My apologies go to Johan-Olav, who deserved all the attention after winning gold.\"My apologies also go to my ex-girlfriend, who unwillingly ended up in the media spotlight. I hope she is doing well.\"I cannot change what has happened, but I will now put this behind me and focus on the Olympics. I will not be answering any further questions about this.\"In a news conference on Tuesday, Laegreid had said he hoped he had not \"ruined\" his team-mate's day, but insisted: \"I stand by my choice.\"Former team-mate Johannes Thingnes Boe - a five-time biathlon gold medallist - told Norwegian state broadcaster NRK that Laegreid was \"completely wrong\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winter Olympics: Sturla Holm Laegreid apologises after confession",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cd72/live/1580f920-072e-11f1-811d-d70cdc846ab3.jpg"
      ],
      "datePublished": "2026-02-11T11:49:32.000Z",
      "dateModified": "2026-02-11T11:49:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]