[
  {
    "title": "Australia senator suspended after burka stunt in parliament",
    "url": "https://www.bbc.com/news/articles/cz94pdkzqvwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/930d/live/45c0c8f0-c934-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-25T03:40:44.000Z",
    "description": "39 minutes agoRuth Comerford,LondonandTiffanie Turnbull,SydneyAn Australian senator has been suspended for a week after wearing a burka in parliament ",
    "body": "39 minutes agoRuth Comerford,LondonandTiffanie Turnbull,SydneyAn Australian senator has been suspended for a week after wearing a burka in parliament to push for a ban on the Muslim garment.Pauline Hanson was condemned by fellow senators - and later formally censured - for the stunt on Monday, with one colleague accusing her of \"blatant racism\".The Queensland senator, of the anti-immigration One Nation party, was seeking to introduce a bill that would outlaw full face coverings in public – a policy she has long campaigned for.It is the second time she has worn the garment – which covers the face and body – in parliament, and said her actions were in protest at the senate rejecting her bill.Shortly after other lawmakers blocked her from introducing the bill on Monday, she returned wearing a black burka.\"This is a racist senator, displaying blatant racism,\" said Mehreen Faruqi, a Muslim  Greens senator whom the Federal Court last year found was a victim of racial discrimination by Hanson - a judgement the latter is currently appealing.Fatima Payman, an independent senator from the state of Western Australia, called the stunt \"disgraceful\".Foreign Minister Penny Wong, who serves as leader of the government in the senate, on Tuesday moved a motion to censure Hanson, claiming she \"has been parading prejudice as protest for decades\".The motion, which passed 55 votes to five, states that Hanson's actions were \"intended to vilify and mock people on the basis of their religion\" and were \"disrespectful to Muslim Australians\".Wong earlier argued Hanson was \"not worthy of a member of the Australian senate\".In a post on Facebook, Hanson wrote: \"If they don't want me wearing it - ban the burka.\"She previously wore a burka to parliament in 2017, also calling for a national ban at the time.In 2016, Hanson was criticised for her maiden speech to the Australian senate, in which she said the country was in danger of being \"swamped by Muslims\".It echoed her controversial first speech to the House of Representatives, made in 1996, in which she warned that the country was in danger of being \"swamped by Asians\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australia senator suspended after burka stunt in parliament",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/930d/live/45c0c8f0-c934-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-25T03:40:44.000Z",
      "dateModified": "2025-11-25T03:40:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Skye Gyngell: Michelin-starred Australian chef dies aged 62",
    "url": "https://www.bbc.com/news/articles/cy840l75gx3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f52c/live/f1645b20-c909-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-24T07:49:09.000Z",
    "description": "Pioneering Australian chef Skye Gyngell has died aged 62.Gyngell rose to fame in the UK after her cafe at Petersham Nurseries in south-west London was",
    "body": "Pioneering Australian chef Skye Gyngell has died aged 62.Gyngell rose to fame in the UK after her cafe at Petersham Nurseries in south-west London was awarded a coveted Michelin star, one of the highest culinary honours. She went on to helm Spring restaurant at Somerset House and Marle and Hearth at Heckfield Place in Hampshire.Gyngell's family said she died on Saturday in London, describing her as a \"culinary visionary who influenced generations of chefs and growers globally to think about food and its connection to the land\". Celebrity chef Jamie Oliver paid tribute to Gyngell - who was diagnosed with skin cancer last year - and thanked her for \"all you did to inspire young cooks\".During the 1980s, Gyngell pioneered the \"slow food movement\" before becoming a private chef for clients including Nigella Lawson, Madonna and Guy Ritchie.Lawson mourned her death, writing on Instagram, \"However ill you know someone to be, their death is always a shock. It's just awful that Skye is no longer in the world.\"Gyngell died just days after her mother, Ann Barr, who was a well-known interior designer.Her father, Bruce Gyngell, was the first person to appear on Australian television in 1956 with the line: \"Good evening, and welcome to television\". He died in 2000.Born in Sydney, Skye Gyngell was studying at Sydney University when she realised the culinary world was where she wanted to be. She moved to Paris at 19, where she trained and worked under acclaimed chefs including at the two Michelin-starred restaurant Dodin-Bouffant.Gyngell later moved to London and worked at the French House in Soho with Fergus and Margot Henderson.In 2004, Gyngell became head chef at Petersham Nurseries cafe in Richmond, where she  turned the dilapidated site into a thriving cafe, and in 2011, it was awarded a Michelin star.But the kudos was a double-edged sword for Gyngell, who left the cafe a year after the award, saying she was frustrated by customers who expected a traditional Michelin experience at her rustic cafe.Her later ventures included Spring at Somerset House, which was the first single-use plastic-free restaurant in London. Gyngell, who overcame drug and alcohol addiction in her younger years, was also known for her award-winning cookbooks and wrote columns for Vogue as its food editor.Last year, she found a lump in her neck and was diagnosed with Merkel cell carcinoma, a rare and aggressive skin cancer.She underwent an operation which included the removal of her salivary glands, causing her to temporarily lose her sense of smell and taste.Get our flagship newsletter with all the headlines you need to start the day. Sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Skye Gyngell: Michelin-starred Australian chef dies aged 62",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f52c/live/f1645b20-c909-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-24T07:49:09.000Z",
      "dateModified": "2025-11-24T07:49:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Duduzile Zuma: Daughter of South Africa's ex-president accused of Russia recruitment plot",
    "url": "https://www.bbc.com/news/articles/cqlkve4qz0ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4374/live/740aeb00-c88a-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-24T13:49:56.000Z",
    "description": "14 hours agoNomsa MasekoBBC Africa, JohannesburgOne of the daughters of Jacob Zuma, South Africa's former president, has filed a criminal complaint ag",
    "body": "14 hours agoNomsa MasekoBBC Africa, JohannesburgOne of the daughters of Jacob Zuma, South Africa's former president, has filed a criminal complaint against her sister, accusing her of recruiting men from South Africa to fight in the Russia-Ukraine war.Nkosazana Zuma-Mncube alleged that Duduzile Zuma-Sambudla, who serves as an MP, and two others tricked 17 men into fighting for Russian mercenaries.The men were told they were travelling to Russia to train as bodyguards for Jacob Zuma's political party Mkhonto Wesizwe (MK), Zuma-Mncube's statement says.The police say they are investigating the matter, while Zuma-Sambudla, aged 43, has not responded to the BBC's request for comment.South Africa's government previously said it had received distress calls from 17 citizens who had joined mercenary forces in the Russia-Ukraine conflict.The men, aged from 20 to 39, were lured to join the mercenary forces under the pretext of lucrative contracts, the government said.South Africa has an unemployment rate of more than 30%. Joblessness among young people is even higher, making them especially vulnerable for recruitment, analysts say.Zuma-Mncube said she had a \"moral obligation\" to file a police complaint against her younger sister.Earlier this week, international financial outlet Bloomberg reported similar allegations against Zuma-Sambudla and said some men had also been recruited from neighbouring Botswana.The allegations add to Zuma-Sambudla's legal woes - she is currently on trial over terrorism-related charges.The MP is being prosecuted over comments she made on social media four years ago during deadly protests in South Africa, following the arrest of her father.A week of anarchy in several parts of the country in July 2021, including looting and arson, left at least 300 people dead.Zuma-Sambudla has been accused of fuelling this unrest but she says the charges against her are politically motivated.Jacob Zuma was jailed for contempt of court for refusing to take part in an inquiry into allegations of corruption during his presidency that led to his sacking.He subsequently formed the MK party and led it to third place in last year's elections.The BBC has contacted MK and the Jacob Zuma Foundation for comment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Duduzile Zuma: Daughter of South Africa's ex-president accused of Russia recruitment plot",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4374/live/740aeb00-c88a-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-24T13:49:56.000Z",
      "dateModified": "2025-11-24T13:49:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Morgan Geyser, 'Slender Man' stabber, captured after fleeing custody",
    "url": "https://www.bbc.com/news/articles/cvgkwgyqzn0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/478b/live/62ac12e0-c956-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-24T18:29:46.000Z",
    "description": "Illinois police captured Morgan Geyser, who was convicted in the 2014 stabbing of a classmate to appease Slender Man, an online character, after she f",
    "body": "Illinois police captured Morgan Geyser, who was convicted in the 2014 stabbing of a classmate to appease Slender Man, an online character, after she fled a group home in neighbouring Wisconsin where she was being held.Police said Geyser, 23, removed her bracelet monitoring device and fled the home in Madison on Saturday night and was on the run until her capture on Sunday.Officers found her at a truck stop in Posen, Illinois, where they said Geyser told them to \"just Google\" her name and that she had \"done something really bad\".Geyser was 12 years old when she stabbed her classmate 19 times. She was sentenced to 40 years in a mental hospital in 2018 and granted conditional release in July.Geyser was found with a man at the truck stop just outside of Chicago - and about 170 miles south of Madison - after police received reports of a man and woman loitering.\"When officers arrived, they located both subjects sleeping on the sidewalk,\" Posen police said in a statement. \"The female repeatedly refused to provide her real name and initially gave a false one. \"After continued attempts to identify her, she finally stated that she didn't want to tell officers who she was because she had 'done something really bad,' and suggested that officers could 'just Google' her name.\"She and her companion were detained after police determined she was wanted in Wisconsin. CBS News, the BBC's US partner, reported the 42-year-old companion was charged with trespassing and obstructing identification and later released. The so-called \"Slender Man stabbing\" shocked Wisconsin and garnered national attention. Geyser and her friend Anissa Weier, also 12 at the time of the attack, lured a classmate to a park after a sleepover and Geyser stabbed the classmate repeatedly while Weier encouraged her to continue. The victim, 12-year-old Payton Leutner, survived the brutal attack and was found by a cyclist. Geyser and Weier were tried as adults. Geyser pleaded guilty to first-degree intentional homicide and was sentenced to 40 years. A judge allowed her release under supervision at the group home in July.Weier was charged with attempted murder and sentenced to 25 years in a psychiatric hospital but released in 2021.Geyser and Weier said they were inspired to attack their classmate after reading about Slender Man in a creepypasta, a short, online story designed to shock or scare the reader. Slender Man is a skinny, shadowy figure who has appeared in photos, drawings and articles across the internet. Some claim he has tentacles emerging from his back, and most say he wears dark clothes and has a pale face.The girls said they believed Slender Man would kill their relatives if they did not kill their friend to please him, an attorney for Geyser said in court. Authorities said the girls had hoped to live with Slender Man after the attack.Slender Man first appeared on the internet in 2009.The character was created by a Florida resident in response to a call for submissions from comedy website SomethingAwful. The character was pictured behind a crowd of people.After the stabbing, the website released an article urging people not to kill anyone because of Slender Man.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Morgan Geyser, 'Slender Man' stabber, captured after fleeing custody",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/478b/live/62ac12e0-c956-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-24T18:29:46.000Z",
      "dateModified": "2025-11-24T18:29:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cameroon's opposition leader Tchiroma Bakary in The Gambia after fleeing for his safety ",
    "url": "https://www.bbc.com/news/articles/c8dyjn1mne5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2291/live/e61ec230-c91f-11f0-adfd-7b4de49ef46f.jpg",
    "tag": "World",
    "date": "2025-11-24T11:26:59.000Z",
    "description": "17 hours agoPaul NjieBBC Africa, YaoundéAFP via Getty ImagesTchiroma Bakary has vowed to resist President Paul Biya's governmentCameroonian opposition",
    "body": "17 hours agoPaul NjieBBC Africa, YaoundéAFP via Getty ImagesTchiroma Bakary has vowed to resist President Paul Biya's governmentCameroonian opposition leader Issa Tchiroma Bakary, who is contesting the outcome of the presidential election, has fled to The Gambia for his safety, The Gambian government has said.Tchiroma Bakary has insisted he is the legitimate winner of the 12 October election, alleging that the result was rigged to give President Paul Biya, 92, an eighth term. The Gambian information ministry said on Sunday that Tchiroma Bakary arrived on 7 November and was allowed to stay on humanitarian grounds.Cameroon's government had threatened to put him on trial for allegedly inciting violent post-election demonstrations. He denied the allegation, and blamed the security forces for a crackdown on protesters.The government put the number of people killed in post-election violence at 16, but other organisations have given a higher death toll.Tchiroma Bakary has repeatedly promised to resist Biya's government until his \"victory\" in the election is recognised.Biya, the world's oldest president, has been in power for 43 years, and was declared the winner with 53.7% of the vote amid allegations of fraud. Tchiroma Bakary, who served in Biya's government for many years, came second with 35.2%.His resistance tactics have included calling for street protests and \"ghost town\" operations aimed at bringing cities and towns to a standstill.Until The Gambian government confirmed his presence, his whereabouts had remained a mystery although there was speculation that he had fled to another country in the region.\"He is being hosted temporarily in The Gambia purely on humanitarian grounds in the spirit of African solidarity and for the purpose of ensuring his safety while discussions continue to pursue a peaceful and diplomatic resolution to the post-electoral tensions in Cameroon,\" The Gambian government said in a statement.The Gambian authorities said the country would not be used as a \"base for subversive activity against any state\".The BBC has reached out to the Cameroonian government for comment.Reacting to the announcement, The Gambia's main opposition United Democratic Party (UDP) criticised the government for withholding the announcement of Tchiroma Bakary's arrival until Sunday.It said it raised \"serious questions about transparency, accountability, and respect for The Gambian people's right to know what actions are taken in their name\".However, the party said it was proud that Tchiroma Bakary could find \"safe sanctuary\" in The Gambia, adding that it was fully aware of how \"despotism operates and how dissenters are treated\".You may also be interested in:Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cameroon's opposition leader Tchiroma Bakary in The Gambia after fleeing for his safety ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2291/live/e61ec230-c91f-11f0-adfd-7b4de49ef46f.jpg"
      ],
      "datePublished": "2025-11-24T11:26:59.000Z",
      "dateModified": "2025-11-24T11:26:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Indian study finds music helps patients heal under anaesthesia ",
    "url": "https://www.bbc.com/news/articles/c231dv9zpz3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2db4/live/98981940-c8a1-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-25T00:00:11.000Z",
    "description": "Music eases surgery and speeds recovery, Indian study finds4 hours agoSoutik BiswasIndia correspondentBBCA patient with headphones playing music durin",
    "body": "Music eases surgery and speeds recovery, Indian study finds4 hours agoSoutik BiswasIndia correspondentBBCA patient with headphones playing music during surgery in a hospital in DelhiUnder the harsh lights of an operating theatre in the Indian capital, Delhi, a woman lies motionless as surgeons prepare to remove her gallbladder.She is under general anaesthesia: unconscious, insensate and rendered completely still by a blend of drugs that induce deep sleep, block memory, blunt pain and temporarily paralyse her muscles.Yet, amid the hum of monitors and the steady rhythm of the surgical team, a gentle stream of flute music plays through the headphones placed over her ears.Even as the drugs silence much of her brain, its auditory pathway remains partly active. When she wakes up, she will regain consciousness more quickly and clearly because she required lower doses of anaesthetic drugs such as propofol and opioid painkillers than patients who heard no music.That, at least, is what a new peer-reviewed study from Delhi's Maulana Azad Medical College suggests. The research, published in the journal Music and Medicine, offers some of the strongest evidence yet that music played during general anaesthesia can modestly but meaningfully reduce drug requirements and improve recovery.The study focuses on patients undergoing laparoscopic cholecystectomy, the standard keyhole operation to remove the gallbladder. The procedure is short - usually under an hour - and demands a particularly swift, \"clear-headed\" recovery.To understand why the researchers turned to music, it helps to decode the modern practice of anaesthesia.\"Our aim is early discharge after surgery,\" says Dr Farah Husain, senior specialist in anaesthesia and certified music therapist for the study. \"Patients need to wake up clear-headed, alert and oriented, and ideally pain-free. With better pain management, the stress response is curtailed.\" Achieving that requires a carefully balanced mix of five or six drugs that together keep the patient asleep, block pain, prevent memory of the surgery and relax the muscles.Getty ImagesPatients need to wake up clear-headed and ideally pain-free after surgeryIn procedures like laparoscopic gallbladder removal, anaesthesiologists now often supplement this drug regimen with regional \"blocks\" - ultrasound-guided injections that numb nerves in the abdominal wall. \"General anaesthesia plus blocks is the norm,\" says Dr Tanvi Goel, primary investigator and a former senior resident of Maulana Azad Medical College. \"We've been doing this for decades.\"But the body does not take to surgery easily. Even under anaesthesia, it reacts: heart rate rises, hormones surge, blood pressure spikes. Reducing and managing this cascade is one of the central goals of modern surgical care. Dr Husain explains that the stress response can slow recovery and worsen inflammation, highlighting why careful management is so important.The stress starts even before the first cut, with intubation - the insertion of a breathing tube into the windpipe.To do this, the anaesthesiologist uses a laryngoscope to lift the tongue and soft tissues at the base of the throat, obtain a clear view of the vocal cords, and guide the tube into the trachea. It's a routine step in general anaesthesia that keeps the airway open and allows precise control of the patient's breathing while they are unconscious.\"The laryngoscopy and intubation are considered the most stressful response during general anaesthesia,\" says Dr Sonia Wadhawan, director-professor of anaesthesia and intensive care at Maulana Azad Medical College and supervisor of the study.\"Although the patient is unconscious and will remember nothing, their body still reacts to the stress with changes in heart rate, blood pressure, and stress hormones.\"To be sure, the drugs have evolved. The old ether masks have vanished. In their place are intravenous agents - most notably propofol, the hypnotic made infamous by Michael Jackson's death but prized in operating theatres for its rapid onset and clean recovery. \"Propofol acts within about 12 seconds,\" notes Dr Goel. \"We prefer it for short surgeries like laparoscopic cholecystectomy because it avoids the 'hangover' caused by inhalational gases.\"The team of researchers wanted to know whether music could reduce how much propofol and fentanyl (an opioid painkiller) patients required. Less drugs means faster awakening, steadier vital signs and reduced side effects.So they designed a study. A pilot involving eight patients led to a full 11-month trial of 56 adults, aged roughly 20 to 45, randomly assigned to two groups. All received the same five-drug regimen: a drug that prevents nausea and vomiting, a sedative, fentanyl, propofol and a muscle relaxant. Both groups wore noise-cancelling headphones - but only one heard music.\"We asked patients to select from two calming instrumental pieces - soft flute or piano,\" says Dr Husain. \"The unconscious mind still has areas that remain active. Even if the music isn't explicitly recalled, implicit awareness can lead to beneficial effects.\"A pilot involving eight patients led to a full trial of 56 adults randomly assigned to two groups The results were striking.Patients exposed to music required lower doses of propofol and fentanyl. They experienced smoother recoveries, lower cortisol or stress-hormone levels and a much better control of blood pressure during the surgery. \"Since the ability to hear remains intact under anaesthesia,\" the researchers write, \"music can still shape the brain's internal state.\"Clearly, music seemed to quieten the internal storm. \"The auditory pathway remains active even when you're unconscious,\" says Dr Wadhawan. \"You may not remember the music, but the brain registers it.\"The idea that the mind behind the anaesthetic veil is not entirely silent has long intrigued scientists. Rare cases of \"intraoperative awareness\" show patients recalling fragments of operating-room conversation. If the brain is capable of picking up and remembering stressful experiences during surgery - even when a patient is unconscious - then it might also be able to register positive or comforting experiences, like music, even without conscious memory.\"We're only beginning to explore how the unconscious mind responds to non-pharmacological interventions like music,\" says Dr Husain. \"It's a way of humanising the operating room.\"Music therapy is not new to medicine; it has long been used in psychiatry, stroke rehabilitation and palliative care. But its entry into the intensely technical, machine-governed world of anaesthesia marks a quiet shift.If such a simple intervention can reduce drug use and speed recovery - even modestly - it could reshape how hospitals think about surgical wellbeing.As the research team prepares its next study exploring music-aided sedation, building on earlier findings, one truth is already humming through the data: even when the body is still and the mind asleep, it appears a few gentle notes can help the healing begin.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Indian study finds music helps patients heal under anaesthesia ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2db4/live/98981940-c8a1-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-25T00:00:11.000Z",
      "dateModified": "2025-11-25T00:00:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Machu Picchu hit by a row over tourist buses",
    "url": "https://www.bbc.com/news/articles/ce8g8wrd61zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ed66/live/70165840-c619-11f0-934b-cf5196b3cbea.jpg",
    "tag": "World",
    "date": "2025-11-24T00:06:53.000Z",
    "description": "1 day agoJane ChambersBusiness reporter, Aguas Calientes, PeruAFP via Getty ImagesMachu Picchu attracts more than 1.6 million tourists per year, but g",
    "body": "1 day agoJane ChambersBusiness reporter, Aguas Calientes, PeruAFP via Getty ImagesMachu Picchu attracts more than 1.6 million tourists per year, but getting there is not easyMachu Picchu, the remains of a 15th Century Inca city, is Peru's most popular tourist destination, and a Unesco world heritage site. Yet a continuing dispute over the buses that take visitors up to the mountain-top site recently saw some 1,400 stranded tourists needing to be evacuated.Cristian Alberto Caballero Chacón is head of operations for bus company Consettur, which for the past 30 years has transported some 4,500 people every day to Machu Picchu from the local town of Aguas Calientes.It is a 20-minute journey, and the only alternative is an arduous, steep, two-hour walk.He admits that in the past few months \"there have been some conflicts between people from different communities here\".This conflict revolves around Consettur losing its licence to a rival bus firm in this remote part of Peru, where, unless you want to hike over Andes mountains, the only access is by public transport.To get to Machu Picchu without walking, tourists must first take a train to Aguas Calientes, which takes from two to three and a half hours. And then transfer to a bus for the final leg.Wilson ChiloA fleet of buses ferry tourists to Machu Picchu from the local town of Aguas CalientesBack in September, local protestors angry that Consettur was being replaced following what they saw as an insufficiently open bidding process, blocked the railway line to Aguas Calientes with rocks.This resulted in Peruvian authorities having to clear the tracks and evacuate tourists on special train services.A number of local people, who didn't want to go on the record, say the protestors were unhappy that Consettur had a monopoly on the lucrative bus service, and that its position as sole provider was simply due to be transferred to new company San Antonio de Torontoy. A round-trip bus ticket costs $24 (£18) for a foreigner and $15 for a Peruvian.Although Consettur's licence ran out in September, it is continuing to run its buses. And due to legal challenges, San Antonio de Torontoy has yet to start.It's a complex situation, involving people from different local communities wanting a slice of the bus income, but Mr Caballero is adamant that Consettur is not a monopoly.\"The owners of the business have been running the company for the past 30 years, and they are people who come from around here,\" he says. \"This is not a monopoly. Consettur is made up of 12 different companies with various partners.\"These partners include the local district council, which owns 38% of Consettur.Meanwhile, San Antonio de Torontoy is based slightly further away in the wider Urubamba Province.AFP via Getty ImagesUnless you fancy a long hike, the only way to get to the town of Aguas Calientes is by trainAs the row and legal dispute over the buses rumbles on, Australian tourist Annalise Jaksic complains about the cost of the trains to Aguas Calientes. The cheapest round-trip ticket is $140, rising to $2,000 for luxury first class.Speaking in Aguas Calientes, she says: \"We thought it was one train [all the way to Machu Picchu]. And we thought if there was any more transport to get up there it would all be included, because you pay so much money for the train.\"Her friend and travelling companion Todd Carland adds that buying the entry tickets for the site \"was a nightmare for us\". He says it was difficult to arrange because they weren't doing it through an expensive guided tour. A standard adult price for Machu Picchu is $57.The mayor of Aguas Calientes, Elvis La Torre, is also unhappy about the entry tickets, because he says that most of the revenues do not stay locally.\"Only 10% of the ticket sales stay in the region. The rest of the money goes to the Ministry of Culture to look after other archaeological sites around Peru and pay for wages.\"He wants more money to go to his community and the surrounding region to help improve tourism and fund more projects to help the locals. The Ministry of Culture was asked for a comment.Wilson ChiloCristian Alberto Caballero Chacón says Consettur would welcome the competitionOutside on one of the side streets that are full of stalls offering tourism souvenirs, like fluffy alpacas and scarves, Dina Huillca is sitting on the pavement selling roses, tomatoes and mint. She travels from her village to get here, and says that \"more needs to be done for the local communities\".She adds: \"We don't have basic services like running water, or a hospital, and the schools need to be in better condition.\"Carlos González is president of the chamber of tourism for this region of Peru, the Department of Cusco. He wants to see more state oversight of public transport in Peru.\"We are pushing for an update in the law so that the vice ministry of tourism can take care of all the travel resources in our country,\" he says. \"If we don't have a unified approach to Peru as a destination we can't be competitive in the long term.\"He also wants to change tourists' experiences in Machu Picchu, with more entrances, and separate areas where different types of visitors can gather.\"[Such as] spiritual travellers going and having meditative rituals in one area,\" says Mr Gonzalez. \"And let's not forget the younger crowd who are more inclined to do their Tik Toks and their stories for Instagram. They also need a place for doing that and enjoying themselves in a young fashion.\"But he says that Peru's unstable national governments make change difficult. The country has had six different presidents in the past six years.\"I've been a leader of the tourism sector for five years now, and I have lost count of how many ministers, vice ministers and congress people I have spoken to.\"Back in Aguas Calientes, Mr Caballero says he'd be happy to see both Consettur and San Antonio de Toronto run buses to and from Machu Picchu.\"If they are given the final approval we don't have a problem with working with them. We won't stop them.\"Read more global business and tech stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Machu Picchu hit by a row over tourist buses",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ed66/live/70165840-c619-11f0-934b-cf5196b3cbea.jpg"
      ],
      "datePublished": "2025-11-24T00:06:53.000Z",
      "dateModified": "2025-11-24T00:06:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Volodymyr Zelensky warns against giving away territory to Russia, as latest Ukraine talks end",
    "url": "https://www.bbc.com/news/articles/cpd6qd10l94o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6535/live/e23134e0-c98e-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-25T01:06:36.000Z",
    "description": "Zelensky welcomes amendments to proposed peace plan3 hours agoLaura GozziandPatrick JacksonRubio hails 'most productive day' of negotiations with Ukra",
    "body": "Zelensky welcomes amendments to proposed peace plan3 hours agoLaura GozziandPatrick JacksonRubio hails 'most productive day' of negotiations with UkraineUkrainian President Volodymyr Zelensky has welcomed proposed changes to the controversial 28-point peace plan for ending the war with Russia.  It appears Ukraine's European allies produced an amended version of the plan after rejecting parts which favoured Russia's war aims.\"Now the list of necessary steps to end the war can become doable...\" Zelensky said on Telegram. \"Many correct elements have been incorporated into this framework.\" Later, in the early hours of Tuesday, Kyiv's mayor Vitali Klitschko said a wave of Russian missile and drone attacks hit an apartment building in the capital and disrupted electricity and water supplies.Ukraine's Ministry of Energy also confirmed a \"massive, combined enemy attack\" on the country's energy infrastructure facilities.\"Energy officials will begin assessing the consequences and restoration work as soon as the security situation permits,\" it said in a statement.US and Ukrainian officials met in Geneva on Sunday to discuss the plan, drafted by American and Russian officials in October, which had caused consternation in Kyiv and among its European allies. Russian representatives did not take part in the meeting in Switzerland. A Kremlin official rejected the amendments on Monday as \"completely unconstructive\". In another development, White House press secretary Karoline Leavitt insisted that the Trump administration was not favouring Russia in its efforts to end the war.\"The idea that the United States of America is not engaging with both sides equally in this war to bring it to an end is a complete and total fallacy,\" she told reporters.President Donald Trump was \"hopeful and optimistic\" that a plan could be worked out for ending the war, Leavitt added.Following the end of the talks in Geneva, Trump suggested on social media that \"something good just may be happening\" but added: \"Don't believe it until you see it.\"In Geneva, the talks began with US Secretary of State Marco Rubio having to deny the 28-point plan advocated by Trump had been written by the Kremlin, as several of its elements seemed heavily geared towards Moscow's longstanding demands.Zelensky said on Monday evening that the revised plan was \"truly the right approach\". \"The sensitive issues, the most delicate points, I will discuss with President Trump,\" he added, without saying when.According to an official in Zelensky's office, the 28-point plan leaked on Friday no longer existed. Speaking to the Financial Times, Ukraine's First Deputy Foreign Minister, Sergiy Kyslytsa, who attended the weekend talks in Geneva, said the latest plan consisted of just 19 points, with some of the most politically sensitive elements, including territorial concessions, now due to be decided by the leaders themselves.A virtual \"coalition of the willing\" meeting of Ukraine's European allies will take place on Tuesday to discuss developments, UK Prime Minister Sir Keir Starmer announced.There was, he said, still work to do for a \"just and lasting peace\" in Ukraine.In Moscow, Kremlin foreign policy aide Yuri Ushakov told reporters: \"The European plan, at first glance... is completely unconstructive and does not work for us.\"Zelensky said earlier on Monday that the \"main problem\" remained Putin's demand for legal recognition of territory Russia had taken.Comments by Trump which suggested Ukraine had until 27 November to accept the deal or risk losing US support created a sense of urgency across Europe on Friday, and talks between Ukraine and US officials were hastily convened.The counter-proposals - reportedly drafted by the UK, France and Germany - excluded any recognition of Russian-held regions, raised Ukraine's permitted army size, and left the door open to Ukraine joining Nato. Russia has consistently demanded full Ukrainian withdrawal from the whole of the eastern Donbas, made up of Donetsk and Luhansk regions. It also controls Crimea and large parts of two other regions, Kherson and Zaporizhzhia.  Tens of thousands of soldiers and thousands of civilians have been killed or injured, and millions of people have fled their homes, since Russia's full-scale invasion began nearly four years ago.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Volodymyr Zelensky warns against giving away territory to Russia, as latest Ukraine talks end",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6535/live/e23134e0-c98e-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-25T01:06:36.000Z",
      "dateModified": "2025-11-25T01:06:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'We worry more about food' say Venezuelans living under threat of US military action",
    "url": "https://www.bbc.com/news/articles/c3e0jnww2e9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/723a/live/572f0fe0-c6f3-11f0-a863-434ee92aa5e3.jpg",
    "tag": "World",
    "date": "2025-11-23T00:02:59.000Z",
    "description": "2 days agoNicole Kolsterin CaracasBBCLike Alejandro Orellano, many Venezuelans say they are more worried about their personal finances than about a US",
    "body": "2 days agoNicole Kolsterin CaracasBBCLike Alejandro Orellano, many Venezuelans say they are more worried about their personal finances than about a US invasionWhile Nicolás Maduro's government lives on edge under a military threat from US President Donald Trump, ordinary Venezuelans spend their time trying to figure out what to eat each day.It's Wednesday morning at Quinta Crespo, a popular market in downtown Caracas. Here, a possible escalation of the conflict is not the main concern of Venezuelans, who glance at the news while checking their wallets to find enough cash to pay.\"There's not going to be an intervention, nothing like that. What's really troubling us is the rise of the dollar,\" Alejandro Orellano tells BBC Mundo as he savours a coffee, waiting for customers who never seem to arrive.In the past weeks, Trump's government has deployed thousands of troops and military assets to within striking distance of Venezuela, including the world's largest warship. On Saturday, at least four international airlines cancelled flights into or out of the country after a Friday notice from US aviation authorities warned of \"heightened military activity in or around Venezuela\".This comes after a series of US airstrikes against alleged drug boats in the Caribbean and eastern Pacific killed more than 80 people.It's part of a broader effort the administration says is necessary to stem the flow of narcotics into the US, but Maduro insists the sabre-rattling is designed to push him out of office.In the streets of Caracas, daily life continues while the government tells the population that they must be ready for a US invasionAlejandro downplays the rhetoric between Washington and Caracas.He's been selling vegetables in this market for five years. \"Look, look how empty this is,\" he insists, pointing to a long, lonely aisle full of fresh fruits and vegetables.A Christmas carol plays, but the festive atmosphere feels overshadowed.The common enemy of the people is here: the sharp rise in food prices and the lack of purchasing power. In part, this is due to the rapid depreciation of the bolívar, which will have lost 80% of its value this year, according to International Monetary Fund (IMF) figures.A kilo of chicken, for example, costs about four times the official monthly minimum wage. And although the government offers bonuses to retirees and public workers, the money is still not enough to cover the basic food basket.Consuelo, 74, is sceptical about an armed conflict with the US and says Venezuelans cannot afford to stock food in preparation for a war.\"Let whatever happens happen! And that's it!\" she tells the BBC, adding that worrying about the spectre of war doesn't help much.\"Is it true? Is it false? That just makes you sick, walking around nervous, it's better to stay calm. Emotions can also affect your health,\" continues this retired university professor who still works.\"I haven't done any panic buying; you need a lot of money to do that.\"Two economists living in Venezuela consulted by the BBC for this report preferred not to comment for fear of government reprisals.\"Inflation has reached levels of around 20% monthly,\" another expert who requested anonymity pointed out.The IMF projects a 548% price increase this year and says it will be worse in 2026, when it could soar to 629% - the highest figure on the continent.Others see a potential US intervention as an opportunity for regime change but are afraid to speak openly about it.\"We're scared, silent, afraid they'll throw us in jail. I used to post things, but not anymore - I shouldn't - because I don't know who might turn me in,\" a merchant from Ciudad Bolívar (in Bolívar state, south) tells the BBC by phone.\"There's hope, faith, but people are quiet out of fear. You don't hear anyone talking about it; it's just at home, with your family, but there's a hint of joy,\" says the woman anonymously.Consuelo says that uncertainty also makes Venezuelans nervousMuch of society avoids speaking openly about issues that could be sensitive for Maduro's government, after a wave of arrests followed anti-government protests over the disputed 2024 presidential elections, which have been widely rejected by the international community. The opposition and many countries, including the US, rejected the result and recognised opposition candidate Edmundo González as the legitimate president-elect.After the elections, more than 2,000 people were arrested, official figures show. At present, 884 individuals remain in prison for political reasons, according to the non-governmental organisation Foro Penal.Barbara Marrero, a 40-year-old pastry chef, says: \"We're all waiting for something to happen because it's fair and necessary. We've been living in absolute misery for years.\"Venezuelans live day by day waiting for something to happen, but everyone is afraid [to speak] and nobody says anything.\"Esther Guevara, 53, who works in a medical lab, doesn't hide her concern amid tensions over the US naval fleet deployment.\"I'm worried because I don't really know what's happening - they might invade, strike… people think it will be ok, but this is serious,\" she says. \"A lot of innocent people could die.\"\"I feel like something's cooking out there, but I'm waiting,\" she adds.Javier Jaramillo also does not believe that an attack on Venezuela is imminentIt's now midday.Everything goes on as usual along a busy boulevard in eastern Caracas. Street vendors pushing sales. Pedestrians coming and going.There's Javier Jaramillo, 57, looking for goods to resell at Christmas. He's curious about the USS Gerald R Ford, the aircraft carrier Washington moved to the Caribbean.\"I don't think that attack will happen. I think there could be dialogue, an agreement, or a deal.\"Still, he says that when there are power cuts, he thinks: \"'They've come in,' 'They're going to come in.'\"Trump has suggested he is open to a diplomatic dialogue with Maduro, but also said he would not rule out military action.Either way, Javier repeats: \"We're more worried about food. Venezuela is in bad shape. Inflation is eating us alive.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'We worry more about food' say Venezuelans living under threat of US military action",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/723a/live/572f0fe0-c6f3-11f0-a863-434ee92aa5e3.jpg"
      ],
      "datePublished": "2025-11-23T00:02:59.000Z",
      "dateModified": "2025-11-23T00:02:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What is Cartel de los Soles, which the US is labelling a terrorist organisation?",
    "url": "https://www.bbc.com/news/articles/cy8j4ye5x0mo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e0c1/live/69271a70-8a81-11f0-b4ed-15140726731b.jpg",
    "tag": "World",
    "date": "2025-11-24T16:24:23.000Z",
    "description": "12 hours agoBBC MundoGetty ImagesThe US says the cartel is led by members of Venezuela's military but Venezuela's government has dismissed the allegat",
    "body": "12 hours agoBBC MundoGetty ImagesThe US says the cartel is led by members of Venezuela's military but Venezuela's government has dismissed the allegations as a 'ridiculous lie'The United States has designated the Cartel de los Soles (Spanish for Cartel of the Suns) - a group it alleges is headed by Venezuela's president, Nicolás Maduro, and senior figures in his government - as a foreign terrorist organisation. Labelling an organisation as a terrorist group gives US law enforcement and military agencies broader powers to target and dismantle it.In recent months, the US has been ramping up pressure on Maduro, saying his government is illegitimate following last year's election, which was widely dismissed as rigged. The designation gives it another way to turn up the heat.But questions have been raised as to whether Cartel de los Soles actually exists and Venezuela's foreign ministry has \"categorically, firmly, and absolutely rejected\" the designation, which it describes as a \"new and ridiculous lie\".Not surprisingly, Venezuela's interior and justice minister, Diosdado Cabello, has long called it an \"invention\".Cabello, who is alleged to be one of the high-ranking members of the cartel, has accused US officials of using it as an excuse to target those they do not like.\"Whenever someone bothers them, they name them as the head of the Cartel de los Soles,\" he said in August.Gustavo Petro, the left-wing president of Venezuela's neighbour, Colombia, has also denied the cartel's existence.\"It is the fictional excuse of the far right to bring down governments that do not obey them,\" he wrote on X in August. But the US state department is adamant that the Cartel de los Soles not only exists but that it has \"corrupted Venezuela's military, intelligence, legislature, and judiciary\". Experts consulted by the BBC say the truth lies somewhere in between.Getty ImagesThe US government alleges that Nicolás Maduro leads the Cartel de los SolesThe term Cartel de los Soles first emerged in the early 1990s.It was coined by the Venezuelan media in the wake of drug-trafficking allegations against a general in charge of counter-narcotic operations in Venezuela's National Guard and referred to the sun-shaped insignia worn by generals on their epaulettes to indicate their rank.Mike LaSusa, an expert in organised crime in the Americas who is deputy content director at Insight Crime, says the moniker soon started to be used for all Venezuelan officials with alleged links to drug trafficking, regardless of whether those officials were part of the same organisation.Getty ImagesThe name \"soles\" (suns) comes from the sun-shaped insignia worn by Venezuelan generals on their uniforms.Raúl Benítez-Manau, an organised crime expert from Mexico's UNAM university, says the group's activities started in the late 1980s and early 1990s in response to developments in neighbouring Colombia, the world's largest producer of cocaine. At the time, the powerful Medellín Cartel, based in the Colombian city of the same name, was being dismantled and a major counter-narcotics offensive in the country was bearing fruit.As established smuggling routes came under pressure, Mr Benítez-Manau argues, the Cartel de los Soles began providing alternative ways to transport cocaine from Colombia. It then strengthened during the early years of the presidency of Hugo Chávez, the left-wing president who led Venezuela from 1999 to his death in 2013, he says.\"Chávez liked to challenge the United States, and cut all military co-operation ties between the Venezuelan army and the US,\" he explains.Without the oversight of the US Drug Enforcement Administration (DEA), \"some [Venezuelan] army officers felt free to do business with criminals\", Mr Benítez-Manau says. Chávez's sympathies with Colombia's left-wing Farc guerrillas - which financed themselves largely through cocaine smuggling - were another factor in re-routing some drug trafficking through Venezuela, he says. Facing military pressure at home, the guerrilla group moved some operations into Venezuela, safe in the knowledge that the Venezuelan president \"saw them as leftist ideological allies\", Mr Benítez-Manau explains. Wesley Tabor, a former DEA agent who worked in Venezuela, says the Farc not only found \"a safe haven in Venezuela\" but also many government officials, \"from street-level police to the military aviation\", soon became their partners in drug trafficking. Together, they \"began flooding the US with hundreds of tonnes of cocaine\", he says.ReutersFormer intelligence chief Hugo Carvajal pleaded guilty to drug trafficking and narco-terrorism charges in the USThe Cartel de los Soles, then, differs from other drug networks in that it lacks a formal structure,  says Mr LaSusa.It is not a group per se, he says, but rather \"a system of widespread corruption\".He adds it has been fuelled by the economic crisis that has engulfed Venezuela under President Chávez's successor in office, Nicolás Maduro. \"The Maduro regime cannot offer security forces a decent salary and, to keep their loyalty, it allows them to accept bribes from drug traffickers,\" Mr LaSusa explains.Mid- and lower-ranking officers who control Venezuela's key entry and exit points, such as airports, make up the Cartel de los Soles, Mr Benítez-Manau says, as they are in prime position to facilitate the flow of drugs.But US officials are adamant that the tentacles of the Cartel de los Soles reach to the highest levels of the Maduro government, including the president himself. In 2020, the US justice department accused Maduro and 14 others of conspiring with armed Colombian groups to ship cocaine to the United States. Among the high-ranking officials named were Defence Minister Vladimir Padrino and the former head of Venezuela's Supreme Court, Maikel Moreno. In the indictment, US prosecutors also alleged that since at least 1999, the Cartel de los Soles was led and administered by Maduro, Interior Minister Diosdado Cabello, former military intelligence chief Hugo Carvajal, and former General Clíver Alcalá.They say information provided by former high-ranking Venezuelan military officials - including Carvajal and Alcalá - backs this up.Leamsy Salazar, a former security chief for the late Hugo Chávez, provided US officials with information about the Cartel de los Soles as early as 2014.Salazar, who had left Venezuela with the help of the DEA, said Interior Minister Cabello led the Cartel de los Soles.Cabello denied the allegation, arguing it was part of an \"international conspiracy\". But the accusations from former Venezuelan officials kept coming. In 2020, Gen Alcalá handed himself in to DEA agents after falling out with the Maduro government, and pleaded guilty to providing support to the Farc and their cocaine-trafficking operations. Earlier this year, former Venezuelan spymaster Carvajal - who also fled Venezuela after disagreeing with Maduro - pleaded guilty in a US court, as well, to charges of drug-trafficking and narco-terrorism. \"Over the years, he and other officials in the Cartel de los Soles used cocaine as a weapon, flooding New York and other US cities with poison,\" a federal prosecutor  said about Carvajal, known as \"El Pollo\" (The Chicken), during the trial.Getty ImagesThe US is also offering a reward for information leading to the arrest of President Maduro and Interior Minister Diosdado CabelloMaduro and Interior Minister Cabello remain in Venezuela but the US recently upped its rewards for information leading to their capture to $50m (£38m) and $25m respectively.The BBC contacted the Venezuelan government for comment on the US allegations but did not receive a response before publication.However, the Maduro government has long dismissed the drug-trafficking accusations levelled against it as an attempt by the US to justify ousting Maduro.In a statement released on Monday, the Venezuelan foreign ministry called the designation of the Cartel de los Soles as a terrorist organisation \"a ridiculous fabrication\".It insisted the Cartel de los Soles was \"non-existent\" and that the move was a \"vile lie to justify an illegitimate and illegal intervention against Venezuela\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What is Cartel de los Soles, which the US is labelling a terrorist organisation?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e0c1/live/69271a70-8a81-11f0-b4ed-15140726731b.jpg"
      ],
      "datePublished": "2025-11-24T16:24:23.000Z",
      "dateModified": "2025-11-24T16:24:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reggae legend Jimmy Cliff dies, aged 81",
    "url": "https://www.bbc.com/news/articles/cj4qdren425o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bf37/live/8afb7b10-c932-11f0-87d3-29ee3cbe1b34.jpg",
    "tag": "World",
    "date": "2025-11-24T13:04:31.000Z",
    "description": "15 hours agoMark SavageMusic correspondentGetty ImagesJimmy Cliff's hits included Many Rivers To Cross, Wonderful World, Beautiful People and You Can ",
    "body": "15 hours agoMark SavageMusic correspondentGetty ImagesJimmy Cliff's hits included Many Rivers To Cross, Wonderful World, Beautiful People and You Can Get It If You Really WantJimmy Cliff, one of the most prominent and beloved proponents of reggae music, has died at the age of 81.A star since the 1960s, he helped to bring the sound of Jamaica to a global audience through hits such as Wonderful World, Beautiful People and You Can Get It If You Really Want.His lead role as a gun-toting rebel in the 1972 crime drama The Harder They Come is a cornerstone of Jamaican cinema, and was attributed as the movie that brought reggae to America.Cliff's wife, Latifa Chambers, announced his death via a statement on Instagram.\"It's with profound sadness that I share that my husband, Jimmy Cliff, has crossed over due to a seizure followed by pneumonia,\" she wrote.\"I am thankful for his family, friends, fellow artists and coworkers who have shared his journey with him. \"To all his fans around the world, please know that your support was his strength throughout his whole career.\"Jimmy, my darling, may you rest in peace. I will follow your wishes.\" Her message was also signed by their children, Lilty and Aken.Getty ImagesBorn James Chambers in 1944, Cliff grew up as the eighth of nine children in abject poverty in the parish of St. James, Jamaica.Blessed with a sweet, mellifluous voice, he began singing at his local church at the age of six.He was inspired to write his own material when he heard ska pioneer Derrick Morgan on the radio - and asked his woodwork teacher how one might go about composing their own song. “He told me, ‘You just write it!’“ he told Mojo magazine. ”So I went ahead and… wrote a song called I Need A Fiancée, another called Sob Sob and I made a guitar out of bamboo to accompany myself.”By the time he was 14, he'd moved to Kingston and adopted the surname Cliff to express the heights he intended on reaching.He recorded a handful of singles before topping the Jamaican charts with his own composition, Hurricane Hattie. In 1965, he relocated to London to work with Island Records - later the home of Bob Marley - but the label's attempts to make his sound palatable to rock audiences were initially unsuccessful.He eventually struck gold with the 1969 single Wonderful World, Beautiful People - an upbeat, feelgood anthem; and the more politically-charged Vietnam, which Bob Dylan called \"the best protest song ever written\".Its lyric tells the story of a young soldier who writes from the war, promising his mother he'll be home soon; only for her to receive a telegram the next day, informing her of his death.Cliff reflected on the song in 1986, telling reggae archivist Roger Steffens: \"The essence of my music is struggle. What gives it the icing is the hope of love.\"Getty ImagesThe Harder They Come had to be subtitled in the US because of the character's thick Jamaican patoisThe musician became an international star with The Harder They Come, expressly written for the movie of the same name, in which he played Ivan Martin, a young man trying to break into Jamaica's corrupt music industry.\"The film opened the door for Jamaica,\" Cliff recalled. \"It said, 'This is where this music comes from.'\"BBC Sounds: Witness - Jimmy Cliff on The Harder They ComeBBC 6 Music: The First Time with Jimmy CliffCliff contributed four songs to the soundtrack, including the gospel hymn Many Rivers To Cross, which reflected his early days as a struggling artist in the UK.\"I was still in my teens,\" he later recalled. \"I came full of vigour: I'm going to make it, I'm going to be up there with the Beatles and the Stones.\"\"And it wasn't really going like that, I was touring clubs, not breaking through. I was struggling, with work, life, my identity. I couldn't find my place. Frustration fuelled the song.\"Instead, the film and its soundtrack won him international acclaim. Rolling Stone magazine even named it one of their top 500 albums of all time.During the 1980s, he collaborated with the Rolling Stones on their Dirty Work album, and he returned to the US charts in 1993 with his cover of I Can See Clearly Now, from the soundtrack for Cool Runnings, which followed the escapades of Jamaica's bobsled team.His other recordings included the Grammy Award-winning albums Cliff Hanger (1985) and Rebirth (2012), a nostalgic return to form.Cliff entered the Rock and Roll Hall of Fame in 2010, calling it \"a great thrill and an honour\".Inducting him, Fugees star Wyclef Jean said he'd been inspired by Cliff's success as a young boy growing up in Haiti.\"When we saw Jimmy Cliff, we saw ourselves,\" he said.Cliff continued to tour late into his life, playing Glastonbury's legends slot in 2003; and winning over a new generation of fans at the 2010 Coachella Festival.His contributions to Jamaican music and culture were recognised in October 2003 when he was awarded the country's prestigious Order of Merit.But the singer said his connection to fans was more important than any of the other honours bestowed upon him.Speaking to US radio station NPR in 2012, he reflected: \"When someone comes up to me and says, 'I was a dropout in school and I heard your song You Can Get It If You Really Want, and that song made me go back to school, and now I am a teacher and I use your song with my students' - that, for me, is a big success.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reggae legend Jimmy Cliff dies, aged 81",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bf37/live/8afb7b10-c932-11f0-87d3-29ee3cbe1b34.jpg"
      ],
      "datePublished": "2025-11-24T13:04:31.000Z",
      "dateModified": "2025-11-24T13:04:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Belgian airports to be hit by strike over austerity",
    "url": "https://www.bbc.com/news/articles/c0jew0lyv98o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7081/live/bd82afe0-c95f-11f0-b163-d7d455ce68d3.jpg",
    "tag": "World",
    "date": "2025-11-24T18:04:45.000Z",
    "description": "10 hours agoCachella SmithandPatrick JacksonBelgium is bracing for widespread disruption across sectors including public transport and schools this we",
    "body": "10 hours agoCachella SmithandPatrick JacksonBelgium is bracing for widespread disruption across sectors including public transport and schools this week as unions hold a three-day national strike. The action was called in response to Prime Minister Bart De Wever's attempts to shrink Belgium's debt by changing labour laws and reforming unemployment benefits and pensions. Teachers, medical staff and rubbish collectors will all be joining the rolling industrial action which is set to end in a general strike on Wednesday.  Eurostar is among organisations warning of potential disruption, while the two main airports have advised customers that all departure flights will be cancelled on Wednesday.The country had already been hit by several strikes since de Wever, a Flemish nationalist, came to office in February at the head of a centre-right coalition government aiming to cut the budget deficit.  Early on Monday, his government reached a budget agreement which he said was the only way to \"guarantee the sustainability\" of Belgium's welfare state. The country's budget deficit stood at 4.5% of GDP at the end of last year with debt at 104.7% of GDP.EU budget rules stipulate that member states should keep their budget deficit below 3% and debt beneath 60% to maintain sound public finances.This week's industrial action is meant to unfold in three stages, AFP news agency notes: Trains and other public transport went on strike on Monday, with national railroad company SNCB expecting to run one or two out of three trains, and several Eurostar services linking Brussels to Paris cancelledOn Tuesday, public services such as schools, creches and hospitals join inOn Wednesday a full general strike covers all categories including the two main airports, Bruxelles-Zaventem and Charleroi.Warning of the effect of the strike action in Belgium, Eurostar reported that some of its other international services had suffered delays as a result.  Defending the action, general workers union FGTB said a demonstration in Brussels two weeks ago had been met with \"total silence\" from the government. Fair pensions is a core issue cited by the unions while other demands include a fair wealth tax, a tax on digital activities for tech giants and the transparent screening of subsidies to companies.A day of action against violence against women separately took place on Sunday which the FGTB said formed part of the current action.Bruxelles-Zaventem airport has said it expects \"major disruptions\" to operations on Wednesday with all departure flights cancelled and some cancellations also possible for incoming flights.The airport said that staff from their security and handling service provider were expected to be participating in the national industrial action.Charleroi airport has similarly said it will not be able to operate either scheduled departures or arrivals on the day of the general strike - as it also warned passengers of potential disruption on public service networks throughout the strike period.The City of Brussels has warned of \"disrupted services\" on its public transport links throughout the three days of action while transport company, De Lijn, which operates in Flanders has advised there will be \"fewer bus and tram services\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Belgian airports to be hit by strike over austerity",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7081/live/bd82afe0-c95f-11f0-b163-d7d455ce68d3.jpg"
      ],
      "datePublished": "2025-11-24T18:04:45.000Z",
      "dateModified": "2025-11-24T18:04:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "COP30 fire: BBC at the scene of 'intense' blaze",
    "url": "https://www.bbc.com/news/videos/cn5159k1krzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f1e6/live/d697fe90-c63f-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-20T21:58:46.000Z",
    "description": "The UN climate talks COP30 have been evacuated due to a fire breaking out inside the venue in Belém, Brazil.BBC journalists including Climate Editor J",
    "body": "The UN climate talks COP30 have been evacuated due to a fire breaking out inside the venue in Belém, Brazil.BBC journalists including Climate Editor Justin Rowlatt saw flames and smoke in the pavilion area before they were rushed outside.The UN said the fire was extinguished after six minutes and 13 people were treated for smoke inhalation. It is not yet known what caused the blaze.More on this story.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "COP30 fire: BBC at the scene of 'intense' blaze",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f1e6/live/d697fe90-c63f-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-20T21:58:46.000Z",
      "dateModified": "2025-11-20T21:58:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Watch: Indonesia’s Semeru volcano spews giant ash clouds as it erupts",
    "url": "https://www.bbc.com/news/videos/clyzy88l87no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/55e2/live/92ceee00-c5b6-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-20T02:24:49.000Z",
    "description": "The highest mountain on Indonesia's Java Island, a volcano called Mount Semeru, has erupted, spewing gigantic columns of ash clouds as tall as 2km (1.",
    "body": "The highest mountain on Indonesia's Java Island, a volcano called Mount Semeru, has erupted, spewing gigantic columns of ash clouds as tall as 2km (1.2 miles) above its peak.Large plumes of smoke can be seen engulfing a bridge and spreading across the surrounding countryside, stopping locals in their tracks.CCTV footage showed a pyroclastic flow – a fast-moving avalanche of hot gas, ash and volcanic rock – billowing from the mountain, with a distance of 7km from the summit.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Watch: Indonesia’s Semeru volcano spews giant ash clouds as it erupts",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/55e2/live/92ceee00-c5b6-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-20T02:24:49.000Z",
      "dateModified": "2025-11-20T02:24:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nasa astronaut films the Northern Lights from space",
    "url": "https://www.bbc.com/news/videos/c15733pqy48o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/10a0/live/eca84aa0-c801-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-23T01:05:41.000Z",
    "description": "Nasa astronaut Zena Cardman captured the glow of the Northern Lights, or aurora borealis, from above on the 17 November while aboard the International",
    "body": "Nasa astronaut Zena Cardman captured the glow of the Northern Lights, or aurora borealis, from above on the 17 November while aboard the International Space Station. \"I've still never seen the aurora from below, but up here, it's a frequent show,\" she said. Cardman is serving as commander for Nasa's SpaceX Crew-11 mission, which left Earth on 1 August, according to Nasa. She has encouraged viewers of the footage to look for Houston and Florida while watching.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nasa astronaut films the Northern Lights from space",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/10a0/live/eca84aa0-c801-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-23T01:05:41.000Z",
      "dateModified": "2025-11-23T01:05:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]