[
  {
    "title": "Three French teens drown in freak car crash in swimming pool",
    "url": "https://www.bbc.com/news/articles/c1m8g5x1xmko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6bf2/live/ae65b850-d048-11f0-b603-bde662ca3d72.jpg",
    "tag": "World",
    "date": "2025-12-03T13:09:48.000Z",
    "description": "Three French teens drown after car crashes upside down in swimming pool1 day agoLaura GozziAFPFirefighters were called several hours after the acciden",
    "body": "Three French teens drown after car crashes upside down in swimming pool1 day agoLaura GozziAFPFirefighters were called several hours after the accident to remove the car from the pool (file pic)Three teenagers were killed when their car skidded off the road in southern France, went through a wall and crashed upside down in a private pool, trapping them inside. The vehicle was a similar size to the pool and the teenagers - aged 14, 15 and 19 - were unable to open the doors and drowned.The freak accident occurred in the town of Alès in the early hours of Wednesday. \"It's truly the height of horror,\" said public prosecutor Abdelkrim Grini. \"It wasn't the impact of the accident that killed them. They found themselves upside down in icy water, unable to get out. They had no chance.\" Unconfirmed reports suggest the youngest of the three victims was at the wheel of the car at the time.The accident, which happened during a night of heavy rain, was the result of an \"unbelievable series of circumstances,\" the prosecutor told AFP news agency.The prosecutor described how the car had smashed through a low-level garden wall, flipped over and landed \"with all four wheels in the air\".It was not for several hours that the alarm was raised and firefighters were called to drain the pool and remove the vehicle. BFMTV reported that the pool was about 1.5m (5ft) deep.A mangled car was pulled on to a firefighters' truck during the morning and video from the scene showed the private swimming pool next to the collapsed wall. Canisters of nitrous oxide were found in the car, according to French reports. The substance is used by recreational users as it can make people feel relaxed, light-headed or dizzy.An investigation has been opened into the cause of death. The three victims' bodies  have been taken to the forensic institute in Nîmes for post mortem examinations, AFP said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Three French teens drown in freak car crash in swimming pool",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6bf2/live/ae65b850-d048-11f0-b603-bde662ca3d72.jpg"
      ],
      "datePublished": "2025-12-03T13:09:48.000Z",
      "dateModified": "2025-12-03T13:09:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Is the US preparing for war with Venezuela?",
    "url": "https://www.bbc.com/news/videos/clyk1g9e144o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024xn/ichef.bbci.co.uk/images/ic/$widthxn/p0mkz3lc.jpg",
    "tag": "World",
    "date": "2025-12-01T20:07:42.000Z",
    "description": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch LiveMor",
    "body": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch LiveMore on this story.3 days agoVenezuelaDonald TrumpUnited States",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Is the US preparing for war with Venezuela?",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024xn/ichef.bbci.co.uk/images/ic/$widthxn/p0mkz3lc.jpg"
      ],
      "datePublished": "2025-12-01T20:07:42.000Z",
      "dateModified": "2025-12-01T20:07:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Drunk raccoon found passed out on liquor store floor after breaking in",
    "url": "https://www.bbc.com/news/articles/cy8jnxxm70jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6f8d/live/38da3f80-d0c4-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-12-03T23:28:26.000Z",
    "description": "Staff at a Virginia liquor store got a shock on Saturday when they came into work to find a raccoon had burgled the store, drinking its way through th",
    "body": "Staff at a Virginia liquor store got a shock on Saturday when they came into work to find a raccoon had burgled the store, drinking its way through the spirits section.The \"masked bandit\" was found passed out in the bathroom between the toilet and bin having helped itself to bottles on a bottom shelf.Animal control officer Samantha Martin transported the \"suspect\" for questioning at Hanover County Animal Protection and Shelter but not before it had a chance to sober up.After a few hours of sleep and zero signs of injury (other than maybe a hangover), the animal was safely released back into the wild.The Ashland ABC store had been closed for Thanksgiving when it suffered its \"Black Friday break-in\".When staff arrived on Saturday they found smashed bottles and liquor pooling on the floor, including its apparent tipple of choice, scotch. Officer Martin said the animal had fallen through one of the ceiling tiles before going \"on a full-blown rampage, drinking everything\". Only one blurry CCTV image of the boozy break-in exists, so it's unknown just how much alcohol the thirsty creature consumed before passing out in the bathroom.In a social media post, the store thanked Hanover County Animal Protection and Shelter for its professionalism and providing its visitor with a \"sober ride home\".Officer Martin said it was \"just another day in the life of an animal control officer\". ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Drunk raccoon found passed out on liquor store floor after breaking in",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6f8d/live/38da3f80-d0c4-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-03T23:28:26.000Z",
      "dateModified": "2025-12-03T23:28:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gaza: Five killed in Israeli air strikes on tents near Khan Younis, medics say",
    "url": "https://www.bbc.com/news/articles/cnv21m0zpjmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/241e/live/a82ae070-d087-11f0-9508-4b2ee64d533f.jpg",
    "tag": "World",
    "date": "2025-12-03T22:09:36.000Z",
    "description": "18 hours agoRushdi Abualouf,Gaza correspondentandPatrick JacksonFive Palestinians were killed, including two children, and several wounded when Israel",
    "body": "18 hours agoRushdi Abualouf,Gaza correspondentandPatrick JacksonFive Palestinians were killed, including two children, and several wounded when Israeli aircraft struck tents for displaced people west of Khan Younis, according to medics at the Kuwait Field Hospital.The strikes hit Gaza's coastal al-Mawasi area.Medical teams said the dead were two women aged 46 and 30, a 36-year-old man, and two boys, aged eight and 10.Some 32 injured people were treated in hospital, the medics said.Rescue workers told the BBC they recovered the bodies from al-Najaat camp, a cluster of tents that has housed hundreds of displaced people in recent months.The Israeli military said it had \"struck a Hamas terrorist\" after five of its soldiers were wounded earlier on Wednesday.\"The Hamas terrorist organization carried out a blatant violation of the ceasefire agreement, during which terrorists attacked IDF troops deployed in the Rafah area,\" the Israel Defense Forces said in a statement.Israeli Prime Minister Benjamin Netanyahu had vowed to \"respond accordingly\". Witnesses said the initial strike had targeted a tent inside the al-Mawasi displacement area, followed by blasts near the Kuwait hospital, prompting panic among families sheltering nearby.Hamas called Israel's action barbaric, indiscriminate and a violation of the ceasefire which began on 10 October.The Israeli military launched its offensive in Gaza in response to the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.More than 70,100 Palestinians have since been killed as a result of Israel's campaign, according to the territory's Hamas-run health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gaza: Five killed in Israeli air strikes on tents near Khan Younis, medics say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/241e/live/a82ae070-d087-11f0-9508-4b2ee64d533f.jpg"
      ],
      "datePublished": "2025-12-03T22:09:36.000Z",
      "dateModified": "2025-12-03T22:09:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South Korea: Government developing app showing real-time location of stalkers",
    "url": "https://www.bbc.com/news/articles/cp84y7jx2pzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a846/live/6a9f6d90-d0d5-11f0-8d4b-67d350470ae2.jpg",
    "tag": "World",
    "date": "2025-12-04T05:51:19.000Z",
    "description": "South Korean authorities are developing a mobile app for stalking victims to track in real-time the location of their stalkers, if they're nearby.The ",
    "body": "South Korean authorities are developing a mobile app for stalking victims to track in real-time the location of their stalkers, if they're nearby.The app, announced by South Korea's justice ministry on Wednesday, is part of an approved amendment to the country's electronic monitoring law.Stalkers have become a subject of public concern in South Korea, especially as high-profile crimes involving stalking have made headlines in recent years.Under the current law, stalking victims can receive text message alerts when their stalkers are nearby - though these do not reveal stalkers' exact locations.This makes it difficult for victims to determine the direction of the perpetrator, the justice ministry said in a statement.Under the revised law, victims will be allowed to see their stalker's location on a map with their smartphones, allowing them to evacuate to safety.Authorities track stalkers' whereabouts using wearable electronic devices.The justice ministry said it was also working on integrating the tracking system into the national emergency hotline, so police could be deployed to protect victims as needed.This integration is expected to be completed next year, local media reported.Critics have voiced concern over the pervasiveness of stalking in South Korea, which they see as part of a wider problem of violence against women - many of whom have been secretly filmed by spy cameras and faced hostile threats for being feminists.In 2022, public anger erupted over the murder of a young woman by her male ex-colleague, who had been stalking her for years. Although she had reported him to the police, he was not detained or given a restraining order as authorities viewed him as \"low risk\".In 2021, South Korea introduced an anti-stalking law that carries up to three years of jail for offenders and a maximum fine of 30 million Korean won ($20,400; £15,300).In 2023, South Korea's parliament revised the law to lower the barrier to prosecuting stalkers.The number of reports against stalkers have surged since then, from 7,600 in 2022 to more than 13,000 last year, according to data from the justice ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South Korea: Government developing app showing real-time location of stalkers",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a846/live/6a9f6d90-d0d5-11f0-8d4b-67d350470ae2.jpg"
      ],
      "datePublished": "2025-12-04T05:51:19.000Z",
      "dateModified": "2025-12-04T05:51:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cyclone Ditwah: Flood catastrophe awakens volunteerism in Sri Lanka",
    "url": "https://www.bbc.com/news/articles/c058n10727po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f9a7/live/eae8bde0-cfe4-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-12-03T00:34:05.000Z",
    "description": "Cyclone catastrophe in Sri Lanka awakens volunteer spirit2 days agoIshara Danasekara,News Editor, BBC News SinhalaandKoh EweWatch: Sri Lankan communit",
    "body": "Cyclone catastrophe in Sri Lanka awakens volunteer spirit2 days agoIshara Danasekara,News Editor, BBC News SinhalaandKoh EweWatch: Sri Lankan communities under water after catastrophic floodingSri Lankan actor and musician GK Reginold rides a motorised fishing boat through Colombo's suburbs, hoping to bring food and water to those in desperate need.Some of the families, Mr Reginold says, have not received aid for days, isolated by the South Asian island nation's worst weather disaster in recent years.Cyclone Ditwah lashed the country last week, bringing catastrophic floods and landslides that killed more than 460 people, left hundreds missing and damaged some 30,000 homes.But the deluge has also inspired volunteerism among its people, as they face what their president has described as the \"most challenging natural disaster\" in its history.\"The main reason why I wanted to do this, is to at least help them to have one meal,\" Mr Reginold tells the BBC. \"And I was so happy that I was able to do that.\"BBC SinhalaVolunteers have been taking fishing boats out to rescue flood victims and deliver aidMore than one million people have been affected by the disaster and President Anura Kumara Dissanayake has declared a state of emergency.Sri Lanka's military has deployed helicopters for rescue operations, while humanitarian aid is flowing in from foreign governments and non-governmental organisations.But it will be a long journey to recovery for Sri Lanka, which has seen its fair share of turmoil in recent years.Activists volunteer in community kitchenIn Colombo's Wijerama neighbourhood, activists who protested against former president Gotabaya Rajapaksa in 2022 are now helping run a community kitchen that churns out food aid.The protests from three years ago were fuelled by a spiralling economic crisis that caused shortages of fuel, food and medicine. Public anger exploded and led to Rajapaksa being ousted. Now, that political activism is being channelled to cyclone relief.\"Some volunteers came after work, some took turns and some even took leave to be there,\" Sasindu Sahan Tharaka, a social media activist, tells the BBC.\"We reactivated the group as soon as we heard what was happening last Thursday,\" he says.Sasindu Sahan TharakaAt a community kitchen in Wijerama, volunteers prepare meals for flood-affected residentsMr Sahan also considers the kitchen as an \"extension\" of his volunteer work in 2016, when torrential rain and floods killed 250 people across the country.Volunteers have compiled hundreds of requests for help, sent it to authorities, and organised the distribution of food to residents, Mr Sahan says.\"Whatever we asked for, we got more than enough in response from the community,\" he says.Online campaigns for aidA flurry of activity is also happening online, where social media users have created a public database to direct donations and volunteers.Another volunteer-backed website helps donor find relief camps and what is most needed in those areas.Private companies have organised donation drives, while local television channels have launched an effort to provide food and basic necessities like soap and toothbrushes.Facing criticism over his handling of preparations for Cyclone Ditwah, President Dissanayake has urged Sri Lankans to \"set aside all political differences\" and \"come together to rebuild the nation\".Opposition politicians have accused authorities of ignoring weather warnings, which they say exacerbated the disaster's impact.On Monday, opposition lawmakers staged a walkout in parliament, claiming that the ruling party was trying to limit debate on the disaster.On the ground, however, there remains a sense of unity as Sri Lankans pick up the pieces after the floods.\"In the end, the joy of helping someone else to save lives makes that tiredness fade,\" Mr Sahan wrote in a Facebook post on Monday, after putting in long hours at the community kitchen in Wijerama and other relief sites.\"Disasters are not new to us. But, the empathy and capacity of our hearts is greater than the destruction that occurs during a disaster.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cyclone Ditwah: Flood catastrophe awakens volunteerism in Sri Lanka",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f9a7/live/eae8bde0-cfe4-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-03T00:34:05.000Z",
      "dateModified": "2025-12-03T00:34:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Court sides with Adidas in appeal over Kanye West collaboration",
    "url": "https://www.bbc.com/news/articles/cqjg7w8z7dvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/87b5/live/a706d300-d0ac-11f0-b487-79c943b69f96.jpg",
    "tag": "World",
    "date": "2025-12-04T02:51:49.000Z",
    "description": "13 hours agoOsmond ChiaBusiness reporterAdidas has fended off an appeal from shareholders who accused it of hiding misconduct by rapper-entrepreneur K",
    "body": "13 hours agoOsmond ChiaBusiness reporterAdidas has fended off an appeal from shareholders who accused it of hiding misconduct by rapper-entrepreneur Kanye West - otherwise known as Ye - before their partnership broke down in 2022.A San Francisco court said the sportswear giant did not mislead investors, who claimed they had lost money after Adidas shares plunged when it cut ties with West.The Yeezy tie-up with West had been one of Adidas' most successful partnerships, but its collapse after a spate of anti-Semitic comments by the rapper cost the brand hundreds of millions of dollars.The BBC has contacted Adidas for comment but could not reach the firm leading the class action or West's team.West, who is not party to the lawsuit, was widely criticised after repeatedly making antisemitic remarks and promoting conspiracy theories.His Yeezy brand collaboration with Adidas was put under review after he showed a \"White Lives Matter\" T-shirt design at a fashion show in 2022. Shortly after, he posted anti-Semitic comments online, which prompted Adidas to pull his products from sale.West's behaviour also prompted several companies, including Gap and JP Morgan, to sever ties with the rapper.Court documents filed on Wednesday show that HLSA-ILA Funds, the firm representing investors, alleged that Adidas continued its partnership with West despite knowing about his controversial conduct for years.The filing claims Adidas \"internally grappled\" with West's behaviour but misled shareholders by failing to disclose the risk in its reports.The 9th US Circuit Court of Appeals in San Francisco ultimately sided with Adidas. The court said on Wednesday that a reasonable investor would know that a partnership with a celebrity like West could come with \"inherent risks relating to improper behaviour\".A district court had previously dismissed HLSA-ILA's case, and the firm later appealed.The collapse of Adidas' partnership with West caused the German firm's share price to tank in 2023.Yeezy, luxury trainers designed by West, had been a particularly lucrative line of products for Adidas, generating around €1.5bn (£870m; $1.17bn) in sales in 2021.The partnership breakdown left Adidas with more than €1bn worth of Yeezy shoes sitting in storage. In 2023, the brand announced that it would sell those products and donate some of the proceeds to charities who worked on combating hate.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Court sides with Adidas in appeal over Kanye West collaboration",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/87b5/live/a706d300-d0ac-11f0-b487-79c943b69f96.jpg"
      ],
      "datePublished": "2025-12-04T02:51:49.000Z",
      "dateModified": "2025-12-04T02:51:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Henry Cuellar: Trump says he is pardoning Democratic congressman in bribery case ",
    "url": "https://www.bbc.com/news/articles/c62v9z7z1z2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6c42/live/1aeb9550-d060-11f0-b76c-637a0d75f572.jpg",
    "tag": "World",
    "date": "2025-12-03T17:29:02.000Z",
    "description": "23 hours agoSakshi VenkatramanUS reporterGetty ImagesCongressman Henry Cuellar was criminally charged last year US President Donald Trump has said he ",
    "body": "23 hours agoSakshi VenkatramanUS reporterGetty ImagesCongressman Henry Cuellar was criminally charged last year US President Donald Trump has said he will pardon Democratic congressman Henry Cuellar, who was charged last year with accepting around $600,000 (£478,000) in bribes. On social media, Trump said he would issue a \"full and unconditional\" pardon of the Texas representative and his wife, Imelda Cuellar, who was also charged in the case.\"Henry, I don't know you, but you can sleep well tonight - Your nightmare is finally over!\" the president, a Republican, wrote. He added that he thought Cuellar was charged by former President Joe Biden because he \"bravely spoke out against Open Borders\". Cuellar and his wife, who posted bail after they were charged, maintain their innocence. On Wednesday morning Cuellar filed for re-election as a Democrat, scotching speculation that he might be poised to switch parties and pad the Republicans' narrow majority in the House.Biden's Department of Justice had alleged that Cuellar, who has been representing Texas' 28th congressional district since 2005, illicitly received money from an Azerbaijani government-owned oil company and a Mexican bank.The indictment alleged that, in exchange for the money, Cuellar agreed to influence US foreign policy in favour of Azerbaijan - and to advocate for measures that would benefit the Mexico City bank.Companies owned by Imelda Cuellar allegedly laundered the money, which the family used to pay off debts and make purchases.Among them was $58,000 (£46,000) in credit card payments, $18,000 at wholesale stores and $12,000 for a custom gown, the indictment said.The couple faced charges of conspiracy, bribery, wire fraud, money laundering and violating a ban on acting as agents of a foreign organisation.Though he's a Democrat, Cuellar's politics sit to the right of many members of his party. He's been called the \"last pro-life Democrat\" for his moderate stance on abortion. \"My faith is clear: abortion must be rare and safe,\" he has said in the past. In a letter to Trump, Cuellar's daughters also said they believe their father's stance on immigration may have led to his arrest. They wrote that their father believed in \"securing the border\" and that his \"independence and honesty\" may have been the reason behind his indictment. Trump seemed to agree, saying on Truth Social that Biden \"went after the Congressman, and even the Congressman's wonderful wife, Imelda, simply for speaking the TRUTH\".This is Trump's third act of clemency this week. He pardoned Juan Orlando Hernández, the former president of Honduras, who was found guilty in March 2024 of conspiring to import cocaine to the US, and of possessing machine guns.On Monday, Trump also commuted the sentence of former investment manager David Gentile, who was just days into a seven-year prison sentence for fraud.So far in his second term, the president has pardoned or commuted the sentences of multiple people convicted of various types of fraud or financial crimes. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Henry Cuellar: Trump says he is pardoning Democratic congressman in bribery case ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6c42/live/1aeb9550-d060-11f0-b76c-637a0d75f572.jpg"
      ],
      "datePublished": "2025-12-03T17:29:02.000Z",
      "dateModified": "2025-12-03T17:29:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Not becoming of a president': Somali-Americans respond to Trump's 'garbage' remarks",
    "url": "https://www.bbc.com/news/articles/c8dy1613j2ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d371/live/12887980-d08f-11f0-9508-4b2ee64d533f.jpg",
    "tag": "World",
    "date": "2025-12-04T05:22:42.000Z",
    "description": "11 hours agoBrandon DrenonAj AwerAj Awer, of the Cedar-Riverside Community Council, says Trump's comments were \"dangerous\"Somali-Americans in Minnesot",
    "body": "11 hours agoBrandon DrenonAj AwerAj Awer, of the Cedar-Riverside Community Council, says Trump's comments were \"dangerous\"Somali-Americans in Minnesota have described their heightened fear after US President Donald Trump intensified his criticism of the community this week.Community leaders told the BBC the \"apprehension is palpable\" following Trump's remarks, in which he said he did not want Somalis in the US and the country would \"go the wrong way if we keep taking in garbage\".\"When you're being targeted by the president of the United States, it's not really a good feeling,\" said Aj Awed, executive director of the Cedar-Riverside Community Council, which represents a town known as Little Mogadishu for its large Somali population.Concern has also intensified because of reports that officials have begun an enforcement operation in Minnesota targeting undocumented immigrants.Mr Awed said the council would discuss the risks of holding an annual event scheduled for next week in-person because of the operation.\"The people that are getting caught up in this are people who don't speak that great of English, but who have been citizens for decades,\" he said. \"Just because you have an accent does not make you less American.\"Trump made disparaging comments criticising the Somali community at the White House on Tuesday. \"I don't want them in our country, I'll be honest with you… their country is no good for a reason,\"he said.Mr Awed said the comments were \"dangerous\", adding it was \"not becoming of a president to be just attacking other Americans\".The president was responding to a question about whether Democratic Minnesota Governor Tim Walz should resign over allegations of large-scale fraud in a state social assistance programme.Watch: Trump says he 'doesn't want' Somali migrants in USDozens of people have been charged over a scheme that federal prosecutors say involved a charity fraudulently billing the Minnesota government for meals for children during the Covid-19 pandemic. A number of Somali immigrants were implicated in that alleged scheme, which ultimately cost the state tens of millions of dollars, according to Kayseh Magan, a former investigator in Minnesota's attorney general's office.While those accused of involvement represent a small fraction of Minnesota's large Somali population, Trump has repeatedly criticised the community, writing in a post last month that the state has become a \"hub of fraudulent money laundering activity\" and alleging last week that \"hundreds of thousands of Somalians are ripping off our country\".On Wednesday, the House Oversight Committee said it was opening an investigation into Walz's handling of the relief scheme.The Trump administration said it was also looking into claims Minnesota tax dollars are being funnelled into al-Shabab, an Islamist group affiliated to al-Qaeda based in Somalia. Asked about those claims last month, Walz said: \"Do not paint an entire group of people with that same brush – demonising them, putting them at risk when there is no proof to do that.\"But if you want to help us and you want to go after the criminals and make sure there's no connection or find out where the money went, we welcome that.\"'Anyone who looks like me is scared' Jamal Osman, a member of the Minneapolis City Council, moved to the US when he was 14 and is a naturalised citizen. \"Anyone who looks like me [is] scared right now,\" he told CBS News.Of the fraud allegations that Trump has repeatedly referenced in his criticism of the Somali community, Osman said: \"My community is upset. Yes, people commit crimes, but an entire community should not be blamed based on what some individuals did.\"The Trump administration has ended Temporary Protected Status (TPS) - a programme for immigrants from countries in crisis - for Somali residents living in Minnesota.It said its enforcement operation would target those who have been issued final deportation orders. That operation began on Wednesday,  according to the BBC's US partner, CBS News.Abdilatif HassanKowsar Mohamed says Trump's comments have led to increased concern\"ICE (Immigration and Customs Enforcement) is already here,\" said Kowsar Mohamed, who lives in south Minneapolis. The city is home to more than 80,000 people of Somali descent.\"We're seeing boots on the ground activity where folks are just being plucked off of the streets and being asked about their residency status. That's not a data informed approach,\" she said.\"Most folks have the identification necessary, so the fear is not around proof. The fear is around mistakes happening.\"A spokeswoman for the Department of Homeland Security, which oversees ICE, denied that any people would be targeted based on race.\"Every day, ICE enforces the laws of the nation across the country,\" said Assistant Secretary Tricia McLaughlin. \"What makes someone a target of ICE is not their race or ethnicity, but the fact that they are in the country illegally.\"Local community organisations had been anticipating increased immigration enforcement, but after Trump's comments they ramped up preparations, Ms Mohamed said. One organisation, Monarca, has scheduled \"legal observer training\" in Minneapolis to educate people on their rights when witnessing federal immigration activity. Other ways the community is bracing itself, Ms Mohamed said, is by having emergency contacts ready-to-go in case of ICE encounters, and private messaging groups where people share photos of unmarked cars and masked agents.\"Everyone is just going to be in the space of caution,\" she said. \"Is there fear? Absolutely. But no one is tucking behind their tail.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Not becoming of a president': Somali-Americans respond to Trump's 'garbage' remarks",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d371/live/12887980-d08f-11f0-9508-4b2ee64d533f.jpg"
      ],
      "datePublished": "2025-12-04T05:22:42.000Z",
      "dateModified": "2025-12-04T05:22:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meta starts kicking Australian children off Instagram and Facebook ",
    "url": "https://www.bbc.com/news/articles/cdxekqryn1jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d788/live/228b1e20-d0a1-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "World",
    "date": "2025-12-04T06:00:44.000Z",
    "description": "Watch: Australia's social media ban explained... in 60 secondsMeta has started removing Australian children under 16 years old from its Instagram, Fac",
    "body": "Watch: Australia's social media ban explained... in 60 secondsMeta has started removing Australian children under 16 years old from its Instagram, Facebook and Threads platforms, a week before an official teen social media ban begins.The tech giant announced last month it had begun notifying users aged between 13 to 15 years old that their accounts would start being shut down from 4 December.An estimated 150,000 Facebook users and 350,000 Instagram accounts are expected to be affected. Threads, similar to X, can only be accessed via an Instagram account.Australia's world-first social media ban starts on 10 December, with companies facing fines of up to A$49.5m (US$33m, £25m) if they fail to take \"reasonable steps\" to stop under-16s from having accounts.A spokesperson for Meta told the BBC on Thursday that \"compliance with the law will be an ongoing and multi-layered process\".\"While Meta is committed to complying with the law, we believe a more effective, standardised, and privacy-preserving approach is needed,\" she said.The government should require app stores to verify the age of users when they download apps and ask for parental approval for under-16s, Meta said, as this would eliminate the need for teens to verify their age across different apps. Last month, Meta said users it had identified as under 16 would be able to download and save their posts, videos and messages before their accounts are deactivated.Teens who believe they have been wrongly categorised as under 16 can ask for a review and submit a \"video selfie\" to verify their age. They can also provide a driver's licence or a government-issued identification.Alongside Meta's three platforms, the other social media sites affected by the ban are YouTube, X, TikTok, Snapchat, Reddit, Kick and Twitch.The government says the ban is aimed at protecting children from the harms of social media but critics say the move may isolate certain groups who depend on platforms for connection and push children to less-regulated corners of the internet.Communications Minister Anika Wells on Wednesday said she expected teething problems in the first few days and weeks of the ban but it was about protecting Gen Alpha - anyone under 15 years - and future generations. \"With one law, we can protect Generation Alpha from being sucked into purgatory by the predatory algorithms described by the man who created the feature as behavioural cocaine,\" Wells said.She described youngsters as being connected to a \"dopamine drip\" from the moment they got a smartphone and social media accounts.Wells also said that she was closely watching lesser-known apps like Lemon8 - created by the makers behind TikTok - and Yope to see if children were migrating to those platforms after the ban.Earlier this week, Australia's eSafety Commissioner Julie Inman Grant wrote to Lemon8 and Yope - both are video and photo-sharing apps - asking them to self-assess if they fell under the ban.Yope's chief executive and co-founder Bahram Ismailau said the start-up had not received any inquiries from Inman Grant yet but had already carried out a self-assessment and found it was not a social media platform.\"Because in practice Yope functions as a fully private messenger with no public content at all,\" he told the BBC.Yope works much like WhatsApp, Mr Ismailau said, where it's about \"seeing your people every day and sharing your life with them safely and privately\".Lemon8 has reportedly said it will exclude under-16s from its platform from next week, despite not being included in the ban.YouTube, which was originally exempt from the ban but then later included, labelled the law as \"rushed\" and claimed that banning children from having an account - which comes with parental controls - will make its video-sharing platform \"less safe\". Australia's social media ban, the first of its kind in the world, is being closely watched by global leaders.The government commissioned a study earlier this year which found that 96% of Australian children aged 10-15 used social media, and that seven out of 10 of them had been exposed to harmful content such as misogynistic and violent material as well as content promoting eating disorders and suicide.One in seven also reported experiencing grooming-type behaviour from adults or older children, and more than half said they had been the victim of cyberbullying.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meta starts kicking Australian children off Instagram and Facebook ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d788/live/228b1e20-d0a1-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-12-04T06:00:44.000Z",
      "dateModified": "2025-12-04T06:00:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "As lead changes in knife-edge Honduran election, will Trump fail to get his way?",
    "url": "https://www.bbc.com/news/articles/c9895x3039ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6608/live/d6c2e880-cfea-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-12-03T02:56:42.000Z",
    "description": "2 days agoWill GrantCentral America correspondent, TegucigalpaReutersPresidential candidate Salvador Nasralla has a small lead in the electionWith a l",
    "body": "2 days agoWill GrantCentral America correspondent, TegucigalpaReutersPresidential candidate Salvador Nasralla has a small lead in the electionWith a little over two-thirds of the ballots in the Honduras election tallied, the lead has changed hands.The former vice-president, Salvador Nasralla, has a small but potentially significant lead over his rival, the conservative former mayor of Tegucigalpa, Nasry Asfura. Yet Asfura's National Party continues to brief journalists that they have the numbers for an eventual win.The race remains on a knife-edge. In Washington, President Donald Trump has staked his hopes on nothing less than an outright Asfura victory and has tried to directly influence the race in support of his favoured candidate.Whether it has been intimating that funds could be withheld from the impoverished Central American nation or making unsubstantiated allegations of electoral fraud, many in Honduras see the US president's fingerprints all over this election.To Honduran political analyst, Josué Murillo, it smacks of the kind of treatment Honduras expected from Washington during the Cold War.\"No government should come here and treat us as a banana republic. That is a lack of respect,\" he says in a coffee shop in Tegucigalpa.\"Donald Trump saying who we should elect violates our autonomy as a nation, and it affects our elections as well.\"Irrespective of whether the National Party go on to victory, one of their key figures is already celebrating.On Monday, ex-President Juan Orlando Hernández walked out of jail in Virginia a free man having served just one year of a 45-year sentence for drug-smuggling and weapons charges.His release came after Trump urged Honduran voters to cast their ballots for Asfura.Hernández was unexpectedly pardoned by Trump, despite having been found guilty last year by a court in New York of running a drug conspiracy which had brought more than 400 tonnes of cocaine into the United States.His time in office had also been marred by allegations of serious human rights violations by the police and security forces, particularly against government critics.So, when Hernández was arrested in 2022, then extradited to the United States and eventually jailed, most Hondurans celebrated it as a rare moment of justice in a nation riddled with institutional impunity, especially for the political elites.Trump has claimed the opposite, telling journalists on Air Force One that \"the people of Honduras really thought (Juan Orlando Hernández) was set up and it was a terrible thing\".ReutersEx-President Juan Orlando Hernández was extradited to the United States in 2022Journalists in Honduras who have covered the rise and fall of Hernández – from the moment he rose to national prominence following a coup in 2009 to his extradition – struggle to recognise that description of a roundly detested former president.However, he does still have his supporters, particularly in the National Party. And none have been more vocal in maintaining his innocence or calling for his pardon than his wife, Ana García Carías.I sat down with the former First Lady, who described Hernández's release as \"like being in a dream, a dream made reality\".\"We spoke to him this morning (Tuesday) and he is in a safe place. We were so happy, we got all the children onto the phone together with my mother-in-law, and shared a moment of happiness, laughter and prayer together.\"In terms of the future, the question now arises as to whether Hernández will attempt to return to Honduras. Ms García Carías says that his potential return depends less on the outcome of the election and more on whether the authorities will guarantee his safety.\"It depends on the security guarantees they give him in this country,\" she says.\"Day after day, this government – which thank God is on its way out – used a discourse of hate about my husband that they spoke of persecution against him. And that's very dangerous for an ex-president – to return to a place where they've cultivated hatred against him from the very top, the president, down to the lowliest functionary.\"Ms García Carías alleged her husband had been a victim of \"lawfare\", of \"the deep state\" and of a \"politically motivated witch-hunt\" by the Biden administration. I put it to her that the case against her husband had largely been drawn up by the Drug Enforcement Administration and the US Department of Justice during Trump's first term, not President Biden's.It was a point she quickly dismissed.\"That's what the prosecutors claimed but I think it's so illogical,\" she argues. \"In whose mind would it make sense to bring a man they say was a co-conspirator into meetings with the CIA, the DEA, to give classified information on national security?\"\"There was a political campaign (against him) involving figures in the Biden administration,\" she insisted, \"and I think there was manipulation of the facts after the event.\"ReutersAna García Carías, wife of the ex-president Juan Orlando Hernández, says he was a victim of the \"deep state\"Ms García Carías publicly recognised the role of two key MAGA figures in securing her husband's pardon: the influential conservative political advisor Roger Stone – himself the beneficiary of a Trump pardon – and the former Florida Congressman, Matt Gaetz. \"They both got involved with the case,\" she says. \"I recognise and thank them for their contribution. In fact, I spoke to Mr Stone on his radio programme on Sunday and he said that he had taken a letter from Juan Orlando, which he had written on his birthday to ask for a pardon and delivered it directly to President Trump.\"Meanwhile, the vote count in Honduras carries on into another night.As the ballots continue to be tallied, it should soon become clear whether Trump will get his way in Honduras and see a new ally elected in the country just as he pardons an old one.​​",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "As lead changes in knife-edge Honduran election, will Trump fail to get his way?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6608/live/d6c2e880-cfea-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-03T02:56:42.000Z",
      "dateModified": "2025-12-03T02:56:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Previously unseen images of Jeffrey Epstein's island released ",
    "url": "https://www.bbc.com/news/articles/c4g5rrlve33o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a8fa/live/e4c906b0-d0f5-11f0-ae86-13543e2a9385.jpg",
    "tag": "World",
    "date": "2025-12-04T10:31:44.000Z",
    "description": "6 hours agoBernd Debusmann JrWatch: Newly released video of Jeffrey Epstein's private island homeDemocrats on the House Oversight Committee have relea",
    "body": "6 hours agoBernd Debusmann JrWatch: Newly released video of Jeffrey Epstein's private island homeDemocrats on the House Oversight Committee have released never-before-seen images of Jeffrey Epstein's infamous island. The photographs and video appear to show several bedrooms in the US Virgin Islands home, as well as a room with masks on a wall and a phone with names written on speed-dial buttons.In a statement, the committee's Democratic leader, Robert Garcia, said they collectively form a \"disturbing look\" into Epstein's world and are being released to \"ensure public transparency\".On 19 November, President Donald Trump signed a bill that ordered the release of government files on the late convicted sex offender - a significant turning point in a months-long fight over the documents.Those files comprise the vast trove of documents that were amassed during two criminal investigations into Epstein - including interview transcripts and confiscated items.On Wednesday, five members of Congress, both Republican and Democratic, reportedly requested an update from Attorney General Pam Bondi before the end of the week on the planned release of those files.US CongressUS CongressMultiple survivors have alleged that they were trafficked to and abused on the island, known as Little St James, which Epstein purchased in 1998.The newly released images from 2020 also show what appears to be a dental chair and a room with a black chalkboard on which is scrawled with words including \"truth\", \"deception\" and \"power\". Some of the words have been redacted. In a statement, Democrats on the oversight committee said that the images and videos stem from an 18 November request to the attorney general of the US Virgin Islands for information about investigations into Epstein and his imprisoned co-conspirator, Ghislaine Maxwell. \"These new images are a disturbing look into the world of Jeffrey Epstein and his island,\" Garcia said. \"We are releasing these photos and videos to ensure public transparency in our investigation and to help piece together the full picture of Epstein's horrific crimes,\" he added. \"We won't stop fighting until we deliver the full picture of Epstein's horrific crimes.\" According to Garcia, the committee has also received records from JP Morgan and Deutsche Bank, which they intend to release \"in the days ahead\".Little St James was one of two islands in the Virgin Islands owned by Epstein. In 2022, the attorney general of the US territory reached a settlement of over $105m (£78.6m) after local authorities alleged that \"dozens of young women and children\" were trafficked, raped and assaulted on the two islands. The images shed little new light on the case, besides providing a glimpse of one of Epstein's crime scenes and opulent lifestyle in the Virgin Islands. The release, however, comes as the Trump administration remains under pressure to release the broader set of documents kept by the US justice department, with Garcia saying in his statement that \"it's time for President Trump to release all the files, now\". Later on Wednesday, the committee released a second batch of some 200 images as well as several videos. Most of those showed the same rooms as the first batch, with some new close-ups of the apparent dentist chair and the masks on the walls of that room.All of the masks are in a similar style and depict male faces.Other images show personal items around the house, such as a large selection of shampoos and conditioners and various art items including statues and paintings.There is also a picture of Epstein and Maxwell meeting Pope John Paul II.The photos seem to have been taken in 2020 according to the metadata - after the death of Jeffrey Epstein in 2019 - so the house appears to have been packed away, with furniture stacked up and artwork removed from walls.US CongressUS CongressOne image shows a telephone with names written on speed-dial buttonsThe release also includes a video showing a walk through of Epstein's property. It shows a palm tree-lined swimming pool with a statue of an archer and a path to the ocean.The bill Trump signed last month gives the department a 30-day window - until 19 December - to make them available in a \"searchable and downloadable format\".But there are obstacles to the files being shared with the US public on that date.For one, the bill said that the justice department can hold back any documents that jeopardise \"an active federal investigation or ongoing prosecution, provided that such withholding is narrowly tailored and temporary\".That could potentially lead to delays, given that Trump has called for investigations into Epstein's links with prominent Democrats \"to determine what was going on with them, and him [Epstein]\".The latest bill also says Bondi can \"withhold or redact\" records that include victims' names, medical files and other personal information that \"would constitute a clearly unwarranted invasion of personal privacy\".The five members of Congress who requested an update from Bondi on Wednesday said they wanted understand any \"procedural hurdles that could interfere\" with the justice department's ability to meet its 30-day deadline, according to a letter they wrote that was published by NBC News.The letter made reference to the investigation into prominent Democrats that was recently ordered by Trump. It said the basis for that move should prompt Bondi to provide a \"briefing either in a classified or unclassified setting, to discuss the full contents of this new information\".One of the letter's five signatories, Democratic Senator Jeff Merkley, explained the move on X: \"We're keeping the pressure on to make sure the Justice Department follows the law and RELEASES THE FILES.\"US CongressVarious bedrooms on the property were shown in the new images",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Previously unseen images of Jeffrey Epstein's island released ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a8fa/live/e4c906b0-d0f5-11f0-ae86-13543e2a9385.jpg"
      ],
      "datePublished": "2025-12-04T10:31:44.000Z",
      "dateModified": "2025-12-04T10:31:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ukrainians in war-ravaged Donbas weigh prospects of peace deal",
    "url": "https://www.bbc.com/news/articles/cpq47derx2vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8ca2/live/3919b6d0-cf82-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-12-02T17:00:23.000Z",
    "description": "2 days agoJonathan BealeDefence correspondent, KyivWatch: Escaping Ukraine's war-ravaged Donbas region.Trains no longer run to Ukraine's eastern Donet",
    "body": "2 days agoJonathan BealeDefence correspondent, KyivWatch: Escaping Ukraine's war-ravaged Donbas region.Trains no longer run to Ukraine's eastern Donetsk region - part of the Donbas claimed in its entirety by Russia's President Vladimir Putin. It's another sign of the steady Russian advance.Instead, the last station is now on the western side of the Donetsk border. This is where civilians and soldiers wait for a ride towards relative safety - their train to get out of Dodge.Putin has been sounding more bullish since the leak of US proposals to end the war, widely seen as being in tune with his maximalist demands. Ukraine's President Volodymyr Zelensky says territory remains the most difficult issue facing US-led peace talks.At the last station on the line, soldier Andrii and his girlfriend Polina are parting after an all-too-brief time together. Andrii has to return to the front and they don't know when they'll see each other again.He laughs when I mention peace talks, which have seen Donald Trump's envoys speak to Ukrainian negotiators before heading to Moscow, and dismisses them as \"chatter, just chatter\". He doesn't think the war will be over soon.BBC/Matthew GoddardSoldier Denys is adamant that the Donbas should not be given to Russia in a peace deal There is scepticism, too, among other soldiers who board the train west for a brief respite from the fighting. They are taking some of their 20 days of leave. Most look exhausted.Russian forces now control some 85% of the Donbas, made up of Luhansk and Donetsk. On Tuesday they claimed to have captured the key strategic town of Pokrovsk in Donetsk. Ukraine said fighting was continuing in the city.Denys, who has been serving in the Ukrainian army for the past two years, tells me \"everyone's drained, everyone's tired mentally and physically\". Some of his comrades have already fallen asleep. His unit has been fighting in the besieged city of Kostyantynivka.\"It's scary, really scary,\" he says, describing drones flying around \"like flies\". But he makes it clear they are not ready to give up after sacrificing so much.\"Nobody will give Putin the Donbas. No way, it's our land,\" he says.Ceding territory where at least a quarter of a million Ukrainians live - the Donetsk \"fortress belt\" cities of Slovyansk, Kramatorsk and Druzhkivka - will not be acceptable to most Ukrainians.Russia has spent well over a year trying to capture Pokrovsk and Ukraine is reluctant to hand over such important strategic hubs.But US officials believe Ukraine is both outnumbered and outgunned.There's already been an exodus of civilians from the Donbas. It's continuing as  peace talks take place. We witness dozens, old and young, arriving at a reception centre just over the border in Lozova.They had taken advantage of heavy fog to make their escape. Less chance of being targeted by drones. Around 200 people arrive at this one reception centre every single day. They're given basic supplies and some money.BBC/Matthew GoddardRefugees fleeing the Donbas take advantage of foggy conditions as visibility is reduced for enemy drones Yevheniy and his wife Maryna have just arrived from Kramatorsk, along with their two children. She tells me there are \"more drones now\". \"It's getting harder and harder to even go outside. Everything is dangerous,\" she says. \"Even going to the shop, you might not come back.\"The family are planning to move to the capital, Kyiv. Yevheniy has little faith in the peace talks. He says \"that side [Russia] won't agree to our terms. We understand nothing good will come of it\".But others appear more willing to contemplate giving up their home for good in return for peace.Oleksandr says it is too dangerous to stay. His children have already gone to Germany. While he describes Russia's maximalist demands as \"probably unacceptable\", he appears willing to contemplate some of what was in the leaked peace plan - trading territory for peace. The original version of the US draft envisaged that areas of Donbas still under Ukrainian control be handed over to Russia de facto.\"Personally I would agree to those terms,\" he says.BBC/Matthew Goddard\"Serhii\" has been in hiding since he deserted his unit in MayInna, escaping with her five children, also believes it's time to make a deal. She could no longer hide her kids, aged between nine months and 12 years, from the dangers of living in Kramatorsk. She had tried telling them the explosions they heard while seeking shelter in their cellar were just fireworks.\"The main thing is that there will be peace,\" Inna says. When I ask whether that means giving up her home for good, she replies, \"in this situation, yes\". They're already making plans to rebuild their lives elsewhere.Some soldiers sent to the Donbas are also voting with their feet. There have been nearly 300,000 cases of desertion, or soldiers going  absent without official leave, since the start of Russia's full scale invasion - and numbers have risen dramatically over the past year.One of them is Serhii - not his real name. We met him in hiding. His home has become his prison as he tries to evade arrest. Serhii volunteered to fight at the start of the year, whereas most of the men in his unit were forcibly mobilised - \"taken off the street\".He says his unit was already below strength when it was sent to the front, near Pokrovsk, and they weren't properly trained or equipped. \"I ended up in a battalion where everything was a mess,\" he says, although he still believes this was the exception, not the norm.Serhii deserted in May after two of his friends went awol.\"I wouldn't have gone if we had proper leadership and someone experienced in charge,\" he says. \"I came to serve, not to run\".Serhii is still thinking about his next move, and the possibility of returning to the army. But he echoes recent US warnings that the odds in this war are stacked against Ukraine.Asked whether he believes Ukraine can win, he is doubtful. \"If you think logically, no. A country of 140 million against us with 32 million - logically it doesn't add up.\"Additional reporting by Mariana Matveichuk",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ukrainians in war-ravaged Donbas weigh prospects of peace deal",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8ca2/live/3919b6d0-cf82-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-12-02T17:00:23.000Z",
      "dateModified": "2025-12-02T17:00:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hong Kong fire survivor: 'My heart breaks every time I'm called a hero'",
    "url": "https://www.bbc.com/news/articles/cm2054rdv52o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/92b6/live/888494c0-d0df-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-12-03T23:13:49.000Z",
    "description": "17 hours agoKoey LeeBBC News Chinese, Hong KongSurvivor recalls escaping Hong Kong building fireWilliam Li has struggled with the label \"hero\" since h",
    "body": "17 hours agoKoey LeeBBC News Chinese, Hong KongSurvivor recalls escaping Hong Kong building fireWilliam Li has struggled with the label \"hero\" since helping his neighbours escape the fire which engulfed the Hong Kong block of flats he had called home since birth.Instead, he is haunted by guilt that he could have saved more people from the blaze at Wang Fuk Court, which left at least 159 people dead.\"My heart breaks every time someone calls me a hero,\" says the 40-year-old, breaking down in tears.A week on from the disaster, firefighters are still combing the complex of seven burnt-out high rises for the remains of 30 of Mr Li's neighbours - people who, like him, had the misfortune to be at home when the deadly fire began.What caused the fire to start, and why more people did not escape, is now the subject of an independent committee's investigation, ordered by Hong Kong's chief executive.Already, it has been revealed that non-fire resistant netting had been fitted around the building, and the fire alarms were not working properly.EPAThe Wang Fuk Court fire is the deadliest in Hong Kong for more than seven decadesThe fact alarms did not go off was the reason why Mr Li was not more worried when his wife called to tell him a fire had started in their building, Wang Cheong House.Instead of rushing, he spent almost 10 minutes packing belongings.But the moment he opened the door, the extent of the disaster was all too clear: he was engulfed in billowing smoke and had to retreat inside his flat.On the other end of the phone, his wife became hysterical, but Mr Li didn't have time to panic.He had to put wet towels under the door to stop the smoke from getting in, and tried to work out what to do next.It was then he heard voices in the corridor, where the air was now so dense with smoke he was unable to see who was calling out. Covering his face with a wet towel, he found two of his neighbours by touch, dragging the couple inside to the relative safety of his flat.In a neighbouring block, Bai Shui Lin was also trying to help her neighbours.The 66-year-old is thought to have saved at least three families, banging on their doors to warn them of the fire.Mrs Bai did not survive, however. Her sons identified her body at the weekend.\"If I'd asked her to leave a minute earlier, I think she would have survived,\" Yip Ka-Kui told the BBC's US partner, CBS. \"But we know her. She wouldn't have left without warning others.\"Back in Mr Li's flat, the middle aged couple revealed they had heard another voice in the corridor: a domestic worker calling for an elderly woman. But now, the voice had gone quiet.This time, Mr Li was unable to help.\"I feel very guilty,\" he said. \"Some people weren't saved and I didn't open my door again and try to find them.\"William LiTrapped inside his home, Mr Li waited for more than two hours before he was rescuedMr Li does not know yet what happened to the voice in the corridor. Nine Indonesian and one Filipino domestic workers are reportedly among the dead, but others survived - including Rhodora Alcaraz, 28, who was trapped in another flat looking after her employer's three-month-old baby and elderly mother. She too has been hailed a hero for staying by their side.All three were rescued by firefighters eventually - but not before Ms Alcaraz had sent a series of voice messages to her sister.\"I'm feeling very weak. I can't breathe,\" she said in one of the clips, Reuters news agency reported.Mr Li and the couple - named in local media as the Chows - realised they too needed to escape. Several hours had elapsed, and their options were running out.One fire exit was blocked by the flames, while Mr Li's neighbour believed the other was locked. They decided not to jump out of the second floor window due to the intensity of the fire, and the constant explosions.A subsidiary of Danish company ISS, the property manager of Wang Fuk Court, has not responded to a BBC inquiry over reports that the emergency exit was locked.William LiThe Li family loved their soft toys, which were displayed next to the windows\"It was the first time I felt death had something to do with me,\" says Mr Li. That's why he started saying goodbye to friends one by one via WhatsApp: \"I can't escape,\" he told them. \"If something happens to me take care of my children. Look after yourselves.\"About two and a half hours after the blaze began, firefighters finally reached them on an aerial ladder. Mrs Chow told HK01, a Hong Kong-based news outlet, that Mr Li insisted the firefighters should get them out first. \"We are older and told him he should leave first. He refused and said he was young and could handle this.\"When the firefighters came back for him, Mr Li felt reluctant to leave his home, which was filled with fond memories and treasured collections of photography equipment and toys.\"The fire was telling me that I couldn't take anything away, that I had no right or power to stop it from devouring everything.\"Mr Li reunited with his family at a nearby fast food restaurant.But after he'd reached hospital it took until the early hours of the morning for the true extent of the horror he'd endured to make itself felt.\"I no longer had any strength in me and when I got to the emergency room, my knees gave in. A burning smell lingered in my nose,\" he says. \"I really wanted to wash away the smell.\"After being admitted to a ward at 03:00, Mr Li finally had the space to cry and start trying to process the ordeal he had gone through.\"When I had been to hospital before, I wanted to go home as soon as possible,\" he says. \"But this time when the nurse asked me [if I wanted to go home], I wasn't willing to leave. I felt like I was avoiding what I would have to face in the future.\"He has however decided to face the trauma upfront – by doing as many interviews as he can.\"I hope many people will come forward to help find the truth,\" he says. \"I hope Wang Fuk Court residents will be given answers and justice.\"Additional reporting by Phoebe Kong and Grace Tsoi",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hong Kong fire survivor: 'My heart breaks every time I'm called a hero'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/92b6/live/888494c0-d0df-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-03T23:13:49.000Z",
      "dateModified": "2025-12-03T23:13:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump to host DR Congo's Félix Tshisekedi and Rwanda's Paul Kagame to sign peace deal",
    "url": "https://www.bbc.com/news/articles/cjrjn88jqn4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8940/live/41c12420-d0ff-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-12-04T15:55:33.000Z",
    "description": "Trump to host signing of peace deal between leaders of DR Congo and Rwanda21 minutes agoEmery Makumeno,BBC Africa, KinshasaandSamba Cyuzuzo,BBC Great ",
    "body": "Trump to host signing of peace deal between leaders of DR Congo and Rwanda21 minutes agoEmery Makumeno,BBC Africa, KinshasaandSamba Cyuzuzo,BBC Great LakesReuters / BBCThe presidents of DR Congo (left) and Rwanda are to sign the deal in WashingtonThe leaders of the Democratic Republic of Congo and Rwanda are set to sign a peace deal aimed at ending the long-running conflict in the region at a summit hosted by US President Donald Trump in Washington.  Ahead of the summit, there has been an escalation in fighting in resource-rich eastern DR Congo between government forces and rebels believed to be backed by Rwanda. DR Congo's army accused its rivals of attempting to \"sabotage\" the peace process, but the M23 rebels said the army had launched an offensive in breach of a ceasefire. At the start of the year, the M23 seized large parts of eastern DR Congo in an offensive that saw thousands killed and many more forced from their homes.DR Congo's President Felix Tshisekedi and his Rwandan counterpart Paul Kagame have frequently exchanged insults in recent years, each accusing the other of starting the conflict.Trump got the two countries' foreign ministers to sign a peace accord in June, hailing it as a \"glorious triumph\". Tshisekedi and Kagame will now endorse it, with several other African and Arab leaders - including those of Burundi and Qatar - expected to attend the signing ceremony. The M23 will not be present - it is in talks with DR Congo's government in a parallel peace process led by Qatar. The Trump administration has spearheaded talks between DR Congo and Rwanda,  hoping that resolving the differences between the two neighbours will pave the way for the US to increase investments in the resource-rich region. Rwanda denies supporting the M23, despite UN experts saying its army is in \"de facto control of M23 operations\". Despite the fanfare and the presence of the two leaders in Washington, some analysts are sceptical about whether the deal will lead to lasting peace.A DR Congo researcher with the South Africa-based Institute for Security Studies think-tank, Bram Verelst, told the BBC that there was \"currently no ceasefire in place, and the M23 rebellion continues to expand and consolidate its control\". \"The signing ceremony is unlikely to alter this situation, though there is some small hope it could increase accountability on Congolese and Rwandan leaders to honour their commitments,\" he said.The M23 seized key cities in eastern DR Congo earlier this year, including Goma and Bukavu. In a statement, DR Congo army spokesman Gen Sylvain Ekenge said the rebels had launched a fresh offensive on Tuesday on villages in the South Kivu province. The villages are about 75km (47 miles) from Uvira city, which lies on the border with Burundi, and has been the headquarters of the South Kivu regional government since the rebels seized Bukavu.For its part, the M23 said the DR Congo army had launched an air and ground assault against its positions, and this was done in cahoots with Burundian forces. Burundi has not commented on the allegation. It has several thousand troops in eastern DR Congo to support the embattled army. AFP via Getty ImagesThe main trading hub in eastern DR Congo, Goma,  has been under rebel control since JanuaryRwanda says it has adopted \"defensive measures\" in eastern DR Congo because of the threat posed by the FDLR militia group, which includes fighters who carried out the 1994 Rwandan genocide. Kagame insists that the FDLR must be disarmed, while DR Congo demands the withdrawal of Rwandan troops from its territory.Both of these conditions are included in the peace deal to be signed in Washington.However, several deals going back to the 1990s have failed after Rwanda accused previous Congolese government of failing to disarm the FDLR, and this remains one of the main stumbling blocks in current efforts to end the conflict.DR Congo's government has also demanded that the M23 gives up the territory it has seized, something it has so far refused to do in the Qatar-brokered talks.Qatar and the US are co-ordinating their mediation efforts. Qatar has strong ties with Rwanda, while the US is seen to be closer to DR Congo. The US State Department said in 2023 that DR Congo had an estimated $25trn (£21.2trn) in mineral reserves.This includes cobalt, copper, lithium, manganese and tantalum - key ingredients needed to make the electronic components used in computers, electric vehicles, mobile phones, wind turbines and military hardware.\"We're getting, for the United States, a lot of the mineral rights from the Congo as part of it,\" Trump said, ahead of the deal signed in June. Prof Jason Stearns, a Canada-based political scientist who specialises in the region, told the BBC that the US has been pushing for an economic agreement that could see DR Congo and Rwanda co-operate on hydro-electric power, mining and infrastructure development.\"The logic is that it will provide the peace dividend,\" he said.However, DR Congo has made it clear that while it would sign the agreement, it would not \"advance on that deal until Rwandan troops have withdrawn from eastern DR Congo\", Prof Stearns added.More about the DR Congo conflict:Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump to host DR Congo's Félix Tshisekedi and Rwanda's Paul Kagame to sign peace deal",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8940/live/41c12420-d0ff-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-04T15:55:33.000Z",
      "dateModified": "2025-12-04T15:55:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]