[
  {
    "title": "Inside the Colombian cathedral built 180m underground",
    "url": "https://www.bbc.com/news/videos/cjwyy65ne62o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024xn/ichef.bbci.co.uk/images/ic/$widthxn/p0mn5v8v.jpg",
    "tag": "World",
    "date": "2025-12-12T12:44:25.000Z",
    "description": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch LiveLis",
    "body": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch LiveListen to the full episode on BBC Sounds.1 day agoColombia",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Inside the Colombian cathedral built 180m underground",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024xn/ichef.bbci.co.uk/images/ic/$widthxn/p0mn5v8v.jpg"
      ],
      "datePublished": "2025-12-12T12:44:25.000Z",
      "dateModified": "2025-12-12T12:44:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Three Americans killed by IS gunman in Syria, US military says",
    "url": "https://www.bbc.com/news/articles/c9d9vpxjp2go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0168/live/f5f649a0-d84f-11f0-85ce-bd7c5a2bb1fc.jpg",
    "tag": "World",
    "date": "2025-12-13T19:32:51.000Z",
    "description": "Two US soldiers and a US civilian interpreter have been killed in Syria in an ambush by an Islamic State gunman, the US Central Command has said.Offic",
    "body": "Two US soldiers and a US civilian interpreter have been killed in Syria in an ambush by an Islamic State gunman, the US Central Command has said.Officials said three other service members were injured in the attack, during which the gunman was \"engaged and killed\".US President Donald Trump wrote on social media that it was \"an ISIS attack\" against the US and Syria and said there would be \"a very serious retaliation\".The identities of those killed are being withheld for 24 hours until their next of kin have been informed, the US Central Command said.In a post on X, the US Central Command said the attack was \"the result of an ambush by a lone ISIS gunman\", while a Pentagon official said initial assessments showed the attack was \"likely\" to be carried out by the Islamic State group.The UK-based Syrian Observatory for Human Rights said the attacker was a member of the Syrian security force.No group has claimed responsibility for the attack, and the identity of the gunman has not been released.The ambush occurred in Palmyra, located in the centre of the country, while the soldiers were \"conducting a key leader engagement\", according to Pentagon spokesperson Sean Parnell.A Pentagon official said: \"This attack took place in an area where the Syrian president does not have control.\"Trump added that the three injured US soldiers were \"doing well\". Syria's state news reported that two Syrian service personnel had also been injured.US Defence Secretary Pete Hegseth said: \"Let it be known, if you target Americans - anywhere in the world you will spend the rest of your brief, anxious life knowing the United States will hunt you, find you, and ruthlessly kill you.\"Syria recently joined an international coalition to combat IS and has pledged to co-operate with the US.Last month, President Ahmed al-Sharaa met with Donald Trump at the White House in a visit that the Syrian leader said was part of a \"new era\" for the two countries.The global coalition is aimed at eliminating the remaining elements of the so-called Islamic State and stemming the flow of foreign militants to the Middle East.Tom Barrack, US ambassador to Turkey and special envoy for Syria, said: \"I strongly condemn the cowardly terrorist ambush targeting a joint US–Syrian government patrol in central Syria.\"We remain committed to defeating terrorism with our Syrian partners.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Three Americans killed by IS gunman in Syria, US military says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0168/live/f5f649a0-d84f-11f0-85ce-bd7c5a2bb1fc.jpg"
      ],
      "datePublished": "2025-12-13T19:32:51.000Z",
      "dateModified": "2025-12-13T19:32:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ukraine's health supplies hit in series of Russian strikes on medical warehouses",
    "url": "https://www.bbc.com/news/articles/cqlkk9qk7vyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b415/live/794394e0-d790-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "World",
    "date": "2025-12-13T00:05:21.000Z",
    "description": "20 hours agoVitaly ShevchenkoRussia editor, BBC MonitoringWarehouses supplying the vast majority of Ukraine's pharmacies have been destroyed in a seri",
    "body": "20 hours agoVitaly ShevchenkoRussia editor, BBC MonitoringWarehouses supplying the vast majority of Ukraine's pharmacies have been destroyed in a series of Russian attacks over recent months.Medical supplies worth about $200m (£145m) were destroyed in just two strikes in December and October.A large warehouse storing medicines in the city of Dnipro was destroyed in a Russian air strike on 6 December. As a result, about $110m worth of medicines were destroyed - estimated at up to 30% of Ukraine's monthly supply.\"It was a missile and drone strike against our facility. The missiles flew past, but the drones hit it,\" said Dmytro Babenko, acting director-general of pharmaceutical distributor BADM.\"They caused a fire which unfortunately proved impossible to contain and the whole facility was destroyed.\"BADM is one of two companies that supply about 85% of Ukrainian pharmacies in roughly equal shares.The other company is Optima Pharm, whose warehouses have been hit three times this year - on 28 August, 25 October and 15 November.The October attack destroyed its main storage facility in Kyiv, and cost the company more than $100m, says Optima Pharm's chief financial officer Artem Suprun.Russia denies hitting civilian targets, but when the Optima Pharm warehouse was hit in October, the defence ministry in Moscow said only that it had targeted a factory producing drones.On the day BADM's warehouse was destroyed, Russia said it had hit \"a warehouse storing military equipment\" as well as energy and transport infrastructure.Such attacks significantly complicate the treatment of sick and wounded in Ukraine,   after almost four years of Russia's full-scale war.The International Rescue Committee (IRC), an NGO that had been using the warehouse in Dnipro, says it lost $195,000 worth of medication and supplies, which could have served 30,000 people in need.\"When I arrived at the site I was devastated, the scene was simply awful. All of this medicine could have served people for years, and in a single moment it was all lost,\" says the IRC's Andriy Moskalenko.The IRC said the Dnipro facility had served \"as a critical hub for hospitals, healthcare providers, pharmacies and humanitarian actors\".Mr Babenko from BADM said the Russian attack had destroyed \"vitally important medicines\" that had been imported and are not produced in Ukraine.\"It's a pretty complicated situation,\" he told the BBC.But he is hopeful that the attack will not leave Ukrainians without medicines.\"There won't be significant shortages, possibly only of certain types of goods. We're hoping to restore all supplies in a month or a month-and-a-half,\" Mr Babenko said.Ukrainian authorities accuse Russia of deliberately targeting hospitals, ambulances, medics and rescue workers, claims Moscow has denied. According to the government in Kyiv, more than 2,500 medical institutions have been damaged or destroyed, and more than 500 civilian doctors, nurses and other medical workers killed.Earlier this month, the World Health Organization said it had recorded 2,763 attacks on Ukraine's healthcare system since the start of Russia's full-scale invasion, and it said that in 2025 there had been a 12% increase in attacks from the previous year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ukraine's health supplies hit in series of Russian strikes on medical warehouses",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b415/live/794394e0-d790-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-13T00:05:21.000Z",
      "dateModified": "2025-12-13T00:05:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cambodia shuts border crossings with Thailand as fighting continues",
    "url": "https://www.bbc.com/news/articles/cd0kkyx3vvxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7058/live/e7537df0-d84f-11f0-a8dc-93c15fe68710.jpg",
    "tag": "World",
    "date": "2025-12-13T12:48:55.000Z",
    "description": "7 hours agoJonathan Head,South East Asia correspondentandMatt SpiveyCambodia has shut its border crossings with Thailand, as fighting continues betwee",
    "body": "7 hours agoJonathan Head,South East Asia correspondentandMatt SpiveyCambodia has shut its border crossings with Thailand, as fighting continues between the two forces on Saturday despite US President Donald Trump earlier saying they had agreed to a ceasefire.The crossings will be closed until further notice, according to Cambodia's interior ministry.Earlier, Thai Prime Minister Anutin Charnvirakul said he told Trump a ceasefire would only be possible after Cambodia had withdrawn all its forces and removed landmines.Thai officials said four soldiers were killed on Saturday, as both sides reported continued bombing and artillery exchanges. Cambodia has not been updating its military casualty figure.Cambodia's defence ministry said that Thai fighter jets bombed hotel buildings and a bridge, while Thailand reported several civilians were injured in a Cambodian rocket attack.The four deaths on Saturday bring Thailand's total military death toll since Monday to 15, with 270 others injured. It added that six civilians had also been injured.On Friday, Cambodia said at least 11 civilians had been killed and 59 others injured.At least 700,000 people have been evacuated on both sides of the border.Trump had claimed earlier in the week that he could stop the fighting between Thai and Cambodian forces that broke out on Monday just by picking up the phone.After speaking to both prime ministers on Friday night he wrote on social media that the two countries had agreed to \"cease shooting effective this evening\" and go back to the agreement they signed in front of the US president in October.\"Both countries are ready for peace,\" he wrote.But in their comments after speaking to the US president, neither side mentioned an imminent ceasefire.Anutin said he told Trump that Thailand was not the aggressor, and that Cambodia must show that it had withdrawn its forces and removed landmines from the border before a ceasefire was possible. \"They must show us first,\" he said.The Cambodian leadership said they must fight on to protect their country's sovereignty.There was no mention of the use of tariffs as leverage to force the two sides to disengage, as happened in July.Thailand has warned the US not to link the conflict to trade.On Saturday Cambodia reported that it had been struck by more Thai air strikes.\"On December 13, 2025, the Thai military used two F-16 fighter jets to drop seven bombs\" on a number of targets, the Cambodian defence ministry said in an X post.\"Thai military aircraft have not stopped bombing yet,\" it said.The Thai military also confirmed that fighting continued.The long-standing border dispute escalated on 24 July, as Cambodia launched a barrage of rockets into Thailand, which responded with air strikes.Both countries have accused each other of initiating the attacks. After days of intense fighting which left dozens dead, the neighbouring South East Asian countries agreed to an \"immediate and unconditional ceasefire\" brokered by Trump and Malaysian Prime Minister Anwar Ibrahim. This was formalised at a ceremony in Malaysia in October presided over by the US president.However, both sides continued to trade accusations of ceasefire violations, with Thailand publishing evidence of Cambodian troops laying landmines, which have caused seven Thai soldiers to lose limbs. Cambodia says the mines are left over from the civil war in the 1980s.Since then, tensions continued to build.This week, Thailand launched air strikes inside Cambodia after two of its soldiers were injured in a skirmish last Sunday. Cambodia has responded with rocket barrages. The fighting affected six provinces in north-eastern Thailand and six provinces in Cambodia's north and north-west.The two countries have been been contesting their 800km land border for more than a century. The border was drawn by French cartographers in 1907, when France was the colonial ruler in Cambodia.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cambodia shuts border crossings with Thailand as fighting continues",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7058/live/e7537df0-d84f-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-13T12:48:55.000Z",
      "dateModified": "2025-12-13T12:48:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anger at Lionel Messi 'GOAT' India tour as fans throw chairs and bottles at stadium event",
    "url": "https://www.bbc.com/news/articles/c4g66nll48do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9cca/live/87ff21d0-d816-11f0-a8dc-93c15fe68710.png",
    "tag": "World",
    "date": "2025-12-13T11:59:53.000Z",
    "description": "8 hours agoTom McArthurandIlma HasanWatch: Anger and chaos in Salt Lake stadium, Kolkata as Messi leaves event earlyAngry fans attending Lionel Messi'",
    "body": "8 hours agoTom McArthurandIlma HasanWatch: Anger and chaos in Salt Lake stadium, Kolkata as Messi leaves event earlyAngry fans attending Lionel Messi's tour of India ripped up seats and threw items towards the pitch after his appearance at Kolkata's Salt Lake Stadium.Thousands of adoring supporters had paid up to 12,000 rupees (£100; $133) to catch a glimpse of the football star, but were left disappointed when he emerged to walk around the pitch, and was obscured by a large group of officials and celebrities.When the Argentina and Inter Miami forward was whisked away early by security after around 20 minutes, elements of the crowd turned hostile.West Bengal's chief minister, Mamata Banerjee, said she was \"deeply disturbed and shocked\" by the events.ReutersAs it became apparent Messi's appearance had ended, local media say the scene turned ugly Messi is in India for his 'GOAT [greatest of all time] tour', a series of promotional events in Kolkata, Hyderabad, Mumbai and Delhi. His tour began with the unveiling of a 70ft (21m) statue of himself in Kolkata, which had been assembled over the course of 27 days by a 45-strong crew. Messi appeared virtually due to security concerns.Thousands of fans travelled to the city's stadium for a chance to see the footballer in person.They were chanting, buying jerseys and wearing \"I love Messi\" headbands.Messi initially walked out at the stadium waving to fans, but after his appearance was abruptly ended on Saturday, some frustrated fans stormed the pitch and vandalised banners and tents, as others hurled plastic chairs and water bottles.The 2022 World Cup winner - considered one of football's greatest ever players - had been expected to play a short exhibition game at the stadium, the AFP news agency reports.\"Only leaders and actors were surrounding Messi... Why did they call us then... We have got a ticket for 12,000 rupees, but we were not even able to see his face\", a fan at the stadium told Indian news agency ANI.One angry fan told the Press Trust of India news agency people had paid the equivalent of a month's salary to see the eight-time Ballon d'Or winner.\"I paid Rs 5,000 for the ticket and came with my son to watch Messi, not politicians. \"The police and military personnel were taking selfies, and the management is to blame.\"Messi was accompanied on his brief visit by his Inter Miami teammate and Uruguay star Luis Suarez, and Argentina's Rodrigo de Paul.Bollywood actor Shah Rukh Khan also met Messi earlier in the day, according to the Reuters news agency.Getty ImagesGetty ImagesMessi waving to fans as he arrivedThousands of fans had gathered for the eventKolkata is the capital of the Indian state of West Bengal and has a large football fanbase in an otherwise cricket-crazed country.In the city, it is common to see hundreds of thousands of fans gather at stadiums at a derby of local clubs.The BBC has contacted Lionel Messi's representatives for comment.Announcing an enquiry, Banerjee apologised to Messi and \"sports lovers\" for the incident at the stadium.\"The [enquiry] committee will conduct a detailed enquiry into the incident, fix responsibility, and recommend measures to prevent such occurrences in the future,\" the chief minister said on X.A police official told reporters that the event's \"chief organiser\" had been arrested, without giving any further details, AFP reports.Authorities will look into how organisers could refund money to those who bought tickets, the official added.The All India Football Federation (AIFF) said it was not involved in the \"private event\".In the early hours of Saturday, thousands lined the roads and congregated outside the hotel where Messi was staying to try and catch a glimpse of him.Hitesh, a 24-year-old corporate lawyer, flew nearly 1,900 kilometres from the south Indian city of Bengaluru.\"For me it's personal. You can see I am quite short, and I love to play football with my friends,\" Hitesh told the BBC, standing in front of the statue.\"Messi is the player I related with the most, no one can match his talent. He gives me hope that with talent you can do anything.\"It is just a small part of India's homage to the former Barcelona and Paris St-Germain forward.Fans can also visit a \"Hola Messi\" fan zone with a life-sized replica Messi sitting on a throne, a hall adorned with some of his trophies, and a recreation of his Miami home complete with mannequins of the player and his family sat on a balcony.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anger at Lionel Messi 'GOAT' India tour as fans throw chairs and bottles at stadium event",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9cca/live/87ff21d0-d816-11f0-a8dc-93c15fe68710.png"
      ],
      "datePublished": "2025-12-13T11:59:53.000Z",
      "dateModified": "2025-12-13T11:59:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ukraine accuses Russia of bombing Turkish ship in Odesa",
    "url": "https://www.bbc.com/news/articles/c5yjj2epvlro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ffbc/live/427856b0-d7c4-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "World",
    "date": "2025-12-12T22:12:38.000Z",
    "description": "A large fire broke out on a Turkish car ferry anchored at the Ukrainian port city of Odesa after it was hit in a strike on Friday.The company that ope",
    "body": "A large fire broke out on a Turkish car ferry anchored at the Ukrainian port city of Odesa after it was hit in a strike on Friday.The company that operates the Cenk T confirmed the attack occurred at 16:00 local time (14:00 GMT) shortly after it docked at the Chornomorsk port.Ukraine's President Volodymr Zelensky has blamed the strike on Russia, which has not commented.The attack came hours after Turkish President Tayyip Erdogan told Russian President Vladimir Putin that a limited ceasefire for energy facilities and ports could be beneficial. Russia has resisted all calls for a ceasefire.Moscow has threatened to cut \"Ukraine off from the sea\" in response to Kyiv's maritime drone attacks on Russia's \"shadow fleet\" tankers thought to be used to export oil - and a main source for funding the ongoing war.Cenk Denizcilik, the company that owns the cargo ship that operates on the Karasu-Odesa route across the Black Sea, said on Friday that it had been carrying \"essential food supplies\" when it was hit shortly after anchoring at the Ukrainian port city.Emergency response measures were immediately activated with the vessel's crew, port fire brigade and assisting tugboats after a fire broke out on the forward section of the ship, the company's statement added.\"At this stage, there are no reports of casualties or injuries among the crew,\" it said.Video footage of the attack's aftermath, which was shared on Zelensky's Telegram account, shows crews attempting to extinguish a large blaze on the vessel.  While condemning a series of missile attacks that Russia had carried out on the Odesa region the night before, the Ukrainian leader blamed Moscow for targeting the civilian Turkish ship, saying it \"could not have any military meaning\".Turkey's foreign ministry said an agreement should be reached that would guarantee \"the security of shipping and suspending attacks against energy and port infrastructure in order to prevent escalation in the Black Sea\". \"We once again underline the importance of urgently ending the war between Russia and Ukraine,\" the ministry said.Turkey has sought to maintain relations with the two warring countries since Russia's full-scale invasion of Ukraine began in February 2022. It also controls the Bosphorus Strait, which is a key passage for transporting Ukrainian grain and Russian oil out to the Mediterranean. Russia carried out a second round of strikes on Odesa later in the evening which damaged the port infrastructure facility, according to the region's head of administration.\"[This] emphasises the deliberate nature of enemy strikes on the civilian infrastructure of the region,\" Oleg Kiper wrote in a Telegram post.Friday's strikes knocked out electricity for thousands of homes in Odesa.This comes as US President Donald Trump appears to have grown frustrated by the slow progress his administration is making in securing a deal to end the war between Ukraine and Russia.Despite Washington's recent diplomatic push, Kyiv and Moscow have rejected key parts of the Trump administration's proposal.While Ukraine is adamant that there should be security guarantees from the US and Europe in place before agreeing to an end to the war, Russia is continuing to demand territorial concessions - which Kyiv has resisted.Russia has been making slow gains on the ground recently.But claims it is in control of key hubs, such as the key town of Pokrovsk - a strategic point on a big road and rail artery in the eastern  Donetsk region - are being denied by the Ukrainians.And in a show of defiance on Friday, President Zelensky posted a video of himself in  Kupyansk - which Moscow claimed to have captured last month. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ukraine accuses Russia of bombing Turkish ship in Odesa",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ffbc/live/427856b0-d7c4-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-12T22:12:38.000Z",
      "dateModified": "2025-12-12T22:12:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Farmers call for French blockades over cow disease cull",
    "url": "https://www.bbc.com/news/articles/cm211xz0vl8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b38f/live/a3c8fba0-d787-11f0-b0ee-a9375724f730.jpg",
    "tag": "World",
    "date": "2025-12-12T19:20:39.000Z",
    "description": "1 day agoHugh SchofieldParis correspondent Angry French farmers are calling for more protests over the government-backed slaughter of cattle herds aff",
    "body": "1 day agoHugh SchofieldParis correspondent Angry French farmers are calling for more protests over the government-backed slaughter of cattle herds affected by so-called Lumpy Skin Disease (LSD).On Thursday there were clashes between riot police and demonstrators in the southern Ariège department, after vets were called in to destroy potentially contaminated cattle at a farm.Elsewhere in the south, farmers have dumped manure outside government buildings and blocked roads. The offices of several environmentalist groups were ransacked in the Charente-Maritime department.LSD is a highly contagious bovine disease which is transmitted mainly by fly-bites.  The symptoms are fever, mucal discharge and nodules on the skin.Though mainly non-fatal, it can badly affect milk-production and the cows are unsaleable. The disease arrived in Europe from Africa about ten years ago. France's first outbreak was in the Alps in June, when an infected herd forced the Tour de France cycle race to cut short one of its stages.The government's policy of slaughtering entire herds where a single animal has been infected has run up against bitter opposition from two of the three main farmers' unions.Conféderation Rurale and Conféderation Paysanne say the policy is being brutally applied, and is in any case unnecessary because a combination of selective culling and vaccination would suffice.But most vets disagree. \"Right now we are unable to tell the difference between a healthy animal and a symptomless animal carrying the virus. That is the only reason we have to carry out these whole-herd slaughters,\" said Stephanie Philizot who heads the SNGTV vets' union.Since June there have been around 110 outbreaks of LSD in France, originally in the east but now increasingly in the south-west. Ministry officials blame the illegal movement of cattle from affected zones. Around 3,000 animals have been slaughtered.The French government is worried the protests could snowball into a wider movement among a farming population that feels itself under growing threat from the imposition of EU norms and competition from abroad.A big protest is planned in Brussels next week during the summit of EU leaders.  Several French farming sectors are in deep crisis, from wine-growers hit by falling consumption to poultry farmers hit by avian flu.There is also widespread opposition to the impending signature of an EU free-trade agreement with South American countries, which farmers fear will open France to more cheap food imports, much of it produced under looser environmental and sanitary constraints.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Farmers call for French blockades over cow disease cull",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b38f/live/a3c8fba0-d787-11f0-b0ee-a9375724f730.jpg"
      ],
      "datePublished": "2025-12-12T19:20:39.000Z",
      "dateModified": "2025-12-12T19:20:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israel targets senior Hamas official in deadly Gaza strike",
    "url": "https://www.bbc.com/news/articles/cx2dklj3rxvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9f17/live/48111360-d84f-11f0-b67b-690eb873de1b.jpg",
    "tag": "World",
    "date": "2025-12-13T18:46:45.000Z",
    "description": "1 hour agoJames Cook,JerusalemandRushdi Abualouf,Gaza correspondent, IstanbulIsrael said it killed a senior Hamas commander on Saturday in a strike on",
    "body": "1 hour agoJames Cook,JerusalemandRushdi Abualouf,Gaza correspondent, IstanbulIsrael said it killed a senior Hamas commander on Saturday in a strike on a vehicle inside Gaza.In a joint statement, the Israeli military and security agency Shin Bet announced it had \"eliminated\" Raed Saad, the head of weapons production for Hamas's military wing, the Qassam Brigades, in Gaza city.Saad had been regarded as one of the most prominent Qassam commanders and led several brigades during Hamas's 7 October attacks on Israeli communities east of Gaza City. The Hamas-run Civil Defence spokesman, Mahmoud Basal, told the BBC that four people were killed in the strike. He said multiple passers-by were also injured by the blast.A local Hamas official in Gaza told the BBC that the strike also killed Saad's aide and another lower-ranking official identified as Abu Imad al-Laban.The BBC is prevented by Israel from reporting independently from inside Gaza and is unable to verify details of the incident. The IDF and ISA joint statement added that Saad had been \"responsible for the deaths of many soldiers\" killed in the Gaza Strip as the result of explosive devices.Saad is believed to be a member of the newly formed five-member leadership military council established since a ceasefire took hold in October. Israel has attempted to kill him on multiple occasions.One of the most notable attempts was during a surprise Israeli operation in Gaza City in March 2024, when Israeli forces reportedly sought to arrest or kill him. Sources at the time said Saad had been inside the targeted complex but managed to escape moments before the raid.He has long been considered one of Israel's most wanted Hamas figures, with Israeli attempts to kill him spanning more than two decades.Saturday's attack happened on the Palestinian-controlled side of the so-called Yellow Line which has divided Gaza since an unstable US-led ceasefire came into effect on 10 October.Israeli forces control the area to the east of the line, which includes just over half of the Gaza Strip.The first phase of US president Donald Trump's 20-point plan for peace in the region required the return of all 20 living and 28 dead hostages taken in the Hamas-led attack on southern Israel on 7 October 2023.About 1,200 people were killed in the attack and more than 250 people were taken hostage.All have been returned except for the remains of an Israeli police officer, Ran Gvili, 24, who is believed to have been killed while fighting Hamas gunmen in Kibbutz Alumim.Since then, according to Gaza's Hamas-run health ministry more than 70,000 Palestinians have been killed by Israeli military action.The diplomatic focus is now shifting to the next stage of President Trump's plan which would require the disarmament of Hamas as part of what it calls the de-radicalisation and redevelopment of Gaza.It envisages Gaza being run by the \"temporary transitional governance of a technocratic, apolitical Palestinian committee,\" overseen by a \"Board of Peace\" chaired by Trump.Security would be provided by an International Stabilisation Force although its make up remains unclear.The eventual aim is for a reformed Palestinian Authority to take control of the territory, and for Israeli forces to withdraw, after which \"the conditions may finally be in place for a credible pathway to Palestinian self-determination and statehood\". Many aspects of the plan are controversial in Israel where prime minister Benjamin Netanyahu has repeatedly rejected calls for the establishment of a Palestinian state.Trump is due to meet Netanyahu to discuss the plan in the US on 29 December.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israel targets senior Hamas official in deadly Gaza strike",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9f17/live/48111360-d84f-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-13T18:46:45.000Z",
      "dateModified": "2025-12-13T18:46:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Germany accuses Russia of 2024 cyber attack and election disinformation campaign",
    "url": "https://www.bbc.com/news/articles/cvgrrnylzzyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9023/live/e3bec6b0-d758-11f0-845f-035d2c9c25f7.jpg",
    "tag": "World",
    "date": "2025-12-12T16:50:39.000Z",
    "description": "George WrightandBethany Bell,BerlinGermany has accused Russia of a cyber-attack on air traffic control and attempted electoral interference, and summo",
    "body": "George WrightandBethany Bell,BerlinGermany has accused Russia of a cyber-attack on air traffic control and attempted electoral interference, and summoned the Russian ambassador. A foreign ministry spokesman said Russian military intelligence was behind a \"cyber-attack against German air traffic control in August 2024\". The spokesman also accused Russia of seeking to influence and destabilise the country's federal election in February this year. The latest accusations come amid heightened concern in Europe over suspected Russian cyber-attacks since Moscow launched its full-scale invasion of Ukraine in 2022.Russia has \"categorically rejected\" the claims, saying their alleged involvement in such incidents was \"absurd\".\"The accusations of Russian state structures' involvement in these incidents and in the activities of hacker groups in general are baseless, unfounded and absurd,\" Russia's embassy in Berlin said in a statement to AFP news agency.The foreign ministry in Germany said that Berlin - in close co-ordination with its European partners - would respond with counter-measures to make Russia \"pay a price for its hybrid actions\".In the last year, both the UK and Romania have accused Russia of meddling in their domestic affairs, including targeting organisations that deliver foreign assistance to Ukraine and presidential elections.The spokesman said the August 2024 cyber-attack on Germany could be attributed to the Fancy Bear Russian hacker group.\"Our intelligence findings prove that the Russian military intelligence service GRU bears responsibility for this attack,\" he added.The ministry spokesman added it was now certain that Moscow had attempted to  \"influence and destabilise both the last federal election and the ongoing internal affairs of the Federal Republic of Germany\" through a disinformation campaign called Storm 1516.The campaign, it said, had focused in part on lead Green Party candidate Robert Habeck and lead CDU candidate Friedrich Merz, who is now chancellor.The German government said security agencies had identified fake videos alleging ballot manipulation as part of a Russian disinformation effort just days before the election.Its air navigation service provider confirmed that its office communication had been hacked in August 2024. It said flights had not been affected.Fancy Bear is said to have previously leaked World Anti-Doping Agency data, and played a key role in the 2016 cyber-attack on the US Democratic National Committee, according to security experts.Russia's full-scale invasion of Ukraine has led to a major deterioration in relations between Berlin and Moscow.Germany has emerged as one of Ukraine's most vocal supporters, providing military, financial and diplomatic support for Kyiv.Chancellor Friedrich Merz has called strongly for frozen Russian assets to be used to help protect Ukraine.He has also repeatedly accused Russia of cyber warfare against his country.But relations have been strained for years, even before the Russian invasion. In 2019, an ethnic Chechen was killed by a Russian national, Vadim Krasikov, in broad daylight in Berlin's Tiergarten Park. Germany later expelled two Russian diplomats, as prosecutors suspected that he was acting on the orders of Russia's state security agency.While it is yet to respond to the latest allegations, Moscow has previously denied  European allegations of a Russian sabotage or hybrid campaign.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Germany accuses Russia of 2024 cyber attack and election disinformation campaign",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9023/live/e3bec6b0-d758-11f0-845f-035d2c9c25f7.jpg"
      ],
      "datePublished": "2025-12-12T16:50:39.000Z",
      "dateModified": "2025-12-12T16:50:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eurovision 2024 winner Nemo to return trophy in protest at Israel",
    "url": "https://www.bbc.com/news/articles/c0q5504vv0ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e60a/live/63dbfa80-d703-11f0-873e-6ffe5dbb6e3d.jpg",
    "tag": "World",
    "date": "2025-12-12T06:56:27.000Z",
    "description": "2 days agoYang TianReutersNemo made history by becoming the first non-binary performer to win Eurovision in 2024The winner of last year's Eurovision S",
    "body": "2 days agoYang TianReutersNemo made history by becoming the first non-binary performer to win Eurovision in 2024The winner of last year's Eurovision Song Contest, Nemo, has said they are returning their trophy in protest over Israel's continued participation in the event.The 26-year-old Swiss singer said there was a \"clear conflict\" between Israel's involvement in the competition and the ideals of \"unity, inclusion and dignity\" the contest says it stands for.Martin Green, director of the Eurovision Song Contest, said Eurovision was \"saddened\" by the decision and respected Nemo's views.Israel's presence at Eurovision has been an increasing source of tension, because of the war in Gaza and a voting controversy during this year's event.Five countries - Iceland, Spain, Ireland, Slovenia and the Netherlands - have announced they will boycott next year's event because Israel has been allowed to compete.Israel has previously called the decision to keep it in the contest a \"victory\" over critics who had tried to silence it and spread hatred.Nemo became the first non-binary performer to lift the Eurovision trophy with their song The Code, which is about the path to realising they were non-binary.After the win, Nemo told the BBC about the challenges they faced during the contest and their feeling that organisers had not done enough to support participants caught up in the row over Israel's inclusion in 2024.\"I felt very alone. I really hope they have things in place for the next year,\" Nemo said at the time. It prompted a series of new measures to be introduced to protect the mental well-being of Eurovision's artists and staff.In a statement posted to Instagram on Thursday, Nemo said they felt the European Broadcasting Union's (EBU) decision to allow Israel to still take part in the event no longer aligned with its core values.\"Israel's continued participation, during what the UN's Independent International Commission of Inquiry has concluded to be a genocide, shows a clear conflict between those ideals and the decision made by the EBU,\" they said, referring to a report released in September.\"Even though I am immensely grateful for the community around this contest and everything this experience has taught me both as a person and artist, today I no longer feel this trophy belongs on my shelf.\"Nemo also posted a video of them placing the trophy in a cardboard box, saying it will be sent back to the EBU's headquarters in Geneva.In a statement sent to BBC News, Martin Green said: \"We're saddened that Nemo wishes to return their trophy which they deservedly won in 2024. \"We respect the deeply held views Nemo has expressed and they will always remain a valued part of the Eurovision family\"EPANemo performing at the 2024 Eurovision in Malmo, SwedenThe boycotts and protests over Israel's inclusion have been the biggest crisis Eurovision has ever seen.This year's competition also had a voting controversy and allegations that Israel's government tried to influence the public vote.This prompted some competition rules to be changed and tightened, after which a \"large majority\" of members agreed there was no need for a further vote on participation and that Eurovision 2026 could proceed as planned, the EBU has said.Israel's President Isaac Herzog has praised the decision to allow the country to compete, calling it an \"appreciated gesture of solidarity, brotherhood, and co-operation\".Addressing the boycotts, Nemo insisted that their decision to hand back the trophy was not about \"individuals or artists\", but rather what they believed was the use of Eurovision to \"soften the image of a state accused of severe wrongdoing\".\"When entire countries withdraw, it should be clear that something is deeply wrong,\" they added.\"If the values we celebrate on stage aren't lived off stage then even the most beautiful songs become meaningless.\"The war in Gaza was triggered by the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage. More than 70,370 people have been killed in Israeli attacks in Gaza since then, according to the territory's Hamas-run health ministry.Next year's Eurovision is due to take place in Vienna, for what is supposed to be a celebratory 70th anniversary edition of the contest.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eurovision 2024 winner Nemo to return trophy in protest at Israel",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e60a/live/63dbfa80-d703-11f0-873e-6ffe5dbb6e3d.jpg"
      ],
      "datePublished": "2025-12-12T06:56:27.000Z",
      "dateModified": "2025-12-12T06:56:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Takeaways from Luigi Mangione's evidence hearing ",
    "url": "https://www.bbc.com/news/articles/czrkkm83znpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9487/live/75075910-d804-11f0-b67b-690eb873de1b.jpg",
    "tag": "World",
    "date": "2025-12-13T01:18:21.000Z",
    "description": "An eyebrow tip and McDonald's footage: Takeaways from Luigi Mangione's evidence hearing 19 hours agoMadeline HalpertGetty ImagesMr Mangione has watche",
    "body": "An eyebrow tip and McDonald's footage: Takeaways from Luigi Mangione's evidence hearing 19 hours agoMadeline HalpertGetty ImagesMr Mangione has watched as the court plays body camera footage from the day of his arrestLuigi Mangione, the man accused of fatally shooting United Healthcare CEO Brian Thompson in a case that sparked national attention, watched as new testimony and never-before-seen footage from the day of his arrest in a McDonald's was unveiled during a hearing this week.Mr Mangione has pleaded not guilty to state charges related to the 2024 murder of Mr Thompson, a father of two, as well as federal counts that carry the possibility of the death penalty.The pre-trial hearing is focused on the defence's attempts to keep certain evidence out of the trial, which has not been scheduled yet, including items found in his backpack during his arrest and statements he made to officers.During the first two weeks of the hearing, supporters of Mr Mangione - the scion of a prominent Maryland family and Ivy League graduate - filled the back rows of the Manhattan criminal courtroom, some wearing a pin portraying him as a saint-like figure.Prosecutors and Mr Mangione's legal team are expected to question over a dozen witnesses from the day of his arrest, including the employees who spotted him and the police who arrested him.Here is a look at some of the key pieces of evidence discussed that offer a window into Mr Mangione's trial.An eyebrow giveawayThe pre-trial hearing has centred on the small-town McDonald's in Altoona, Pennsylvania, where officers were shocked to find the high-profile suspect days after Mr Thompson was fatally shot - and hours from the busy Midtown Manhattan crime scene.Witnesses suggested the arrest may never have occurred there if not for one of  Mr Mangione's key features: his eyebrows.During the first day of the hearing, prosecutors played a call to police from a McDonald's employee about a tip from a customer in the restaurant.The employee said the customer thought a patron looked like the suspect in the United Healthcare CEO shooting. The patron was well covered, wearing a black hoodie, a medical mask and a tan beanie. But one key detail stuck out.\"The only thing you can see is his eyebrows,\" the employee told police.It was not the only time Mr Mangione's distinguished eyebrows have come up. Prosecutors also entered into evidence notecards they say Mr Mangione had, which appeared to be to-do lists for the days after the high-profile shooting.One card reads: \"Keep momentum, FBI slower overnight,\" while another said: \"Change hat, shoes, pluck eyebrows\".New York County District Attorney's OfficeProsecutors said Mr Mangione was carrying a note that appeared to be a to-do list, with instructions to \"change hat, shoes, pluck eyebrows\"'Preposterous': An unexpected day at McDonald'sDozens of videos released by prosecutors show Mr Mangione's encounter with police and his eventual arrest in the McDonald's as other customers watched.Officers who responded narrated the footage this week, telling the court what was going through their minds as they realised the 27-year-old appeared similar to the suspect in photos.On Thursday, Altoona Lieutenant William Hanelly said a fellow officer responded sarcastically that he would \"get right on it\" when he heard the tip about the suspect.Mr Hanelly told the court that he understood the sarcasm, because it seemed \"preposterous\" that a shooter from \"New York City had found his way to a McDonald's in Altoona, Pennsylvania\".But at the scene, officers said they quickly saw the resemblance to New York Police Department pictures circulated to the public after days without any leads.\"It's him. I'm not kidding. He's real nervous. It's him,\" one officer can be heard telling Mr Hanelly in a phone call played for the court.In one video, Mr Mangione eats a McDonald's meal as officers stand guard around him in the restaurant waiting for more officers to arrive.At the hearing, Mr Mangione watched the videos quietly from the defence table, seated next to his lawyers - wife and husband Karen Friedman Agnifilo and Marc Agnifilo. The latter defended Sean \"Diddy\" Combs, who was acquitted of sex trafficking and racketeering charges just months earlier.Wearing a grey suit and button-down shirt most days, Mr Mangione frequently took notes on a legal pad, and occasionally smiled and laughed with his lawyers.A fake name leads to an arrestWatch: \"What's your name?\" - Moment police confront Luigi Mangione at McDonald'sIn the series of police body camera videos played for the court, Mr Mangione's interactions with officers eventually lead to his arrest on 9 December as Christmas music plays loudly in the background of the McDonald's.When officers first speak to Mr Mangione, they ask him to pull his mask down. He listens, and is heard telling officers his name is \"Mark Rosario\", handing them a New Jersey identification that police later said was false.That identification gave officers enough cause to arrest Mr Mangione, Mr Hanelly told the court, and in the video, Mr Mangione tells officers his real name is Luigi.In another body camera video, an officer tells the 27-year-old he is under police investigation for giving a fake identification and Mr Mangione is seen putting his hands on the wall as officers arrest him.They then take a photo of Mr Mangione with his hands behind his back, an image  widely circulated on social media after his arrest.Bullets, a journal and cash: a peek into Mr Mangione's backpackThe pre-trial hearing also shed light on the items Mr Mangione was carrying when he was arrested.Mr Mangione's lawyers have argued that a 9mm handgun as well as a notebook should be excluded from trial because officers did not have a warrant to search his backpack. Prosecutors allege that Mr Mangione wrote in his notebook about \"the deadly, greed-fuelled health insurance cartel\".During the hearing on Thursday, Mr Hanelly argued that there were exceptions for warrants.Earlier in the week, Ms Friedman Agnifilo questioned the officer who searched Mr Mangione's backpack, arguing they were searching the bag \"because you thought he was the New York City shooter\".\"No, we search everyone,\" said the officer, Christy Wasser.New York County District Attorney's OfficeEvidence found during Mr Mangione's arrestVideo played in court shows a police officer pulling a series of items from the backpack, including a handgun magazine that Mr Hanelly said contained 9 mm bullets - all as Holly Jolly Christmas plays over the speaker.One law enforcement official comes across a journal in the backpack, and can be heard saying it reads like a \"manifesto\".Ms Agnifilo objected after the \"manifesto\" part of the video was played repeatedly  in court, arguing the prosecutor wanted to emphasise the line.Eventually, Mr Hanelly testified, the officers decided to stop searching the backpack and take it to the police station because \"it was going to be a mess\".Prosecutors this week entered into evidence images of other items Mr Mangione had with him, including a gun, a silencer, dozens of $100 bills, face masks, a hair trimmer and a passport.The hearing is expected to continue into next week.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Takeaways from Luigi Mangione's evidence hearing ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9487/live/75075910-d804-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-13T01:18:21.000Z",
      "dateModified": "2025-12-13T01:18:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Belarus frees 123 prisoners as US lifts sanctions",
    "url": "https://www.bbc.com/news/articles/c4gpwlkklyxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/31db/live/81bf8470-d854-11f0-a8dc-93c15fe68710.jpg",
    "tag": "World",
    "date": "2025-12-13T18:50:22.000Z",
    "description": "1 hour agoSarah Rainsford,VilniusandDearbail JordanWatch: BBC captures celebrations as Belarus frees political prisonersBelarus has freed 123 prisoner",
    "body": "1 hour agoSarah Rainsford,VilniusandDearbail JordanWatch: BBC captures celebrations as Belarus frees political prisonersBelarus has freed 123 prisoners, including prominent opposition activist Maria Kolesnikova, after the US agreed to lift sanctions on the country.Nobel Peace Prize winner Ales Bialiatski is also among those who have been released following talks in Minsk with US President Donald Trump's special envoy for Belarus, John Coale.The US has agreed to lift sanctions on potash, a key ingredient in fertiliser and an important export for Belarus, which is a close ally of Russia. Coale said: \"As relations between the two countries normalise, more and more sanctions will be lifted.\"Belarus' president, Alexander Lukashenko, is not recognised as president by the EU. Kolesnikova has been in prison since 2020, much of the time in isolation.Her sister, Tatiana Khomich, who campaigned tirelessly for her release, was able to speak to her by video call soon after and confirmed the news to the BBC.\"She is free, she looks fine, she looks good,\" said Khomich, who said she was looking forward to giving her sibling a hug.Kolesnikova was handed over to Ukraine along with 113 other prisoners, according to Kyiv's Coordination Headquarters for the Treatment of Prisoners of War.In a statement on Telegram, Ukraine said that after receiving the necessary medical assistance, the prisoners will be transported to Poland and Lithuania.ReutersNobel Peace Prize winner Ales Bialiatski arrives in VilniusSvetlana Tikhanovskaya, the exiled Belarusian opposition leader who was waiting outside the US embassy in Vilnius, told the BBC the decision to send them to Ukraine was unexpected and had been made by Lukashenko.A small number, including Bialiatski, were transported to the Lithuanian capital.After embracing Tikhanovskaya, Bialiatski said: \"Thousands of people have been and continue to be imprisoned...so our struggle continues.\"Khomich said the first thing Kolesnikova said when they spoke was \"thank you to the US administration, President Trump [and] to the Belarus government as well for leading and talking and having these negotiations\".The deal is a major achievement for Lukashenko. The authoritarian leader will also welcome how the Americans have ended his international isolation.As well as the EU, the US did not recognise Lukashenko as president following unfair elections five years ago which led to mass street protests that were brutally suppressed by police.Hundreds of people were arrested then - including Kolesnikova - and the intense political repression has continued.Coordination Headquarters for the Treatment of Prisoners of WarMaria Kolesnikova and 113 other prisoners were transported to Ukraine from BelarusWestern sanctions were tightened following Russia's full scale invasion of Ukraine in 2022, when troops entered via Belarus and missiles were launched from its territory.Coale was quoted by Belarusian state media saying that the sanctions on potash would be lifted immediately.The US envoy also said he spoke to Lukashenko about Ukraine and what help Minsk could offer in talks with Putin.The attempt to engage with Minsk is part of a major shift in US policy, which leaves it very much at odds with Europe where the approach is to sanction and isolate.Viktor Babaryko, a Belarusian opposition politician who was arrested five years ago, was also released on Saturday along with Marina Zolotova, editor-in-chief of  independent news site Tut.by. Commenting on the US deal with Belarus over potash shipments in exchange for the releases, Tikhanovskaya said sanctions are \"leverage to make dictators do something\".She said: \"Lukashenko will not release people because he somehow became humane, he wants to sell people as expensive as possible.\"Of course, it is the price. But we understand that American sanctions are rather flexible.\"They can lift them tomorrow if some deals are not fulfilled.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Belarus frees 123 prisoners as US lifts sanctions",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/31db/live/81bf8470-d854-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-13T18:50:22.000Z",
      "dateModified": "2025-12-13T18:50:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ghana's Abu Trica charged with scamming elderly Americans",
    "url": "https://www.bbc.com/news/articles/c4g99kp897do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b793/live/b08aed70-d747-11f0-a0e7-5f6021480149.jpg",
    "tag": "World",
    "date": "2025-12-12T11:47:29.000Z",
    "description": "1 day agoThomas NaadiBBC Africa, AccraA popular Ghanaian social media influencer known as Abu Trica, whose real name is Frederick Kumi, has been arres",
    "body": "1 day agoThomas NaadiBBC Africa, AccraA popular Ghanaian social media influencer known as Abu Trica, whose real name is Frederick Kumi, has been arrested over allegations he orchestrated a romance scam that defrauded elderly Americans of over $8m (£5.9m).Prosecutors said he used AI tools to create fake online identities, targeting victims through social media and dating sites, earning their trust then extorting their money.Kumi faces charges in the US of conspiracy to commit wire fraud and a money laundering conspiracy and faces up to 20 years in prison if found guilty.The 31-year-old was arrested in Ghana following a joint operation between the two countries and the US will now seek to extradite him.He has not yet commented on the allegations.Kumi, who is also known as Emmanuel Kojo Baah Obeng, flaunted luxury items online to his more than 100,000 Instagram followers.This raised suspicions about the sources of his income.''The perpetrators built trust through frequent, intimate conversations by phone, email, and messaging platforms\" with victims, said prosecutors. \"They then requested money or valuables under false pretences, such as urgent medical needs, travel expenses, or investment opportunities.'' The monies, or valuables, were then directed to co-conspirators posing as third parties. Kumi allegedly distributed the money to his associates in US and in Ghana.The case is being prosecuted under the US Elder Abuse Prevention and Prosecution law.US authorities have in recent months stepped up their crackdown on criminal networks operating in the US and West Africa who seek to defraud elderly Americans.In July this year,  an alleged Ghanaian fraudster, popularly known as Dada Joe Remix, was extradited to the US for using romance and inheritance schemes to defraud Americans.Earlier this month, a court in the US also sentenced Oluwaseun Adekoya, a Nigerian ringleader of nationwide bank fraud and money laundering conspiracies, to 20 years in prison for laundering over $2m.Additional reporting by Natasha Booty",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ghana's Abu Trica charged with scamming elderly Americans",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b793/live/b08aed70-d747-11f0-a0e7-5f6021480149.jpg"
      ],
      "datePublished": "2025-12-12T11:47:29.000Z",
      "dateModified": "2025-12-12T11:47:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nobel laureate Narges Mohammadi arrested in Iran, supporters say",
    "url": "https://www.bbc.com/news/articles/cly559exm87o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4e9c/live/6a63f800-d774-11f0-825e-eb4c8fb7e95e.jpg",
    "tag": "World",
    "date": "2025-12-12T18:21:44.000Z",
    "description": "1 day agoAndré Rhoden-PaulAFP via Getty ImagesIranian security forces have \"violently arrested\" Nobel Peace Prize winner and women's rights activist N",
    "body": "1 day agoAndré Rhoden-PaulAFP via Getty ImagesIranian security forces have \"violently arrested\" Nobel Peace Prize winner and women's rights activist Narges Mohammadi, her foundation has said. The Narges Foundation said Ms Mohammadi, 53, was detained in the eastern city of Mashhad, along with other activists. The Nobel Committee said it was \"deeply concerned by today's brutal arrest of Narges Mohammadi\" and called on the authorities \"to immediately clarify Mohammadi's whereabouts, ensure her safety and integrity, and to release her without conditions\". Iran does not appear to have commented.  Ms Mohammadi was awarded the 2023 Nobel Peace Prize for her activism against female oppression in Iran and promoting human rights. In December 2024, she was given a temporary release from jail for three weeks on medical grounds, after being held in Tehran's notorious Evin prison since 2021. She was expected to return to prison soon after, where she was serving multiple sentences. Her latest arrest reportedly came as she attended a memorial ceremony for Khosrow Alikordi, a lawyer found dead in his office last week. Norway-based group Iran Human Rights had called for an independent inquiry to establish how he died, saying the circumstances around his death were \"suspicious\". Several other activists were detained at the ceremony, where it's reported they shouted slogans, including \"death to the dictator\" and \"long live Iran\". Taghi Rahmani, Ms Mohammadi's husband, told BBC Persian: \"They arrested Narges violently. The brother of the lawyer witnessed her arrest at the memorial.\"This act is against human rights laws, and amounts to some kind of revenge. \"This happened in Mashhad today and is concerning because the establishment's crackdown has intensified recently.\"Ms Mohammadi had recently accused the Iranian authorities of intensifying repression since the June ceasefire with Israel. Last week she wrote an article for Time magazine about the Iranian state controlling all aspects of personal or public life. \"Their peace is disrupted by surveillance, censorship, arbitrary arrest, torture, and the constant threat of violence,\" she said. She had also told the Nobel Committee she had received warnings from \"agents of the regime\" through indirect channels and her lawyers. \"The threats conveyed to Ms Mohammadi make it clear that her security is at stake, unless she commits to end all public engagement within Iran, as well as any international advocacy or media appearances in support of democracy, human rights, and freedom of expression,\" the Nobel committee's statement added.Over the past year, she has continued to remain defiant, refusing to wear the mandatory headscarf and meeting fellow activists across the country.Across her lifetime, Mohammadi has been arrested 13 times and been sentenced to more 36 years imprisonment and 154 lashes, according to her foundation. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nobel laureate Narges Mohammadi arrested in Iran, supporters say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4e9c/live/6a63f800-d774-11f0-825e-eb4c8fb7e95e.jpg"
      ],
      "datePublished": "2025-12-12T18:21:44.000Z",
      "dateModified": "2025-12-12T18:21:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "One million households without electricity in Ukraine after Russian strikes",
    "url": "https://www.bbc.com/news/articles/c0l9954yr9ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/de32/live/fa10f510-d81a-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "World",
    "date": "2025-12-13T12:43:16.000Z",
    "description": "One million households without power in Ukraine after Russia attacks energy grid7 hours agoAlex BoydState Emergency Service Of UkraineA firefighter wo",
    "body": "One million households without power in Ukraine after Russia attacks energy grid7 hours agoAlex BoydState Emergency Service Of UkraineA firefighter works at the site of a Russian strike in OdesaMore than a million households are without electricity in Ukraine after a barrage of overnight Russian strikes hit energy and industrial infrastructure, officials said.Ukraine's internal affairs minister, Ihor Klymenko, said five regions were hit and at least five people were injured, and work was under way to extinguish fires and restore supplies.While Russian attacks on Ukrainian energy infrastructure have been common throughout the war, Moscow has intensified strikes as the country heads into winter.It comes as US President Donald Trump's overseas envoy will travel to Germany this weekend to meet Ukrainian President Volodymyr Zelensky and European leaders for more talks on ending the war.Steve Witkoff, who has been leading White House attempts to mediate between Ukraine and Russia, will discuss the latest version of the proposed peace agreement in Berlin.On Saturday, Zelensky said more than 450 drones and 30 missiles were used by Russia in overnight strikes. Klymenko said the Dnipropetrovsk, Kirovohrad, Mykolaiv, Odesa and Chernihiv regions were hit.Russia's defence ministry said it used weapons including Kinzhal hypersonic missiles in the strikes - which are hard to track as they can change direction mid-flight.The International Atomic Energy Agency (IAEA) said Ukraine's Zaporizhzhia nuclear power plant temporarily lost all offsite power overnight \"due to widespread military activities affecting the electrical grid\", but is now reconnected. The plant is in Russian-controlled territory in Ukraine. It is not operating, but relies on a constant power supply to cool its reactors.In Russia, regional governor Roman Busargin said two people were killed in Saratov after a drone strike hit a residential building.The Trump administration is pushing for a deal to end the war to be in place by Christmas and has held several rounds of talks with Ukrainian and Russian representatives in recent weeks, though there has been little sign a breakthrough is imminent. It has not yet been confirmed which European leaders will attend the Berlin talks.The Wall Street Journal, which first reported details of the meeting, said UK Prime Minister Sir Keir Starmer, French President Emmanuel Macron and German Chancellor Friedrich Merz would all take part. The Witkoff-Zelensky meeting comes after Ukraine gave the US its revised version of a 20-point peace plan, the latest iteration of a proposal which first emerged in late November and has triggered a flurry of diplomatic activity.The fate of territory in eastern Ukraine remains one of the most intractable topics in the negotiations, with Kyiv refusing to cede land which has been illegally occupied, and Moscow repeating its intention to take the Donbas region in full by force unless Ukraine withdraws.Zelensky has reacted sceptically to the White House's latest proposal on resolving the territorial question, which is for Ukraine's army to pull out of the region and for it to be turned into a \"special economic zone\".The Ukrainian president told reporters that under the US-proposed terms, the Kremlin would undertake not to advance into the areas vacated by Ukraine's forces, with the land between Russian-controlled parts of the Donbas and Ukraine's defensive lines effectively turned into a demilitarised zone.\"What will restrain [Russia] from advancing? Or from infiltrating disguised as civilians?\" said Zelensky.In public, Ukraine and its allies in Europe have described the US-led talks as fruitful, and have hailed progress on securing amendments to a plan which was widely viewed as favouring Russia when it first emerged. But there have been signs in recent weeks that Trump is losing patience with Zelensky and his backers on the continent.In a scathing interview with Politico earlier this week, the US president labelled European leaders \"weak\" and renewed his calls for Ukraine to hold elections.Zelensky said elections could be held within 90 days if the US and Europe provided the necessary security. Elections have been suspended since martial law was declared when Russia launched its full-scale invasion in February 2022.As the White House's diplomatic push continues, attention in Europe is focused on how to support Ukraine in the event of a peace deal, with talks ongoing over security guarantees and funding. The Ukrainian government faces a stark financial situation: it needs to find an extra €135.7bn (£119bn; $159bn) over the next two years.On Friday, EU nations agreed to indefinitely freeze around €210bn (£185bn; $247) worth of Russian assets held in Europe. It is hoped the agreement paves the way for the funds to be loaned back to Ukraine if a deal can be reached at an EU summit next week, providing Kyiv with financial help for its military and efforts to rebuild parts of the country left devastated after nearly four years of all-out war.That move has been condemned as theft by the Kremlin, and Russia's central bank has said it will sue Euroclear, a Belgian bank where the vast majority of Russian assets frozen after the invasion are held.Officials are still negotiating the exact structure of a deal to repurpose the Russian assets on behalf of Ukraine, with the Belgian government particularly sceptical due to its legal exposure as the main holder. Elsewhere, it was reported that the latest version of the peace plan being circulated envisions Ukraine rapidly joining the European Union.The Financial Times said Brussels backed Ukraine's swift accession to the bloc, an idea proposed by Ukraine in the latest draft it has given to Washington.Ukraine formally applied to join the EU days after the 2022 invasion, but despite promises of an accelerated process is still several years away from becoming a member.Under the plan, Ukraine would become a member as soon as January 2027, AFP reported, citing an unnamed senior official. It was unclear whether Washington had approved that element of the draft.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "One million households without electricity in Ukraine after Russian strikes",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/de32/live/fa10f510-d81a-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-13T12:43:16.000Z",
      "dateModified": "2025-12-13T12:43:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]