[
  {
    "title": "Mexico: Seven bodyguards arrested over mayor's murder",
    "url": "https://www.bbc.com/news/articles/cq60rpmq641o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/925a/live/3e4c9d90-c78d-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-22T10:33:57.000Z",
    "description": "Seven bodyguards have been arrested over their alleged involvement in the murder of a popular Mexican mayor, authorities have said.Carlos Manzo, the m",
    "body": "Seven bodyguards have been arrested over their alleged involvement in the murder of a popular Mexican mayor, authorities have said.Carlos Manzo, the mayor of Uruapan and an outspoken critic of cartel violence, was shot dead on 1 November at a public event marking the Day of the Dead.The office of the attorney general of Michoacán state said in a brief statement that the public servants had been detained \"for their probable participation in the crime of aggravated homicide, in commission by omission\" in relation to Manzo's killing.It follows the arrest on Wednesday of a man police described as the mastermind behind the murder, who officials said had links to a powerful cartel.The attorney general's office in Michoacán, to the west of the capital, Mexico City, said the seven guards had been arrested by both state and federal officials, including the National Guard.Troops and agents led the suspects out of a municipal building on Friday near where Manzo had been killed, according to the Associated Press.The 40-year-old mayor was attending a Day of the Dead ceremony - which honours deceased family and friends - alongside his relatives when he was shot seven times, sending bystanders running for cover.Manzo's assassination triggered mass protests and questions have been raised about why his security detail failed to stop the lone gunman. The suspect was later restrained and shot by Manzo's bodyguards. Manzo had been outspoken about how avocado growers in the region were being extorted and threatened by criminal groups, and had also demanded that Mexico's federal government do more to rein in the cartels.The Jalisco New Generation Cartel (CJNG), which Mexico's security minister blamed for Manzo's slaying, engages in drug trafficking, as well as kidnapping for ransom and extortion.It is also infamous for targeting public officials who refuse to do its bidding.Mexican officials arrested the supposed mastermind of the assassination, named only by his forenames Jorge Amando, on Wednesday.While the CJNG is thought to be the most powerful of the criminal gangs operating in Michoacán, there are many others and their fights for control of drug, arms and fuel smuggling routes often result in deadly confrontations.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mexico: Seven bodyguards arrested over mayor's murder",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/925a/live/3e4c9d90-c78d-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-22T10:33:57.000Z",
      "dateModified": "2025-11-22T10:33:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mystery drones halt air traffic near Dutch city of Eindhoven",
    "url": "https://www.bbc.com/news/articles/cewjlr0v02ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1952/live/da8afd00-c7e7-11f0-a9f0-9f5579338902.png",
    "tag": "World",
    "date": "2025-11-22T21:25:47.000Z",
    "description": "7 hours agoAleks PhillipsAFP via Getty ImagesAir traffic above the southern Dutch city of Eindhoven has been suspended after unidentified drones were ",
    "body": "7 hours agoAleks PhillipsAFP via Getty ImagesAir traffic above the southern Dutch city of Eindhoven has been suspended after unidentified drones were spotted near the airport.Drones were first observed late on Friday over the nearby Volkel air force base. Weapons were deployed to try to shoot them down but the devices got away.Following more drone sightings near the main airport on Saturday, the airspace in the area was closed to both civilian and military flights. Dutch Defence Minister Ruben Brekelmans said \"counter-drone assets\" were ready to intervene.It is the latest in a series of such incidents at military installations and airfields in northern Europe in recent months. Russia has denied accusations it was involved in them.As well as being used by the Royal Netherlands Air Force, Volkel Air Base hosts a US Air Force squadron as part of Nato.Officials said that for security reasons they would provide no details about how the drones were first spotted on Friday or what action was taken to try to bring them down.Drones have been sighted at other Dutch air bases in the past few weeks, as well as facilities in neighbouring Belgium, Denmark and Germany.A lack of evidence pointing to their origins has plagued investigations into the incidents since they began in September, as in many cases the drones depart after a while.Some European officials have attributed the sightings to \"hybrid warfare\" on the part of Russia, as the nations that have been targeted are all allied to Ukraine.But the Kremlin has denied it has anything to do with past incursions. Defence ministers from 10 EU countries have agreed to create a \"drone wall\" in response to the sightings, while some individual nations have sought to secure anti-drone defence measures.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mystery drones halt air traffic near Dutch city of Eindhoven",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1952/live/da8afd00-c7e7-11f0-a9f0-9f5579338902.png"
      ],
      "datePublished": "2025-11-22T21:25:47.000Z",
      "dateModified": "2025-11-22T21:25:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Three arrested in India after police crack $800,000 bank heist",
    "url": "https://www.bbc.com/news/articles/cy8j4m45yx2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e250/live/492bce90-c7ae-11f0-83e1-2f64c544cba6.jpg",
    "tag": "World",
    "date": "2025-11-22T16:28:18.000Z",
    "description": "12 hours agoImran Qureshi and Jessica RawnsleyThree people have been arrested in India after a daring 70m rupees ($800,000; £600,000) heist in which a",
    "body": "12 hours agoImran Qureshi and Jessica RawnsleyThree people have been arrested in India after a daring 70m rupees ($800,000; £600,000) heist in which armed men posing as central bank officials robbed an ATM cash van.On Saturday police in the southern city of Bengaluru said they had cracked the case and recovered 57.6m rupees of the money stolen three days earlier.\"Our investigation is on track to get the remaining amount,\" Bengaluru police commissioner Seemant Kumar Singh told reporters.Singh later told the BBC three suspects had been detained. \"We are looking for two to three more,\" he added.Those people arrested include Gopal Prasad, an employee of cash transport company CMS, J Xavier, a former CMS worker, and Annappa Naik, a local police constable.The robbery took place in broad daylight in the Lalbagh area of Bengaluru. The thieves pretended to be officers of the Reserve Bank of India. They stopped the transport vehicle saying they had to check the paperwork for such a large amount of money.The vehicle's cash custodian and two security guards were instructed to get into an SUV, while one of the gang members took control of the van, police said.Police said the gang had changed vehicles, used fake registration plates and selected locations with minimal CCTV coverage to transfer the boxes of cash.A massive hunt was launched on Wednesday, with more than 200 police officers deployed across Karnataka state and the neighbouring Kerala, Tamil Nadu, Telangana, Andhra Pradesh and Goa states.Detectives are investigating the role of CMS and possible violations of guidelines for transferring cash, Singh said.\"The vans should not follow the same route and timing repeatedly so as to become predictable,'' he added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Three arrested in India after police crack $800,000 bank heist",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e250/live/492bce90-c7ae-11f0-83e1-2f64c544cba6.jpg"
      ],
      "datePublished": "2025-11-22T16:28:18.000Z",
      "dateModified": "2025-11-22T16:28:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "JFK granddaughter shares terminal cancer diagnosis",
    "url": "https://www.bbc.com/news/articles/cpvdyg348pko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2d43/live/ef259260-c7cf-11f0-b259-1f10e6cadd18.jpg",
    "tag": "World",
    "date": "2025-11-22T19:21:08.000Z",
    "description": "The granddaughter of former US President John F Kennedy Jr has announced her diagnosis with an aggressive form of cancer, with the 35-year-old saying ",
    "body": "The granddaughter of former US President John F Kennedy Jr has announced her diagnosis with an aggressive form of cancer, with the 35-year-old saying she has been given less than a year to live.Tatiana Schlossberg, the daughter of former US Ambassador Caroline Kennedy, shared the news in an essay published in The New Yorker on Saturday - the 62nd anniversary of her grandfather's assassination.The mother of-two climate journalist has been an outspoken opponent of her relative Robert F Kennedy Jr's position as US health secretary under President Donald Trump.In her essay, Schlossberg describes her alarm at watching her second cousin be approved to the post as she was battling her illness. According to Schlossberg's essay - titled A Battle With My Blood - she was diagnosed with acute myeloid leukaemia after giving birth in May 2024.She describes her previously healthy lifestyle, which included running, skiing and even once swimming in New York's Hudson River, \"eerily, to raise money for the Leukemia and Lymphoma Society\".Despite treatment, including a bone marrow transplant and chemotherapy, she says doctors have told her the outcome does not look good. \"During the latest clinical trial, my doctor told me that he could keep me alive for a year, maybe,\" she writes. \"My first thought was that my kids, whose faces live permanently on the inside of my eyelids, wouldn't remember me.\" Schlossberg's son was born in 2022 and her daughter in 2024.Schlossberg, whose uncle John F Kennedy Jr died in a plane crash at age 38 and whose grandmother Jacqueline Kennedy Onassis died of cancer when Schlossberg was a toddler, also describes the pain she fears her death will cause her mother, who previously served as US ambassador to Australia and Japan. \"For my whole life, I have tried to be good, to be a good student and a good sister and a good daughter, and to protect my mother and never make her upset or angry. Now I have added a new tragedy to her life, to our family's life, and there's nothing I can do to stop it,\" she writes.She also describes her upset at watching her second cousin, known as RFK Jr - whose father Robert F Kennedy was also assassinated while running for president - become Trump's health secretary.\"I watched from my hospital bed as Bobby, in the face of logic and common sense, was confirmed for the position, despite never having worked in medicine, public health, or the government,\" she writes. \"Suddenly, the healthcare system on which I relied felt strained, shaky.\"Earlier this month, her brother Jack Schlossberg announced that he is planning to run for Congress in New York. He shared her essay online on Saturday, with the caption, \"Life is short - let it rip.\"The Kennedy family's generations-spanning participation in US politics - along with the personal tragedy which has often touched its members - has garnered it a prominent reputation in American life.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "JFK granddaughter shares terminal cancer diagnosis",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2d43/live/ef259260-c7cf-11f0-b259-1f10e6cadd18.jpg"
      ],
      "datePublished": "2025-11-22T19:21:08.000Z",
      "dateModified": "2025-11-22T19:21:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paul Costelloe: Irish fashion designer dies aged 80",
    "url": "https://www.bbc.com/news/articles/cly3w4we7gxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b343/live/0411c700-c7b4-11f0-83e1-2f64c544cba6.jpg",
    "tag": "World",
    "date": "2025-11-22T16:39:20.000Z",
    "description": "12 hours agoGetty ImagesPaul Costelloe during London Fashion Week September 2025Irish fashion designer Paul Costelloe has died in London aged 80.Coste",
    "body": "12 hours agoGetty ImagesPaul Costelloe during London Fashion Week September 2025Irish fashion designer Paul Costelloe has died in London aged 80.Costelloe became one of the best-known names in British and Irish fashion and was personal designer to the late Diana, the Princess of Wales.His family issued a statement on Saturday saying they were \"deeply saddened to announce the passing of Paul Costelloe following a short illness\".They added: \"He was surrounded by his wife and seven children and passed peacefully in London.\"Getty ImagesPaul Costelloe at London Fashion Week in 2022He was born in Dublin where his father ran a successful company making raincoats. After studying at the Grafton Academy of Fashion Design he moved to Paris where he took a course at the Chambre Syndicale de la Haute Couture in Paris.He set up his own label in 1979, Paul Costelloe Collections, and presented collections at London Fashion Week, as well as in Paris, Milan and New York. Getty ImagesCostelloe was Princess Diana's personal designer In 1983 he was appointed personal designer to Diana, Princess of Wales, a collaboration which continued until her death in 1997.Costelloe  often used traditional Irish fabrics and textiles in his designs, including Irish linen and tweed.He collaborated with Dunnes Stores and was the closing designer for the inaugural Ireland Fashion Week in October this year.Getty ImagesPaul Costelloe and models pose on the runway at the Paul Costelloe presentation during London Fashion Week September 2017He was criticised in 1998 when he said that Irish women lacked style.\"Irish women have difficulty with style because it's not in their inner nature... like the Italians,\" he said at the timeHowever, during an interview with Irish broadcaster RTÉ this year, he said he felt that Ireland was more European than years ago.Taoiseach (Irish PM) Micheál Martin said he was \"very saddened to learn of the passing of Paul Costelloe\".\"An icon of design, Paul elevated Irish fashion to the global stage,\" he said.Tánaiste (deputy PM) Simon Harris said Costelloe had \"led a remarkable life\".Harris added: \"He built a hugely successful business through incredible talent, discipline, and an unwavering commitment to quality.\"He leaves behind a body of work that shaped modern Irish fashion and will continue to shape it in the years to come. He will be greatly missed and warmly remembered.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paul Costelloe: Irish fashion designer dies aged 80",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b343/live/0411c700-c7b4-11f0-83e1-2f64c544cba6.jpg"
      ],
      "datePublished": "2025-11-22T16:39:20.000Z",
      "dateModified": "2025-11-22T16:39:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steve Rosenberg: Putin uncompromising as leaked plan reaches Moscow",
    "url": "https://www.bbc.com/news/articles/c5y9k0mrm2ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0ab6/live/15f39120-c6f0-11f0-b222-8b5ed945ab17.jpg",
    "tag": "World",
    "date": "2025-11-21T18:21:53.000Z",
    "description": "1 day agoSteve RosenbergRussia editorEPAIt was quite a contrast.On Thursday, a US Pentagon delegation was in Kyiv. They were talking to President Zele",
    "body": "1 day agoSteve RosenbergRussia editorEPAIt was quite a contrast.On Thursday, a US Pentagon delegation was in Kyiv. They were talking to President Zelensky about a draft plan to end the war in Ukraine.The same day, on Russian state TV, President Putin was in military fatigues. He was talking to his army chiefs about fighting on.\"We have our tasks, our goals,\" the Kremlin leader declared. \"The chief one is the unconditional achievement of the aims of the special military operation.\"The Izvestia newspaper called President Putin's visit to a command post \"a signal to America that he's prepared to negotiate on Ukraine, on Russia's terms\".Which brings us back to the peace plan.On Friday night, President Putin said he had seen the US settlement plan for Ukraine.Addressing a meeting of the Russian security council in Moscow, he described the American proposals as a \"modernised\" version of the plan discussed with Trump at the Alaska summit between the leaders in August.President Putin said he thought the plans could form the basis of final peace settlement.The 28-point proposal, which has been widely leaked and reported on, appeared after a visit to America by President Putin's envoy Kirill Dmitriev. He took part in three days of discussions in Miami with President Trump's special envoy Steve Witkoff.According to drafts of the peace proposal, Ukraine would cede to Russia parts of the Donbass still under Kyiv's control; the Ukrainian armed forces would be reduced in size and Ukraine would vow not to join Nato.\"The Russian military's effective work should convince Zelensky and his regime that it's better to strike a deal and do it now,\" President Putin's spokesman Dmitry Peskov previously told journalists on a Kremlin conference call.A peace proposal does not automatically mean peace. What if there's no agreement?Pro-Kremlin commentators insist that, deal or no deal, Russia will prevail.\"Everyone thought that the idea of a peace deal had sunk in a swamp,\" wrote Russian news outlet Moskovsky Komsomolets. \"But suddenly, a rocket has shot out of this bog with a new, or rather an 'old new' peace plan, with something of the Alaska summit about it. It shot out like a jack in the box.\"How long and how far will this missile fly? Will it crash, sabotaged by Europe and Kyiv? Even if the launch is a false start, it's unlikely to change the general trend. The balance of power is shifting in Russia's favour.\"But after nearly four years of war Russia is under pressure, too. Since its full-scale invasion of Ukraine, not only has Russian's army suffered huge losses on the battlefield, but back home the economy is faltering. Russia's budget deficit is growing, revenues from oil and gas falling.\"Russia's industry is somewhere between stagnation and decline,\" declared the broadsheet Nezavisimaya Gazeta this week.It's unclear, though, whether economic pressures will change President Putin's calculations and convince him that now is the moment to end his so-called special operation: even on terms that many believe benefit Moscow.Many. But not everyone.Some elements of the peace plan haven't gone down well in Russia. Some reports suggest that Ukraine could be offered security guarantees modelled on Nato's Article 5. That might commit Western allies to treat any future Russian attack on Ukraine as an attack on the transatlantic community as a whole and trigger a combined military response.\"This is, in effect, Ukraine in Nato,\" wrote Moskovsky Komsomolets, \"only without the deployment of bases and weapons on its territory.\"The full details of the peace plan have yet to be confirmed. We may be entering another period of intense diplomacy.For now, though, Russia's war on Ukraine continues.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steve Rosenberg: Putin uncompromising as leaked plan reaches Moscow",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0ab6/live/15f39120-c6f0-11f0-b222-8b5ed945ab17.jpg"
      ],
      "datePublished": "2025-11-21T18:21:53.000Z",
      "dateModified": "2025-11-21T18:21:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Marjorie Taylor Greene to quit Congress after Trump feud",
    "url": "https://www.bbc.com/news/articles/cj4qx1lenvjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6f27/live/b0083d80-c770-11f0-a882-55e7f9e7585f.jpg",
    "tag": "World",
    "date": "2025-11-22T12:06:02.000Z",
    "description": "16 hours agoKwasi Gyamfi Asiedu,in Washington, and Anthony Zurcher,North America correspondent, in WashingtonKey moments from Trump and Greene's publi",
    "body": "16 hours agoKwasi Gyamfi Asiedu,in Washington, and Anthony Zurcher,North America correspondent, in WashingtonKey moments from Trump and Greene's public falloutMarjorie Taylor Greene has announced she will resign from office, an unexpected turn for the high-profile Republican.One of Donald Trump's Maga superstars and staunchest defenders, the Georgia congresswoman's relentless calls for releasing files related to late paedophile Jeffrey Epstein and recent criticism of some of his policies led to a bitter public feud.After the US president labelled her a \"traitor\", she said in a video announcing her departure: \"I refuse to be a 'battered wife' hoping it all goes away and gets better.\"Trump, who had threatened to support a Republican challenger to unseat Greene, called her resignation \"great news for the country\" in an interview with ABC News.\"For some reason, primarily that I refused to return her never ending barrage of phone calls, Marjorie went BAD,\" he later wrote on Truth Social. \"Nevertheless, I will always appreciate Marjorie, and thank her for her service to our Country!\"Greene said in her video statement, posted on social media, that she would leave the US Congress on 5 January 2026.She said that she did \"not want my sweet district to have to endure a hurtful and hateful primary against me by the president we all fought for, only to fight and win my election while Republicans will likely lose the midterms\". She had been one of the loudest demanding the release of documents related to Epstein, an issue that once united Trump and his base but has since become divisive.Trump had spent months arguing that the issue was a distraction concocted by his political detractors to divert attention from his administration's achievements.\"Standing up for American women who were raped at 14, trafficked and used by rich powerful men, should not result in me being called a traitor and threatened by the President of the United States, whom I fought for,\" Greene said in her resignation letter.Watch: Marjorie Taylor Greene announces resignation in video messageOver the last few months, she has gone on a number of high-profile news shows and was critical of Trump and fellow Republicans. She took issue with the president not doing enough to bring down living costs for voters and criticised his policy of introducing tariffs on imports. But above all, she criticised his administration for not releasing documents related to Epstein.Trump responded last week in a series of social media posts, calling Greene a \"traitor\" and \"wacky\". He said she should be unseated and vowed to back a challenger for her place in Congress.Days after their feud boiled over, with a growing number of Republicans calling for their release, Trump reversed course and said he would support their publication. He signed a bill this week that forces the US Justice Department to release the documents within 30 days. Greene was elected to Congress in 2020 amid a backdrop of headlines over her support and promotion of QAnon conspiracies, including claiming school shootings and the 9/11 terror attacks were staged. She has since apologised and sought to distance herself from those comments.In the video announcing her resignation, Greene ticked off a list of political achievements. She noted in her resignation letter that the comments from Trump were \"hurtful\". AFP via Getty ImagesGreene and Trump on the campaign trail in 2024While she announced her departure from the House of Representatives, US media reports have indicated Greene has shown an interest in running for state office - either as Georgia governor or for a Senate seat. The president has commented publicly about those ambitions, writing on Truth Social during their public feud that he had previously told her that she shouldn't run for either of those offices due to poor public polling. Greene has since said she did not plan to run for either of those offices. Before their public falling out, Trump and Greene had been close allies in championing the \"America First\" agenda. She joined him on the campaign trail and was one of the Republicans most vocal about Trump's false claims that he'd won the 2020 presidential election against Joe Biden. Her departure will further close the gap in the Republican-led House of Representatives, where the party only holds a handful of seats more than Democrats. Control of the chamber will be up for grabs in the 2026 midterm elections next November. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Marjorie Taylor Greene to quit Congress after Trump feud",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6f27/live/b0083d80-c770-11f0-a882-55e7f9e7585f.jpg"
      ],
      "datePublished": "2025-11-22T12:06:02.000Z",
      "dateModified": "2025-11-22T12:06:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who killed young Chechen woman who fled Russia for a life of freedom?",
    "url": "https://www.bbc.com/news/articles/c4gwgx803l5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/53f6/live/aacd6d30-c6c2-11f0-82b1-6148fee2770d.jpg",
    "tag": "World",
    "date": "2025-11-23T00:02:28.000Z",
    "description": "4 hours agoOlga Prosvirova & Zlata OnufrievaBBC News RussianAishat Baimuradova/Getty/BBCAishat told her friends she had been raised in a strictly reli",
    "body": "4 hours agoOlga Prosvirova & Zlata OnufrievaBBC News RussianAishat Baimuradova/Getty/BBCAishat told her friends she had been raised in a strictly religious familyWhen 23-year-old Aishat Baimuradova fled her home last year, she believed she finally had a chance to live the way she wanted.Coming from Chechnya, a conservative Muslim republic in Russia, she cut her hair short, stopped covering her head, shaved off part of her eyebrow and posted quirky selfies on Instagram.She told her new friends she could finally breathe.In October, Aishat was found dead in a rented flat in neighbouring Armenia. Police say she was murdered.Two people were seen leaving the building where she was found, including a woman Aishat had befriended not long before her death. Both reportedly left for Russia soon afterwards.Russians do not need a passport to enter Armenia; their internal ID is enough. That also makes it an easy route for anyone trying to flee.Chechnya, in Russia's North Caucasus, is often described by rights groups as a state within a state - a place where power is highly personalised and loyalty to long-standing leader Ramzan Kadyrov often over-rides laws and formal institutions.For years, human rights organisations have documented enforced disappearances, torture and extrajudicial killings in the republic, as well as systematic persecution of those who dissent.Chechen officials have consistently denied these allegations, complaining of fabrications aimed at discrediting the region.Aishat Baimuradova/InstagramHer friends say Aishat was a very open person seeking connection with peopleSeveral high-profile critics of Chechen authorities have been killed abroad.In 2009, Umar Israilov, a former bodyguard of Ramzan Kadyrov, was shot dead in Vienna, where he had sought asylum. Austrian authorities called the assassination politically motivated and linked the killers to Chechnya.Former Chechen rebel Zelimkhan Khangoshvili was shot dead in a Berlin park in 2019, in an attack blamed on Russian security services.But Aishat Baimuradova is the first known Chechen woman to have died in suspicious circumstances, not long after fleeing Russia.Like many other women who escape the region, she had complained of being controlled by her family. She said she was forced into a marriage, monitored, and barred from leaving home or using her phone. The BBC was not able to reach her family for a comment.Aishat arrived in Armenia at the end of 2024 with the help of SK-SOS, a crisis group that helps people facing danger in the North Caucasus. She had complained openly of conservative gender rules and the suffocating control women face in Chechnya.At first, she worked in a small town, then moved to the capital, Yerevan, hoping for a better job and more opportunities.To many who flee, such visibility is unthinkable. Most use false names, avoid showing their faces, and refuse to meet new people. Aishat chose a different path. \"She really wanted a normal life,\" her friend who asked to remain anonymous told the BBC. \"And she wanted to trust people.\"ReutersRamzan Kadyrov has ruled Chechnya since 2007. Critics accuse him of turning the Russian republic into a state within a stateHer family tried to persuade her to come back, but when nothing came of it they disowned her, according to SK SOS.\"They said to her: 'You are no longer our daughter or our wife. We won't touch you - just don't touch us,\" Alexandra Miroshnikova, spokesperson for SK SOS, told the BBC.Her uncle told local media the family had no involvement in her death.On the night of her death, Aishat was with a woman she had recently met online, who claimed to come from Dagestan, another Russian republic in the North Caucasus.People who knew Aishat told the BBC it was the woman who had first made contact with her on social media, later coming to Armenia and inviting her to parties.A man captured with her on CCTV as they left the building where Aishat's body was found was reported by a popular Russian Telegram channel to be of Chechen origin. Investigative outlet Agentstvo identified him as a relative of a businessman close to Ramzan Kadyrov.Chechen authorities deny any connection to Baimuradova's death, condemning such suggestions as a \"terrorist information attack\". Officials have also criticised groups assisting women who flee, accusing them of \"destroying family traditions\".VALERY HACHE/AFP via Getty ImagesChechen women who have sought refuge in Europe often avoid communicating with the diasporaArmenian authorities say they are investigating two unnamed people in connection with Aishat Baimuradova's murder, but they have released no further details about them.Ramzan Kadyrov is sensitive to people criticising Chechnya from abroad, says Michael Dennis, an expert on Chechen politics at the University of Texas.\"The very existence of a diaspora is a clear signal to the entire world that something is wrong in Chechnya. It's a matter of personal pride and political image,\" Mr Dennis told the BBC.Since the early 2000s, asylum seekers from Chechnya have been coming to Europe - fleeing first the war and later Kadyrov's repressive rule.But changes to EU migration policy, followed by visa restrictions for Russians because of the war in Ukraine, have all but closed that route.That leaves the South Caucasus, where Russians can travel visa-free, as the easiest escape route, but far from the safest.In July, another escapee, 24-year-old Laura Avtorkhanova, was found in a shelter in Georgia by a group of male relatives who reportedly tried to coerce her into returning to Russia. After being questioned by police she was able to stay safely in Georgia.For other Chechen women who have fled, Aishat's death has reinvigorated a fear that has haunted them since they left Russia.Several have told the BBC how even before her murder they had steered clear of community events, avoided speaking Chechen in public and restricted their social media presence. Now they worry it may not be enough to hide from those who may want to punish them.\"The fear I've lived with all my life - embedded in my DNA - has reawakened with renewed vigour,\" said one escapee living in Western Europe, who asked to hide her name and precise location.\"It's like sleep paralysis: a monster appears, and I lie there frozen, staring into its eyes. It's the fear of being killed.\"\"You can escape,\" she said, \"but you never really feel free.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who killed young Chechen woman who fled Russia for a life of freedom?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/53f6/live/aacd6d30-c6c2-11f0-82b1-6148fee2770d.jpg"
      ],
      "datePublished": "2025-11-23T00:02:28.000Z",
      "dateModified": "2025-11-23T00:02:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'We worry more about food' say Venezuelans living under threat of US military action",
    "url": "https://www.bbc.com/news/articles/c3e0jnww2e9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/723a/live/572f0fe0-c6f3-11f0-a863-434ee92aa5e3.jpg",
    "tag": "World",
    "date": "2025-11-23T00:02:59.000Z",
    "description": "4 hours agoNicole KolsterIn CaracasBBCLike Alejandro Orellano, many Venezuelans say they are more worried about their personal finances than about a U",
    "body": "4 hours agoNicole KolsterIn CaracasBBCLike Alejandro Orellano, many Venezuelans say they are more worried about their personal finances than about a US invasion.While Nicolás Maduro's government lives on edge under a military threat from US President Donald Trump, ordinary Venezuelans spend their time trying to figure out what to eat each day.It's Wednesday morning at Quinta Crespo, a popular market in downtown Caracas. Here, a possible escalation of the conflict is not the main concern of Venezuelans, who glance at the news while checking their wallets to find enough cash to pay.\"There's not going to be an intervention, nothing like that. What's really troubling us is the rise of the dollar,\" Alejandro Orellano tells BBC Mundo as he savours a coffee, waiting for customers who never seem to arrive.In the past weeks, Trump's government has deployed thousands of troops and military assets to within striking distance of Venezuela, including the world's largest warship. On Saturday, at least four international airlines cancelled flights into or out of the country, according to the Reuters and AFP news agencies, after a Friday notice from US aviation authorities warned of \"heightened military activity in or around Venezuela\".This comes after a series of US airstrikes against alleged drug boats in the Caribbean and eastern Pacific killed more than 80 people.It's part of a broader effort the administration says is necessary to stem the flow of narcotics into the US, but Maduro insists the sabre-rattling is designed to push him out of office.In the streets of Caracas, daily life continues while the government tells the population that they must be ready for a US invasion.Alejandro downplays the rhetoric between Washington and Caracas.He's been selling vegetables in this market for five years. \"Look, look how empty this is,\" he insists, pointing to a long, lonely aisle full of fresh fruits and vegetables.A Christmas carol plays, but the festive atmosphere feels overshadowed.The common enemy of the people is here: the sharp rise in food prices and the lack of purchasing power. In part, this is due to the rapid depreciation of the bolívar, which will have lost 80% of its value this year, according to International Monetary Fund (IMF) figures.A kilo of chicken, for example, costs about four times the official monthly minimum wage. And although the government offers bonuses to retirees and public workers, the money is still not enough to cover the basic food basket.Consuelo, 74, is sceptical about an armed conflict with the US and says Venezuelans cannot afford to stock food in preparation for a war.\"Let whatever happens happen! And that's it!\" she tells the BBC, adding that worrying about the spectre of war doesn't help much.\"Is it true? Is it false? That just makes you sick, walking around nervous, it's better to stay calm. Emotions can also affect your health,\" continues this retired university professor who still works.\"I haven't done any panic buying; you need a lot of money to do that.\"Two economists living in Venezuela consulted by the BBC for this report preferred not to comment for fear of government reprisals.\"Inflation has reached levels of around 20% monthly,\" another expert who requested anonymity pointed out.The IMF projects a 548% price increase this year and says it will be worse in 2026, when it could soar to 629% - the highest figure on the continent.Others see a potential US intervention as an opportunity for regime change but are afraid to speak openly about it.\"We're scared, silent, afraid they'll throw us in jail. I used to post things, but not anymore - I shouldn't - because I don't know who might turn me in,\" a merchant from Ciudad Bolívar (in Bolívar state, south) tells the BBC by phone.\"There's hope, faith, but people are quiet out of fear. You don't hear anyone talking about it; it's just at home, with your family, but there's a hint of joy,\" says the woman anonymously.Consuelo says that uncertainty also makes Venezuelans nervous.Much of society avoids speaking openly about issues that could be sensitive for Maduro's government, after a wave of arrests followed anti-government protests over the disputed 2024 presidential elections, which have been widely rejected by the international community. The opposition and many countries, including the US, rejected the result and recognised opposition candidate Edmundo González as the legitimate president-elect.After the elections, more than 2,000 people were arrested, official figures show. At present, 884 individuals remain in prison for political reasons, according to the non-governmental organisation Foro Penal.Barbara Marrero, a 40-year-old pastry chef, says: \"We're all waiting for something to happen because it's fair and necessary. We've been living in absolute misery for years.\"Venezuelans live day by day waiting for something to happen, but everyone is afraid [to speak] and nobody says anything.\"Esther Guevara, 53, who works in a medical lab, doesn't hide her concern amid tensions over the US naval fleet deployment.\"I'm worried because I don't really know what's happening - they might invade, strike… people think it will be ok, but this is serious,\" she says. \"A lot of innocent people could die.\"\"I feel like something's cooking out there, but I'm waiting,\" she adds.Javier Jaramillo also does not believe that an attack on Venezuela is imminent.It's now midday.Everything goes on as usual along a busy boulevard in eastern Caracas. Street vendors pushing sales. Pedestrians coming and going.There's Javier Jaramillo, 57, looking for goods to resell at Christmas. He's curious about the USS Gerald R Ford, the aircraft carrier Washington moved to the Caribbean.\"I don't think that attack will happen. I think there could be dialogue, an agreement, or a deal.\"Still, he says that when there are power cuts, he thinks: \"'They've come in,' 'They're going to come in.'\"Trump has suggested he is open to a diplomatic dialogue with Maduro, but also said he would not rule out military action.Either way, Javier repeats: \"We're more worried about food. Venezuela is in bad shape. Inflation is eating us alive.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'We worry more about food' say Venezuelans living under threat of US military action",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/723a/live/572f0fe0-c6f3-11f0-a863-434ee92aa5e3.jpg"
      ],
      "datePublished": "2025-11-23T00:02:59.000Z",
      "dateModified": "2025-11-23T00:02:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC visits US-led Gaza ceasefire monitoring centre in Israel",
    "url": "https://www.bbc.com/news/videos/cjw9wzvw63zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/778e/live/9bcb6560-c610-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "World",
    "date": "2025-11-20T14:46:04.000Z",
    "description": "US and Israeli soldiers as well as military representatives from more than 20 other countries, diplomats and aid workers, are now based at a warehouse",
    "body": "US and Israeli soldiers as well as military representatives from more than 20 other countries, diplomats and aid workers, are now based at a warehouse in southern Israel, monitoring the almost six-week-old ceasefire in Gaza.The US-led Civil-Military Coordination Centre (CMCC) is tasked with managing the next stages of President Donald Trump's Gaza peace plan, including the entry of humanitarian supplies and plans for reconstruction. However, there is no formal Palestinian representation there, which has prompted criticism.Our Middle East correspondent Yolande Knell was given access to the site.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC visits US-led Gaza ceasefire monitoring centre in Israel",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/778e/live/9bcb6560-c610-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-20T14:46:04.000Z",
      "dateModified": "2025-11-20T14:46:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Takeaways from Trump and Mamdani's surprisingly cordial meeting",
    "url": "https://www.bbc.com/news/articles/cvgqd42gl0qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/67af/live/26f109b0-c774-11f0-b0e6-6b19d8000d31.jpg",
    "tag": "World",
    "date": "2025-11-22T04:04:18.000Z",
    "description": "'I'll be cheering for him': Takeaways from Trump and Mamdani's surprisingly cordial meeting1 day agoKayla EpsteinWatch: \"I’ll be cheering for him\" - T",
    "body": "'I'll be cheering for him': Takeaways from Trump and Mamdani's surprisingly cordial meeting1 day agoKayla EpsteinWatch: \"I’ll be cheering for him\" - Trump praises Mamdani after first meetingUS President Donald Trump met New York City's newly elected mayor Zohran Mamdani at the White House in what was billed as the political showdown of the year - but instead became a praise fest. In his election victory speech, the self-described Democratic socialist mayor called Trump a \"despot\".  And before Friday's meeting, the president's spokeswoman had billed Mamdani's visit as a \"communist coming to the White House\". But standing side-by-side in the Oval Office, the two men struck a surprisingly conciliatory tone.Over and over, both men emphasised their shared interest in addressing New York City's affordability crisis. They smiled often, and Trump even appeared amused as reporters asked him about the political attacks Mamdani had fired his way.The tone of the meeting appeared to strike political observers off-guard, but offered a signal that both men understand that tackling the affordability crisis is critical to their political success.Whether the truce will last once Mamdani takes office on 1 January remains to be seen.Until then, \"I'll be cheering for him,\" Trump said.Trump full of praiseThe rapport was evident from the moment they started speaking to the press. Facing the media after a private meeting, Mamdani stood to Trump's right with his hands clasped, as the president sat behind the Resolute Desk. Their body language was relaxed – particularly Trump's.Not only did Trump refrain from attacking Mamdani, he praised him numerous times.The president expressed hope that Mamdani would be a \"really great mayor\". Later, the president added he was \"confident that he can do a very good job\". Brushing off questions about jihad and fascismGetty ImagesBoth men were all smiles at the meeting Mamdani and Trump traded political barbs throughout the mayoral election. A reporter in the room on Friday reminded the two men that Trump had called Mamdani a \"communist\" and Mamdani had referred to the president as a \"despot\". Both men deflected multiple questions about their previous statements and pivoted back to praise.Trump even let Mamdani answer a question about whether the mayor-elect thought the president was a \"fascist\". \"That's ok, you can just say yes,\" Trump interjected, giving Mamdani a light tap on the arm and smiling. \"It's easier than explaining.\"The closest Trump came to criticising Mamdani's politics was telling reporters: \"He's got views that are little out there.\"Perhaps most striking, Trump dismissed a question echoing an attack on Mamdani by one of Trump's top political allies in New York.\"Do you think you're standing next to a 'jihadist' right now in the oval office?\" a reporter asked, quoting Republican Congresswoman Elise Stefanik, who is mounting a run for governor of New York state.\"No I don't,\" Trump quickly replied.\"You say things sometimes in a campaign,\" Trump said of Stefanik. \"She's a very capable person.\"Bonding over New York rootsGetty ImagesMamdani and Trump have something in common: they're both New Yorkers, and both have called the borough of Queens home.Trump's childhood home is in the neighbourhood of Jamaica Estates, while Mamdani currently resides in Astoria.The two had a \"shared admiration and love\" of the city, Mamdani said.Though Trump rarely spends time in his namesake Manhattan skyscraper these days, he spoke fondly of his hometown throughout the news conference.\"This city could be unbelievable - if he could be a spectacular success, I'll be very happy,\" Trump said.At one point, the president suggested that, in a different political lifetime, he would have liked to be mayor of New York himself.Affordability focusPerhaps part of the reason the two men appeared in lock-step on Friday was their shared focus on cost-of-living issues.Trump won re-election last year after relentlessly hammering the issue of high inflation that had frustrated voters in 2024. As consumers grow restless about the cost of groceries, housing and other essentials, Trump has tried to convey a message of economic stability.During his election campaign in New York City, Mamdani maintained a laser focus on the lack of affordable housing and proposed freezing rent increases on certain rent-stabilised apartments, among other initiatives.Mamdani said he and Trump discussed how to \"deliver affordability to New Yorkers\".Whenever he was asked a question about their differing views, the mayor-elect brought the conversation back to this topic.Facing one question about their different views on achieving peace in the Middle East, Mamdani responded that Trump voters had expressed to him a wish for \"an end to forever wars\" and for leaders to address \"the cost-of-living crisis\".On law enforcement and immigration, they also appeared to find some common ground. Mamdani said he and Trump discussed federal immigration-enforcement operations in New York, and he relayed concerns from residents about how they are being conducted.But Trump said they discussed crime more than immigration.\"He doesn't want to see crime and I don't want to see crime,\" the president said. He had \"very little doubt\" the two wouldn't get along on that issue.Trump even said he would feel safe living in a Mamdani-led New York.A complication for Republicans' strategy? The cordial relations on display on Friday may complicate efforts by Republicans to use the self-described democratic socialist as a bogeyman in the upcoming 2026 midterm elections, when control of the US Congress will be up for grabs.In elections earlier this month, Republicans struggled and Democrats won key races. It's unclear whether that trend will hold. Republicans had plans in place to make Mamdani the face of the Democratic Party, according to US news site Axios. They included painting him as anti-police, anti-capitalism and anti-Israel in an effort to give Republicans a leg-up in key races. But the Oval Office chuminess could undercut that strategy.While praising Mamdani, the president said he believed the new mayor would \"surprise some conservative people\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Takeaways from Trump and Mamdani's surprisingly cordial meeting",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/67af/live/26f109b0-c774-11f0-b0e6-6b19d8000d31.jpg"
      ],
      "datePublished": "2025-11-22T04:04:18.000Z",
      "dateModified": "2025-11-22T04:04:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "COP30: UN climate talks fail to secure new fossil fuel promises",
    "url": "https://www.bbc.com/news/articles/c75vn7yel73o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ded/live/18a04ba0-c7e2-11f0-a715-415645a54121.jpg",
    "tag": "World",
    "date": "2025-11-22T22:38:19.000Z",
    "description": "6 hours agoGeorgina RannardClimate and science correspondent, Belém, BrazilEPAFollowing bitter rows, the UN climate summit COP30 in Belém, Brazil has ",
    "body": "6 hours agoGeorgina RannardClimate and science correspondent, Belém, BrazilEPAFollowing bitter rows, the UN climate summit COP30 in Belém, Brazil has ended with a deal that contains no direct reference to the fossil fuels that are heating up the planet.It is a frustrating end for more than 80 countries including the UK and EU that wanted the meeting to commit the world to stop using using oil, coal and gas at a faster pace.But oil-producing nations held the line that they should be allowed to use their fossil fuel resources to grow their economies.The meeting takes place as the UN says it fears global efforts to limit global temperature rise to 1.5C above pre-industrial levels have failed.A representative for Colombia furiously criticised the COP presidency for not allowing countries to object to the deal in the final meeting on Saturday, known as a plenary.\"Colombia believes that we have sufficient scientific evidence saying that more than 75% of the global greenhouse gas emissions come from fossil fuels,\" Daniela Durán González, Colombian Climate Delegate, told BBC News.\"So we do believe it's time that the Convention on Climate Change starts talking about that reality,\" she added.The final deal, called the Mutirão, calls on countries to \"voluntarily\" accelerate their  action to reduce their use of fossil fuels.For the first time, the US did not send a delegation after President Donald Trump said the country will leave the landmark Paris treaty that committed countries to act on climate change in 2015. He has branded climate change \"a con\".Veteran negotiator and former Germany climate envoy Jennifer Morgan told the BBC that the US absence was a \"hole\" in the negotiations. Often the US has supported blocs like the EU and UK. \"In a 12-hour negotiation overnight, when you have oil-producing countries pushing back hard, to not have someone counteracting on that, it certainly was hard,\" she saidBut for many countries, the fact that the talks did not collapse or roll back on past climate agreements is a relief.Antigua and Barbuda Climate Ambassador Ruleta Thomas commented: \"We are happy that there is a process that continues to function [...] where every country can be heard.\"In the final meeting, a representative for Saudi Arabia said: \"Each state must be allowed to build its own path, based on its respective circumstances and economies.\"Like many other leading oil-producing nations, the country has argued it should be allowed to exploit its fossil fuel reserves as others have done in the past.UNFCCCThe talks over-ran by almost 24 hours with delegates working all nightThe two weeks of talks were at times chaotic. Toilets ran out of water, torrential thunderstorms flooded the venue, and delegates struggled to cope in hot, humid rooms.The COP's around 50,000 registered delegates were evacuated twice. A group of about 150 protestors broke into the venue, breaching security lines, and carrying placards reading \"our forests are not for sale\".On Thursday a large fire broke out, scorching a hole into the roof and forcing participants to rush outside.Brazilian President Luiz Inácio Lula da Silva chose the city of Belém to put the world's attention on the Amazon rainforest and to bring a rush of finance to the city. Despite its desire for a more ambitious fossil fuel agreement, Brazil was criticised for its own plans to drill for oil at the mouth of the Amazon. Its offshore oil and gas production is on course to increase until the early 2030s, according to analysis shared with the BBC by campaign group Global Witness.ReutersSome delegations stayed on cruise ships in Belém due to a shortage of accommodationCountries at the talks have competing interests, depending on their national circumstances and how exposed they are to the effects of climate change. Some countries were happy about the outcomes.India praised the deal, calling it \"meaningful\". A group representing the interests of 39 small island and low-lying coastal states on Saturday called it \"imperfect\" but still a step towards \"progress\".Poorer nations have come away with a promise for more climate finance to help them adapt to the impacts of climate change.\"It has moved the needle. There is a clearer recognition that those with historic responsibility [countries that emitted more planet-warming gases in the past] have specific duties on climate finance,\" said Sierra Leone Minister of The Environment and Climate Change Jiwoh Abdulai.ReutersA fire broke out at COP30, witnessed by the BBC climate team inside the venueBut it's a sour end for more than 80 countries, who negotiated through the night to keep stronger fossil fuel language in the deal.UK Secretary of State for Energy and Climate Change Ed Miliband insisted the meeting is a \"step forward\".\"I would have preferred a more ambitious agreement,\" he said.\"We're not going to hide the fact that we would have preferred to have more, to have more ambition on everything,\" EU climate commissioner Wopke Hoekstra told journalists.With lush trees, bird cries and intense humidity, it was hard to escape the Amazonian backdrop of the talks.Brazil launched the talks with a new fund called Tropical Forests Forever Facility that would pay countries to protect tropical forests. By the end of the meeting, it raised at least $6.5bn from governments, although the UK has not yet contributed.Over 90 countries supported a call for a global deforestation action plan, or \"roadmap\".Additional reporting by Tom Ingham, BBC climate team",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "COP30: UN climate talks fail to secure new fossil fuel promises",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6ded/live/18a04ba0-c7e2-11f0-a715-415645a54121.jpg"
      ],
      "datePublished": "2025-11-22T22:38:19.000Z",
      "dateModified": "2025-11-22T22:38:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says US plan to end Ukraine war not 'final offer' for Kyiv",
    "url": "https://www.bbc.com/news/articles/clydg8w7kxvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bf65/live/93ede5d0-c817-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-22T23:02:17.000Z",
    "description": "President Donald Trump has said a US plan to end the Russia-Ukraine war is not his \"final offer\" for Kyiv, after Ukrainian allies voiced concerns over",
    "body": "President Donald Trump has said a US plan to end the Russia-Ukraine war is not his \"final offer\" for Kyiv, after Ukrainian allies voiced concerns over proposals.Earlier on Saturday, leaders from Europe, Canada and Japan said the plan had elements \"essential for a just and lasting peace\", but would \"require additional work\", citing concerns over border changes and caps on Ukraine's army. On Sunday, security officials from Britain, France, Germany, the US and Ukraine will meet in Geneva, Switzerland.President Volodymyr Zelensky earlier warned Ukraine faced \"one of the most difficult moments in our history\" over US pressure to accept the plan seen as favourable to Moscow.Trump has given Ukraine until 27 November to accept the 28-point plan, while Russia's President Vladimir Putin said it could be the \"basis\" for a settlement.When asked on Saturday whether the current draft plan was his final offer for Ukraine, Trump told reporters at the White House: \"No, not my final offer.\" \"One way or another we have to get it [the war] ended, so we're working on it,\" he added.US Secretary of State Marco Rubio and special envoy Steve Witkoff will be among those taking part in talks in Geneva on Sunday. National Security Adviser Jonathan Powell will attend on the UK's behalf.Saturday's joint statement at the G20 summit in South Africa was signed by the leaders of Canada, Finland, France, Ireland, Italy, Japan, the Netherlands, Spain, the UK, Germany and Norway. Two top EU officials were also among the signatories.The statement said: \"We believe therefore that the draft is a basis which will require additional work. We are ready to engage in order to ensure that a future peace is sustainable. We are clear on the principle that borders must not be changed by force.\"We are also concerned by the proposed limitations on Ukraine's armed forces, which would leave Ukraine vulnerable to future attack.\"It added: \"The implementation of elements relating to the European Union and relating to Nato would need the consent of EU and Nato members respectively\".UK Prime Minister Sir Keir Starmer, who is at the G20 summit in Johannesburg, spoke to Zelensky on the phone on Saturday, followed by a call with Trump.On the Trump call, a Downing Street spokesman said Sir Keir \"relayed the discussions that have been taking place between Coalition of the Willing partners [Ukraine's allies] in attendance at the G20 summit today\".They added: \"The leaders agreed their teams would work together on the 28-point US peace proposal in Geneva tomorrow. They agreed to speak again tomorrow.\"Sir Keir earlier said he was concerned about proposed caps on Ukraine's military in the US plan, saying \"it's fundamental that Ukraine has to be able to defend itself if there's a ceasefire\".The widely leaked US peace plan proposes Ukrainian troops withdraw from the part of the eastern Donetsk region that they currently control, and de facto Russian control of Donetsk, as well as the neighbouring Luhansk region and the southern Crimea peninsula annexed by Russia in 2014.The plan also includes freezing the borders of Ukraine's southern Kherson and Zaporizhzhia regions along the current battle lines. Both regions are partially occupied by Russia.The US draft would also limit Ukraine's military to 600,000 personnel, with European fighter jets stationed in neighbouring Poland.Kyiv would receive \"reliable security guarantees\", the plan says, although no details have been given. The document says \"it is expected\" that Russia will not invade its neighbours and Nato will not expand further.The plan also suggests Russia will be \"reintegrated into the global economy\", through the lifting of sanctions and by inviting Russia to rejoin the G7 group of the world's most powerful countries - making it the G8 again.On Friday, Trump said Zelensky would \"have to like\" the US proposals, adding otherwise Ukraine and Russia would continue fighting.Earlier in the day, the Ukrainian leader addressed the nation with a stark warning that the country \"might face a very difficult choice: either losing dignity, or risk losing a key partner\". \"Today is one of the most difficult moments in our history,\" Zelensky added, pledging to work \"constructively\" with the Americans on the plan.On Saturday, Zelensky announced that his head of office Andriy Yermak would lead Ukraine's negotiating team for future talks on a peace deal, including any that may involve Russia.\"Our representatives know how to defend Ukraine's national interests and exactly what must be done to prevent Russia from launching a third invasion, another strike against Ukraine,\" the president said in a video statement posted on social media.Kyiv is critically dependent on deliveries of US-made advanced weaponry, including air defence systems to repel deadly Russian air assaults, as well as intelligence provided by Washington.Putin on Friday confirmed Moscow had received the US plan - but said it had not been discussed with the Kremlin in detail. He added Moscow was willing to \"show flexibility\" - but was also prepared to fight on.Putin launched a full-scale invasion of Ukraine in February 2022.In recent months, Russian troops have been slowly advancing in Ukraine's south-eastern region - despite reported heavy combat casualties.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says US plan to end Ukraine war not 'final offer' for Kyiv",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bf65/live/93ede5d0-c817-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-22T23:02:17.000Z",
      "dateModified": "2025-11-22T23:02:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "COP30 - Five key takeaways from a deeply divisive climate summit ",
    "url": "https://www.bbc.com/news/articles/cp84m16mdm1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5754/live/fb183cf0-c7f5-11f0-975d-d5fa2587428e.jpg",
    "tag": "World",
    "date": "2025-11-23T00:10:18.000Z",
    "description": "4 hours agoJustin Rowlatt,Climate Editor and Matt McGrath,Environment correspondentgettyCOP30 President President André Corrêa do Lago at a critical m",
    "body": "4 hours agoJustin Rowlatt,Climate Editor and Matt McGrath,Environment correspondentgettyCOP30 President President André Corrêa do Lago at a critical moment in the final plenary session of talksIn three decades of these meetings aimed at forging global consensus on how to prevent and deal with global warming, this will go down as among the most divisive.Many countries were livid when COP30 in Belém, Brazil ended on Saturday with no mention of the fossil fuels that have heated up the atmosphere. Other nations - particularly those with most to gain from their continued production - felt vindicated.The summit was a reality check on just how much global consensus has broken down over what to do about climate change.Here are five key takeaways from what some have called the \"COP of truth\".Brazil - not their finest hourThe most important thing to come out of COP30 is that the climate 'ship' is still afloatBut many participants are unhappy that they didn't get anything close to what they wanted.And despite a great deal of warmth for Brazil and for President Luiz Inácio Lula da Silva, there is frustration with the way they ran this meeting.Right from the off there seemed to be a gulf between what President Lula wanted this meeting to achieve, and what COP president President André Corrêa do Lago felt was possible.So Lula talked of roadmaps away from fossil fuels to the handful of world leaders that came to Belém before the official start of the COP.The idea was taken up by a number of countries including the UK, and within days there was a campaign to get this roadmap formally into the negotiations.Do Lago wasn't keen. His north star was consensus. He knew that forcing the issue of fossil fuels on the agenda would rupture that.While the initial text for agreement had some vague references to things that looked like a roadmap, within days they were gone, never to return.Colombia and the European Union and around 80 countries tried to find some language that would signal a stronger step away from coal, oil and gas.To find consensus, do Lago convened a mutirão, a kind of Brazilian group discussion.It made matters worse.Negotiators from Arab countries refused to join huddles with those who wanted a pathway away from fossil energy.The EU were given short shrift by major producers.\"We make energy policy in our capital not in yours,\" the Saudi delegate told them in a closed-door meeting, according to one observer.Ouch!Nothing could bridge the gap - and the talks teetered on the verge of collapse.Brazil came up with a face-saving idea of roadmaps on deforestation and fossil fuels that would exist outside the COP.These were heartily applauded in the plenary halls – but their legal standing is uncertain.Tom Ingham/BBCThe EU negotiating team at the COP30 plenaryEU had a bad COPThey are the richest group of nations still in the Paris Agreement but this COP has not been the European Union's finest hour.While they have been grandstanding on the need for a fossil fuel roadmap, they backed themselves into a corner on another aspect of the agreement that they eventually couldn't get out of.The idea of tripling money for climate adaptation was in the early text and survived into the final draft.The wording was vague so that the EU didn't object – but crucially the \"tripling\" word stayed in the text.So when the EU tried to press the developing world to support the idea of a fossil fuel roadmap, they didn't have anything to sweeten the deal – as the tripling concept was already baked in.\"Overall we are seeing a European Union that has been cornered,\" said Li Shuo, from the Asia Society, a long-time observer of climate politics.\"This partly reflects the power shift in the real world, the emerging power of the BASIC and BRICs countries, and the decline of the European Union.\"The EU fulminated but apart from shifting the tripling of finance from 2030 to 2035, they had to go along with the deal, and they achieved very little on the fossil fuel front.Getty ImagesProtestors at COP30 stage a demonstration at the start of negotiations in BelémFuture of COP in questionThe most persistent question asked here at COP30 over the two weeks was about the future of the 'process' itself.Two often heard positions:How barmy is it to fly thousands of people half-way around the world to sit in giant air-conditioned tents to argue about commas, and interpretations of convoluted words?How ridiculous that the key discussions here, on the very future of the way that we will power our world occur at 3am in the morning among sleep deprived delegates who haven't been home in weeks?The COP idea served the world well in ultimately delivering the Paris climate agreement – but that was a decade ago and many participants feel that it doesn't have a clear, powerful purpose anymore.\"We can't discard it entirely,\" Harjeet Singh, an activist with the Fossil Fuel Treaty Initiative, told BBC News.\"But it requires retrofitting. We will need processes outside this system to help complement what we have done so far.\"Energy costs and the valid questions about how countries reach net zero emissions have never been more critical – yet the COP idea seems very far removed from the day to day lives of billions of people.It is a consensus process that comes from a different era. We are not in that world anymore.Brazil recognised some of these issues and tried to make this an \"implementation cop\" and put a lot of focus on the \"energy agenda\". But no one really knows what those ideas actually meant.COP leaders are reading the room - they are trying to find a new approach that is needed or this conference will lose all relevance.Trade comes in from the coldFor the first time global trade became one of the key issues at these talks.  There was an \"orchestrated\" effort to raise it in every negotiating room, according to veteran COP-watcher Alden Meyer of the climate think-tank E3G.'What's that got to do with climate change?' you are probably thinking.The answer is that the European Union is planning to introduce a border tax on certain high-carbon products like steel, fertiliser, cement, and aluminium and lots of its trading partners – notably China, India and Saudi Arabia aren't happy about it.They say it isn't fair for a big trading bloc to impose what they call a one-sided - \"unilateral\" is the technical term - measure like this because it will make the goods they sell into Europe more expensive - and therefore less competitive.The Europeans say that's wrong because the measure is not about stifling trade but about cutting planet-warming gases – tackling climate change.  They already charge their own producers of these products a fee for the emissions they create and say the border tax is a way to protect them from less environmentally friendly but cheaper imports from abroad.If you don't want to pay our border tax, they say, just charge emissions fees on your polluting industries - collect the money yourselves.Economists like that idea because the more expensive it is to pollute, the more likely we all are to switch to clean energy alternatives.  Although - of course - it also means we'll pay more for any goods we buy that contain polluting materials.The issue was resolved here in Brazil with a classic COP compromise - pushing the discussions into future talks. The final agreement launched an on-going dialogue on trade for future UN climate talks, involving governments as well as other actors like the World Trade Organization.Tom Ingham/BBCHuge crowds looking for souvenirs crowded into the Chinese pavilion at COP30Trump gains by staying away - China gains by staying quietThe world's two biggest carbon emitters, China and the US, had similar impacts on this COP but achieved them in different ways.US President Donald Trump stayed away, but his stance emboldened his allies here.Russia, normally a relatively quiet participant, was to the fore in blocking efforts on roadmaps. And while Saudi Arabia and other major oil producers were predictably hostile to curbing fossil fuels, China stayed quiet and concentrated on doing deals. And ultimately, say experts, the business China is doing will outdo the US and their efforts to sell fossil fuels.\"China kept a low political profile,\" says Li Shuo from the Asia Society.\"And they focussed on making money in the real world.\"\"Solar is the cheapest source of energy, and the long term direction is very clear, China dominates in this sector and that puts the US in a very difficult position.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "COP30 - Five key takeaways from a deeply divisive climate summit ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5754/live/fb183cf0-c7f5-11f0-975d-d5fa2587428e.jpg"
      ],
      "datePublished": "2025-11-23T00:10:18.000Z",
      "dateModified": "2025-11-23T00:10:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israeli strikes across Gaza kill 22 Palestinians, Hamas-run health ministry and civil defence say",
    "url": "https://www.bbc.com/news/articles/c20879zzqn8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e122/live/714f42f0-c7c5-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-22T20:43:36.000Z",
    "description": "8 hours agoRushdi Abualouf,Gaza correspondent, Istanbul and Jon Donnison,correspondent, JerusalemAt least 22 Palestinians have been killed in a series",
    "body": "8 hours agoRushdi Abualouf,Gaza correspondent, Istanbul and Jon Donnison,correspondent, JerusalemAt least 22 Palestinians have been killed in a series of Israeli air strikes across northern and central Gaza, Hamas medical and civil defence officials have said.They said five sites had been hit, including residential homes. A senior Hamas commander was among the dead, according to local sources.The Israeli military said it had struck targets in Gaza in response to an incident earlier on Saturday, when it said an \"armed terrorist\" had fired at soldiers after crossing the Strip's so-called \"yellow line\" designating areas under full Israeli control. Hamas denied this.Both sides have accused each other of violating the ceasefire deal agreed on six weeks ago.More than 310 Palestinians have been killed in Israeli strikes since the ceasefire came into force, according to Gaza's health ministry.The territory's civil defence said Saturday's strikes by Israel targeted Gaza City in the north, as well as Deir al-Balah and Nuseirat camp in central Gaza.The Hamas officials said five people had been killed at the Abbas junction in the densely populated Rimal area of Gaza City. Witnesses said an Israeli strike set a car on fire.In addition, three people were killed near a mosque in Deir al-Balah, the officials said.Two houses were targeted in Israeli strikes in Nuseirat, they added, with three killed after the home of the Abu Amouneh family was hit. Seven others were killed in another strike targeting the house of the Abu Shawish family.Three more people were killed later on Saturday when a house in western Gaza City was hit, officials reported.The office of Prime Minister Benjamin Netanyahu said in a later statement: \"Today, Hamas violated the ceasefire again, sending a terrorist into Israel held territory to attack IDF soldiers. In response, Israel eliminated five senior Hamas terrorists.\"The statement also called on mediators to \"insist that Hamas fulfil its side of the ceasefire\".Following the strikes, Hamas said the army's westward push of the yellow line and continued bombardment of eastern Gaza amounted to a \"blatant breach\" of the agreement.The group called on mediators and the US to intervene urgently, warning that Israel was attempting to impose \"new facts on the ground\" and undermine the ceasefire.The Israeli military launched an offensive in Gaza in response to the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.At least 69,500 people have been killed in Israeli attacks in Gaza since then, including 280 during the ceasefire, according to the territory's health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israeli strikes across Gaza kill 22 Palestinians, Hamas-run health ministry and civil defence say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e122/live/714f42f0-c7c5-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-22T20:43:36.000Z",
      "dateModified": "2025-11-22T20:43:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]