[
  {
    "title": "What the Super Bowl means to American fans",
    "url": "https://www.bbc.com/news/videos/c2d7den70j1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024xn/ichef.bbci.co.uk/images/ic/$widthxn/p0mzm2q8.jpg",
    "tag": "World",
    "date": "2026-02-06T19:06:05.000Z",
    "description": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessTechnologyHealthCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch L",
    "body": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessTechnologyHealthCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch LiveMore on this story.6 hours agoSuper BowlUnited StatesCalifornia",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What the Super Bowl means to American fans",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024xn/ichef.bbci.co.uk/images/ic/$widthxn/p0mzm2q8.jpg"
      ],
      "datePublished": "2026-02-06T19:06:05.000Z",
      "dateModified": "2026-02-06T19:06:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Norway investigates former PM Jagland over alleged Epstein links",
    "url": "https://www.bbc.com/news/articles/cy8y6w2nl0qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2f51/live/1b2ccf00-02df-11f1-aed8-6f159d8910de.jpg",
    "tag": "World",
    "date": "2026-02-05T23:39:48.000Z",
    "description": "1 day agoJaroslav LukivNurPhoto via Getty ImagesThorbjørn Jagland's lawyer promised his client's full co-operation with the investigationPolice in Nor",
    "body": "1 day agoJaroslav LukivNurPhoto via Getty ImagesThorbjørn Jagland's lawyer promised his client's full co-operation with the investigationPolice in Norway have opened a corruption investigation into the country's former Prime Minister Thorbjørn Jagland over his alleged links to the late convicted sex offender Jeffrey Epstein. A special Norwegian police unit which is analysing newly released Epstein files in the US said the 75-year-old was suspected of \"aggravated corruption\". Police said they had already asked the country's foreign ministry to lift his immunity, which he enjoys because of his past role as a senior foreign diplomat. Jagland is also a former head of the Norwegian Nobel Committee and spent 10 years as secretary general of the Council of Europe. His lawyer said they would fully co-operate with the investigation.Pål K. Lønseth, head of Økokrim - the economic crime unit investigating Jagland - said: \"We consider there are reasonable grounds for investigation, given that he held the positions of chair of the Nobel Committee and Secretary General of the Council of Europe during the period covered by the released documents.\"Among other things, Økokrim will investigate whether gifts, travel and loans were received in connection with his position.\"The police added that further details would be given \"at a later stage\".Norwegian Foreign Minister Espen Barth Eide said it was \"important that the facts of this case are brought to light\".He added that Oslo would ask the Council of Europe for Jagland's immunity to be revoked.Jagland's lawyer Anders Brosveet welcomed the opening of the investigation.\"Based on what we have found so far, we are confident of the outcome,\" he told Reuters news agency. Separately, Brosveet told Norway's VG news site that he and his client would submit \"the key findings and documentation we have to Økokrim as soon as practically possible\".Jagland was Norway's prime minister in 1996-97, and the secretary general of the Council of Europe in 2009-19.He also chaired the Norwegian Nobel Committee in 2009-15.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Norway investigates former PM Jagland over alleged Epstein links",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2f51/live/1b2ccf00-02df-11f1-aed8-6f159d8910de.jpg"
      ],
      "datePublished": "2026-02-05T23:39:48.000Z",
      "dateModified": "2026-02-05T23:39:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Queen Elizabeth II: Coin portrait of late monarch criticised in Australia",
    "url": "https://www.bbc.com/news/articles/c70l0wzww50o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c421/live/a7f290a0-0343-11f1-b5e2-dd58fc65f0f6.jpg",
    "tag": "World",
    "date": "2026-02-06T11:53:57.000Z",
    "description": "Coin portrait of late Queen draws criticism in Australia 13 hours agoKathryn ArmstrongRoyal Australian Mint$5 and 50 cent versions of the coin have be",
    "body": "Coin portrait of late Queen draws criticism in Australia 13 hours agoKathryn ArmstrongRoyal Australian Mint$5 and 50 cent versions of the coin have been released to mark the centenary of Queen Elizabeth II's birthTwo commemorative coins, released by the Royal Australian Mint and bearing a portrait of Queen Elizabeth II, have been criticised for their lack of resemblance to the late monarch.The $5 (£2.56) and 50 cent silver coins, created to commemorate the centenary of the Queen's birth, were released in an online ballot that closed on Wednesday.\"That's got to be the most unpleasant portrait on a coin,\" said one of several people who reacted negatively online. The Royal Australian Mint defended the portrait, saying: \"Our coin images don't always capture the full beauty of a design once it's etched in metal.\"Queen Elizabeth II died in 2022 at the age of 96 and was the UK's longest serving monarch. \"There's a reason most portraits are from the side. Looks like she just ran into a wall,\" one person commented underneath a Facebook post from the mint.\"If I saw that face without the hairdo and pearls, would never guess who it was meant to be,\" another said.Comparisons have been made with various TV characters, including Mrs Doubtfire - the beloved fictional housekeeper in the comedy film of the same name, played by the late Robin Williams.Royal Australian MintOther people were more positive about the design, which was created by one of the mint's artists. \"Awesome. I'm glad they put something out to do with Queen Elizabeth II, she deserves to have Recognition In a Special Way,\" one user wrote on social media.\"Please pick me for one of these coins,\" said another. One woman living in the US commented that it \"looks like a beautiful coin\". Despite the criticism, collectors reported that the ballot was fully subscribed. Australian media, quoting a spokesperson for the Royal Australian Mint, said the silver proof coins had sold out, and there were limited stocks left in their contact centre and shop.According to the mint's website, it created 30,000 of the 50c coins and 5,000 of the $5 - all of which are collector's items and will not enter general public circulation.As well as the queen's portrait, the coins feature designs \"symbolically reflecting the many facets of Queen Elizabeth II's life and legacy\", the mint said. These include motifs of a horse and corgi, references to art and theatre to mark \"her enduring support for culture\", as well as some of her favourite flowers - roses and lily of the valley. The golden wattle, Australia's national floral emblem, is also represented. \"The design incorporates Her Majesty's Royal Cypher, a stylised St Edward's Crown and the Auxiliary Territorial Service emblem, acknowledging her wartime service and lifelong sense of duty,\" the mint added.Meanwhile, the backs of the coins feature a portrait of the Queen's son, King Charles, in profile. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Queen Elizabeth II: Coin portrait of late monarch criticised in Australia",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c421/live/a7f290a0-0343-11f1-b5e2-dd58fc65f0f6.jpg"
      ],
      "datePublished": "2026-02-06T11:53:57.000Z",
      "dateModified": "2026-02-06T11:53:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TikTok told by EU to change 'addictive design' or face fines",
    "url": "https://www.bbc.com/news/articles/cr7j7n315lmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ce4/live/87e7b660-0351-11f1-8dce-5f79cab4f7bf.jpg",
    "tag": "World",
    "date": "2026-02-06T13:55:46.000Z",
    "description": "11 hours agoLaura CressTechnology reporterGetty ImagesThe EU has told TikTok it must change its \"addictive design\" or face heavy fines, after it found",
    "body": "11 hours agoLaura CressTechnology reporterGetty ImagesThe EU has told TikTok it must change its \"addictive design\" or face heavy fines, after it found the video sharing platform had breached its online safety rules.It follows an investigation which began in February 2024 into the Chinese-owned app by the European Commission.In its preliminary findings, the Commission said TikTok did not \"adequately assess\" how features like autoplay could harm the wellbeing of its users, including children, and said it failed to implement measures to mitigate the risks.A TikTok spokesperson told the BBC the findings presented a \"categorically false and entirely meritless depiction of our platform\" and it planned to challenge them.The platform has been invited to respond to the EU's findings. Depending on the outcome of this step, the Commission could fine TikTok up to 6% of its total global annual turnover - estimated to be in the tens of billions.EU tech chief Henna Virkkunen told reporters if TikTok wanted to avoid being fined, it would have to \"change the design of their service in Europe\".The Commission gave several suggestions for actions the platform could take, including implementing \"screen time breaks\" when people are using it at night and changing its algorithms, which feed users personalised content.It also suggested TikTok disable so-called \"infinite scroll\", which allows people to quickly cycle through millions of videos on the platform.\"The Digital Services Act makes platforms responsible for the effects they can have on their users,\" Virkkunen said.\"In Europe, we enforce our legislation to protect our children and our citizens online.\"Professor Sonia Livingstone at the London School of Economics said while TikTok had introduced some tools to improve the online safety of its users, it was not enough to comply with the guidelines set down by the EU.\"Young people are calling for such changes,\" she said. \"They are frustrated that the platform does not prioritise their wellbeing over profit.\"And social media expert Matt Navarra said while the use of the word addictive was \"often abused\" in these debates, the Commission's findings seemed to be rooted in \"true behavioural science\".He added it marked a \"seismic shift\" in the way in which regulators were looking at social media platforms.\"This seems to be the first time a major regulator has said that the design is the problem,\" he said.\"It's no longer about just toxic content, it's about toxic design.\"'Warning shot'It is not the first time the EU has looked into the workings of big tech firms or threatened them with fines.In December 2024 it began a separate investigation into TikTok over alleged foreign interference during the Romanian presidential elections.It has also launched an inquiry in January into Elon Musk's X over concerns its AI tool Grok was used to create sexualised images of real people.Meanwhile in December 2025 the EU fined X €120m (£105m) over its blue tick badges, saying they \"deceive users\" because the firm is not \"meaningfully verifying\" who is behind the account.Social media analyst Paolo Pescatore said the latest announcement was a \"reality check\" for TikTok - and a \"warning shot\" for every social media platform.\"The market is shifting from 'maximise engagement' to 'engineer responsibility' - and regulators now have the tools to enforce it,\" he said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TikTok told by EU to change 'addictive design' or face fines",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6ce4/live/87e7b660-0351-11f1-8dce-5f79cab4f7bf.jpg"
      ],
      "datePublished": "2026-02-06T13:55:46.000Z",
      "dateModified": "2026-02-06T13:55:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pakistan mosque explosion: More than 30 dead and 169 injured, officials say",
    "url": "https://www.bbc.com/news/articles/cg7y7gz2835o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/964e/live/9c64f060-0394-11f1-a36d-4dc7f32cefeb.jpg",
    "tag": "World",
    "date": "2026-02-07T00:35:37.000Z",
    "description": "More than 30 killed in blast at Pakistan mosque, officials say44 minutes agoShahzad Malik and Umer Draz, BBC Urdu, and Flora DruryIslamabad and London",
    "body": "More than 30 killed in blast at Pakistan mosque, officials say44 minutes agoShahzad Malik and Umer Draz, BBC Urdu, and Flora DruryIslamabad and LondonGetty ImagesAt least 31 people have been killed and 169 injured in an explosion at a mosque during Friday prayers in Pakistan's capital, Islamabad, officials say.According to police, a suicide bomber detonated a device after approaching the gates of the Shia mosque in the Tarlai area of the city. Eyewitnesses have told the BBC the blast was preceded by the sound of gunfire.Islamic State group later claimed responsibility for the attack in a statement that included the name and picture of the alleged attacker.Condemning the incident, Pakistan's Prime Minister Shehbaz Sharif expressed \"deep grief\" as he called for a thorough investigation and the immediate identification of those behind the attack.In separate statements, Pakistan's President Asif Ali Zardari said \"targeting innocent civilians is a crime against humanity\", while Defence Minister Khawaja Asif suggested India and Afghanistan were behind the attack.Asif said in a social media post that it had been \"proven\" the attacker had travelled to and from Afghanistan, and \"collusion between India and Afghanistan is being revealed\".Afghanistan's Taliban government described Khawaja Asif's comments as \"regrettable\", saying the Pakistani minister \"hastily attempted to attribute the incident to Afghanistan without presenting any credible evidence\".IS claimed the attack in the name of its \"Pakistan Province\" branch on Friday, via the group's Telegram channels. IS's Amaq \"news agency\" in parallel issued a statement offering additional details.Amaq alleged that the IS attacker arrived at the \"central temple [mosque]\" in Tarlai district in the Shahzad area. Guards at the location then tried to halt the attacker at the external gate, it claimed, but he fired his pistol at them, injuring two, before heading inside.Amaq added that as the attacker arrived at the inside gate of the \"temple\", he detonated his \"explosive vest\" within a \"crowd of Shia\", inflicting a \"large number\" of casualties.IS identified the attacker as \"Sayf Allah al-Ansari\". The nom de guerre Ansari is often used to indicate somebody who is a local to the area. Amaq's report also shared a photo showing the alleged masked attacker.Afghan foreign ministry spokesman Abdul Qahar Balkhi earlier condemned the attack and extended condolences, calling such attacks a \"contradiction to Islamic and humanitarian values\".The Indian foreign ministry also condemned the attack and sent condolences for the loss of life, calling the accusations it may be involved \"baseless\".Talal Chaudhry, Pakistan's minister of state for interior, said the suspect was not an Afghan citizen, according to local media.A spokesperson for United Nations Secretary-General Antonio Guterres said he condemned the attack in the \"strongest terms\" and called for those responsible to be \"identified and brought to justice\". 'We bowed - then there was an explosion'EPAEmergency vehicles and private cars transported the injured to hospitalZaheer Abbas was inside the Khadijatul Kubra Mosque praying when he first heard the sound of bullets.\"After that, we bowed and then prostrated, and then there was an explosion,\" he told BBC Urdu. \"After which there were injured people lying everywhere.\"Pictures from the mosque in the aftermath show footwear scattered across the floor, shattered glass, and people sat among the wreckage.An emergency was declared as hospitals began to receive the wounded, with an appeal sent out for blood donations.AFP via Getty ImagesAlmost 170 were injured in the explosion, with an appeal for blood donors being issuedAbbas, who said he \"lost his senses\" in the moments after the explosion, was eventually pulled out by emergency services and taken to hospital, where he was quickly released.\"Fortunately, I did not suffer much injury,\" he said.According to Pakistan's defence minister, the attacker opened fire and detonated the bomb after being challenged by security guards.The mosque's caretaker Syed Ashfaq - who lives next door - also heard gunfire, and began running towards the mosque to help.\"By the time I reached it there had already been an explosion,\" he told the BBC. \"Bodies were lying everywhere, some were missing arms, some missing legs. We took the most injured in our own vehicle [to hospital].\"Islamabad's deputy commissioner Irfan Memon said on X that the death toll stood at 31, with the injured numbering 169.Pictures from local hospitals show the injured being brought by private vehicles and ambulances, with one photographer for news agency AFP saying they saw dozens of people arriving at hospital.Attacks are relatively rare in the capital, although one in November left 12 dead. Another 27 were injured in the blast, outside a courthouse.The blast on Friday comes after a week of violence which saw 58 civilians killed in coordinated attacks in the province of Balochistan. The Balochistan Liberation Army (BLA) rebel group said it was behind the attacks. The military - which has been fighting an insurgency in the region for decades - said it had killed more than 200 militants in response.Last year was also Pakistan's deadliest in over a decade as combat-related deaths surged 74%, with militants accounting for more than half the death toll, according to a new report released by an independent think tank.The Pakistan Institute for Conflict and Security Studies (PICSS) said violence in Pakistan left 3,413 people dead - up from 1,950 in 2024 - with 2,138 militants killed.Additional reporting Caroline Davies",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pakistan mosque explosion: More than 30 dead and 169 injured, officials say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/964e/live/9c64f060-0394-11f1-a36d-4dc7f32cefeb.jpg"
      ],
      "datePublished": "2026-02-07T00:35:37.000Z",
      "dateModified": "2026-02-07T00:35:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Suspected Chinese spies arrested in quiet French town",
    "url": "https://www.bbc.com/news/articles/cwy8yw98l2xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e41d/live/68101390-037f-11f1-a1bf-cf780f66d064.jpg",
    "tag": "World",
    "date": "2026-02-06T17:18:13.000Z",
    "description": "8 hours agoHugh SchofieldParis correspondentAlamyThe two men, aged 27 and 29, had rented a property in Camblanes-et-Meynac, home to about 3,000 people",
    "body": "8 hours agoHugh SchofieldParis correspondentAlamyThe two men, aged 27 and 29, had rented a property in Camblanes-et-Meynac, home to about 3,000 peopleTwo suspected Chinese spies, accused of using a sleepy village in south-western France to gather information, have been arrested.Residents of Camblanes-et-Meynac, about 15km (9 miles) from Bordeaux, grew suspicious when - after letting a house through rentals giant Airbnb - the Chinese pair erected a large parabolic antenna in the garden.The dish was directed at the sky and locals noticed that its installation coincided with a spate of cuts to their own internet service.Intelligence experts believe south-western France is being increasingly targeted by Chinese and other espionage because of the region's proximity to defence, aerospace and telecommunication sites.Last Saturday, officers from France's General Directorate for Internal Security (DGSI) agency raided the house and seized a large quantity of computer equipment.The men - Chinese nationals aged 27 and 29 - were questioned at DGSI headquarters in the suburbs of France's capital Paris, and have now been charged with \"delivering information to a foreign power... likely to damage the interests [of France]\". They are being held in custody.The prosecutor's office said the men had arrived in France last month under work visas which said they were engineers at a company specialising in wireless communications.Two other men of Chinese origin, but living in France, have been charged with providing assistance. According to the prosecutor's office, the suspected spies were trying to \"capture satellite data from [X owner Elon Musk's] Starlink network, as well as data from vital entities, notably military, in order to retransmit them to their country of origin, China\".It is not the first time suspected Chinese spies have been caught in south-western France.Last summer, a 51-year-old Chinese engineer was detained in the village of Boulogne-sur-Gesse, about 40 miles south-west of Toulouse. She had also installed a satellite dish and was suspected of trying to intercept signals from the Issus-Aussaguel ground station in the Toulouse suburbs.Meanwhile, in December, a mathematics researcher at the University of Bordeaux's Institute of Mechanics and Engineering was placed under judicial investigation for \"providing information to a foreign power\" after he allegedly allowed members of a Chinese delegation into a restricted area.\"We do not know precisely what the pair at Camblanes-et-Meynac were up to, but the list of potential targets in the south-west of France is very large,\" said Jeremy André, an expert in Asian espionage at Intelligence Online.In addition to Issus-Aussaguel - which communicates with satellites used by the French military and intelligence - there is a major airbase at Bordeaux-Mérignac. Defence industries like Airbus, Thales and Dassault all have installations in the area.\"Since World War One, the south-west has been a vital zone for French defence research,\" André said. \"The idea was to focus activity as far as possible from the frontline, and then it stayed.\"He continued: \"We know that the Chinese have spent a lot of energy developing co-operation with towns and other collectivities in the south-west, via legitimate diplomatic and economic channels.\"In itself, there's nothing wrong with that, but in doing so they create a tissue of links which can be activated on demand.\"According to intelligence experts, French authorities have recently decided to take cases like this to court. Previously, they would have chosen to deal with them covertly, suggesting a greater determination to publicise the espionage threat from China.In Camblanes-et-Meynac, locals were bemused by the story. \"Here we tend to get artists, not spies,\" said Mayor Jean-Philippe Guillemeot. \"Maybe they just wanted somewhere nice and quiet.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Suspected Chinese spies arrested in quiet French town",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e41d/live/68101390-037f-11f1-a1bf-cf780f66d064.jpg"
      ],
      "datePublished": "2026-02-06T17:18:13.000Z",
      "dateModified": "2026-02-06T17:18:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": " Trump removes video with racist clip depicting Obamas as apes",
    "url": "https://www.bbc.com/news/articles/ce8r8y78g10o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d500/live/81b74920-036c-11f1-bab5-81d0d0b0abce.jpg",
    "tag": "World",
    "date": "2026-02-06T21:14:18.000Z",
    "description": "4 hours agoBernd Debusmann Jrat the White HouseGetty ImagesTrump and other administration officials routinely share memes and AI-generated imageryUS P",
    "body": "4 hours agoBernd Debusmann Jrat the White HouseGetty ImagesTrump and other administration officials routinely share memes and AI-generated imageryUS President Donald Trump has removed a social media video which included a racist clip depicting Barack and Michelle Obama as apes.The clip - set to the song The Lion Sleeps Tonight - was at the end of a 62-second video he shared containing claims about voter fraud in the 2020 presidential election.Republican Senator Tim Scott - who is black - had called for the president to remove the post, describing it as  \"the most racist thing I've seen out of this White House\".The White House initially defended the clip as an \"internet meme video\" and told critics to \"stop the fake outrage\".After a growing backlash, including from several Republican senators, the post was removed from Trump's Truth Social account and a White House official said that a staffer had \"erroneously\" made the post.The clip - which recalls racist caricatures comparing black people to monkeys - appears to be taken from an X post shared by conservative meme creator Xerias in October. That video also depicts several other high-profile Democrats as animals, including New York Representative Alexandria Ocasio-Cortez, New York City Mayor Zohran Mamdani and former Secretary of State Hillary Clinton. Trump's predecessor in the White House, Joe Biden, is also depicted as an ape eating a banana. The Obamas have yet to comment on the video. While the president offered no comment in his post, his sharing of the video - one of dozens posted on his Truth Social account overnight - sparked a fierce backlash. Some criticism came from within Trump's own party. Senator Scott, a black South Carolina Republican and an ally of Trump, posted that he was \"praying it was fake because it's the most racist thing I've seen out of this White House\".\"The President should remove it,\" he added. Another Republican, New York representative Mike Lawler, called the post \"wrong and incredibly offensive - whether intentional or a mistake\" and said it \"should be deleted immediately with an apology offered.\" The criticism continued even after the post was taken down. John Curtis, a Republican Senator from Utah, posted on social media that the video was \"blatantly racist and inexcusable\". \"It should never have been posted or left published for so long,\" he wrote. According to CBS, the BBC's US partner, Florida representative Byron Donalds - a longtime supporter of Trump's who is running for governor - called the White House after the video was posted and was told that it was the work of a staffer who \"let the president down\". The BBC has contacted the White House for clarification on how many people have access to the president's account and what the approval process is for posts. In a statement sent to the BBC earlier in the day, White House Press Secretary Karoline Leavitt said that the clip is from \"an internet meme video depicting President Trump as the King of the Jungle and Democrats as characters from the Lion King\". \"Please stop the fake outrage and report on something today that actually matters to the American public,\" she added. Before it was removed, Derrick Johnson, the president of the National Association for the Advancement of Colored People, or NAACP, called the video \"disgusting and utterly despicable\" and accused Trump of attempting to distract the public from the Epstein case and a \"rapidly failing economy.\" Ben Rhodes, a former deputy national security adviser for strategic communications in the Obama White House, said: \"Let it haunt Trump and his racist followers that future Americans will embrace the Obamas as beloved figures while studying him as a stain on our country.\" In a short post of his own, Illinois Governor JB Pritzker said that \"Donald Trump is a racist\". \"Disgusting behaviour by the president,\" the office of California Governor Gavin Newsom wrote on X. \"Every single Republican must denounce this. Now.\" House Minority Leader Hakeem Jeffries - who himself accused Trump of racism last year after he shared an AI-image depicting Jeffries with a moustache and sombrero - responded to the recent video by calling Trump a \"vile, unhinged and malignant bottom feeder\". \"Every single Republican must immediately denounce Donald Trump's disgusting bigotry,\" he added. The clip of the Obamas was added to the end of a minute-long video which included claims about a voting conspiracy in Michigan in the 2020 presidential election. Those claims were debunked as part of Dominion Voting System's successful civil legal actions against some media companies.Trump also has a long history of criticising and attacking Obama.Before his first term as president, Trump regularly made false claims that the Hawaii-born Obama was actually born in Kenya and therefore was ineligible to be president.He later acknowledged that Obama was born in the US.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": " Trump removes video with racist clip depicting Obamas as apes",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d500/live/81b74920-036c-11f1-bab5-81d0d0b0abce.jpg"
      ],
      "datePublished": "2026-02-06T21:14:18.000Z",
      "dateModified": "2026-02-06T21:14:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nigerian court orders UK to pay £420m over 1949 killing of miners in Iva Valley, Enugu",
    "url": "https://www.bbc.com/news/articles/c4g3g51klyno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/343b/live/99f24480-0359-11f1-bf09-218341647648.jpg",
    "tag": "World",
    "date": "2026-02-06T15:50:35.000Z",
    "description": "9 hours agoJean OtalorCentre for memoriesA statue commemorating the killing of the coal miners was erected in the centre of EnuguA Nigerian court has ",
    "body": "9 hours agoJean OtalorCentre for memoriesA statue commemorating the killing of the coal miners was erected in the centre of EnuguA Nigerian court has ordered the British government to pay $27m (£20m) to each of the families of 21 coal miners killed in 1949 by the colonial administration in the south-east of the country.The colonial police, made up of Nigerians and Europeans, shot dead workers striking for better conditions. Dozens more were injured in what the state-run News Agency of Nigeria described as one of the most notorious acts of repression under British rule in Nigeria.Historians say the killing helped galvanise support for the burgeoning anti-colonial movement that led to independence 11 years later, in 1960.The UK government said it had not been formally notified of the judgement and so could not comment.The UK had not been represented in the proceedings, a spokesperson told the BBC.Families and rights groups have led a decades-long campaign for official acknowledgment and compensation.The ruling, delivered by Justice Anthony Onovo in Enugu, described the massacre as unlawful and extrajudicial violation of the right to life, NAN reports.According to him, the British government must be held accountable and must make reparations to the victims' families.\"These defenceless coal miners were asking for improved work conditions, they were not embarking on any violent action against the authorities, but yet were shot and killed,\" Onovo told the Enugu High Court.The workers at the Iva Valley coal mine were protesting against harsh working conditions, racial disparities in wages and unpaid back wages. When their demands were not met, they adopted a \"go-slow\" protest and occupied the mine to prevent management from locking them out, NAN reports.The suit was brought by human rights activist, Mazi Greg Onoh, who listed the British and Nigerian governments as respondents.\"This ruling represents a significant milestone in the pursuit of historical accountability and justice for colonial-era violations, affirming that the right to life transcends time, borders, and changes in sovereignty,\" said the applicants' lawyer, Prof Yemi Akinseye-George.The killings took place on 18 November 1949 in Enugu, which was the administrative capital of the Eastern Region of British-administered Nigeria at the time.Historian Damola Adebowale told the BBC it was a \"trigger-point\" for the independence movement. \"Calls for independence already exist[ed] and talks [were] ongoing. The massacre was a reference point for people outlining the need for the colonialists to go,\" he said.During an official investigation at the time, the police defended the shootings by saying they feared being overwhelmed.But among those that the inquiry blamed were the colonialists in charge of the police for inflaming the situation. Those killed are now celebrated in the region as heroes.Additional reporting by Chiagozie Nwonwu and Nduka OrjinmoMore about Nigeria from the BBC:Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nigerian court orders UK to pay £420m over 1949 killing of miners in Iva Valley, Enugu",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/343b/live/99f24480-0359-11f1-bf09-218341647648.jpg"
      ],
      "datePublished": "2026-02-06T15:50:35.000Z",
      "dateModified": "2026-02-06T15:50:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Police probe new message in search for mother of Savannah Guthrie",
    "url": "https://www.bbc.com/news/articles/c2e1e7nlegko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/40b4/live/00fd4170-03b4-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "World",
    "date": "2026-02-06T23:47:23.000Z",
    "description": "2 hours agoRegan Morris,in Tucson, ArizonaandMax MatzaWatch: What's happened since Savannah Guthrie's mother disappeared?Police are investigating a me",
    "body": "2 hours agoRegan Morris,in Tucson, ArizonaandMax MatzaWatch: What's happened since Savannah Guthrie's mother disappeared?Police are investigating a message which may be linked to the missing mother of US news presenter Savannah Guthrie, as her family continues to plea for proof that their mother is still alive. The FBI and Pima County Sheriff's Department said on Friday that they \"are aware of a new message regarding Nancy Guthrie\". The statement added that they are \"inspecting the information provided in the message for its accuracy\".It comes after the first deadline from an alleged ransom letter passed on Thursday evening.The 84-year-old is believed to have been abducted from her home in Tucson, Arizona last weekend. Police are offering a reward of $50,000 (£36,000) for information that leads to an arrest.\"The FBI and Pima County Sheriff's Department are aware of a new message regarding Nancy Guthrie,\" police in a statement on social media on Friday afternoon. \"Investigators are actively inspecting the information provided in the message for its authenticity.\"The statement did not say who received the note, or any details that it may have contained. A presenter for a local affiliate of CBS News told the BBC that her channel received the \"message\". It is unclear if it was sent to other media outlets. On Thursday, Camron Guthrie - the son of the missing woman - renewed the family's plea, and confirmed that the family had not had any direct contact with kidnappers.\"We have to know that you have our mum,\" Camron said in the family's latest video message. \"We want to talk to you.\"\"We haven't heard anything directly,\" he said in the video, posted on Thursday just after 17:00 local time in Arizona (00:00 GMT).\"We need you to reach out, and we need a way to communicate with you so we can move forward.\"There has been a large police and media presence outside the Guthrie home for daysAt a briefing on Thursday, FBI Special Agent Heith Janke said his agency was reviewing an alleged ransom note. It gave a deadline for payment of 17:00 on Thursday, he said, without specifying which time zone, and had a second deadline for Monday.No further information was shared about what was threatened if the deadline was not met. \"We're not going to go into specifics,\" Janke said.It was announced the same day that authorities had made an arrest over a fake ransom note. Earlier in the week, Savannah Guthrie shared an emotional video message, along with her siblings. The host of NBC News' Today programme addressed the potential abductor or abductors directly, saying: \"We are ready to talk... We need to know without a doubt that she is alive and you have her... Please, reach out to us\".Pima County Sheriff Chris Nanos said on Thursday investigators were no closer to finding out who was responsible - but that they were working on the assumption she was still alive.\"Right now, we believe Nancy is still out there. We want her home,\" he said. \"Everybody's still a suspect in our eyes.\" Neighbours have erected signs for the Guthrie familyThe case has garnered nationwide attention, with dozens of reporters and camera crews descending on the quiet Arizona suburb where Nancy lives.Authorities have closed access to her street, nestled below the Santa Catalina mountains on roads lined with the state's iconic Saguaro cactus.\"Investigators are conducting follow-up at the Guthrie home and in the surrounding areas,\" police wrote in a post on X, adding that the road is \"restricted to provide investigators space\".One man, when asked how he felt about security, shouted that he had already been interviewed four times today and wasn't doing any more. He then showed us a big stick, saying this is all the security he needs. He added he was not worried about kidnappers but he was worried about javelina, the hoofed mammals found in Tucson.Authorities have urged the public to call the sheriff's office with any information, vowing to look into all leads, and discouraging the spread of misinformation.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Police probe new message in search for mother of Savannah Guthrie",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/40b4/live/00fd4170-03b4-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-06T23:47:23.000Z",
      "dateModified": "2026-02-06T23:47:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Russian general Alexeyev shot several times in Moscow attack",
    "url": "https://www.bbc.com/news/articles/c3686nzexp3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dbbc/live/8c424470-0331-11f1-bb5c-eb75deabbf98.jpg",
    "tag": "World",
    "date": "2026-02-06T16:39:38.000Z",
    "description": "9 hours agoPaul KirbyEurope digital editorWatch: BBC on the scene of Russian general shooting in MoscowA high-profile general in Russia's military has",
    "body": "9 hours agoPaul KirbyEurope digital editorWatch: BBC on the scene of Russian general shooting in MoscowA high-profile general in Russia's military has been shot several times and wounded in Moscow.Lt Gen Vladimir Alexeyev, 64, was taken to hospital after the attack in a residential block of flats in the north-western outskirts of the capital, and is believed to be in a serious condition. The attacker fled the scene.Alexeyev is number two in the main directorate of Russia's GRU military intelligence  and the latest high-ranking military figure to have been targeted in or near Moscow since the full-scale invasion of Ukraine in February 2022.No-one has so far claimed the attack, but senior Russian officials immediately blamed Ukraine, saying it was trying to derail negotiations to end the war.\"The victim has been taken to one of the city's hospitals,\" said Svetlana Petrenko of Russia's Investigations Committee (SK), which said it opened a criminal case for attempted murder.Investigators are searching CCTV footage for clues and began interviewing potential witnesses of the attack on Friday morning on Volokolamsk Highway.Russian Defence MinistryLt Gen Vladimir Alexeyev is number two in the main directorate of Russia's GRU military intelligenceA neighbour of Alexeyev told the Reuters news agency she had been woken by the sound of \"several\" shots and had then heard another neighbour screaming for help.  \"This is all I heard. Other neighbours rushed out, too. They asked how they could help, should they call ambulance and police, but she had already called them.\"Alexeyev has played a significant role during the war in Ukraine, taking part in talks with Ukraine during the Russian siege of the city of Mariupol in 2022. Earlier he was awarded the title Hero of Russia for the role he played in Moscow's military intervention in Syria's civil war.He was placed under European Union and UK sanctions after the GRU was accused of being behind the 2018 nerve agent attack in Salisbury in the UK.He was also sent to negotiate with the head of the Wagner mercenary group, Yevgeny Prigozhin, who led a short and bloody mutiny in June 2023.His boss at the GRU, Igor Kostyukov, has been in charge of Russia's negotiating team at peace talks with Ukrainian and US teams in Abu Dhabi. The latest round ended on Thursday without a major breakthrough.It is not yet known who was behind the shooting - but Russian Foreign Minister Sergei Lavrov was quick to accuse Ukraine.He said \"this terrorist act\" was aimed at \"disrupting the negotiation process\".Kremlin spokesman Dmitry Peskov said President Vladimir Putin was being briefed on the shooting. \"We wish first of all that the general survives and recovers. We hope that will be the case,\" Peskov told reporters.Ukraine has not commented but has claimed some attacks on Russian military figures in the past. Russian intelligence officials claimed they had thwarted an attempted attack on a Russian soldier in St Petersburg at the end of last month.An Uzbek man was jailed in January for the 2024 killing of another general, Igor Kirillov, in an explosion outside a block of flats in Moscow. Sources in Ukraine's SBU intelligence said at the time it was behind the attack.Lt Gen Kirillov had been in charge of Russia's Nuclear, Biological and Chemical Protection troops.In December 2025, another high-ranking officer in the GRU, Lt Gen Fanil Sarvarov, was killed when an explosive device detonated under a car in Moscow. He was in charge of the armed force's operational training department, according to Russia's SK.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Russian general Alexeyev shot several times in Moscow attack",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dbbc/live/8c424470-0331-11f1-bb5c-eb75deabbf98.jpg"
      ],
      "datePublished": "2026-02-06T16:39:38.000Z",
      "dateModified": "2026-02-06T16:39:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zambia fisherman fleeing elephants killed by crocodile",
    "url": "https://www.bbc.com/news/articles/czx1xl98qkpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/89d9/live/809bb1e0-036a-11f1-bab5-81d0d0b0abce.jpg",
    "tag": "World",
    "date": "2026-02-06T14:47:22.000Z",
    "description": "11 hours agoWycliffe MuiaGetty ImagesZambian rivers have some of the highest concentrations of crocodiles in Africa (file photo)A 52-year-old fisherma",
    "body": "11 hours agoWycliffe MuiaGetty ImagesZambian rivers have some of the highest concentrations of crocodiles in Africa (file photo)A 52-year-old fisherman has died after being attacked by a crocodile while fleeing a herd of elephants in eastern Zambia, police say. Dean Nyirenda was returning from a fishing trip with two friends on Wednesday when they bumped into the elephants. They ran away, with Nyirenda diving into a stream near the Luangwa River.\"That is when he was attacked by a crocodile by biting his right thigh,\" local police chief Robertson Mweemba told journalists. The southern African country has a thriving elephant population and clashes between humans and wildlife have claimed many lives in recent years.Police said Nyirenda had managed to escape the crocodile by hitting it with a stick which he had in his hands.\"He dragged himself from the stream,\" said MweembaHis two fellow fishermen, who had been watching from a distance, went to help him and carried him from the riverbank while he was bleeding heavily, state-run ZNBC news website reported.  \"They tried to stop the bleeding but unfortunately he died,\" added the police chief. Wildlife officers later visited the scene and found deep bite marks on the fisherman's right thigh, which had led to the fatal bleeding.The BBC has reached out to the authorities for comment.The Luangwa River, which flows through Zambia's South Luangwa National Park, is home to one of the highest concentrations of Nile crocodiles in Africa, according to conservationists. Of the 26 wildlife-related deaths recorded in 2023, 15 were caused by crocodile attacks, most of them along the Luangwa River, according to Resource Africa, a community-led conservation NGO.Zambian authorities have previously called on locals and tourists to exercise extreme caution when travelling through the country's wildlife hotspots.Wildlife authorities say they have been considering measures to reduce the human-animal conflicts, including building protective fences near wildlife areas.You may also be interested in: Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zambia fisherman fleeing elephants killed by crocodile",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/89d9/live/809bb1e0-036a-11f1-bab5-81d0d0b0abce.jpg"
      ],
      "datePublished": "2026-02-06T14:47:22.000Z",
      "dateModified": "2026-02-06T14:47:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Norway's crown princess apologises after pressure over Epstein friendship",
    "url": "https://www.bbc.com/news/articles/c78v8wx6jjxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c1e7/live/9de81cb0-038e-11f1-a36d-4dc7f32cefeb.jpg",
    "tag": "World",
    "date": "2026-02-06T21:34:24.000Z",
    "description": "4 hours agoPaul KirbyEurope digital editorVisionhaus/Getty ImagesThe crown princess said that the messages exchanged with Epstein did not represented ",
    "body": "4 hours agoPaul KirbyEurope digital editorVisionhaus/Getty ImagesThe crown princess said that the messages exchanged with Epstein did not represented who she wanted to be (file pic)Norway's Crown Princess Mette-Marit has given a \"profound apology\" to Norwegians for her friendship with late sex offender Jeffrey Epstein, after it emerged they had exchanged messages for three years.\"I also apologise for the situation in which I have placed the Royal House, especially the King and Queen,\" she said in a palace statement after days of mounting pressure to address the issue.Harald V and Queen Sonja, who are both 88, have not commented on the revelations. The King met Prime Minister Jonas Gahr Støre on Friday, alongside Crown Prince Haakon, who told reporters later that his wife wanted to speak: \"But right now she can't, and I also tell her she is not allowed to.\"Hundreds of emails from 2011-14 involving Epstein and the crown princess came to light in the cache of files published by the US justice department a week ago. Some of the exchanges apparently involve plans to meet in person, and reveal she spent four days at Epstein's Palm Beach house in Florida while he was not there.The warm nature of the correspondence has come as a shock to Norwegians, and she appears to have been aware he had already served a jail term in 2008: \"Googled u after last email,\" she wrote in October 2011. \"Agree didn't look too good.\"Although an initial statement was released last Saturday, in which the crown princess expressed regret and admitted \"poor judgement\", the palace had been pressed to provide further details of how well she knew Epstein.In a statement on Friday, the palace said the crown princess was deeply saddened that she had failed to realise early enough what kind of person he was. She wanted to provide a more detailed explanation but was in a \"very difficult situation\" and needed time to \"gather herself\".\"It is important for me to say I am sorry to all those I have disappointed. Some of the content in the messages between Epstein and me does not represent the person I want to be.\"Mette-Marit already had a four-year-old boy, Marius Borg Høiby, from an earlier brief relationship when she married Norway's Crown Prince Haakon in 2001.Her first child Marius Borg Høiby is now 29 and at the centre of a high-profile seven-week trial which began this week. He faces 38 charges, including four counts of rape which he denies.Although neither part of the royal family nor a public figure, he has grown up within his step-father Crown Prince Haakon's family, alongside half-sister Princess Ingrid Alexander and half-brother Prince Sverre Magnus.Rune Hellestad/Getty ImagesFile pic showing Crown Prince Haakon (R) and the crown princess with his step-son (L) and Princess Ingrid Alexandra (C-L) His mother has not commented on the trial but Crown Prince Haakon told reporters in Oslo there was a lot going on in his family and the most important thing in the past few days \"has been to take care of the flock\".\"We support Marius in the situation he is in. We look after the other children as well... They also need to be cared for, and I have to make sure to take care of the crown princess,\" he said.Mette-Marit is also extremely unwell with pulmonary fibrosis and her doctors are preparing to put her on a list for a lung transplant.Giving evidence in court on Wednesday, her son initially struggled to compose himself, holding back tears as he complained of being \"hassled\" by the press since he was three years old.If found guilty by the three judges at Oslo district court, he could face a jail term of at least 10 years. Two days before the trial began, he was arrested for a fourth time on Sunday, on suspicion of assault, wielding a knife and violating a restraining order. His half-sister Princess Ingrid Alexandra, 22, was also critical of the press in a post to almost 800 followers on a private Instagram account this week.In lengthy comments seen by public broadcaster NRK, Aftenposten and VG website, the princess, who is second in line to the Norwegian throne after her father, said it was important \"not to make claims you have no basis for\".While stressing she was not referring to anything in particular - \"not Marius, not mum or dad or Magnus. It's about personal attacks, it can apply to anyone, but I chose to post this here because I'm going crazy. Enough is enough\".When approached by the BBC, the palace said it did not wish to comment on the matter.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Norway's crown princess apologises after pressure over Epstein friendship",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c1e7/live/9de81cb0-038e-11f1-a36d-4dc7f32cefeb.jpg"
      ],
      "datePublished": "2026-02-06T21:34:24.000Z",
      "dateModified": "2026-02-06T21:34:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ukrainian mother's joy after phone call with son she thought had been killed",
    "url": "https://www.bbc.com/news/articles/cedwdljyx46o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f815/live/38c4c480-0381-11f1-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-06T18:17:39.000Z",
    "description": "7 hours agoSarah RainsfordEastern Europe correspondent in KyivWatch: Ukrainian soldier thought to be dead calls his familyNazar Daletskyi's family wer",
    "body": "7 hours agoSarah RainsfordEastern Europe correspondent in KyivWatch: Ukrainian soldier thought to be dead calls his familyNazar Daletskyi's family were sure the soldier had been killed in action.In 2023, they'd buried his body in the village cemetery, in western Ukraine.But Nazar has just phoned his mother, weakened and exhausted - but very much alive.\"My emotions were so strong,\" the soldier's mother Nataliya told the BBC, still reeling from the shock.The joy of all the family at that first call, captured on video, is overwhelming.Nataliya asks her son whether he's intact, \"You have your arms, your legs, everything?\" she wants to know. \"My golden child, I have been waiting for you so long.\"Nazar's cousin, Roksolana, is screaming and jumping for joy in the background.\"It was so strange, because my son had died, I buried him, but here's his voice. Can you imagine the emotions of a mother? Happiness. Great happiness. I could not hold back my tears,\" Nataliya said.The full story of Nazar's return from the grave is extraordinary, especially in a country at war where good news is precious.\"He didn't have any doubt. He went immediately,\" his cousin told the BBC.But in May that first year, Nazar went missing in action.His mother then got a call from a man speaking Russian who said Nazar had been captured, but \"everything will be fine\".The mystery voice didn't say where Nazar was, who was holding him - or whether he was injured. The family had no idea whether to believe him - and they got no official news.That was until a year later, when Nataliya was informed that a body had been identified in a morgue in south-eastern Ukraine, using a sample of DNA she had given.\"The body was badly burned. They had several that they found in a burned bus. When they started looking at the lists of missing soldiers, the data matched,\" Roksolana explains. \"They identified this body as Nazar.\"So the family received the body, held a funeral and they grieved.Then last September they got the biggest shock of all. A soldier, just released by Russia, called to tell them Nazar was alive. He had seen him in jail.\"We were shocked, it was so hard to believe. But why would he lie?\" Roksolana remembers how it felt.Still, without speaking to Nazar or seeing him, they couldn't be sure.Then this week, he called - back on Ukrainian soil. Nataliya's son had been gone for three years and nine months.As they wait for their big reunion, the family have been trying to remove material about Nazar's funeral from social media, not to upset him.They also had to get his photograph taken down from a display of fallen heroes in the village.There's now an investigation to understand how such a distressing mistake was made.But for the moment, the family have other things to focus on.Nazar's mother is preparing all his favourite homemade food, for when he's recovered a bit and ready to come home.\"I just want more positive outcomes like ours, for other families to get calls and for people to come home,\" Roksolana says.Some 70,000 people are officially missing here, most thought to be soldiers. Some will have been killed on the battlefield, their bodies impossible to recover.But many have been taken prisoner and, for their families, Nazar's story will be a glimmer of hope.\"I wish all women, mothers, children get a call like we had - and this happiness,\" Nataliya says.\"I'm just waiting for my son now, to hug him so tightly. I love him very much.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ukrainian mother's joy after phone call with son she thought had been killed",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f815/live/38c4c480-0381-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-06T18:17:39.000Z",
      "dateModified": "2026-02-06T18:17:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anke Gowda: The Karnataka man who built a library of two million books",
    "url": "https://www.bbc.com/news/articles/cp873z18028o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a2f1/live/6e3f3700-0311-11f1-8727-2dfe1c773f32.jpg",
    "tag": "World",
    "date": "2026-02-07T00:42:45.000Z",
    "description": "The retired Indian factory worker who built a library of two million books37 minutes agoImran QureshiMandya district, KarnatakaAlphonse VimulrajAnke G",
    "body": "The retired Indian factory worker who built a library of two million books37 minutes agoImran QureshiMandya district, KarnatakaAlphonse VimulrajAnke Gowda was passionate about books since he was a child and wanted to inspire others to read tooTwo million books, housed across a sprawling building, free for anyone to borrow and read.That's the wealth that Anke Gowda, a retired sugar factory worker from India's southern Karnataka state, has accumulated over the past five decades.The 79-year-old made headlines last month when he received the Padma Shri - a civilian honour awarded by the federal government - for his extraordinary contribution to promoting literacy and learning.Gowda - whose eye-popping collection includes rare editions of the Bible, along with books on every subject imaginable - comes from a farming family where books were a luxury.\"I grew up in a village. We never got books to read, but I was always curious about them. I kept thinking that I should read, gather books and gain knowledge,\" he told the BBC.Gowda's library is located in Pandavapura, a small municipality in Karnataka's Mandya district. It lacks the rigid organisation usually associated with libraries. In fact, Gowda's collection doesn't have a librarian and books are stacked on shelves and piled on the floor in a haphazard manner.Outside, under the library's awnings are sacks filled with an estimated 800,000 books, still waiting to be unpacked. The collection is still growing, through Gowda's purchases and donations from others.The place is frequented by students, their parents, teachers and book lovers. Regular visitors seem to know their way around the library and find the books they need with ease. And even if they can't, they say, Gowda can find anything.Gowda, his wife and son live in a corner of the library, which is open every day of the week - and for long hours.Alphonse VimulrajGowda's library has books on a vast array of subjects...Alphonse Vimulraj...and finding a book can be quite a challengeGowda spent his childhood juggling school and helping his father with farm work. He would often ask his parents and elder sister for money to buy books.  When he began reading books about Indian freedom fighters and spiritual leaders, he got hooked.\"They were like candy,\" he says.Inspired by a teacher, he started building a small collection of books so that other students from rural areas could also read.He often used the money his parents gave him for food to buy books instead.Soon after finishing school, he started working as a bus conductor.One day, about 10 months into the job, he bumped into a former teacher who was shocked to hear that he had quit studying. He insisted that Gowda resign and go to college. Gowda followed his advice and went on to get a postgraduate degree in Kannada (the official language of Karnataka), before joining the Pandavapura sugar factory as a timekeeper.He would spend two-thirds of his monthly salary on books, and use the remaining money for groceries and other necessities.\"Salaries were low then, but prices were also low,\" he says.Over the 33 years he worked at the factory, Gowda attended dozens of conferences of the Kannada Sahitya Parishat - a non-profit dedicated to developing the local language and literature - and would often buy discounted books from them.He also augmented his income by raising cows and selling milk, and working as an insurance agent.His next hurdle would be familiar to book lovers everywhere - finding space to house his overflowing collection.\"I started keeping the books in trunks [large metal boxes]. Then I installed bookshelves in my house. But at one point, there was no place left,\" he says.At the time, he had acquired around 50,000 books.Alphonse VimulrajGowda's collection includes rare editions of the BibleHelp came when some of his friends met Hari Khoday, the late liquor baron who was building a temple in Pandavapura.Khoday, recalls Gowda, couldn't believe that one man could own so many books.\"He came and saw the books for himself. Then he asked me what I needed. I told him I didn't want any money for myself. My only request was that he build a library,\" Gowda says.Khoday agreed and paid for the construction of a huge building, which is now part of Gowda's sprawling library which stretches across 15,800 sq ft (1,467 sq m).Some years later, a local lawmaker brought then Chief Minister HD Kumaraswamy to see the library and he authorised money for the construction of two more structures attached to the first one.Today, students and teachers from across the state visit the library. Among them is Ravi Bettaswami, an assistant professor at a private college who says that he has also been inspired to build a collection of thousands of books.\"I have used Gowda's library to study and have taken my students there so they could read and also help organise the books,\" he says.Shilpashree Haranu, who teaches at a government college, says that the collection may look messy as it has not been organised by a professional librarian. \"But he [Gowda] knows exactly where each book is and can tell you in an instant,\" she says.When asked why he never hired a librarian, Gowda says no-one ever suggested that to him.As for the future of the library, Gowda strikes a philosophical note, suggesting that it is now up to others to take his legacy forward.\"I have fulfilled my responsibility. But I don't have the energy anymore. Maybe the government and the public can take over now? \"I have done my best, now it is up to others.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anke Gowda: The Karnataka man who built a library of two million books",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a2f1/live/6e3f3700-0311-11f1-8727-2dfe1c773f32.jpg"
      ],
      "datePublished": "2026-02-07T00:42:45.000Z",
      "dateModified": "2026-02-07T00:42:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Watch: Trump has called to nationalise US elections. Is it a big deal?",
    "url": "https://www.bbc.com/news/videos/cqxyx2pl1pzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dd13/live/19798a90-03ac-11f1-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-06T22:48:07.000Z",
    "description": "US President Donald Trump has urged Republicans to \"nationalise\" elections while repeating his false claims of 2020 election fraud in a podcast interv",
    "body": "US President Donald Trump has urged Republicans to \"nationalise\" elections while repeating his false claims of 2020 election fraud in a podcast interview.The US Constitution says that individual states determine how they carry out elections, and voting has long been administered by local officials across the country.The BBC's Washington correspondent Daniel Bush explains why the president's comments are causing a stir in a midterm election year. Video edited by Alex Foster, filmed by Blanca Estrada",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Watch: Trump has called to nationalise US elections. Is it a big deal?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dd13/live/19798a90-03ac-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-06T22:48:07.000Z",
      "dateModified": "2026-02-06T22:48:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]