[
  {
    "title": "Trump sends California troops to Portland after court denies order",
    "url": "https://www.bbc.com/news/articles/c740elm70z7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4846/live/fcbf6450-a245-11f0-98b7-cdc4bf2f32f3.jpg",
    "tag": "World",
    "date": "2025-10-06T05:51:39.000Z",
    "description": "<div><div><p>2 hours ago</p></div><p><span><p><span>Christal Hayes</span><span>Los Angeles</span></p></span></p></div><div><p>US President Donald Trum",
    "body": "<div><div><p>2 hours ago</p></div><p><span><p><span>Christal Hayes</span><span>Los Angeles</span></p></span></p></div><div><p>US President Donald Trump has sent troops from California to Oregon after a court denied his attempt to deploy the National Guard in Portland.</p><p>The deployment circumvents a <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/c2dnk0ee6pyo\">judge's order</a> blocking the deployment by instead using National Guard soldiers already serving in Los Angeles.</p><p>California Governor Gavin Newsom vowed to file a lawsuit over the move, which he called a \"breathtaking abuse of the law\", while Illinois Governor JB Pritzker said Trump was also redeploying the Texas National Guard.</p><p>Portland is the latest Democrat-led city targeted as part of the president's attempt to address what he says is out-of-control crime, amid protests over the Trump administration's immigration enforcement.</p></div><div><p>The Pentagon confirmed 200 members of the California National Guard had been reassigned to Portland to \"support US Immigration and Customs Enforcement and other federal personnel performing official duties\". </p><p>White House spokeswoman Abigail Jackson said: \"President Trump exercised his lawful authority to protect federal assets and personnel in Portland following violent riots and attacks on law enforcement.\"</p><p>She attacked Newsom, saying he should \"stand on the side of law-abiding citizens instead of violent criminals destroying Portland and cities across the country\".</p><ul><li><a target=\"_blank\" href=\"https://www.bbc.com/news/articles/cvgq044n72po\">US cities should be military training grounds, Trump tells generals</a></li><li><a target=\"_blank\" href=\"https://www.bbc.com/news/articles/c2dnk0ee6pyo\">Trump authorises deployment of 300 National Guard troops to Chicago</a></li></ul><p>Pritzker said late on Sunday night that Trump was \"ordering 400 members of the Texas National Guard for deployments to Illinois, Oregon, and other locations within the United States\".</p><p>He called on Texas Governor Greg Abbott to \"immediately withdraw any support for this decision and refuse to co-ordinate\".</p><p>Over the summer, there were large daily protests in Los Angeles after the city became a target of increased immigration raids. </p><p>Trump deployed the state's National Guard to quell the unrest in June - a significant decision, as deployments are typically left to a state's governor. </p><p>Newsom argued that using the military in Los Angeles was unnecessary and inflamed tensions. Trump said it saved the city from burning to the ground.</p><p>It is the troops still in Los Angeles from that deployment who the Trump administration redeployed to Portland.</p><p>\"This isn't about public safety, it's about power. The commander-in-chief is using the US military as a political weapon against American citizens,\" Newsom said, accusing the president of ignoring courts. </p><p>\"We will take this fight to court, but the public cannot stay silent in the face of such reckless and authoritarian conduct.\"</p><p>Protests have been ongoing in Portland and other cities over the Trump administration's increased immigration enforcement. </p><p>Portland, in particular, has long drawn Trump's ire over its alleged concentration of people his supporters describe as Antifa, short for \"anti-fascist\". The president recently signed an executive order designating the group, which is a loosely organised movement of far-left activists, as a domestic terrorist organisation.</p><p>The Portland deployment came one day after Trump authorised the deployment of <a target=\"_blank\" href=\"https://www.bbc.com/news/articles/c2dnk0ee6pyo\">300 National Guard troops to Chicago</a> under a similar pretext.</p><p>The city in Illinois has also seen protests over increased immigration enforcement. On Saturday, protests became violent, with immigration authorities saying they opened fire on an armed woman after she and others allegedly rammed their cars into law enforcement vehicles. </p><p>The woman's condition is unclear, but officials said she drove herself to hospital. </p><p>State and local leaders have decried Trump's deployment plans there and called it an abuse of power. Illinois Governor JB Pritzker said Trump was \"attempting to manufacture a crisis\".</p><p>On Sunday, Gov Pritzker told CNN that the authorisation of troops there will incite protests. He accused the administration of creating a \"warzone\" to rationalise the response.</p><p>\"They want mayhem on the ground. They want to create the warzone so that they can send in even more troops,\" he told CNN's Jake Tapper. \"They're using every lever at their disposal to keep us from maintaining order.\"</p></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump sends California troops to Portland after court denies order",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4846/live/fcbf6450-a245-11f0-98b7-cdc4bf2f32f3.jpg"
      ],
      "datePublished": "2025-10-06T05:51:39.000Z",
      "dateModified": "2025-10-06T05:51:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Syria holds first elections since Assad, but not in all provinces",
    "url": "https://www.bbc.com/news/articles/czrpx1vvr45o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2ba5/live/7fd003f0-a042-11f0-92db-77261a15b9d2.jpg",
    "tag": "World",
    "date": "2025-10-05T00:04:50.000Z",
    "description": "<article><div><div><p>1 day ago</p></div><p><span><p><span>David Gritten</span><span></span></p></span></p></div><figure><div><p><img src=\"https://sta",
    "body": "<article><div><div><p>1 day ago</p></div><p><span><p><span>David Gritten</span><span></span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/b678/live/d2745390-a042-11f0-92db-77261a15b9d2.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/b678/live/d2745390-a042-11f0-92db-77261a15b9d2.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/b678/live/d2745390-a042-11f0-92db-77261a15b9d2.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/b678/live/d2745390-a042-11f0-92db-77261a15b9d2.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/b678/live/d2745390-a042-11f0-92db-77261a15b9d2.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/b678/live/d2745390-a042-11f0-92db-77261a15b9d2.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/b678/live/d2745390-a042-11f0-92db-77261a15b9d2.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/b678/live/d2745390-a042-11f0-92db-77261a15b9d2.jpg.webp\" alt=\"Reuters Syrian President Ahmed al-Sharaa waves amid a crowd of people\" /><span>Reuters</span></p></div><p></p><figcaption>The elections are the first in Syria since Ahmed al-Sharaa ousted Bashar al-Assad last December</figcaption><p></p></figure><div><p>Syria will hold its first parliamentary elections on Sunday since the fall of Bashar al-Assad, amid concerns over inclusivity and successive delays.</p><p>There will be no direct vote for the People's Assembly, which will be responsible for legislation during a transitional period.</p><p>Instead, \"electoral colleges\" will select representatives for two-thirds of the 210 seats. Interim President Ahmed al-Sharaa will appoint the rest.</p><p>Long-time former President Assad was ousted by Sharaa's forces 10 months ago after a 13-year civil war.</p><p>Authorities say they have postponed the polls for security reasons in two Kurdish- controlled provinces and a third which saw deadly fighting between government forces and Druze militias.</p></div><div><p>The clashes, in July, marked the latest outbreak of sectarian violence in Syria since Assad's overthrow.</p><p>In a speech at the UN General Assembly last week - the first by a Syrian president in 60 years - Sharaa promised to bring to justice everyone responsible for the bloodshed, as well as those who committed atrocities under Assad.</p><p>He also pledged that Syria was now \"rebuilding itself through establishing a new state, building institutions and laws that guarantee the rights of all without exception\".</p><p>Sunday's polls are being overseen by the Higher Committee for the Syrian People's Assembly Elections, whose 11 members were chosen by the president in June.</p><p>The number of seats allocated in each of 60 districts is based on census data collected in 2010 - the year before the country descended into a civil war that killed more than 600,000 people and displaced another 12 million.</p><p>The postponement of the elections in the three provinces - Raqqa, Hassakeh and Suweida - means the electoral colleges in only 50 out of 60 districts will be choosing representatives for about 120 seats on Sunday.</p></div><div><p>There will be more than 1,500 candidates, who must also be electoral college members. Supporters of \"the former regime or terrorist organisations\" were barred from membership, as were advocates of \"secession, division or seeking foreign intervention\".</p><p>At least 20% of the electoral college members were required to be women. But there were no minimum quotas for female lawmakers, nor for those from the country's many ethnic and religious minorities.</p><p>The president will choose representatives for 70 seats from outside the electoral colleges.</p><p>Last month, 14 Syrian civil society groups expressed concern that this meant he would have direct influence over parliament's composition. </p><p>\"This setup makes the parliament susceptible to power balances not reflecting the voters' will and undermines its intended representative nature, enabling the executive authority to dominate an institution that should be independent and reflective of the popular will,\" a joint statement warned.</p><p>They also said the president's direct and indirect influence over the Higher Committee and the electoral colleges rendered the elections \"symbolic at best, devoid of their democratic purpose of ensuring representation and accountability\".</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/d661/live/3c484e70-a043-11f0-b741-177e3e2c2fc7.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/d661/live/3c484e70-a043-11f0-b741-177e3e2c2fc7.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/d661/live/3c484e70-a043-11f0-b741-177e3e2c2fc7.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/d661/live/3c484e70-a043-11f0-b741-177e3e2c2fc7.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/d661/live/3c484e70-a043-11f0-b741-177e3e2c2fc7.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/d661/live/3c484e70-a043-11f0-b741-177e3e2c2fc7.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/d661/live/3c484e70-a043-11f0-b741-177e3e2c2fc7.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/d661/live/3c484e70-a043-11f0-b741-177e3e2c2fc7.jpg.webp\" alt=\"Reuters A woman takes an oath during the selection of subcommittee members supervising Syrian parliament elections, as multiple people look on (03/09/25)\" /><span>Reuters</span></p></div><p></p><figcaption>Concern has been expressed over the level of female representation in the election </figcaption><p></p></figure><div><p>Sharaa has defended the way the elections are being held. \"As a transitional period, there is a difficulty to hold popular elections due to the loss of documents, and half of the population is outside of Syria, also without documents,\" he said in a television interview, referring to the millions of refugees who have not returned.</p><p>The Higher Committee said it was not possible to hold elections in Raqqa, Hassakeh and Suweida because of the \"security and political situation\". The 20 seats allocated to them will remain vacant until polls can take place.</p><p>Raqqa and Hassakeh are mostly controlled by a Kurdish-led militia alliance, the Syrian Democratic Forces (SDF), which is in a stand-off with the interim government over the implementation of a March agreement to integrate all military and civilian institutions into the state.</p><p>Thouraya Mustafa of the Kurdish Democratic Union Party (PYD) said the electoral process and delay showed the government had the same mentality \"as the previous authoritarian mentality\".</p><p>\"We see exclusion and denial of the rights of the Syrian people, such as elections. Therefore, the Syrian interim government does not represent the will of the Syrian people,\" she told Reuters news agency.</p><p>The government also holds little sway in Suweida, where tensions with the predominantly Druze population have remained high since the sectarian violence there three months ago.</p><p>The violence erupted when Druze militias clashed with Sunni Bedouin tribes, which prompted the government to send its forces to intervene. More than 1,000 people were killed in the fighting, most of them Druze, according to monitoring groups.</p><p>Hussam Nasreddin, a resident of the predominantly Druze southern Damascus suburb of Jaramana, dismissed the electoral process as \"more like an appointment\".</p><p>\"The People's Assembly should be elected by the people and it should represent the people,\" he told Reuters. \"Today we don't know anything. We did not see any lists or representatives. We didn't see anything.\"</p></div></article>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Syria holds first elections since Assad, but not in all provinces",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2ba5/live/7fd003f0-a042-11f0-92db-77261a15b9d2.jpg"
      ],
      "datePublished": "2025-10-05T00:04:50.000Z",
      "dateModified": "2025-10-05T00:04:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How the US got left behind in the global electric car race",
    "url": "https://www.bbc.com/news/articles/c8ex2l58en4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1211/live/e939d750-9fbe-11f0-b73e-e715acbd6a10.jpg",
    "tag": "World",
    "date": "2025-10-05T07:45:21.000Z",
    "description": "<article><div><div><p>24 hours ago</p></div><p><span><p><span>Natalie Sherman</span><span></span></p></span></p></div><figure><div><p><img src=\"https:",
    "body": "<article><div><div><p>24 hours ago</p></div><p><span><p><span>Natalie Sherman</span><span></span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/1211/live/e939d750-9fbe-11f0-b73e-e715acbd6a10.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/1211/live/e939d750-9fbe-11f0-b73e-e715acbd6a10.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/1211/live/e939d750-9fbe-11f0-b73e-e715acbd6a10.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/1211/live/e939d750-9fbe-11f0-b73e-e715acbd6a10.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/1211/live/e939d750-9fbe-11f0-b73e-e715acbd6a10.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/1211/live/e939d750-9fbe-11f0-b73e-e715acbd6a10.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/1211/live/e939d750-9fbe-11f0-b73e-e715acbd6a10.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/1211/live/e939d750-9fbe-11f0-b73e-e715acbd6a10.jpg.webp\" alt=\"Getty Images In an aerial view, three white electric cars sit parked at a charging station, with 'EV Charging Only' signs painted on the ground\" /><span>Getty Images</span></p></div></figure><div><p>You could be forgiven for thinking that electric cars might finally be gaining momentum in the US. </p><p>After all, sales of battery cars topped 1.2 million last year, more than five times the number just four years earlier. Hybrid sales have jumped by a factor of three.</p><p>Battery-powered cars accounted for 10% of overall sales in August - a new high, according to S&P Global Mobility. </p><p>And in updates to investors this week, General Motors, Ford, Tesla and other companies all reported record electric sales over the past three months.</p><p>This marked a bright spot in an industry wrestling with the fallout from still high interest rates and buyers on edge over inflation, tariffs and the wider economy. </p></div><div><p>But analysts say the boom was caused by a dash to buy before the end of a government subsidy that helped knock as much as $7,500 (£5,588) off the price<b> </b>of certain battery electric, plug-in hybrid or fuel cell vehicles. </p><p>With that tax credit gone as of the end of September, carmakers are expecting momentum to shift into reverse. </p><p>\"It's going to be a vibrant industry, but it's going to be smaller, way smaller than we thought,\" Ford chief executive Jim Farley said at an event on Tuesday.</p><p>\"I expect that EV demand is going to drop off pretty precipitously,\" the chief financial officer of General Motors, Paul Jacobson, said at a conference last month, adding it would take time to see how quickly buyers would come back.</p></div><div><p>Even with the recent gains, the US, the world's second biggest car market, stood out as a laggard in electric car sales compared to much of the rest of the world. </p><p>In the UK, for example, sales of battery electric and hybrid cars made up nearly 30% of new sales last year, according to the International Energy Agency (IEA). <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/cwyd094168go\">Latest industry figures suggest that number is even higher.</a></p><p>In Europe, they accounted for roughly one in five sales, while in China, the world's biggest car market, sales of such cars accounted for almost half of overall sales last year, according to the IEA, and they are expected to become the majority this year.</p><p>Take-up in some other countries, like Norway and Nepal, is even greater. </p><p>Electric vehicles (EVs) tend to account for a smaller share of sales in Latin America, Africa and other parts of Asia - but growth there has been surging. </p></div><p></p><h2>Policy differences</h2><p></p><div><p>Analysts say adoption in the US has been slowed by comparatively weak government support for the sector, which has limited the kinds of subsidies, trade-in programmes and rules that have helped the industry in places such as China, the UK and Europe.  </p><p>Former President Joe Biden pushed hard to increase take-up, aiming<b> </b>for electric cars to account for half of all sales in the US by 2030.</p><p>His administration tightened rules on emissions, boosted demand through purchases for government fleets, nudged carmakers to invest with loans and grants for EV investments, spent billions building charging stations and expanded the $7,500 tax credit as a sweetener for buyers.</p><p>Supporters cast those efforts in part as a competitive imperative, warning that without these US carmakers would risk losing out to competitors from China and other countries.</p><p>But President Donald Trump, who recently called climate change a \"con job\", has pushed to scrap many of those measures, including the $7,500 credit, arguing that they were pushing people to buy cars they would not otherwise want. </p><p>\"We're saying ... you're not going to be forced to make all of those cars,\" he said this summer, while signing <a target=\"_blank\" href=\"https://www.bbc.com/news/articles/cvgq4wxd583o\">a bill aimed at striking down</a> rules from California, which would have <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/business-62683260\">phased out sales of petrol-only cars</a> in the state by 2035. \"You can make them, but it'll be by the market, judged by the market.\"</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/1692/live/2ca15240-9fcc-11f0-9898-81c16e16c706.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/1692/live/2ca15240-9fcc-11f0-9898-81c16e16c706.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/1692/live/2ca15240-9fcc-11f0-9898-81c16e16c706.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/1692/live/2ca15240-9fcc-11f0-9898-81c16e16c706.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/1692/live/2ca15240-9fcc-11f0-9898-81c16e16c706.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/1692/live/2ca15240-9fcc-11f0-9898-81c16e16c706.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/1692/live/2ca15240-9fcc-11f0-9898-81c16e16c706.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/1692/live/2ca15240-9fcc-11f0-9898-81c16e16c706.jpg.webp\" alt=\"Bloomberg via Getty Images A row of BYD Dolphin compact hatchback electric vehicles illuminated by fluorescent lights at a manufacturing plant\" /><span>Bloomberg via Getty Images</span></p></div></figure><div><p>Electric cars have become more affordable in the US in recent years - but they still cost more than comparable petrol-powered vehicles. </p><p>And Chinese carmakers like BYD, which have made rapid inroads in other markets thanks to low prices, have been effectively shut out of the US, due to high tariffs targeting cars made in China, backed by both Biden and Trump. </p><p>As of August, the average transaction price of an electric car in the US was more than $57,000, according to auto industry research firm Kelley Blue Book, about 16% higher than the average for all cars.</p><p>The least expensive battery car on offer, a Nissan Leaf, costs about $30,000 (£22,000). By comparison, several models can be found for under £20,000 in the UK.    </p></div><div><p>Analysts say what buyers do next hinges on how carmakers set prices in the months ahead, as they contend not only with the end of the tax credit but also tariffs on foreign cars and certain car parts that Trump introduced this spring. </p><p>Hyundai said this week it would offset the loss of the tax credit by lowering the price for its range of Ioniq EVs. But Tesla said the cost for monthly lease payments of some of its cars would rise. </p><p>Stephanie Brinley, associate director of S&P Global Mobility, said she did not expect to see many firms follow Hyundai's example, given the pressures from tariffs. </p><p>While some buyers may opt for EVs anyway, \"next year is going to be hard,\" she warned, noting that her firm is calling for overall car sales to fall by roughly 2% in 2026.  </p><p>\"It would have been difficult enough if all you had to deal with is new tariffs, but with new tariffs and the incentive going away, there's two impacts.\"</p></div><div><p>Carmakers had already been scaling back their investments in electric cars.</p><p>Researchers say Trump's policy changes could reduce those investments even more.</p><p>\"It's a big hit to the EV industry - there's no tiptoeing around it,\" said Katherine Yusko, research analyst at the American Security Project</p><p>\"The subsidies were initially a way to level the playing field and now that they're gone the US has a lot of ground to make up.\"</p><p>However Ms Brinley said she was hesitant to declare the US behind in an industry still testing out technology alternatives. </p><p>\"Is [electric] really the right thing?\" she said. \"Saying that we're behind assumes that this is the only and best solution and I think it's a little early to say that.\"</p></div></article>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How the US got left behind in the global electric car race",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1211/live/e939d750-9fbe-11f0-b73e-e715acbd6a10.jpg"
      ],
      "datePublished": "2025-10-05T07:45:21.000Z",
      "dateModified": "2025-10-05T07:45:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Irreecha: Selfies and singing as Ethiopia's Oromo people celebrate thanksgiving",
    "url": "https://www.bbc.com/news/articles/cd6399enj39o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/91d9/live/ccb2b2f0-a1f8-11f0-b741-177e3e2c2fc7.jpg",
    "tag": "World",
    "date": "2025-10-06T07:06:56.000Z",
    "description": "<article><div><div><p>13 minutes ago</p></div><p><span><p><span>Amensisa Ifa</span><span>BBC Africa, Addis Ababa & Bishoftu </span></p></span></p></di",
    "body": "<article><div><div><p>13 minutes ago</p></div><p><span><p><span>Amensisa Ifa</span><span>BBC Africa, Addis Ababa & Bishoftu </span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/91d9/live/ccb2b2f0-a1f8-11f0-b741-177e3e2c2fc7.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/91d9/live/ccb2b2f0-a1f8-11f0-b741-177e3e2c2fc7.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/91d9/live/ccb2b2f0-a1f8-11f0-b741-177e3e2c2fc7.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/91d9/live/ccb2b2f0-a1f8-11f0-b741-177e3e2c2fc7.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/91d9/live/ccb2b2f0-a1f8-11f0-b741-177e3e2c2fc7.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/91d9/live/ccb2b2f0-a1f8-11f0-b741-177e3e2c2fc7.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/91d9/live/ccb2b2f0-a1f8-11f0-b741-177e3e2c2fc7.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/91d9/live/ccb2b2f0-a1f8-11f0-b741-177e3e2c2fc7.jpg.webp\" alt=\"Amensisa Negera/BBC Four girls wearing white robes pose for photos.\" /><span>Amensisa Negera/BBC</span></p></div></figure><div><p>Tens of thousands of vibrantly dressed Ethiopians descended on downtown Addis Ababa for an annual thanksgiving festival this weekend.</p><p>Irreecha is celebrated by the Oromo, Ethiopia's largest ethnic group, and takes place at the end of the country's main rainy season.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/a095/live/a49e5af0-a1fb-11f0-b741-177e3e2c2fc7.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/a095/live/a49e5af0-a1fb-11f0-b741-177e3e2c2fc7.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/a095/live/a49e5af0-a1fb-11f0-b741-177e3e2c2fc7.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/a095/live/a49e5af0-a1fb-11f0-b741-177e3e2c2fc7.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/a095/live/a49e5af0-a1fb-11f0-b741-177e3e2c2fc7.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/a095/live/a49e5af0-a1fb-11f0-b741-177e3e2c2fc7.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/a095/live/a49e5af0-a1fb-11f0-b741-177e3e2c2fc7.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/a095/live/a49e5af0-a1fb-11f0-b741-177e3e2c2fc7.jpg.webp\" alt=\"Amensisa Ifa / BBC Two men wear fur on their heads and across their shoulders. One holds a shield.\" /><span>Amensisa Ifa / BBC</span></p></div></figure><div><p>Each year, festival-goers gather around sacred rivers and lakes to thank their creators for the greenery that the rains have brought. </p><p>\"I've been celebrating Irreecha for the past nine years,\" 25-year-old Moata Abdulmajid (pictured below) told the BBC.</p><p>\"To me, Irreecha represents my identity, it reflects the pride and greatness of my people.\"</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/5547/live/96a07da0-a202-11f0-92db-77261a15b9d2.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/5547/live/96a07da0-a202-11f0-92db-77261a15b9d2.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/5547/live/96a07da0-a202-11f0-92db-77261a15b9d2.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/5547/live/96a07da0-a202-11f0-92db-77261a15b9d2.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/5547/live/96a07da0-a202-11f0-92db-77261a15b9d2.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/5547/live/96a07da0-a202-11f0-92db-77261a15b9d2.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/5547/live/96a07da0-a202-11f0-92db-77261a15b9d2.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/5547/live/96a07da0-a202-11f0-92db-77261a15b9d2.jpg.webp\" alt=\"Amensisa Ifa / BBC A man with an open robe and white headband carries a wooden stick.\" /><span>Amensisa Ifa / BBC</span></p></div></figure><div><p>Men, women, the elderly and the young all join in, adorned in eye-catching clothes and jewellery.</p><p>They sing, dance, share stories and place freshly cut grass and flowers in water - a symbol of life, renewal and hope.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/6c76/live/05ca10f0-a1fa-11f0-b741-177e3e2c2fc7.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/6c76/live/05ca10f0-a1fa-11f0-b741-177e3e2c2fc7.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/6c76/live/05ca10f0-a1fa-11f0-b741-177e3e2c2fc7.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/6c76/live/05ca10f0-a1fa-11f0-b741-177e3e2c2fc7.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/6c76/live/05ca10f0-a1fa-11f0-b741-177e3e2c2fc7.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/6c76/live/05ca10f0-a1fa-11f0-b741-177e3e2c2fc7.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/6c76/live/05ca10f0-a1fa-11f0-b741-177e3e2c2fc7.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/6c76/live/05ca10f0-a1fa-11f0-b741-177e3e2c2fc7.jpg.webp\" alt=\"Amensisa Ifa / BBC A girl wearing a white dress and white shells in her hair smiles. Shhe carries a bunch of yellow flowers.\" /><span>Amensisa Ifa / BBC</span></p></div></figure><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/7327/live/2903f0c0-a1fc-11f0-92db-77261a15b9d2.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/7327/live/2903f0c0-a1fc-11f0-92db-77261a15b9d2.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/7327/live/2903f0c0-a1fc-11f0-92db-77261a15b9d2.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/7327/live/2903f0c0-a1fc-11f0-92db-77261a15b9d2.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/7327/live/2903f0c0-a1fc-11f0-92db-77261a15b9d2.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/7327/live/2903f0c0-a1fc-11f0-92db-77261a15b9d2.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/7327/live/2903f0c0-a1fc-11f0-92db-77261a15b9d2.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/7327/live/2903f0c0-a1fc-11f0-92db-77261a15b9d2.jpg.webp\" alt=\"Amensisa Ifa / BBC Four women wearing striped dresses hold yellow flowers.\" /><span>Amensisa Ifa / BBC</span></p></div></figure><div><p>Irreecha does not only attract people from across Ethiopia, attendees fly in from around the world.</p><p>\"I came last year - it was so good, so beautiful, I brought my children with me this year,\" says Claire (pictured second from right), from Belfast in Northern Ireland.</p><p>\"It is amazing. Everybody wants to say hello, everyone wants to give you a kiss and say welcome.\" </p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/d17b/live/5c961bd0-a1fb-11f0-928c-71dbb8619e94.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/d17b/live/5c961bd0-a1fb-11f0-928c-71dbb8619e94.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/d17b/live/5c961bd0-a1fb-11f0-928c-71dbb8619e94.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/d17b/live/5c961bd0-a1fb-11f0-928c-71dbb8619e94.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/d17b/live/5c961bd0-a1fb-11f0-928c-71dbb8619e94.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/d17b/live/5c961bd0-a1fb-11f0-928c-71dbb8619e94.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/d17b/live/5c961bd0-a1fb-11f0-928c-71dbb8619e94.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/d17b/live/5c961bd0-a1fb-11f0-928c-71dbb8619e94.jpg.webp\" alt=\"Amensisa Ifa / BBC Festival attendees, adorned in jewelry, hold plants in their hands.\" /><span>Amensisa Ifa / BBC</span></p></div></figure><div><p>The first day of the festival took place on Saturday in Addis Ababa. On Sunday, festival-goers travelled to Bishoftu, a small town just outside the capital.</p><p>Although the Irreecha has its roots in indigenous faith systems, it is now observed by the majority of Oromos, regardless of their religion.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/4601/live/ca21d970-a1f9-11f0-947b-6b8b23372a50.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/4601/live/ca21d970-a1f9-11f0-947b-6b8b23372a50.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/4601/live/ca21d970-a1f9-11f0-947b-6b8b23372a50.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/4601/live/ca21d970-a1f9-11f0-947b-6b8b23372a50.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/4601/live/ca21d970-a1f9-11f0-947b-6b8b23372a50.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/4601/live/ca21d970-a1f9-11f0-947b-6b8b23372a50.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/4601/live/ca21d970-a1f9-11f0-947b-6b8b23372a50.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/4601/live/ca21d970-a1f9-11f0-947b-6b8b23372a50.jpg.webp\" alt=\"Amensisa Ifa / BBC A huge crowed of people, mostly wearing white, is pictured from above\" /><span>Amensisa Ifa / BBC</span></p></div></figure><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/3fbd/live/bfa6f010-a1fa-11f0-928c-71dbb8619e94.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/3fbd/live/bfa6f010-a1fa-11f0-928c-71dbb8619e94.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/3fbd/live/bfa6f010-a1fa-11f0-928c-71dbb8619e94.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/3fbd/live/bfa6f010-a1fa-11f0-928c-71dbb8619e94.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/3fbd/live/bfa6f010-a1fa-11f0-928c-71dbb8619e94.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/3fbd/live/bfa6f010-a1fa-11f0-928c-71dbb8619e94.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/3fbd/live/bfa6f010-a1fa-11f0-928c-71dbb8619e94.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/3fbd/live/bfa6f010-a1fa-11f0-928c-71dbb8619e94.jpg.webp\" alt=\"Amensisa Ifa / BBC A young girl, sitting on someone's shoulders, peers above the crowd. She wears a striped outfit and beaded headpiece.\" /><span>Amensisa Ifa / BBC</span></p></div></figure><p>In the past decade, the number of people attending the festival has increased dramatically. This is partly due to the rise of social media, where many young people document their outfits, dancing and singing during the festival.</p><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/4201/live/fff8b270-a1fa-11f0-b741-177e3e2c2fc7.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/4201/live/fff8b270-a1fa-11f0-b741-177e3e2c2fc7.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/4201/live/fff8b270-a1fa-11f0-b741-177e3e2c2fc7.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/4201/live/fff8b270-a1fa-11f0-b741-177e3e2c2fc7.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/4201/live/fff8b270-a1fa-11f0-b741-177e3e2c2fc7.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/4201/live/fff8b270-a1fa-11f0-b741-177e3e2c2fc7.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/4201/live/fff8b270-a1fa-11f0-b741-177e3e2c2fc7.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/4201/live/fff8b270-a1fa-11f0-b741-177e3e2c2fc7.jpg.webp\" alt=\"Amensisa Ifa / BBC Three girls, wearing white robes and wooden staffs, smile for the camera.\" /><span>Amensisa Ifa / BBC</span></p></div></figure><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/c14f/live/2de7e200-a1fb-11f0-b741-177e3e2c2fc7.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/c14f/live/2de7e200-a1fb-11f0-b741-177e3e2c2fc7.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/c14f/live/2de7e200-a1fb-11f0-b741-177e3e2c2fc7.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/c14f/live/2de7e200-a1fb-11f0-b741-177e3e2c2fc7.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/c14f/live/2de7e200-a1fb-11f0-b741-177e3e2c2fc7.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/c14f/live/2de7e200-a1fb-11f0-b741-177e3e2c2fc7.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/c14f/live/2de7e200-a1fb-11f0-b741-177e3e2c2fc7.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/c14f/live/2de7e200-a1fb-11f0-b741-177e3e2c2fc7.jpg.webp\" alt=\"Amensisa Ifa / BBC Seven men pose for the camera, wearing scarves around their head and white tops. They carry wooden staffs.\" /><span>Amensisa Ifa / BBC</span></p></div></figure><div><p>In the past, Irreecha was used as a platform for anti-government protests - the Oromo people have long complained about political and economic marginalisation.</p><p>However, this year's celebration unfolded peacefully, with an emphasis on joy, unity and cultural pride.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/36d1/live/db162450-a1fb-11f0-92db-77261a15b9d2.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/36d1/live/db162450-a1fb-11f0-92db-77261a15b9d2.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/36d1/live/db162450-a1fb-11f0-92db-77261a15b9d2.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/36d1/live/db162450-a1fb-11f0-92db-77261a15b9d2.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/36d1/live/db162450-a1fb-11f0-92db-77261a15b9d2.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/36d1/live/db162450-a1fb-11f0-92db-77261a15b9d2.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/36d1/live/db162450-a1fb-11f0-92db-77261a15b9d2.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/36d1/live/db162450-a1fb-11f0-92db-77261a15b9d2.jpg.webp\" alt=\"Amensisa Ifa / BBC A boy smiles in the direction of the camera, while the rest of the crowd (out of focus) look in a different direction.\" /><span>Amensisa Ifa / BBC</span></p></div></figure><p></p><h2>You may also be interested in:</h2><p></p><div><ul><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/news/world-africa-68031032\">Ethiopians leap into pool during holy festival</a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/c4g2z8nv344o\">Party like it's 2018 - Ethiopians celebrate their new year</a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/c15wz4l5pddo\">Joyful Ethiopians and Eritreans embrace at rare border reopening</a></li></ul></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp\" alt=\"Getty Images/BBC A woman looking at her mobile phone and the graphic BBC News Africa\" /><span>Getty Images/BBC</span></p></div></figure><div><p><span>BBC Africa podcasts</span></p></div></article>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Irreecha: Selfies and singing as Ethiopia's Oromo people celebrate thanksgiving",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/91d9/live/ccb2b2f0-a1f8-11f0-b741-177e3e2c2fc7.jpg"
      ],
      "datePublished": "2025-10-06T07:06:56.000Z",
      "dateModified": "2025-10-06T07:06:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who is Japan's 'Iron Lady' Sanae Takaichi?",
    "url": "https://www.bbc.com/news/articles/crkj5e73xkmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ee2/live/3948ea70-a19e-11f0-92db-77261a15b9d2.jpg",
    "tag": "World",
    "date": "2025-10-04T22:09:29.000Z",
    "description": "<article><div><div><p>1 day ago</p></div><p><span><p><span>Tinshui Yeung</span><span>BBC News</span></p></span></p></div><figure><div><p><img src=\"htt",
    "body": "<article><div><div><p>1 day ago</p></div><p><span><p><span>Tinshui Yeung</span><span>BBC News</span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/db18/live/84f276c0-a19f-11f0-8c5b-4b0466d40f1f.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/db18/live/84f276c0-a19f-11f0-8c5b-4b0466d40f1f.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/db18/live/84f276c0-a19f-11f0-8c5b-4b0466d40f1f.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/db18/live/84f276c0-a19f-11f0-8c5b-4b0466d40f1f.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/db18/live/84f276c0-a19f-11f0-8c5b-4b0466d40f1f.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/db18/live/84f276c0-a19f-11f0-8c5b-4b0466d40f1f.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/db18/live/84f276c0-a19f-11f0-8c5b-4b0466d40f1f.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/db18/live/84f276c0-a19f-11f0-8c5b-4b0466d40f1f.jpg.webp\" alt=\"Getty Images Newly-elected Liberal Democratic Party (LDP) leader Sanae Takaichi receives an applause after winning the LDP leadership election on October 4, 2025 in Tokyo, Japan\" /><span>Getty Images</span></p></div></figure><div><p>Respected figure: Baroness Margaret Thatcher. Personal goal: To become Japan's Iron Lady.</p><p>It was only after two failed attempts that, on Saturday, Sanae Takaichi finally achieved her long-held ambition. </p><p>The 64-year-old was elected leader of Japan's ruling Liberal Democratic Party (LDP) on its 70th anniversary - putting her on course to become the country's first female prime minister.</p><p>A former government minister and TV host, and once a drummer in a heavy metal band, she will now face the challenge of leading not only a party struggling to regain voter trust after scandals and battling with the far right - but a country facing low birth rates and rising geopolitical tensions.</p></div><div><p>Born in Nara Prefecture in 1961, Takaishi's father was an office worker and her mother a police officer. Politics was far removed from her upbringing.</p><p>Once an avid heavy metal drummer, she was famous for carrying many sticks because she would break them during intense drumming. She was also a scuba diver and a car enthusiast - her beloved Toyota Supra is now displayed in a Nara museum.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/e5ac/live/864d4c40-a125-11f0-909f-795e864c8891.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/e5ac/live/864d4c40-a125-11f0-909f-795e864c8891.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/e5ac/live/864d4c40-a125-11f0-909f-795e864c8891.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/e5ac/live/864d4c40-a125-11f0-909f-795e864c8891.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/e5ac/live/864d4c40-a125-11f0-909f-795e864c8891.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/e5ac/live/864d4c40-a125-11f0-909f-795e864c8891.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/e5ac/live/864d4c40-a125-11f0-909f-795e864c8891.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/e5ac/live/864d4c40-a125-11f0-909f-795e864c8891.jpg.webp\" alt=\"Getty Images Sanae Takaichi poses for a photo in the party leader's office after the LDP presidential election.\" /><span>Getty Images</span></p></div></figure><div><p>Before entering politics, Takaichi worked briefly as a television host.</p><p>Her political inspiration came in the 1980s, during the height of US-Japan trade friction. Determined to understand American perceptions of Japan, she worked in the office of Democrat Patricia Schroeder, a congresswoman known for her criticism of Japan.</p><p>Takaichi saw Americans mixing up Japanese, Chinese and Korean language and cuisine, observing how Japan was often grouped together with China and South Korea.</p><p>\"Unless Japan can defend itself, its fate will always be at the mercy of shallow US opinion,\" she concluded.</p></div><div><p>She ran in her first parliamentary election in 1992 as an independent but lost. </p><p>She persisted, winning a seat a year later and joining the LDP in 1996. Since then, she has been elected as an MP 10 times, losing only once, and built a reputation as one of the party's most outspoken conservative voices.</p><p>She has also held senior government roles, including minister for economic security, state minister for trade and industry, and a record-breaking tenure as minister for internal affairs and communications.</p><p>In 2021, Takaichi first entered the LDP leadership race but lost to Fumio Kishida. She tried again in 2024, this time topping the first round of voting but ultimately losing to Shigeru Ishiba.</p><p>This year, on her third attempt, she secured victory - setting her on course to become Japan's first female prime minister once parliament confirms her appointment.</p><p>\"My goal is to become the Iron Lady,\" she told a group of school children during her recent campaign.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/2207/live/6df1ee10-a12c-11f0-bf43-398ff6349d9d.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/2207/live/6df1ee10-a12c-11f0-bf43-398ff6349d9d.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/2207/live/6df1ee10-a12c-11f0-bf43-398ff6349d9d.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/2207/live/6df1ee10-a12c-11f0-bf43-398ff6349d9d.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/2207/live/6df1ee10-a12c-11f0-bf43-398ff6349d9d.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/2207/live/6df1ee10-a12c-11f0-bf43-398ff6349d9d.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/2207/live/6df1ee10-a12c-11f0-bf43-398ff6349d9d.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/2207/live/6df1ee10-a12c-11f0-bf43-398ff6349d9d.jpg.webp\" alt=\"Bloomberg via Getty Images Shinzo Abe poses for a group photograph with members of his new cabinet at the prime minister's official residence in Tokyo\" /><span>Bloomberg via Getty Images</span></p></div><p></p><figcaption>Sanae Takaichi (first row right) was named the internal affairs and communications minister in 2014 by the late Japanese prime minister Shinzo Abe</figcaption><p></p></figure><div><p>Takaichi is a staunch conservative who has long opposed legislation allowing married women to keep their maiden names, insisting it undermines tradition. She is also against same sex marriage.  </p><p>However, she has recently softened her tone. During her campaign she vowed to make babysitter fees partially tax-deductible and proposed corporate tax breaks for companies that provide in-house childcare services.</p><p>Her family and personal experiences underpin her policy proposals: expanding hospital services for women's health, giving household support workers greater recognition, and improving care options for Japan's ageing society.</p><p>\"I have personally experienced nursing and caregiving three times in my life,\" she said. </p><p>\"That's why my determination has only grown stronger to reduce the number of people forced to leave their jobs due to caregiving, child-rearing or children refusing to attend school. </p><p>\"I want to create a society where people don't have to give up their careers.\"</p><p>A protégé of the late Shinzo Abe, she pledged to revive his \"Abenomics\" economic vision of high public spending and cheap borrowing.</p><p>She has been a regular visitor to the controversial Yasukuni Shrine, which honours Japan's war dead including convicted war criminals. </p><p>She has also called for easing constitutional restrictions on the country's Self-Defence Forces, which are forbidden from having offensive capabilities.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/df47/live/b3ac13f0-a12b-11f0-a9f1-8d9167fcc08f.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/df47/live/b3ac13f0-a12b-11f0-a9f1-8d9167fcc08f.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/df47/live/b3ac13f0-a12b-11f0-a9f1-8d9167fcc08f.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/df47/live/b3ac13f0-a12b-11f0-a9f1-8d9167fcc08f.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/df47/live/b3ac13f0-a12b-11f0-a9f1-8d9167fcc08f.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/df47/live/b3ac13f0-a12b-11f0-a9f1-8d9167fcc08f.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/df47/live/b3ac13f0-a12b-11f0-a9f1-8d9167fcc08f.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/df47/live/b3ac13f0-a12b-11f0-a9f1-8d9167fcc08f.jpg.webp\" alt=\"Getty Images A group of politicians visiting Yasukuni Shrine\" /><span>Getty Images</span></p></div><p></p><figcaption>Sanae Takaichi (3rd L) and other Japanese MPs visit Yasukuni Shrine on 15 August 2014</figcaption><p></p></figure><div><p>Since its foundation in 1955, LDP has dominated Japanese politics, but it is now losing ground amid frustration with a sluggish economy, demographic decline and social discontent.</p><p>Takaichi belongs to the right-wing side of the LDP, and in electing her the LDP is hoping to win back conservative voters who have gravitated towards the far-right Sanseito party.</p><p>Sanseito, running on a \"Japanese First\" slogan, has recently surged from one to 15 seats, drawing away conservative voters. The LDP has lost its majority in both houses of parliament.</p><p>Takaichi herself acknowledged the problem in a speech after winning the first round of voting: \"We have received particularly harsh criticism from our core supporters, conservatives, and party members.\"</p><p>\"The LDP must change for the sake of Japan's present and future. We will always put the national interest first and manage the country with a sense of balance.\"</p><p>The parliament is expected to confirm her as prime minister on 15 October.</p></div></article>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who is Japan's 'Iron Lady' Sanae Takaichi?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6ee2/live/3948ea70-a19e-11f0-92db-77261a15b9d2.jpg"
      ],
      "datePublished": "2025-10-04T22:09:29.000Z",
      "dateModified": "2025-10-04T22:09:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Watch: Pets around the world blessed for Feast of Saint Francis",
    "url": "https://www.bbc.com/news/videos/cn83n2gl2nlo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/28a6/live/426079a0-a1a5-11f0-928c-71dbb8619e94.jpg",
    "tag": "World",
    "date": "2025-10-05T06:05:34.000Z",
    "description": "<div><p>Dogs, cats, tortoises and even a rooster were blessed on 4 October, in celebrations to mark the Feast of Saint Francis of Assisi. </p><p>Churc",
    "body": "<div><p>Dogs, cats, tortoises and even a rooster were blessed on 4 October, in celebrations to mark the Feast of Saint Francis of Assisi. </p><p>Churches around the world hold special services every year to honour of the patron saint of animals, and many parishioners bring their pets and livestock along.</p></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Watch: Pets around the world blessed for Feast of Saint Francis",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/28a6/live/426079a0-a1a5-11f0-928c-71dbb8619e94.jpg"
      ],
      "datePublished": "2025-10-05T06:05:34.000Z",
      "dateModified": "2025-10-05T06:05:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gisèle Pelicot faces one of her rapists in court again",
    "url": "https://www.bbc.com/news/articles/cdx2d9lynk1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ea4a/live/a58cb880-a27d-11f0-b741-177e3e2c2fc7.jpg",
    "tag": "World",
    "date": "2025-10-05T23:07:07.000Z",
    "description": "<article><p></p><h2>As Gisèle Pelicot faces one of her rapists in court, what has changed in France?</h2><p></p><div><div><p>8 hours ago</p></div><p><",
    "body": "<article><p></p><h2>As Gisèle Pelicot faces one of her rapists in court, what has changed in France?</h2><p></p><div><div><p>8 hours ago</p></div><p><span><p><span>Andrew Harding</span><span>Paris correspondent, Mazan</span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/6ea5/live/9bfbfd80-a27d-11f0-8750-8f7dd5d5d150.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/6ea5/live/9bfbfd80-a27d-11f0-8750-8f7dd5d5d150.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/6ea5/live/9bfbfd80-a27d-11f0-8750-8f7dd5d5d150.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/6ea5/live/9bfbfd80-a27d-11f0-8750-8f7dd5d5d150.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/6ea5/live/9bfbfd80-a27d-11f0-8750-8f7dd5d5d150.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/6ea5/live/9bfbfd80-a27d-11f0-8750-8f7dd5d5d150.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/6ea5/live/9bfbfd80-a27d-11f0-8750-8f7dd5d5d150.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/6ea5/live/9bfbfd80-a27d-11f0-8750-8f7dd5d5d150.jpg.webp\" alt=\"BBC Gisèle Pelicot is surrounding by members of the press carrying cameras. She is walking with her head held high with a faint smile. She has a red bob and is wearing a black coat. She is flanked by her legal team. \" /><span>BBC</span></p></div><p></p><figcaption>For over a decade, Gisèle Pelicot's husband drugged her and invited other men to come to their home and rape her while she was unconscious</figcaption><p></p></figure><div><p>France's mass rape victim, Gisèle Pelicot, is returning to court on Monday to face one of her attackers, the only man who is appealing against last year's trial verdict in which a total of 51 accused were convicted of raping her as she lay, drugged by her husband, in their family home.</p><p>At the time, Madame Pelicot's defiant public stance was seen as a potentially catalytic moment in the fight against sexual violence. But in France, that optimism appears to be wilting.</p><p>\"I'll smash your head in if you don't leave now,\" snarled a man standing outside a medieval church in Mazan, the picturesque town where Gisele and Dominique Pelicot once lived.</p><p>He'd just overheard me asking an elderly woman about the impact of the Pelicot case on France and, while threatening to destroy our camera too, was now explaining that the town was tired of being linked to one of the world's most notorious rape trials.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/568d/live/6cced110-a04b-11f0-b687-23a5afa8b42e.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/568d/live/6cced110-a04b-11f0-b687-23a5afa8b42e.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/568d/live/6cced110-a04b-11f0-b687-23a5afa8b42e.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/568d/live/6cced110-a04b-11f0-b687-23a5afa8b42e.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/568d/live/6cced110-a04b-11f0-b687-23a5afa8b42e.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/568d/live/6cced110-a04b-11f0-b687-23a5afa8b42e.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/568d/live/6cced110-a04b-11f0-b687-23a5afa8b42e.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/568d/live/6cced110-a04b-11f0-b687-23a5afa8b42e.jpg.webp\" alt=\"Aurore Baralier looks up at man largely out of shot. She is an older lady with a curly bob. She is wearing a brown short, silver hoop earrings, glasses and a gold crucifix necklace. \" /></p></div><p></p><figcaption>Aurore Baralier believes that the case has helped women speak \"freely\"</figcaption><p></p></figure><div><p>A few days earlier, the mayor of Mazan had issued a gentler version of the same argument, in a public statement that described Gisèle Pelicot's years-long ordeal as \"a private matter… that has nothing to do with us\".</p><p>One can well understand Mayor Louis Bonnet's desire to protect his town's reputation and its tourism industry. But it seems worth noting that a year earlier, he'd made headlines across France after he'd told me, twice, in an interview, that he wanted to \"play down\" the seriousness of Gisèle Pelicot's ordeals because \"no-one was killed\", and no children were involved.</p><p>It is also worth noting that almost all the women we did speak to in Mazan last week did not share the mayor's desire to see the Pelicot case as, primarily, something to \"move beyond\".</p><p>Smoking a cigarette in a shaded doorway not far from the church, a 33-year-old civil servant, who gave her name as Aurélie, spoke with undisguised bitterness.</p><p>\"No-one talks about it anymore, even here in Mazan. It's as if it never happened. I know someone experiencing domestic violence right now. But women hide it. They're afraid of the men who do these things,\" she said, adding that she was \"certain\" that more of Gisèle Pelicot's rapists remained undetected, and at large, in the neighbourhood.</p><p>Walking nearby past a couple of sunbathing cats, Aurore Baralier, 68, was equally keen to talk, but took a different view of the Pelicot case.</p><p>\"The world is evolving. France is evolving.\" With Madame Pelicot's help? \"Yes. It's been a boost, for women to speak freely,\" she told me, emphatically.</p><p>Across France, there is no doubt that the publicity generated by Gisèle Pelicot's globally broadcast determination that \"shame should change sides\" - from victim to rapist – has provided added momentum to a campaign against sexual violence already energised by the MeToo movement.</p><p>\"I would say changing behaviour is something that takes generations. [But] the Pelicot case sparked a huge, historic mobilisation… against sexual violence, and against impunity,\" said Alyssa Ahrabare, who co-ordinates a network of 50 feminist organisations in France. \"We're focused on training professionals, supporting victims, on investigations.\"</p><p>\"Yes, France has changed. The [number of] complaints of rapes has tripled, showing that victims – women and girls – they speak up and they want justice,\" agreed Céline Piques, spokesperson for the NGO \"Dare to be feminist\".</p><p>And yet, the energy and optimism that engulfed Gisèle Pelicot last December, as she emerged from the Avignon courthouse and into a scrum of supporters, have not led to many substantive changes to the way the French state tackles the issue of sexual violence.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/ee6d/live/1fc44340-a04c-11f0-b687-23a5afa8b42e.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/ee6d/live/1fc44340-a04c-11f0-b687-23a5afa8b42e.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/ee6d/live/1fc44340-a04c-11f0-b687-23a5afa8b42e.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/ee6d/live/1fc44340-a04c-11f0-b687-23a5afa8b42e.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/ee6d/live/1fc44340-a04c-11f0-b687-23a5afa8b42e.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/ee6d/live/1fc44340-a04c-11f0-b687-23a5afa8b42e.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/ee6d/live/1fc44340-a04c-11f0-b687-23a5afa8b42e.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/ee6d/live/1fc44340-a04c-11f0-b687-23a5afa8b42e.jpg.webp\" alt=\"A small traditional French church with a stone bell tower. There is a tree to its left and the sky is blue and clear.\" /></p></div><p></p><figcaption>The mayor of Mazan, the small town where the rapes took place, has released a statement saying the attacks have \"nothing to do with us\"</figcaption><p></p></figure><div><p>Indeed, there is a near consensus among campaigners and experts that things are, instead, deteriorating.</p><p>\"Unfortunately, the government does not react,\" said Céline Piques, pointing to statistics showing that conviction rates are flat-lining despite a sharp rise in reported rape cases.</p><p>\"The picture is bleak. There is a backlash. Rape culture ideas are coming back very strongly. We can see this with the masculinist movement rising in popularity, especially with young boys and teenagers,\" added Alyssa Ahrabare, also citing the rise of deep-fake pornography.</p><p>In the midst of a financial and political crisis in France, with public debt soaring, and the country having five prime ministers in the past two years, the government has strongly defended its record, saying it has made \"decisive\" changes, including trebling spending in this field in the past five years - an \"unprecedented\" increase.</p><p>However, a scathing Senate report this summer concluded that the government was \"lacking a strategic compass\", when it came to tackling rape and other forms sexual violence. The Council of Europe has also been highly critical, recently, of France's efforts to protect women.</p><p>A well-placed source told us that even data about the number of rapes reported in France were unreliable due to an overly complex bureaucracy.</p><p>Occasionally, a news story will offer another small jolt of optimism.</p><p>In Dijon, a 60-year-old accused of drugging his wife for others to rape her, was arrested in August after one man, invited to participate, later called the police, having doubted \"her consent\".</p><p>The alleged victim's lawyer Marie-Christine Klepping told us she was \"sure\" that knowledge of the Pelicot case, and fear of being caught up in something similar, had prompted that phone call.</p><p>In May, the French film star Gérard Depardieu was found guilty of sexually assaulting two women in what many lawyers and activists hailed as a significant blow against a widely perceived culture of impunity enabling powerful men to abuse women.</p><p>\"It could mean something,\" Elodie Tuaillon-Hibon told the BBC, \"because he has been very protected, [even] by President Macron\", who appeared to defend the actor at one point. Ms Tuaillon-Hibon is a Paris-based lawyer who had previously been involved in prosecuting Depardieu.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/e120/live/0f29c640-a04c-11f0-b687-23a5afa8b42e.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/e120/live/0f29c640-a04c-11f0-b687-23a5afa8b42e.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/e120/live/0f29c640-a04c-11f0-b687-23a5afa8b42e.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/e120/live/0f29c640-a04c-11f0-b687-23a5afa8b42e.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/e120/live/0f29c640-a04c-11f0-b687-23a5afa8b42e.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/e120/live/0f29c640-a04c-11f0-b687-23a5afa8b42e.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/e120/live/0f29c640-a04c-11f0-b687-23a5afa8b42e.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/e120/live/0f29c640-a04c-11f0-b687-23a5afa8b42e.jpg.webp\" alt=\"Elodie Tuaillon-Hibon is photographed on a balcony in Paris. She is looking straight into the camera and wearing a white shirt and black jacket with large gold earrings. \" /></p></div><p></p><figcaption>Lawyer Elodie Tuaillon-Hibon is sceptical over how much has changed as result of the Pelicot trial</figcaption><p></p></figure><div><p>\"I don't think the (Pelicot) trial has changed anything at the police and judicial levels,\" said Emmanuelle Rivier, a lawyer also specialising in rape cases. She cited chronic understaffing, along with a lack of police training and specialisation.</p><p>And now Gisèle Pelicot herself is returning to court in the southern city of Nîmes to face one of the men convicted of raping her.</p><p>\"She feels she needs to be there and has a responsibility to be there until the procedure is completely over,\" her lawyer, Stéphane Babonneau, explained to me.</p><p>The true impact of her decision to waive her right to anonymity may not be clear for many years, but the lawyer Elodie Tuaillon-Hibon is not inclined to be optimistic.</p><p>\"It changed some things. But actually very little,\" she concluded, comparing sexual violence in France to a \"war waged against women and children every day\". </p><p>\"We still have a great deal of changes to (make).\"</p><p>I asked her if she was surprised the Pelicot case had not had a deeper impact.</p><p>\"No. Not surprised at all because, well, it's France. Rape culture is something deeply rooted in our society. And until it's taken into consideration seriously as a matter of public policy, it won't change.\"</p><p><i>With additional reporting by Marianne Baisnee</i></p></div></article>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gisèle Pelicot faces one of her rapists in court again",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ea4a/live/a58cb880-a27d-11f0-b741-177e3e2c2fc7.jpg"
      ],
      "datePublished": "2025-10-05T23:07:07.000Z",
      "dateModified": "2025-10-05T23:07:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shock in Gaza as Trump appears to welcome Hamas response to US peace plan",
    "url": "https://www.bbc.com/news/articles/c15k199j1x3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5e94/live/7548e480-a112-11f0-807b-c1a7ae4b635d.jpg",
    "tag": "World",
    "date": "2025-10-04T13:57:38.000Z",
    "description": "<div><div><p>2 days ago</p></div><p><span><p><span>Rushdi Abualouf</span><span>Gaza correspondent, Istanbul</span></p></span></p></div><div><p>People ",
    "body": "<div><div><p>2 days ago</p></div><p><span><p><span>Rushdi Abualouf</span><span>Gaza correspondent, Istanbul</span></p></span></p></div><div><p>People in Gaza have reacted with shock after US President Donald Trump appeared to welcome Hamas's response to his peace plan for the territory. </p><p>Hundreds of Palestinians flooded my social media accounts and messaging apps with questions like: \"Has the war ended?\" and \"Is this a dream or reality?\"</p><p>The pace of developments overnight has left many struggling to grasp what comes next.</p><p>The movement's carefully crafted statement - thought to have been drafted with the help of mediators - stopped short of outright rejection and instead offered a qualified \"yes\". </p><p>Hamas accepted Trump's terms for the release of Israeli hostages and the idea of handing over the governance of Gaza to Palestinian technocrats - but did not give a clear response to <a target=\"_blank\" href=\"https://www.bbc.com/news/articles/cdxq7zp7002o\">many other elements of his 20-point proposal</a>. </p><p>It was, many Palestinians say, a calculated reply that put the ball back in Israel's court.</p><p>Soon after it was published, Trump wrote on social media that he believed Hamas was ready for peace and called on Israel to stop the bombing of Gaza. </p><p>Reactions among Palestinians in the territory ranged from hope to deep suspicion.</p><p>Some fear Hamas has walked into a trap, and that Israel will reclaim its hostages only to resume the war. Others believe a historic opportunity has opened to end two years of conflict. </p><p>\"I advise patience,\" Ibrahim Fares told the BBC.</p><p>\"Don't get carried away by optimism. There will be rounds of talks over the details. The devil is always in the detail,\" he said. \"Look at Lebanon, where even now there are still displaced people and airstrikes.\"</p><p>Mahmoud Daher noted on Facebook that Hamas's response was unusual for its directness.</p><p>\"This time it was yes without the usual 'but' immediately after,\" he wrote.</p><p>\"Yes to prisoner release under Trump's formula, yes to ending the war and withdrawal, yes to handing power to a Palestinian authority. The buts came only later. Hamas even played to Trump's ego with praise.\"</p><p>But not everyone is convinced.</p><p>Gaza-based activist and long-time Hamas critic Khalil Abu Shammala said the decision was about the movement's survival.</p><p>\"They will call this wisdom - or putting the people first. But the truth is, it's about Hamas staying in power. I even doubt Hamas wrote the statement - it was too clever.\"</p><p>For now, Palestinians remain uncertain as they wait to see whether the words on paper can truly be enough to end the war.</p></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shock in Gaza as Trump appears to welcome Hamas response to US peace plan",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5e94/live/7548e480-a112-11f0-807b-c1a7ae4b635d.jpg"
      ],
      "datePublished": "2025-10-04T13:57:38.000Z",
      "dateModified": "2025-10-04T13:57:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shutdown: Congressional leaders remain deadlocked ahead of vote",
    "url": "https://www.bbc.com/news/articles/cdx27523n0lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d0b5/live/b4dd61c0-a20c-11f0-8493-b191e68f6c5a.jpg",
    "tag": "World",
    "date": "2025-10-05T18:14:12.000Z",
    "description": "<div><p>Democratic and Republican leaders remain far apart on how to end the partial shutdown of the US government as another day of voting approaches",
    "body": "<div><p>Democratic and Republican leaders remain far apart on how to end the partial shutdown of the US government as another day of voting approaches on Monday.</p><p>In separate Sunday interviews with NBC's Meet the Press, the House's top Democrat Hakeem Jeffries and its Republican leader Mike Johnson each blamed the other's party for the continued stand-off, which will head to its fifth day on Monday. </p><p>The key dividing issue has been healthcare. Democrats want to ensure health insurance subsidies for those on low-income do not expire, and aim to reverse cuts to the Medicaid health programme.</p><p>A bill to fund the government has passed the House, but has repeatedly failed in the Senate. </p></div><div><p>Jeffries accused Republicans of \"lying\" about Democrats' intentions in the negotiations \"because they're losing the court of public opinion\". </p><p>But Johnson said Democrats were \"not serious\" and negotiating in bad faith - \"they're doing this to get political cover\".</p><p>The Senate is expected to reconvene on Monday afternoon and once again take up a pair of continuing resolutions to fund the government. Meanwhile, House Democrats will meet on Monday to discuss the situation. </p><p>Johnson has extended a House recess through the week, meaning Congress' lower chamber will not be in session to take up a funding bill should the Senate make any changes and come to a deal. </p><p>Republicans hold a narrow majority of 53 seats in the 100-seat Senate, but any funding measure will require 60 votes to pass. </p><p>In his interview with NBC, Johnson argued that Democrats' refusal to approve a short-term spending bill that kept funding at current levels was unnecessary. The healthcare tax credits at issue do not expire until the end of the year, he said, and a Democratic proposal would add too much new spending in a seven-week stopgap measure. </p><p>\"We have plenty of time to figure that out,\" he said.</p><p>He also argued that the tax credits would not help address what he says are major problems with healthcare policy, including \"illegal aliens and able-bodied young men without dependents\" using Medicaid.</p><p>Some Republicans, including Vice-President JD Vance, have cast the Democrats' position as \"trying to give healthcare benefits to illegal aliens\". Democrats have denied those claims and illegal or undocumented immigrants are <a target=\"_blank\" href=\"https://www.bbc.com/news/articles/c3vzyl5x15ro\">not eligible for the schemes</a> the Democrats are supporting, according to BBC Verify.</p><p>Jeffries told NBC's Kristen Welker that Democrats feel the consequences of the expiring credits are dire. </p><p>\"We are standing up for the healthcare of hard-working American taxpayers,\" he said. \"If Republicans continue to refuse to extend the Affordable Care Act tax credit, tens of millions of American taxpayers are going to experience dramatically increased premiums, copays, and deductibles.\"</p><p>Jeffries criticised US President Donald Trump's handling of the shutdown and his social media posts aimed at Democrats, saying \"that behaviour is outrageous\". </p><p>\"We need serious leadership,\" he said. </p><p>Jeffries added that Republican leaders had stopped communicating with Democrats and accused them of negotiating in bad faith. </p><p>\"As Democrats, our view is that we will find bipartisan common ground with our Republican colleagues to reopen the government, to actually pass a spending bill that meets the needs of the American people,\" Jeffries said. \"But we have to decisively address this Republican health care crisis that is devastating hard-working American taxpayers.\"</p></div><div><p>New polling data from CBS, the BBC's US news partner, found that Americans view both parties' handling of the shutdown unfavourably, with Trump also netting a negative reception. </p><p>The survey found that 80% of the nearly 2,500 Americans polled were very or somewhat concerned about the shutdown's effect on the economy. Only 23% of those surveyed said the Republican position was worth a shutdown, while 28% said the same of Democrats' argument. </p><p>The polling found voters blame Trump and Republicans in Congress most for the situation, at 39%, while 30% blamed Democrats and 31% blamed both.  </p><p>Meanwhile, the consequences of the shutdown are beginning to mount as it drags into its second week. On Saturday, The National Gallery of Art announced it had to close its doors due to lack of funding. </p><p>Trump has repeatedly threatened to use the shutdown to enact mass layoffs across the federal government and cut agencies and services that he says are important to Democrats. </p><p>The details of those potential cuts have not been made public. The president has argued it was a chance \"to clear out dead wood, waste, and fraud. Billions of Dollars can be saved\". </p><p>Johnson was asked about the threats in the Sunday interview, telling NBC that he had not seen details, but \"it is a regrettable situation that the president does not want\".</p><p>\"I want Chuck Schumer to do the right thing that he's done throughout his 30-plus year career in Congress and vote to keep the government open,\" Johnson said, adding that, as long as the government was stalled, the White House had \"to make tough decisions\".</p></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shutdown: Congressional leaders remain deadlocked ahead of vote",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d0b5/live/b4dd61c0-a20c-11f0-8493-b191e68f6c5a.jpg"
      ],
      "datePublished": "2025-10-05T18:14:12.000Z",
      "dateModified": "2025-10-05T18:14:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Czech Republic: Billionaire populist Andrej Babis' party wins parliamentary election",
    "url": "https://www.bbc.com/news/articles/c62qezmr92lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/69ed/live/a4881e70-a138-11f0-92db-77261a15b9d2.jpg",
    "tag": "World",
    "date": "2025-10-05T06:38:01.000Z",
    "description": "<article><div><div><p>1 day ago</p></div><p><span><p><span>Rob Cameron</span><span>Prague Correspondent</span></p></span></p></div><figure><div><p><im",
    "body": "<article><div><div><p>1 day ago</p></div><p><span><p><span>Rob Cameron</span><span>Prague Correspondent</span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/69ed/live/a4881e70-a138-11f0-92db-77261a15b9d2.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/69ed/live/a4881e70-a138-11f0-92db-77261a15b9d2.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/69ed/live/a4881e70-a138-11f0-92db-77261a15b9d2.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/69ed/live/a4881e70-a138-11f0-92db-77261a15b9d2.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/69ed/live/a4881e70-a138-11f0-92db-77261a15b9d2.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/69ed/live/a4881e70-a138-11f0-92db-77261a15b9d2.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/69ed/live/a4881e70-a138-11f0-92db-77261a15b9d2.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/69ed/live/a4881e70-a138-11f0-92db-77261a15b9d2.jpg.webp\" alt=\"Reuters Andrej Babis dressed in a dark suit with his hands in the air in celebration, surrounded by journalists taking photos of him.\" /><span>Reuters</span></p></div></figure><div><p>Billionaire businessman Andrej Babis has won parliamentary elections in the Czech Republic, although his populist ANO party fell short of an overall majority.</p><p>ANO received just under 35% of the vote, earning them 80 seats in the 200-seat lower house – up from 72 seats four years ago, according to preliminary results.</p><p>Babis – who served as prime minister from 2017 to 2021 – is expected to be invited to lead talks on forming a new coalition.</p><p>\"This is a historic success,\" Andrej Babis announced to cheering supporters at the ANO headquarters in the suburbs of Prague.</p></div><div><p>He'd entered the building holding aloft a Bluetooth speaker blasting a remix of the 1981 hit 'Sarà perché ti amo' by the Italian pop trio Ricchi e Poveri.</p><p>The same song resounded across the stage as he accepted the applause. Some colleagues – including the former finance minister Alena Schillerova – danced along to the beat.</p><p>\"It's the pinnacle of my political career!\" he said, adding that he and his team would now work to make the Czech Republic \"the best place to live in the European Union\".</p><p>But while this election has thrown up no great surprises – few had any doubt he would emerge in first place - there are still plenty of questions.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/2bb3/live/8e5bcbe0-a158-11f0-b532-53fba03d9a6f.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/2bb3/live/8e5bcbe0-a158-11f0-b532-53fba03d9a6f.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/2bb3/live/8e5bcbe0-a158-11f0-b532-53fba03d9a6f.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/2bb3/live/8e5bcbe0-a158-11f0-b532-53fba03d9a6f.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/2bb3/live/8e5bcbe0-a158-11f0-b532-53fba03d9a6f.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/2bb3/live/8e5bcbe0-a158-11f0-b532-53fba03d9a6f.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/2bb3/live/8e5bcbe0-a158-11f0-b532-53fba03d9a6f.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/2bb3/live/8e5bcbe0-a158-11f0-b532-53fba03d9a6f.jpg.webp\" alt=\"Anadolu via Getty Images Andrej Babis holds a press conference at ANO headquarters on 4 October 2025, wearing a blue suit and red tie. He is surrounded by people including a man in a suit and a woman in a suit\" /><span>Anadolu via Getty Images</span></p></div></figure><div><p>Babis has already begun talks with the two small right-wing eurosceptic parties that managed to pass the 5% threshold: the anti-Green Deal Motorists for Themselves, and the anti-immigrant Freedom and Direct Democracy (SPD) party, led by the Czech-Japanese entrepreneur Tomio Okamura.</p><p>Parliamentary maths means he will need an alliance with both to form a government that enjoys a majority in parliament - none of the other parties are likely to work with him.</p><p>After giving his acceptance speech he said he wanted ANO to govern alone, rather than create a formal coalition.</p><p>ANO will have the most in common with the Motorists. The two already sit in the same European Parliament group – the \"pro-sovereignty\" Patriots for Europe, which Babis founded alongside Hungary's Viktor Orban and Austria's Herbert Kickl last year.</p><p>ANO shares the Motorists' misgivings about the EU's emissions targets, and vows to modify or reject them outright.</p><p>Both parties are firmly against Czech households carrying a greater financial burden for cleaner energy, and both oppose the EU's ban on the sale of new petrol and diesel cars after 2035.</p><p>Relations with the SPD could be more fraught.</p><p>For a start, SPD fought this election in a formal alliance with a number of fringe parties on the far-right, meaning they will have to yield some of their seats to them. Okamura may not have full control of the MPs in his caucus – always a recipe for disaster in coalition politics.</p><p>Babis has also categorically ruled out allowing a referendum on either EU or NATO membership – a key policy priority for the SPD.</p><p>The ANO leader might have leaned heavily into anti-Ukrainian rhetoric in the final days of the campaign, lambasting the centre-right government for giving \"Czech mothers nothing, and Ukrainians everything\".</p><p>But Okamura's call for Ukrainian refugees to be deported en masse will likely fall on deaf ears.</p><p>Czech military support for Ukraine's war effort however is likely to change significantly under a Babis administration.</p></div><div><p>He has already vowed to scrap the successful Czech ammunition initiative – which has delivered 3.5 million shells to Ukraine since 2022.</p><p>Babis claims it lacks transparency, but Czech government officials who created the scheme say it works precisely because it is not transparent.</p><p>Under the initiative, Czech arms dealers use their international contacts to procure shells for Ukraine on the global market, with the bulk of the money coming from EU and NATO partners. Some of the producers are in countries that have relationships with Russia but as the deal is arranged with Czech dealers their involvement remains private.</p><p>The ANO leader wants it moved under the umbrella of NATO instead, and again on Saturday accused Czech arms dealers of making enormous profits from the scheme.</p><p>However, he said he would have no problem negotiating the matter with President Zelensky.</p><p>Babis also laughed off claims Western allies were worried the Czech Republic would no longer be a reliable partner in the EU and NATO under his administration, and that was why he now appeared to be distancing himself from extremist parties.</p><p>\"Your problem is you just copy lies from Czech journalists,\" he replied, answering a reporter from the New York Times in English.</p><p>\"I spoke with Trump five times! I was in the Pentagon. I was in the FBI. I talked to the head of the CIA,\" Babis said, speaking of his first term, which overlapped with President Trump's first term in office.</p><p>\"We were a very reliable partner,\" he went on.</p><p>\"I have been prime minister. We have been in government before. And we had excellent results.\"</p></div></article>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Czech Republic: Billionaire populist Andrej Babis' party wins parliamentary election",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/69ed/live/a4881e70-a138-11f0-92db-77261a15b9d2.jpg"
      ],
      "datePublished": "2025-10-05T06:38:01.000Z",
      "dateModified": "2025-10-05T06:38:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Before and after images show glaciers vanishing before our eyes",
    "url": "https://www.bbc.com/news/articles/ce32ezzq6zlo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/20d7/live/a19d9d30-a07e-11f0-b741-177e3e2c2fc7.jpg",
    "tag": "World",
    "date": "2025-10-05T00:28:17.000Z",
    "description": "<article><div><div><p>1 day ago</p></div><p><span><p><span>Mark Poynting</span><span>Climate and science reporter, BBC News</span></p></span></p></div",
    "body": "<article><div><div><p>1 day ago</p></div><p><span><p><span>Mark Poynting</span><span>Climate and science reporter, BBC News</span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/4a62/live/e4a79e90-a07a-11f0-928c-71dbb8619e94.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/4a62/live/e4a79e90-a07a-11f0-928c-71dbb8619e94.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/4a62/live/e4a79e90-a07a-11f0-928c-71dbb8619e94.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/4a62/live/e4a79e90-a07a-11f0-928c-71dbb8619e94.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/4a62/live/e4a79e90-a07a-11f0-928c-71dbb8619e94.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/4a62/live/e4a79e90-a07a-11f0-928c-71dbb8619e94.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/4a62/live/e4a79e90-a07a-11f0-928c-71dbb8619e94.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/4a62/live/e4a79e90-a07a-11f0-928c-71dbb8619e94.jpg.webp\" alt=\"BBC Blended image comparison of the Tschierva Glacier in 1935 on the left and 2022 on the right. The glacier extends far down the valley in 1935 but has retreated way up the valley by 2022.\" /><span>BBC</span></p></div></figure><div><p>When Matthias Huss first visited Rhône Glacier in Switzerland 35 years ago, the ice was just a short walk from where his parents would park the car.</p><p>\"When I first stepped onto the ice... there [was] a special feeling of eternity,\" says Matthias. </p><p>Today, the ice is half an hour from the same parking spot and the scene is very different.</p><p>\"Every time I go back, I remember how it used to be,\" recalls Matthias, now director of Glacier Monitoring in Switzerland (GLAMOS), \"how the glacier looked when I was a child.\"</p><p>There are similar stories for many glaciers all over the planet, because these frozen rivers of ice are retreating - fast.</p><p>In 2024, glaciers outside the giant ice sheets of Greenland and Antarctica lost 450 billion tonnes of ice, according to a recent World Meteorological Organization report.</p><p>That's equivalent to a block of ice 7km (4.3 miles) tall, 7km wide and 7km deep - enough water to fill 180 million Olympic swimming pools.</p><p>\"Glaciers are melting everywhere in the world,\" says Prof Ben Marzeion of the Institute of Geography at the University of Bremen. \"They are sitting in a climate that is very hostile to them now because of global warming.\"</p><p>Switzerland's glaciers have been particularly badly hit, losing a quarter of their ice in the last 10 years, measurements from GLAMOS revealed this week.</p><p>\"It's really difficult to grasp the extent of this melt,\" explains Dr Huss.</p><p>But photos - from space and the ground - tell their own story.</p><p>Satellite images show how the Rhône Glacier has changed since 1990, when Dr Huss first visited. At the front of the glacier is a lake where there used to be ice.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/847d/live/45081dc0-9fa7-11f0-b741-177e3e2c2fc7.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/847d/live/45081dc0-9fa7-11f0-b741-177e3e2c2fc7.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/847d/live/45081dc0-9fa7-11f0-b741-177e3e2c2fc7.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/847d/live/45081dc0-9fa7-11f0-b741-177e3e2c2fc7.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/847d/live/45081dc0-9fa7-11f0-b741-177e3e2c2fc7.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/847d/live/45081dc0-9fa7-11f0-b741-177e3e2c2fc7.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/847d/live/45081dc0-9fa7-11f0-b741-177e3e2c2fc7.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/847d/live/45081dc0-9fa7-11f0-b741-177e3e2c2fc7.jpg.webp\" alt=\"Satellite images showing how Rhône Glacier has shrunk between 1990 and 2025. The glacier flows from top to bottom of the image. The glacier front has noticeably retreated, and a glacial lake is now visible where the ice used to be. \" /></p></div></figure><div><p>Until recently, glaciologists in the Alps used to consider 2% of ice lost in a single year to be \"extreme\".</p><p>Then 2022 blew that idea out of the water, with nearly 6% of Switzerland's remaining ice lost in a single year. </p><p>That has been followed by significant losses in 2023, 2024 and now 2025 too.</p><p>Regine Hock, professor of glaciology at the University of Oslo, has been visiting the Alps since the 1970s.</p><p>The changes over her lifetime are \"really stunning\", she says, but \"what we see now is really massive changes within a few years\".</p><p>The Clariden Glacier, in north-eastern Switzerland, was roughly in balance until the late 20th Century - gaining about as much ice through snowfall as it lost to melting.</p><p>But this century, it's melted rapidly.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/033d/live/14184b90-a05b-11f0-b741-177e3e2c2fc7.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/033d/live/14184b90-a05b-11f0-b741-177e3e2c2fc7.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/033d/live/14184b90-a05b-11f0-b741-177e3e2c2fc7.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/033d/live/14184b90-a05b-11f0-b741-177e3e2c2fc7.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/033d/live/14184b90-a05b-11f0-b741-177e3e2c2fc7.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/033d/live/14184b90-a05b-11f0-b741-177e3e2c2fc7.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/033d/live/14184b90-a05b-11f0-b741-177e3e2c2fc7.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/033d/live/14184b90-a05b-11f0-b741-177e3e2c2fc7.jpg.webp\" alt=\"Two images showing Clariden Glacier in 1898 and 2006, above a larger image of the same glacier in 2025. The glacier has visibly shrunk between 1898 and 2006, but the changes between 2006 and 2025 are even more noticeable: the ice is thinner and has retreated.\" /></p></div></figure><div><p>For many smaller glaciers, like the Pizol Glacier in the north-east Swiss Alps, it's been too much.</p><p>\"This is one of the glaciers that I observed, and now it's completely gone,\" says Dr Huss. \"It definitely makes me sad.\"</p></div><div><p>Photographs allow us to look even further back in time.</p><p>The Gries Glacier, in southern Switzerland near the Italian border, has retreated by about 2.2km (1.4 miles) in the past century. Where the end of the glacier once stood is now a large glacial lake.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/85dc/live/427976d0-a05b-11f0-b741-177e3e2c2fc7.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/85dc/live/427976d0-a05b-11f0-b741-177e3e2c2fc7.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/85dc/live/427976d0-a05b-11f0-b741-177e3e2c2fc7.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/85dc/live/427976d0-a05b-11f0-b741-177e3e2c2fc7.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/85dc/live/427976d0-a05b-11f0-b741-177e3e2c2fc7.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/85dc/live/427976d0-a05b-11f0-b741-177e3e2c2fc7.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/85dc/live/427976d0-a05b-11f0-b741-177e3e2c2fc7.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/85dc/live/427976d0-a05b-11f0-b741-177e3e2c2fc7.jpg.webp\" alt=\"Two images of Gries Glacier, one in 1919 above and one in 2025 below. In 1919 a thick glacier is flowing from left to right, extending off the page. In 2025 the glacier only just enters at the left-hand side of the image. Where the ice once was is a large area of exposed bedrock, followed by a bright blue glacier lake.\" /></p></div></figure><p>In south-east Switzerland, the Pers Glacier once fed the larger Morteratsch Glacier, which flows down towards the valley. Now the two no longer meet.</p><p>And the largest glacier in the Alps, the Great Aletsch, has receded by about 2.3km (1.4 miles) over the past 75 years. Where there was ice, there are now trees.</p><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/a0bf/live/6bcb2970-a05b-11f0-92db-77261a15b9d2.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/a0bf/live/6bcb2970-a05b-11f0-92db-77261a15b9d2.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/a0bf/live/6bcb2970-a05b-11f0-92db-77261a15b9d2.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/a0bf/live/6bcb2970-a05b-11f0-92db-77261a15b9d2.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/a0bf/live/6bcb2970-a05b-11f0-92db-77261a15b9d2.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/a0bf/live/6bcb2970-a05b-11f0-92db-77261a15b9d2.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/a0bf/live/6bcb2970-a05b-11f0-92db-77261a15b9d2.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/a0bf/live/6bcb2970-a05b-11f0-92db-77261a15b9d2.jpg.webp\" alt=\"Two images of the Great Aletsch Glacier, one in 1949 above and one in 2024 below. The glacier emerges in between two steep valley walls. In 1949, the glacier extends almost all the way down the image; in 2024, it only just emerges in the background. There are trees and bedrock where there used to be ice.\" /></p></div></figure><div><p>Glaciers have grown and shrunk naturally for millions of years, of course.</p><p>In the cold snaps of the 17th, 18th and 19th Centuries - part of the Little Ice Age - glaciers regularly advanced.</p><p>During this time, many were considered cursed by the devil in Alpine folklore, their advances linked to spiritual forces as they threatened hamlets and farmland. </p><p>There are even tales of villagers calling on priests to talk to the spirits of glaciers and get them to move up the mountain.</p><p>Glaciers began their widespread retreat across the Alps in about 1850, though the timing varied from place to place. </p><p>That coincided with rising industrialisation, when burning of fossil fuels, particularly coal, began to heat up our atmosphere, but it's hard to disentangle natural and human causes that far back in time.</p><p>Where there is no real doubt is that the particularly rapid losses of the past 40 years or so are not natural.</p></div><div><p>Without <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/c9w15nggj58o\">humans warming the planet</a> - by burning fossil fuels and releasing huge amounts of carbon dioxide (CO2) – glaciers would be expected to be roughly stable.</p><p>\"We can only explain it if we take into account CO2 emissions,\" confirms Prof Marzeion.</p><p>What is even more sobering is that these large, flowing bodies of ice can take decades to fully adjust to the rapidly warming climate. That means that, even if global temperatures stabilised tomorrow, glaciers would continue to retreat.</p><p>\"A large part of the future melt of the glaciers is already locked in,\" explains Prof Marzeion. \"They are lagging climate change.\"</p></div><div><p>But all is not lost.</p><p>Half of the ice remaining across the world's mountain glaciers could be preserved if <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/science-environment-35073297\">global warming is limited to 1.5C</a> above \"pre-industrial\" levels of the late 1800s, according to research published this year in <a target=\"_blank\" href=\"https://www.science.org/doi/10.1126/science.adu4675\">the journal Science</a>.</p><p>Our current trajectory is leading us towards warming of about 2.7C above pre-industrial levels by the end of this century – which would see three-quarters of ice lost eventually.</p><p>That extra water going into rivers and eventually the oceans means higher sea levels for coastal populations around the world.</p><p>But the loss of ice will be particularly acutely felt by mountain communities dependent on glaciers for fresh water.</p><p>Glaciers are a bit like giant reservoirs. They collect water as snowfall - which turns into ice - during cold, wet periods, and release it as meltwater during warm periods.</p><p>This meltwater helps to stabilise river flows during hot, dry summers - until the glacier disappears.</p><p>The loss of that water resource has knock-on effects for all those who rely on glaciers - for irrigation, drinking, hydropower and even shipping traffic.</p><p>Switzerland is not immune from those challenges, but the implications are much more profound for the high mountains of Asia, referred to by some as the Third Pole due to the volume of ice.</p><p>About 800 million people rely at least partly on meltwater from glaciers there, particularly for agriculture. That includes the upper Indus river basin, which serves parts of China, India, Pakistan, and Afghanistan.</p><p>In regions with drier summers, meltwater from ice and snow can be the only significant source of water for months.</p><p>\"That's where we see the biggest vulnerability,\" says Prof Hock.</p><p>So how do scientists feel when confronted by the future prospects of glaciers in a warming world?</p><p>\"It's sad,\" says Prof Hock. \"But at the same time, it's also empowering. If you decarbonise and reduce the [carbon] footprint, you can preserve glaciers.</p><p>\"We have it in our hands.\"</p></div><div><p><i>Top image: Tschierva Glacier, Swiss Alps, in 1935 and 2022. Credit: swisstopo and VAW Glaciology, ETH Zurich.</i></p><p><i>Additional reporting by Dominic Bailey and Erwan Rivault.</i></p></div><div><p><span>More on this story</span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/8c6c/live/f9295fc0-0fde-11f0-ba12-8d27eb561761.png.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/8c6c/live/f9295fc0-0fde-11f0-ba12-8d27eb561761.png.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/8c6c/live/f9295fc0-0fde-11f0-ba12-8d27eb561761.png.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/8c6c/live/f9295fc0-0fde-11f0-ba12-8d27eb561761.png.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/8c6c/live/f9295fc0-0fde-11f0-ba12-8d27eb561761.png.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/8c6c/live/f9295fc0-0fde-11f0-ba12-8d27eb561761.png.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/8c6c/live/f9295fc0-0fde-11f0-ba12-8d27eb561761.png.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/8c6c/live/f9295fc0-0fde-11f0-ba12-8d27eb561761.png.webp\" alt=\"Thin, green banner promoting the Future Earth newsletter with text saying, “The world’s biggest climate news in your inbox every week”. There is also a graphic of an iceberg overlaid with a green circular pattern.\" /></p></div></figure></article>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Before and after images show glaciers vanishing before our eyes",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/20d7/live/a19d9d30-a07e-11f0-b741-177e3e2c2fc7.jpg"
      ],
      "datePublished": "2025-10-05T00:28:17.000Z",
      "dateModified": "2025-10-05T00:28:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Five killed in large Russian missile and drone attack, Zelensky says",
    "url": "https://www.bbc.com/news/articles/czjvlgzmp4wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2274/live/5959c310-a1db-11f0-88d2-67f0fdc7ff28.jpg",
    "tag": "World",
    "date": "2025-10-05T12:22:35.000Z",
    "description": "<article><div><div><p>19 hours ago</p></div><p><span><p><span>Alex Boyd</span><span></span><span>,</span></p><p><span>Stuart Lau</span><span></span><s",
    "body": "<article><div><div><p>19 hours ago</p></div><p><span><p><span>Alex Boyd</span><span></span><span>,</span></p><p><span>Stuart Lau</span><span></span><span> and</span></p><p><span>Gary O'Donoghue</span><span>Kyiv</span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/2274/live/5959c310-a1db-11f0-88d2-67f0fdc7ff28.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/2274/live/5959c310-a1db-11f0-88d2-67f0fdc7ff28.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/2274/live/5959c310-a1db-11f0-88d2-67f0fdc7ff28.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/2274/live/5959c310-a1db-11f0-88d2-67f0fdc7ff28.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/2274/live/5959c310-a1db-11f0-88d2-67f0fdc7ff28.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/2274/live/5959c310-a1db-11f0-88d2-67f0fdc7ff28.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/2274/live/5959c310-a1db-11f0-88d2-67f0fdc7ff28.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/2274/live/5959c310-a1db-11f0-88d2-67f0fdc7ff28.jpg.webp\" alt=\"Reuters A number of rescuers in protective clothing can be seen working around a destroyed house. They are surrounded by rubble and are clearing away bricks and other pieces of debris.\" /><span>Reuters</span></p></div><p></p><figcaption>Rescuers work at the site of a house that was destroyed in Lapaivka, near Lviv</figcaption><p></p></figure><div><p>Five people have died and tens of thousands have been left without power in Ukraine after intense Russian missile and drone attacks overnight, Ukrainian President Volodymyr Zelensky has said.</p><p>Four members of one family, including a 15-year-old girl, were killed by a strike in the village of Lapaivka as attacks mostly targeted the western region of Lviv.</p><p>One person also died in Zaporizhzhia. Zelensky said Russia fired more than 50 missiles and around 500 attack drones. Ukraine's air force put the combined figure at 549.</p><p>Russia's defence ministry said it had successfully carried out a \"massive\" strike on Ukrainian military and infrastructure targets.</p></div><div><p>Ukraine's neighbour Poland scrambled fighter jets to ensure the safety of Polish airspace, its military confirmed. Allied Nato aircraft were also deployed. </p><p>Lviv endured several hours of strikes, leading to the suspension of public transport services and the cutting of electrical supplies.</p><p>Maksym Kozytskyi, Lviv's regional head, said it was the largest attack on the region since Russia began its full-scale invasion of Ukraine in 2022. He said around 163 drones and missiles were identified in the area.</p><p>Kozytskyi said the arms targeted residential buildings, hospitals, civilian industrial facilities and gas transportation infrastructure. </p><p>He added that the attack was \"especially cynical\" as it came as Ukrainians typically begin heating their homes.</p><p>Another family member of those killed in Lapaivka was injured, as were two neighbours.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/9e23/live/e4bef690-a27c-11f0-8750-8f7dd5d5d150.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/9e23/live/e4bef690-a27c-11f0-8750-8f7dd5d5d150.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/9e23/live/e4bef690-a27c-11f0-8750-8f7dd5d5d150.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/9e23/live/e4bef690-a27c-11f0-8750-8f7dd5d5d150.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/9e23/live/e4bef690-a27c-11f0-8750-8f7dd5d5d150.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/9e23/live/e4bef690-a27c-11f0-8750-8f7dd5d5d150.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/9e23/live/e4bef690-a27c-11f0-8750-8f7dd5d5d150.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/9e23/live/e4bef690-a27c-11f0-8750-8f7dd5d5d150.jpg.webp\" alt=\"State Emergency Service Of Ukraine Flames rising from a car on fire in front on an apartment building, during the night. \" /><span>State Emergency Service Of Ukraine</span></p></div><p></p><figcaption>A car burns in front of an apartment building in Zaporizhzhia</figcaption><p></p></figure><div><p>The Ivano-Frankivsk, Chernihiv, Sumy, Kharkiv, Kherson, Odesa, and Kirovohrad regions were also targeted, according to Zelensky.</p><p>He added: \"We need more protection and faster implementation of all defense agreements, especially on air defense, to deprive this aerial terror of any meaning.</p><p>\"A unilateral ceasefire in the skies is possible - and it is precisely that which could open the way to real diplomacy.\"</p><p>Russia continues to focus its attacks on Ukraine's energy infrastructure as winter approaches.</p><p>Kyiv's energy ministry said overnight attacks caused damage in Chernihiv, Sumy and Zaporizhzhia.</p><p>In the latter, Russia's overnight attack left \"more than 73,000 consumers... without electricity\" after a power plant was struck, according to Ivan Fedorov, the regional head. </p><p>A woman was killed and several others injured in Zaporizhzhia.</p><p>A 16-year-old girl was among those receiving medical assistance, Fedorov added, posting photos apparently showing a partly destroyed multi-storey block and a burnt-out car from the site of the attack.</p><p>Emergency outages were implemented in Chernihiv and Sumy, the energy ministry added.</p><p>Lviv's mayor Andriy Sadovyi said part of the city - 70 km (43 miles) from the border with Poland - had no power, adding that city's air defence systems were engaged heavily in repelling first a drone and then a Russian missile attack.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/bb49/live/13f22d00-a1bb-11f0-b741-177e3e2c2fc7.png.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/bb49/live/13f22d00-a1bb-11f0-b741-177e3e2c2fc7.png.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/bb49/live/13f22d00-a1bb-11f0-b741-177e3e2c2fc7.png.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/bb49/live/13f22d00-a1bb-11f0-b741-177e3e2c2fc7.png.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/bb49/live/13f22d00-a1bb-11f0-b741-177e3e2c2fc7.png.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/bb49/live/13f22d00-a1bb-11f0-b741-177e3e2c2fc7.png.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/bb49/live/13f22d00-a1bb-11f0-b741-177e3e2c2fc7.png.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/bb49/live/13f22d00-a1bb-11f0-b741-177e3e2c2fc7.png.webp\" alt=\"Map: Poland and Ukraine are marked on a map, with Poland shaded in dark yellow. A circular point marks Lviv, in western Ukraine. The map is meant to show the proximity of Lviv to Poland\" /></p></div></figure><div><p>Ukraine's air force said it recorded direct hits by eight Russian missiles and 57 drones at 20 locations across the country, as well as fragments from downed arms at six locations.</p><p>It said 478 missiles and drones were downed and six did not reach their targets.</p><p>On the ground, Russian forces have occupied most of Ukraine's eastern Donbas region, including Luhansk and Donetsk, since the start of its invasion.</p><p>Russia currently controls around a fifth of Ukrainian territory, including the Crimean peninsula it annexed in 2014.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/3c6e/live/bdd53bf0-a1bb-11f0-92db-77261a15b9d2.png.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/3c6e/live/bdd53bf0-a1bb-11f0-92db-77261a15b9d2.png.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/3c6e/live/bdd53bf0-a1bb-11f0-92db-77261a15b9d2.png.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/3c6e/live/bdd53bf0-a1bb-11f0-92db-77261a15b9d2.png.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/3c6e/live/bdd53bf0-a1bb-11f0-92db-77261a15b9d2.png.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/3c6e/live/bdd53bf0-a1bb-11f0-92db-77261a15b9d2.png.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/3c6e/live/bdd53bf0-a1bb-11f0-92db-77261a15b9d2.png.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/3c6e/live/bdd53bf0-a1bb-11f0-92db-77261a15b9d2.png.webp\" alt=\"Map showing which areas of Ukraine are under Russian military control or limited Russian control\" /></p></div></figure><div><p>The Russian assaults came days after a US official said the US would support Ukraine launching strikes deep inside Russian territory.</p><p>When asked about US President Donald Trump's position on the matter, US Special Envoy to Ukraine Keith Kellogg told Fox News: \"The answer is yes, use the ability to hit deep, there are no such things as sanctuaries.\"</p><p>Ukraine has repeatedly attacked targets inside Russia, but has been limited by the range of the weapons it has been supplied.</p><p>It has recently been stepping up strikes on Russian oil refineries, leading to petrol shortages in parts of the country.</p><p>In Russia, air defence units destroyed 32 Ukrainian drones overnight, the state-owned news agency RIA reported on Sunday, citing data from Russia's defence ministry.</p></div></article>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Five killed in large Russian missile and drone attack, Zelensky says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2274/live/5959c310-a1db-11f0-88d2-67f0fdc7ff28.jpg"
      ],
      "datePublished": "2025-10-05T12:22:35.000Z",
      "dateModified": "2025-10-05T12:22:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Australia signs key defence deal with Papua New Guinea",
    "url": "https://www.bbc.com/news/articles/cp9824r3p31o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/96a1/live/4562c470-a266-11f0-8d65-b7e784f668c2.jpg",
    "tag": "World",
    "date": "2025-10-06T04:00:38.000Z",
    "description": "<p></p><figcaption>Watch: We told China that Australia is our 'partner of choice', says Papua New Guinea PM</figcaption><p></p><div><p>Australia will ",
    "body": "<p></p><figcaption>Watch: We told China that Australia is our 'partner of choice', says Papua New Guinea PM</figcaption><p></p><div><p>Australia will gain access to Papua New Guinea's (PNG) military facilities and troops under a key deal that will see the nations come to each other's aid if either is attacked.</p><p>Both governments say the deal was born from a yearslong alliance between the two Pacific neighbours, but experts say it is aimed at countering China's growing influence in the region.</p><p>The deal ensures China will not have the same access to infrastructure in PNG as it does in other Pacific Islands, said Oliver Nobetau, project director of the Lowy Institute's Australia-PNG network.</p><p>It will allow as many as 10,000 Papua New Guineans to serve in Australia's military, and give them the option to become Australian citizens.</p></div><div><p>With nearly 12 million people, PNG is the largest and most populous South Pacific nation.</p><p>China has already significantly shored up trade with Pacific Island nations in recent years, and is now trying to establish diplomatic and security beachheads across the region.</p><p>Australia and its Western allies, including the United States, have been attempting to counter these efforts.</p><p>In 2022, <a target=\"_blank\" href=\"https://www.bbc.com/news/world-australia-61158146\">Beijing signed a security deal with the Solomon Islands</a> which has seen Chinese police officers embedded across the country, with another policing agreement forged in 2023.</p><p>In response, Canberra last December struck a deal to invest A$190m ($126m; £93m) into the Solomon Islands police force and set up a police training centre, with a similar agreement in place with Tuvalu.</p></div><div><p>In August, <a target=\"_blank\" href=\"https://www.bbc.com/news/articles/c8ry0l045myo\">Australia also signed a $328m security and business deal with Vanuatu</a>, which involves the building of two data centres, strengthening of security and help dealing with the impacts of climate change. </p><p>PNG Prime Minister James Marape, who signed this latest agreement with his Australian counterpart Anthony Albanese on Monday, stressed the deal was not born out of geopolitics.</p><p>PNG has been \"transparent\" with China, Marape said while in Canberra.</p><p>\"We have told them that Australia is our security partner of choice and they understand our alliances here... Other aspects of our relations have never been compromised,\" he said.</p><p>Albanese said the two countries' alliance is \"built on generations of mutual trust, and demonstrates our commitment to ensuring the Pacific remains peaceful, stable and prosperous\".</p><p>\"By continuing to build our security relationships in the region, we safeguard our own security,\" he said.</p></div><div><p>The Pukpuk Treaty, named after the word for \"crocodile\" in PNG pidgin, notes that an armed attack on either country would be \"dangerous to the other's peace and security\", so both should \"act to meet the common danger\". </p><p>\"[The treaty] has the ability to bite and like a crocodile, its bite force speaks of the interoperability's and preparedness of the military for war,\" according to a copy of the deal seen by the Australian Broadcasting Corporation (ABC). </p><p>The deal also covered greater collaboration around cyberspace and electromagnetic warfare, the documents said. </p><p>Earlier, the PNG Defence Minister Billy Joseph had told the ABC that the deal would mean Australian and PNG forces would be \"totally integrated\".</p><p>Mr Nobetau from the Lowy Institute said the agreement will also help address Australia's recent struggles recruiting for its military. </p><p>\"PNG has an oversupply of able-bodied citizens who are willing to do this kind of work,\" he said, adding many people would be attracted by the prospects of living in Australia and possibly gaining citizenship. </p><p>It also sends a message to the US, Mr Nobetau said.</p><p>\"The US has been questionable in recent times with its withdrawal from the Pacific and USAID,\" he said, referring to the Trump administration removing billions in foreign humanitarian aid. </p><p>\"This is just a demonstration that PNG and Australia are capable as equal partners for managing and bringing a return to regional stability in the Pacific.\"</p><p>The deal also includes annual joint military exercises which are about \"strategic messaging\", Mr Nobetau said, to \"show the interoperability of the forces and their ability to face an external threat in the region and how quickly they can organise themselves and deploy\".</p><p>Anna Powles, associate professor in security studies at Massey University in New Zealand, said the deal would help modernise PNG's army, bringing a significant boost in both material and morale terms.</p><p>There were questions over how it fits with the country's own policies though, she added.</p><p>\"There are concerns in PNG that the treaty undermines PNG's 'friends to all, enemies to none' foreign policy position by aligning PNG with Australia on all security matters,\" she explained.</p><p>Ms Powles noted that the deal forms part of Australia's so-called 'hub and spokes' network of security agreements in the Pacific - with Australia as the central hub and the island nations as the spokes - but said both sides need greater clarity on the expectations, obligations and commitments. </p><p>The deal has faced some criticism within PNG, with the country's former defence force commander warning that it may come at \"a high cost\" for the country.</p><p>\"It's common knowledge that Australia sees China as a potential threat, but China is not PNG's enemy,\" the commander, Jerry Singirok, told the ABC last month.</p></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australia signs key defence deal with Papua New Guinea",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/96a1/live/4562c470-a266-11f0-8d65-b7e784f668c2.jpg"
      ],
      "datePublished": "2025-10-06T04:00:38.000Z",
      "dateModified": "2025-10-06T04:00:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fiji's HIV cases surge due to bluetoothing, chemsex and needle-sharing",
    "url": "https://www.bbc.com/news/articles/c0m42dwvlk8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d00b/live/ae0af9b0-a1db-11f0-92db-77261a15b9d2.jpg",
    "tag": "World",
    "date": "2025-10-05T00:58:12.000Z",
    "description": "<article><p></p><h2>'They're not just sharing needles, they're sharing blood': How HIV cases soared in Fiji</h2><p></p><div><div><p>1 day ago</p></div",
    "body": "<article><p></p><h2>'They're not just sharing needles, they're sharing blood': How HIV cases soared in Fiji</h2><p></p><div><div><p>1 day ago</p></div><p><span><p><span>Gavin Butler</span><span></span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/11fb/live/1d4988b0-9f6f-11f0-99d3-79886bca9dc5.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/11fb/live/1d4988b0-9f6f-11f0-99d3-79886bca9dc5.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/11fb/live/1d4988b0-9f6f-11f0-99d3-79886bca9dc5.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/11fb/live/1d4988b0-9f6f-11f0-99d3-79886bca9dc5.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/11fb/live/1d4988b0-9f6f-11f0-99d3-79886bca9dc5.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/11fb/live/1d4988b0-9f6f-11f0-99d3-79886bca9dc5.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/11fb/live/1d4988b0-9f6f-11f0-99d3-79886bca9dc5.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/11fb/live/1d4988b0-9f6f-11f0-99d3-79886bca9dc5.jpg.webp\" alt=\"Getty Images Three syringes, seemingly used, lying on a tattered orange blanket\" /><span>Getty Images</span></p></div><p></p><figcaption>Intravenous drug use is fuelling Fiji's HIV epidemic</figcaption><p></p></figure><div><p>Ten: that's the age of the youngest person with HIV that Sesenieli Naitala has ever met.</p><p>When she first started Fiji's Survivor Advocacy Network in 2013, that young boy was yet to be born. Now he is one of thousands of Fijians to have contracted the bloodborne virus in recent years – many of them aged 19 or younger, and many of them through intravenous drug use.</p><p>\"More young people are using drugs,\" Ms Naitala, whose organisation provides support to sex workers and drug users in the Fijian capital Suva, tells the BBC. \"He (the boy) was one of those young people that were sharing needles on the street during Covid.\"</p><p>Over the past five years, Fiji – a tiny South Pacific nation with a population of less than a million – has become the locus of one of the world's fastest growing HIV epidemics.</p><p>In 2014, the country had fewer than 500 people living with HIV. By 2024 that number had soared to approximately 5,900 – an elevenfold leap. </p><p>That same year, Fiji recorded 1,583 new cases – a thirteenfold increase on its usual five-year average. Of those, 41 were aged 15 or younger, compared to just 11 in 2023.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/7b4b/live/5dd4aa90-9f6f-11f0-9bc3-493c32f03408.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/7b4b/live/5dd4aa90-9f6f-11f0-9bc3-493c32f03408.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/7b4b/live/5dd4aa90-9f6f-11f0-9bc3-493c32f03408.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/7b4b/live/5dd4aa90-9f6f-11f0-9bc3-493c32f03408.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/7b4b/live/5dd4aa90-9f6f-11f0-9bc3-493c32f03408.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/7b4b/live/5dd4aa90-9f6f-11f0-9bc3-493c32f03408.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/7b4b/live/5dd4aa90-9f6f-11f0-9bc3-493c32f03408.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/7b4b/live/5dd4aa90-9f6f-11f0-9bc3-493c32f03408.jpg.webp\" alt=\"Getty Images A view of the Suva waterfront, with a dock in the foreground and multi-storey buildings in the background\" /><span>Getty Images</span></p></div><p></p><figcaption>Fiji's assistant health minister has called the HIV epidemic a \"national crisis\"</figcaption><p></p></figure><div><p>Such figures prompted the country's minister for health and medical services to declare an HIV outbreak in January. Last week, assistant health minister Penioni Ravunawa warned Fiji may record more than 3,000 new HIV cases by the end of 2025.</p><p>\"This is a national crisis,\" he said. \"And it is not slowing down.\"</p><p>The BBC spoke to multiple experts, advocates and frontline workers about the reasons for such a meteoric rise in case numbers. Several pointed out that, as awareness around HIV spreads and stigma diminishes, more people have been coming forward and getting tested.</p><p>At the same time though, they also noted that countless more remain invisible to the official figures – and that the true scale of the issue is likely much bigger than even the record-breaking numbers suggest.</p></div><p></p><h2>'Sharing the blood'</h2><p></p><div><p>Underpinning Fiji's HIV epidemic is a spiralling trend of drug use, unsafe sex, needle sharing and \"bluetoothing\". </p><p>Otherwise known as \"hotspotting\", this latter term refers to a practice where an intravenous drug user withdraws their blood after a hit and injects it into a second person – who may then do the same for a third, and so on.</p><p>Kalesi Volatabu, executive director for the NGO Drug Free Fiji, has seen it happen firsthand. Last May, she was on one of her regular early morning walks through the Fijian capital of Suva, offering support and education to drug users on the streets, when she turned a corner and saw a group of seven or eight people huddling together.</p><p>\"I saw the needle with the blood – it was right there in front of me,\" she recalls. \"This young woman, she'd already had the shot and she's taking out the blood – and then you've got other girls, other adults, already lining up to be hit with this thing.</p><p>\"It's not just needles they're sharing – they're sharing the blood.\"</p><p>Bluetoothing has also been reported in South Africa and Lesotho, two countries with some of the world's highest rates of HIV. In Fiji, the practice became popular within the past few years, according to both Ms Volatabu and Ms Naitala.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/de66/live/54020880-a007-11f0-b741-177e3e2c2fc7.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/de66/live/54020880-a007-11f0-b741-177e3e2c2fc7.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/de66/live/54020880-a007-11f0-b741-177e3e2c2fc7.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/de66/live/54020880-a007-11f0-b741-177e3e2c2fc7.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/de66/live/54020880-a007-11f0-b741-177e3e2c2fc7.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/de66/live/54020880-a007-11f0-b741-177e3e2c2fc7.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/de66/live/54020880-a007-11f0-b741-177e3e2c2fc7.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/de66/live/54020880-a007-11f0-b741-177e3e2c2fc7.jpg.webp\" alt=\"Supplied: Kalesi Volatabu A woman in a black and turquoise dress, wearing glasses and speaking into a microphone in front of several onlookers. Behind her is a wall with several pieces of paper attached to it\" /><span>Supplied: Kalesi Volatabu</span></p></div><p></p><figcaption>Kalesi Volatabu has spent more than a decade working at the frontline of drug awareness and advocacy in Fiji</figcaption><p></p></figure><div><p>One reason for its appeal, they explain, is a cheaper high: multiple people can chip in for a single hit and share it among themselves. Another is the convenience of only needing one syringe.</p><p>These can be difficult to come by in Fiji, where pharmacies, under police pressure, often demand prescriptions for syringes, and there is a lack of needle-syringe programmes. </p><p>Although there is growing acceptance and approval for the rollout of such programmes – which provide clean injecting equipment to drug users in an attempt to reduce the transmission of blood-borne infections like HIV – implementation in the highly religious and conservative country has proven challenging.</p><p>Ms Volatabu says there is a \"drastic shortage\" of needle-syringe sites, which is fuelling dangerous practices like needle-sharing and bluetoothing and putting the onus on NGOs to distribute syringes as well as condoms.</p><p>In August 2024, Fiji's Ministry of Health and Medical Services (MOH) recognised bluetoothing as one of the drivers for the country's rise in HIV cases. Another was chemsex, where people use drugs - often methamphetamine - before and during sexual encounters. </p><p>In Fiji, unlike most other countries around the world, crystal meth is predominantly consumed via intravenous injection.</p><p>MOH also found that of the 1,093 new cases recorded in the first nine months of 2024, 223 – about 20% – were from intravenous drug use.</p></div><p></p><h2>Kids on meth</h2><p></p><div><p>Fiji has become a major Pacific trafficking hub for crystal meth over the past 15 years. A large part of this is due to the country's geographic location between East Asia and the Americas – some of the world's biggest manufacturers of the drug - and Australia and New Zealand – the world's highest-paying markets.</p><p>During that same period, meth has spilled into and spread throughout local communities, developing into a crisis that, like HIV, was recently declared a \"national emergency\". </p><p>And according to those on the frontlines, the age of users is trending downwards.</p><p>\"We see more and more of these young people,\" says Ms Volatabu. \"They are getting younger and younger.\"</p><p>Fiji's most recent national HIV statistics cite injectable drug use as the most common known mode of transmission, accounting for 48% of cases. Sexual transmission accounted for 47% of cases, while mother-to-child transmission during pregnancy and childbirth was cited as the cause of most paediatric cases.</p><p>Everyone the BBC spoke to agreed that lack of education is a central factor in the epidemic. Ms Volatabu and Ms Naitala are both working to change that – and Ms Naitala says that as a greater awareness around the dangers of HIV spreads throughout the community, \"bluetoothing\" has, in her experience, fallen out of favour.</p><p>More people are getting tested and seeking treatment for HIV, leading to more robust data around the scale of the crisis.</p><p>But there is still a worry that the official case numbers are merely the tip of the iceberg – and a fear of what may lie beneath the surface.</p></div><p></p><h2>The avalanche</h2><p></p><div><p>José Sousa-Santos, head of the Pacific Regional Security Hub at New Zealand's University of Canterbury, says \"a perfect storm is brewing\".</p><p>\"The concern is across all levels of society and government in regards to Fiji's HIV crisis – not just what's happening at the moment, but where it's going to be in three years' time and the lack of Fiji's resources,\" he tells the BBC. \"The support systems - the nursing, the ability to distribute or to access the drugs for treatment of HIV - just aren't there.</p><p>\"That's what terrifies us, the people that work in the region: there is no way that Fiji can deal with this.\"</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/18f8/live/83b21860-9ffb-11f0-b741-177e3e2c2fc7.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/18f8/live/83b21860-9ffb-11f0-b741-177e3e2c2fc7.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/18f8/live/83b21860-9ffb-11f0-b741-177e3e2c2fc7.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/18f8/live/83b21860-9ffb-11f0-b741-177e3e2c2fc7.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/18f8/live/83b21860-9ffb-11f0-b741-177e3e2c2fc7.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/18f8/live/83b21860-9ffb-11f0-b741-177e3e2c2fc7.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/18f8/live/83b21860-9ffb-11f0-b741-177e3e2c2fc7.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/18f8/live/83b21860-9ffb-11f0-b741-177e3e2c2fc7.jpg.webp\" alt=\"Supplied: José Sousa-Santos A man with a goatee wearing a blue suit and blue shirt\" /><span>Supplied: José Sousa-Santos</span></p></div><p></p><figcaption>José Sousa-Santos has been ringing the alarm bell on Fiji's HIV epidemic for years</figcaption><p></p></figure><div><p>Following its declaration of an outbreak in January, the Fijian government has sought to improve its HIV surveillance and enhance its ability to address the likely underreporting of cases.</p><p>The Global Alert and Response Network, which was called upon to provide that support, stated in a recent report that \"addressing these pressing issues through a well-coordinated national response is crucial in reversing the trajectory of the HIV epidemic in Fiji\".</p><p>That report also noted that staffing shortages, communication issues, challenges with lab equipment and stockouts of HIV rapid tests and medicines were impacting screening, diagnosis and treatment.</p><p>Data collection is slow, difficult and error-prone, it added – hampering efforts to understand the extent of Fiji's HIV epidemic and the efficacy of the outbreak response.</p><p>That leaves many experts, authorities and everyday Fijians in the dark.  And Mr Sousa-Santos is predicting an \"avalanche\" of cases still to come.</p><p>\"What we're seeing at the moment is the beginning of the avalanche, but you can't stop it, because the infections are already happening now, or they've already happened – we're just not going to be able to see them and people aren't going to look to get tested for another two to three years,\" he says.</p><p>\"There's nothing that we can do at the moment to stop the number of infections that have already happened over the past year, and that are happening now. That's what's really terrifying.\"</p></div></article>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fiji's HIV cases surge due to bluetoothing, chemsex and needle-sharing",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d00b/live/ae0af9b0-a1db-11f0-92db-77261a15b9d2.jpg"
      ],
      "datePublished": "2025-10-05T00:58:12.000Z",
      "dateModified": "2025-10-05T00:58:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Godka Jilicow: Al-Shabab militants dress as soldiers to storm Somali jail",
    "url": "https://www.bbc.com/news/articles/cp3v0px28j8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d961/live/6c7ee190-a1e6-11f0-b741-177e3e2c2fc7.jpg",
    "tag": "World",
    "date": "2025-10-05T12:56:53.000Z",
    "description": "<div><div><p>18 hours ago</p></div><p><span><p><span>Wedaeli Chibelushi</span><span></span><span> and</span></p><p><span>Mohamud Abdisamad</span><span",
    "body": "<div><div><p>18 hours ago</p></div><p><span><p><span>Wedaeli Chibelushi</span><span></span><span> and</span></p><p><span>Mohamud Abdisamad</span><span>Mogadishu </span></p></span></p></div><div><p>Seven al-Shabab militants who attacked a high-security prison in Somalia's capital have all been killed, the country's government has said.</p><p>A huge explosion and gunfire were heard coming from Godka Jilicow - a detention centre that holds al-Shabab militants - in Mogadishu on Saturday evening.</p><p>In a statement, al-Shabab said it released \"all the Muslim prisoners\" from the facility and inflicted heavy casualties on those guarding the centre.</p><p>The militants disguised themselves as soldiers in order to enter the prison, government-run news agency Sonna Live reported on Sunday.</p></div><div><p>The government did not indicate how many of its security forces were killed during the incident, but gave its condolences to the families of \"the fallen heroes\".</p><p>Likewise, al-Shabab did not give a death toll for its militants.</p><p>The fighting began at around 16:40 local time (13:40 GMT).</p><p>Godka Jilicow is located near the Somali presidential palace, in the heart of Mogadishu. It is manned by Somalia's National Intelligence and Security Agency (Nisa) and holds al-Shabab militants and other high-profile detainees.</p><p>The attack is a major blow to Nisa and is likely to raise questions about how the militants were able to access one of the most heavily guarded areas in the capital.</p><p>Al-Shabab is affiliated to al-Qaeda and has waged a brutal insurgency against the government in Somalia for nearly 20 years.</p><p>Hours before Saturday's attack took place, the government had reopened key roads in Mogadishu which were previously closed for security reasons, citing improvements in the city's safety.</p></div>",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Godka Jilicow: Al-Shabab militants dress as soldiers to storm Somali jail",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d961/live/6c7ee190-a1e6-11f0-b741-177e3e2c2fc7.jpg"
      ],
      "datePublished": "2025-10-05T12:56:53.000Z",
      "dateModified": "2025-10-05T12:56:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]