[
  {
    "title": "Colombian court overturns former president Alvaro Uribe's conviction",
    "url": "https://www.bbc.com/news/articles/c629zz8gz5mo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6f08/live/082b42f0-aeb2-11f0-823e-59525db980c8.jpg",
    "tag": "World",
    "date": "2025-10-21T20:08:40.000Z",
    "description": "20 hours agoDearbail JordanEPAColombia's former President Alvaro Uribe faced 12 years' house arrest for fraud and briberyColombia's former president h",
    "body": "20 hours agoDearbail JordanEPAColombia's former President Alvaro Uribe faced 12 years' house arrest for fraud and briberyColombia's former president has had two convictions for fraud and bribery overturned after he was sentenced to 12 years of house arrest.Alvaro Uribe became the first Colombian leader to be criminally convicted after a trial in August in which a judge handed the 73-year-old the maximum sentence.  The case against him was linked to claims he ordered a lawyer to bribe jailed paramilitaries to discredit claims he had ties to their organisations. Uribe has always maintained his innocence. The right-wing politician, who was president between 2002 and 2010, is best  known for waging an aggressive offensive against left-wing Farc rebels and remains an influential figure in the South American nation.US Secretary of State Marco Rubio previously criticised Uribe's conviction, arguing that his only crime \"has been to tirelessly fight and defend his homeland\".Uribe was originally convicted, in part, on testimony from a former paramilitary commander, Luis Carlos Velez, who said he had been paid bribes by the president's lawyer, Diego Cadena.But the Superior Court in the capital, Bogotá, found that the ex-commander's testimony lacked credibility. In its 700-page decision overturning the convictions, the court also found that some of the wiretaps used to open a formal investigation into Uribe had been obtained illegally. The ruling can be appealed by people classed as victims in the case.Colombia's current and first left-wing President Gustavo Petro denounced the outcome.  He wrote on X: \"This is how the history of paramilitary governance in Colombia is covered up, that is, the history of politicians who came to power allied with drug trafficking.\"Paramilitary groups emerged in Colombia in the 1980s to fight the Marxist-inspired guerrilla groups that had been battling the state since the 1960s.Many of the armed groups that developed in the conflict made an income from the cocaine trade. Deadly fighting between them and with the state has produced lasting rivalries for trafficking routes and resources.Right-wing paramilitary groups have been found responsible for massacres, disappearances and other atrocities.Some left-wing guerilla outfits have also been found to have been involved in massacres and threats against Colombian citizens, according to Human Rights Watch.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Colombian court overturns former president Alvaro Uribe's conviction",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6f08/live/082b42f0-aeb2-11f0-823e-59525db980c8.jpg"
      ],
      "datePublished": "2025-10-21T20:08:40.000Z",
      "dateModified": "2025-10-21T20:08:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paris: Woman charged after 1.5m euros of gold stolen from museum",
    "url": "https://www.bbc.com/news/articles/c62ez36ndp3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e271/live/500828c0-ae64-11f0-bf6e-0db822206ec2.jpg",
    "tag": "World",
    "date": "2025-10-21T10:40:08.000Z",
    "description": "A Chinese woman has been charged with the theft of six gold nuggets worth about 1.5 million euros ($1.75m; £1.3m) from the Museum of Natural History i",
    "body": "A Chinese woman has been charged with the theft of six gold nuggets worth about 1.5 million euros ($1.75m; £1.3m) from the Museum of Natural History in Paris last month, French prosecutors have said.The woman was arrested in Barcelona while trying to dispose of some melted gold, according to officials, and is being held in pre-trial detention.Famous for its stuffed animals and bone collections, the museum is home to a mineralogy gallery, from which the gold was taken. Police found an angle-grinder and a blowtorch at the scene.The museum's alarm and surveillance systems had been disabled by a cyber-attack, with the thieves apparently aware of this, French media reported at the time.\"The thieves, clearly very experienced and well-informed, exploited a security flaw that had not been identified during the last audit conducted in 2024,\" a museum spokesperson told French newspaper Le Figaro.Cleaners discovered the break-in when they arrived for work before dawn at the museum, which is part of the Sorbonne university and located near the Jardin des Plantes in central Paris.The suspect was arrested by Spanish police on 30 September on a European arrest warrant and handed over to French authorities on the same day, officials said in a statement.At the time of her arrest, she was in possession of around a kilogram of melted-down gold. Investigations are continuing, the statement added. It is believed she was preparing to leave for China.One of the largest stolen nuggets, originally from Australia, weighs 5kg. At the current gold price, it would be worth around €585,000.\"We are dealing with an extremely professional team, perfectly aware of where they needed to go, and with professional equipment,\" Emmanuel Skoulios, the museum director, told French broadcasters.\"It is absolutely not by chance that they went for these specific items,\" he told France 2 television last month.The charges come just days after thieves made off with priceless French crown jewels from the Louvre Museum in a separate, daring raid. On Sunday, \"professional\" thieves broke into the world's most-visited museum, stealing eight valued items before escaping on scooters. The raid took less than eight minutes, police said.Experts told the BBC that the items are likely to be broken up and sold for a fraction of their worth.\"This won't be their first heist,\" Dutch art detective Arthur Brand said of the thieves on Monday. \"They have done things before, other burglaries. They are confident and they thought, 'we might get away with this', and went for it.\"At least four French museums - including the Louvre and the natural history museum - have been robbed in recent months, according to media reports.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paris: Woman charged after 1.5m euros of gold stolen from museum",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e271/live/500828c0-ae64-11f0-bf6e-0db822206ec2.jpg"
      ],
      "datePublished": "2025-10-21T10:40:08.000Z",
      "dateModified": "2025-10-21T10:40:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mosquitoes found in Iceland for first time after record heat",
    "url": "https://www.bbc.com/news/articles/clyz3vv62pgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c517/live/7a52d060-af1f-11f0-9f87-dd1917f781b7.jpg",
    "tag": "World",
    "date": "2025-10-22T08:22:17.000Z",
    "description": "Mosquitoes have been found in Iceland for the first time after the country experienced record-breaking heat this spring.Insect enthusiast Bjorn Hjalta",
    "body": "Mosquitoes have been found in Iceland for the first time after the country experienced record-breaking heat this spring.Insect enthusiast Bjorn Hjaltason encountered the mosquitoes over several nights last week while using wine-soaked ropes to observe moths, local media reported.Mr Hjaltason found two female mosquitoes and one male which were later confirmed to be Culiseta annulata, one of few species that can successfully survive winter.Iceland was one of only two mosquito-free havens in the world prior to the discovery, partly due to its cold climate. The only other recorded mosquito-free zone is Antarctica.The mosquitoes were found in Kjós, a glacial valley to the South West of the Icelandic capital of Reykjavik.Mr Hjaltason shared the news of his discovery on a Facebook page for local wildlife alongside pictures of the insects, describing \"a strange fly on a red wine ribbon\", according to Icelandic media.\"I could tell right away that this was something I had never seen before\" he said in the post, which was screenshotted and shared by Iceland's Morgunblaðið news site, adding \"the last fortress seems to have fallen.\"Mr Hjaltason sent the insects to the Icelandic Institute of Natural History to be identified, where entomologist Matthías Alfreðsson confirmed his suspicions.The species are common across parts of Europe and North Africa but it it isn't clear how they reached Iceland, Alfreðsson told CNN. Iceland's cold climate and lack of stagnant water in which the insects can breed are key contributors to the country's former lack of mosquitoes, the World Population Review said.But this year, the country broke multiple records for its high temperatures. Typically, Iceland rarely experiences highs of more than 20C (68F) in May, and when it does those heatwaves will last for no more than two to three days, its Met Office notes. That threshold was exceeded for 10 consecutive days this year in different parts of the country, though.Iceland also saw its hottest ever day in May, with temperatures reaching 26.6C (79.8F) at Eglisstaðir Airport.A June study published by the Global Heat Health Information Network noted that such shifts could have \"significant\" impacts on delicate ecosystems, which have adapted to the cold climate and are sensitive to temperature shifts.Last year was the world's hottest on record, and the UN's climate body has established that human influence has \"unequivocally\" warmed the atmosphere, oceans and land.Further monitoring will be required in spring to see if the mosquito species has \"truly become established in Iceland\", Alfreðsson added.Hjaltason, meanwhile, has speculated on the origin of the specimens he observed.\"One always suspects Grundartangi - it's only about six kilometers from me, and things often arrive with ships and containers, so it's possible something came in that way,\" he told Morgunblaðið.\"But if three of them came straight into my garden, there were probably more.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mosquitoes found in Iceland for first time after record heat",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c517/live/7a52d060-af1f-11f0-9f87-dd1917f781b7.jpg"
      ],
      "datePublished": "2025-10-22T08:22:17.000Z",
      "dateModified": "2025-10-22T08:22:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "ICJ says Israel must allow UN aid deliveries to Gaza to meet basic needs",
    "url": "https://www.bbc.com/news/articles/c17pqxzl0yzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3bac/live/770aa0b0-af13-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-10-22T16:02:21.000Z",
    "description": "The International Court of Justice (ICJ) has said Israel is obliged to facilitate the delivery of humanitarian aid to the Gaza Strip by the United Nat",
    "body": "The International Court of Justice (ICJ) has said Israel is obliged to facilitate the delivery of humanitarian aid to the Gaza Strip by the United Nations and its entities to ensure the basic needs of the Palestinian civilians are met.An advisory opinion from the UN's top court also said Israel had not substantiated its allegations that the UN agency for Palestinian refugees (Unrwa) lacked neutrality or that a significant number of its staff were members of Hamas or other armed groups. Unrwa has denied the claims.Israel rejected the opinion as \"political\" and insisted it would not co-operate with Unrwa.The opinion is non-binding, but it carries significant moral and diplomatic weight.The UN General Assembly asked the ICJ in December for an opinion on Israel's legal obligations towards UN agencies and international organisations operating in the occupied West Bank and Gaza.It came after the Israeli parliament passed laws banning any activity by Unrwa on Israeli territory and contact with Israeli officials.The ICJ was asked to also cover in its opinion Israel's duty to allow the unhindered delivery of essential supplies to Palestinian civilians.Israel tightened its blockade on Gaza after the start of its war with Hamas two years ago and has since restricted - and at times completely stopped - the entry of food and other aid for the 2.1 million population.Before this month's ceasefire deal took effect, UN-backed global experts had estimated that more than 640,000 people were facing catastrophic levels of food insecurity and that there was an \"entirely man-made\" famine in Gaza City. Israel rejected the famine declaration, insisting it was allowing in sufficient food.The ICJ's advisory opinion was \"entirely predictable from the outset regarding Unrwa\", the Israeli foreign ministry said on Wednesday.\"This is yet another political attempt to impose political measures against Israel under the guise of 'international law,'\" it added.Unrwa's acting Gaza director, Sam Rose, told the BBC that the agency welcomed the ICJ's opinion because it \"underscores the obligations of Israel under international law\". \"The ruling of today says that Israel's laws against Unrwa have gone against those obligations, as have its actions on the ground,\" he said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ICJ says Israel must allow UN aid deliveries to Gaza to meet basic needs",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3bac/live/770aa0b0-af13-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-22T16:02:21.000Z",
      "dateModified": "2025-10-22T16:02:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SpaceX says it has cut Starlink services to Myanmar scam camps",
    "url": "https://www.bbc.com/news/articles/cpd2e5541d1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6929/live/1836c3f0-af42-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-10-22T13:51:40.000Z",
    "description": "2 hours agoJonathan Head,South East Asia correspondent and Rachel HaganElon Musk's SpaceX says it has cut Starlink satellite communication links to mo",
    "body": "2 hours agoJonathan Head,South East Asia correspondent and Rachel HaganElon Musk's SpaceX says it has cut Starlink satellite communication links to more than 2,500 devices used by scam compounds in Myanmar.More than 30 compounds are believed to be operating along the Thai-Myanmar border, where people from around the world are trafficked and forced to work on scams generating tens of billions of dollars annually.Announcing the move, Lauren Dreyer, head of Starlink business operations, said the firm takes action on the rare occasion it identifies violations.The service's termination follows Monday's takeover of one of the largest compounds, KK Park, by the Myanmar military, as it retakes territory lost to insurgent groups over the past two years.Campaigners have long warned that Starlink technology has enabled the mainly Chinese crime syndicates to operate from remote locations along the border.Myanmar has become infamous for these operations, which defraud victims through romantic ploys and bogus investment schemes. Workers are lured under the guise of legitimate jobs, only to be held captive and forced into criminal activity.Survivors recount gruelling conditions, long hours, torture and beatings for failing to meet targets. Many of the victims come from African countries.\"In Myanmar... SpaceX proactively identified and disabled over 2,500 Starlink Kits in the vicinity of suspected 'scam centers',\" Dreyer said in a post on X.\"We are committed to ensuring the service remains a force for good and sustains trust worldwide: both connecting the unconnected and detecting and preventing misuse by bad actors,\" she added.On Monday Myanmar's military said it had \"cleared\" KK Park, releasing more than 2,000 workers and confiscating 30 Starlink terminals. Photographs show the satellite dishes on the compound's rooftops and footage supplied to the BBC showed thousands of workers leaving KK Park on foot.However, at least 30 other scam compounds remain active along the border, employing tens of thousands globally. Many are protected by militia groups loyal to the Myanmar military and it is unclear whether they have also lost access to Starlink services they once relied on.These centres have become a key component of Myanmar's wartime economy, as the junta battles various rebel groups while relying on Chinese support to maintain its hold on power.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SpaceX says it has cut Starlink services to Myanmar scam camps",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6929/live/1836c3f0-af42-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-22T13:51:40.000Z",
      "dateModified": "2025-10-22T13:51:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Uganda road crash leaves more than 40 dead",
    "url": "https://www.bbc.com/news/articles/cgql9lwddw5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9d67/live/4da725e0-af36-11f0-ba75-093eca1ac29b.jpg",
    "tag": "World",
    "date": "2025-10-22T11:01:39.000Z",
    "description": "5 hours agoBasillioh Rukanga and Maia DaviesWatch: Four vehicles were involved in the crash on a major highway on the Kampala-Gulu HighwayForty-six pe",
    "body": "5 hours agoBasillioh Rukanga and Maia DaviesWatch: Four vehicles were involved in the crash on a major highway on the Kampala-Gulu HighwayForty-six people have been killed after several vehicles crashed on a major highway in Uganda, the police say.The police revised down an earlier death toll of 63, saying they had mistakenly included victims who were unconscious and were now being treated.The crash occurred when two buses travelling in opposite directions \"met head on\" while trying to overtake two other vehicles – a lorry and a car – on the Kampala-Gulu Highway at 00:15 local time (21:15 GMT), the Uganda Police Force said.One of the buses swerved in an attempt to avoid a crash, but in the process caused a \"head on and side collision\" that led to a \"chain reaction\" in which other vehicles lost control and overturned.As well as the fatalities, the passengers of the vehicles involved and several others were injured, police said. An investigation has been launched.The injured have been taken to different hospitals in the western town of Kiryandongo. In a statement, police said they were working with health and emergency services to verify the numbers and provide accurate updates as investigations continue into the cause of the tragedy.President Yoweri Museveni said he had learnt of the tragic accident \"with sadness\" and sent his condolences to the bereaved families. He urged caution to prevent such tragedies.He directed that each bereaved family be given five million shillings each ($1,430; £1,070) and a million shillings to the injured.The highway between the capital Kampala in the south and the northern city of Gulu is one of the country's busiest.Following the crash, police have urged motorists to avoid \"dangerous and careless overtaking\".It said this \"remains one of the leading causes of crashes in the country\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Uganda road crash leaves more than 40 dead",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9d67/live/4da725e0-af36-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-22T11:01:39.000Z",
      "dateModified": "2025-10-22T11:01:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nigeria tanker explosion: Dozens killed scooping fuel in Niger state",
    "url": "https://www.bbc.com/news/articles/c93dnd49l0jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/991d/live/260fb4f0-af0b-11f0-a64c-7f94caf32c3e.jpg",
    "tag": "World",
    "date": "2025-10-22T11:49:14.000Z",
    "description": "At least 39 people have been killed in an oil tanker explosion in Nigeria's central Niger state after the vehicle skidded off the road and crashed, sp",
    "body": "At least 39 people have been killed in an oil tanker explosion in Nigeria's central Niger state after the vehicle skidded off the road and crashed, spilling fuel, an aid worker has told the BBC.Another 60 people with varying degrees of injuries are currently receiving treatment at a hospital, said Abdullahi Baba Ara, head of the Niger state emergency service.Villagers rushed to collect fuel from the overturned tanker which suddenly exploded, setting off a massive fire that engulfed them. Tanker explosions are a recurring tragedy in Nigeria, despite repeated warnings about the dangers of collecting spilled fuel. The intense blaze burned many victims beyond recognition, and the injured were taken to a nearby hospital for treatment.The accident occurred near the Essan and Badeggi communities along the Bida-Agaie road in the Katcha Local Government Area of Niger state.The Nigerian truckers risking attackDriver of burning fuel tanker honoured for heroismNiger State Governor Mohammed Umaru Bago sent his condolences to the people, describing the incident as \"worrisome, unfortunate and pathetic\".\"[It] is disheartening how people have continued to approach a fallen tanker to scoop its contents\" despite several awareness campaigns, said a statement by his chief press secretary Bologi Ibrahim.The tanker, carrying petroleum products from Lagos in southern Nigeria to the north, is said to have crashed due to the bad condition of the road.Poor road conditions are a major contributor to road accidents in the country.In October last year, a fuel tanker explosion killed 153 people in Jigawa state, north-west Nigeria.In January this year, a truck carrying about 60,000 litres of petrol overturned near Suleja, also in Niger state, killing at least 86 people and injuring nearly 70 others.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nigeria tanker explosion: Dozens killed scooping fuel in Niger state",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/991d/live/260fb4f0-af0b-11f0-a64c-7f94caf32c3e.jpg"
      ],
      "datePublished": "2025-10-22T11:49:14.000Z",
      "dateModified": "2025-10-22T11:49:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israel's 'yellow line' in Gaza gives Netanyahu room for manoeuvre",
    "url": "https://www.bbc.com/news/articles/cx2y9ny653no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/21b4/live/9bc9bf30-ae8c-11f0-ba75-093eca1ac29b.jpg",
    "tag": "World",
    "date": "2025-10-21T14:47:34.000Z",
    "description": "1 day agoLucy WilliamsonMiddle East Correspondent, JerusalemUnder Donald Trump's peace plan for Gaza, the \"yellow line\" - which Israel withdrew to ear",
    "body": "1 day agoLucy WilliamsonMiddle East Correspondent, JerusalemUnder Donald Trump's peace plan for Gaza, the \"yellow line\" - which Israel withdrew to earlier this month - is the first of three stages of Israeli military withdrawal. It leaves it in control of about 53% of the Gaza Strip.One Israeli newspaper, Yedioth Ahronoth, referred to it as \"effectively the new border\" in Gaza.It's a remark that will please the far-right coalition partners of Prime Minister Benjamin Netanyahu.The fortifications and demarcations Israel is now building along this boundary are meant to clearly divide the territory, but they may also help to blur the differing hopes and expectations of Mr Netanyahu's allies in Washington and at home.How long he can keep both sets of expectations in play depends largely on this next stage of negotiations.The boundary marked by the yellow line is temporary, but further withdrawal of Israeli forces rests on resolving the difficult issues pinned to the second stage of Donald Trump's deal – including the transfer of power in Gaza and the process for disarming Hamas.Washington is keen that nothing upset this next delicate stage of negotiations. US Vice-President JD Vance flew in on Tuesday to push Netanyahu to press on with peace talks. Trump's negotiators Steve Witkoff and Jared Kushner met with the Israeli PM on Monday.Israeli newspapers have been reporting that Netanyahu is receiving a stern message from his American allies to \"show restraint\" and not to endanger the ceasefire.When Israel complained that Hamas had violated the terms of the ceasefire on Sunday, killing two soldiers, the response advocated by Mr Netanyahu's far-right National Security Minister was a one-word demand: \"War\".Instead, Israel carried out an intense, but brief, wave of air strikes, before reinstating the truce, and was careful to emphasise that its troops had been attacked inside the yellow line – keen to show Washington that Israel had not broken the rules.Netanyahu has said the war will not end until Hamas is dismantled – its disarmament, and the full demilitarisation of Gaza, are among the conditions he has set.But Israeli commentators are lining up to say that the real decisions over Israel's military action in Gaza are now being made in Washington.The yellow line – and the daunting task facing negotiators in this second stage of the deal – are clues as to why Netanyahu's coalition partners have chosen to wait, rather than carry out a threat to bring down his government.The dream for many extremist settlers – and ministers – is that the next stage of this process will prove impossible to resolve and the yellow line will indeed become the de facto border, opening the way to new settlements on Gazan land. Some hardliners would like Israel to annex the whole of the Gaza Strip.The vast majority of Israelis want an end to the war and for the remaining bodies of the hostages, and Israel's serving soldiers, to come home.But Israel's prime minister is known as a politician who likes to keep his options as open as possible, for as long as possible, and this is a deal in stages, with caveats built in.Agreeing to this first stage meant withdrawing to positions that left Israel in control of more than half of Gaza, and agreeing to a ceasefire in order to get hostages home.From here, it will become harder to align the goals of his US and domestic allies.Benjamin Netanyahu has repeatedly underlined that violations of the deal by Hamas – including its failure to disarm – would allow Israel to return to war.\"If this is achieved the easy way, so much the better,\" he told the Israeli public earlier this month. \"If not, it will be achieved the hard way.\"Donald Trump has said the same.  But Washington has so far shown a tolerance for delays and violations in implementing the deal on the ground, leaving Netanyahu with far less political room than perhaps he'd like.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israel's 'yellow line' in Gaza gives Netanyahu room for manoeuvre",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/21b4/live/9bc9bf30-ae8c-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-21T14:47:34.000Z",
      "dateModified": "2025-10-21T14:47:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump tariffs: US president repeats claim India will cut Russian oil imports",
    "url": "https://www.bbc.com/news/articles/c364wk4r1j2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/53dd/live/94d17a30-af0c-11f0-a64c-7f94caf32c3e.jpg",
    "tag": "World",
    "date": "2025-10-22T06:13:50.000Z",
    "description": "10 hours agoNikita YadavBBC News, DelhiUS President Donald Trump has reiterated that India has agreed to reduce its purchase of Russian crude.Trump sa",
    "body": "10 hours agoNikita YadavBBC News, DelhiUS President Donald Trump has reiterated that India has agreed to reduce its purchase of Russian crude.Trump said Indian PM Narendra Modi had assured him during a phone call on Tuesday that Delhi \"was not going to buy much oil from Russia\" as he too \"wants to see the war end with Russia-Ukraine\".Modi acknowledged Trump's call and his \"warm greetings\" on the festival of Diwali in a social media post but didn't comment on Russian oil.Trump had made similar remarks last week, but the Indian foreign ministry said at the time said it was \"not aware\" of any phone call between the leaders. On Wednesday, an official at the ministry told the BBC that it had no new comment on Trump's latest remarks.\"I spoke to Prime Minister Modi today, as I mentioned before. And we just have a very good relationship. And he's not going to buy much oil from Russia,\" Trump told reporters during the White House Diwali celebrations on Tuesday. \"He wants to see the war end with Russia-Ukraine. And, as you know, they're not going to be buying too much oil. So they've cut it way back and they're continuing to cut it way back.\" India became one of the biggest markets for Russian oil as Western nations shunned purchases and imposed sanctions on Moscow after the Ukraine war started in 2022. Delhi increased its imports and bought Russian crude at discounted prices, saying the decision was vital to provide energy security to millions of its people. Delhi has also pointed out that many Western nations, including the US, continue to have trade ties with Russia.Cheap oil, high stakes: Can India do without Russia?India casts doubt on Trump's claim Modi will stop buying Russian oilIn recent months, US officials have accused Delhi of helping to fund Russia's war against Ukraine by continuing to buy crude oil, a claim that Delhi denies.The Trump administration has put both public and diplomatic pressure on Delhi to reduce its support for Moscow's energy market, as part of efforts to economically isolate the Kremlin and push for an end to the war in Ukraine. Oil and gas are Russia's largest exports, and Moscow's biggest customers include China, India and Turkey.As part of this pressure, the US has imposed 50% tariffs - including an additional 25% as a penalty for buying Russian oil -  on Indian goods.However, the US president's tone has softened in recent days as trade negotiations between the two countries progress.Last week, an Indian government spokesman said discussions were \"ongoing\" with the US administration which had \"shown interest in deepening energy co-operation with India\".India has been locked in high-stakes trade talks with the US aimed at reaching a long-sought deal in the coming months.Meanwhile, a report in the Mint newspaper suggested that a deal could be announced soon and \"India may agree to gradually reduce its imports of Russian oil\", citing three sources familiar with the matter.The BBC has reached out to India's commerce ministry for a comment. Follow BBC News India on Instagram, YouTube, X and Facebook.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump tariffs: US president repeats claim India will cut Russian oil imports",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/53dd/live/94d17a30-af0c-11f0-a64c-7f94caf32c3e.jpg"
      ],
      "datePublished": "2025-10-22T06:13:50.000Z",
      "dateModified": "2025-10-22T06:13:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Milnerton high school: Eight pupils suspended over South Africa bullying video",
    "url": "https://www.bbc.com/news/articles/cq6zyq9vggno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0615/live/043b5160-af31-11f0-b1c6-736a05ed5483.jpg",
    "tag": "World",
    "date": "2025-10-22T13:30:39.000Z",
    "description": "3 hours agoKhanyisile NgcoboJohannesburgSouth African authorities have suspended eight pupils linked to a case of alleged bullying that has caused nat",
    "body": "3 hours agoKhanyisile NgcoboJohannesburgSouth African authorities have suspended eight pupils linked to a case of alleged bullying that has caused national outrage.A video showing a horrific assault at Milnerton high school in Cape Town last week has been widely shared on social media.Several boys are seen repeatedly hitting a fellow pupil with various objects, including a hockey stick, hose pipe and belt. According to reports, the boy was one of nine allegedly assaulted.Angry parents gathered outside the school on Wednesday in protest and were dispersed by police firing tear gas.They were joined by members of political parties who announced planned demonstrations at the school.Bullying in schools is a significant problem in South Africa, with videos depicting the violent attacks often going viral. This latest clip is among the most horrific to emerge in recent years.The mother of the 16-year-old boy being attacked in the video told local online publication, News24, that her son had had cancer and had completed his chemotherapy earlier this year.\"My child had just beaten cancer [only] for something like this to happen to him,\" she is quoted as saying.The teen's uncle later told local broadcaster eNCA that the boy had since been removed from the school.Various organisations have also condemned the incident, which took place on 16 October, while the police have confirmed that an assault case has been opened.Among those to speak out was Amnesty International South Africa, which said the video was \"deeply disturbing\" and called for \"timely disciplinary action\".The video, which is just over two minutes long, shows the boy pleading with his attackers to stop hitting him. While he makes this impassioned plea, one of the boys hits him again with a belt, eliciting laughter from some of the others. Some of the boys are also seen making funny faces and cheering the boy's attackers as the camera pans across the room.\"No child should ever endure such brutality in a space where [pupils] should be safe and protected from harm,\" the international human rights organisation said in a post on X.South Africa's education ministry said it had been in contact with the Western Cape education department, which has oversight over the school, and confirmed that the suspended pupils would face disciplinary action.The provincial department said it was \"treating the matter with the seriousness it warrants\".Both bodies have urged the public not to share the video of the assault or details of those involved, saying that this \"not only exacerbates the trauma experienced by the victim but also undermines the rights and dignity of all the [pupils] involved\".The chairperson of parliament's education committee also shared her \"utter horror and deep concern\" over the video.Joy Maimela said that the incident \"is not merely bullying but borders on assault – a criminal offence that demands urgent and decisive action from all relevant authorities\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Milnerton high school: Eight pupils suspended over South Africa bullying video",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0615/live/043b5160-af31-11f0-b1c6-736a05ed5483.jpg"
      ],
      "datePublished": "2025-10-22T13:30:39.000Z",
      "dateModified": "2025-10-22T13:30:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Europe's leaders back Trump call for frontline freeze but Russia says no",
    "url": "https://www.bbc.com/news/articles/c0exgnwl092o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/39ac/live/3242cfb0-ae88-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-10-21T14:21:52.000Z",
    "description": "European leaders have joined Ukraine's Volodymyr Zelensky in insisting that any talks on ending the war in Ukraine should start with freezing the curr",
    "body": "European leaders have joined Ukraine's Volodymyr Zelensky in insisting that any talks on ending the war in Ukraine should start with freezing the current front line, and warned that Russia is not serious about peace.In a statement signed by 11 leaders including UK Prime Minister Keir Starmer, they said they \"strongly support\" US President Donald Trump's position that \"the fighting should stop immediately, and that the current line of contact should be the starting point of negotiations\".But Russian Foreign Minister Sergei Lavrov on Tuesday dismissed the idea of halting the conflict at the current contact line.Moscow was only interested in \"long-term, sustainable peace\", Lavrov said, implying that freezing the front line would only amount to a temporary ceasefire.The European statement referred to \"Russia's stalling tactics\", indicating how intractable Moscow's position remained.Trump, who has often adopted a conciliatory tone towards Russia, is now planning direct talks with Putin in Budapest - although the date for a preparatory meeting between US Secretary of State Marco Rubio and Lavrov seems to be slipping. The US president spoke by phone to Putin last week, a day before meeting Zelensky and his team in the White House.Several sources have told Western media that Trump pushed the Ukrainian leader to give up large areas of territory in the eastern regions of Donetsk and Luhansk, known as the Donbas, as part of a deal with Russia.Some reports suggested there had been a \"shouting match\". Zelensky only described the talks as \"frank\".The Ukrainian president has often ruled out withdrawing from the region, arguing that Russia could use it as a springboard for future attacks. \"I explained during my visit to Washington last week that Ukraine's position has not changed,\" he said on Monday.Although Russia has occupied most of Luhansk, Ukraine remains in control of about a quarter of Donetsk, including the key cities of Slovyansk and Kramatorsk.Trump, who later denied ever insisting that Zelensky surrender the Donbas, has since embraced the idea of a ceasefire on the current frontlines.\"Let it be cut the way it is,\" he said on Monday, referring to the contested region. \"It's cut up right now. I think 78% of the land is already taken by Russia... I said: cut and stop at the battle line. Go home. Stop fighting, stop killing people.\"But Moscow continues to dismiss talk of a front line freeze.Kremlin spokesperson Dmitry Peskov said the idea had been put to the Russians repeatedly but that \"the consistency of Russia's position doesn't change\" – referring to Moscow's insistence on the complete withdrawal of Ukrainian troops from the embattled eastern regions.Foreign Minister Sergei Lavrov repeated much the same lines on Tuesday.The \"root causes of the conflict\" needed to be addressed, Lavrov said, using Kremlin shorthand for a series of maximalist demands that include the recognition of full Russian sovereignty over the Donbas as well as the demilitarisation of Ukraine – a non-starter for Kyiv and its European partners.The Kremlin has played down expectations of an imminent meeting between Putin and Trump. \"We cannot postpone what has not been finalised,\" Peskov said.Lavrov and US Secretary of State Marco Rubio were meant to meet this week to organise the summit, but no timings have yet been given.A potential meeting between Trump and Putin in Hungary would require at least one EU country to open its air space to the Russian leader's plane. Putin is subject to an international arrest warrant for war crimes, and Poland and Lithuania have already signalled they would execute it if he were to travel through their countries.Another route into Budapest for Putin would be through Bulgarian airspace. Foreign Minister Georg Georgiev hinted Bulgaria would be willing to let the plane through.\"When efforts are made for peace, it is only logical that all sides contribute to making such a meeting possible,\" he said.Trump and Putin last met in Alaska in August during a hastily organised summit which yielded few results apart from bringing to an end Putin's status as a pariah of the West.For some time after the talks, Trump put forward the idea of organising a Putin-Zelensky bilateral summit.But Russia said such a meeting was contingent on the \"root causes\" of the war being addressed first, and the idea was eventually quietly shelved by all parties.Since starting his second term in office Trump has lamented that the Russian-Ukrainian war, now in its fourth year, is \"difficult\" to solve.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Europe's leaders back Trump call for frontline freeze but Russia says no",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/39ac/live/3242cfb0-ae88-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-21T14:21:52.000Z",
      "dateModified": "2025-10-21T14:21:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ukrainian children killed in Russian strikes, hours after Trump-Putin talks shelved",
    "url": "https://www.bbc.com/news/articles/czjpe0193geo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6299/live/4f762c70-af29-11f0-b9f9-e5c1839c872f.jpg",
    "tag": "World",
    "date": "2025-10-22T10:37:25.000Z",
    "description": "6 hours agoPaul Kirby,Europe digital editor and John Sudworth,KyivDSNS UkraineA man was reported killed and children wounded in an attack on a kinderg",
    "body": "6 hours agoPaul Kirby,Europe digital editor and John Sudworth,KyivDSNS UkraineA man was reported killed and children wounded in an attack on a kindergarten in KharkivAt least seven people have been killed including two children during intense Russian drone and missile strikes on Ukraine, officials say.A kindergarten was hit in Ukraine's second biggest city Kharkiv and there was widespread damage in Kyiv. Children were among the 27 people wounded.Hours earlier, US President Donald Trump said his plans for an imminent summit in Budapest with Russia's Vladimir Putin had been shelved as he did not want a \"wasted meeting\".President Volodymyr Zelensky said the attacks proved Moscow had not come under enough pressure for its continued war.The Kremlin has rejected calls for a ceasefire along the current front lines made both by Trump and European leaders.However, Russian officials said on Wednesday that preparation for a Trump-Putin summit was continuing, disputing the US president's assessment that it had been put on hold.Kremlin spokesman Dmitry Peskov said a date had yet to be agreed upon and careful preparation was needed. He said a summit was \"the mutual desire of both presidents\" and most of the \"gossip and rumours\" surrounding it were untrue. Ukraine's president arrived in Norway on Wednesday at the start of a European trip, days after talks with Trump in Washington last Friday, when he failed to persuade the US president to provide long-range Tomahawk missiles.Zelensky told reporters in Oslo that Trump's proposal to freeze the front line was a \"good compromise, but I'm not sure that Putin will support it and I said it to the president\".The Ukrainian leader has directly linked the shelving of the planned Trump-Putin summit to his request for US Tomahawks: \"As soon as the issue of long-range missiles became a little further away for us, for Ukraine, then almost automatically Russia became less interested in diplomacy.\"Russia's drone and missile bombardment came shortly after Ukraine's military said it had attacked a Russian chemical plant in the Bryansk border region late on Tuesday with UK-supplied Storm Shadow missiles.Calling the strike \"a successful hit\" that penetrated the Russian air defence system, military officials said the Bryansk plant \"produces gunpowder, explosives and rocket fuel components used in ammunition and missiles employed by the enemy to shell the territory of Ukraine\".DSNS UkraineA woman and two children were killed when their house was set alight in the village of PohrebyRussia launched a full-scale invasion of Ukraine in February 2022, and its attacks on the Ukrainian capital overnight were the first such strikes for almost two weeks.A couple in their 60s were killed when a drone hit their high-rise building in the city, and four people were killed in the wider Kyiv region. Among the victims were a 36-year-old woman, a six-month-old baby and a girl, aged 12, when a Russian strike set fire to their house in the village of Pohreby, just to the north of the capital. A man in a nearby village later died of his injuries.Officials in Kharkiv said later that a 40-year-old man was killed and seven other people were hurt in a drone strike on a kindergarten. Children were among the six people wounded, and dozens more were evacuated, they added.Ukraine's air force said Russia had sent 405 drones and 28 missiles, 15 of which were ballistic.The capital was under a ballistic missile warning for most of the night, and echoed to the sound of explosions. By morning rescue teams fought fires in residential buildings.Across Ukraine, Russian attacks once again targeted energy infrastructure and emergency power outages were imposed in several areas.One MP in Kyiv, Inna Sovsun, told the BBC's Newsday programme that the air raids had lasted throughout the night and were definitely an attack on the power supply: \"for the majority like myself it means we don't have electricity and we don't have water.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ukrainian children killed in Russian strikes, hours after Trump-Putin talks shelved",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6299/live/4f762c70-af29-11f0-b9f9-e5c1839c872f.jpg"
      ],
      "datePublished": "2025-10-22T10:37:25.000Z",
      "dateModified": "2025-10-22T10:37:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What we learned from Virginia Giuffre's memoir",
    "url": "https://www.bbc.com/news/articles/c5ylepx85nxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/23c3/live/6a6a6f00-ada3-11f0-b0cb-ebfbdbe55f66.jpg",
    "tag": "World",
    "date": "2025-10-20T15:50:04.000Z",
    "description": "2 days agoNoor NanjiCulture reporterGetty ImagesMuch of Virginia Giuffre's story has been heard before but in her memoir, published posthumously, the ",
    "body": "2 days agoNoor NanjiCulture reporterGetty ImagesMuch of Virginia Giuffre's story has been heard before but in her memoir, published posthumously, the abuse is described in appalling detail.Two days ahead of the book's official publication, the BBC got hold of a copy.There are revelations about Ms Giuffre's encounters with convicted sex offender Jeffrey Epstein and his former girlfriend Ghislaine Maxwell - as well as more details of her allegations about Prince Andrew, which he has always denied.Here's what we learned from the 367-page-long book.Prince Andrew allegations - and an 'orgy'In the memoir, Ms Giuffre says she had sex with Prince Andrew on three separate occasions.The third time, she says, was on Epstein's island as part of what Ms Giuffre called \"an orgy\".\"Epstein, Andy, and approximately eight other young girls and I had sex together,\" she says.\"The other girls all appeared to be under the age of 18 and didn't really speak English. Epstein laughed about how they couldn't really communicate, saying they are the easiest girls to get along with.\"She later recalls seeing the photo of Epstein walking in New York's central park with Prince Andrew, published in newspapers around the world in 2011.\"I was of course revolted to see two of my abusers together, out for a stroll,\" she writes.\"But mostly I was amazed that a member of the Royal Family would be stupid enough to appear in public with Epstein\".Prince Andrew, who reached a financial settlement with Ms Giuffre in 2022, has repeatedly denied any wrongdoing. In 2019, he told BBC Newsnight he did not remember meeting Ms Giuffre \"at all\", and that they \"never had any sort of sexual contact.\"News Syndication'Epstein told me I'd had a miscarriage'Shortly after the alleged \"orgy\" Ms Giuffre says she \"wasn't in great shape\", and had irregular bleeding and a tenderness in her abdomen.She says Epstein took her to a hospital, where she remembers being taken to an examination room. However, she says she is unclear what happened next due to pain medication affecting her memory.Soon after, she writes, one of the other girls in Epstein's house suggested to her that an incision mark near her belly button could mean she had surgery for an ectopic pregnancy.\"But Epstein told me I'd suffered a miscarriage, which is altogether something different,\" Ms Giuffre says.\"Epstein never wore a condom. Neither did the men he and Maxwell trafficked me to.\"Memories of Epstein 'torture' GiuffreAt the centre of the abuse was the late Epstein and his former girlfriend Maxwell, who is currently serving a 20-year sentence on sex-trafficking charges.Ms Giuffre says that even after many years, the memories of what Epstein put her through \"torture\" her - and says she she feared she might \"die a sex slave\" at the hands of Epstein and his circle.The memoir includes shocking descriptions of sadomasochistic sex.She says Epstein developed an interest in it over time, and began to \"experiment with whips and restraints and other instruments of torture\".\"In session after session, he would play out various fantasies, with me as the victim,\" she writes.She says the chains and contraptions he used on her \"caused so much pain that I prayed I would black out\". But she adds: \"When I did, I'd awaken to more abuse\".Ms Giuffre also details the physical effects such abuse had on her body, with dark circles under her eyes and her ribs visible beneath her skin.Rather than offering any care, Epstein was \"disgusted\" at her appearance, she says.\"'You're not the same girl you were,' Epstein said coldly. 'You need to clean yourself up',\" she writes in the book.Maxwell's part in the abuseMs Giuffre goes into detail about how she first met Maxwell, and how she introduced her to Epstein.She says Maxwell turned up at the Mar-a-Lago spa, where a teenage Ms Giuffre was working.\"She looks to be in her late thirties, and her British accent reminds me of Mary Poppins,\" Ms Giuffre recalls.She says Maxwell asked her to come for a job interview as a masseuse.When she arrived at the house, Ms Giuffre says she was taken to a room where Epstein was completely naked on a massage table. \"Just do what I do,\" she says Maxwell told her.Ms Giuffre says she started giving Epstein a massage. She says Maxwell then took her clothes off, and undressed Ms Giuffre, and they sexually abused her.\"The disappointment was excruciating. I blamed myself. 'Is sex all anyone will ever want from me',\" she writes.She later describes how Maxwell facilitated the introduction to Prince Andrew in March 2001.She writes that Maxwell woke her up and told her it was going to be a \"special day\" - that \"just like Cinderella\" she was going to meet a \"handsome prince\".Ms Giuffre later writes that even decades later, she remembers how much she feared both Epstein and Maxwell.Disappointment at Epstein's deathOne of the other themes running through the book is Ms Giuffre's desire for accountability.Epstein was convicted in Florida in 2008 for soliciting prostitution from a person under the age of 18. He died in 2019 while awaiting trial on sex trafficking charges.Ms Giuffre describes feeling disappointed at his death. \"This wasn't how justice was supposed to work out,\" she says.On Prince Andrew, she recalls standing outside a courtroom and telling journalists: \"He knows exactly what he's done… and I hope he comes clean about it.\"She later writes that she hopes the royal - who has always denied wrongdoing - will be \"held to account\".The most powerful words are perhaps saved for the ending of the book.\"In my mind, I hold a picture of a girl reaching out for help and easily finding it,\" Ms Giuffre writes.\"I picture a woman, too, who - having come to terms with her childhood pain - feels that it's within her power to take action against those who hurt her.\"If this book moves us even an inch closer to a reality like that - if it helps just one person - I will have achieved my goal.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What we learned from Virginia Giuffre's memoir",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/23c3/live/6a6a6f00-ada3-11f0-b0cb-ebfbdbe55f66.jpg"
      ],
      "datePublished": "2025-10-20T15:50:04.000Z",
      "dateModified": "2025-10-20T15:50:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says he did not want 'wasted meeting' after plan for Putin talks shelved",
    "url": "https://www.bbc.com/news/articles/c4gjp73gp41o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8352/live/ea8348d0-aec8-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-10-21T21:57:30.000Z",
    "description": "18 hours agoLaura GozziWatch: \"I don't want to have a wasted meeting\", says Trump on talks with PutinDonald Trump has said he did not want a \"wasted m",
    "body": "18 hours agoLaura GozziWatch: \"I don't want to have a wasted meeting\", says Trump on talks with PutinDonald Trump has said he did not want a \"wasted meeting\" after a plan to have face-to-face talks with his Russian counterpart Vladimir Putin about the war in Ukraine were put on hold.The US president indicated that a key sticking point remained Moscow's refusal to cease fighting along the current front line, in remarks at the White House on Tuesday.Earlier, a White House official had said there were \"no plans\" for a Trump-Putin meeting \"in the immediate future\", after Trump said on Thursday that the two would hold talks in Budapest within two weeks.Key differences between US and Russian proposals for peace became increasingly clear this week, appearing to have dashed chances of a summit.Trump and Putin last met in Alaska in August, during a hastily organised summit which yielded no concrete results.The White House decision to shelve plans for a second Trump-Putin meeting may be seen as an attempt to avoid another similar scenario.\"I guess the Russians wanted too much and it became evident for the Americans that there will be no deal for Trump in Budapest,\" a senior European diplomat told Reuters.A preparatory meeting between US Secretary of State Marco Rubio and Russian Foreign Minister Sergei Lavrov was due to be held this week - but the White House said the two had had a \"productive\" call and that a meeting was no longer \"necessary\".On Monday, Trump embraced a ceasefire proposal backed by Kyiv and European leaders to freeze the conflict on the current front line.\"Let it be cut the way it is,\" he said. \"I said: cut and stop at the battle line. Go home. Stop fighting, stop killing people.\"Russia has repeatedly pushed back against freezing the current line of contact.Kremlin spokesperson Dmitry Peskov said the idea had been put to the Russians repeatedly but that \"the consistency of Russia's position doesn't change\" – referring to Moscow's insistence on the complete withdrawal of Ukrainian troops from the embattled eastern regions.Moscow was only interested in \"long-term, sustainable peace\", Sergei Lavrov said on Tuesday, implying that freezing the front line would only amount to a temporary ceasefire.The \"root causes of the conflict\" needed to be addressed, Lavrov said, using Kremlin shorthand for a series of maximalist demands that include the recognition of full Russian sovereignty over the Donbas as well as the demilitarisation of Ukraine – a non-starter for Kyiv and its European partners.European leaders released a statement with Zelensky earlier on Tuesday saying that any talks on ending the war in Ukraine should start with freezing the current front line and accused Russia of not being \"serious\" about peace.Zelensky said discussions about the front line were the \"beginning of diplomacy\",  which Russia was doing everything to avoid.The only topic that could make Moscow \"pay attention\" was the supply of long-range weapons to Ukraine, he added.Trump had discussed a summit in the Hungarian capital over the phone with Putin, a day before meeting Ukrainian President Volodymyr Zelensky at the White House.Some reports suggested those talks had been a \"shouting match\", with sources suggesting Trump had pushed Zelensky to give up large areas of territory in the eastern regions of Donetsk and Luhansk, known collectively as the Donbas, as part of a deal with Russia.However, Zelensky has always said Ukraine cannot relinquish the parts of the Donbas it still holds, on the grounds that Russia could later use the area as a springboard for further attacks.Putin's unscheduled call with Trump last Thursday came following speculation that the US was preparing to send long-range Tomahawk missiles to Kyiv that could potentially strike deep into Russia.Zelensky said it was the Tomahawks issue that had forced Russia to engage in discussion. Despite coming away from the White House empty-handed, he added that the talk about the missiles had turned out to be a \"strong investment in diplomacy\".Follow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weekly US Politics Unspun newsletter. Readers in the UK can sign up here. Those outside the UK can sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says he did not want 'wasted meeting' after plan for Putin talks shelved",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8352/live/ea8348d0-aec8-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-21T21:57:30.000Z",
      "dateModified": "2025-10-21T21:57:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why Trump made breakthrough in Gaza but can’t with Putin over Ukraine",
    "url": "https://www.bbc.com/news/articles/cx2y9je4d3go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f3db/live/a6e69830-af2b-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "World",
    "date": "2025-10-21T23:57:52.000Z",
    "description": "16 hours agoAnthony ZurcherNorth America correspondentEPATrump and Putin's planned talks on the near four-year war in Ukraine have been put on holdRep",
    "body": "16 hours agoAnthony ZurcherNorth America correspondentEPATrump and Putin's planned talks on the near four-year war in Ukraine have been put on holdReports of an impending US-Russia leadership summit have been greatly exaggerated, it seems.Just days after US President Donald Trump said he planned to meet Russian President Vladimir Putin in Budapest - \"within two weeks or so\" - the summit has been suspended indefinitely.A preliminary get-together by the two nations' top diplomats has been cancelled, too.\"I don't want to have a wasted meeting,\" President Trump told reporters at the White House on Tuesday afternoon. \"I don't want to have a waste of time, so I'll see what happens.\"Trump says he did not want 'wasted meeting' after plan for Putin talks shelvedDisappointment in Kyiv as Zelensky leaves White House empty-handedThe on-again, off-again summit is just the latest twist in Trump's efforts to broker an end to war in Ukraine – a subject of renewed focus for the US president after he arranged a ceasefire and hostage release deal in Gaza.While making remarks in Egypt last week to celebrate that ceasefire agreement, Trump turned to Steve Witkoff, his lead diplomatic negotiator, with a new request.\"We have to get Russia done,\" he said.However, the circumstances that aligned to make a Gaza breakthrough possible for Witkoff and his team may be difficult to replicate in a Ukraine war that has been raging for nearing four years.Less leverage According to Witkoff, the key to unlocking a deal was Israel's decision to attack Hamas negotiators in Qatar. It was a move that infuriated America's Arab allies but gave Trump leverage to pressure Israeli Prime Minister Benjamin Netanyahu into making a deal.Trump benefited from a long record of siding with Israel dating back to his first term in office, including his decision to move the US embassy to Jerusalem, to change America's position on the legality of Israeli settlements in the West Bank and, more recently, his support for Israel's military campaign against Iran.The US president, in fact, is more popular among Israelis than Netanyahu – a position that gave him unique influence over the Israeli leader.Add in Trump's political and economic ties to key Arab players in the region, and he had a wealth of diplomatic muscle to force an agreement.In the Ukraine war, by contrast, Trump has much less leverage. Over the past nine months, he has swung between attempts to strong-arm Putin and then Zelensky, all with little seeming effect.Trump has threatened to impose new sanctions on Russian energy exports and to provide Ukraine with new long-range weapons. But he has also recognised that doing so could disrupt the global economy and further escalate the war.Meanwhile, the president has publicly berated Zelensky, temporarily cutting off intelligence-sharing with Ukraine and suspending arms shipments to the country - only to then back off in the face of concerned European allies who warn a Ukrainian collapse could destabilise the entire region.Trump loves to tout his ability to sit down and hammer out deals, but his face-to-face meetings with both Putin and Zelensky haven't seemed to move the war any closer to a resolution.Getty ImagesTrump and Putin's meeting in August yielded no concrete resultsPutin may actually be using Trump's desire for a deal – and belief in in-person deal-making - as a means of influencing him. In July, Putin agreed to a summit in Alaska just as it appeared likely that Trump would sign off on congressional sanctions package backed by Senate Republicans. That legislation was subsequently put on hold.Last week, as reports spread that the White House was seriously contemplating shipping Tomahawk cruise missiles and Patriot anti-air batteries to Kyiv, the Russian leader called Trump who then touted the possible summit in Budapest.The next day, Trump hosted Zelensky at the White House, but left empty-handed after a reportedly tense meeting.Trump insisted that he was not being played by Putin.\"You know, I've been played all my life by the best of them, and I came out really well,\" he said.But the Ukrainian leader later made note of the sequence of events. \"As soon as the issue of long-range mobility became a little further away for us – for Ukraine – Russia almost automatically became less interested in diplomacy,\" he said.So, in a matter of days, Trump has bounced from entertaining the prospect of sending missiles to Ukraine to planning a Budapest summit with Putin and privately pressuring Zelensky to cede all of Donbas – including territory Russia has been unable to conquer.He has finally settled on calling for a ceasefire along current battle lines – something Russia has refused to accept.On the campaign trail last year, Trump promised that he could end the Ukraine war in a matter of hours. He has since abandoned that pledge, saying that ending the war is proving harder than he expected.It has been a rare acknowledgement of the limits of his power – and the difficulty of finding a framework for peace when neither side wants, or can afford to, give up the fight.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why Trump made breakthrough in Gaza but can’t with Putin over Ukraine",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f3db/live/a6e69830-af2b-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-21T23:57:52.000Z",
      "dateModified": "2025-10-21T23:57:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]