[
  {
    "title": "Invasion Day: Man charged with terrorism over attack on Perth rally",
    "url": "https://www.bbc.com/news/articles/cr4kgwy3nvvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ebb2/live/edc1da20-025b-11f1-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-05T06:31:13.000Z",
    "description": "Man charged with terrorism over attack targeting Aboriginal Australians at protest2 hours agoHelen LivingstoneSydneyCason Ho/ABC NewsA 31-year-old man",
    "body": "Man charged with terrorism over attack targeting Aboriginal Australians at protest2 hours agoHelen LivingstoneSydneyCason Ho/ABC NewsA 31-year-old man has been charged with a terrorist offence after throwing a homemade bomb at an Aboriginal protest in Perth.A man has been charged with terrorism after he allegedly threw an explosive device at a crowd protesting the celebration of Australia Day in Perth last month.The 31-year-old man was detained after hurling a homemade bomb into a throng of around 2,500 people who had gathered in support of the Aboriginal community. The device, which was filled with ball bearings and screws, failed to explode, but authorities said it could have turned into a \"mass casualty event\".Australia Day - a national holiday on 26 January - marks the 1788 landing of Britain's First Fleet in Sydney Cove and the start of colonisation. For many Indigenous Australians and their supporters, it is known as Invasion Day.Police had already charged the man - whose identity has been suppressed by the courts for his safety - with committing an unlawful act with intent to harm and one count of making or possessing explosives under suspicious circumstances.West Australian Premier Roger Cook on Thursday told reporters it is alleged \"the attack on Aboriginal people and other peaceful protesters was motivated by hateful, racist ideology\".\"Thankfully [the device] did not detonate but for that we could have seen a mass casualty event with injuries and potential loss of life,\" Cook said.The fresh charge - which carries a maximum penalty of life imprisonment - is the first time terrorism charges have been laid in the state, police say.\"I know this event has impacted people Australia-wide and it is deeply felt by our Indigenous communities,\" Cook said. \"I know that there is anger. We have every right to be angry.\"West Australian Police Commissioner Col Blanch said the bomb had a fuse which had been lit, adding: \"It should have gone off.\"He said police had no prior intelligence of the attack, and that the man was \"self-radicalised\" and acted alone. During their investigation, detectives had found evidence the man had accessed \"pro-white male, pro-white material online\", he allegedAustralian Federal Police (AFP) Commissioner Krissy Barrett told reporters federal police and Asio, Australia's domestic intelligence agency, had been called into the investigation 36 minutes after the device was thrown and worked around the clock to establish whether there was any ongoing threat. The man, who is remanded in custody, is next due to appear in Perth Magistrates Court on 17 February. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Invasion Day: Man charged with terrorism over attack on Perth rally",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ebb2/live/edc1da20-025b-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-05T06:31:13.000Z",
      "dateModified": "2026-02-05T06:31:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US must be prudent when supplying arms to Taiwan, Xi tells Trump",
    "url": "https://www.bbc.com/news/articles/c62wpjd3j1zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/afe4/live/494b2a50-022e-11f1-8566-473996904d56.jpg",
    "tag": "World",
    "date": "2026-02-05T01:15:14.000Z",
    "description": "7 hours agoKelly NgReutersTrump and Xi last met in October, on the sidelines of the Asia-Pacific Economic Cooperation in South KoreaChina's leader Xi ",
    "body": "7 hours agoKelly NgReutersTrump and Xi last met in October, on the sidelines of the Asia-Pacific Economic Cooperation in South KoreaChina's leader Xi Jinping called Taiwan \"the most important issue\" in China-US relations during a phone call with US President Donald Trump  on Wednesday. Xi had told Trump to be \"prudent\" when supplying weapons to the island, state media reported, adding that he \"attaches great importance\" to ties with Washington and hoped both sides will find ways to resolve their differences.Trump cast the call as \"excellent\" and \"long and thorough\".Wednesday's call follows a flurry of visits by Western leaders, including UK's Keir Starmer, to China in recent months, hoping to reset relations with the world's second-largest economy.Trump himself is due to visit China in April, a trip he says he \"very much looks forward to\". He added that Beijing is considering buying 20 million tonnes of US soybeans, up from the current 12 million tonnes.\"The relationship with China, and my personal relationship with President Xi, is an extremely good one, and we both realize how important it is to keep it that way,\" he wrote in a Truth Social post. The two leaders last spoke over the phone in November about a range of issues including trade, Russia's invasion of Ukraine, fentanyl and Taiwan, according to Trump and China's foreign ministry.Apart from Taiwan and soybeans, Trump and Xi also discussed Russia's war in Ukraine, the current situation in Iran, and China's purchase of oil and gas from the US in the call on Wednesday, the US president wrote.On Taiwan, Xi said the self-governed island was \"China's territory\" and that Beijing \"must safeguard [Taiwan's] sovereignty and territorial integrity\".\"The United States must handle the issue of arms sales to Taiwan with prudence,\" he warned, according to the state's Xinhua news agency.China has long vowed to \"reunify\" with Taiwan and has not ruled out the use of force to do so.The US has formal ties with Beijing rather than Taiwan, and has walked a tight diplomatic rope for decades. But it remains a powerful ally of Taiwan's and is the island's biggest arms supplier.In December, the Trump administration announced a huge arms sale worth around $11bn (£8.2bn) to Taiwan, which included advanced rocket launchers, self-propelled howitzers and a variety of missiles.Beijing said at the time that this \"attempt to support [Taiwan's] independence\" would only \"accelerate the push towards a dangerous and violent situation across the Taiwan Strait\".\"Just as the United States has its concerns, China for its part also has concerns,\" Xi told Trump on Wednesday.\"If the two sides work in the same direction in the spirit of equality, respect and mutual benefit, we can surely find ways to address each other's concerns,\" he said.Hours before his call with Trump, Xi held a virtual meeting with Russia's leader Vladimir Putin, in which both hailed the strengthening of ties between Beijing and Moscow.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US must be prudent when supplying arms to Taiwan, Xi tells Trump",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/afe4/live/494b2a50-022e-11f1-8566-473996904d56.jpg"
      ],
      "datePublished": "2026-02-05T01:15:14.000Z",
      "dateModified": "2026-02-05T01:15:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gus Lamont: Suspect identified in disappearance of four-year-old in Australian outback",
    "url": "https://www.bbc.com/news/articles/c368g5l33xzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7852/live/fc6e81b0-aaf7-11f0-af50-73683b2b8713.png",
    "tag": "World",
    "date": "2026-02-05T06:42:41.000Z",
    "description": "2 hours agoLana LamSydneySouth Australia PoliceGus was last seen playing outside his house on the family's remote sheep stationPolice say a suspect ha",
    "body": "2 hours agoLana LamSydneySouth Australia PoliceGus was last seen playing outside his house on the family's remote sheep stationPolice say a suspect has been identified over the disappearance of a four-year-old boy who went missing in the South Australian outback. Gus Lamont was last seen playing outside his home on a remote sheep station near Yunta, about 300km (186 miles) from Adelaide, on 27 September.His grandmother left him alone for about half an hour before checking on him, only to find the boy missing, prompting one of the largest land and air searches in the state's history.Police said a person who lives on the property has been identified as a suspect but confirmed the boy's parents were not under investigation.In the days and weeks after the boy was reported missing, police conducted extensive searches, covering about 470 sq km - an area roughly twice the size of Edinburgh - around his home, the Oak Park station homestead.In late October, police wound down efforts and appointed a 12-member taskforce to continue the investigation.That taskforce sifted through previous statements given by family members which \"identified a number of inconsistencies and discrepancies\" of the timeline around the boy's disappearance.\"As a result of these inconsistencies, and investigations into them, a person who resides at Oak Park station has withdrawn their support for the police and is no longer cooperating with us,\" Detective Superintendent Darren Fielke said.\"I do want to stress, however, that Gus' parents are not suspects in his disappearance.\"Police conducted a search of the property in January and seized a number of items including a vehicle, motorcycle and some electronic devices. Investigators said they had initially considered three possible scenarios - the boy walked off,  he was abducted, or someone known to Gus was involved in his disappearance and suspected death.Given the remote location of the property, police ruled out abduction and there was no evidence to suggest Gus had \"merely wandered off\". \"What I can say, however, is that we'll continue to thoroughly and meticulously investigate the disappearance of Gus until we get an outcome,\" Fielke said.\"We're all focused and determined to locate Gus and return him to his parents. Nothing is off the table as we work towards that outcome.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gus Lamont: Suspect identified in disappearance of four-year-old in Australian outback",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7852/live/fc6e81b0-aaf7-11f0-af50-73683b2b8713.png"
      ],
      "datePublished": "2026-02-05T06:42:41.000Z",
      "dateModified": "2026-02-05T06:42:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ryan Routh sentenced to life in prison for 2024 attempt on Trump's life",
    "url": "https://www.bbc.com/news/articles/cre2gjj3pxpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0402/live/e7604a00-01e2-11f1-88cc-958b71e0ce18.jpg",
    "tag": "World",
    "date": "2026-02-04T17:57:05.000Z",
    "description": "15 hours agoBernd Debusmann Jrat the White HouseGetty ImagesRyan Routh was taken into custody shortly after being fired upon by a Secret Service agent",
    "body": "15 hours agoBernd Debusmann Jrat the White HouseGetty ImagesRyan Routh was taken into custody shortly after being fired upon by a Secret Service agent during the incident in West Palm Beach, Florida. Ryan Routh has been sentenced to life in prison for attempting to assassinate President Donald Trump on a Florida golf course in September of 2024. Routh, 59, was found guilty last year of trying to kill Trump, then still a presidential candidate, at the Trump International Golf Club in West Palm Beach. A US Secret Service agent in the area spotted a rifle barrel poking out of the bushes and fired at Routh, who then fled the scene. He was arrested nearby. In a sentencing memorandum, Judge Aileen Cannon said Routh's crimes \"undeniably warrant a life sentence\".\"[H]e took steps over the course of months to assassinate a major Presidential candidate, demonstrated the will to kill anybody in the way, and has since expressed neither regret nor remorse to his victims,\" she wrote. Routh's lawyer, Martin Ross, said they would be appealing the case. Routh pleaded not guilty and elected to represent himself during the trial, which began on 8 September. A native of North Carolina who lived in Hawaii prior to his arrest, Routh repeatedly acted erratically during the court proceedings, including challenging Trump to a game of golf and making references to Adolf Hitler and Russian President Vladimir Putin. After a jury found him guilty, Routh attempted to stab himself in the neck with a pen before US marshals quickly escorted him out of the courtroom. While Routh is not believed to have had a clear line of sight to Trump at any point during the incident, federal agents told jurors they later recovered a semiautomatic rifle with a scope and an extended magazine in the spot where he had been hiding. Additionally, jurors were told that Routh left behind a list of places where Trump was likely to appear, as well as a note for a friend which described the incident as \"an assassination attempt\". In his closing statement during the trial, Routh spoke in the third person and touched on a wide variety of unrelated topics, including US history, the Russia-Ukraine war and his intention to buy a boat - prompting the judge to repeatedly interrupt him and send the jury away. The lead prosecutor in the case, John Shipley, said that a \"mountain of evidence\" was presented which points to \"how close he got to actually pulling this off\". The incident in Florida was the second attempt on Trump's life in 2024, after a gunman opened fire at a campaign rally in Butler, Pennsylvania, in July. That shooting left one person dead and several wounded, including Trump. The shooter, later identified as 20-year-old Thomas Crooks, was killed by officers at the scene. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ryan Routh sentenced to life in prison for 2024 attempt on Trump's life",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0402/live/e7604a00-01e2-11f1-88cc-958b71e0ce18.jpg"
      ],
      "datePublished": "2026-02-04T17:57:05.000Z",
      "dateModified": "2026-02-04T17:57:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Robbie Williams: social media would have 'seen me off' in the 90s",
    "url": "https://www.bbc.com/news/articles/c0jv0j3wpgwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/699a/live/3106b250-01ef-11f1-bb50-17f4fe9ab2e3.jpg",
    "tag": "World",
    "date": "2026-02-05T00:24:57.000Z",
    "description": "Robbie Williams: British people are good at devaluing ourselves8 hours agoCharlotte GallagherGetty ImagesAfter more than three decades in entertainmen",
    "body": "Robbie Williams: British people are good at devaluing ourselves8 hours agoCharlotte GallagherGetty ImagesAfter more than three decades in entertainment, Robbie Williams is back on the road and ready to celebrate.The singer, whose Long 90s tour begins this week, is taking a moment to mark his achievement. \"I think as British people we're very good at piercing the balloon of our own success and undercutting it and devaluing ourselves,\" he tells BBC News. \"It's what we do best. In many ways it's why we're great.\"But with this one, I really want to let it sink in and I really want to stand in the middle of it and go, 'OK, success, do your thing to me'.\"The tour will take in smaller venues, the kind he would have played at the start of his solo stardom. The 51-year-old says Britpop is the album he wanted to make when he first left Take That. It sees him collaborate with former bandmate Gary Barlow, Gaz Coombes from Supergrass and Black Sabbath guitarist Tony Iommi.But he looks back at the Britpop era with mixed feelings - he experienced professional huge success, but was also deeply depressed. Getty ImagesRobbie pictured with Liam Gallagher at Glastonbury in 1995, at the height of BritpopHe recalls: \"I was going through my own mental illness and anything good that's happening to somebody that is in the throes of depression... they can't experience joy and there were lots of incredible things happening and I couldn't experience joy from any of it.\"But now I look back at it and think, what a decade. The last great decade for popular culture because everything since then has become quite vanilla.\"You don't know 2007 from 2023, but you know the '50s, you know the '60s, you know the '70s you know the '80s and you know the '90s and so I look back and with a wry smile and say that the '90s was an amazing time to have a bad time.\"Robbie has spoken openly about suffering from stage fright in the past, experiencing terror before walking on stage. He tells me that everything \"clicked into place\" for him when his first child, daughter Theodora, known as Teddy, who was born in 2012. \"The world started to make sense because I'd been running away from responsibility and I should have been running towards it. \"And when things stopped being about me and started to become about precious souls, I started to realise I've got the best job in the world.\"Getty ImagesRobbie with Ayda and eldest daughter Teddy, who was born in 2012Williams says he also feels much happier being back in the UK, after a torrid experience with the British press, particularly in the early stages of his solo career. \"I think that everybody knows, because we've seen it countless times, that if you are on the crest of a wave, the media comes to bring you down and attack you and malign you at every opportunity they can. And that is heavy and brings its own problems.\"But that was then, I'm in a different place now,\" he continues. \"I'm left alone just to put my songs out and be married. \"There isn't anybody at my door trying to get pictures of me 24 hours a day or trying to pop microphones and bug my house or trying to hack my phone. There isn't any of that stuff that's happening anymore. This is what I thought it would be like when I set out on my journey when I was 16, I'm having an amazing time.\"Williams, pictured with the BBC's Charlotte Gallagher, says he's glad social media was not around earlier in his careerOne thing the singer did not have deal with back then was social media, and he tells me he thinks it would have \"seen him off\". \"I get way too invested in finding the negative things, everybody does,\" he says. \"I wonder if there's something wired in us where we go, ‘let's find the problem, let's find a threat and then we'll negate the threat’.\"Then, of course, there is the eternal question, will Robbie ever rejoin Take That? The band that launched his career.Williams has spoken of them \"riding again\" and says he \"absolutely loved\" the documentary, adding that he had \"overwhelming feeling of how much I love the boys\".Getty ImagesTake That were recently the subject of a Netflix documentary, which examined their successOn February 13 it will be 30 years since Take That split (the first time), it's also Robbie's birthday. So what was he doing that day in 1996? \"Buying a Scalextric from Harrods,\" he laughs. Not the rock'n'roll answer I expected.After breaking a record held by The Beatles and winning more Brit Awards than anyone else, I ask Robbie what he wants to do next.\"I want to build hotels with my own venues in and then I want to play my own hotels,\" he replies.\"I want to do a university of entertainment and I've got the syllabus in my mind and it would be a great revenge on education for somebody that left school with nothing higher than a D to go in and revolutionise education.\" Sign us up for the university of Robbie Williams.Britpop by Robbie Williams is out now. The Long 90s tour began earlier this week. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Robbie Williams: social media would have 'seen me off' in the 90s",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/699a/live/3106b250-01ef-11f1-bb50-17f4fe9ab2e3.jpg"
      ],
      "datePublished": "2026-02-05T00:24:57.000Z",
      "dateModified": "2026-02-05T00:24:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bondi Junction stabbings: Doctor of killer referred to health regulators",
    "url": "https://www.bbc.com/news/articles/cy7mrx6ne1po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/130c/live/b17a8cf0-3d1d-11f0-985f-3f10d12037d6.png",
    "tag": "World",
    "date": "2026-02-05T03:12:05.000Z",
    "description": "Doctor who treated Bondi Junction mass killer referred to health regulator5 hours agoLana LamSydneyRohan AndersonJoel Cauchi, 40, was first diagnosed ",
    "body": "Doctor who treated Bondi Junction mass killer referred to health regulator5 hours agoLana LamSydneyRohan AndersonJoel Cauchi, 40, was first diagnosed with schizophrenia as a teenagerA psychiatrist who treated the man behind a fatal stabbing rampage at a crowded Sydney shopping centre will be referred to health investigators after a coroner's inquiry.Joel Cauchi, first diagnosed with schizophrenia in his teens, was unmedicated and homeless when he stabbed 16 people inside Westfield Bondi Junction in 2024, killing six.The New South Wales coroner said Dr Andrea Boros-Lavack had provided 40-year-old Cauchi \"exemplary\" care over a long period, but failed to heed warnings from family that he may be relapsing, years before the attack.This mistake was one of many that led to the tragedy, the coroner said, also pointing to a series of actions by police and shopping centre security.Six people - Dawn Singleton, 25; Yixuan Cheng, 27; Jade Young, 47; Ashlee Good, 38; Faraz Tahir, 30; and Pikria Darchia, 55 - died during the attack in April 2024.Ten others, including Good's baby, were injured in the six minutes before Cauchi - who was suffering a psychotic episode - was shot dead by New South Wales (NSW) police inspector Amy Scott.During a five-week coroner's inquest that finished last May, the coroner heard from dozens of witnesses including doctors, police, survivors and the families of victims  in a bid to unearth the events leading up to the attack and prevent such a tragedy occurring again. The coroner's 800-page plus findings were due to be released at the end of 2025 but they were delayed as a mark of respect for the victims of the Bondi Beach attack, in which 15 people were killed by two gunmen on 14 December. On Thursday, Teresa O'Sullivan told the coroner's court that Boros-Lavack had provided \"personalised, consistent and compassionate treatment\" for Cauchi for many years after she first took him on as a private patient in 2012.Between 2018 and mid-2019, the Queensland psychiatrist had worked closely with Cauchi to wean him off the medications he had been taking to treat his condition, a move that was not criticised by the coroner.However, in late-2019 when Cauchi's mother raised concerns that her son was possibly relapsing, Boros-Lavack \"failed to take more active steps or to recognise the seriousness of the situation that was unfolding before her\".She said it was a \"major failing\" for the doctor to \"not do more to proactively urge Cauchi to resume his medication\".When Cauchi moved to another city and and came under the care of a different doctor, a discharge letter from Boros-Lavack also failed to provide enough information to prompt intervention, the coroner said. It didn't emphasise the need for Cauchi to see a psychiatrist or that an urgent review of his case should be a priority.O'Sullivan's recommendation that Boros-Lavack be investigated by Queensland health authorities followed calls by some of the victim's families for such action.She also found there was a missed opportunity for police intervention after an email raising concerns about Cauchi's mental health was not acted upon due to staff shortages .The officer \"overlooked a single email amidst a significant workload\", O'Sullivan said.The inquest heard a security guard who was the sole person in the CCTV control room at the Westfield when Cauchi attacked his first victim was \"not competent\" for that role. However, O'Sullivan said this was the fault of the shopping centre, which has since improved its processes. Among her 23 recommendations, O'Sullivan also called on the NSW government to improve its mental health outreach services and provide short-term housing for people with mental health issues.The coroner praised the police and emergency services response to the stabbings, describing them as \"commendably rapid and extensive\" but said there were issues with the \"inter-operability\" between various agencies that could be improved. She also recommended a public awareness campaign with the message of \"escape, hide, tell\" when there is a situation with an armed offender.O'Sullivan, though, did criticise some media coverage, which she said \"exacerbated the trauma already being suffered\" by victims and families affected, and said she would be making recommendations to the Australian Press Council on how reporters should cover incidents that involve mass casualties.The coroner also recommended bravery awards for the police officer who shot Cauchi, two Frenchmen who tried to stop Cauchi during the attack, the husband of victim Jade Young, and Ashlee Good, who died while trying to shield her baby.Outside the court, Noel McLaughlin - Young's husband - said the inquest mattered greatly.\"The evidence has shown that what first appeared to be a sudden and random act of violence was, in fact, the end point of a long story,\" he said.Earlier, Cauchi's parents released a statement, saying they hoped the coroner's findings would prevent such a tragedy happening again.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bondi Junction stabbings: Doctor of killer referred to health regulators",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/130c/live/b17a8cf0-3d1d-11f0-985f-3f10d12037d6.png"
      ],
      "datePublished": "2026-02-05T03:12:05.000Z",
      "dateModified": "2026-02-05T03:12:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Naked images remained in Epstein files despite outcry",
    "url": "https://www.bbc.com/news/articles/c5yd10yp2m1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/faca/live/dfc6ada0-01ee-11f1-b7e1-afb6d0884c18.png",
    "tag": "World",
    "date": "2026-02-05T05:59:55.000Z",
    "description": "3 hours agoBecky DaleandMatt Murphy,BBC Verify  BBCUnredacted images and videos showing nudity released in the Epstein files have been online for days",
    "body": "3 hours agoBecky DaleandMatt Murphy,BBC Verify  BBCUnredacted images and videos showing nudity released in the Epstein files have been online for days despite US officials being warned about failures in redaction, which lawyers say has caused victims \"irreparable\" harm.The files seen by BBC Verify are among thousands of documents lawyers say they have discovered that contain identifying information about dozens of Epstein's victims.Victims groups first spoke out about the issue at the weekend when the New York Times reported nearly 40 separate images had been published as part of the Epstein files on Friday.On Tuesday, a New York judge said the Department of Justice (DoJ) had agreed to quickly fix the issue after victims called for the website to be shut down until names and images could be properly redacted.The DoJ removed thousands of documents from its website, stating that the files had been uploaded due to \"technical or human error\". The department said it was continuing to examine new requests, as well as checking whether there were any other documents that might need further redaction.BBC Verify found independently that a number of images of identifiable people were still online on Wednesday, despite the US government stating it was tackling the issue of incomplete redactions the previous day. We have approached the DoJ for comment and supplied the names of unredacted files.\"The damage done is irreparable,\"  Brad Edwards, a lawyer representing the victims, said in a statement.Four of the images identified by BBC Verify showed partially clothed young females with their faces and bodies unredacted.They were found during a general search of the millions of files released for evidence of Epstein's interactions with public figures.Photos of other people appear to have been redacted in some documents but left unredacted elsewhere. One document contained two versions of the same picture, one showing the face covered with a black square and another that showed the face in full.Another video also identified someone who was seen lifting up her shirt and showing her breast to the camera.Department of Justice (DoJ) officials were tasked with redacting all sexually explicit photos or any information which could identify victims before the latest tranche of Epstein files was due to be published over the Christmas period.Ahead of the deadline set by Congress, deputy Attorney General Todd Blanche said the files would not be published on time, citing the extra work needed to guard victims' identities. \"We are looking at every single piece of paper that we are going to produce making sure every victim - their name, their identity, their story, to the extent that it needs to be protected - is completely protected,\" he said at the time.BBC Verify has separately found the identities of several people have been revealed in medical information and legal statements published in the files.One name was shown in full in two videos showing foetal ultrasound scans. The time, date and what appears to be the location of the scans, as well as the gestational age of the foetus, were also clearly visible.Another document contained a recording of Epstein being questioned in which a lawyer mentioned the name of at least one victim.Lawyers for Epstein's victims have heavily criticised the DoJ for its failure to adequately protect hundreds of women identified in the files.\"We are getting constant calls from victims because their names – despite them never coming forward, being completely unknown to the public – have all just been released for public consumption,\" Brad Edwards, one of the attorneys, said on Sunday.\"It's literally thousands of mistakes.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Naked images remained in Epstein files despite outcry",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/faca/live/dfc6ada0-01ee-11f1-b7e1-afb6d0884c18.png"
      ],
      "datePublished": "2026-02-05T05:59:55.000Z",
      "dateModified": "2026-02-05T05:59:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Savannah Guthrie addresses mother's abductor: 'We are ready to talk' ",
    "url": "https://www.bbc.com/news/articles/c2e18wvrx9xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/21ce/live/a07aa690-025e-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "World",
    "date": "2026-02-05T03:53:41.000Z",
    "description": "'We are ready to talk': US news anchor Savannah Guthrie pleads for return of her abducted mother5 hours agoChristal HayesWatch: 'We are ready to talk'",
    "body": "'We are ready to talk': US news anchor Savannah Guthrie pleads for return of her abducted mother5 hours agoChristal HayesWatch: 'We are ready to talk' - Savannah Guthrie issues emotional plea for abducted mum's returnUS news anchor Savannah Guthrie has posted a video message tearfully pleading for the return of her abducted mother and seeking proof from her captors that the 84-year-old is still alive.\"We want to hear from you and we are ready to listen,\" the NBC host says, flanked by her siblings in the clip posted to Instagram. \"Please reach out to us.\"Nancy Guthrie went missing in the middle of the night from her home in the US state of Arizona over the weekend.Authorities said they suspect she was kidnapped and they are working with the FBI to authenticate a possible ransom note.\"We are ready to talk,\" said the NBC host in the video posted on Wednesday night. \"However, we live in a world where voices and images are easily manipulated.\"We need to know without a doubt that she is alive and that you have her.\"It is standard procedure in hostage and kidnap cases for negotiators to demand proof of life from abductors. It is unclear if Nancy Guthrie's children were directed to do so by authorities. Pima County Sheriff's Office said on Wednesday they were still speaking with anyone who had contact with Nancy Guthrie last weekend, and that no suspect or person of interest had so far been identified.Savannah Guthrie, joined by her sister Annie and brother Cameron, said in the clip they were aware of an alleged ransom note, which was sent to at least one media outlet.  \"Mommy, if you are hearing this, you are a strong woman,\" the Today show presenter said, her voice breaking. \"Everyone is looking for you, mommy. Everywhere. We will not rest. Your children will not rest until we are together again.\"Officials have warned Nancy Guthrie could be in dire health without her medication, which Savannah Guthrie mentioned in the clip. \"Our mom is our heart and our home,\" she said. \"Her health, her heart is fragile. She lives in constant pain. \"She is without any medicine. She needs it to survive. She needs it not to suffer.\"Her sister, Annie, said the \"light is missing from our lives\". \"Momma,\" she said, \"if you are listening we need you to come home. We miss you.\"NBC via Getty ImagesSavannah Guthrie with her mother, Nancy, on the set of Today Shortly after the video was posted, US President Donald Trump commented on Truth Social about the case. He said he was directing all federal law enforcement to help bring the investigation to a close and \"get her mother home safely\".\"I spoke with Savannah Guthrie, and let her know that I am directing ALL Federal Law Enforcement to be at the family's, and Local Law Enforcement's, complete disposal, IMMEDIATELY,\" he said, adding that the nation was praying for her family.The BBC has contacted the FBI and local officials for comment.What we know about the possible abduction of Savannah Guthrie's motherAlleged ransom notes investigated in disappearance of Savannah Guthrie's motherPima County Sheriff Chris Nanos has described an all-hands-on-deck search with dogs, drones, helicopters and federal agents to find the missing woman.Nancy Guthrie was last seen at her home in Catalina Foothills, an affluent neighbourhood roughly six miles (10km) north-east of Tucson, on Saturday evening, when family members dropped her off around 21:30 local time.She did not attend church on Sunday morning, which prompted members of her congregation to notify family members. When detectives searched her home, they found a scene that caused \"grave concern\", Sheriff Nanos said. He refused to elaborate on what was found. \"We do believe that Nancy was taken from her home against her will. And that's where we're at,\" he said. He would not comment on reports about blood found at the property.Sheriff's officials have asked people to stop sharing misinformation about the case. Savannah Guthrie is one of the most famous faces in US media and her video garnered support from across the media landscape and Hollywood. The broadcast journalist, who joined NBC in 2007, was named co-anchor of NBC's Today show in 2012. She also serves as NBC News' chief legal correspondent, and presents during the network's Thanksgiving Day programming and from the Olympics. Savannah Guthrie had been due to co-host NBC's coverage of the Opening Ceremony for the Winter Olympics in Milan on Friday.But she withdrew because of her mother's disappearance. Presenter Mary Carillo will take her place, NBC said.\"Our hearts go out to Savannah and the entire Guthrie family,\" Molly Solomon, the executive producer and president of NBC Olympics Production, said in a statement. \"They continue to have our full support.\"According to the Arizona Republic newspaper, a historic church in Tucson invited the community to gather on Wednesday to pray for Nancy Guthrie's safe return.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Savannah Guthrie addresses mother's abductor: 'We are ready to talk' ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/21ce/live/a07aa690-025e-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-05T03:53:41.000Z",
      "dateModified": "2026-02-05T03:53:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US pitches plan to counter China's dominance of critical mineral supply",
    "url": "https://www.bbc.com/news/articles/c5y41r5rzrno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/de46/live/e65a32c0-0231-11f1-a567-cb14f69dbbca.jpg",
    "tag": "World",
    "date": "2026-02-05T03:33:48.000Z",
    "description": "US launches plan to tackle China's critical minerals dominance5 hours agoKali Hays,Technology reporterandPeter Hoskins,Business reporterGetty ImagesJD",
    "body": "US launches plan to tackle China's critical minerals dominance5 hours agoKali Hays,Technology reporterandPeter Hoskins,Business reporterGetty ImagesJD Vance and Marco Rubio at the first Critical Minerals Ministerial event on WednesdayThe US has launched an effort to form a trade zone for critical minerals that are key to making everything from smartphones to weapons as it tries to break China's dominance of the industry.On Wednesday, the State Department hosted the first Critical Minerals Ministerial event - which was attended by countries and organisations including the UK, European Union, Japan, India, South Korea, Australia and the Democratic Republic of Congo.Delegates discussed the availability of and access to minerals crucial to the manufacture of things like computer chips and electric vehicle batteries.The mining and processing of such critical minerals, which include rare earths, is dominated by China.In remarks released by the US government, Vice President JD Vance and Secretary of State Marco Rubio did not mention China by name.Instead, Vance referred to the \"foreign supply\" of such minerals flooding global markets, making it difficult for other countries with mineral deposits to secure the financing needed to produce them.The US planned to use tariffs to stop critical mineral prices falling too low, which can deter investment, he said.David Copley, a special assistant to President Donald Trump, said the US intends to \"deploy hundreds of billions of capital into the mining sector to get projects going\".Investments have already been made in several companies, including rare earths magnets maker MP Materials and Lithium Americas, which produces material key to rechargeable batteries, he said.US Trade Representative Jamieson Greer also said that the US, Japan and the European Commission are developing \"coordinated trade policies and mechanisms\" in order to collectively avoid potential issues with access to important minerals.Ahead of the meeting, a Chinese Foreign Ministry spokesperson said \"countries need to follow the principles of market economy and international economic and trade rules, step up communication and dialogue\".The event was part of a broader effort by the US government to counter China's ability to use its dominance of the industry as leverage in trade negotiations.On Monday, Trump announced the creation of a critical mineral reserve, called \"Project Vault\", worth almost $12bn (£8.8bn).Industry figures welcomed the announcement.\"It's critical to see the United States take decisive steps to shore up our supply of all kinds of minerals and rare earths,\" said Wade Senti, president of Advanced Magnet Lab.China has a chokehold on rare earths and has tightened its grip over exports in recent months.Beijing requires companies in China to get government approval before shipping the minerals abroad.The Chinese government soon eased those stricter measures but analysts say it is using its dominance as a key bargaining chip in trade talks with Washington.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US pitches plan to counter China's dominance of critical mineral supply",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/de46/live/e65a32c0-0231-11f1-a567-cb14f69dbbca.jpg"
      ],
      "datePublished": "2026-02-05T03:33:48.000Z",
      "dateModified": "2026-02-05T03:33:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Inside Gaza hospital struggling to provide care to newborn babies",
    "url": "https://www.bbc.com/news/videos/c62wpd7wj3ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/58e7/live/6555cfe0-025e-11f1-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-05T05:55:32.000Z",
    "description": "The director of one of Gaza's main hospitals says he is still seeing a pattern of malnourished and traumatised mothers giving birth to underweight or ",
    "body": "The director of one of Gaza's main hospitals says he is still seeing a pattern of malnourished and traumatised mothers giving birth to underweight or premature babies, more than three months into a fragile ceasefire between Hamas and Israel. Although significantly more aid has been allowed into Gaza since the ceasefire began, the UN says it is still nowhere near enough. Israel says it is meeting its obligations under the ceasefire, allowing more food and medical aid into Gaza. Shaimaa Khalil reports.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Inside Gaza hospital struggling to provide care to newborn babies",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/58e7/live/6555cfe0-025e-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-05T05:55:32.000Z",
      "dateModified": "2026-02-05T05:55:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why a global Korean craze is making seaweed more expensive ",
    "url": "https://www.bbc.com/news/articles/c4gv1lyvvedo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0d41/live/8fbc1720-01ab-11f1-b6ab-2307e83ecd56.jpg",
    "tag": "World",
    "date": "2026-02-04T23:01:13.000Z",
    "description": "A global craze for Korean culture is making its humblest snacks unaffordable10 hours agoYuna Ku,SeoulandSuhnwook Lee,SeoulGetty ImagesSouth Korea is k",
    "body": "A global craze for Korean culture is making its humblest snacks unaffordable10 hours agoYuna Ku,SeoulandSuhnwook Lee,SeoulGetty ImagesSouth Korea is known to be the world's largest producer and exporter of dried gimBlack, crispy, often flat and square - dried seaweed, known locally as gim - is a humble staple on everyday dining tables across South Korea. But as its global popularity grows, its rising prices are worrying gim-lovers nationwide.Lee Hyang-ran has been selling gim for the past 47 years. \"In the past, people from Western countries thought Koreans were eating something weird that looks like a piece of black paper,\" the vendor, who is in her 60s, says from a small market stall in central Seoul.\"I never thought I'd be selling gim to them. But now, they all come here and buy it.\"South Korea is known to be the world's largest producer and exporter of gim, supplying markets across Asia, North America and Europe. Some even refer to the product as Korea's \"black semiconductor\", a reference to South Korea's large share of the global semiconductor industry. Exports have risen steadily in recent years - and in 2025, South Korea's dried seaweed exports hit a record $1.13bn, according to the Korea Maritime Institute (KMI).And as demand rises, so do prices.Known locally as an affordable snack or ingredient, gim typically cost around 100 won ($0.06; £0.05) per sheet in 2024 - with the snack usually sold in bundles of 10 sheets or more, or around $0.60 per pack.  But last month, the price of one sheet of gim rose to above 150 won - a record high in the country. \"Premium products now cost as much as 350 won per sheet,\" said Lee. BBC/Suhnwook LeeLee Hyang-ran has been selling gim for 47 years Kim Jaela, who's in her 30s, typically buys gim in bulk - about 500 small sheets at a time, enough to last her several months. But she says this may need to change, considering how expensive gim has become. She does most of her grocery shopping online, and was checking prices on her phone during the interview.\"Oh my, it really did get more expensive by a few dollars! Luckily, I can survive a few more weeks with two packs of gim, but if I see the same or higher price later, I probably won't restock,\" she said.A humble Korean staple The worldwide appetite for gim reflects a growing global demand in Korean goods, driven by cultural influences like K-pop and K-dramas. As global audiences engage more deeply with such entertainment, they're also increasing looking to Korean cuisine, something businesses worldwide have picked up on. In 2023, US supermarket chain Trader Joe's Gimbap - a Korean rice roll wrapped in seaweed - went viral and was cleared off the shelves nationwide shortly after its launch.\"I first learned about gim because it's a typical Korean food often seen in K-dramas,\" Miki, a 22-year-old visitor from Japan told the BBC. \"We do have similar thing called nori in Japan, but the taste is totally different. Gim is lighter and crispier, and is mostly grilled with sesame oil and salt, whereas nori is typically seasoned with soy sauce.\"Viola, a 60-year-old visitor from Brooklyn, New York, says she enjoys gim as a snack. \"I just pop it in my mouth like a potato chip,\" she said, adding that it feels like a \"healthier alternative\". \"From Asian to Western countries, more people are becoming familiar with gim, increasing global demand,\" said Lee Eunhee, a professor of consumer studies at Inha University. \"To meet overseas demand, domestic prices are being pushed up.\"Kim Namin, 29, runs a seasoned gim processing factory with a 30-year family history in Wando, an island in South Korea's southern waters known for abalone and seaweed production. His factory purchases raw seaweed, grills it with oil and salt, and cuts it into the familiar rectangular sheets sold in stores.Over the past five years, most of their products have been exported globally. \"There aren't enough gim factories compared to the rising demand,\" he said, saying that his family is now considering expanding operations.He adds that gim is a highly price-sensitive staple in South Korea, long associated with affordability. Even marginal increases in its cost are keenly felt by consumers and tend to provoke strong public resistance - another reason why he's  focusing more on overseas markets.Government officials and experts say the price increase is being driven by multiple factors, including overall inflation, rising labour costs, and a decline in overseas production. However, many agree that increased growing global demand remains a major driver.In an effort to appease domestic consumers, companies - alongside the government - are taking steps to curb rising costs.South Korea's Ministry of Oceans and Fisheries has pledged to closely monitor the situation to stabilise its price. and Korean food companies like Pulmone have plans to establish a land-based seaweed R&D centre, so they can be harvested throughout the year. Back in Seoul, the market buzzes with tourists, and business is booming for Lee. \"Gim has been selling like hot cakes... the ones for making gimbap are especially popular,\" she says. \"I'm glad Korean gim is getting popular.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why a global Korean craze is making seaweed more expensive ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0d41/live/8fbc1720-01ab-11f1-b6ab-2307e83ecd56.jpg"
      ],
      "datePublished": "2026-02-04T23:01:13.000Z",
      "dateModified": "2026-02-04T23:01:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Social media ban for children: Is it possible in India?",
    "url": "https://www.bbc.com/news/articles/c9qpr37d84qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a1a6/live/09ac66a0-0262-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "World",
    "date": "2026-02-05T00:50:54.000Z",
    "description": "Growing calls in India to restrict children's social media use8 hours agoAbhishek DeyGuwahatiGetty ImagesExperts say that a social media ban would not",
    "body": "Growing calls in India to restrict children's social media use8 hours agoAbhishek DeyGuwahatiGetty ImagesExperts say that a social media ban would not be easy in India and could face legal challengesA debate around banning social media for children under 16 is gathering momentum in India, with ministers in several states saying they are studying a law that recently came into effect in Australia.Ministers in at least two southern states have said recently that they are checking if a ban would be effective in keeping children away from social media. And last week, the Economic Survey - an annual document written by a team led by India's chief economic adviser - recommended that the federal government consider age-based limits for social media use by children. The survey's recommendations are not binding on the government but can inform policy decisions.Experts, however, warn that such a ban would not be easy in India and could face legal challenges.Australia recently became the first country in the world to ban most social media platforms for children under 16, making it mandatory for platforms to verify users' ages and disable accounts by underage users.The move sparked criticism from social media platforms which, Australia's internet regulator told the BBC last month, came to the regime \"kicking and screaming - very very reluctantly\". Last week, lawmakers in France's lower house approved a bill that would ban social media access for under-15s. It still needs to be passed by the Senate.The UK is also considering a ban.In India, LSK Devarayalu, a lawmaker from the regional Telugu Desam Party - which governs Andhra Pradesh state and is a key part of Prime Minister Narendra Modi's federal coalition - proposed a bill last week seeking to bar children under 16 from using social media.As a private member's bill, the proposal does not reflect government policy and is unlikely to become law - but it could shape parliamentary debates.Separately, the Andhra Pradesh government has set up a group of ministers to study global regulatory frameworks and invited major platforms, including Meta, X, Google and ShareChat, for consultations. The companies haven't commented on the invitation yet.The state's Information Technology Minister Nara Lokesh last week said on X that children were \"slipping into relentless usage\" of social media, affecting their attention spans and education.\"We will ensure social media becomes a safer space and reduce its damaging impact - especially for women and children,\" he added.Other states have expressed interest in similar measures.Goa's Tourism and IT Minister Rohan Khaunte said the state was examining whether a ban could be implemented, adding that more details would follow.Priyank Kharge, the IT minister of Karnataka - home to Bengaluru city which is known as India's Silicon Valley - told the state assembly that the government was discussing responsible use of artificial intelligence and social media, and referred to a \"digital detox\" programme involving around 300,000 students and 100,000 teachers that the government launched in partnership with Meta.Kharge, however, did not specify whether legislation was being considered or which age groups might be affected.AFP via Getty ImagesAustralia is the first country in the world to ban most social media platforms for children under 16But enforcing state-level bans would be complicated, says digital rights activist Nikhil Pahwa. \"While companies can infer users' locations through IP addresses, such systems are often inaccurate. Where state boundaries are very close, you can end up creating conflicts if one state bans social media use and another does not.\"He also points to difficulties around age verification, saying the issue was not unique to India. \"Age verification is not simple. To adhere to such bans, companies would effectively have to verify every individual using every service on the internet,\" Pahwa told the BBC.Even in Australia, some children have told the BBC that they get around the ban by using fake birthdays to create new accounts.According to Prateek Waghre, a public policy expert and head of programmes at the Tech Global Institute, enforcement would also depend on the cooperation of platforms and intermediaries. \"In theory, location can be inferred through IP addresses by internet service providers or technology companies, but whether the companies operating such apps would comply, or challenge such directions in court, is not yet clear,\" he says.While lawmakers have identified a genuine problem, a ban seems to be an overly narrow response, experts think. A recent study by a non-profit organisation that surveyed 1,277 Indian teenagers suggests that age-based restrictions and verification systems may face additional hurdles in India's digital landscape. Many accounts, it says, are created with help from family members or friends and are not linked to personal email addresses, complicating assumptions of individual ownership that underpin age-verification systems.While some parents in India have welcomed the idea of a ban online, others point out a deeper issue.\"Parents themselves fail to give enough time to children and hand them phones to keep them engaged - the problem starts there,\" says Delhi resident Jitender Yadav, who has two daughters aged eight and four. \"I am not sure if a social media ban will help. Because unless parents give enough time to their children or learn to keep them creatively engaged, they will always find ways to bypass such bans,\" he says.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Social media ban for children: Is it possible in India?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a1a6/live/09ac66a0-0262-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-05T00:50:54.000Z",
      "dateModified": "2026-02-05T00:50:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New Start: US-Russia nuclear weapons treaty due to expire raising fears of arms race",
    "url": "https://www.bbc.com/news/articles/c4g31n4ey9go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2d30/live/d61a6d70-01c4-11f1-9921-b31487791c6e.jpg",
    "tag": "World",
    "date": "2026-02-05T05:33:08.000Z",
    "description": "3 hours agoJonathan BealeDefence correspondentAFP via Getty ImagesThe New Start treaty caps the number of deployed strategic nuclear warheads for the ",
    "body": "3 hours agoJonathan BealeDefence correspondentAFP via Getty ImagesThe New Start treaty caps the number of deployed strategic nuclear warheads for the US and Russia to 1,550 eachThe last nuclear weapons control treaty between the US and Russia has expired, raising fears of a new arms race.  The Strategic Arms Reduction Treaty, known as \"New START\" and signed in 2010, was one of a handful of agreements designed to help prevent a catastrophic nuclear war.UN Secretary General António Guterres has said its end \"marks a grave moment for international peace and security\" and called on Russia and the US to negotiate a successor framework \"without delay\".Its expiry, at midnight GMT, effectively marked an end to the arms control co-operation between Washington and Moscow that helped bring an end to the Cold War. The treaty had capped the number of deployed strategic nuclear warheads for each party to 1,550 and established some transparency including data transfer, notifications and on site inspections.Without it, Guterres warned, \"we face a world without any binding limits on the strategic nuclear arsenals\" of the countries that possess the \"overwhelming majority of the global stockpile of nuclear weapons\".He called on the two states to \"reset and create an arms control regime fit for a rapidly evolving context\" as the \"risk of a nuclear weapon being used is the highest in decades\".Guterres said he welcomed that both US President Donald Trump and Russian President Vladimir Putin had made clear they appreciate the need to prevent \"unchecked nuclear proliferation\" but urged them to \"translate words into action\".On Wednesday, Pope Leo also urged the two states to renew the treaty, saying the current world situation required \"calls for doing everything possible to avert a new arms race\".The original Start treaty - signed in 1991 by the US and the Soviet Union - barred each of the two signatories from deploying more than 6,000 nuclear warheads.It was succeeded by New Start signed in 2010 in Prague by the US and Russia, the successor state to the dissolved Soviet Union.Although Russia suspended the treaty three years ago as tensions grew over the Ukraine war, both countries were still thought to be abiding by the treaty.The agreement prevented the uncontrolled build-up of nuclear weapons and provided the two countries with the largest nuclear arsenals with transparency measures to avoid misjudging each other's intentions.Its expiry follows a worrying pattern. Other long-standing arms control treaties have already fallen by the wayside.They include: The Intermediate-Range Nuclear Forces Agreement, which largely eliminated the deployment of shorter-range nuclear weapons within EuropeThe Open Skies Treaty, which allowed signatories, including the US and Russia, to fly unarmed reconnaissance flights over each other's territory to monitor military forces The Conventional Armed Forces in Europe Treaty, which limited the numbers of tanks, troops and artillery systems both Russia and Nato forces could deploy within EuropeBritain's former head of the armed forces,  Admiral Sir Tony Radakin has warned that the architecture and frameworks that helped keep the world safe \"now risks  unravelling\". In a speech last year he described the collapse of these key arms control treaties as \"one of the most dangerous aspects of our current global security\", along with \"the increasing prominence of nuclear weapons\".Russia's Dmitry Medvedev, who as the then president signed the New Start treaty in 2010, said its expiration should \"alarm everyone\". This is a sobering comment from a politician whose recent rhetoric has included nuclear threats. On Wednesday, a senior adviser to Russian President Vladimir Putin said he intended to \"act in a measured manner and responsibly\" if the treaty expired.Later in the day, the Russian foreign ministry said in a statement that \"in the current circumstances, we assume that the parties to the New START are no longer bound by any obligations or symmetrical declarations in the context of the Treaty, including its core provisions, and are in principle free to choose their next steps. \"In doing so the Russian Federation intends to act responsibly and in a balanced manner,\" the statement said, adding that Moscow \"remains ready to take decisive military-technical measures to counter potential additional threats to the national security\".US President Donald Trump has sounded less concerned. Last month, he told the New York Times: \"If it expires, it expires… We'll just do a better agreement\". Washington believes that any future arms control treaty should also include China, which has been building up its nuclear arsenal. This sentiment was echoed by German Foreign Minister Johann Wadephul on Thursday, who told reporters in Canberra \"China has to be included\".China \"keeps emphasising that they stand with multilateralism, they also have to show in the field of arms control that they are ready to show restraint and that they invest trust in international relations\", he added.Meanwhile, Russia has long argued that any future arms control treaty should include France and the UK - Europe's nuclear powers.Darya Dolzikova, a senior Research Fellow with the UK-based RUSI's Proliferation and Nuclear Policy Programme, said the expiration of New Start was \"concerning, because there are drivers on both sides to expand their strategic capabilities\".Both the US and Russia are currently modernising their nuclear forces and increasing their strategic capabilities. A new arms race is already under way. Dolzikova said that for Russia \"there appears to be some concerns about their ability to penetrate US air defences\". This has only increased with Trump's plans to build a \"Golden Dome\" to protect North America from long-range weapons.But Russia has also been developing new weapons designed to overcome air defences. They include Poseidon - a new intercontinental, nuclear armed and nuclear powered undersea autonomous torpedo, and also Burevestnik – a nuclear armed and powered cruise missile. The US, Russia and China are all developing long-range hypersonic missiles which can manoeuvre at speeds of more than 4,000 mph (6,437kmh), and are much harder to shoot down.Dolzikova said those expanding military capabilities would \"only make it harder\" to reach a new arms control treaty. This is along with what she called the \"growing salience of nuclear weapons\". More, not fewer, countries appear to want them as a deterrent.  Nor does the US or Russia appear to be in a rush to sign a new arms control treaty. The subject was on the agenda when Russian President Vladimir Putin met Trump in Alaska last year - but nothing happened. A new deal is still possible - but the expiry of the New Start signals a more volatile, dangerous era.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New Start: US-Russia nuclear weapons treaty due to expire raising fears of arms race",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2d30/live/d61a6d70-01c4-11f1-9921-b31487791c6e.jpg"
      ],
      "datePublished": "2026-02-05T05:33:08.000Z",
      "dateModified": "2026-02-05T05:33:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kwara state attack: Boko Haram blamed as US military team deploys to Nigeria",
    "url": "https://www.bbc.com/news/articles/ckgvllk3lx9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8102/live/c1d36790-01e2-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "World",
    "date": "2026-02-05T02:47:14.000Z",
    "description": "Gunmen kill dozens in Nigeria as US military deployment confirmed6 hours agoMakuochi Okafor,BBC Africa, LagosandOttilie MitchellAFP/Getty ImagesNigeri",
    "body": "Gunmen kill dozens in Nigeria as US military deployment confirmed6 hours agoMakuochi Okafor,BBC Africa, LagosandOttilie MitchellAFP/Getty ImagesNigeria faces security challenges across the countryDozens of people have been killed in a ferocious shooting attack on two villages in Nigeria's western state of Kwara, according to authorities and rights groups. The attackers also set fire to shops and homes, along with the residence of the traditional leader, forcing the residents of Nuku and Woro to flee, local lawmaker Saidu Baba Ahmed told BBC Hausa.Officials have blamed jihadist groups and deployed an army battalion to Kwara's Kaiama constituency. Tuesday's attack, one of several across Nigeria in the last few days, comes as the country's defence minister confirmed to the BBC that a small team of US troops was in the country to help with intelligence and training.Nigerian President Bola Tinubu said Islamist militant group Boko Haram was behind the attack. Local lawmaker Mohammed Omar Bio said Lakurawa, an armed group affiliated with Islamic State, was responsible, according to the Associated Press.Kwara State Governor AbdulRahman AbdulRazaq said 75 local Muslims \"were massacred in cold blood simply for refusing to surrender to extremists who preached a strange doctrine\".Ahmed initially told BBC Hausa that at least 35 people had died, but human rights groups have since reported more than four times that number of deaths.A Red Cross official in Kwara, Babaomo Ayodeji, told AFP that \"reports said that the death toll now stands at 162, as the search for more bodies continues\".Amnesty International said in a statement that over 170 people had died, noting many were shot at close range and some burnt alive.Several people were abducted in the attack that was undertaken in a \"stunning absence of any form of security for the protection of lives\", the human rights group said while calling for an investigation.A further 21 people were killed in an attack on Doma village in the state of Katsina, they added.The attacks come alongside the first official acknowledgement from Nigeria of an American troop presence since US President Donald Trump ordered the military in November to prepare for action in Nigeria to tackle Islamist militant groups.Defence Minister Chrisopher Musa did not provide details on the team's size, arrival date, location or duration of stay.\"Our partnership with Nigeria is a great example of a very willing and capable partner who requested the unique capabilities that only the US can bring,\" he said.Nigeria faces an array of security challenges including criminal gangs - known locally as \"bandits\" who loot and kidnap for ransom - an Islamist insurgency, clashes over land and separatist unrest.Kwara police spokesperson Adetoun Ejire-Adeyemi told the BBC that the attack on the neighbouring villages of Nuku and Woro began at 17:30 local time on Tuesday - and she blamed suspected bandits.She added that various security forces had now been deployed to the area but details of casualties were still unclear as were reports that people were missing.The whereabouts of the traditional king are reportedly unknown.Ahmed, the local MP, said the attack on Woro came after several smaller attacks in the area in recent days.\"They started shooting sporadically, they burnt shops, at least 35 bodies have been retrieved - more bodies could be retrieved because people ran into the forest with gunshot wounds,\" he told BBC Hausa.\"It was complete chaos... Everybody is terrified.\"For years the bandits have mainly targeted those in the north-west of Nigeria - but they have been moving to other parts of the country, like Kwara and Niger states, more recently.Some jihadists - suspected to be from a Boko Haram splinter faction - have also been active in Kwara, carrying out targeted killings, often riding in on motorcycles and attacking markets and vigilante groups set up to protect villagers.The Kwara governor said Tuesday's attack was a result of recent counter-terrorism operations in the region.AbdulRazaq believed the attack was \"apparently to distract the security forces who have successfully hunted down several terrorist and kidnapping gangs\", his press secretary Rafiu Ajakaye said in a statement.Also on Tuesday, in the north-eastern Borno State, 17 people were killed in a series of attacks by suspected Boko Haram militants.The US and Nigerian forces have conducted joint training programmes and exercises for decades.But the US military has recently become more involved - launching airstrikes on Christmas Day on two camps run by Lakurawa in the north-west.Late last year, the White House pressed Nigeria's government to improve security and strengthen protections for Christian communities.Trump had previously claimed Christians were being persecuted in Nigeria - an allegation strongly rejected by Nigeria's government, which said Muslims, Christians and people of no faith were victims of attacks.There are more than 250 ethnic groups in Nigeria, which is roughly divided into a mainly Muslim north, a largely Christian south, with intermingling in the middle.Nigeria's Foreign Minister Yusuf Tuggar said the Christmas-Day strikes were approved by President Bola Tinubu and involved Nigerian forces.Since then security co-operation between the two nations has increased - with the US saying last month that it had delivered critical supplies to support Nigeria's security efforts.Nigeria's military then told the BBC the equipment had been purchased earlier to aid counter-insurgency operations.In recent weeks, Nigerian forces have stepped up operations against armed groups.On Sunday, the army said it had killed a senior Boko Haram commander and 10 other militants during an operation in Borno state.Additional reporting by Mansur AbubakarYou may also be interested in:Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kwara state attack: Boko Haram blamed as US military team deploys to Nigeria",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8102/live/c1d36790-01e2-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-05T02:47:14.000Z",
      "dateModified": "2026-02-05T02:47:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says America should move on from Epstein - it may not be that easy",
    "url": "https://www.bbc.com/news/articles/cy4gj71z0m0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/925f/live/5149a500-020c-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "World",
    "date": "2026-02-05T03:27:44.000Z",
    "description": "5 hours agoAnthony ZurcherNorth America correspondentWatch: \"Everybody needs to do better\" - Survivor says US shouldn't move on from EpsteinOver the p",
    "body": "5 hours agoAnthony ZurcherNorth America correspondentWatch: \"Everybody needs to do better\" - Survivor says US shouldn't move on from EpsteinOver the past two months, the US Department of Justice has released millions of documents related to its sex-trafficking investigation into Jeffrey Epstein. Now, the president wants the nation to move on - but will it?Deputy US Attorney General Todd Blanche has said the government's review of the Epstein files - which was mandated by a law passed by Congress in November - is over, and there are no grounds for new prosecutions.\"There's a lot of correspondence. There's a lot of emails. There's a lot of photographs,\" Blanche said on Sunday. \"But that doesn't allow us necessarily to prosecute somebody.\"While the justice department's review may be over, on Capitol Hill, the House of Representatives is pushing ahead with its own Epstein inquiry. Former President Bill Clinton and former Secretary of State Hillary Clinton are scheduled to testify later in February after Republicans threatened to hold them in contempt of Congress.Members of Congress and Epstein's victims, meanwhile, are continuing to call for further disclosures – pointing to documents they say exist but weren't included in the released files. EPAIt is yet another sign of just how difficult to shake this story has become for those, like President Donald Trump, who are clearly keen to move on.For the moment, however, the president has emerged from the storm with no apparent lasting damage. That is not true for some of the other rich and powerful figures whose ties to Epstein were more prominently detailed in the files, and who had continued contact with him long after he became a convicted sex offender in 2008.Watch: What's in the latest batch of released Epstein files?Andrew Mountbatten-Windsor, the former prince, Lord Peter Mandelson, the former UK ambassador to the US, and former US Treasury Secretary Larry Summers, for instance, have all faced professional and personal consequences for their connections to Epstein.Microsoft founder Bill Gates and tech multi-billionaire Elon Musk, among others, have had to explain emails and mentions of their name in the released documents.The president, at the White House on Tuesday, said he thought it was \"really time for the country to get on to something else\".\"Nothing came out about me,\" Trump, who has consistently denied wrongdoing in relation to Epstein, said.That, however, is not exactly accurate.The president's name appeared more than 6,000 times in the documents. He was frequently mentioned by Epstein and his associates. The two men, both residents of New York City and West Palm Beach, had by all accounts a friendly relationship for much of the 1990s until, according to Trump, they fell out in the early 2000s.One of those Trump mentions, in an email released in December, drew particular scrutiny.\"I want you to realize that that dog that hasn't barked is Trump,\" Epstein wrote in the 2011 email to convicted co-conspirator Ghislaine Maxwell. \"[Victim] spent hours at my house with him, he has never once been mentioned\".House Oversight CommitteeTrump and Epstein were pictured at parties together in the 1990s - the president says the fell out in the early 2000sIn the latest batch of files, the justice department also released a list of unverified FBI tips, including some from 2016 when Trump was in the midst of his first presidential campaign. The list includes numerous allegations of sexual abuse made against Trump, Epstein and other high-profile figures.The FBI tips, many of which were made without supporting evidence, temporarily disappeared from the justice department's document website on Saturday. That only served to fuel a feeling in some quarters that the department was working to protect the president.\"Some of the documents contain untrue and sensationalist claims against President Trump that were submitted to the FBI right before the 2020 election,\" the justice department said of those particular files.\"The claims are unfounded and false, and if they have a shred of credibility, they certainly would have been weaponised against President Trump already.\"There have been a handful of new photographs of Trump, but none were any more revealing than images and videos that have long been in the public domain. And Trump, who famously refrains from using email, has no documented trail of direct communication with Epstein. None of the new information substantively undercuts the president's assertion that his friendship with Epstein ended around 2004.The closest thing to a political bombshell – a bawdy, suggestive note Trump allegedly wrote to Epstein for inclusion in a 2002 birthday book – was released by the Epstein estate, not the government.Trump has vehemently denied its authenticity.Watch: Why is no one being prosecuted over the Epstein files?Democrats have alleged the lack of damning evidence against Trump may mean the justice department withheld incriminating documents.\"You say all the documents are released,\" Senate Minority Leader Chuck Schumer wrote in a statement. \"Does that include all of the co-conspirator memos, the corporate protection memos, the original Palm Beach Police Department reports, etc.?\"\"Has every document that mentions the word Trump been released?\"One of Epstein's victims, Lisa Phillips, told the BBC that she and her fellow survivors were not satisfied by the justice department's actions on Epstein.\"The [department] has violated all three of our requirements,\" she said. \"Number one, many documents still haven't been disclosed. Number two, the date set for release has long passed. And number three, the DOJ released the names of many of the survivors, and that's not OK. We feel they're playing some games with us, but we're not going to stop fighting.\"Anger and frustration among Trump's supporters over the administration's apparent reluctance to release all of its Epstein files – perhaps the most potent threat to the president's political standing – appears to have diminished with this wave of newly produced documents, however.While some critics, like former congresswoman Marjorie Taylor Greene, continue to condemn the president, much of his Make America Great Again base appears to have moved on from the Epstein news – their attention divided between ongoing unrest in Minneapolis and the FBI's inquiry into allegations of voting fraud in the 2020 presidential election, among other headline stories.That does not mean, however, that this story is over.Democrats, citing legal requirements, are demanding access to unredacted versions of many of the released documents. And the Clinton testimony could create serious political fireworks.New revelations independent of the justice department's actions could also rekindle the public's interest.But perhaps more significantly, Democrats in Congress have promised to issue similar subpoenas for Trump and other Republicans to testify if they take control of the House of Representatives in November's midterm national elections.The president may insist that it is time for the nation to move on, but years after Epstein's death, this saga has shown that it still has a life of its own.Follow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weekly US Politics Unspun newsletter. Readers in the UK can sign up here. Those outside the UK can sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says America should move on from Epstein - it may not be that easy",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/925f/live/5149a500-020c-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-05T03:27:44.000Z",
      "dateModified": "2026-02-05T03:27:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]