[
  {
    "title": "Swiss voters narrowly approve plan to introduce digital IDs",
    "url": "https://www.bbc.com/news/articles/cdr624j16jpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bad5/live/82dc66a0-9c7e-11f0-95c6-7592d7636e22.jpg",
    "tag": "World",
    "date": "2025-09-28T15:55:38.000Z",
    "description": "10 hours agoImogen FoulkesGeneva correspondentSwiss voters have narrowly approved a plan to introduce voluntary electronic identity cards. With all votes counted, 50.4% of those who voted said yes to the...",
    "body": "<div><div><p>10 hours ago</p></div><p><span><p><span>Imogen Foulkes</span><span>Geneva correspondent</span></p></span></p></div><div><p>Swiss voters have narrowly approved a plan to introduce voluntary electronic identity cards. </p><p>With all votes counted, 50.4% of those who voted said yes to the proposal, while 49.6% rejected it.</p><p>The closeness of the ballot is a surprise. Opinion polls had suggested up to 60% backed digital IDs, which also had the approval of the Swiss government, and both houses of parliament. </p><p>It was Switzerland's second vote on digital IDs. An earlier proposal was rejected in 2021, amid concerns the data would be held centrally, and controlled largely by private providers. </p></div><div><p>Sunday's revised proposal keeps the system in government hands.  Data will be stored only on the smartphones of individual users, and digital IDs will be optional. </p><p>Citizens can continue to use national identity card if they choose, which has been standard for decades in Switzerland.</p><p>To further ease privacy concerns, a particular authority seeking information on a person – such as proof of age or nationality, for example – will only be able to check for those specific details.</p><p>It comes after the UK government announced plans earlier this week to introduce its own digital ID - which would be mandatory for employment - as part of efforts to curb the number of illegal migrants living and working in the country.</p><p>The proposed British digital ID would have fewer intended uses than the Swiss version, but has still raised concerns about privacy and data security. </p><p>Supporters of the Swiss system say it will make life much easier for everyone, allowing a range of bureaucratic procedures - from getting a telephone contract to proving you are old enough to buy a bottle of wine - to happen quickly online.</p><p>Opponents of digital ID cards, who gathered enough signatures to force another referendum on the issue, argue that the measure could still undermine individual privacy.</p><p>They also fear that, despite the new restrictions on how data is collected and stored, it could still be used to track people and for marketing purposes.</p><p>Switzerland has a long tradition of protecting its citizens' privacy. The banking secrecy laws, now much diluted, were designed to shield an individual's personal finances from the prying eyes of the state.</p><p>For years, Google Street View was controversial in Switzerland - and even today, following a ruling by the Swiss Federal Court, images taken close to schools, women's refuges, hospitals or prisons must be automatically blurred before going online.</p></div>"
  },
  {
    "title": "Vijay rally crush: At least 39 killed at political event in Tamil Nadu",
    "url": "https://www.bbc.com/news/articles/c98dqyj5dpjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2b4a/live/55e79ee0-9bc9-11f0-928c-71dbb8619e94.jpg",
    "tag": "World",
    "date": "2025-09-28T14:45:15.000Z",
    "description": "11 hours agoAnbarasan EthirajanSouth Asia regional editor andSofia Ferreira SantosAt least 40 people have died in a crush at a political rally in the southern Indian state of Tamil Nadu, officials say. Tens...",
    "body": "<div><div><p>11 hours ago</p></div><p><span><p><span>Anbarasan Ethirajan</span><span>South Asia regional editor</span><span> and</span></p><p><span>Sofia Ferreira Santos</span><span></span></p></span></p></div><div><p>At least 40 people have died in a crush at a political rally in the southern Indian state of Tamil Nadu, officials say. </p><p>Tens of thousands of people had gathered on Saturday at a campaign event for actor-turned-politician Vijay, in the southern Karur district.</p><p>Tamil Nadu Chief Minister MK Stalin told reporters that the victims included nine children, at least 17 women, and 13 men. A further 51 people are receiving treatment in hospital, he said.</p><p>Police have filed a case against three senior members of Vijay's TVK party.  Potential charges relate to homicide and negligent conduct, they said.</p></div><div><p><b> </b>\"TVK originally sought permission for a gathering of 10,000 people, but the actual crowd was more than double,\" Tamil Nadu police chief V Selvaraj told Reuters news agency.</p><p>Vijay was addressing the rally in Karur district when the crowd surged suddenly, forcing him to halt his speech.</p><p>It was delayed by several hours, local media reported. Images broadcast on television showed people fainting in the packed crowds.</p><p>Compensation of one million rupees ($11,300; £8,400) will be provided to the families of the deceased, Chief Minister Stalin added, and there will be an inquiry into the incident.</p><p>One man told Indian news agency ANI from outside a hospital that his brother's two sons had been at the event.</p><p>\"The elder one passed away, the younger one is missing. My relatives, my sister-in-law, is in the ICU. What should I do?\" he said.</p><p>Vijay wrote in an online statement that his heart was \"broken\" and that he was in \"unbearable, indescribable pain and sorrow\".</p><p>He sent his \"deepest sympathies and condolences\" to the families of those who had died, and prayers for a \"speedy recovery\" to those in hospital.</p><p>India's Prime Minister Narendra Modi said the incident was \"unfortunate\" and \"deeply saddening\" in a post on X.</p><p>Deadly crushes are not uncommon in India, and there have been several similarly tragic incidents this year alone, including at the <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/c3rwjnr12lwo\">famous Kumbh Mela Hindu festival </a>and <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/cdr5mrrj1ego\">outside a cricket stadium</a>.</p></div>"
  },
  {
    "title": "Brutal killings of young women leave Argentina in shock and anger",
    "url": "https://www.bbc.com/news/articles/c20zl9pydezo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7592/live/e3127c00-9c0e-11f0-928e-73648c8cc266.jpg",
    "tag": "World",
    "date": "2025-09-28T02:56:21.000Z",
    "description": "Argentines demand justice at protest against brutal killings of young women23 hours agoStuart LauWatch: Thousands march in Argentina over murder of girl and two young womenThousands of people have taken part...",
    "body": "<article><p></p><h2>Argentines demand justice at protest against brutal killings of young women</h2><p></p><div><div><p>23 hours ago</p></div><p><span><p><span>Stuart Lau</span><span></span></p></span></p></div><p></p><figcaption>Watch: Thousands march in Argentina over murder of girl and two young women</figcaption><p></p><div><p>Thousands of people have taken part in an anti-femicide protest in Buenos Aires, demanding justice for a girl and two young women who were tortured and murdered in a crime that has shocked Argentina. </p><p>The brutal killings of 15-year-old Lara Gutierrez, and Morena Verdi and Brenda del Castillo, who were both 20, were livestreamed on social media. </p><p>Police believe a drug-trafficking gang was responsible, and that the crime was broadcast as a warning to others. </p><p>They had arrested five suspects - three men and two women - as of Friday, according to National Security Minister Patricia Bullrich, but a 20-year-old Peruvian man they say is the group's leader remains at large. </p></div><div><p>The victims were lured into a van believing they were headed for a party on 19 September, according to investigators.</p><p>But authorities said this was part of a plan to \"punish\" the girl and young women for violating gang code, serving as a warning to others.</p><p>One of the detainees revealed a video of the incident under questioning, according to Javier Alonso, security minister for the Buenos Aires province.</p><p>In it, a gang leader is heard saying: \"This is what happens to those who steal drugs from me.\"</p><p>Authorities have released a photograph of the alleged Peruvian mastermind in the hope he is recognised.</p><p>The bodies of the three victims were found buried at a property in a southern suburb of Buenos Aires on Wednesday, five days after they went missing.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/7592/live/e3127c00-9c0e-11f0-928e-73648c8cc266.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/7592/live/e3127c00-9c0e-11f0-928e-73648c8cc266.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/7592/live/e3127c00-9c0e-11f0-928e-73648c8cc266.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/7592/live/e3127c00-9c0e-11f0-928e-73648c8cc266.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/7592/live/e3127c00-9c0e-11f0-928e-73648c8cc266.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/7592/live/e3127c00-9c0e-11f0-928e-73648c8cc266.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/7592/live/e3127c00-9c0e-11f0-928e-73648c8cc266.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/7592/live/e3127c00-9c0e-11f0-928e-73648c8cc266.jpg.webp\" alt=\"AFP via Getty Images Relatives and friends attend a demonstration called by rights groups under the banner: \"There are no good or bad victims, only femicide\" \" /><span>AFP via Getty Images</span></p></div><p></p><figcaption>Relatives and friends attend a demonstration called by rights groups under the banner: \"There are no good or bad victims, only femicide\"</figcaption><p></p></figure><div><p>In Buenos Aires, relatives of the victims joined a march to Parliament on Saturday demanding justice for the women and girl.</p><p>\"Women must be protected more than ever,\" Brenda's father, Leonel del Castillo, told reporters at the protest. </p><p>He had earlier said it was impossible for him to identify his daughter's body due to the abuse inflicted on her.</p><p>Antonio del Castillo, grandfather of the 20-year-old cousins, was in tears, as he called the killers \"bloodthirsty\".</p><p>\"You wouldn't do what they did to them to an animal,\" he said.</p><p>One woman is killed by a man every 36 hours in Argentina, according to a femicide monitoring group in the country cited by Agence France-Presse.</p></div></article>"
  },
  {
    "title": "Selena Gomez marries music producer Benny Blanco in California",
    "url": "https://www.bbc.com/news/articles/cvgq5jzxx77o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5b59/live/c9307e00-9c3a-11f0-b741-177e3e2c2fc7.png",
    "tag": "World",
    "date": "2025-09-28T08:05:20.000Z",
    "description": "US pop star and actress Selena Gomez has married music producer Benny Blanco in a ceremony in California.Gomez posted pictures to Instagram of her wearing a white halter-neck wedding gown and Blanco in a dark...",
    "body": "<div><p>US pop star and actress Selena Gomez has married music producer Benny Blanco in a ceremony in California.</p><p>Gomez posted pictures to Instagram of her wearing a white halter-neck wedding gown and Blanco in a dark tuxedo, alongside the caption \"9.27.25\" bookended by love hearts.</p><p>The couple <a target=\"_blank\" href=\"https://www.vogue.com/article/selena-gomez-and-benny-blanco-are-married\">exchanged vows in Santa Barbara on Saturday</a> in front of around 170 guests, including singer-songwriter Taylor Swift, actor Paul Rudd, and Gomez' Only Murders in the Building co-stars Steve Martin and Martin Short, according to fashion magazine Vogue.</p><p>\"My wife in real life,\" Blanco commented on his bride's post.</p></div><div><p>Gomez, 33, and Blanco, 37, <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/cx27wwyqqweo\">became engaged in December 2024</a> after a year of dating, having previously collaborated on several music projects together.</p><p>The couple released the album I Said I Love You First in March, which explores their own love story.</p><p>They previously released the hits Same Old Love and Kill Em with Kindness in 2015, and the 2019 track I Can't Get Enough featuring Tainy and J Balvin.</p><p>Gomez starred in the Disney Channel's Wizards of Waverly Place before beginning her music career in the 2000s. She recently starred in the film Emilia Perez as Jessica Del Monte.</p><p>Blanco released his only solo studio album Friends Keep Secrets in 2018, and has produced records for the likes of Katy Perry, Britney Spears and Kesha.</p></div>"
  },
  {
    "title": "US citizen released by Taliban after nine-month detention",
    "url": "https://www.bbc.com/news/articles/cvgv1y989xjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cbb6/live/32f51bb0-9ca0-11f0-9f21-bd1b21279a32.jpg",
    "tag": "World",
    "date": "2025-09-28T20:53:16.000Z",
    "description": "A US citizen held by the Taliban in Afghanistan for nine months  has been released following negotiations led by Qatari mediators, officials say.The man, identified as Amir Amiry, is the fifth American to be...",
    "body": "<div><p>A US citizen held by the Taliban in Afghanistan for nine months  has been released following negotiations led by Qatari mediators, officials say.</p><p>The man, identified as Amir Amiry, is the fifth American to be freed from detention in Afghanistan this year.  He was on his way back to the US on Sunday. </p><p>US Secretary of State Marco Rubio thanked Qatar for its \"tireless diplomatic efforts\", which he said were crucial in securing Mr Amiry's release.</p><p>The reason for Mr Amiry's detention remains unclear. Rubio said that he had been \"wrongfully detained\".</p></div><div><p>The secretary of state added that more US citizens remain \"unjustly detained\" in Afghanistan and that the Trump administration was working on securing their release.</p><p>Qatar's foreign ministry said it had facilitated the release of Mr Amiry and that he was on his way to Doha before travelling to the US.</p><p>Qatar began negotiating Mr Amiry's release in March - first arranging a meeting between Mr Amiry and US hostage envoy Adam Boehler, sources told CBS news, the BBC's US partner.</p><p>A breakthrough in negotiations was reached this weekend, sources told CBS, which led to Mr Amiry's release.</p><p>It comes after two American citizens were freed in a prisoner swap between the US and the Taliban in January. One of the detainees, Ryan Corbett, was abducted in 2022 while on a work trip. </p><p>The US released Khan Mohammad, a Taliban figure who was imprisoned for life in California on drug trafficking and terrorism charges, in exchange, the Associated Press reported.</p><p>Two other Americans were released later in March. Among them was George Glezmann, who was detained during a tourist visit to Afghanistan in 2022. </p><p>A British couple, Peter and Barbie Reynolds,<a target=\"_blank\" href=\"https://www.bbc.com/news/articles/c0q7l8ewj0wo\"> were released earlier this month</a>, also through Qatari mediation. They had lived in Afghanistan for nearly two decades.</p></div>"
  },
  {
    "title": "Namibia fires: Army sent into Etosha National Park",
    "url": "https://www.bbc.com/news/articles/c9wdne7kdw8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/18ca/live/3bc97ba0-9c8c-11f0-95c6-7592d7636e22.jpg",
    "tag": "World",
    "date": "2025-09-28T17:11:17.000Z",
    "description": "Army sent to battle fire in Namibia tourist hotspot8 hours agoNatasha BootyUniversal Images Group via Getty ImagesEtosha National Park is home to critically endangered black rhinosNamibia says it is sending...",
    "body": "<div><section><ul><li></li><li></li><li></li><li></li><li></li><li></li><li></li><li></li><li></li><li></li><li></li><li></li></ul></section><article><p></p><h2>Army sent to battle fire in Namibia tourist hotspot</h2><p></p><div><div><p>8 hours ago</p></div><p><span><p><span>Natasha Booty</span><span></span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/18ca/live/3bc97ba0-9c8c-11f0-95c6-7592d7636e22.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/18ca/live/3bc97ba0-9c8c-11f0-95c6-7592d7636e22.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/18ca/live/3bc97ba0-9c8c-11f0-95c6-7592d7636e22.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/18ca/live/3bc97ba0-9c8c-11f0-95c6-7592d7636e22.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/18ca/live/3bc97ba0-9c8c-11f0-95c6-7592d7636e22.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/18ca/live/3bc97ba0-9c8c-11f0-95c6-7592d7636e22.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/18ca/live/3bc97ba0-9c8c-11f0-95c6-7592d7636e22.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/18ca/live/3bc97ba0-9c8c-11f0-95c6-7592d7636e22.jpg.webp\" alt=\"Universal Images Group via Getty Images A black rhino crosses a road in Etosha National Park, Namibia.\" /><span>Universal Images Group via Getty Images</span></p></div><p></p><figcaption>Etosha National Park is home to critically endangered black rhinos</figcaption><p></p></figure><div><p>Namibia says it is sending in helicopters and hundreds of soldiers to battle a fire that has ravaged a third of a key nature reserve.</p><p>Etosha National Park is one of southern Africa's top tourist attractions, known for its vast salt pan that can be seen from space. It is also home to critically endangered black rhinos.</p><p>The country's environment ministry believes the fire broke out on Monday at a charcoal production outside the park's borders.</p><p>Almost a week on, it has spread into the park killing at least nine antelope and destroying wildlife habitats, as well as grazing pasture in the Omusati and Oshana regions bordering Angola.</p></div><div><p>Opposition MP Likando Rodrick recently criticised the government for failing to contain the fire, <a target=\"_blank\" href=\"https://www.namibian.com.na/etosha-fire-blamed-on-environment-ministry-being-unprepared/\">saying they should have been better prepared and urging them to beef up</a> their long-term response measures.</p><p>At an emergency meeting on Saturday, it was decided to send 500 more troops to help firefighters, police, and volunteers on the ground, <a target=\"_blank\" href=\"https://x.com/ngurare/status/1971999285521817643\">Prime Minister Tjitunga Elijah Ngurare said on X</a>.</p><p>Covering a total of 22,935 sq km (8,855 sq miles), Etosha National Park is one of the largest in Africa. Some 200, 000 tourists visit the nature reserve every year, according to the government.</p><p><a target=\"_blank\" href=\"https://embassyofnamibia.fr/perch/resources/pdf/etosha-national-park-fact-sheet-etosha.pdf\">It boasts a total of 114 mammal species</a> and attract hundreds of migratory birds including flamingos.</p><p>Experts say wildfires occur naturally in arid savannah <a target=\"_blank\" href=\"https://earthobservatory.nasa.gov/world-of-change/Etosha\">and believe occasional wildfires are a necessary part of keeping ecosystems healthy</a> - provided they are managed closely.</p></div><p></p><h2>You may also be interested in:</h2><p></p><div><ul><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/cx27p7ked9yo\">Namibians warned against holding parties at cemeteries after 'disgraceful' event</a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/cvg97m6mqe9o\">More than 80 buffaloes drown in Namibia after falling off cliff</a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/c4g8vz4z9pjo\">Namibia halts all state funerals amid criticism of the high cost</a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/cy0jkynyln2o\">Namibia marks colonial genocide as reparations hang in the balance</a></li><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/cly8ln5g12wo\">Namibia swears in first female president</a></li></ul></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp\" alt=\"Getty Images/BBC A woman looking at her mobile phone and the graphic BBC News Africa\" /><span>Getty Images/BBC</span></p></div></figure><div><p><span>BBC Africa podcasts</span></p></div></article><hr /></div>"
  },
  {
    "title": "Lola Young 'doing OK' after collapsing on stage in New York ",
    "url": "https://www.bbc.com/news/articles/cr7031gv2m8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/152d/live/a091b3f0-9c77-11f0-8277-67a32d4ec754.jpg",
    "tag": "World",
    "date": "2025-09-28T14:03:32.000Z",
    "description": "12 hours agoGuy LambertCulture reporterLola Young has told fans she is \"doing OK now\" after collapsing on stage during a performance in New York on Saturday. The 24-year old singer was performing at the All...",
    "body": "<div><div><p>12 hours ago</p></div><p><span><p><span>Guy Lambert</span><span>Culture reporter</span></p></span></p></div><div><p>Lola Young has told fans she is \"doing OK now\" after collapsing on stage during a performance in New York on Saturday. </p><p>The 24-year old singer was performing at the All Things Go Festival when she appeared to drop her microphone and fall backwards.</p><p>The incident sparked concern from fans and other performers at the event.</p><p>In a statement posted on social media, Young reassured fans and thanked them for the supportive messages.</p></div><div><p>\"Hi, for anyone who saw my set at All Things Go today, I am doing OK now,\" she wrote on Instagram.</p><p>\"Thank you for all of your support, Lola.\"</p><p>Videos posted on social media of her performing Conceited from her second album, This Wasn't Meant For You Anyway, show her looking uncomfortable on stage, before collapsing backwards onto the ground.</p><p>Earlier in her set Young told the crowd she had \"had a tricky couple of days\" due to a \"sensitive matter\".</p><p>She added that \"sometimes life throws you lemons\" but you have to \"make lemonade\".</p><p>The south London singer had previously cancelled a performance at New Jersey's Prudential Centre on Friday.</p><p>Taking to the stage to perform after Young, rapper Doechii got the crowd to shout \"we love you Lola\" in a display of support.</p><p>Doechii called her \"an incredibly talented artist\" and pointed out she wasn't feeling well prior to her performance.</p></div><div><p>Lola Young is a former Brit School for Performing Arts and Technology student, a British performing and creative arts school that has notable musical alumni including Adele, Jessie J and Raye.</p><p>She shot to fame after the release of her 2024 hit song Messy, which peaked at number one in the United Kingdom, Australia, Belgium, Croatia, Ireland, and Israel.</p><p>The song was also incredibly popular with Gen Z and on the social media platform TikTok, raising the singer's international profile.</p><p>She became the youngest current British artist have a number one single since Dave in 2022, and the youngest British woman to score a chart-topper since Dua Lipa in 2017.</p><p>Young recently made an appearance at London Fashion Week, performing for the audience at the H&M at 180 Strand show.</p><p>No other performances have yet been cancelled following the incident on Saturday.</p></div>"
  },
  {
    "title": "Iran sanctions reimposed 10 years after landmark nuclear deal",
    "url": "https://www.bbc.com/news/articles/crme84w3n23o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8223/live/7a3ef040-9c05-11f0-92db-77261a15b9d2.jpg",
    "tag": "World",
    "date": "2025-09-28T10:49:28.000Z",
    "description": "Sweeping UN economic and military sanctions have been reimposed on Iran - 10 years after they were lifted in a landmark international deal over its nuclear programme.The new measures took effect as the three...",
    "body": "<div><p>Sweeping UN economic and military sanctions have been reimposed on Iran - 10 years after they were lifted in a landmark international deal over its nuclear programme.</p><p>The new measures took effect as the three European partners to the deal - the UK, France and Germany - activated the so-called \"snapback\" mechanism, accusing Iran of \"continued nuclear escalation\" and lack of co-operation.</p><p>Iran suspended inspections of its nuclear facilities - a legal obligation under the terms of the 2015 deal - after Israel and the US <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/cvg9r4q99g4o\">bombed several of its nuclear sites</a> and military bases in June.</p><p>Its President Masoud Pezeshkian insisted last week that the country had no intention of developing nuclear weapons.</p></div><div><p>The reintroduction of sanctions - which Pezeshkian described as \"unfair, unjust, and illegal\" - is the latest blow to a deal that was heralded as a turning point in Western relations with the long-ostracised Islamist nation when it was first struck.</p><p>The Joint Comprehensive Plan of Action (JCPOA) places limits on Iran's nuclear installations, its stockpiles of enriched uranium, and the amount of research and development it can undertake.</p><p>It aims to allow Iran to develop its nuclear power infrastructure without straying into making nuclear weaponry.</p><p>Iran stepped up its banned nuclear activity after Donald Trump pulled the US out of the agreement during his first term as president in 2018.</p><p>He has persistently criticised the deal, negotiated under his predecessor Barack Obama, as flawed, vowing to negotiate better terms.</p><p>The US and Israeli bombing of nuclear facilities in June was intended to reverse some of Iran's nuclear progress, as well as punish it for arming regional proxies that have repeatedly attacked Israel.</p><p>While Trump said these had caused \"monumental damage\", others cast doubt on the extent to which they had hindered Iran's nuclear programme.</p><p>Iran said the strikes \"fundamentally changed the situation\" and rendered international support for the nuclear deal \"obsolete\".</p></div><div><p>European allies that remain party to the deal still hope negotiations will yield a cooling of tensions.</p><p>\"We urge Iran to refrain from any escalatory action,\" they said in a joint statement, adding: \"The reimposition of UN sanctions is not the end of diplomacy.\"</p><p>Talks between the three countries and Iran on the sidelines of the UN General Assembly earlier this week failed to produce a deal which would have delayed the sanctions being reimposed.</p><p>The foreign ministers of the so-called E3 said they had \"no choice\" but to trigger the snapback procedure, as Iran had \"repeatedly breached\" its commitments.</p><p>They cited Iran's failure to \"take the necessary actions to address our concerns, nor to meet our asks on extension, despite extensive dialogue\".</p><p>Specifically, they mentioned Tehran's refusal to co-operate with the UN nuclear watchdog, the International Atomic Energy Agency (IAEA).</p><p>\"Iran has not authorised IAEA inspectors to regain access to Iran's nuclear sites, nor has it produced and transmitted to the IAEA a report accounting for its stockpile of high-enriched uranium,\" the statement read.</p><p>The suspension of IAEA inspections began following the US/Israeli bombings, but the agency confirmed on Friday that they had resumed.</p><p>In a statement on Sunday, Iran said it did not recognise the \"illegal\" and \"unjustifiable\" sanctions.</p><p>Its foreign ministry warned that \"any action aimed at undermining the rights and interests of its people will face a firm and appropriate response\".</p><p>Pezeshkian has softened earlier threats of Iran quitting the Non-Proliferation Treaty altogether - but has warned that a return of sanctions would put negotiations in jeopardy.</p><p>He told reporters on Friday that Tehran would need reassurances that its nuclear facilities would not be attacked by Israel in order to normalise its nuclear enrichment programme.</p><p>He also rejected a US demand to hand over all of Iran's stockpile of enriched uranium in return for a three-month exemption from sanctions, saying: \"Why would we put ourselves in such a trap and have a noose around our neck each month?\"</p><p>Western powers and the IAEA say they are not convinced by Iran's insistence that its nuclear programme has purely peaceful purposes.</p><p>Israel welcomed the reinstatement of sanctions as a \"major development in response to Iran's ongoing violations\", saying the international community should use \"every tool\" to prevent Iran becoming a nuclear power.</p></div>"
  },
  {
    "title": "At least four dead and several injured in shooting at Mormon church in Michigan",
    "url": "https://www.bbc.com/news/articles/ceq2vd15glwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f76b/live/b72b1700-9c95-11f0-928c-71dbb8619e94.jpg",
    "tag": "World",
    "date": "2025-09-29T01:25:43.000Z",
    "description": "At least four people have been killed and several others injured after a gunman drove a vehicle into a Michigan church, opened fire and set the building ablaze, police say.Officials said the attack on the...",
    "body": "<div><p>At least four people have been killed and<b> </b>several others injured after a gunman drove a vehicle into a Michigan church, opened fire and set the building ablaze, police say.</p><p>Officials said the attack on the Church of Jesus Christ of Latter-day Saints in Grand Blanc, a town 60 miles (100km) northwest of Detroit, happened during a Sunday service that attracts hundreds of people.</p><p>The suspect, identified as Thomas Jacob Sanford, 40, from Burton, Michigan, was later shot dead by police in the church car park. </p><p>Authorities are investigating the incident as an \"act of targeted violence\", but say the motive remains unclear.</p></div><div><p>Two victims died from gunshot wounds, Grand Blanc Township Police Chief William Renye told a news conference on Sunday. </p><p>The fire caused extensive damage to the building and some people remained unaccounted for, Chief Renye said, adding the exact number was not known.</p><p>Earlier, he said \"hundreds\" of people were attending services at about 10:25 local time (15:25GMT) when a gunman drove a vehicle into the building.</p><p>The attacker then opened fire with an assault-style rifle, \"firing several rounds at individuals within the church,\" he said.</p><p>The police responded immediately to the scene, he said, adding officers \"engaged in gunfire with that particular individual, neutralising that suspect\". He was killed at 10:33 local time, eight minutes after the shooting.</p><p>\"We are still trying to determine exactly when and where the fire ended up coming from and how it got started,\" the police chief said. \"We believe it was deliberately set, though, by the suspect.\"</p><p>Investigators are conducting a search of the suspect's property and examining his cell-phone records as they work to establish a motive.</p><p>The FBI is leading the investigation and has deployed crisis response teams, bomb technicians and others to the scene, said Reuben Coleman, the acting special agent in charge of the FBI's Detroit field office.</p><p>Michigan State Police spokeswoman Kim Vetter told reporters that officers have been responding to additional bomb threats at multiple other locations.</p><p>\"We've responded and cleared those locations,\" she said.</p><p>In a statement, <a target=\"_blank\" href=\"https://newsroom.churchofjesuschrist.org/article/statement-violence-chapel-grand-blanc-michigan\">the Church of Jesus Christ of Latter-day Saints </a>confirmed a gunman opened fire during worship services, and \"multiple individuals were injured\".</p><p>\"We pray for peace and healing for all involved,\" it said.</p><p>Grand Blanc police said that 100 FBI agents have been deployed to assist with the investigation. </p><p>President Donald Trump said he had been briefed on the shooting, and confirmed the FBI will be leading the federal investigation. </p><p>Writing on Truth Social, he described it as \"yet another targeted attack on Christians in the United States of America\".</p><p>US Attorney General Pam Bondi said in a post on X that she had received briefings on \"what appears to be a horrific shooting and fire\" at the church. </p><p>\"Such violence at a place of worship is heartbreaking and chilling,\" Bondi said. \"Please join me in praying for the victims of this terrible tragedy.\"</p><p>Michigan Governor Gretchen Whitmer condemned the incident, saying: \"Violence anywhere, especially in a place of worship, is unacceptable,\" adding that she was monitoring the situation.</p></div>"
  },
  {
    "title": "Zelensky condemns 'vile' Russian strikes lasting 12 hours",
    "url": "https://www.bbc.com/news/articles/c75qeqr5905o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7e0c/live/0796d830-9c48-11f0-b741-177e3e2c2fc7.jpg",
    "tag": "World",
    "date": "2025-09-28T11:46:41.000Z",
    "description": "14 hours agoJames WaterhouseKyiv correspondent, andRachel Muller-HeyndykResidential area of Kyiv hit by latest Russian barrage across UkraineA Russian aerial bombardment that lasted more than 12 hours has...",
    "body": "<article><div><div><p>14 hours ago</p></div><p><span><p><span>James Waterhouse</span><span>Kyiv correspondent,</span><span> and</span></p><p><span>Rachel Muller-Heyndyk</span><span></span></p></span></p></div><p></p><figcaption>Residential area of Kyiv hit by latest Russian barrage across Ukraine</figcaption><p></p><div><p>A Russian aerial bombardment that lasted more than 12 hours has killed at least four people and injured at least 70 others in Ukraine.</p><p>President Volodymyr Zelensky said the deaths all occurred in the capital, Kyiv, where many of the projectiles were aimed, and the victims included a 12-year-old girl.</p><p>The barrage - involving nearly 600 drones and several dozen missiles aimed at seven regions of Ukraine - is one of the heaviest in recent months.</p><p>Zelensky warned that Ukraine would retaliate and said the \"vile\" attack showed Moscow \"wants to continue fighting and killing\". Russia said it struck military facilities and industrial enterprises supporting Ukraine's armed forces.</p></div><div><p>For Ukrainians, aerial bombardments can be both random and routine. </p><p>They tend to occur late on Saturday evenings - in this case, the first sirens were heard at 22:00 GMT. </p><p>The sound of anti-aircraft fire was punctuated with occasional explosions - presumably either from the sound of an intercepted drone or one hitting its target.</p><p>In Kyiv, the country's air alert app urged people to head to shelters and stay there. They were followed by pings warning of an increased aerial threat as hundreds of drones descended on the city. </p><p>Ukraine's Defence Minister Igor Klymenko said that at least 100 civilian sites had been damaged across the country by the attack, with entire neighbourhoods lefts in ruins. </p><p>Emergency services said an attack on Kyiv's Institute of Cardiology had killed a nurse and a patient. </p><p>A large bakery, an automobile rubber factory, as well as apartment buildings and civilian infrastructure were also targeted, Zelensky said. </p></div><div><p>He added that Zaporizhzhia, Khmelnytskyi, Sumy, Mykolaiv, Chernihiv and Odesa regions were also hit.</p><p>Zaporizhzhia's Governor Ivan Fedorov said 34 people had been injured in the region, including three children - two boys, aged 11 and 12, and a nine-year-old girl. </p><p>One boy was caught in an explosion while the other had suffered carbon monoxide poisoning, he said. Both are in a serious condition.</p><p>Sumy's regional governor said a 59-year-old man had died in strikes in the past day.</p><p>Zelensky vowed that Ukraine \"will strike back\" in a bid to \"force diplomacy\" from Russia, and said he was counting on a \"strong reaction\" from Europe and the US. </p><p>\"This dastardly attack took place in fact as the end of the week of the UN General Assembly, and this is how Russia declares its real position,\" he said.</p><p>Zelensky reiterated his support of US President Donald Trump's threat of harsher sanctions on Russia, as well as his call for European allies to curb their Russian oil and gas imports.</p><p>Trump has recently shifted his position on the war, saying for the first time last week that he thought Ukraine could retake the land it had lost from Moscow as the Russian economy flagged under the strain of a prolonged war.</p><p>The US president has so far desisted from imposing further sanctions on Russia, but has appeared increasingly frustrated with the lack of eagerness from the Kremlin to begin peace talks.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/67be/live/c6722380-9c49-11f0-82b3-31d97f4e1ffa.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/67be/live/c6722380-9c49-11f0-82b3-31d97f4e1ffa.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/67be/live/c6722380-9c49-11f0-82b3-31d97f4e1ffa.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/67be/live/c6722380-9c49-11f0-82b3-31d97f4e1ffa.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/67be/live/c6722380-9c49-11f0-82b3-31d97f4e1ffa.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/67be/live/c6722380-9c49-11f0-82b3-31d97f4e1ffa.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/67be/live/c6722380-9c49-11f0-82b3-31d97f4e1ffa.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/67be/live/c6722380-9c49-11f0-82b3-31d97f4e1ffa.jpg.webp\" alt=\"Reuters An explosion of a missile in the sky over the city during a Russian missile and drone strike\" /><span>Reuters</span></p></div><p></p><figcaption>Many of the projectiles were aimed at Kyiv, where the Institute of Cardiology was hit</figcaption><p></p></figure><div><p>Zelensky said on Saturday that Russia would not stop its aggression with Ukraine - which is why it was testing European air defences with the recent incursions in several countries belonging to the Nato military alliance.</p><p>Meanwhile, jets were scrambled in neighbouring Poland early on Sunday as Russia hit western Ukraine, the nation's armed forces said. </p><p>The Polish military described the actions - which have become routine since Polish and Nato aircraft <a target=\"_blank\" href=\"https://www.bbc.com/news/articles/c147065pzdzo\">shot down three Russian drones</a> in Poland's airspace on 10 September - as preventative.</p><p>Denmark's Defence Ministry confirmed on Sunday that it had observed drones over military sites for a <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/c3rvzdq93yro\">second night in a row</a>.</p><p>Nato has now said it will upgrade its mission in the Baltic Sea in response, including enhanced surveillance and stationing at least one air defence frigate there. </p><p>It follows a series of incidents in which drones appeared over Danish airports, causing disruption to air traffic. Danish officials said they had no evidence to suggest Russian involvement in what they described as a concerted attack, while Moscow denied responsibility.</p><p>Along with Poland, Estonia and Romania have also accused Russia of violating their airspace, prompting a renewed Nato to bolster the alliance's eastern flank. </p><p>Trump has gone as far as to say that Nato nations should shoot down Russian planes in their airspace.</p><p>In a <a target=\"_blank\" href=\"https://www.bbc.com/news/articles/c5ygjv0r2myo\">speech to the UN General Assembly</a> on Saturday, Russia's Foreign Minister Sergei Lavrov said his country had no intention of attacking EU or Nato member states - but warned of a \"decisive response\" to any \"aggression\" directed towards Moscow.</p></div></article>"
  },
  {
    "title": "As US-Venezuela tensions rise, Maduro trains civilians for \"undeclared war\"",
    "url": "https://www.bbc.com/news/articles/c5y5q173053o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/be2f/live/a41a1560-9a1c-11f0-928c-71dbb8619e94.jpg",
    "tag": "World",
    "date": "2025-09-27T23:30:46.000Z",
    "description": "The US navy killed 17 in deadly strikes. Now Venezuela is giving civilians guns1 day agoNicole KolsterReporting for BBC News Mundo from CaracasNicole Kolster/BBCEdith Perales joined the militia years ago When...",
    "body": "<article><p></p><h2>The US navy killed 17 in deadly strikes. Now Venezuela is giving civilians guns</h2><p></p><div><div><p>1 day ago</p></div><p><span><p><span>Nicole Kolster</span><span>Reporting for BBC News Mundo from Caracas</span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/8315/live/f07ba3e0-9a19-11f0-92db-77261a15b9d2.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/8315/live/f07ba3e0-9a19-11f0-92db-77261a15b9d2.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/8315/live/f07ba3e0-9a19-11f0-92db-77261a15b9d2.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/8315/live/f07ba3e0-9a19-11f0-92db-77261a15b9d2.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/8315/live/f07ba3e0-9a19-11f0-92db-77261a15b9d2.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/8315/live/f07ba3e0-9a19-11f0-92db-77261a15b9d2.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/8315/live/f07ba3e0-9a19-11f0-92db-77261a15b9d2.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/8315/live/f07ba3e0-9a19-11f0-92db-77261a15b9d2.jpg.webp\" alt=\"Nicole Kolster/BBC Edith Perales looks at the camera through a window. He is wearing a uniform in camouflage colours and a hat with the emblem of the militia. He has a grey moustache and greying temples. \" /><span>Nicole Kolster/BBC</span></p></div><p></p><figcaption>Edith Perales joined the militia years ago </figcaption><p></p></figure><div><p>When Edith Perales was younger, he enlisted in the National Bolivarian Militia, a civilian force created by the late President Hugo Chávez in 2009 to help defend Venezuela.</p><p>\"We have to be a country capable of defending every last inch of our territory so no one comes to mess with us,\" Chávez said at the time.</p><p>Sixteen years on, Perales, who is now 68, is joining thousands of other militia members getting ready for a potential US attack.</p><p>The rag-tag force, mainly made up of senior citizens, has been called up following the deployment of US navy ships in the South Caribbean on what US officials said were counter-narcotics operations.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/abd7/live/4205f800-9a1a-11f0-92bd-0166dfabcb1b.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/abd7/live/4205f800-9a1a-11f0-92bd-0166dfabcb1b.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/abd7/live/4205f800-9a1a-11f0-92bd-0166dfabcb1b.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/abd7/live/4205f800-9a1a-11f0-92bd-0166dfabcb1b.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/abd7/live/4205f800-9a1a-11f0-92bd-0166dfabcb1b.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/abd7/live/4205f800-9a1a-11f0-92bd-0166dfabcb1b.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/abd7/live/4205f800-9a1a-11f0-92bd-0166dfabcb1b.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/abd7/live/4205f800-9a1a-11f0-92bd-0166dfabcb1b.jpg.webp\" alt=\"Nicole Kolster/BBC An older woman wearing a red baseball cap struggles to hold up a rifle as she lies on the ground. She is looking at the ground while the rifle also points at the tarmac. In the background there are several people wearing camouflage uniforms and military boots. \" /><span>Nicole Kolster/BBC</span></p></div><p></p><figcaption>Many of those training with the militia said they had never handled a weapon</figcaption><p></p></figure><div><p><b>Read:</b> <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/cdjzw3gplv7o\">What do we know about the US strike on 'Venezuela drug boat' and was it legal?</a></p><p>The US force has destroyed at least three boats it said were carrying drugs from Venezuela to the US, killing at least 17 people on board.</p><p>Venezuela's defence minister, Vladimir Padrino, said the attacks and the US naval deployment amounted to a \"non-declared war\" by the US against Venezuela and President Nicolás Maduro swiftly called the militia into active duty.</p><p>Perales has got his uniform and boots at hand, ready to defend his \"bastion\" – the Caracas neighbourhood where he lives.</p><p>He lives in 23 de Enero, an area in the capital which has traditionally been a stronghold of Chavismo - the leftist ideology founded by the late President Chávez and adopted by his handpicked successor in office, Nicolás Maduro.</p><p>A loyal government supporter, he says he is \"ready to serve whenever they call me\".</p><p>\"We have to defend the fatherland,\" he tells the BBC, echoing speeches given by President Maduro in the wake of the strikes on the boats.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/8348/live/a75925b0-9a1a-11f0-89b7-f92e020b4774.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/8348/live/a75925b0-9a1a-11f0-89b7-f92e020b4774.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/8348/live/a75925b0-9a1a-11f0-89b7-f92e020b4774.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/8348/live/a75925b0-9a1a-11f0-89b7-f92e020b4774.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/8348/live/a75925b0-9a1a-11f0-89b7-f92e020b4774.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/8348/live/a75925b0-9a1a-11f0-89b7-f92e020b4774.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/8348/live/a75925b0-9a1a-11f0-89b7-f92e020b4774.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/8348/live/a75925b0-9a1a-11f0-89b7-f92e020b4774.jpg.webp\" alt=\"Nicole Kolster/BBC A woman wearing blue trousers and a black T-shirt walks past a grey wall with colourful graffiti reading reads: 'If you mess with Maduro, you mess with the neighbourhood\"\" /><span>Nicole Kolster/BBC</span></p></div><p></p><figcaption>Graffiti in a pro-government neighbourhood reads: 'If you mess with Maduro, you mess with the neighbourhood\"</figcaption><p></p></figure><div><p>While experts have told the BBC that the deployment of US naval forces in the South Caribbean is large, they have also pointed out that it is not large enough to suggest that it is part of a planned invasion.</p><p>There is little doubt though that the relationship between Venezuela and the US - which has long been strained - has deteriorated further since Donald Trump returned to office.</p><p>The US is among a raft of nations which have not recognised the re-election of Maduro in July 2024, pointing to evidence gathered by the Venezuelan opposition with the help of independent observers showing that his rival, Edmundo González, won the election by a landslide.</p><p>Shortly after coming into office for the second time, Trump declared the Venezuelan criminal gang, Tren de Aragua, a terrorist group, which he has used as justification for deporting Venezuelan migrants from the US and for the recent military action in the Caribbean.</p><p>The Trump administration has also accused Maduro of being in league with drug cartels and recently doubled the reward it is offering for information leading to his capture to $50m (£37.3m).</p><p>Maduro has vehemently rejected Washington's accusations and has defended his government's actions against drug trafficking.</p><p>But the Maduro government has also co-operated with the Trump administration by taking back Venezuelan migrants deported from the US, whom US officials had accused of being gang members.</p><p>After the first boat strike, Maduro also sent a letter to his US counterpart calling for a meeting – an approach which has been rebuffed by the White House.</p><p>But his rhetoric internally has remained combative.</p><p>Maduro has ordered the Venezuelan military - the National Bolivarian Armed Forces (FANB) - to train local militias like the one to which Edith Perales belongs.</p><p>These groups are mostly made up of volunteers from poor communities, although public sector workers have reported being pressured into joining them as well.</p><p>In the past, the militia has mainly been used to boost numbers at political rallies and parades.</p><p>Its members tend to be much older than those who join the feared \"colectivos\" – gangs of hard-core government supporters which have been accused of committing human rights abuses and which are often used to break up anti-government protests.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/101f/live/53ad5240-9af8-11f0-928c-71dbb8619e94.png.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/101f/live/53ad5240-9af8-11f0-928c-71dbb8619e94.png.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/101f/live/53ad5240-9af8-11f0-928c-71dbb8619e94.png.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/101f/live/53ad5240-9af8-11f0-928c-71dbb8619e94.png.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/101f/live/53ad5240-9af8-11f0-928c-71dbb8619e94.png.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/101f/live/53ad5240-9af8-11f0-928c-71dbb8619e94.png.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/101f/live/53ad5240-9af8-11f0-928c-71dbb8619e94.png.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/101f/live/53ad5240-9af8-11f0-928c-71dbb8619e94.png.webp\" alt=\"A map showing Venezuela and the Caribbean Sea off its north coast. There is a photograph of a US warship with a locator pointing to the sea just south of Puerto Rico, to show the approximate area where several US warships have been spotted. A photo of F-35 fighter jets has a locator pointing to Puerto Rico, with text to explain that F-35 jets have been deployed to Puerto Rico. \" /></p></div></figure><div><p>But seemingly jittery in the face of what it perceives as a US threat, Maduro's government is now training up the militia.</p><p>On a Saturday afternoon, soldiers fan out in Caracas' Petare neighbourhood to fulfil Maduro's order that \"the barracks come to the people\".</p><p>The soldiers' task is to teach the locals how to handle arms to respond to \"the enemy\".</p><p>The training scenario includes tanks, Russian-made rifles - not loaded - and instruction posters.</p><p>A soldier is giving instructions to a small group on a loud speaker.</p><p>\"The important thing is to familiarise yourselves with the weapons; we aim at the target and make a hit.\"</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/9805/live/2b5153b0-9a1b-11f0-89b7-f92e020b4774.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/9805/live/2b5153b0-9a1b-11f0-89b7-f92e020b4774.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/9805/live/2b5153b0-9a1b-11f0-89b7-f92e020b4774.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/9805/live/2b5153b0-9a1b-11f0-89b7-f92e020b4774.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/9805/live/2b5153b0-9a1b-11f0-89b7-f92e020b4774.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/9805/live/2b5153b0-9a1b-11f0-89b7-f92e020b4774.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/9805/live/2b5153b0-9a1b-11f0-89b7-f92e020b4774.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/9805/live/2b5153b0-9a1b-11f0-89b7-f92e020b4774.jpg.webp\" alt=\"Nicole Kolster/BBC People walk past armoured vehicles in a street in the capital, Caracas. In the background, tents can be seen. \" /><span>Nicole Kolster/BBC</span></p></div><p></p><figcaption>Armoured vehicles were on display at one of the militia exercises in Caracas</figcaption><p></p></figure><div><p>Everyone in the neighbourhood, including women and children, is listening.</p><p>Most of the volunteers taking part in the training exercise have no experience in armed fighting, but what they lack in experience they make up for in enthusiasm.</p><p>\"If I have to lay down my life in battle, I'll do it,\" Francisco Ojeda, one of the locals taking part, tells BBC News Mundo.</p><p>The 69-year-old hurls himself on the sun-baked tarmac and holds a combat position as he clutches an AK-103 rifle. A soldier corrects his form.</p><p>\"Even the cats will come out here to shoot, to defend our fatherland,\" he says.</p><p>His eagerness is matched by that of Glady Rodríguez, a 67-year-old woman who recently joined the militia. \"We are not going to allow any US government to come and invade,\" she insists.</p><p>Home-maker Yarelis Jaimes, 38, is a little more hesitant. \"This is the first time I grab such a weapon,\" she says. \"I feel a bit nervous, but I know that I can do it.\"</p><p>But while the residents in Petare are learning to handle a rifle, outside of Maduro's strongholds, life goes on as normal, with few seeming to give much thought to the possibility of an invasion.</p><p>Even just a few metres from where Francisco Ojeda was taking position in the dusty street, residents go about their daily routine unperturbed. Street sellers display their wares, while other people do the shop for the weekend without even glancing at the militia members carrying out their exercises.</p><p>Benigno Alarcón, a political analyst at the Andrés Bello Catholic University, says Maduro's plan for the militia is not for it to engage in battle but rather to act as a \"human shield\".</p><p>Prof Alarcón argues that by calling up civilians, the Maduro government wants to increase the human cost any potential US military action would incur by making the possibility of human casualties much higher.</p><p>According to Prof Alarcón, it therefore does not matter if the militia are not well trained or even if they are unarmed.</p><p>Maduro has claimed that more than 8.2 million civilians are enlisted in the militia and in the reserves, but this figure has been widely questioned.</p><p>Perales, who has been in the militia for decades, sees his role as a  \"defender\" of his street, the neighbourhood where he lives, what he knows.</p><p>While he has taken part in previous training exercises, he has opted out of the more recent ones, due to his age and health.</p><p>But were a conflict to happen, he says he is ready: \"We must defend the territory. To wear the uniform already implies a responsibility.\"</p></div></article>"
  },
  {
    "title": "Hilda Baci: Nigeria's jollof champion and record-breaking chef",
    "url": "https://www.bbc.com/news/articles/crl50yrgpj7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fdd7/live/69b81220-9a1f-11f0-89b7-f92e020b4774.jpg",
    "tag": "World",
    "date": "2025-09-26T23:35:29.000Z",
    "description": "The record-breaking Nigerian chef ready to take on the world2 days agoDamian ZaneAFP via Getty ImagesNigerian celebrity chef and double Guinness World Record breaker Hilda Baci makes no secret about what...",
    "body": "<article><p></p><h2>The record-breaking Nigerian chef ready to take on the world</h2><p></p><div><div><p>2 days ago</p></div><p><span><p><span>Damian Zane</span><span></span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/fdd7/live/69b81220-9a1f-11f0-89b7-f92e020b4774.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/fdd7/live/69b81220-9a1f-11f0-89b7-f92e020b4774.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/fdd7/live/69b81220-9a1f-11f0-89b7-f92e020b4774.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/fdd7/live/69b81220-9a1f-11f0-89b7-f92e020b4774.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/fdd7/live/69b81220-9a1f-11f0-89b7-f92e020b4774.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/fdd7/live/69b81220-9a1f-11f0-89b7-f92e020b4774.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/fdd7/live/69b81220-9a1f-11f0-89b7-f92e020b4774.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/fdd7/live/69b81220-9a1f-11f0-89b7-f92e020b4774.jpg.webp\" alt=\"AFP via Getty Images A head and shoulders image of Hilda Baci, wearing a white chef's uniform and hair covering. She has a broad smile on her face.\" /><span>AFP via Getty Images</span></p></div></figure><div><p>Nigerian celebrity chef and double Guinness World Record breaker Hilda Baci makes no secret about what drives her success.</p><p>\"[It's] my love for money and the good things in life,\" the 30-year-old says unabashedly, laughing on a call from Lagos.</p><p>There is nothing bashful about Baci - who has changed the spelling of her last name from the original Bassey. She clearly thrives in the limelight and embraces the glamour that comes with being her country's most celebrated foody.</p><p>But there are really two Hilda Bacis. She admits that there is Hilda Baci the person, which is what her family and partner sees, and then there is Hilda Baci the brand, whose image is carefully curated.</p><p>\"I'm a businesswoman first, which means that whatever I'm doing, it is important that my business come first,\" she says.</p><p>Under the My Food by Hilda name, which has more than a million followers on Instagram - along with the 3.2 million on her personal account - she runs a well-known restaurant in Lagos, as well as offering cookery classes and a private chef service.</p><p>\"It feels good to be an inspiration,\" she says, \"but it comes with a little bit of pressure because a lot of people now look to me for guidance and answers... I don't allow that to overwhelm me and lose focus on what I'm trying to achieve.\"</p><p>The cooking influencer, who was born in Calabar in the south but at five moved to the capital, Abuja, with her mother, older brother and younger sister, got a taste of standing out at an early age.</p><p>Baci's mother ran an eatery opposite the ministry of defence in Abuja and she remembers that after a day at primary school she would go there to help out.</p><p>\"I always got so many tips because I used to memorise the whole menu and I was very sharp mouthed. So I would shout out: 'Oh what do you guys want to have? We have fufu, garri, semo,'\" she says, mimicking a child's voice as she lists her country's staple foods.</p><p>The culinary expert first hit the headlines in 2023 with her four-day non-stop cook-a-thon, which at 93 hours and 11 minutes broke a world record. Although her record has since been surpassed, the exploit gained the attention of politicians and celebrities and inspired a <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/world-africa-66194990\">craze for feats of endurance across Nigeria</a>.</p><p>Then, earlier this month, she set a new Guinness record after cooking more than 8.7 tonnes of the renowned West African dish, jollof rice, in one specially made pot.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/8ce1/live/cd2800e0-9a1f-11f0-97f5-bd38218a3641.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/8ce1/live/cd2800e0-9a1f-11f0-97f5-bd38218a3641.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/8ce1/live/cd2800e0-9a1f-11f0-97f5-bd38218a3641.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/8ce1/live/cd2800e0-9a1f-11f0-97f5-bd38218a3641.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/8ce1/live/cd2800e0-9a1f-11f0-97f5-bd38218a3641.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/8ce1/live/cd2800e0-9a1f-11f0-97f5-bd38218a3641.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/8ce1/live/cd2800e0-9a1f-11f0-97f5-bd38218a3641.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/8ce1/live/cd2800e0-9a1f-11f0-97f5-bd38218a3641.jpg.webp\" alt=\"Reuters Hilda Baci pours chili powder into a giant pot. She is wearing a white chef's top and red apron. Helpers- all dressed in red - are standing around the pot.\" /><span>Reuters</span></p></div><p></p><figcaption>Baci's jollof cooking record was months in the planning</figcaption><p></p></figure><div><p>Baci's prominence is not accidental or a flash-in-the-pan.</p><p>It is built on an awareness of how to grow her image and is the result of careful planning. For instance, she began thinking about the jollof record more than a year before the event.</p><p>And when it came to the initial record, the cook-a-thon, \"I thought about the opportunity cost: How does it impact my business? What does this do for my brand?\"</p><p>But despite this apparent single-minded drive, she did not immediately land on being a chef as a career.</p><p>She initially wanted to be a lawyer, then she wanted to study international relations and then eventually she graduated in sociology.</p><p>Baci also had ambitions to be an actress and TV presenter – \"all the fun, all the glam stuff\".</p><p>But it was perhaps as a child seeing how her mother's life was transformed through making a success from selling food that planted a seed that would later bloom.</p><p>At university she began cooking food for organisations and clubs there and found she was good at it.</p><p>With her brother she then started a food delivery business, but she also got a job on TV and was drawn to presenting the cooking segment on a breakfast show.</p><p>Eventually that led to her own programme – Dine on a Budget – where she interviewed celebrities as she prepared a cheap three-course meal. At the same time, she was working as a private chef.</p><p>Her victory in a competition called Jollof Face-Off against a chef from regional rival Ghana also helped raise her profile and netted her $5,000 (£3,700). </p><p>All this was building towards establishing the My Food by Hilda brand. </p><p>While acknowledging her mother's influence and thanking her for not forcing her into a white-collar job, as a devout Christian she also feels that God had a role.</p><p>\"I believe that when you're doing something that God wants you to be doing, He lets you know, and He makes the response.\"</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/929b/live/05ae6970-9ae5-11f0-b741-177e3e2c2fc7.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/929b/live/05ae6970-9ae5-11f0-b741-177e3e2c2fc7.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/929b/live/05ae6970-9ae5-11f0-b741-177e3e2c2fc7.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/929b/live/05ae6970-9ae5-11f0-b741-177e3e2c2fc7.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/929b/live/05ae6970-9ae5-11f0-b741-177e3e2c2fc7.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/929b/live/05ae6970-9ae5-11f0-b741-177e3e2c2fc7.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/929b/live/05ae6970-9ae5-11f0-b741-177e3e2c2fc7.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/929b/live/05ae6970-9ae5-11f0-b741-177e3e2c2fc7.jpg.webp\" alt=\"Hilda Baci is standing by a stove and is pinching something into a pot. She is wearing a black apron and has a cloth covering her head.\" /></p></div><p></p><figcaption>The 2023 four-day cook-a-thon transformed Baci's public profile </figcaption><p></p></figure><div><p>One expectation that she finds she has to constantly bat away is about marriage and fulfilling a gender role.</p><p>\"Oh my God, every day - in my [social media] comments section… people are asking 'when are you getting married? When are you getting married?'</p><p>\"I feel like that's a thing in this part of the world, where it's like if you're not married maybe your achievement is not complete. But I'm grateful for the progress that we've been able to make, people like myself and so many other amazing women, without the married title.</p><p>\"Of course I want to get married, I'm a lover girl, but that's not something I pressure myself about. My desire to get married is because I'm with somebody I'm happy with and in love with, it's not because society wants me to get married now.\"</p><p>But that is Hilda Baci the person. When she thinks about Hilda Baci the brand she has a clear ambition.</p><p>\"I want to build a legacy that is going to follow me... you know when they say: 'This company has lasted 100 years' – that is the vision I have for my business.\"</p><p>As part of that she wants to open outlets across the world, including in the UK, US, Canada and South Africa, and help make Nigerian cuisine to be as well known worldwide as the Chinese equivalent.</p><p>Jollof is already on the map, but with a typical serving of self-belief Baci is also keen to share another rice dish.</p><p>\"I have a signature coconut rice recipe that I want to go global, I want every household to have it on their menu.\"</p></div><div><p><span>You may also be interested in:</span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/0a19/live/7c722dc0-089d-11ef-b9d8-4f52aebe147d.jpg.webp\" alt=\"Getty Images/BBC A woman looking at her mobile phone and the graphic BBC News Africa\" /><span>Getty Images/BBC</span></p></div></figure><div><p><span>BBC Africa podcasts</span></p></div></article>"
  },
  {
    "title": "Three dead and several injured after shooting at US waterfront bar",
    "url": "https://www.bbc.com/news/articles/cq65qj67lpyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/64b6/live/a6e984b0-9c6f-11f0-8277-67a32d4ec754.jpg",
    "tag": "World",
    "date": "2025-09-28T14:19:05.000Z",
    "description": "Three people have died and several others were injured after a shooter opened fire from a boat at a crowded waterfront bar in Southport, North Carolina, officials say.The attack happened on Saturday evening...",
    "body": "<div><p>Three people have died and several others were injured after a shooter opened fire from a boat at a crowded waterfront bar in Southport, North Carolina, officials say.</p><p>The attack happened on Saturday evening outside the American Fish Company at the Southport Yacht Basin.</p><p>City spokesperson ChyAnn Ketchum said a boat pulled up to the dock around 21:30 local time (01:30 GMT) before the attacker opened fire. The assailant then fled by boat towards the Intracoastal Waterway. </p><p>Officials said a suspect matching the description was arrested half an hour later by the US Coast Guard in nearby Oak Island, around 12 miles (19km) west of the scene. </p></div><div><p>The suspect's identity has not been released by the police.</p><p>Southport Police Chief Todd Coring described the incident as \"a very tragic night\" for the community.</p><p>The town is home to just under 4,000 people. \"We're a small community, one of the communities where everybody knows everybody,\" Chief Coring said.</p><p>He said that possibly six people were injured, who are now being treated in hospital. The deceased have not been identified by the police.</p><p>The incident prompted officials in Southport to issue a statement urging people to remain in their homes while an active shooter investigation was ongoing.</p><p>\"I'm comfortable to say that we don't feel like there's any additional threats to the community,\" Chief Coring said after.</p></div>"
  },
  {
    "title": "Pro-EU party in Moldova wins election mired in claims of Russian interference",
    "url": "https://www.bbc.com/news/articles/cx2rdlj8ejgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2fc3/live/79042050-9c47-11f0-82b3-31d97f4e1ffa.jpg",
    "tag": "World",
    "date": "2025-09-29T00:11:53.000Z",
    "description": "1 hour agoSarah Rainsford, Eastern and Southern Europe correspondentIn Chisinau andPaul KirbyEurope digital editor in LondonAnadolu via Getty ImagesMoldovan President Maia Sandu warned voters their democracy...",
    "body": "<article><div><div><p>1 hour ago</p></div><p><span><p><span>Sarah Rainsford, Eastern and Southern Europe correspondent</span><span>In Chisinau</span><span> and</span></p><p><span>Paul Kirby</span><span>Europe digital editor in London</span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/2fc3/live/79042050-9c47-11f0-82b3-31d97f4e1ffa.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/2fc3/live/79042050-9c47-11f0-82b3-31d97f4e1ffa.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/2fc3/live/79042050-9c47-11f0-82b3-31d97f4e1ffa.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/2fc3/live/79042050-9c47-11f0-82b3-31d97f4e1ffa.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/2fc3/live/79042050-9c47-11f0-82b3-31d97f4e1ffa.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/2fc3/live/79042050-9c47-11f0-82b3-31d97f4e1ffa.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/2fc3/live/79042050-9c47-11f0-82b3-31d97f4e1ffa.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/2fc3/live/79042050-9c47-11f0-82b3-31d97f4e1ffa.jpg.webp\" alt=\"Anadolu via Getty Images Moldova's president dressed in a blue suit and with brunette hair poses for the cameras as she casts a ballot \" /><span>Anadolu via Getty Images</span></p></div><p></p><figcaption>Moldovan President Maia Sandu warned voters their democracy was young and fragile and Russia endangered it</figcaption><p></p></figure><div><p>The pro-European party of Moldovan President Maia Sandu is heading for victory and a new majority in parliament in elections seen as critical for her country's future path to the EU.</p><p>Sandu, who had warned of \"massive Russian interference\" after voting on Sunday, said the future of her country, flanked by Ukraine and Romania, was at stake.</p><p>With 96% of the 1.6m votes counted, Sandu's Party of Action and Solidarity (PAS) was close to winning 50% of the vote, well ahead of the pro-Russian Patriotic Electoral Bloc on under 25%. Turnout was over 52%, higher than in recent years.</p><p>One of the main opposition leaders, Igor Dodon, had claimed victory even before results started coming in and called for protests outside parliament on Monday.</p></div><div><p>Recent Moldovan votes have been far closer, but it eventually became clear that Sandu's party was on course for another majority in the 101-seat parliament.</p><p>Four years ago, the president's party won 52.8% of the vote, and based on latest results it is now set to clinch 54 seats.</p><p>To form a government it will not need to rely on support from other parties, such as the Alternativa bloc or the populist Our Party.</p></div><div><p>In a measure of the tension surrounding the vote, bomb scares were reported at polling stations in Italy, Romania, Spain and the US.</p><p>Similar scares were reported in Moldova itself and three people were arrested on suspicion of plotting unrest the day after the vote. The head of Sandu's party, Igor Grosu, blamed criminal groups backed by Moscow for Sunday's incidents and appealed for \"patience and calm\" to let the electoral process continue.</p><p>Moldova also has a pro-Russian breakaway enclave called Transnistria along its border with Ukraine, complete with a Russian military presence. </p><p>Residents in this sliver of land have Moldovan passports. Many are strongly pro-Moscow and Socialist party leader Igor Dodon said there had been \"all sorts of harassment, stopping them from voting\".</p></div><p></p><figcaption>Sarah Rainsford reports from Moldova's administrative border with Transnistria</figcaption><p></p><div><p>Moldovans have been buffeted by Russia's full-scale war in neighbouring Ukraine, but they are also grappling with spiralling prices and high levels of corruption.</p><p>President Sandu, 53, who won a second term of office last November, warned Moldovans the future of their democracy was in their hands: \"Don't play with your vote or you'll lose everything!\"</p><p>Dodon, who is one of Sandu's main rivals, went on national TV as soon as polls closed to claim his pro-Russian allies in the Patriotic Electoral Bloc had won the election, despite there being no exit polls and before any early results were declared.</p></div><div><p>Thanking Moldovans for voting \"in record numbers\", Dodon called on the PAS government to leave power, and for supporters of all opposition parties to take to the streets on Monday to \"defend\" their vote outside parliament at midday.</p><p>\"We will not allow destabilisation,\" he promised. \"The citizens have voted. Their vote must be respected even if you don't like it,\" he added, addressing President Sandu and her party.</p><p>One of the parties in Dodon's bloc was barred from running two days before the vote because of alleged illicit funding. </p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/8079/live/9e92d3b0-9c98-11f0-b741-177e3e2c2fc7.png.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/8079/live/9e92d3b0-9c98-11f0-b741-177e3e2c2fc7.png.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/8079/live/9e92d3b0-9c98-11f0-b741-177e3e2c2fc7.png.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/8079/live/9e92d3b0-9c98-11f0-b741-177e3e2c2fc7.png.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/8079/live/9e92d3b0-9c98-11f0-b741-177e3e2c2fc7.png.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/8079/live/9e92d3b0-9c98-11f0-b741-177e3e2c2fc7.png.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/8079/live/9e92d3b0-9c98-11f0-b741-177e3e2c2fc7.png.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/8079/live/9e92d3b0-9c98-11f0-b741-177e3e2c2fc7.png.webp\" alt=\"Map of Moldova showing the Transnistria and Gagauzia\" /></p></div></figure><div><p>In the run-up to the vote, police reported evidence of an unprecedented effort by Russia to spread disinformation and buy votes. Dozens of men were also arrested, accused of travelling to Serbia for firearms training and co-ordinating unrest. <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/c4g5kl0n5d2o\">A BBC investigation uncovered a network</a> promising to pay participants if they posted pro-Russian propaganda and fake news.</p><p>Parties sympathetic to Moscow rejected the police claims as fake and a show - created by the government to scare people into supporting them. Russia's embassy in the UK rejected the BBC's allegations, accusing Moldova and its \"Western sponsors\" of seeking to divert attention from Chisinau's \"internal woes\". </p><p>Inside all the polling stations visited by the BBC a small camera had been placed on a tripod overlooking the transparent ballot boxes. </p><p>Election monitors said they were recording everything, to be checked if there were any reports of violations.</p></div><div><p>Dan Spatar, who was at one polling station in the capital with his young daughter said he was choosing a European future over a Russian past: \"We voted for this four years ago and deserve to continue with it. We see what happens every day in Ukraine and we worry about that.\"</p><p>Moldova was awarded EU candidate status in 2022 along with Ukraine, four months after Russia's full-scale invasion of Ukraine.</p><p>Marina said she was voting \"for peace in Moldova, for a better life, for growing our economy\" and felt it would be very hard for her country to continue its path to Europe with a pro-Russian government. </p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/63cf/live/7acd30d0-9ca5-11f0-b829-b95ae45b90af.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/63cf/live/7acd30d0-9ca5-11f0-b829-b95ae45b90af.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/63cf/live/7acd30d0-9ca5-11f0-b829-b95ae45b90af.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/63cf/live/7acd30d0-9ca5-11f0-b829-b95ae45b90af.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/63cf/live/7acd30d0-9ca5-11f0-b829-b95ae45b90af.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/63cf/live/7acd30d0-9ca5-11f0-b829-b95ae45b90af.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/63cf/live/7acd30d0-9ca5-11f0-b829-b95ae45b90af.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/63cf/live/7acd30d0-9ca5-11f0-b829-b95ae45b90af.jpg.webp\" alt=\"Sarah Rainsford/BBC Cars queue at Bendery crossing in Moldova\" /><span>Sarah Rainsford/BBC</span></p></div><p></p><figcaption>The number of voters from Transnistria was well down on previous years</figcaption><p></p></figure><div><p>At the edge of Moldova's separatist enclave of Transnistria on Sunday, a long queue of cars waited to drive to 12 polling stations opened beyond the administrative border, some of them more than 20km (12 miles) away.</p><p>People had to travel a long way from home and the number of voters was down on recent years at just over 12,000, an indication of the struggle many faced.</p><p>Moldovan police checked documents and car boots before letting them pass. Most cars had several people inside, often whole families.</p><p>By mid-afternoon, the queue stretched into the distance beyond a kiosk with a Soviet-style hammer-and-sickle emblem on top, and the green-and-red striped flag of Transnistria.</p><p>Speaking to drivers, most seemed unconcerned by the inconvenience, and the atmosphere was relatively relaxed.</p><p>One man told the BBC in Russian that he was voting for change because the PAS government had \"promised paradise and delivered nothing\". No-one would be more specific than that, insisting their voting preference was \"secret\".</p><p>Close to a giant statue of Lenin in the town of Anenii Noi, south-east of the Moldovan capital, a group of voters from Transnistria complained they had been sent first to one town and then another, because a bomb scare had closed the polling station. They believed it had been done deliberately to put them off voting. </p><p>One man said he ran a \"Russian business\" in the separatist enclave and was clear he wanted the pro-Russians back in power.</p></div></article>"
  },
  {
    "title": "Greta Thunberg denies claims Gaza flotilla is a publicity stunt",
    "url": "https://www.bbc.com/news/articles/cx25grpxzd3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dda9/live/cf4e3f40-9c6f-11f0-b741-177e3e2c2fc7.jpg",
    "tag": "World",
    "date": "2025-09-28T13:15:04.000Z",
    "description": "Greta Thunberg has pushed back on criticism that a Gaza-bound flotilla she is a part of is a publicity stunt, saying no one would imperil themselves purely for attention.The Swedish activist is aboard one of...",
    "body": "<div><p>Greta Thunberg has pushed back on criticism that a Gaza-bound flotilla she is a part of is a publicity stunt, saying no one would imperil themselves purely for attention.</p><p>The Swedish activist is aboard one of 52 boats that form the Global Sumud Flotilla (GSF), which is travelling toward Gaza with the aim of delivering humanitarian aid to Palestinians there.</p><p>Israeli authorities have ridiculed the GSF flotilla and similar seaborne attempts to reach the territory, calling the boat Thunberg travelled on in June a \"selfie yacht\".</p><p>Asked about these criticisms of the flotilla by the BBC's Laura Kuenssberg, the activist said: \"I don't think anyone would risk their life for a publicity stunt.\"</p></div><div><p>Speaking while sailing off the Greek coast, she said the flotilla was not just a humanitarian mission but was also sending a message to people in Gaza that \"when our governments fail to step up, the people will step up\".</p><p>International aid agencies have been attempting to get food and medicine into the Palestinian territory - but note Israel is restricting the flow of supplies. Israel claims it is attempting to stop those supplies falling into the hands of Hamas, and has approved a US-backed aid agency.</p><p>Last month, a UN-backed body confirmed that there was famine in Gaza and the UN's humanitarian chief said it was the direct result of Israel's \"systematic obstruction\" of aid entering the territory. Israeli Prime Minister Benjamin Netanyahu has called this an \"outright lie\".</p><p>Thunberg said the purpose of the flotilla was to \"break Israel's illegal and inhumane siege on Gaza by sea\". The Israeli military has long controlled the waters that border Gaza.</p><p>Earlier this month, the flotilla organisers reported that <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/cly67g7pdlko\">two vessels came under attack by suspected drones</a> outside the Tunisian port of Sidi Bou Said. Tunisian authorities disputed their claims. </p><p>Another suspected drone attack on Wednesday, off the coast of Crete, led Spain and Italy to <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/ce3yz939qnpo\">deploy naval ships to assist the flotilla</a>.</p><p>Addressing the incidents, Thunberg accused Israeli officials of making \"baseless threats\" that violate international law, and asked: \"Why would they attack a peaceful humanitarian mission aiming to bring humanitarian aid to a starving population?\"</p><p>Israel has not commented on the drone attack, but has previously said it would not let the flotilla reach its destination.</p><p>Thunberg and 11 other activists were detained by Israeli authorities in June after they intercepted another boat heading for Gaza with a token amount of aid in the Mediterranean.</p><p>She was held in Tel Aviv for a day before being deported to France. </p><p>Thunberg accused Israel of illegally kidnapping her and the other activists while they were in international waters. Israel said it had prevented a breach of the maritime blockade around Gaza.</p></div>"
  }
]