[
  {
    "title": "Angus Taylor ousts Sussan Ley as Australia's Liberal Party leader",
    "url": "https://www.bbc.com/news/articles/cr5lmgdmy9mo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ec93/live/eb1ba460-0871-11f1-bb9c-791b2927f89b.jpg",
    "tag": "World",
    "date": "2026-02-13T00:42:24.000Z",
    "description": "47 minutes agoHelen LivingstoneSydneyGettySussan Ley has been deposed by Angus Taylor (back centre) as leader of Australia's Liberal party The first f",
    "body": "47 minutes agoHelen LivingstoneSydneyGettySussan Ley has been deposed by Angus Taylor (back centre) as leader of Australia's Liberal party The first female leader of Australia's Liberal Party, Sussan Ley, has been ousted after just nine months in the job, losing a leadership ballot to her former shadow defence minister Angus Taylor.Ley was elevated to the role after the party suffered a resounding defeat in last year's election, but since then has been plagued by poor poll numbers and infighting among the conservative Liberal-National Coalition.Taylor had announced he would challenge her for leadership of the opposition on Wednesday, ending months of speculation.In a social media post he said his election on Friday was \"an immense honour\" and that he looked forward to working with new deputy leader Jane Hume.Taylor, from the party's conservative faction, won the secret ballot, 34 votes to 17.Shortly after the results were announced, Ley said that she would resign as an MP and step away \"completely and comprehensively from public life\".She told waiting reporters she harboured \"no hard feelings\" towards the new leader although, in an apparent jab at the infighting she has endured, she added that it was important he get \"clear air, something that is not always afforded to leaders\".  Taylor, who narrowly lost the 2025 leadership contest to Ley, is a former management consultant who first entered parliament in 2013. He served as a minister under Malcolm Turnbull and Scott Morrison.Ley's position had never seemed secure. The Liberal-National coalition, a partnership dating back to the 1940s, twice split under her leadership, the first time immediately after the May election and the second time just weeks ago.A series of recent polls have also shown the populist One Nation Party - which only got 6% of the national vote last year - overtaking the Coalition to take second place behind Labor. Ley's personal ratings have also been poor.The coalition has largely failed to agree on what caused its crushing election defeat to Labor, which saw the Liberals all but wiped out in the major cities, with disagreements on energy and climate policy in a particular.Reflecting on her time at the helm, Ley said it had been \"very tough\" at times but added: \"I was part of the early punk rock movement in Canberra, I will continue to find wisdom in one of punk's defining themes, a fearless and honest belief in yourself.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Angus Taylor ousts Sussan Ley as Australia's Liberal Party leader",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ec93/live/eb1ba460-0871-11f1-bb9c-791b2927f89b.jpg"
      ],
      "datePublished": "2026-02-13T00:42:24.000Z",
      "dateModified": "2026-02-13T00:42:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Olympic body criticised for selling Nazi-era Games T-shirt",
    "url": "https://www.bbc.com/news/articles/cpv8zwxwp2eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9d61/live/124c3670-084b-11f1-ba49-bb79b430dd38.png",
    "tag": "World",
    "date": "2026-02-12T20:37:06.000Z",
    "description": "5 hours agoBethany BellGermany reporterOlympic ShopThere are calls in Germany for the sale of the shirts to be stoppedThe official online fan shop of ",
    "body": "5 hours agoBethany BellGermany reporterOlympic ShopThere are calls in Germany for the sale of the shirts to be stoppedThe official online fan shop of the Olympic Games has been selling T-shirts with designs from the Berlin Olympic Games in 1936, which were used by Adolf Hitler and the Nazis for propaganda.There are calls in Germany for the sale of the shirts to be stopped, but the International Olympic Committee (IOC) has defended it as being part of its Heritage Collection, celebrating styles from all editions of the Games.The T-shirts, which are emblazoned with the original poster design for the Berlin Olympics by Franz Würbel, are currently out of stock.The 1936 Games were used by Hitler as a chance to promote his ideals of racial supremacy and to glorify Nazi Germany on an international stage.The Berlin T-Shirt shows a male figure wearing a laurel wreath. Over his head are the Olympic rings. Underneath him is the Brandenburg Gate and the words \"Germany Berlin 1936 Olympic Games\".\"The 1936 Olympic Games were a central propaganda tool of the Nazi regime,\" Klara Schedlich, spokesperson for sports policy for the Green Party faction in the Berlin House of Representatives, told the German press agency, DPA.She accused the IOC of \"clearly not reflecting sufficiently on its own history\" and said \"the choice of image is problematic and unsuitable for a T-shirt\", without context.The IOC told the BBC that while it \"of course acknowledge[s] the historical issues of Nazi propaganda\" it wanted to also remember that the Berlin 1936 Games saw \"4,483 athletes from 49 countries compete in 149 medal events\". \"We made an Olympic Heritage Collection available to the public that celebrates 130 years of Olympic art and design. For this series, emblems, pictograms, posters and mascots from all editions of the Olympic Games are featured,\" a spokesperson said.\"Many of them stunned the world with their athletic achievements, including Jesse Owens.\"Jesse Owens, an African-American track and field athlete, won four gold medals at the 1936 Games, crushing the Nazi myth of Aryan racial supremacy.The spokesperson said that the historical context of the Berlin Games was explained at the Olympic Museum in Lausanne, and that only a limited number of 1936 T-Shirts had been produced and sold.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Olympic body criticised for selling Nazi-era Games T-shirt",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9d61/live/124c3670-084b-11f1-ba49-bb79b430dd38.png"
      ],
      "datePublished": "2026-02-12T20:37:06.000Z",
      "dateModified": "2026-02-12T20:37:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Japan says it seized Chinese vessel amid tensions with Beijing",
    "url": "https://www.bbc.com/news/articles/c2e4791re38o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bdfd/live/69df6540-0875-11f1-9349-4f5468f5dc48.jpg",
    "tag": "World",
    "date": "2026-02-13T01:12:04.000Z",
    "description": "17 minutes agoToby MannGetty ImagesJapanese authorities say they have seized a Chinese fishing vessel that tried to flee when ordered to stop for an i",
    "body": "17 minutes agoToby MannGetty ImagesJapanese authorities say they have seized a Chinese fishing vessel that tried to flee when ordered to stop for an inspection, in a move that may further fuel tensions with Beijing.The boat was in Japan's exclusive economic zone off Nagasaki Prefecture in the south-west when it was intercepted and its captain arrested on Thursday, according to the country's fisheries agency.\"The vessel's captain was ordered to stop for an inspection by a fisheries inspector, but the vessel failed to comply and fled,\" the fisheries agency said.The seizure is the first time since 2022 that the agency has seized a Chinese fishing boat. China has yet to react to Japan's statement. There were 11 people aboard, including the captain who is a 47-year-old Chinese national, the fisheries agency said. Authorities and Japanese media have described the seized vessel as a \"tiger net fishing boat\" with a high capacity.Thursday's incident comes amid strained relations after Japan's Prime Minister Sanae Takaichi enraged China in November by suggesting Tokyo would intervene militarily if Beijing sought to take Taiwan by force.China has long insisted that Taiwan, occupied for decades by Japan until 1945, is its territory.It has not ruled out using force to achieve what it calls \"reunification\".In response to Takaichi's remarks, which China's foreign ministry described as \"egregious\", Beijing summoned Tokyo's ambassador and warned its citizens to reconsider travel and study in Japan.That led to a sharp drop in visits to Japan by Chinese tourists, and a subsequent hit to Japanese stocks related to tourism and retail.As the diplomatic spat deepened during the end of 2025, Beijing repeatedly demanded that Takaichi retract her comments, and its foreign ministry warned Japan to \"stop playing with fire\".Japanese artists touring China have also had shows cancelled and releases of popular Japanese movies have been postponed.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Japan says it seized Chinese vessel amid tensions with Beijing",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bdfd/live/69df6540-0875-11f1-9349-4f5468f5dc48.jpg"
      ],
      "datePublished": "2026-02-13T01:12:04.000Z",
      "dateModified": "2026-02-13T01:12:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Norway's former PM Jagland charged with gross corruption over Epstein links",
    "url": "https://www.bbc.com/news/articles/c5yqr8eggvwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e2b4/live/e3f1b0d0-081c-11f1-8fdd-d9a354700c27.jpg",
    "tag": "World",
    "date": "2026-02-12T16:37:32.000Z",
    "description": "9 hours agoAlicia CurryNurPhoto via Getty ImagesThorbjørn Jagland's lawyer has previously said he denies criminal liability and is willing to cooperat",
    "body": "9 hours agoAlicia CurryNurPhoto via Getty ImagesThorbjørn Jagland's lawyer has previously said he denies criminal liability and is willing to cooperateFormer Norwegian Prime Minister Thorbjørn Jagland has been charged with \"gross corruption\" over his ties with the US sex offender Jeffrey Epstein, police have said.The charge was brought after the Council of Europe lifted Jagland's immunity, which he enjoyed because of his past diplomatic role. He denies criminal liability and is willing to cooperate, his lawyer says.Emails released by the US government are thought to show that Jagland planned solo and family visits to Epstein's homes in Paris, New York and Palm Beach after the billionaire was convicted of a child sex offence.Three of Jagland's properties were searched by Norwegian crime unit Økokrim and he is now expected to be questioned.As well as serving as prime minister from 1996 to 1997, Jagland is also a former head of the Norwegian Nobel Committee and spent a decade as secretary general of the Council of Europe.Jagland had diplomatic immunity from heading the Council, Europe's watchdog for democracy and human rights, for alleged acts carried out during his 2009 to 2019 tenure.The so-called Epstein files appear to show instances where the late financier covered the travel expenses to his properties for Jagland and his family.The former leader had planned a family trip to Epstein's private Caribbean island in 2014, but it was ultimately cancelled after Epstein fell ill. Jagland also faces allegations that he solicited Epstein's help in obtaining a bank loan in another exchange, although it is not clear whether this materialised, according to Norwegian broadcaster NRK. Police have not confirmed whether this allegation is part of the gross corruption charge.Mention in the Epstein files - which have been released by the US Department of Justice (DOJ) - does not indicate any wrongdoing. Jagland was seen walking out of his home alongside his lawyer in Oslo on Thursday, one of the properties - alongside two in Risør and Rauland - that Økokrim confirmed it had searched. Politicians, celebrities and royals have been caught up in the turmoil after the US DOJ published the latest tranche of files last month, containing millions of private emails, images and FBI reports into the late sex offender - who died in 2019 while awaiting trial for sex trafficking. The Nordic country has seen several public figures drawn into the widening scandal, including Crown Princess Mette-Marit, diplomats Mona Juul and Terje Rød-Larsen, and chief executive of the World Economic Forum (WEF), Borge Brende.Juul's lawyer has said she \"does not recognise the accusations made against her\" and Rød-Larsen's lawyer said he is confident the investigation will clarify \"there is no basis for criminal liability\".The WEF ordered an independent review into Brende - who also served as the Norwegian foreign minister - over his interactions with the paedophile.Brende has acknowledged dining with Epstein three times in 2018 and 2019 and communicating with him by email and text, but said he was \"completely unaware\" of his past criminal activity. He added that he welcomes the WEF's decision to launch a review.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Norway's former PM Jagland charged with gross corruption over Epstein links",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e2b4/live/e3f1b0d0-081c-11f1-8fdd-d9a354700c27.jpg"
      ],
      "datePublished": "2026-02-12T16:37:32.000Z",
      "dateModified": "2026-02-12T16:37:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump revokes landmark ruling that greenhouse gases endanger public health",
    "url": "https://www.bbc.com/news/articles/cn0zdd7yl4vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/eb9f/live/604a8500-0848-11f1-b5e2-dd58fc65f0f6.jpg",
    "tag": "World",
    "date": "2026-02-12T20:35:15.000Z",
    "description": "5 hours agoMatt McGrathEnvironment correspondentTrump announces rollback of Obama-era greenhouse gas rulingUS President Donald Trump has reversed a ke",
    "body": "5 hours agoMatt McGrathEnvironment correspondentTrump announces rollback of Obama-era greenhouse gas rulingUS President Donald Trump has reversed a key Obama-era scientific ruling that underpins all federal actions on curbing planet-warming gases.The so-called 2009 \"endangerment finding\" concluded that a range of greenhouse gases were a threat to public health. It's become the legal bedrock of federal efforts to rein in emissions, especially in vehicles.The White House called the reversal the \"largest deregulation in American history\", saying it would make cars cheaper, bringing down costs for automakers by $2,400 per vehicle.Environmental groups say the move is by far the most significant rollback on climate change yet attempted and are set to challenge it in the courts.John Kerry to BBC: Trump's climate change policy will 'cost lives'Speaking in the Oval Office on Thursday, Trump said the 2009 ruling  was \"a disastrous Obama era policy that severely damaged the American auto industry and massively drove up prices for American consumers\".\"This radical rule became the legal foundation for the Green New Scam, one of the greatest scams in history,\" added the Republican president, about the Democrats' climate agenda.Former President Barack Obama, who infrequently comments on the policies of sitting presidents, said that repealing the finding would make Americans more vulnerable.\"Without it, we'll be less safe, less healthy and less able to fight climate change — all so the fossil fuel industry can make even more money,\" he wrote on X. The Environmental Protection Agency (EPA) first took a stance on the impacts of greenhouse gases in 2009, in the first year of Obama's first term.The agency decided that six key planet-warming greenhouse gases, including carbon dioxide and methane, were a danger to human health.With a divided Congress unable to agree on legislation to tackle rising global temperatures, the EPA finding became central to federal efforts to rein in emissions in the years that followed.\"The endangerment finding has really served as the lynchpin of US regulation of greenhouse gases,\" said Meghan Greenfield, a former EPA and Department of Justice attorney.\"So that includes motor vehicles, but it also includes power plants, the oil and gas sector, methane from landfills, even aircraft. So it really runs the gamut, all of the standards for each of the sectors is premised on this one thing.\"Trump administration officials are stressing that overturning the regulation will save more than $1tn and will help cut the price of energy and transport.Reversing the finding would reduce automobile manufacturers' spending by $2,400 per vehicle, White House press secretary Karoline Leavitt told reporters.Many environmentalists are sceptical of the potential cost savings being touted by the Trump team. \"It's going to force Americans to spend more money, around $1.4tn in additional fuel costs to power these less efficient and higher polluting vehicles,\" said Peter Zalzal from the Environmental Defense Fund.\"We've also analysed the health impacts and found that the action would result in up to 58,000 additional premature deaths, 37 million more asthma attacks,\" he said.For some in the US car industry there will be uncertainty about the rollback as manufacturing less fuel-efficient vehicles might limit their sales overseas.\"This rollback is sort of cementing things that have already been done, such as the relaxation of the fuel economy standards,\" said Michael Gerrard, a climate law expert from Columbia University.\"But it really does put the US automakers in a bind, because nobody else is going to want to buy American cars.\"ReutersWhile the reversal will help the White House to roll back climate change regulations, there are likely to be unintended consequences, according to some observers.While working on overturning the finding, the Trump administration also utilised the 2009 ruling to prevent states from passing laws that would be stricter on carbon emissions.The fact that the finding gave responsibility for regulating warming gases to a federal authority was also used to suppress what are termed \"nuisance\" lawsuits, brought by individuals or organisations on the climate question.\"The endangerment finding decision has blocked any number of lawsuits, and has been pretty powerful in keeping plaintiffs' claims out of court ,\" said Meghan Greenfield, now with Washington law firm of Jenner & Block.\"I would expect states and non-profit groups to bring suits, probably primarily in our state courts, to try to figure out where the contours of this new law are.\"ReutersClimate change was linked to the conditions that lead to huge fires in Los Angeles in early 2025Challenging climate science One key argument about the reversal of the endangerment finding will be about the science on which it is based. The Department of Energy formed a panel of scientists to write a report last year challenging widely accepted science on the warming impact of greenhouse gases.That report underpinned the initial proposal to reverse the 2009 finding.But many climate experts complained that the panel behind the report was unrepresentative and filled with people who were sceptical of the human influence on warming, and that it was inaccurate and misleading.While it's not clear how much the Trump administration will rely on this report to face off any challenges, a federal judge recently ruled that the department had violated the law in the formation of the hand-picked team that wrote it.In fact, a challenge in court on the reversal of the endangerment finding may well be what the Trump administration is now looking for.Many legal experts believe that they want the proposal to be tested in the Supreme Court before Trump's term ends, believing that if they win, the endangerment finding will be consigned to history.\"This is really different as the EPA is exiting the space entirely and wants to do it on a permanent basis,\" said Meghan Greenfield.\"If they were to win that issue as they framed it before the Supreme Court, a new presidential administration could not change that position, in the absence of new legislation.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump revokes landmark ruling that greenhouse gases endanger public health",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/eb9f/live/604a8500-0848-11f1-b5e2-dd58fc65f0f6.jpg"
      ],
      "datePublished": "2026-02-12T20:35:15.000Z",
      "dateModified": "2026-02-12T20:35:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Judge blocks US military from demoting Mark Kelly over 'illegal orders' video",
    "url": "https://www.bbc.com/news/articles/cvgk4vl30vko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bd5e/live/19995920-0842-11f1-a418-9d2f92813770.jpg",
    "tag": "World",
    "date": "2026-02-12T20:31:12.000Z",
    "description": "5 hours agoGrace Eliza GoodwinCQ-Roll Call, Inc via Getty ImagesA federal judge has blocked Secretary of Defence Pete Hegseth from lowering Senator Ma",
    "body": "5 hours agoGrace Eliza GoodwinCQ-Roll Call, Inc via Getty ImagesA federal judge has blocked Secretary of Defence Pete Hegseth from lowering Senator Mark Kelly's rank in the military over his urging service members to refuse illegal orders. US District Judge Richard Leon wrote in a scathing ruling that Hegseth had unconstitutionally retaliated against Kelly in seeking to demote the retired Navy captain.In a post on social media, Hegseth said the judge's order would be \"immediately appealed\".It is another setback in the Trump administration's fight against Kelly and five other lawmakers who published a video encouraging troops to disobey orders they deemed illegal. A grand jury this week declined to bring charges of seditious conspiracy against them.Reducing Kelly's rank could lead to a major cut in his retirement pay.Kelly, who is also a former astronaut, sued the government in January, naming Hegseth as the defendant. He argued that Hegseth had illegally tried to demote him in retaliation for criticising the Trump administration. He asked the judge to block the demotion with a temporary injunction while his lawsuit proceeded.The federal government had argued Kelly should contest the case against him through a military process and not in a civilian court of law, but in Thursday's decision, Judge Leon wrote: \"I disagree.\"Leon wrote that while service members have more limited free speech protections than civilians under the US Constitution's first amendment, no court has ever extended those limits to retired service members.\"This Court has all it needs to conclude that Defendants have trampled on Senator Kelly's First Amendment freedoms and threatened the constitutional liberties of millions of military retirees,\" he wrote. \"To say the least, our retired veterans deserve more respect from their Government, and our Constitution demands they receive it!\"Soon after the judge issued the temporary injunction, Hegseth posted on X: \"This will be immediately appealed. Sedition is sedition, 'Captain.'\"In a statement, Kelly said that he appreciated \"the judge's careful consideration of this case, and the clarity of his ruling\". \"But I also know that this might not be over yet,\" he added, saying he was ready to keep fighting the Trump administration.In the video, the six Democratic lawmakers say that the administration \"is pitting our uniformed military and intelligence community professionals against American citizens\".Kelly appears alongside Michigan Senator Elissa Slotkin and US Representatives Chris Deluzio, Maggie Goodlander, Chrissy Houlahan and Jason Crow, all of whom served in military or intelligence agencies.\"Our laws are clear,\" he says. \"You can refuse illegal orders.\"After the video was released, Trump posted on social media that the members of Congress should be arrested and put on trial. Labeling the video seditious behaviour, he posted: \"PUNISHABLE BY DEATH!\"Trump later clarified to Fox News: \"I'm not threatening death, but I think they're in serious trouble.\"Federal prosecutors then began criminal investigations into the lawmakers and sought to indict them on charges of seditious conspiracy. But a grand jury, which decides if a case can stand up on court, declined to approve the charges.Meanwhile, Hegseth announced he would open retirement-grade determination proceedings against Kelly and issue a formal letter of censure. He described Kelly's comments as \"seditious in nature\" and a violation of the Uniform Code of Military Justice.In his decision, which contained more exclamation marks than are typical in judicial writings, Leon wrote: \"Rather than trying to shrink the First Amendment liberties of retired servicemembers, Secretary Hegseth and his fellow Defendants might reflect and be grateful for the wisdom and expertise that retired servicemembers have brought to public discussions and debate on military matters in our Nation over the past 250 years.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Judge blocks US military from demoting Mark Kelly over 'illegal orders' video",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bd5e/live/19995920-0842-11f1-a418-9d2f92813770.jpg"
      ],
      "datePublished": "2026-02-12T20:31:12.000Z",
      "dateModified": "2026-02-12T20:31:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Iran fortifies underground complex near nuclear site, satellite images show",
    "url": "https://www.bbc.com/news/articles/cwygxz81330o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/28a1/live/e25c9ed0-0851-11f1-b5e2-dd58fc65f0f6.png",
    "tag": "World",
    "date": "2026-02-12T21:27:28.000Z",
    "description": "4 hours agoEmma Pengelly,BBC VerifyandGhoncheh Habibiazad,BBC PersianVantorIran has been fortifying an underground complex near one of its nuclear fac",
    "body": "4 hours agoEmma Pengelly,BBC VerifyandGhoncheh Habibiazad,BBC PersianVantorIran has been fortifying an underground complex near one of its nuclear facilities, according to analysis of new satellite images.This activity comes at a time of heightened tensions as talks between Iranian and US officials continue, with President Donald Trump threatening fresh military action against Iran if it does not agree a new deal on its nuclear programme.The photos, first analysed by the Institute for Science and International Security (ISIS), a US-based think tank, show tunnel entrances being strengthened at Mount Kolang Gaz La - also known as Pickaxe Mountain.Experts say this facility may be designed to protect Iran's uranium enrichment activities or key equipment, but its exact purpose - and whether it is operational - remains unclear.Iran insists its nuclear programme is entirely peaceful and denies it is seeking to develop nuclear weapons.However, Trump said Iran was as little as a month away from having a nuclear weapon in June 2025, when he ordered strikes on three underground nuclear sites where centrifuges were being used to produce highly enriched uranium during a 12-day war between Israel and Iran last year.Trump said the strikes had \"obliterated\" Iran's enrichment capacity, but that Iranian officials \"were thinking about starting a new site\".Pickaxe Mountain was not one of the locations attacked in US and Israeli air strikes in June 2025, but the Natanz nuclear facility, located about 2km (1.24 miles) north, was hit.A satellite image from 10 February shows what appears to be fresh concrete laid on top of one of the Pickaxe Mountain entrance areas.A boom pump used to deliver concrete can be seen at the location, analysts from both ISIS and UK-based intelligence analysis firm Maiar agreed.At another tunnel entrance, rock and soil has been pushed back and flattened. There's also a new concrete-reinforced structure nearby.Experts at ISIS suggest these changes are intended to strengthen the tunnel entrances and give additional protection against a potential air strike.ISIS says the ongoing presence of heavy construction machinery and material indicates the facility is not likely to be ready for operations yet.\"In the past, Iran has tied the construction to rebuilding an advanced centrifuge assembly plant, but the size of the facility, as well as the protection provided by the tall mountain, raised immediate concern whether additional sensitive activities are planned, such as uranium enrichment,\" they said.Satellite images also show repair work and defensive strengthening has been taking place at the nearby Natanz nuclear site and at the Isfahan nuclear complex, 125km (77 miles) to the north, in recent weeks.At Isfahan, all entrances to its tunnel complex now appear to be sealed off with earth, satellite images reviewed by ISIS reveal..Backfilling the tunnel entrances like this would \"help dampen\" any air strike, ISIS says, as well as help to defend against a land-based assault to seize or destroy any highly enriched uranium that may be housed inside..ISIS has assessed the roof was added to block the view of anyone trying to observe what Iran was doing beneath it.Prof Sina Azodi, director of the Middle East Studies Program at George Washington University in the US, says Iran is \"operating under the assumption that the attacks are going to happen and they need to protect the facilities as much as they can\".\"[The] Iranian nuclear programme hasn't been destroyed,\" he added. \"Clearly once you have the knowledge and capacity and technology to reconstruct the programme, you can always rebuild everything.\"Rafael Grossi, the head of the global nuclear watchdog, the International Atomic Energy Agency, told the BBC a new nuclear deal between Iran and the US was possible and was urgently needed.\"My sense, talking to all those involved, is that we have a window of opportunity, but windows of opportunity have a tendency to shut themselves quite abruptly and brusquely, so I think the we need to seize the moment,\" he said in an interview at the Munich Security Conference.He also said he believed Iran's estimated 400kg of highly enriched uranium - which is a short, technical step away from weapons grade - remained in the underground tunnels and chambers where the US dropped bunker-busting bombs last June.Graphics by Tom ShielMore on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iran fortifies underground complex near nuclear site, satellite images show",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/28a1/live/e25c9ed0-0851-11f1-b5e2-dd58fc65f0f6.png"
      ],
      "datePublished": "2026-02-12T21:27:28.000Z",
      "dateModified": "2026-02-12T21:27:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kim Ju Ae: North Korea leader Kim Jong Un chooses daughter as heir, Seoul says",
    "url": "https://www.bbc.com/news/articles/cn0e1g7kwglo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/067d/live/2e248500-0805-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "World",
    "date": "2026-02-12T11:10:55.000Z",
    "description": "14 hours agoJake KwonSeoul correspondentWatch: See Kim Ju Ae, the only known child of Kim Jong Un, attend events with her father over the yearsNorth K",
    "body": "14 hours agoJake KwonSeoul correspondentWatch: See Kim Ju Ae, the only known child of Kim Jong Un, attend events with her father over the yearsNorth Korean leader Kim Jong Un has selected his daughter as his heir, South Korea's spy agency told lawmakers on Thursday. Kim Ju Ae - who is believed to be 13 - has in recent months been pictured beside her father in high-profile events like a visit to Beijing in September, her first known trip abroad. The National Intelligence Service (NIS) said it took a \"range of circumstances\" into account including her increasingly prominent public presence at official events\" in making this assessment.The NIS also said it would keep close tabs on whether she will attend the North's party congress later this month - its largest political event that is held once every five years.The party Congress is where Pyongyang is expected to give more details about priorities like foreign policy, war planning and nuclear ambitions for the next five years.On Thursday lawmaker Lee Seong-kwen told reporters that Ju Ae, who was previously described by the NIS as being \"trained\" to be a successor, was now at the stage of \"successor designation\". \"As Kim Ju Ae has shown her presence at various events, including the founding anniversary of the Korean People's Army and her visit to the Kumsusan Palace of the Sun, and signs have been detected of her voicing her opinion on certain state policies, the NIS believes she has now entered the stage of being designated as successor,\" Lee said.Ju Ae is the only known child of Kim Jong Un and his wife, Ri Sol Ju. The NIS believes Kim Jong Un has an older son, but this son has never been acknowledged nor shown on North Korean media.News of Ju Ae's existence first emerged through an unlikely source: the American basketball player Dennis Rodman, who revealed to The Guardian newspaper back in 2013 that he \"held baby Ju Ae\" during a trip to the secretive state.Ju Ae made her first appearance on state television in 2022. She was shown inspecting North Korea's latest intercontinental ballistic missile while holding her father's hand. She has since made frequent appearances on state media, softening her father's image of a ruthless dictator.  She accompanied him to Beijing for China's largest-ever military parade, where she was seen stepping off his armoured train at Beijing Railway Station.She is often seen wearing her hair long, which is forbidden for her peers, and wearing designer clothes, which are out of reach for most in her country.Another lawmaker, Park Sun-won said the role Ju Ae had taken on during public events indicated that she has started to provide policy input and is being treated as the de facto second-highest leader. The North Korean power had passed down the three generations of the Kim family, and it is widely believed that Kim Jong Un will pass on the throne to Ju Ae.In recent months, she was shown standing taller than her father, walking beside him, rather than following him. In North Korea, where photos published by the state media are believed to carry a great symbolic weight, it is rare for individuals other than Kim Jong Un to be positioned equally prominently in the frame.EPAAlthough the South Korean spy agency now believes Ju Ae is the designated heir, it still raises questions.It is puzzling why Ju Ae, a daughter, would be selected as the heir above an older son in North Korea's deeply patriarchal society. Many defectors and analysts had previously dismissed the idea of a woman leading North Korea as an unlikely scenario, referring to the country's entrenched traditional gender roles. But Kim Jong Un's sister - Kim Yo Jong - does offer a precedent for female authority in the regime.Kim Yo Jong currently holds a senior position in the Central Committee of the Workers' Party of Korea, and is reported to have influence over her brother.However, it is also a mystery why Kim Jong Un, who is still young and appears relatively healthy, is already designating a 13-year-old child as his heir now.It is unclear what changes Ju Ae's succession may bring to North Korea. Many North Koreans hoped that Kim Jong Un, a Western-educated young man, would open their country up to the outside when he succeeded his father. Yet such hope was unfulfilled. Whatever plans this teenager may have for her country, she would likely have the singular power to shape it however she likes.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kim Ju Ae: North Korea leader Kim Jong Un chooses daughter as heir, Seoul says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/067d/live/2e248500-0805-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-12T11:10:55.000Z",
      "dateModified": "2026-02-12T11:10:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Minneapolis immigration enforcement operation to 'conclude', officials say",
    "url": "https://www.bbc.com/news/articles/c2lr9w29zwyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b6e8/live/17a22a90-0822-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "World",
    "date": "2026-02-12T19:47:08.000Z",
    "description": "Minnesota immigration enforcement surge is ending, Trump border tsar says6 hours agoBrandon DrenonUS border tsar: Minneapolis immigration enforcement ",
    "body": "Minnesota immigration enforcement surge is ending, Trump border tsar says6 hours agoBrandon DrenonUS border tsar: Minneapolis immigration enforcement surge endingThe US immigration enforcement surge in Minnesota will end, President Donald Trump's border tsar told reporters on Thursday.Tom Homan said Trump had approved his request to conclude the operation, adding he would stay in Minnesota \"a little longer to oversee the drawdown, to ensure its success\". Homan said Operation Metro Surge had resulted in many illegal immigrants who had committed violent crimes being detained for deportation. But the surge also sparked nationwide protests when two US citizens, Renee Good and Alex Pretti, were killed by immigration officers.After the news conference, top Minnesota and federal officials appeared at a Capitol Hill hearing on Trump's immigration crackdown.Officials in Minnesota have been able to \"greatly reduce the number of targets\" for immigration enforcement, Homan said, adding that Operation Metro Surge was a \"great success\".More than 4,000 undocumented immigrants had been arrested, according to Homan, including men he said were convicted of rape and other sexual misconduct. Homan said Immigration and Customs Enforcement (ICE) has always had a presence in Minnesota and will continue to have one. He said that the surge's end came after an unprecedented level of cooperation between federal agents and local law enforcement, with local officials increasing their crackdown on protesters he called public safety threats and local jails more willing to notify ICE of the release dates for individuals it was seeking.Minnesota Governor Tim Walz said at a news conference following Homan's announcement that he was \"cautiously optimistic\" about the drawdown of federal agents. \"The fact of the matter is they left us with deep damage, generational trauma,\" Walz said. \"They left us with economic ruin in some cases. They left us with many unanswered questions.\"The governor is expected to soon propose a $10m (£7m) emergency fund for small businesses who say they were financially hurt by the surge.Following the fatal shooting of Alex Pretti last month, President Donald Trump dispatched Homan to Minneapolis to oversee the surge, sidelining the operation's leader, Greg Bovino, who had faced intense criticism for ICE's use of force and what many in the city alleged were civil rights violations.Trump's immigration crackdown has faced resistance in Democrat-led cities like Minneapolis from activists in the streets and local officials and immigrants in the courts. The administration last month finished removing National Guard troops from Portland, Los Angeles and Chicago - places where there had been large protests against the presence of troops and immigration agents - according to US Northern Command.Some Republicans, too, had questioned the Minneapolis operation.Senator Rand Paul told a committee hearing with Department of Homeland Security (DHS) officials on Thursday that \"saying we're going to reduce this presence in the street is a good sign and a good step forward\".\"I'm glad that's happening,\" the Republican from Kentucky said. \"I think that is de-escalation.\"ICE Acting Director Todd Lyons said at the hearing that the agency is tracking roughly 1.6 million undocumented immigrants with deportation orders in the US, including roughly 800,000 who have criminal convictions.He also defended against accusations from lawmakers that the agency was not holding officers accountable, saying ICE had launched 37 open investigations for excessive use of force since January 2025.The fight over how immigration agents operate has now put the federal government at risk of a partial shutdown as Congress debates a funding measure for the DHS, which includes ICE. On Thursday, the US Senate failed to advance a bill on new funding for the department. Earlier this month, lawmakers approved DHS funding for two weeks and had planned to use that time to negotiate a substantive deal. But with no agreement in sight and the upper chamber set to go on break, DHS could lose its funding starting Saturday. That will affect a variety of services, including transportation security at US airports and responses to disasters and large-scale emergencies. Last year, lawmakers passed legislation creating a separate pool of funding that should allow ICE to continue to operate.Democrats are demanding changes in ICE - such as ending the wearing of masks - in exchange for support for the bill. They are also pushing for immigration agents in Minnesota and elsewhere to be required to reveal their identities and to end warrant-less searches.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Minneapolis immigration enforcement operation to 'conclude', officials say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b6e8/live/17a22a90-0822-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-12T19:47:08.000Z",
      "dateModified": "2026-02-12T19:47:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC in Tehran sees government's 'political reply' to protests",
    "url": "https://www.bbc.com/news/videos/cewz2lxq2gvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/63c6/live/f3acbda0-0748-11f1-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-11T12:34:41.000Z",
    "description": "Authorities in Iran have put on a show of strength to mark the 47th anniversary of the Islamic revolution, weeks after they used unprecedented force t",
    "body": "Authorities in Iran have put on a show of strength to mark the 47th anniversary of the Islamic revolution, weeks after they used unprecedented force to put down anti-government protests. The BBC is visiting Tehran for the first time since the crackdown, during which at least 6,490 protesters were killed across the country, according to human rights activists. The BBC's chief international correspondent Lyse Doucet says the bunting lining the capital's streets and large crowds of government supporters embody the image of the nation the government wants to see on the streets: Iranians coming out to show their support for the Islamic Republic and the revolution. Our correspondent is reporting from Tehran on condition that none of her material is used on the BBC's Persian Service. These restrictions apply to all international media organisations operating in Iran.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC in Tehran sees government's 'political reply' to protests",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/63c6/live/f3acbda0-0748-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-11T12:34:41.000Z",
      "dateModified": "2026-02-11T12:34:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bangladesh election: Polls close in first vote since Gen Z protests ousted former PM Sheikh Hasina",
    "url": "https://www.bbc.com/news/articles/cy7jdmvn3l0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0249/live/85b65510-07ff-11f1-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-12T13:15:35.000Z",
    "description": "12 hours agoSimon Fraser,Asia digital editor, LondonandYogita Limaye,South Asia and Afghanistan correspondent, DhakaReutersVotes are being counted in ",
    "body": "12 hours agoSimon Fraser,Asia digital editor, LondonandYogita Limaye,South Asia and Afghanistan correspondent, DhakaReutersVotes are being counted in Bangladesh after its first election since student-led protests ousted prime minister Sheikh Hasina in 2024.More than 2,000 candidates are vying for 300 elected seats in parliament, though none from the banned Awami League of Hasina, who fled after 15 years in power after a brutal security crackdown in which hundreds of protesters were killed.The election pits the centre-right Bangladesh Nationalist Party (BNP) against a coalition led by the Islamist Jamaat-e-Islami, which joined forces with a party born out of the student uprising.Results are expected on Friday and there's widespread hope among voters of a return to democracy. For the first time since 2008, the outcome of an election in Bangladesh cannot be predicted with certainty. The past few elections were widely condemned as systematically rigged in favour of Sheikh Hasina. Hasina is in exile in India from where she's rejected the charges against her and has questioned the legitimacy of the election.The ban on her Awami League contesting the polls casts a shadow over whether this election can be described as free and fair. But, for the first time in years, voters on the ground were telling the BBC they feel like they have a choice.More than 120 million people were eligible to vote, about four in 10 of them under 37. They were also casting their ballots in a referendum on constitutional change, which was proposed by the interim government that replaced Hasina and is aimed at fixing what it has called a completely broken political system.Speaking after voting, Bangladesh's interim leader - the Nobel Peace Price laureate Muhammad Yunus - said the country had \"ended the nightmare and begun a new dream\".Turnout had reached 49% by 14:00 local time (08:00 GMT), the Ministry of Information and Broadcasting told the BBC. Nearly a million police and soldiers have been deployed to maintain law and order.Yunus voted in the capital Dhaka, as did the two leading candidates, Tarique Rahman, 60, for the BNP, and Jamaat's leader Shafiqur Rahman, 67.Before casting his ballot, Rahman said he was feeling \"confident\" about how the election would play out. He told the BBC he'd been waiting \"more than a decade\" for this day. He has criticised Jamaat for using religious sentiment to win votes, and is promising economic and democratic reforms, as well as a \"rainbow nation\", where a new \"National Reconciliation Commission\" would help the country move past its divisions.Hardly any voters were seen at polling stations in the former Awami League stronghold of GopalganjThe son of the late Khaleda Zia, Bangladesh's first female prime minister, Rahman is a product of dynastic politics many reformers would like to change. Zia herself came to power after her husband, a former president, was assassinated in a military coup.Both the BNP - the Awami League's long-time rival - and Jamaat-e-Islami have a long history in Bangladesh, and both were crushed along with other opponents of Hasina under her long rule.Rahman, who lived in London during the Hasina years, may be tipped as front-runner for prime minister, but Jamaat is expected to mount a serious challenge.On two previous occasions - in the 1990s and the early 2000s - Jamaat has been a junior partner in a coalition led by the BNP in constitutionally-secular Bangladesh.But, with the Awami League absent, Jamaat is for the first time a major player on the ballot - though it's chances of winning are seen by most observers as slim. Shafiqur Rahman, a former political prisoner, and his party have run a well organised grassroots campaign on a platform of justice and ending corruption. They are also not associated with dynastic politics. Jamaat gained momentum of its own in the run-up to the vote, and many of its new supporters believe it has modernised. But many female voters feel sidelined, despite the fact women played a leading role in the uprising.Of the 30 candidates Jamaat is allowing the student-led National Citizen Party (NCP) to field, only two are women. Jamaat is fielding more than 200 candidates, all of them men. The BNP fielded 10 women out of more than 250 candidates.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bangladesh election: Polls close in first vote since Gen Z protests ousted former PM Sheikh Hasina",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0249/live/85b65510-07ff-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-12T13:15:35.000Z",
      "dateModified": "2026-02-12T13:15:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Watch: Three issues that matter to voters in the Bangladesh election",
    "url": "https://www.bbc.com/news/videos/c2047rm71npo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e222/live/e56f1360-07ab-11f1-b5e2-dd58fc65f0f6.jpg",
    "tag": "World",
    "date": "2026-02-12T01:04:51.000Z",
    "description": "BBC reports from outside court after Jimmy Lai sentencingThe pro-democracy media tycoon was sentenced to 20 years in jail by the Hong Kong High Court.",
    "body": "BBC reports from outside court after Jimmy Lai sentencingThe pro-democracy media tycoon was sentenced to 20 years in jail by the Hong Kong High Court.AsiaAt the scene of deadly Pakistan mosque explosion At least 31 people have been killed after a suicide bomber detonated a device at a Shia mosque, according to police.AsiaWatch: CCTV captures moment mayor hit in rocket launcher attack in the PhilippinesA mayor in the Philippines has survived a rocket launcher attack on his vehicle in broad daylight.Asia'Grim scene': BBC on site after crane collapses on train in ThailandCorrespondent Jonathan Head says the 'devastating' accident is an enormous setback for Thailand's efforts to modernise its infrastructure.AsiaWatch: BBC reports from scene of deadly Goa nightclub fireIndia Editor Vikas Pandey visits the Indian nightclub where 25 people were killed in a blaze.AsiaVideo shows speed fire spreads in Hong Kong tower blockFootage geolocated by BBC Verify show the blaze taking hold in Wang Cheong House.AsiaWatch: Indonesia's Semeru volcano spews giant ash clouds as it eruptsJava Island’s tallest mountain, a volcano called Mount Semeru, has spewed tall plumes of ash clouds that engulfed bridges and the surrounding countryside.AsiaPakistan: Suicide attack outside Islamabad court kills 12 At least 12 people have been killed after a suicide attack outside a court in Islamabad on TuesdayAsiaPhilippines typhoon aftermath: 'Water levels are rising fast'A weakened Typhoon Fung-wong is now passing over the South China Sea, after leaving two people dead in the Philippines.AsiaWaves smash Philippines coastline as typhoon hitsFootage from 9 November shows swells from Typhoon Fung-wong surging over houses and palm trees.AsiaShipping containers swept away in deadly Philippines floods At least three people have died, officials say. Residents sought shelter from high water on rooftops.AsiaWoman saved after slipping while boarding a moving trainVideo released by India’s Southern Railways shows the moment a woman nearly fell in between a moving train and a station platform.AsiaTrump imitates India's PM Narendra Modi in South KoreaTrump impersonated Modi while recalling his conversations from the May India-Pakistan conflictAsiaHas Trump's 'peace deal' solved the Thailand-Cambodia dispute?Donald Trump has claimed to have ended another war, this time between Thailand and Cambodia. But what does this latest agreement actually amount to?AsiaTrump in Malaysia: Dancing and a 'peace deal'US President Donald Trump in Malaysia: Dancing and a 'peace deal'AsiaMillions of Diwali lamps light up Indian town to set new world recordA record 2.6 million earthen lamps were lit on Sunday in Ayodhya, Uttar Pradesh.AsiaWatch: North Korea shows off huge missile at military paradeNamed the Hwasong-20, its size suggests that it could carry multiple nuclear warheads.AsiaHow South Korea is using a holographic cop to fight crime A life-sized holographic police officer has been installed in central Seoul in a bid to deter crime. The BBC took to the streets to ask people if they think it’ll work.AsiaWatch: Race to reach hikers stranded by Mount Everest blizzardChinese state media reports say around 350 people have been rescued and efforts are under way to reach more than 200 others.Asia'It's safe now': See students pulled from rubble of collapsed Indonesian schoolDramatic rescue footage shows the boys in Indonesia pulled to safety after their school collapsed.\nAsia",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Watch: Three issues that matter to voters in the Bangladesh election",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e222/live/e56f1360-07ab-11f1-b5e2-dd58fc65f0f6.jpg"
      ],
      "datePublished": "2026-02-12T01:04:51.000Z",
      "dateModified": "2026-02-12T01:04:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "North Korea: Who is Kim Ju Ae, the daughter who may succeed Kim Jong Un?",
    "url": "https://www.bbc.com/news/articles/cvgvgj7ejqdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/30dc/live/2b05ab20-8848-11f0-b391-6936825093bd.jpg",
    "tag": "World",
    "date": "2026-02-12T16:00:09.000Z",
    "description": "What do we know about Kim Jong Un's daughter - and expected successor?9 hours agoFlora DruryBBC NewsWatch: Moment Kim Jong Un's daughter arrives in Be",
    "body": "What do we know about Kim Jong Un's daughter - and expected successor?9 hours agoFlora DruryBBC NewsWatch: Moment Kim Jong Un's daughter arrives in Beijing in September 2025Kim Jong Un's arrival in China for his first ever multilateral meeting was always going to make headlines.But it was the smartly-dressed girl standing just behind him as he exited his armoured train last September which caught Korea watchers' attention: Kim Ju Ae, the North Korean leader's daughter.But details - including her exact age - are thin on the ground. So what exactly do we know?KCNAThe visit was Kim Ju Ae's first foreign trip with her father - she can be seen in the far right of this imageMiss Kim has, for a number of years, been believed to be the second of Kim Jong Un's and his wife, Ri Sol-Ju's, three children. The exact number, and their order, is by no means certain, however Kim is very secretive about his family, only introducing his wife to the public after they had been married for some time.Kim Ju Ae is their only child whose existence has been confirmed by the country's leadership. No other child has been seen in public.KCNAKim Ju Ae (seen here in 2023) has become a regular at military parades in North Korea in the last couple of yearsLittle was then heard about her until November 2022, when she appeared alongside her father at the launch of an intercontinental ballistic missile (ICBM).By February the next year, she was appearing on postage stamps and attending banquets for top officials - described as Kim Jong Un's \"respected\" daughter.The adjective \"respected\" is reserved for North Korea's most revered. In her father's case, he was referred to as \"respected comrade\" only after his status as future leader was cemented.KCNAKim Ju Ae appeared with her father at the opening of the Wonsan tourist resort last June South Korea's National Intelligence Service (NIS) provided lawmakers with a few extra details on the little girl at around the same time, according to news agency AP.They said she enjoyed horse riding, skiing and swimming, and was home-schooled in the capital Pyongyang. They suggested she was around 10 years old.By January 2024, the NIS had come to another conclusion: that the little girl was the \"most likely\" successor to Kim Jong Un - although they noted there were \"many variables\" still in play, not least because of her father's young age.Since then, she has appeared by her father's side on numerous occasions. Standing next to him at ICBM launches and military parades, she has taken centre stage and received military salutes from senior military commanders.But September 2025 marked the first time she was seen outside North Korea.The Kim family, who have ruled North Korea since 1948, tell citizens they hail from a sacred bloodline, meaning only they can lead the country.However, there is speculation that Kim has introduced his daughter at this point to try to overcome prejudice in the deeply patriarchal state, which has never been led by a woman.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "North Korea: Who is Kim Ju Ae, the daughter who may succeed Kim Jong Un?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/30dc/live/2b05ab20-8848-11f0-b391-6936825093bd.jpg"
      ],
      "datePublished": "2026-02-12T16:00:09.000Z",
      "dateModified": "2026-02-12T16:00:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who were the victims of the shootings in Tumbler Ridge, Canada?",
    "url": "https://www.bbc.com/news/articles/c0rjg9ddgkqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/634d/live/48a2f560-086e-11f1-b5e2-dd58fc65f0f6.png",
    "tag": "World",
    "date": "2026-02-12T23:42:50.000Z",
    "description": "2 hours agoCaitlin WilsonWatch: How the Tumbler Ridge school shooting unfoldedEight people were killed in two shootings - at a school and at a home - ",
    "body": "2 hours agoCaitlin WilsonWatch: How the Tumbler Ridge school shooting unfoldedEight people were killed in two shootings - at a school and at a home - in the Canadian Rockies town of Tumbler Ridge, British Columbia, this week.Another 27 people were injured, meaning many residents in the rural community of just 3,000 people will know someone who was a casualty of Tuesday's attacks.Here is what we know about the victims.Jennifer Jacobs and Emmett JacobsRCMPThe mother of 18-year-old shooting suspect Jesse Van Rootselaar is among the victims. Jennifer Jacobs, 39, who was also known as Jennifer Strang, was one of two of Van Rootselaar's family members found dead at a local residence, British Columbia's Royal Canadian Mounted Police (RCMP) said. Van Rootselaar was found dead on the scene from a self-inflicted gunshot wound, police said. Court documents related to a family dispute from 2015 show that Jacobs and her children had spent years travelling around Canada, with a judge saying the family led \"an almost nomadic life\", moving between \"Newfoundland, Grand Cache and Powell River, British Columbia\" over five years.  She was then ordered to return with the children to British Columbia.Van Rootselaar's 11-year-old step-brother, Emmett Jacobs, was also killed at the residence, the RCMP confirmed. Kylie SmithRCMPAmong the victims killed at Tumbler Ridge Secondary School was 12-year-old Kylie Smith, the RCMP confirmed on Thursday. \"Kylie was the light in our family. She loved her family, friends, and going to school,\" her family said in a tribute shared by the police. \"She was a talented artist and had dreams of going to art school in the big city of Toronto,\" the statement said. \"Rest in paradise, sweet girl, our family will never be the same without you.\"Abel MwansaRCMPAbel Mwansa, who was 12, is being remembered for his beautiful smile and love of science. He was also a great soccer player who always gave it his all on the pitch and was ready to jump in and help his teammates, his coach Tyler Curry told Global News. His father, a pastor, wrote on social media:  \"If I had power to give life I would have brought you back to life together with others that where killed alongside you but son my power is limited, and seeing your child murdered at this age is heart breaking.\" He told CBC News that his son was \"ambitious\" and had a genuine smile, which he often flashed.  Zoey BenoitRCMPZoey Benoit, 12, was killed at the secondary school, the RCMP confirmed. \"She was so resilient, vibrant, smart, caring and the strongest little girl you could meet,\" Benoit's family said in a statement shared by the police. \"She brought so much laughter and smiles in her presence. She loved spending time with her family where she could show her love. Our family is devastated by this loss, but we will cherish her memories with us so close to our hearts forever.\"\"She will forever be loved and never forgotten. We miss you beautiful girl, Zoey we love you so much,\" the statement said. Getty ImagesShannda Aviugana-DurandShannda Aviugana-Durand, a 39-year-old, was also killed at Tumbler Ridge Secondary School, the RCMP confirmed. In a statement on social media, the BC General Employees Union (BCGEU) posted a tribute to Aviugana-Durand who was an educator.\"We are grieving the profound loss of one of our union members whose life was taken in this terrible event. Shannda Aviugana-Durand, 39, was a member of the BCGEU and worked at Tumbler Ridge Secondary School,\" the statement said.\"We extend our deepest condolences to the family, friends, coworkers, and all those whose lives she touched.\"Student victims RCMPEzekiel Schofield, 13, was killed at Tumbler Ridge Secondary SchoolOther deceased victims named by the police include Ticaria Lampert, 12, and Ezekiel Schofield, 13, who were both students at Tumbler Ridge Secondary School. Maya GebalaTwo children were also badly injured in the attack, including Maya Gebala, her family says. The 12-year-old was airlifted to a children's hospital in Vancouver.Her daughter \"is fighting for her life\" her mother, Cia Edmonds, posted on social media on Tuesday, saying she was wounded in her head and neck.  She asked for prayers for her daughter. Her aunt told Global News that Maya is outgoing and loves sports, especially ice hockey. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who were the victims of the shootings in Tumbler Ridge, Canada?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/634d/live/48a2f560-086e-11f1-b5e2-dd58fc65f0f6.png"
      ],
      "datePublished": "2026-02-12T23:42:50.000Z",
      "dateModified": "2026-02-12T23:42:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Emergency call released of boy who swam for hours to save family",
    "url": "https://www.bbc.com/news/videos/cy8g741k920o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5584/live/0d37f0a0-073f-11f1-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-11T11:54:04.000Z",
    "description": "Police have released audio of a call between emergency services and a 13-year-old Australian boy who swam for hours to get help for his family after t",
    "body": "Police have released audio of a call between emergency services and a 13-year-old Australian boy who swam for hours to get help for his family after they were swept out to sea earlier in February.In the call, Austin Appelbee says his siblings - brother Beau, 12, and sister Grace, eight - and their mother were still in the water.\"I don't know what their condition is right now and I'm really scared,\" he says.The boy also describes feeling \"extremely tired\" after the grueling ordeal.Austin passed out after making the call and was taken to the hospital, where he was told his siblings and mother were found alive and well after being rescued 14km (8.5 miles) offshore.More on this story: 'I don't think I am a hero' - Boy, 13, describes 'superhuman' swim to save family",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Emergency call released of boy who swam for hours to save family",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5584/live/0d37f0a0-073f-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-11T11:54:04.000Z",
      "dateModified": "2026-02-11T11:54:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]