[
  {
    "title": "Nearly 70 schools to close in Australia over fears of asbestos in play sand",
    "url": "https://www.bbc.com/news/articles/cnve03m0d94o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6627/live/34b46580-c2cc-11f0-9d55-433111332088.jpg",
    "tag": "World",
    "date": "2025-11-16T10:22:45.000Z",
    "description": "10 hours agoDanai Nesta KupembaBBC NewsGetty ImagesA total of 69 schools in the Australian Capital Territory (ACT) will be forced to close on Monday a",
    "body": "10 hours agoDanai Nesta KupembaBBC NewsGetty ImagesA total of 69 schools in the Australian Capital Territory (ACT) will be forced to close on Monday after coloured play sand was recalled due to asbestos risk, the government has said.A recall for the products, which were found to have traces of asbestos in some samples, was issued by Kmart and Target on Saturday. The Australian Competition & Consumer Commission (ACCC) said there was a \"low\" risk that the asbestos could become airborne or fine enough for inhalation.Inspections of the schools are under way and could \"take days\", said ACT Education Minister Yvette Berry in a post on Facebook. She added that air testing so far has come back \"negative to airborne asbestos\" from all schools.This comes after several schools and preschools in the region were fully or partially closed on Friday, after a warning over asbestos risks in children's sand sold by Officeworks. There were also school closures in New Zealand due to fears over sand products, with at least two other schools set to close for testing on Monday according to the New Zealand Herald. Addressing the new closures, Berry said:  \"Unfortunately, these sand products are even more widely used in our schools than the Officeworks products.\"The Australian Competition & Consumer CommissionState Emergency Service volunteers and school staff have been walking through buildings and \"mapping all coloured sand they see\" over the weekend, she added. The ACT government said that people who have been in contact with the product do not require a clinical assessment. Berry said despite the minimal risk, the government is \"required to eliminate risk as much as reasonably practicable\".Up to 23 schools will remain open as they either have \"small stocks\" of the sand or do not have any of the product. The products set out in the recall notice are labelled as Active Sandtub 14 piece Sand Castle Building Set, and Blue, Green and Pink Magic Sand. Asbestos, once widely used in building materials, can release toxic fibres into the air   if disturbed or processed that can cling to the lungs and - over decades - cause cancer. Importing or exporting asbestos or goods containing asbestos is prohibited under both Australian and New Zealand law.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nearly 70 schools to close in Australia over fears of asbestos in play sand",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6627/live/34b46580-c2cc-11f0-9d55-433111332088.jpg"
      ],
      "datePublished": "2025-11-16T10:22:45.000Z",
      "dateModified": "2025-11-16T10:22:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "YouTuber Jack Doherty arrested in Miami on drug possession charges",
    "url": "https://www.bbc.com/news/articles/c620yzjpxlvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6848/live/411d3900-c2c7-11f0-a94f-9d723e4e4e44.jpg",
    "tag": "World",
    "date": "2025-11-16T10:48:32.000Z",
    "description": "YouTuber Jack Doherty was arrested on drug possession and other charges in the Miami area in the early hours of Saturday morning, police said.The infl",
    "body": "YouTuber Jack Doherty was arrested on drug possession and other charges in the Miami area in the early hours of Saturday morning, police said.The influencer was filming video content while attempting to engage with police officers in the middle of the road, blocking traffic in the process, according to arrest documents published by US media. He was then apprehended, before a police search found \"half of an orange oval-shaped pill with 3 imprinted on it, consistent with a Schedule II amphetamine\", and three \"suspected cannabis cigarettes\".The 22-year-old is known for filming provocative videos involving pranks, with titles like \"I got kicked off a cruise\" and \"I crashed into a cop car\".He is also known for videos in which he provokes strangers on the street, before hiding behind his bodyguard.He has more than 15 million subscribers on YouTube, over 10 million followers on TikTok and more than 2.8 million followers on Instagram.It is unclear if Mr Doherty has a lawyer. A representative listed on his social media did not immediately respond to a request for comment. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "YouTuber Jack Doherty arrested in Miami on drug possession charges",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6848/live/411d3900-c2c7-11f0-a94f-9d723e4e4e44.jpg"
      ],
      "datePublished": "2025-11-16T10:48:32.000Z",
      "dateModified": "2025-11-16T10:48:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thirteen injured after demolition derby car hits crowd in Australia",
    "url": "https://www.bbc.com/news/articles/c8x1k0x2k2lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bcbf/live/150ec0e0-c286-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "World",
    "date": "2025-11-16T05:37:42.000Z",
    "description": "Thirteen people were injured, two critically, after a car crashed into a crowd during a demolition derby in southeastern Australia, police said.The ca",
    "body": "Thirteen people were injured, two critically, after a car crashed into a crowd during a demolition derby in southeastern Australia, police said.The car had been taking part in a race in the town of Walcha on Saturday night when it drove through a fence and hit the grandstand, New South Wales police said in a statement.The race, part of the annual Walcha Motorcycle Rally, had been a demolition derby - a type of motorsport where drivers ram their vehicles into one another.Brendan Moylan, a member of parliament for Northern Tablelands, the region where Walcha is located, said on social media on Sunday that nine people remained in hospital and \"all are now recovering\".Earlier, police put the number of injured at nine. They said the ages of the injured bystanders ranged from 20 to 75, while a critically injured person was a 54-year-old man. An investigation was under way, they said.Police said they were told that the 27-year-old driver of the car had been involved in a collision on the track right before it drove into the fence.In a statement published on the Walcha Motorcycle Rally's Facebook page, the Walcha Council said that it was \"shocked and stunned at the unfortunate accident\".The Council said it would work with authorities to \"examine the circumstances which led to the accident\". Giving any comments before concluding the inquiries would be \"inappropriate\", it said.In a post on Facebook, Moylan thanked emergency responders and other bystanders for their \"swift and incredibly professional work at the scene\". \"My thoughts are with everyone affected,\" he wrote.Barnaby Joyce, former deputy prime minister and incumbent New England lawmaker, wrote on Facebook that his \"thoughts, prayer and hopes\" were with those injured in the crash.\"Such a sad end to such a great event,\" he wrote.The Walcha Motorcycle Rally describes itself as a \"grassroots event for motorcycle enthusiasts\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thirteen injured after demolition derby car hits crowd in Australia",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bcbf/live/150ec0e0-c286-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-16T05:37:42.000Z",
      "dateModified": "2025-11-16T05:37:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bus driver released after Stockholm crash arrest",
    "url": "https://www.bbc.com/news/articles/c629m7jm777o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a217/live/b51ea9c0-c177-11f0-9e77-171133adaa3b.png",
    "tag": "World",
    "date": "2025-11-15T17:00:29.000Z",
    "description": "A bus driver arrested after three people were killed and another three injured in a crash in Stockholm on Friday has been released.Authorities are con",
    "body": "A bus driver arrested after three people were killed and another three injured in a crash in Stockholm on Friday has been released.Authorities are continuing to investigate the circumstances of the incident after a bus crashed into a bus stop queue on Valhallavägen street in the Swedish capital.The Swedish Prosecution Authority said on Saturday there was \"no reason\" to keep the driver, who had been questioned by police, in custody but that \"certain investigative measures remain\".The man had been arrested on suspicion of three counts of causing death and three of causing bodily harm. Police said there was no reason to think the incident was intentional. Officials are still trying to establish the identities of the victims. The bus was not in service at the time and no passengers were on board, local media report. The crash happened near the Royal Institute of Technology university at about 15:23 (14:23 GMT).Images from the scene show rescue crews appearing to help people trapped underneath the double-decker bus.A witness who owns a shop on the street told SVT the bus hit a pole in front of the bus shelter. They said several people ran into the shop crying.A woman told the local Expressen newspaper that the bus \"mowed down an entire bus stop queue\". She said people were screaming and trying to help the injured, while dead people lay on the ground.\"There must have been more people under the bus,\" she said.Prime Minister Ulf Kristersson said his thoughts were with the victims and their families.\"People who might have been on their way home to family, friends, or a quiet evening at home. We do not yet know the cause, but right now my thoughts are primarily with those affected and their loved ones,\" he posted on X.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bus driver released after Stockholm crash arrest",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a217/live/b51ea9c0-c177-11f0-9e77-171133adaa3b.png"
      ],
      "datePublished": "2025-11-15T17:00:29.000Z",
      "dateModified": "2025-11-15T17:00:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kashmir blast: Nine killed in accidental explosion at police station in Indian-administered Kashmir, officials say",
    "url": "https://www.bbc.com/news/articles/cnvel2gvqeqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3586/live/25eb4170-c1ed-11f0-a3c4-ebcbc0706d0f.jpg",
    "tag": "World",
    "date": "2025-11-15T10:04:06.000Z",
    "description": "1 day agoDanai Nesta KupembaBBC NewsNine people have been killed and 32 injured after a stockpile of confiscated explosives accidentally blew up at a ",
    "body": "1 day agoDanai Nesta KupembaBBC NewsNine people have been killed and 32 injured after a stockpile of confiscated explosives accidentally blew up at a police station in Indian-administered Kashmir, police said.It comes just days after a car blast killed several people in Delhi, in what the government has called a \"terror incident\". The explosion happened on Friday evening at Nowgam police station, and the explosives were seized from Faridabad in the northern state of Haryana earlier in the week. The region's director general of police, Nalin Prabhat, said the explosives were being sent for forensic examination - but due to a \"very unfortunate\" mishap during handling they detonated at around 23:20 local time (17:50 GMT).Police said in a statement that it was an accidental detonation, not a terrorist attack. \"Any other speculation into the cause of this incident is unnecessary,\" the police chief told journalists.The police station suffered severe damage in the explosion and adjacent buildings were also affected, he said.Multiple vehicles were \"engulfed in flames and reduced to charred husks, with debris scattered across the site\", according to a police statement. \"The intensity of the blast was such that some body parts were recovered from nearby houses, around 100-200 metres away from the police station,\" a source told Reuters news agency. Most of the victims were police officers, along with forensic personnel, two crime scene photographers, and a tailor who was with the team. Manoj Sinha, the region's Lieutenant Governor appointed by the Indian government, expressed his condolences and said he had ordered an investigation. \"I have ordered a probe to ascertain the cause of the accidental explosion. Deeply anguished by the loss of precious lives due to extremely tragic accidental blast at Nowgam police station in Srinagar. My condolences to the bereaved families. I pray for speedy recovery of the injured,\" he wrote on social media.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kashmir blast: Nine killed in accidental explosion at police station in Indian-administered Kashmir, officials say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3586/live/25eb4170-c1ed-11f0-a3c4-ebcbc0706d0f.jpg"
      ],
      "datePublished": "2025-11-15T10:04:06.000Z",
      "dateModified": "2025-11-15T10:04:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "At least four dead after migrant boats sink in Mediterranean",
    "url": "https://www.bbc.com/news/articles/cgkz5k5erzgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1986/live/1da758e0-c289-11f0-88d6-3b63f235a784.jpg",
    "tag": "World",
    "date": "2025-11-16T01:58:03.000Z",
    "description": "At least four people have died after two boats carrying nearly 100 migrants capsized off the coast of Libya on Saturday, rescue workers have said.Thos",
    "body": "At least four people have died after two boats carrying nearly 100 migrants capsized off the coast of Libya on Saturday, rescue workers have said.Those confirmed to have died by the Libyan Red Crescent so far were all passengers in a boat carrying 26 Bangladeshi nationals.The humanitarian group did not say whether there were further fatalities among passengers in a second boat which sank while carrying around 70 mostly Sudanese people.The boats were using the central Mediterranean route between North Africa and Italy, which is the \"deadliest known migration route in the world\" according to the UN International Organization for Migration (IOM).The boats had set off from Al Khums, a port city in northwestern Libya, the organisation said.The Libyan Red Crescent shared images of its crew administering aid to survivors, as well as black body bags lying on the ground.Hundreds of people die each year trying to make the crossing to southern Europe each year in overcrowded and unsafe boats. More than 1,500 people have died or gone missing in the Mediterranean in 2025 so far, according to data from the IOM. Around a third of those cases happened off Libya's coast.The North African nation was the departure point for the majority of the almost 59,000 people who arrived in Europe this year via the central Mediterranean route, according to Frontex, the European Union's border security agency. Earlier this week, dozens of migrants who boarded a small boat in Libya were missing and presumed dead after it capsized in the Mediterranean. Seven survivors - from Sudan, Somalia, Cameroon and Nigeria - were rescued after being lost at sea for nearly a week.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "At least four dead after migrant boats sink in Mediterranean",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1986/live/1da758e0-c289-11f0-88d6-3b63f235a784.jpg"
      ],
      "datePublished": "2025-11-16T01:58:03.000Z",
      "dateModified": "2025-11-16T01:58:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South Korean actress and K-pop star Nana fights off home intruder",
    "url": "https://www.bbc.com/news/articles/czr1dm5vkjdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b577/live/a5bbc610-c2ae-11f0-b6ec-5792363f89a7.jpg",
    "tag": "World",
    "date": "2025-11-16T06:05:29.000Z",
    "description": "South Korean actor and K-pop singer Nana managed to fight off a home intruder alongside her mother, local media reported. A man in his 30s reportedly ",
    "body": "South Korean actor and K-pop singer Nana managed to fight off a home intruder alongside her mother, local media reported. A man in his 30s reportedly broke into the star's property in Guri with a weapon and threatened the two women.But the 34-year-old singer's agency told South Korean media that Nana - whose real name is Im Jin-ah - and her mother managed to subdue the intruder until police arrived.The actor's mother lost consciousness during the disturbance, and both she and Nana required medical attention, the Yonhap news agency reported.A local detective told AFP news agency that the intruder was attempting to steal valuables and had been detained on charges of aggravated robbery.The suspect reportedly threatened both women and demanded money after breaking into the house.Nana and her mother called the police after restraining the man, who was also taken to hospital for treatment, local media said.Nana rose to fame in 2009 with the popular K-pop girl group After School.The group is no longer active but she has since gained popularity over the past decade as an actor. She has starred in several TV series, including Kill It and Justice, both crime dramas which first aired in 2019.Nana released her first solo album in September.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South Korean actress and K-pop star Nana fights off home intruder",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b577/live/a5bbc610-c2ae-11f0-b6ec-5792363f89a7.jpg"
      ],
      "datePublished": "2025-11-16T06:05:29.000Z",
      "dateModified": "2025-11-16T06:05:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says he will sue BBC for at least $1bn over Panorama edit",
    "url": "https://www.bbc.com/news/articles/c891jp9j79do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0acf/live/f99f2110-c1cc-11f0-8669-5560f5c90fbe.jpg",
    "tag": "World",
    "date": "2025-11-15T19:43:03.000Z",
    "description": "US President Donald Trump has said he will take legal action against the BBC over how his speech was edited by Panorama, after the corporation apologi",
    "body": "US President Donald Trump has said he will take legal action against the BBC over how his speech was edited by Panorama, after the corporation apologised but refused to compensate him.Speaking to reporters on board Air Force One on Friday evening, Trump said: \"We'll sue them for anywhere between $1bn [£759m] and $5bn, probably sometime next week.\"On Thursday, the BBC said the edit of the 6 January 2021 speech had unintentionally given \"the mistaken impression that President Trump had made a direct call for violent action\" and said it would not be broadcast again.The corporation apologised to the president but said it would not pay financial compensation.The BBC released that statement after Trump's lawyers threatened to sue the BBC for $1bn in damages unless the corporation issued a retraction, apology and paid him compensation. \"I think I have to do it,\" Trump told reporters of his plan to take legal action. \"They cheated. They changed the words coming out of my mouth.\"The president said he had not raised the issue with Sir Keir Starmer but that the prime minister had asked to speak to him. Trump said he would call Starmer over the weekend.A search of public court record databases confirmed that no lawsuit had been filed in federal or state court in Florida as of Friday evening.A BBC spokesperson said on Saturday evening: \"We have had no further contact from President Trump's lawyers at this point. \"Our position remains the same.\"In a separate interview on Saturday recorded before his comments on Air Force One, Trump said he had an \"obligation\" to sue the BBC, adding: \"If you don't do it, you don't stop it from happening again with other people.\"He called the edit \"egregious\" and \"worse than the Kamala thing\", a reference to a dispute he had with US news outlet CBS over an interview on the 60 Minutes programme with his 2024 election opponent Kamala Harris.In July this year, US media company Paramount Global agreed to pay $16m (£13.5m) to settle a legal dispute over that interview.Sir Craig Oliver, former BBC editor and ex-director of politics and communications for former Prime Minister David Cameron, told BBC Today programme that this is a \"nightmare\" situation for the public broadcaster. \"The problem is that public money could be spent fighting this or settling this,\" Sir Craig said, adding that Trump doesn't \"understand the BBC, how it is funded or how it works\". Watch: Trump says he will sue the BBC. Gary O'Donoghue explains what's nextThe controversy stems from the way in which Trump's 6 January 2021 speech was edited by Panorama for a documentary which aired in October 2024. During his address, he told supporters: \"We're going to walk down to the Capitol, and we're going to cheer on our brave senators and congressmen and women.\"More than 50 minutes later in the speech, he said: \"And we fight. We fight like hell.\"In the Panorama programme the clip shows him as saying: \"We're going to walk down to the Capitol... and I'll be there with you. And we fight. We fight like hell.\"Controversy around how Trump's speech was edited has led to the resignations of BBC director general Tim Davie and head of news Deborah Turness.In its Corrections and Clarifications section, published on Thursday evening, the BBC said the Panorama programme had been reviewed after criticism of how Trump's speech had been edited.\"We accept that our edit unintentionally created the impression that we were showing a single continuous section of the speech, rather than excerpts from different points in the speech, and that this gave the mistaken impression that President Trump had made a direct call for violent action,\" the statement said.Lawyers for the BBC have written to Trump's legal team, a BBC spokesperson said this week.\"BBC chair Samir Shah has separately sent a personal letter to the White House making clear to President Trump that he and the corporation are sorry for the edit of the president's speech on 6 January 2021, which featured in the programme,\" they said.They added: \"While the BBC sincerely regrets the manner in which the video clip was edited, we strongly disagree there is a basis for a defamation claim.\"In its letter to Trump's legal team, the BBC set out five main arguments for why it did not think it had a case to answer.First it said the BBC did not have the rights to, and did not, distribute the Panorama episode on its US channels.When the documentary was available on BBC iPlayer, it was restricted to viewers in the UK.Secondly, it said the documentary did not cause Trump harm, as he was re-elected shortly after.Thirdly, it said the clip was not designed to mislead, but just to shorten a long speech, and that the edit was not done with malice.Fourthly, it said the clip was never meant to be considered in isolation. Rather, it was 12 seconds within an hour-long programme, which also contained lots of voices in support of Trump.Finally, an opinion on a matter of public concern and political speech is heavily protected under defamation laws in the US.The BBC's apology came hours after a second similarly edited clip, broadcast on Newsnight in 2022, was revealed by the Daily Telegraph.Watch: How the BBC works... in under two minutes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says he will sue BBC for at least $1bn over Panorama edit",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0acf/live/f99f2110-c1cc-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-15T19:43:03.000Z",
      "dateModified": "2025-11-15T19:43:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Iran begins cloud seeding to induce rain during worst drought in decades ",
    "url": "https://www.bbc.com/news/articles/cj4172yl0l1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6888/live/41ee2db0-c300-11f0-bdc1-a928b34ade94.jpg",
    "tag": "World",
    "date": "2025-11-16T17:02:02.000Z",
    "description": "3 hours agoRuth ComerfordReutersWater levels in Tehran's Amirkabir dam are at 8% of capacity, officials sayAuthorities in Iran have sprayed clouds wit",
    "body": "3 hours agoRuth ComerfordReutersWater levels in Tehran's Amirkabir dam are at 8% of capacity, officials sayAuthorities in Iran have sprayed clouds with chemicals to induce rain, in an attempt to combat the country's worst drought in decades.Known as cloud-seeding, the process was conducted over the Urmia lake basin on Saturday, Iran's official news agency Irna reported.Urmia is Iran's largest lake, but has largely dried out leaving a vast salt bed. Further operations will be carried out in east and west Azerbaijan, the agency said. Rainfall is at record lows and reservoirs are nearly empty. Last week President Masoud Pezeshkian warned that if there is not enough rainfall soon, Tehran's water supply could be rationed and people may be evacuated from the capital.Cloud seeding involves injecting chemical salts including silver or potassium iodide into clouds via aircraft or through generators on the ground. Water vapour can then condense more easily and turn into rain.The technique has been around for decades, and the UAE has used it in recent years to help address water shortages.Iran's meteorological organisation said rainfall had decreased by about 89% this year compared with the long-term average, Irna reported.\"We are currently experiencing the driest autumn the country has experienced in 50 years,\" it added.Officials have also announced plans to penalise households and businesses that consume excessive amounts of water.EPA/ShutterstockWomen during the rainfall prayer at the Saleh Shrine in northern TehranThe head of Iran's National Centre for Climate and Drought Crisis Management, Ahmad Vazifeh said dams in Tehran, West Azerbaijan, East Azerbaijan and Markazi are in a \"worrying state\", with water levels in the single-digit percentages.On Friday, hundreds gathered at a mosque in Tehran to pray for rainfall.Iranian meteorologists reported there was some rainfall in the west and northwest of the country on Saturday - with video showing snowfall on a ski resort north of Tehran for the first time this year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iran begins cloud seeding to induce rain during worst drought in decades ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6888/live/41ee2db0-c300-11f0-bdc1-a928b34ade94.jpg"
      ],
      "datePublished": "2025-11-16T17:02:02.000Z",
      "dateModified": "2025-11-16T17:02:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zelensky vows energy sector overhaul after $100m corruption scandal",
    "url": "https://www.bbc.com/news/articles/cvgwyyd8l58o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1e1e/live/81c4bf20-c25c-11f0-80d4-cd6e0a140eb7.jpg",
    "tag": "World",
    "date": "2025-11-15T20:26:30.000Z",
    "description": "Ukrainian President Volodymyr Zelensky has vowed to \"overhaul\" state-owned energy companies, after a major corruption scandal engulfed the country's e",
    "body": "Ukrainian President Volodymyr Zelensky has vowed to \"overhaul\" state-owned energy companies, after a major corruption scandal engulfed the country's energy sector.Around $100 million (£76m) has been embezzled, anti-graft investigators said, causing outrage in a country where Russian attacks have resulted in crippling power outages.\"Alongside a full audit of their financial activities, the management of these companies is to be renewed,\" Zelensky wrote in a post on X on Saturday. Energoatom, the state nuclear company at the heart of the scandal, will have a new supervisory board \"within a week,\" he added. Several of those implicated in the scandal have close links to the Ukrainian president.The scandal is unfolding against the backdrop of escalating Russian attacks on Ukrainian energy facilities, including substations that supply electricity to nuclear power plants.\"I have also instructed government officials to maintain constant and meaningful communication with law enforcement and anti-corruption bodies,\" Zelensky wrote. He also called for the quick appointment of a new head of Ukrhydroenergo, a hydropower generating company, and reforms for oil and gas giant Naftogaz and the nation's Gas Transmission System Operator. Two ministers were forced to resign over the corruption scheme and a former business partner of Zelensky was sanctioned earlier this week when the scandal broke.On Monday, the National Anti-Corruption Bureau of Ukraine (Nabu) and Specialised Anti-Corruption Prosecutor's Office (Sap) said the 15 month-long investigation had revealed several members of the Ukrainian government were involved.Some of those implicated in the scandal are or have been, close associates of Zelensky's. Among those alleged to be involved are Justice Minister Herman Halushchenko, former Deputy Prime Minister Oleksiy Chernyshov and Timur Mindich - a businessman and a co-owner of Zelensky's former TV studio Kvartal95.Zelensky has previously said he is committed to cooperate fully with the anti-corruption investigation.\"I have also instructed government officials to maintain constant and meaningful communication with law enforcement and anti-corruption bodies,\" he said on Saturday.\"The full transparency and integrity in the energy sector remain an absolute priority.\"But the scandal has brought Zelensky's commitment to fighting corruption under scrutiny once again. In July, he faced backlash after he signed a law limiting the independence of Nabu and Sap. The outrage was only quelled by Zelensky's decision to reinstate their freedom, but the debacle prompted criticism from European allies including France and Germany, while ambassadors from the G7 group of nations expressed the desire to discuss the issue with the Ukrainian leadership.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zelensky vows energy sector overhaul after $100m corruption scandal",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1e1e/live/81c4bf20-c25c-11f0-80d4-cd6e0a140eb7.jpg"
      ],
      "datePublished": "2025-11-15T20:26:30.000Z",
      "dateModified": "2025-11-15T20:26:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Red Fort explosion: Man arrested over deadly Delhi car bomb blast",
    "url": "https://www.bbc.com/news/articles/clyk0nd1nq6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4366/live/7eead4d0-c304-11f0-bdc1-a928b34ade94.jpg",
    "tag": "World",
    "date": "2025-11-16T16:16:05.000Z",
    "description": "A man has been arrested in connection with a deadly car bomb attack that killed eight people and wounded 20 others in Delhi last week, authorities hav",
    "body": "A man has been arrested in connection with a deadly car bomb attack that killed eight people and wounded 20 others in Delhi last week, authorities have said.The National Investigation Agency (NIA) said the car used in the attack, which the government has called a \"terrorist incident\", was registered in the arrested suspect's name.They have accused him of conspiring with the alleged suicide bomber. The suspect was a resident of Indian-administered Kashmir, authorities say. The explosion happened near a metro station close to the Red Fort, one of Delhi's most high-profile landmarks.The agency said it had seized another vehicle allegedly belonging to the suicide bomber for examination. So far, it has interrogated 73 witnesses, including people injured in the blast.The blast outside the historic fort was the first such explosion in the heavily guarded city since 2011.Monday evening's attack took place at 18:52 local time (13:22 GMT) when a slow-moving vehicle stopped at a busy traffic signal and then exploded.Within hours of the incident, Home Minister Shah confirmed the explosion had taken place in a white Hyundai i20.Footage from the location showed remains of a charred white car and a number of other gutted vehicles, including an autorickshaw and cycle rickshaws.Prime Minister Narendra Modi called the attack a \"conspiracy\", and his government vowed to bring the \"perpetrators, their collaborators and their sponsors\" to justice.Opposition leader Rahul Gandhi said the news was \"extremely heartbreaking\".Police on Thursday said they were investigating any links to the recent arrests of seven men by police in Indian-administered Kashmir.Potential connections to the the recent seizure of 2,900kg of explosives from a Delhi suburb were also being probed, police said.The Red Fort is visited by thousands of tourists every day, and was built in the 17th Century. Indian prime ministers use the Mughal fortress as a backdrop for their annual Independence Day speeches.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Red Fort explosion: Man arrested over deadly Delhi car bomb blast",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4366/live/7eead4d0-c304-11f0-bdc1-a928b34ade94.jpg"
      ],
      "datePublished": "2025-11-16T16:16:05.000Z",
      "dateModified": "2025-11-16T16:16:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump rolls back tariffs on dozens of food products",
    "url": "https://www.bbc.com/news/articles/cdjr4xw83eko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c945/live/5af4f750-c1aa-11f0-a67e-9bebb1aed6eb.jpg",
    "tag": "World",
    "date": "2025-11-15T02:11:46.000Z",
    "description": "2 days agoDanielle Kaye,Business reporter and Nardine SaadUS President Donald Trump has signed an executive order allowing a range of food products, i",
    "body": "2 days agoDanielle Kaye,Business reporter and Nardine SaadUS President Donald Trump has signed an executive order allowing a range of food products, including coffee, bananas and beef, to escape his sweeping tariffs.The move comes as his administration faces mounting pressure over rising prices. While Trump previously downplayed concerns about the cost of living, he has focused on the issue since his Republican Party's poor performance in last week's elections.The dozens of products included on the White House's list of exemptions range from avocados and tomatoes to coconuts and mangoes.These goods, the Trump administration said on Friday, cannot be produced in sufficient quantities domestically.Trump has long said that his tariffs - currently a baseline 10% on imports from all countries, with additional levies on many trading partners - would not lead to increased prices for US consumers. He also said affordability was a \"new word\" and a \"con job\" by Democrats.He has argued the taxes are necessary to reduce the US trade deficit - the gap between the value of goods it buys from other countries and those it sells to them. Trump has said the US has been exploited by \"cheaters\" and \"pillaged\" by foreigners, adding that higher levies would encourage those in the US to buy American goods instead. But grocery costs and the soaring price of beef has become a political issue for Trump. Last week, he called for an investigation into the meat-packing industry, accusing companies of \"Illicit Collusion, Price Fixing, and Price Manipulation\".He has aimed to rally support for the taxes, offering $2,000 tariff rebate cheques to Americans - even as the US Supreme Court is currently weighing whether Trump had the legal authority to implement them.  But the latest exemptions signal a reversal by the Trump administration, as the White House seeks to lower prices by walking back levies on some food staples.Speaking to reporters on Friday, Trump said the decision will affect products that are not produced in the US, \"so there's no protection of our industries, or our food products\".He added that he doesn't think more policy rollbacks will be required in the future, saying \"I don't think it'll be necessary.\" \"We just did a little bit of a rollback on some foods, like coffee as an example, where the prices of coffee were a little bit high. Now they'll be on the low side in a very short period of time,\" Trump said.Economists have warned that companies would pass the cost of tariffs onto their customers in the form of higher prices.While inflation remained milder than many analysts had expected in September, most items tracked in the Department of Labor inflation report showed price increases, with groceries up 2.7% from last year.The Trump administration's new tariff exemptions for food products take effect retroactively at midnight on Thursday 13 November, the White House said.In another move to address concerns among consumers about grocery prices, the Trump administration said import taxes on coffee and bananas will be lowered as part of trade deals with four Latin American countries.This week, Trump and Treasury Secretary Scott Bessent both vowed to decrease coffee prices by 20% in the US this year.The White House released a list that includes more than 100 products no longer subject to the levies. Some of them include: CoffeeCocoaBlack teaGreen teaVanilla beansBeef products, including high-quality cuts, bone-in and boneless cuts, corned beef, some frozen items, as well as salted, brined, dried or smoked meatFruits, including acai, avocadoes, bananas, coconuts, guavas, limes, oranges, mangoes, plantains, pineapples, various peppers and tomatoesSpices, including allspice, bay leaves, cardamom, cinnamon, cloves, coriander seeds, cumin seeds, curry, dill fennel seeds, ginger, mace, nutmeg, oregano, paprika, saffron and turmericNuts, grains, roots and seeds, such as barley, Brazil nuts, capers, cashews, chestnuts, macadamia nuts, miso, palm hearts, pine nuts, poppy seeds, tapioca, taro and water chestnuts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump rolls back tariffs on dozens of food products",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c945/live/5af4f750-c1aa-11f0-a67e-9bebb1aed6eb.jpg"
      ],
      "datePublished": "2025-11-15T02:11:46.000Z",
      "dateModified": "2025-11-15T02:11:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thousands protest against government in Mexico City as clashes leave 120 injured",
    "url": "https://www.bbc.com/news/articles/cn8vm30rr78o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/17cb/live/5d3ccef0-c26f-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "World",
    "date": "2025-11-16T03:14:59.000Z",
    "description": "17 hours agoRuth Comerford and Ethirajan Anbarasan,Global Affairs reporterWatch: Protesters against violent crime and the Sheinbaum government clash w",
    "body": "17 hours agoRuth Comerford and Ethirajan Anbarasan,Global Affairs reporterWatch: Protesters against violent crime and the Sheinbaum government clash with police in Mexico CityAt least 120 people - 100 of them police officers - have been injured in clashes during anti-government protests in Mexico City, police said.Thousands of demonstrators marched in the Mexican capital on Saturday to protest against violent crime and President Claudia Sheinbaum's government.Sheinbaum said the marches, which also took place in other cities, had been funded by right-wing politicians who oppose her government.The rally was organised by Gen Z youth groups, drawing support from citizens protesting against high-profile killings, including the assassination just weeks ago of Uruapan Mayor Carlos Manzo - who had called for tough action against cartels.Demonstrators dismantled parts of a barrier protecting the National Palace, where Sheinbaum lives. Police protecting the compound used tear gas on the crowds.Authorities have arrested 20 people for crimes including robbery and assault, Mexico City security chief Pablo Vazquez told reporters.Protesters waved banners displaying messages including \"We are all Carlos Manzo\", while others wore cowboy hats in tribute to him.EPAManzo was shot on 1 November while he attended a Day of the Dead festival.He was known for speaking openly about drug-trafficking gangs in his town and cartel violence. He had been demanding tough action against armed cartel members who terrorise the country. Sheinbaum has been acting against cartels but resisting calls for another all-out war on drugs. Previous attempts by her predecessors have ended with bloody results.Days before the march took place, the president said the demonstration was being promoted by bots online.\"We agree with freedom of expression and freedom of demonstration if there are young people who have demands, but the issue here is who is promoting the demonstration,\" she said in a briefing. \"People should know how this demonstration was organised so that no one is used.\"ReutersSome protesters paid tribute to Uruapan mayor Carlos ManzoSheinbaum retains approval ratings above 70% in her first year in office, and has made in-roads in clamping down on fentanyl-trafficking – a key issue for her US counterpart, Donald Trump.But she has been criticised for failing to halt the violence gripping the country and is facing increased hostility from nearby countries.Earlier this month, Peru's Congress voted to declare Sheinbaum a persona non grata - or unwelcome in the country.The decision came days after Peru severed diplomatic ties with Mexico, after the Mexican government granted asylum to a former Peruvian prime minister facing charges for a 2022 coup attempt.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thousands protest against government in Mexico City as clashes leave 120 injured",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/17cb/live/5d3ccef0-c26f-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-16T03:14:59.000Z",
      "dateModified": "2025-11-16T03:14:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Somalia e-visa breach: US warns thousands of people's data exposed",
    "url": "https://www.bbc.com/news/articles/c620e43z2q5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9d6e/live/2766d660-c218-11f0-8456-eff94716b162.jpg",
    "tag": "World",
    "date": "2025-11-15T16:28:26.000Z",
    "description": "A major data breach in Somalia's electronic visa system may have exposed personal information belonging to tens of thousands of applicants, including ",
    "body": "A major data breach in Somalia's electronic visa system may have exposed personal information belonging to tens of thousands of applicants, including US citizens, the American embassy in Somalia has warned.It said it had received credible reports that \"unidentified hackers\" had penetrated the Somali government's e-visa platform, potentially compromising data from at least 35,000 people.The leaked documents circulating online include names, photos, dates of birth, marital status, home addresses and email contacts, according to a US embassy statement issued on Thursday.\"This data breach is ongoing and could expose any personal data you enter into the system,\" the UK has also warned travellers.\"Consider the risks before applying for an e-visa required for travel to Somalia.\"Somali authorities have not commented on the breach. But the government has shifted its visa service from evisa.gov.so to etas.gov.so, without providing an official explanation.\"While Embassy Mogadishu is unable to confirm whether an individual's data is part of the breach, individuals who have applied for a Somali e-visa may be affected,\" the  US' statement said.The BBC has contacted the Somalia Civil Aviation Authority (SCAA) for comment.Somalia's new system requires all travellers, including those from the self-declared republic of Somaliland and the semi-autonomous region of Puntland, to apply for entry visas online.Critics say travellers have faced extra fees in certain regions, amounting to double charges.Somaliland, which declared independence in 1991, governs itself with its own institutions but has not been internationally recognised. Somalia maintains that the region remains part of its sovereign territory.The alleged breach adds to long-running tensions between Mogadishu and Hargeisa over control of Somali airspace. While Somalia re-established full control of its airspace in 2017, Somaliland continues to contest the arrangement.The dispute escalated further this week when Somaliland's President Abdirahman Irro said Somaliland would not accept Somalia's e-visa and ordered that airlines must obtain clearance from Hargeisa before entering its airspace.Yet major airlines have refused to board passengers without Somalia's e-visa approval.On Saturday, Somaliland's Foreign Minister Abdirahman Dahir Aadan again insisted that \"anyone travelling to Somaliland will obtain their visa on arrival\", saying Somalia's e-visa system was not safe and warning that \"people's data can fall into the hands of extremist groups\" as a result of using it.The stand-off has left some travellers heading to Somaliland stranded at airports after being denied boarding for lacking Somalia's e-visa.Somaliland's Civil Aviation Minister, Fu'aad Ahmed Nuux, has told the BBC that the directives - first announced earlier this year - came into effect on 10 November.He said airlines that do not comply will be told to divert, and claimed several aircraft had already been rerouted.Footage released by Somaliland's aviation ministry appears to show local air-traffic controllers issuing instructions to international pilots - a move celebrated domestically as an assertion of Somaliland's autonomy.But the Somalia Civil Aviation Authority insists it retains sole administrative and legal control over the Mogadishu Flight Information Region (FIR), which covers the whole nation's airspace. It has ordered all aircraft to ignore any instructions issued by authorities other than Mogadishu.It warned that failing to comply with Somali and international aviation rules could pose safety risks and lead to \"serious legal consequences\".Additional reporting by Natasha Booty.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Somalia e-visa breach: US warns thousands of people's data exposed",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9d6e/live/2766d660-c218-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-15T16:28:26.000Z",
      "dateModified": "2025-11-15T16:28:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Delhi: Why India caps pollution reading at 500 when the air is far more toxic",
    "url": "https://www.bbc.com/news/articles/ced6jgg0180o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5c3c/live/1a73af60-c17c-11f0-8456-eff94716b162.jpg",
    "tag": "World",
    "date": "2025-11-16T00:00:03.000Z",
    "description": "20 hours agoNikita YadavBBC News, DelhiFor millions across northern India, the November air tastes ashy, the sky looks visibly hazy and merely steppin",
    "body": "20 hours agoNikita YadavBBC News, DelhiFor millions across northern India, the November air tastes ashy, the sky looks visibly hazy and merely stepping outside feels like a challenge.For many, their morning routine starts with checking how bad the air is. But what they see depends entirely on which monitor they use. Government-backed apps like SAFAR and SAMEER top out at 500 - the upper limit of India's AQI (air quality index) scale, which converts complex data on various pollutants such as PM2.5, PM10, nitrogen dioxide, sulphur dioxide, carbon monoxide and ozone, into a single number. But private and international trackers such as IQAir and open-source monitoring platform AQI routinely show far higher numbers, often shooting past 600 and even crossing 1,000 on some days.This contradiction leaves people asking the same question every year: Which numbers should they trust? And why doesn't India officially report air quality beyond 500?India's official air-quality scale shows readings above 200 pose clear breathing discomfort to most people on prolonged exposure. Readings above 400 and up to 500 are classified as \"severe\" and affect healthy people while also seriously impacting those with existing diseases. The scale however does not go beyond 500 -  a cap set more than a decade ago when the National Air Quality Index was launched.So why was that threshold introduced?\"It was assumed that the health impact would be the same no matter how much higher it goes because we had already hit the worst,\" says Gufran Beig, founder director of SAFAR. He admits that the 500 cap was originally set to avoid creating panic as crossing that mark signalled an alarming situation requiring immediate mitigation.But this approach effectively flattens the data - anything above 500 is treated the same on official monitors, even if the real concentration is far higher.\"International organisations and portals don't impose such a cap,\" says Mr Beig. \"That's why we see numbers going much higher on global platforms.\"The BBC has reached out to India's pollution control board for a comment.Beyond the artificially imposed threshold, there's also a difference in defining hazardous air.For example, the World Health Organization (WHO) guidelines classify PM2.5 levels - particulate matter smaller than 2.5 micrometers - above 15 micrograms per cubic metre in a 24-hour period as hazardous, while in India, the threshold is 60 micrograms.Experts say that globally, there's no universal AQI formula. US, China and the European Union each apply their own pollutant thresholds.\"WHO provides guidelines and every country has built its index based on its own adaptability, weather and local environment,\" says Mr Beig. Comparing India's AQI to WHO or US standards can thus be misleading. Then there is also a difference in the instruments used. The Indian pollution control board uses Beta Attenuation Monitors (BAMs), which physically measure the mass of particles in the air and are calibrated to strict, standardised metrics for every reading.In contrast, portals like IQAir rely on sensor-based monitors, says Abhijeet Pathak, a scientist who formerly worked for India's pollution control board.Sensor-based monitors use laser scattering and electrochemical methods to estimate the number of particles suspended in the air.\"The sensor is a different tool and it is not possible to calibrate them for every run,\"  says Mr Pathak, adding that \"sensor-based air quality monitoring has not yet been approved by the Indian government\".According to him, India's air quality framework hasn't been comprehensively revised since 2009, and he, along with other environmental scientists and activists have called for recalibrating the scale based on the latest technology.\"National Air Quality index will need to be revised if we want to include the sensor-based data,\" says Mr Pathak. Removing the upper cap is also crucial says Mr Beig, \"now that most literature available shows health symptoms keep on worsening as the pollution levels increase\". In the end, India's AQI doesn't stop at 500 because the pollution stops there. It stops at 500 because the system was built with a ceiling.Follow BBC News India on Instagram, YouTube, X and Facebook.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Delhi: Why India caps pollution reading at 500 when the air is far more toxic",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5c3c/live/1a73af60-c17c-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-16T00:00:03.000Z",
      "dateModified": "2025-11-16T00:00:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]