[
  {
    "title": "Former French president Sarkozy released from prison after three weeks",
    "url": "https://www.bbc.com/news/articles/cm2eppqd2nyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0670/live/8fea4ad0-be46-11f0-8669-5560f5c90fbe.jpg",
    "tag": "World",
    "date": "2025-11-10T15:12:24.000Z",
    "description": "1 hour agoLaura GozziReutersNicolas Sarkozy arrived back at his home in the west of Paris just over an hour after a court granted his releasedFormer F",
    "body": "1 hour agoLaura GozziReutersNicolas Sarkozy arrived back at his home in the west of Paris just over an hour after a court granted his releasedFormer French president Nicolas Sarkozy has been released from jail, three weeks into a five-year prison term for taking part in a criminal conspiracy.He will be subject to strict judicial supervision and barred from leaving France.Sarkozy's car was seen leaving La Santé prison in Paris just before 15:00 (14:00 GMT), less than an hour-and-a-half after a court agreed to his early release. Soon after, he was seen arriving at his home in western Paris.On 21 October, the former centre-right president, 70, was sentenced to five years for conspiring to fund his 2007 election campaign with money from late Libyan dictator Muammar Gaddafi. His legal team immediately filed a request seeking his release.Christophe Ingrain, one of Sarkozy's lawyers, hailed his client's release as \"a step forward\" and said they would now be preparing for the appeal trial due to be held in March.One of the conditions of Sarkozy's release is that he does not contact any justice ministry employees. During his incarceration, he was visited by Justice Minister Gérald Darmanin. The visit prompted 30 French lawyers to file a complaint against Darmanin, highlighting what they said was a conflict of interest as Darmanin was a former colleague and friend of Sarkozy's.Speaking to a court in Paris via video link, Sarkozy described his time in solitary confinement as \"gruelling\" and \"a nightmare\".Public prosecutor Damien Brunet recommended that Sarkozy's request for release be granted, but that the former president be banned from contacting other witnesses in the so-called \"Libyan dossier\".Sarkozy, who has always denied any wrongdoing, told the court via video link that he had never had the \"mad idea\" of asking Gaddafi for money and stated he would \"never admit to something I haven't done\".Sarkozy also paid tribute to prison staff who had made his time in prison \"bearable\". \"They have shown exceptional humanity,\" he said.Sarkozy's wife, the singer and model Carla Bruni-Sarkozy, and two of the former president's sons were present in the courtroom to support him. ReutersTwo of Sarkozy's sons, Jean and Pierre, were in court on MondaySarkozy is the first French ex-leader placed behind bars since World War Two Nazi collaborationist leader Philippe Pétain was jailed for treason in 1945.Since entering prison, Sarkozy has been held in a cell in the isolation wing. He had a toilet, a shower, a desk, a small electric hob and a small TV – for which he paid a monthly €14 (£12) fee – and the right to a small fridge.He also had the right to receive information from the outside world and family visits as well as written and phone contact – but was is in effect in solitary confinement. He was allowed just one hour a day for exercise, by himself in the wing's segregated courtyard.Two bodyguards were stationed in nearby cells, which the interior minister Laurent Nuñez was due to Sarkozy's status. There was \"obviously a threat against him\", Nuñez said.Sarkozy was president from 2007-2012. Ever since he left office, he has been dogged by criminal inquiries and for months had to wear an electronic tag around his ankle after a conviction last December for trying to bribe a magistrate for confidential information about a separate case.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former French president Sarkozy released from prison after three weeks",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0670/live/8fea4ad0-be46-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-10T15:12:24.000Z",
      "dateModified": "2025-11-10T15:12:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dozens of inmates found hanged in Ecuador prison",
    "url": "https://www.bbc.com/news/articles/c0kp220561go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0a96/live/fe60d510-be2d-11f0-bd20-5b436a1e000e.jpg",
    "tag": "World",
    "date": "2025-11-10T12:34:33.000Z",
    "description": "At least 31 inmates have been found dead in a prison in southern Ecuador, including 27 who had been hanged, officials say. Four prisoners were killed ",
    "body": "At least 31 inmates have been found dead in a prison in southern Ecuador, including 27 who had been hanged, officials say. Four prisoners were killed and more than 30 injured in clashes between rival gang members in El Oro prison in the city of Machala in the early hours of on Sunday. Hours later, security guards who had been alerted to a fresh outbreak of gang violence found the others who had been hanged on the building's third floor, Ecuador's prison service said.The country's overcrowded prisons have been the scene of a series of deadly riots and gang fights in which hundreds of inmates have been killed in recent years. Ecuador's prison service, known by its initials as Snai, said that the clashes had been triggered by plans to move some of the inmates to a newly-built prison.El Oro prison was the site of another deadly incident in September when 13 inmates and a guard were killed in clashes between rival gangs. Relatives of the prisoners have asked the authorities to step up security inside the prison, including keeping rival gang separate, whilst residents of Machala have long demanded that the facility, which is located in the city centre, be relocated. Earlier this year, the government of President Daniel Noboa announced the construction of a new maximum security jail in the province of Santa Elena.The new prison, named El Encuentro, is expected to open in late November, and according to the interior minister, will boast all the latest security measures. Prison gangs have for years played a key role in the rise of violent crime in Ecuador and two of them, Los Lobos and Los Choneros, were declared Foreign Terrorist Organisations by the US Department of State in September.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dozens of inmates found hanged in Ecuador prison",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0a96/live/fe60d510-be2d-11f0-bd20-5b436a1e000e.jpg"
      ],
      "datePublished": "2025-11-10T12:34:33.000Z",
      "dateModified": "2025-11-10T12:34:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US cleaning woman shot and killed after arriving at wrong home",
    "url": "https://www.bbc.com/news/articles/ce3k5qv21g1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b02f/live/c34eae70-bced-11f0-bef8-2995471bb63c.png",
    "tag": "World",
    "date": "2025-11-08T22:00:13.000Z",
    "description": "2 days agoCBSMaria Florinda Rios Perez was fatally shot after arriving at the wrong home for a house-cleaning appointment US officials are looking int",
    "body": "2 days agoCBSMaria Florinda Rios Perez was fatally shot after arriving at the wrong home for a house-cleaning appointment US officials are looking into whether to file charges against an Indiana homeowner who shot and killed a house cleaner who mistakenly showed up at the wrong address.Police say they found Maria Florinda Rios Perez dead in her husband's arms on the front porch of a home on Wednesday shortly before 0700 local time (12:00 GMT). Authorities had been responding to a call about a possible home invasion in the Indianapolis suburb of Whitestown. The two did not appear to have entered the home, police said in a statement. They have formally submitted the case to the Boone County Prosecutor's Office for review to determine whether criminal charges will be brought in the case. Police have not identified the people in the home or who fired the shot, saying in a statement on Friday that it is a \"complex, delicate, and evolving case, and it would be both inappropriate and potentially dangerous to disclose that information\". They urged patience, warning of a \"concerning spread of misinformation online\" about the case.Mauricio Velazquez, told CBS News, the BBC's US partner, that he wanted justice for his 32-year-old wife. News reports say that she was a mother of four and originally from Guatemala. In an interview with CBS affiliate WTTV, Mr Velazquez said the bullet came right through the door of the home. \"They should've called the police first instead of just shooting out of nowhere like that,\" he said through an interpreter.CBSMauricio Velazquez said the bullet that killed his wife came through the door of the home they went to early on WednesdayBoone County prosecutor Kent Eastwood told The Indianapolis Star that the case is complex due to the language of the state's stand-your-ground law.Stand-your-ground laws are in place in many US states and most permit an individual to protect themselves with the use of reasonable force, including deadly force, to prevent death or great bodily harm.Similar incidents have made headlines across the US in recent years. In 2023, Ralph Yarl, who was then 16, was shot twice after ringing the doorbell of the wrong home in Missouri. Andrew Lester, who was in his 80s, pleaded guilty and died while awaiting sentencing. In New York, 20-year-old Kaylin Gillis died after being shot upon entering the wrong driveway. The homeowner who shot her is now serving a 25-year sentence. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US cleaning woman shot and killed after arriving at wrong home",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b02f/live/c34eae70-bced-11f0-bef8-2995471bb63c.png"
      ],
      "datePublished": "2025-11-08T22:00:13.000Z",
      "dateModified": "2025-11-08T22:00:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Syria's Sharaa arrives in US for Trump talks after sanctions lifted",
    "url": "https://www.bbc.com/news/articles/c0rpxkwdkrpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/44f8/live/b0a95330-bd22-11f0-9c30-6582f0afbab1.jpg",
    "tag": "World",
    "date": "2025-11-09T04:37:20.000Z",
    "description": "Syrian President Ahmed Sharaa has arrived in Washington for an official visit, just two days after the US formally revoked his status as a Specially D",
    "body": "Syrian President Ahmed Sharaa has arrived in Washington for an official visit, just two days after the US formally revoked his status as a Specially Designated Global Terrorist. The former Islamist militant will meet US President Donald Trump at the White House on Monday, 11 months after his rebel alliance ousted Bashar al-Assad.Hours before his arrival in the US capital it was announced that Syrian security services had detained dozens of suspected members of the so-called Islamic State group.Joint efforts to tackle what remains of the group in Syria are expected to be high on the agenda during Sharaa's talks with Trump.Syrian authorities said 71 suspected members of the group were arrested, with weapons and explosives also seized.Since taking power, Sharaa has looked to reestablish Syria's presence on the world stage after decades of isolation under the Assad regime and 13 years of civil war.He travelled to the US in September to address the UN General Assembly, where he said Syria was \"reclaiming its rightful place among the nations of the world\" and called on the international community to remove sanctions.Earlier this week the UN Security Council backed a US resolution to lift measures, which coincided with Washington continuing a months-long process of gradually easing sanctions on Syria and its new leaders.On Friday, Sharaa and his interior minister, Anas Hasan Khattab, were removed from a US register of individuals suspected of supporting or funding extremist groups, a decision the Treasury Department said was \"in recognition of the progress demonstrated by the Syrian leadership\".Sharaa had been listed under the name Muhammad al-Jawlani, the alias he used as leader of Hayat Tahrir al-Sham (HTS). The group was affiliated with al-Qaeda until 2016, when Sharaa severed ties.Prior to leading HTS, Sharaa fought for al-Qaeda in Iraq and was for a time imprisoned by US forces. He was also subject to an American bounty of $10 million.The US lifted its sanctions on HTS earlier this year.Trump previously met Sharaa in May during a visit to Riyadh, where he described him as a \"tough guy, very strong past\".Despite his background, Sharaa has drawn backing from governments that opposed the Assad regime by vowing to lead a moderate government which can win support from Syria's various ethnic groups and factions.Earlier this year, he vowed to root out elements of his security forces which were accused of executing members of Syria's Alawite minority. Deadly violence has also broken out in recent months between Sunni Bedouin tribal fighters and Druze militias, raising questions over whether the HTS-led government can restore stability to a country defined by war for more than a decade. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Syria's Sharaa arrives in US for Trump talks after sanctions lifted",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/44f8/live/b0a95330-bd22-11f0-9c30-6582f0afbab1.jpg"
      ],
      "datePublished": "2025-11-09T04:37:20.000Z",
      "dateModified": "2025-11-09T04:37:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US authorities ground cargo plane model after Kentucky air disaster ",
    "url": "https://www.bbc.com/news/articles/cx2pr5y7p90o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ae88/live/91740bf0-bc81-11f0-ae46-bd64331f0fd4.png",
    "tag": "World",
    "date": "2025-11-09T03:12:21.000Z",
    "description": "2 days agoOttilie Mitchell and Harry SekulichUS aviation authorities have ordered that all models of a cargo plane that crashed mid-takeoff in Kentuck",
    "body": "2 days agoOttilie Mitchell and Harry SekulichUS aviation authorities have ordered that all models of a cargo plane that crashed mid-takeoff in Kentucky on Tuesday be grounded.It comes after a Boeing MD-11 aircraft operated by UPS burst into flames on the runway of Louisville International Airport before colliding into neighbouring businesses, killing 14 people. The American delivery firm had earlier said it would not operate the planes pending an ongoing investigation, with FedEx then following suit.Now the Federal Aviation Administration (FAA) has issued a formal notice banning all MD-11 and MD11F aircraft from flying until safety checks are carried out.In total, 70 models are in use with UPS, FedEx and Western Global Airlines.FAA officials said the Kentucky crash happened after the plane's left engine caught fire and detached from the wing during take-off. The aircraft was carrying 38,000 gallons (144,000 litres) of fuel as it took off for a flight to Hawaii, which contributed to the size of the fire after the crash.A total of 14 people were killed in the crash and subsequent fire, including one person who had been admitted to hospital, Louisville Mayor Craig Greenberg has said.He said the number of dead now matches the number of people who were reported missing, indicating officials do not expect the death toll to climb further.Boeing said it welcomed the directive and that it had already advised the three firms which use the model to stop operating it out of \"an abundance of caution\".It is unclear whether the order will impact delivery services in the US, with none of the three companies reporting disruption so far.Data collated by the live air traffic website FlightRadar24 showed 55 MD-11 planes were used over the past week. \"Contingency plans are in place to flex our integrated air and ground network to help protect time-sensitive, critical shipments such as lifesaving pharmaceuticals, medical devices, and other products move through our network without disruption,\" FedEx said in a statement.UPS also said contingency plans were in place to continue its service. A statement continued: \"Nothing is more important to us than the safety of our employees and the communities we serve.\"The final passenger flights using an MD-11 was in 2014, with the model used exclusively as a cargo carrier since.The model of aircraft involved in the crash was an MD-11F triple-engine plane, which first entered service 34 years ago with Thai Airways as a passenger jet, but was transferred to UPS in 2006.MD-11s were originally manufactured by McDonnell Douglas, before the company merged with Boeing in 1997. Production of MD-11 planes ended in 2000.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US authorities ground cargo plane model after Kentucky air disaster ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ae88/live/91740bf0-bc81-11f0-ae46-bd64331f0fd4.png"
      ],
      "datePublished": "2025-11-09T03:12:21.000Z",
      "dateModified": "2025-11-09T03:12:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "British ex-soldier arrested over killing of Kenyan woman in 2012",
    "url": "https://www.bbc.com/news/articles/c8jrkyzn8dvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c909/live/40a165f0-bbfb-11f0-8137-87774ba307f6.jpg",
    "tag": "World",
    "date": "2025-11-07T19:32:29.000Z",
    "description": "3 days agoSteve Mellen and Alys DaviesA former British soldier is facing extradition to Kenya in connection with the alleged murder of a 21-year-old w",
    "body": "3 days agoSteve Mellen and Alys DaviesA former British soldier is facing extradition to Kenya in connection with the alleged murder of a 21-year-old woman there in 2012.The National Crime Agency (NCA) said Robert James Purkiss was arrested in Tidworth, Wiltshire on 6 November and appeared at Westminster Magistrates' Court on Friday.He was arrested by specialist officers from the NCA's National Extradition Unit in connection with the killing of Agnes Wanjiru after a warrant was issued in September, the agency added.Mr Purkiss, 38, told the court he intended to contest the extradition and was remanded into custody ahead of his next appearance at the same court on 14 November.His lawyers told the court that he \"vehemently denies\" murder.Ms Wanjiru's body was discovered in a septic tank near a hotel in the town of Nanyuki, about 124 miles (200km) north of Nairobi, three months after she had gone missing on 31 March 2012. She had a five-month-old baby at the time.Her body was found near a British army training camp. On the night she was killed, she had reportedly been at a bar with friends where British soldiers were also present. Ms Wanjiru's niece, Esther Njoki, met the UK's defence minister last month in order to push for Mr Purkiss's extradition. In a statement issued through Leigh Day, the lawyers acting for Ms Wanjiru's family, on Friday Ms Njoki said: \"My family is incredibly relieved to hear that the suspect in my aunt's case has been arrested.\"We have waited so many years for this moment which marks an important step towards finally obtaining justice for our beloved Agnes.\"Leigh Day partner Tessa Gregory said: \"This is a huge moment for our client and her family who have been fighting for over a decade to obtain justice for Agnes.\"We hope the UK and Kenyan authorities will now work together to ensure that the suspect can face trial in Kenya as quickly as possible.\"Ms Wanjiru's family has long accused the British army of covering up her death and the Kenyan authorities of failing to properly investigate the case at the time.An inquest into her death was opened in 2018 following pressure from Ms Wanjiru's family, as well as Kenyan rights groups and feminists.In 2019, it concluded that Ms Wanjiru had been unlawfully killed by one or two British soldiers and that she had suffered stab wounds to the chest and abdomen.Later in 2021, a Sunday Times investigation reported that a British soldier had confessed to colleagues that he killed Ms Wanjiru. The soldier left the army after the incident and reportedly continued to live in the UK.In 2024, the army announced it was launching an internal review into the conduct of British soldiers in Kenya, including in Nanyuki.It found 35 suspected cases of soldiers having engaged in sexual exploitation and abuse, including transactional sex, with local women - nine of these being after the army officially banned such conduct in 2022.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "British ex-soldier arrested over killing of Kenyan woman in 2012",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c909/live/40a165f0-bbfb-11f0-8137-87774ba307f6.jpg"
      ],
      "datePublished": "2025-11-07T19:32:29.000Z",
      "dateModified": "2025-11-07T19:32:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hadar Goldin: Israel receives body of soldier killed in 2014",
    "url": "https://www.bbc.com/news/articles/c2kp3yjy8q7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3c6b/live/619139e0-be1a-11f0-8669-5560f5c90fbe.jpg",
    "tag": "World",
    "date": "2025-11-09T19:41:15.000Z",
    "description": "21 hours agoGeorge Wright and Andre Rhoden-PaulReutersIDF soldier Hadar Goldin was killed in Gaza in 2014Israel has received the body of Lt Hadar Gold",
    "body": "21 hours agoGeorge Wright and Andre Rhoden-PaulReutersIDF soldier Hadar Goldin was killed in Gaza in 2014Israel has received the body of Lt Hadar Goldin, a soldier killed in an ambush by Hamas in 2014 and whose body has been held in Gaza since then.The Israeli military said Lt Goldin, who was 23 when he died, was formally identified and will now be buried. He left behind parents, a sister, two brothers, and a fiancée.Hamas's armed wing had said on Sunday that it would hand over Lt Goldin's body as part of a ceasefire deal.Hamas has now returned all 20 living hostages, and 24 out of 28 deceased hostages under the first phase of the deal.On Sunday, Lt Goldin's father Simcha Goldin said in a statement: \"Victory means bringing home the hostages and bringing home our soldiers to Israel.\"Israeli Prime Minister Benjamin Netanyahu and President Isaac Herzog both said they had kept a picture of Lt Goldin in their offices for the past 11 years. Netanyahu said \"we didn't give up\" on bringing him home.\"I know the agony that his family's been through, I know the longing for his return that united the people of Israel and today we're united in bringing him finally to his parents, to his family, to a grave in Israel.\"Efforts to retrieve Lt Goldin \"involved extensive intelligence efforts, alongside operational activities on the ground\" over the past decade and during the last two years of war between Israel and Hamas, the Israel Defense Forces (IDF) said.The military expressed \"deep condolences to the family and continues to make every effort to return all the deceased hostages and is prepared for the continued implementation of the agreement\".Herzog said the government would \"continue to act tirelessly\" to bring home all the hostages.Of the four hostages who remain in Gaza, three are Israeli and one is Thai.ReutersLt Goldin, from Kfar Saba, is the only deceased hostage whose remains were being held in Gaza before the Hamas-led 7 October 2023 attack on Israel, which sparked the latest war. He was killed in combat on 1 August 2014, not long after the start of a ceasefire in that year's war between Israel and Hamas. He was among a group of Israeli soldiers patrolling an agricultural area near Rafah in southern Gaza when they were attacked by a group of Hamas fighters. The Israeli military determined that Lt Goldin was killed along with two other soldiers in a firefight, and that his body was then dragged into an underground tunnel by the Hamas fighters.The Israeli military unleashed massive firepower to try to prevent Hamas from taking Lt Goldin hostage. Scores of Palestinian civilians were killed in the bombardment of Rafah, which continued for four days, including after Lt Goldin was declared dead.Nine years later, the Israeli military launched a campaign in Gaza in response to the 7 October 2023 attack, in which Hamas-led gunmen killed about 1,200 people in southern Israel and took 251 others hostage. At least 69,176 people have been killed by Israeli attacks in Gaza since then, according to the Hamas-run health ministry, whose figures the UN considers reliable.During the ongoing first phase of a US-brokered ceasefire deal, Israel freed 250 Palestinian prisoners in its jails and 1,718 detainees from Gaza.Before Lt Goldin's body was returned, Israel had also handed over the bodies of 300 Palestinians in exchange for the bodies of 20 Israeli hostages returned by Hamas, along with those of three foreign hostages - one of them Thai, one Nepalese and one Tanzanian.The parties also agreed to an increase of aid to the Gaza Strip, a partial withdrawal of Israeli forces, and a halt to fighting, although violence has flared up as both sides accused one another of breaching the deal.On Saturday in Gaza, two Palestinians were killed by Israeli fire. The Israeli military said two people had crossed the yellow line marking the line of Israeli control and posed an \"immediate threat\".Separately, one Palestinian was shot dead in Gaza by Israeli fire and another was wounded on Saturday, local medics and the Israeli military said.Gazan medical officials said the person who died was killed by Israeli fire east of Bureij refugee camp in central Gaza. Civil defence rescuers said the injured Palestinian was wounded by Israeli gunfire in Khan Younis.Israeli military actions have killed at least 241 people since the start of the ceasefire, according to the Gaza health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hadar Goldin: Israel receives body of soldier killed in 2014",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3c6b/live/619139e0-be1a-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-09T19:41:15.000Z",
      "dateModified": "2025-11-09T19:41:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump: US to boycott G20 in South Africa over discredited white farmer 'abuses'",
    "url": "https://www.bbc.com/news/articles/ckgzek4rl8lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/69fb/live/288046d0-bca0-11f0-a4e8-7ba96b8cf803.jpg",
    "tag": "World",
    "date": "2025-11-09T04:31:31.000Z",
    "description": "1 day agoAndré Rhoden-PaulEPADonald Trump has said the US will not attend the G20 summit in South Africa over widely discredited claims that white peo",
    "body": "1 day agoAndré Rhoden-PaulEPADonald Trump has said the US will not attend the G20 summit in South Africa over widely discredited claims that white people are being persecuted in the country. The US president said it was a \"total disgrace\" that South Africa is hosting the meeting, where leaders from the world's largest economies will gather in Johannesburg later this month. South Africa's foreign ministry described the decision by the White House as \"regrettable\", while a spokesman for the foreign ministry, Chrispin Phiri, told BBC News that the success of the summit will not \"rest on one member state\".None of South Africa's political parties claim that there is a genocide in South Africa.That includes parties that represent Afrikaners and the white community in general.  Speaking to the Newshour programme, Mr Phiri said that Trump was \"orchestrating an imagined crisis… using the painful history of South Africa's colonial past\".He also said there was \"absolutely no evidence of white persecution in South Africa\", adding: \"South Africa does have its problems and we are dealing with those. I think crime affects everyone, regardless of their race.\"\"We will move on without the United States,\" he said.Trump posted on his social media platform Truth Social: \"It is a total disgrace that the G20 will be held in South Africa.\"Afrikaners (people who are descended from Dutch settlers, and also French and German immigrants) are being killed and slaughtered, and their land and farms are being illegally confiscated,\" he wrote.\"No US government official will attend as long as these human rights abuses continue.\"South Africa's government said the claims of a white genocide are \"widely discredited and unsupported by reliable evidence\".The claims were dismissed as \"clearly imagined\" by a South African court in February.Trump had earlier said South Africa should not be in the G20 at all, and that he would send vice-president JD Vance, instead of attending himself. But now the White House says no US official will go.ReutersDonald Trump  confronted South African President Cyril Ramaphosa in May Every year, a different member state hosts the G20 and sets the agenda for the summit - with the US due to take its turn after South Africa.The South African foreign ministry said in a statement: \"The South African government wishes to state, for the record, that the characterisation of Afrikaners as an exclusively white group is ahistorical. \"Furthermore, the claim that this community faces persecution, is not substantiated by fact.\"Since returning to office in January, Trump has repeatedly accused South Africa of discriminating against its white minority, including in May when when he confronted his South African counterpart Cyril Ramaphosa in the Oval Office. The Trump administration has given Afrikaners refugee status, on the basis of the discredited \"genocide\" claims. Last week, the White House announced plans to cap refugee admissions at a record low, and give priority to white South Africans. The South African government has pointed to the \"limited uptake\" of the offer by South Africans. The G20 was founded in 1999 after the Asian financial crisis. The nations involved have more than 85% of the world's wealth and its aim was to restore economic stability.The first leaders' summit was held in 2008 in response to that year's global financial turmoil, to promote international co-operation.Now the leaders get together each year - along with representatives of the European Union and African Union - to talk about the world's economies and the issues countries are facing.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump: US to boycott G20 in South Africa over discredited white farmer 'abuses'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/69fb/live/288046d0-bca0-11f0-a4e8-7ba96b8cf803.jpg"
      ],
      "datePublished": "2025-11-09T04:31:31.000Z",
      "dateModified": "2025-11-09T04:31:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "More than 1,000 flights cancelled as US air traffic cuts enter second day",
    "url": "https://www.bbc.com/news/articles/cj410k00yw8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6c57/live/ae258c20-bcee-11f0-81cd-cf982342e1e7.jpg",
    "tag": "World",
    "date": "2025-11-09T07:55:29.000Z",
    "description": "1 day agoGrace Eliza GoodwinGetty ImagesTravellers wait in a long line at a security checkpoint at Houston's George Bush Intercontinental Airport on 6",
    "body": "1 day agoGrace Eliza GoodwinGetty ImagesTravellers wait in a long line at a security checkpoint at Houston's George Bush Intercontinental Airport on 6 NovemberMore than 1,400 flights to, from, or within the US were cancelled on Saturday after airlines were told this week to cut traffic during the federal government shutdown.Nearly 6,000 flights were also delayed, down from over 7,000 delays on Friday, according to flight tracker FlightAware. The Federal Aviation Administration (FAA) announced earlier in the week that it would be reducing air travel capacity by up to10% at 40 of the nation's busiest airports as air traffic controllers, who are working without pay during the shutdown,  report fatigue.Republicans and Democrats remain divided over how to end the impasse in Congress. Saturday marked the 39th day of the longest shutdown in history. Senators are in Washington over the weekend for bipartisan negotitations aimed at resolving the deadlock. Republicans have rejected an offer by Democrats to pass the current funding bill, in exchange for a one-year extension to health care subsidies.The shutdown is beginning to be felt by more and more Americans amid cuts to food aid payments and the flight disruptions. In a statement on Saturday, American Airlines urged party leaders \"to reach an immediate resolution to end the shutdown\".New Jersey's Newark Liberty International Airport was experiencing some of the longest wait times. As of Saturday afternoon, arrivals to the airport were delayed by an average of more than four hours, while departures from the airport were delayed by an average of 90 minutes, according to the FAA. The airports with the most cancelled flights on Saturday, both to and from the location, were Charlotte/Douglas International, Newark Liberty International, and Chicago O'Hare International, according to FlightAware. Flights to John F Kennedy and LaGuardia airports in New York were delayed by nearly three hours and an hour respectively, the FAA reported on Saturday afternoon. Other airports affected by lengthy delays inncluded Hartsfield-Jackson Atlanta International. With the Thanksgiving holiday approaching on 27 November, it's one of the busiest travel seasons of the year in the US. It's not just commercial flights that have been affected. Restrictions on private jets are also in place, Transportation Secretary Sean Duffy said in a Saturday post on X.  \"We've reduced their volume at high traffic airports - instead having private jets utilise smaller airports or airfields so busy controllers can focus on commercial aviation,\" Duffy wrote. \"That's only fair.\"And things are likely to get worse in the coming days as the FAA cancels more flights. On Thursday, the agency announced that the flight reductions would be gradual, starting at 4% of  flights on Friday before rising to 6% by 11 November, 8% by 13 November, and the full 10% by 14 November.The FAA said the cuts were necessary to maintain safety as air traffic controllers have been overworked during the shutdown. As essential workers, the controllers are required to continue working without pay, and as a result, many have called in sick or taken on second jobs to afford necessities, unions say. Watch: \"Devastating\" - Airline travellers react to flight reductionsThe controllers are just some of the 1.4 million federal workers who have either been working without pay or been put on forced during the shutdown.Another factor impacting air travel is that most of the Transportation Security Agency (TSA) 64,000 agents are also not being paid while the shutdown is in place.During the last government shutdown, under the first Trump administration in 2018, it was found that up to 10% of TSA staff chose to stay at home rather than work while they weren't receiving a paycheque.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "More than 1,000 flights cancelled as US air traffic cuts enter second day",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6c57/live/ae258c20-bcee-11f0-81cd-cf982342e1e7.jpg"
      ],
      "datePublished": "2025-11-09T07:55:29.000Z",
      "dateModified": "2025-11-09T07:55:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nigeria's Mowaa museum: Edo protesters storm brand new home for West African art",
    "url": "https://www.bbc.com/news/articles/c3642764y7xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/504c/live/5bd53230-bd99-11f0-8456-eff94716b162.jpg",
    "tag": "World",
    "date": "2025-11-09T19:15:47.000Z",
    "description": "21 hours agoTodah OpeyemiBBC Africa, LagosXThe protesters insulted the visitors who had come for a preview eventProtesters targeted a new multi-millio",
    "body": "21 hours agoTodah OpeyemiBBC Africa, LagosXThe protesters insulted the visitors who had come for a preview eventProtesters targeted a new multi-million dollar museum in Nigeria and forced organisers to halt a preview event ahead of Tuesday's planned opening.Videos showed a group insulting foreign guests and ordering them to leave after entering the grounds of the Museum of West African Art (Mowaa) in Benin City on Sunday. They were angry that the museum was not called the Benin Royal Museum and was not under the control of the Oba, the area's traditional king.With preservation and restoration facilities, Mowaa was in part conceived as a home for the Benin Bronzes - artefacts looted from there by British soldiers in the 19th Century. But a dispute over ownership has meant they are not at the museum.All guests were safely escorted to secure locations, according to a statement from the museum.\"We sincerely apologise for any inconvenience this situation may have caused,\" Mowaa said.A local resident in Edo state told the BBC the frustration stems from what many see as a hijacking of an Edo project. \"The Benin Oba, traditional rulers and the government of Edo are not happy about it,\" the resident added.Museum of West African Art (MOWAA), Marco Cappelletti/Marco Cappelletti StudioMowaa, designed by British-Ghanian architect David Adjaye, cost an estimated $25m (£19m) to build\"Edo\" was initially in the museum's name, but this was later dropped. Executive director Phillip Ihenacho told the BBC the backers wanted the institution to serve a wider purpose beyond Nigeria.In its statement, Mowaa said the protest \"appeared to stem from disputes between the previous and current state administrations\".The museum emphasised it was an independent, non-profit organisation and, though a former state governor had backed the project, he had no interest in it \"financial or otherwise\".Mowaa has now cancelled all preview events leading up to the opening and advised visitors to avoid the campus until the situation is resolved.\"We are deeply grateful to all our guests - many of whom travelled long distances to be here - for their understanding, patience and resilience,\" the statement said. \"We sincerely apologise for any inconvenience this situation may have caused.\"You may also be interested in:Ghana, Nigeria and the quest for UK looted treasureBenin Bronzes declaration 'blindsides' museum officialsThe art dealer, the £10m Benin Bronze and the HolocaustGetty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nigeria's Mowaa museum: Edo protesters storm brand new home for West African art",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/504c/live/5bd53230-bd99-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-09T19:15:47.000Z",
      "dateModified": "2025-11-09T19:15:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Louvre heist: 'Fedora man' in viral picture revealed as local teenager",
    "url": "https://www.bbc.com/news/articles/c5ylx0g6w76o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cc4e/live/e48e8c60-bd86-11f0-8456-eff94716b162.png",
    "tag": "World",
    "date": "2025-11-09T22:09:39.000Z",
    "description": "In the three weeks since the Louvre museum heist, as investigators sought to find out who was behind it and why the French crown jewels had been so ea",
    "body": "In the three weeks since the Louvre museum heist, as investigators sought to find out who was behind it and why the French crown jewels had been so easy to steal, another mystery remained: who the \"fedora man\" was.The dapper youth in a hat was photographed outside the museum that Sunday and went viral on social media, prompting theories about his identity.Police moved swiftly to arrest and charge four people for the crime, while the Louvre director admitted CCTV security was inadequate.However, the fedora man remained an enigma - until now.The dandy, it turns out, is a local teenage fan of Sherlock Holmes and Hercule Poirot who just happened to be at a real crime scene.Pedro Elias Garzon Delvaux, a 15-year-old from Rambouillet, south-west of Paris told the Associated Press (AP) news agency that he had planned to visit the Louvre with his family but found the museum was closed. \"We didn't know there was a heist,\" he said.As he asked officers about the closure, an AP photographer seeking to capture the security cordon took a picture and included Pedro in the frame.Pedro only realised the photo had gone viral four days later, when a friend sent him a screenshot asking: \"Is that you?\"When he replied that it was, the friend said he had five million views on TikTok. \"I was a bit surprised,\" Pedro told the AP.He was even more shocked when his mother called to say the picture had appeared in The New York Times. It made a big impact on him, he said, because he reads that newspaper and \"it's not every day you're in the New York Times\". \"People said, 'You've become a star'. I was astonished that just with one photo you can become viral in a few days.\"Asked why he wore an old-fashioned waistcoat and a fedora to the museum, Pedro said he began dressing this way recently, inspired by 20th-century statesmen and fictional detectives.\"I like to be chic,\" he told the AP. \"I go to school like this.\"As wild speculation about the photo of him circulated online - some wondered whether he might be a real detective or an AI fake - Pedro remained silent for weeks.\"I didn't want to say immediately it was me,\" he said. \"With this photo there is a mystery, so you have to make it last.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Louvre heist: 'Fedora man' in viral picture revealed as local teenager",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cc4e/live/e48e8c60-bd86-11f0-8456-eff94716b162.png"
      ],
      "datePublished": "2025-11-09T22:09:39.000Z",
      "dateModified": "2025-11-09T22:09:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Iran faces unprecedented drought as water crisis hits Tehran",
    "url": "https://www.bbc.com/news/articles/cy4p2yzmem0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6a59/live/3564abe0-bdac-11f0-8456-eff94716b162.jpg",
    "tag": "World",
    "date": "2025-11-10T08:23:49.000Z",
    "description": "8 hours agoParham GhobadiBBC PersianEPAIran - especially its capital, Tehran - is facing an unprecedented drought this autumn, with rainfall at record",
    "body": "8 hours agoParham GhobadiBBC PersianEPAIran - especially its capital, Tehran - is facing an unprecedented drought this autumn, with rainfall at record lows and reservoirs nearly empty. Officials are pleading with citizens to conserve water as the crisis deepens.President Masoud Pezeshkian has warned that if there is not enough rainfall soon, Tehran's water supply could be rationed. But he said that even rationing might not be enough to prevent a disaster.\"If rationing doesn't work,\" Pezeshkian said, \"we may have to evacuate Tehran.\"His comments have prompted criticism in Iranian newspapers and on social media. Former Tehran mayor Gholamhossein Karbaschi called the idea \"a joke\" and said \"evacuating Tehran makes no sense at all\".Iran's meteorological officials say no rainfall is expected over the next 10 days.Meanwhile, the water crisis is already affecting daily life in the capital.\"I'm planning to buy water tankers to use for toilets and other necessities,\" a woman in Tehran told BBC Persian.In the summer, Iranian rapper Vafa Ahmadpoor posted a video on social media showing a kitchen tap with no running water.\"It's been four or five hours,\" he said. \"I've bought bottled water just to be able to go to the toilet.\"Dams nearly emptyThe manager of the Latian Dam, one of Tehran's main water sources, says it now holds less than 10% of its capacity. The nearby Karaj Dam — which supplies water to both Tehran and Alborz provinces — is in a similarly dire condition.\"I have never seen this dam so empty since I was born,\" an elderly local resident told Iranian state TV.According to Mohammad-Ali Moallem, the manager of the Karaj Dam, rainfall has plummeted dramatically.\"We had a 92% decrease in rain compared to last year,\" he said. \"We have only eight per cent water in our reservoir — and most of it is unusable and considered 'dead water.'\"Fears of water cutsThe government is now pinning its hopes on late autumn rain, but forecasts are bleak. Iran's Minister of Energy, Abbas Ali Abadi, has warned the situation could soon force authorities to cut water supplies.\"Some nights we might decrease the water flow to zero,\" he said.Officials have also announced plans to penalise households and businesses that consume excessive amounts of water.ABEDIN TAHERKENREH/EPA/ShutterstockThe government has warned that it may have to restrict water supplies if the weather remains dry Pipes, war damage - and a widening crisisIran's energy minister Ali Abadi has said Tehran's water crisis is not only due to a lack of rainfall. He blamed water leakage caused by the capital's century-old water infrastructure and even pointed to the recent 12-day war with Israel.During that conflict, Israel targeted the northern Tehran neighbourhood of Tajrish on 15 June. Afterwards videos showed heavy flooding in the area.The day after the strike, the Israel Defence Forces said it had targeted Iranian military \"command centres\".But the crisis extends far beyond the capital.The head of Iran's National Centre for Climate and Drought Crisis Management, Ahmad Vazifeh, has warned that, apart from Tehran, dams in many other provinces — including West Azerbaijan, East Azerbaijan and Markazi — are also in a \"worrying state\", with water levels in the single-digit percentages.In Mashhad, Iran's second-largest city, officials are sounding the alarm as well.The Governor of Khorasan Razavi Province in north-east Iran, said the water reserves in Mashhad's dams have dropped to \"less than eight percent,\" warning that the province faces a \"mega-challenge of drought.\"CEO of Mashhad's Water and Wastewater Company put the figure even lower.\"The storage level of the city's main dam is below three percent,\" Hossein Esmaeilian said.\"Only three percent of the combined capacity of Mashhad's four water-supplying dams — Torogh, Kardeh, Doosti, and Ardak — remains. Apart from Doosti Dam, the other three are out of operation.\"A crisis long foreseen Iran's water crisis has been decades in the making.Even Iran's Supreme Leader, Ayatollah Ali Khamenei, has repeatedly acknowledged the looming threat — speaking about water shortages in his Nowruz addresses in 2011 and on other occasions in the following years.Yet little has changed.Today, Tehran, Karaj and Mashhad — home to more than 16 million people combined — are facing the real possibility of their taps running dry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iran faces unprecedented drought as water crisis hits Tehran",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6a59/live/3564abe0-bdac-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-10T08:23:49.000Z",
      "dateModified": "2025-11-10T08:23:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Harshita Brella: Family ask why killer has not been caught 12 months on",
    "url": "https://www.bbc.com/news/articles/c993je80ermo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/78b7/live/8eb1c8a0-bbc6-11f0-b6c2-7f3ceed9a880.jpg",
    "tag": "World",
    "date": "2025-11-09T22:18:20.000Z",
    "description": "Harshita was murdered a year ago - so why has her killer not been caught, family ask18 hours agoYogita LimayeSouth Asia and Afghanistan correspondentF",
    "body": "Harshita was murdered a year ago - so why has her killer not been caught, family ask18 hours agoYogita LimayeSouth Asia and Afghanistan correspondentFamily handoutHarshita Brella's body was discovered in the boot of a car in London on 14 November last yearOne year since Harshita Brella was strangled to death in the UK, there is a sense of disbelief in her family home in the Indian capital Delhi.\"Why has her killer not been caught yet? Neither the UK government nor the Indian government are doing anything,\" Harshita's mother Sudesh Kumari says, sobbing into her scarf. \"I want justice for my daughter. Only then will I find peace.\"Harshita's body was found in the boot of a car in Ilford, east London, on 14 November 2024, a day after her family contacted UK police to say they had not heard from her since 10 November.Police believe Harshita, 24, was murdered on that day in Corby, Northamptonshire,  by her husband Pankaj Lamba, who fled to India soon after the killing and is still on the run.The couple, both Indian nationals, had moved from Delhi to the UK, settling in Corby, earlier that year.Northamptonshire PoliceA CCTV picture of the murder suspect Pankaj LambaIn March this year, police in Northamptonshire charged him with murder. He also faces charges of rape, sexual assault and controlling or coercive behaviour.Harshita's sister Sonia Dabas is frustrated with the pace of investigations.\"We are very disappointed with the UK police. Maybe because we are not citizens of the UK, that's why they are not serious about this case. They are sending out a message that foreign nationals are not safe in the UK,\" she told the BBC.Roughly two months before Harshita was killed, on 3 September, she had filed a case of domestic abuse against her husband. He was arrested and later released on bail on condition that he did not harass, pester or intimidate Harshita. The Domestic Violence Protection Order (DVPO) expired four weeks later, on 1 October.Sonia accuses Northamptonshire Police of being negligent in following up on the domestic abuse case. \"That's when Pankaj figured out that the UK police are not really serious about this case and he felt he could get away with murder,\" she says.Four officers of the Northamptonshire Police are being investigated over their handling of Harshita's domestic abuse report and their interaction with her, by the Independent Office for Police Conduct (IOPC).The IOPC told the BBC this week that their investigation was complete and had been shared with Northamptonshire Police. Northamptonshire Police say they have been given until mid-November to respond to the IOPC's findings.Northamptonshire Police said: \"This is an exceptionally complex case and with criminal proceedings now active in the UK, we are unable to go into detail about the investigation at this time. However, we can confirm that the Indian authorities have been made aware through the appropriate channels of the charging decision.\"The Indian government has told the BBC they are in touch with the UK government on the matter, but neither side answered clearly about whether an extradition notice for Pankaj Lamba had been forwarded to the Indian authorities.Ms Brella detailed the alleged abuse she suffered at the hands of her husband in a letterHarshita's family also told the BBC that they believe Pankaj Lamba is in India, being shielded by Indian police.\"He has relatives who are policemen. In March this year, he was seen on CCTV footage withdrawing money from a bank. Then how come he's not been found yet? This is all because of corruption,\" says Sonia. The family also says they have information that in the early months of this year, Pankaj was running a shop in Gurgaon, not far from where they live.\"They [the Delhi Police] are just killing time,\" Sonia says.The Delhi Police did not respond to Sonia's accusations. They told the BBC that they have acted on the basis of a dowry complaint filed by Harshita's parents against Mr Lamba and members of his family, including his parents and sister, who were arrested and are now out on bail. The Delhi Police also say they issued public notices earlier this year offering a reward for information about Mr Lamba, and the search for him is still under way.Harshita's mother Sudesh Kumari says she still cannot believe her daughter is gonePankaj Lamba's family home is in the village of Dharauli, about 40 miles (65km) north of Delhi, and not far from Gurgaon where Ms Brella's family believe he was sighted in March. His parents Sudesh and Darshan Lamba didn't want to be interviewed when the BBC visited. But they rejected all the charges against them and their son. They claim they have not had any contact with him since 10 November 2024 – the same day that Harshita's family last had contact with her.For Harshita's father, Satbir Singh Brella, the days are filled with visits to police stations and courts.\"My daughter was so straightforward, and kind hearted. A really terrible thing happened to her,\" he says.Her mother points to the shoes she's wearing. They're Harshita's and were among her possessions from the UK returned to her family by British officials who visited them in July.\"They are tight for me, but I feel close to her when I wear them,\" says Sudesh Kumari. \"Sometimes I feel she's still in the UK, I cannot believe she is gone.\"Additional reporting: Aakriti Thapar, Adnan Bhat, Sanjay Ganguly",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Harshita Brella: Family ask why killer has not been caught 12 months on",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/78b7/live/8eb1c8a0-bbc6-11f0-b6c2-7f3ceed9a880.jpg"
      ],
      "datePublished": "2025-11-09T22:18:20.000Z",
      "dateModified": "2025-11-09T22:18:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What Hungary's Viktor Orban did - and didn't - get from Trump",
    "url": "https://www.bbc.com/news/articles/ckg4r193152o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0bbb/live/173f2ff0-bca8-11f0-9886-b3acf9644cc5.jpg",
    "tag": "World",
    "date": "2025-11-08T16:14:42.000Z",
    "description": "2 days agoNick ThorpeBudapest, HungaryOn the surface, the Hungarian prime minister's trip was exactly what he went to Washington for: luxuriant praise",
    "body": "2 days agoNick ThorpeBudapest, HungaryOn the surface, the Hungarian prime minister's trip was exactly what he went to Washington for: luxuriant praise and an exemption from sanctions on Russian oil, gas and nuclear supplies.And all that just five months out from a difficult election.Look closer, however, and the picture is less clear cut. The US side struck a hard trade deal - and an expensive one for Hungary. And there's no progress on Viktor Orban's biggest headache: ending the war in neighbouring Ukraine, and with it the long shadow the conflict casts over Hungary.Let's look first at Orban's key win - an exemption from US sanctions, which a White House official told the BBC was time-limited to one year, although Péter Szijjártó, Hungary's foreign minister, said would be indefinite.The time span is interesting. Trump clearly wants to help his friend win the election in April. And the exemption even partially dovetails with the European Commission demand to all member states to end the import of Russian oil, gas and nuclear fuel by the end of 2027. What is missing, from an EU perspective, is any political commitment from Orban to meet that demand - a commitment made and fulfilled by the Czech government. And the EU is trying to tighten energy sanctions - to the fury of Hungary and Slovakia.Away from the media spotlight, the Hungarian energy company MOL has been upgrading two of its refineries - Százhalombatta in Hungary and the Slovnaft facility in Bratislava - to process Brent crude instead of the high-sulphur Urals crude which flows through Russian pipelines. On Friday, MOL said 80% of its oil needs could be imported through the Adria pipeline from Croatia, albeit with higher logistical costs and technical risks. So Orban's argument, which so impressed Trump, that Hungary, as a landlocked country, has no alternative to Russian oil may not strictly be true. Overall, Hungary and Slovakia have together paid Russia $13bn (£10bn) for its oil between its full-scale invasion of Ukraine in February 2022 and the end of 2024. The one-year window granted by the US is nevertheless a valuable respite for Hungarian households this winter. Orban told pro-government reporters who travelled with him to Washington that otherwise utility bills \"could have gone up by up to three times in December\". Capping those bills by various means has been a central plank of his popularity in Hungary since 2013. Under the US exemption, Hungary can also continue to buy Russian gas through the Turkstream pipeline, which traverses the Balkans, and pay for it in hard currency ($185m in August alone) using a Bulgarian loophole. Orban has agreed to buy LNG from the US worth $600 million, according to Bloomberg.Another key part of the Washington deal is nuclear. Hungary agreed to buy US nuclear fuel rods for its Paks 1 nuclear power station (at a cost of $114m), in parallel to those bought from Russia's Rosatom and France's Framatome.Russian plans to finance and build the nuclear extension, called Paks 2, have been long delayed by technical and licensing issues. The US agreement to lift all nuclear sanctions on Hungary may help restart that project, but thorny problems remain. Hungary has also agreed to buy US technology to extend the short-term storage of spent nuclear fuel at Paks for between $100m and $200m.Perhaps the biggest part of the deal was a Hungarian commitment to buy up to 10 small modular nuclear reactors from the US, for somewhere between $10bn and $20bn. Hungary needs electricity to power the huge Chinese battery plants being built around the country. Smaller nuclear plants are less plagued by building delays, and are easier to licence.Finally, a currency swap deal - similar to a recent US-Argentina deal to prop up the peso - under which US and Hungarian central banks can exchange currency is being discussed.This would mean that in a future financial crisis in Hungary, the US central bank could feed dollars to Budapest, which boosts financial security in Hungary.So in summary, Hungary struck a deal to buy US gas, nuclear energy and unspecified weapons systems in exchange for a temporary waiver from US sanctions on Russian oil and gas. But it failed to get the re-introduction of the US-Hungary dual taxation system, abolished in 2022, which harms mutual trade. And it did not get a new date for a potential Trump-Putin summit in Budapest as part of efforts to end the Russia-Ukraine war.Critics say energy dependence on Russia is being replaced by energy dependence on the US. The Orban government argues it is achieving greater diversity of supply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What Hungary's Viktor Orban did - and didn't - get from Trump",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0bbb/live/173f2ff0-bca8-11f0-9886-b3acf9644cc5.jpg"
      ],
      "datePublished": "2025-11-08T16:14:42.000Z",
      "dateModified": "2025-11-08T16:14:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Uganda President Yoweri Museveni admits Kenyan activists were arrested and held in 'the fridge'",
    "url": "https://www.bbc.com/news/articles/cn8v9vkkjm0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c3c8/live/7e1af730-bd5d-11f0-8456-eff94716b162.jpg",
    "tag": "World",
    "date": "2025-11-09T11:55:49.000Z",
    "description": "1 day agoTiffany Wertheimer and Damian ZaneEPANicholas Oyoo (L) and Bob Njagi (R) were greeted by supporters when they arrived back in Kenya's capital",
    "body": "1 day agoTiffany Wertheimer and Damian ZaneEPANicholas Oyoo (L) and Bob Njagi (R) were greeted by supporters when they arrived back in Kenya's capital, Nairobi, on SaturdayUgandan President Yoweri Museveni has for the first time acknowledged that two Kenyan activists who were missing in his country for five weeks had been arrested.Last month, eyewitnesses reported seeing Bob Njagi and Nicholas Oyoo being forced into a car by masked uniformed men after a political event where they were supporting Ugandan opposition leader Bobi Wine.News of their release was confirmed on Saturday but up to that point the authorities had denied that they were being detained.In a live interview on Saturday evening, Museveni described the two men as \"experts in riots\" who had then been put \"in the fridge for some days\".The president, who has been in power for almost four decades and is running for another term in office, was responding to a question about the recent deadly youth-led protests in neighbouring Tanzania.Museveni blamed foreign groups for stoking up trouble and said \"the ones who are doing that game here in Uganda will end up badly\".Without naming them, he added that the two Kenyan activists were released after he received calls from \"some Kenyan leaders\" who said they should be handed back. Mr Njagi and Mr Oyoo were welcomed by supporters at the main airport in Kenya's capital, Nairobi, on Saturday.\"Thirty-eight days of abduction was not easy. We didn't think that we were going to come out alive because we were being abducted by the military,\" Mr Njagi said. Kenya's Foreign Minister Musalia Mudavadi said their release followed \"sustained diplomatic engagement between Kenya and Uganda\".Activist organisation Vocal Africa, who had been campaigning for the two men to be freed said: \"Let this moment signal an important shift towards upholding the human rights of East Africans anywhere in East African Community\".In a joint statement, Vocal Africa, the Law Society of Kenya and Amnesty International thanked the Kenyan and Ugandan governments, as well as \"all active citizens\" who had campaigned for the release.Former pop star Bobi Wine, whose real name is Robert Kyagulanyi, is running against Museveni for the presidency in next year's elections.Bobi Wine accused the Ugandan government of targeting the two Kenyans for associating with him. \"If they committed any offence, why were they not produced before court and formally charged?\" he asked in a post on X on Sunday.Ugandan security agencies have often been accused of orchestrating the detention of opposition politicians and supporters while not in uniform. Some of those arrested have later resurfaced in court facing criminal charges.The latest disappearances mirror past incidents involving politicians and activists across the East African region.Last year, Njagi was picked up in Kenya by masked men during a wave of abductions believed to have been targeting government critics in the country.He surfaced a month later, after a court ordered police to produce him. He later recounted the harrowing conditions in captivity, where he said he was often isolated and denied food.Earlier this year, Kenyan activist Boniface Mwangi and his Ugandan counterpart Agather Atuhaire were detained in Tanzania and held incommunicado for days before being abandoned at their respective national borders.They later recounted being brutally mistreated, including sexual torture at the hands of the Tanzanian authorities – allegations which police dismissed as \"hearsay\".Last year, another Uganda opposition figure, Kizza Besigye, mysteriously disappeared in Nairobi only to surface four days later in a military court in Uganda, where he faces treason charges.The cases have since sparked widespread condemnation and concerns that East African governments could be collaborating to contain dissent.You may also be interested in:How a Ugandan opposition leader disappeared in Kenya and ended up in military court'We live in fear' - forced expulsions taint Kenya's safe haven imageUganda's Yoweri Museveni: How an ex-rebel has stayed in power for 35 yearsBobi Wine: Uganda's 'ghetto president'Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Uganda President Yoweri Museveni admits Kenyan activists were arrested and held in 'the fridge'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c3c8/live/7e1af730-bd5d-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-09T11:55:49.000Z",
      "dateModified": "2025-11-09T11:55:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]