[
  {
    "title": "Chiara Ferragni: Pandoro cake influencer cleared of aggravated fraud in Italy",
    "url": "https://www.bbc.com/news/articles/c5yvgz7geyvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/57a2/live/3ab75750-f15a-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-14T17:12:24.000Z",
    "description": "11 hours agoAlys DaviesAFPChiara Ferragni told reporters she was very happy her \"nightmare\" was overAn Italian fashion influencer has been acquitted o",
    "body": "11 hours agoAlys DaviesAFPChiara Ferragni told reporters she was very happy her \"nightmare\" was overAn Italian fashion influencer has been acquitted of aggravated fraud, bringing a long-running scandal involving a charity Christmas cake to an end.Chiara Ferragni had been accused of misleading consumers by promoting the sale of a designer pink pandoro as well as Easter eggs that were said to be helping to raise money for a children's hospital and a charity.After a fast-track trial in Milan, a judge found her and two other defendants not guilty. Had she been convicted, she could have faced a jail term.Ferragni, 38, told reporters the judgment marked \"the end of a nightmare that lasted two years\".The scandal - dubbed \"pandorogate\" - started with the sale of pink special edition Christmas cakes in 2022.Consumers were led to believe that sales of the pandoro would go towards raising funds for a children's hospital in Turin. But it turned out that the cake's producer, Balocco, had given a one-off €50,000 (£43,300) donation to the hospital before the cake's launch.Ferragni has 28 million followers on Instagram and, after her companies made €1m from the promotion, she pledged to donate the same sum to the hospital.The outcry led authorities to initiate a formal investigation and the influencer was handed a €1m fine in 2023 by Italy's competition authority over the pandoro cakes, branded with her name and mentioning the children's hospital.Ferragni-branded Easter eggs also became part of the scandal, leading the influencer to agree to pay €1.2m to a children's charity to settle complaints that the eggs' sales allegedly misled consumers.She was later indicted on the aggravated fraud charges, along with business associate Fabio Damato. Prosecutors had asked for a sentence of one year and eight months in prison for Ferragni but the judge rejected their accusation that the fraud should be seen as aggravated.The Milan court found that no aggravation had been involved as a consumer group had withdrawn its original complaint. Ferragni had agreed with consumer organisation Codacons that she would compensate consumers and donate money to a charity for women who had suffered gender violence.\"We are all moved,\" Ferragni told reporters at the end of the trial. \"The last two years have been very hard. I had faith in justice, and justice has been done.\"Despite her acquittal the scandal has proved damaging to Ferragni's brand and affected her personal life. Her marriage to Italian rapper Fedez fell apart last year.It has also led to tighter rules for Italian influencers to show greater transparency in their fund-raising initiatives.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chiara Ferragni: Pandoro cake influencer cleared of aggravated fraud in Italy",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/57a2/live/3ab75750-f15a-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-14T17:12:24.000Z",
      "dateModified": "2026-01-14T17:12:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Swiss regions ban pyrotechnics after Crans-Montana ski bar fire",
    "url": "https://www.bbc.com/news/articles/cgezqvwr54no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ab83/live/03b6e6e0-f163-11f0-b385-5f48925de19a.jpg",
    "tag": "World",
    "date": "2026-01-14T16:32:15.000Z",
    "description": "12 hours agoPaulin KolaEPAThe community in Crans-Montana remains in shock two weeks after the fireThe Swiss canton of Valais has banned pyrotechnic de",
    "body": "12 hours agoPaulin KolaEPAThe community in Crans-Montana remains in shock two weeks after the fireThe Swiss canton of Valais has banned pyrotechnic devices in all indoor public venues following the devastating fire at a bar on New Year's Eve where 40 people were killed and 116 were injured.Authorities said each of the victims would get a 10,000 franc ($12,500; £9,200) emergency payment, with a fund being set up to collect donations.The canton of Geneva also announced a ban on pyrotechnics in indoor venues - days after Vaud became the first of Switzerland's 26 regions to take such a decision.The blaze at Le Constellation bar in the ski resort of Crans-Montana is believed to have started when sparklers attached to champagne bottles set light to sound-insulating foam padding on the ceiling.EPA/ShutterstockJacques and Jessica Moretti, French owners of Le Constellation bar in Crans-Montana, say they are co-operating with the investigationAuthorities have acknowledged that the bar had not undergone safety checks for five years.The two co-owners of Le Constallation, French couple Jacques and Jessica Moretti, have been accused of manslaughter by negligence, bodily harm by negligence and arson by negligence.Jacques Moretti is being held in custody for an initial period of 90 days. His wife has had to surrender her passport and report to police every day.The news that the bar had not been inspected for five years has shocked families of the victims, most of whom were young - eight were under the age of 16.Many of the injured have severe burns. Eighty remain in hospitals in Switzerland and other European countries.One of the lawyers representing families of the victims said on Tuesday that an online platform had been launched to receive testimonies related to the disaster.\"This initiative aims to facilitate the investigation for the benefit of the victims,\" Romain Jordan said - not to replace the official investigation.Among those who have died was the waitress who was seen in a video wearing a helmet and holding a champagne bottle with a sparkler attached and the ceiling catching fire.Identified widely as Cyane Panine, 24, and from Sète in south-east France, she is said to have been close to the managers of the bar. Her family have issued a statement saying: \"Whatever the outcome of the investigation, this young woman followed her employers' instructions. She did what the general manager asked her to do. Nothing unusual. This young employee is in no way responsible.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Swiss regions ban pyrotechnics after Crans-Montana ski bar fire",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ab83/live/03b6e6e0-f163-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-14T16:32:15.000Z",
      "dateModified": "2026-01-14T16:32:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "FBI searches home of Washington Post reporter in classified documents probe",
    "url": "https://www.bbc.com/news/articles/cvgp19zx3vjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e3af/live/ba4b2be0-f17d-11f0-afcf-4f8c8e73dd06.jpg",
    "tag": "World",
    "date": "2026-01-14T17:44:49.000Z",
    "description": "Agents with the US Federal Bureau of Investigation (FBI) raided the home of a Washington Post reporter this week as part of an investigation into a go",
    "body": "Agents with the US Federal Bureau of Investigation (FBI) raided the home of a Washington Post reporter this week as part of an investigation into a government contractor accused of leaking classified information, officials said. In a post on X, US Attorney General Pam Bondi said agents had searched the home of a journalist who allegedly \"was obtaining and reporting classified and illegally leaked information from a Pentagon contractor\". Bondi said the contractor had been arrested. The Washington Post identified the reporter to the BBC as Hannah Natanson, who has covered how President Donald Trump's administration has drastically reduced and reshaped the federal workforce. Natanson was at her home in Virginia on Wednesday when federal agents came to search her home, according to the Washington Post. They took her phone, a work and personal computer and a Garmin watch, the outlet said. Natanson was told she was not the focus of the probe, according to the Washington Post, which reported that officials were investigating Aurelio Perez-Lugones, a system administrator in Maryland with top-secret security clearance. According to an FBI affidavit, Perez-Lugones -  a systems engineer and information technology specialist on contract for the government since 2002 - accessed and printed classified intelligence reports. Officials said they found classified information in a lunch box while searching Perez-Lugones' car, according to court filings. The filing does not mention Perez-Lugones disseminating the information. The court filings say Perez-Lugones has been charged with unlawful retention of national defence information. He is scheduled to appear in court on Thursday. Bondi said the Trump administration would \"not tolerate illegal leaks of classified information that, when reported, pose a grave risk to our Nation's national security and the brave men and women who are serving our country\".The search of Natanson's home sparked concerns from press freedom and free speech advocates. \"Any search targeting a journalist warrants intense scrutiny because these kinds of searches can deter and impede reporting that is vital to our democracy,\" Jameel Jaffer, the executive director of the Knight First Amendment Institute, said in a statement. Natanson previously wrote about her experience gathering more than 1,000 sources who currently and formerly worked for the federal government, as she reported on the layoffs, buyouts and firings that Trump has used since returning to office to shrink the federal workforce and change the focus of many agencies.Natanson wrote about sources inside government agencies sharing information they \"weren't supposed to tell me\" and the intensity of receiving sensitive information from so many people. In April, Bondi ended Biden-era policies that had protected journalists from having their phone records seized or being forced to testify in leak probes. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "FBI searches home of Washington Post reporter in classified documents probe",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e3af/live/ba4b2be0-f17d-11f0-afcf-4f8c8e73dd06.jpg"
      ],
      "datePublished": "2026-01-14T17:44:49.000Z",
      "dateModified": "2026-01-14T17:44:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Russian doctors arrested over 9 babies die in maternity hospital",
    "url": "https://www.bbc.com/news/articles/cx2wle7028ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c15a/live/044c8510-f140-11f0-bd56-9b1dc8f84e89.jpg",
    "tag": "World",
    "date": "2026-01-14T12:20:47.000Z",
    "description": "Two senior doctors have been arrested in Russia following the deaths of nine babies in a maternity hospital in Siberia this month.The newborns died du",
    "body": "Two senior doctors have been arrested in Russia following the deaths of nine babies in a maternity hospital in Siberia this month.The newborns died during the long New Year holiday in Novokuznetsk, Russia's main investigative authority said in a statement.No reason for the babies' deaths has been given.The case has caused anger around Russia.All the babies were born in the Novokuznetsk Maternity Hospital No.1 from 1-12 January, with the first death on 4 January, Russia's Investigative Committee spokeswoman Svetlana Petrenko said. Without giving details, the committee said the chief physician and the head of the intensive care unit had been detained for the \"improper performance of their official and professional duties in organising and providing medical care\".It said the suspects were co-operating with the investigation and authorities were deciding on charges as well as pre-trial detention.The committee released a video showing one man being escorted away and a man signing some papers in the presence of a uniformed officer. Victims and witnesses had been questioned and materials seized as work continued to gather more evidence, it added.Nine post-mortem examinations were being carried out.The Interfax news agency said the Kemerovo Region Ministry of Health which was also investigating said the infants had had a severe intra-uterine infection. The hospital has announced that it is no longer accepting patients due to a higher-than-usual rate of respiratory infections.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Russian doctors arrested over 9 babies die in maternity hospital",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c15a/live/044c8510-f140-11f0-bd56-9b1dc8f84e89.jpg"
      ],
      "datePublished": "2026-01-14T12:20:47.000Z",
      "dateModified": "2026-01-14T12:20:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zelensky declares state of emergency in Ukraine's energy sector",
    "url": "https://www.bbc.com/news/articles/cq6vm677z76o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1cac/live/df127f20-f1a3-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "World",
    "date": "2026-01-15T03:35:12.000Z",
    "description": "Ukraine has declared a state of emergency in the country's energy sector, with a particular focus on Kyiv, as ongoing Russian strikes continue to leav",
    "body": "Ukraine has declared a state of emergency in the country's energy sector, with a particular focus on Kyiv, as ongoing Russian strikes continue to leave thousands of residents without power. President Volodymyr Zelensky accused Moscow of deliberately exploiting the harsh winter conditions as part of its war strategy, with overnight temperatures in Kyiv recently dropping to around -20C.The declaration comes as Zelensky's US counterpart Donald Trump said he was holding up efforts to secure a peace deal to end nearly four years of war with Russia.He told the Reuters news agency on Wednesday that Ukraine \"is less ready to make a deal\" than Russian president Vladimir Putin. When asked why peace talks have not yet resolved the conflict, Trump responded: \"Zelensky\".The two leaders are both expected to attend the World Economic Forum in Switzerland next week, although Trump suggested no formal plans were arranged for them to meet. In recent weeks, Russian attacks on Kyiv have left thousands of homes without regular power, heating or running water. After one particularly heavy night of missile and drone attacks last week, 70% of the capital was left without power for several hours.Following a special cabinet meeting on Wednesday, Zelensky said a round-the-clock task force would be set up to fix damage caused by Russian strikes and worsening weather conditions. He said the new measures would include procuring vital energy equipment and resources from abroad to replace damaged installations. \"The First Deputy Prime Minister – Minister of Energy of Ukraine has been assigned to oversee work supporting people and communities under these conditions,\" he wrote on X.He also ordered an increase in the number of emergency help points around Kyiv to provide heat and power for residents, a move which could see a relaxing of current midnight curfew in the capital.Russian attacks on energy infrastructure have not been limited to the capital.Last week, Ukrainian officials said that more than one million people in south-eastern Ukraine spent hours without heating and water supplies as a result of Russian air strikes. DTEK, Ukraine's biggest private energy provider, is living in permanent crisis mode because of Russian attacks on the grid, its CEO, Maxim Timchenko, told the BBC last month.As the fourth anniversary of Russia's full-scale invasion approaches, Timchenko said Russia had repeatedly targeted DTEK's energy grid with \"waves of drones, cruise and ballistic missiles\" and the company had found it difficult to cope.He added that the intensity of strikes had been so frequent \"we just don't have time to recover\".DTEK currently provides power for 5.6 million Ukrainians.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zelensky declares state of emergency in Ukraine's energy sector",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1cac/live/df127f20-f1a3-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-15T03:35:12.000Z",
      "dateModified": "2026-01-15T03:35:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South Korea: How a chewy cookie inspired by Dubai chocolate has taken over the nation",
    "url": "https://www.bbc.com/news/articles/c07xdv0mggzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8392/live/3b2e5450-f113-11f0-93fb-1f3e3600558d.jpg",
    "tag": "World",
    "date": "2026-01-14T06:41:03.000Z",
    "description": "You must have heard of Dubai chocolate: the sticky, indulgent confectionary filled with pistachio cream, tahini and shreds of knafeh pastry, which has",
    "body": "You must have heard of Dubai chocolate: the sticky, indulgent confectionary filled with pistachio cream, tahini and shreds of knafeh pastry, which has become a global sensation.Now the decadent bar has inspired South Korea's latest dessert craze. The Dubai chewy cookie has been selling like wildfire - and even restaurants that don't usually offer baked goods are trying to get a nibble of the market.Despite its name, the cookie's texture more closely resembles a rice cake, and is made by stuffing pistachio cream and knafeh shreds into a chocolate marshmallow.Shops are selling hundreds of cookies within minutes and the frenzy has sent prices of key ingredients surging, local media reported.This South Korean twist on the viral Dubai dessert first took off last September, after Jang Won-young from the girl band Ive posted a photograph of the chewy cookie on Instagram.While they currently sell for between 5,000 ($3; £2.5) and 10,000 won, prices are expected to climb due to strong demand. And apart from dessert shops and bakeries, other restaurants - from sushi bars to cold-noodle shops - are now offering the dessert. Local convenience store chain CU launched its Dubai chewy rice cake in October, and has sold some 1.8 million pieces of it in the last few months. \"Our manufacturing plant's production capacity cannot keep up with demand,\" a company representative told Yonhap News.So obsessed are the South Koreans with the cookie that someone even created a map that tracks shops selling the dessert, as well as their stock levels, in real time. Some stores have started imposing limits on how many cookies each customer can buy. The trend has also sparked online chatter among gig workers on whether hardware stores and cleaning companies should also start cashing in on Dubai chewy cookies, The Korea Herald reported.Such demand has driven up the price of pistachios, with local media reporting that a major supermarket chain has raised prices by 20% this year.Counterfeits have also emerged, spurring some consumers to call them out in their online reviews. \"I bought two for 11,000 Korean won, but there's no knafeh, and the exterior isn't marshmallow. It's heartbreaking,\" wrote one, in a review quoted by The Chosun Daily.Several food critics say the Dubai chewy cookies have taken off in South Korea because of how thick and dense they are.\"It reflects Korean food culture, where visual overwhelmingness matters more than balance or harmony of ingredients and flavours,\" food critic Lee Yong-jae told The Chosun Daily. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South Korea: How a chewy cookie inspired by Dubai chocolate has taken over the nation",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8392/live/3b2e5450-f113-11f0-93fb-1f3e3600558d.jpg"
      ],
      "datePublished": "2026-01-14T06:41:03.000Z",
      "dateModified": "2026-01-14T06:41:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "White House defends Trump over middle-finger gesture at heckler",
    "url": "https://www.bbc.com/news/articles/c62w8exgw1zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4fd2/live/09c26c60-f15b-11f0-9fdd-27d7df3706fc.jpg",
    "tag": "World",
    "date": "2026-01-14T20:14:41.000Z",
    "description": "'Appropriate and unambiguous': White House defends Trump over middle-finger gesture at hecklerThe White House has defended US President Donald Trump a",
    "body": "'Appropriate and unambiguous': White House defends Trump over middle-finger gesture at hecklerThe White House has defended US President Donald Trump after he aimed an offensive gesture at a heckler during his appearance at the Ford factory in Detroit on Tuesday.Footage of the incident published by TMZ appears to show Trump responding to a man who shouted at him from afar.The White House said: \"A lunatic was wildly screaming expletives in a complete fit of rage, and the President gave an appropriate and unambiguous response.\"The heckler has been suspended by Ford, the United Auto Workers union told the BBC's US partner, CBS News. Within 24 hours of the incident, two separate GoFundMe pages have raised nearly $700,000 (£521,000) for him from more than 27,000 donors. A Ford spokesperson told CBS: \"One of our core values is respect and we don't condone anyone saying anything inappropriate like that within our facilities. \"When that happens, we have a process to deal with it but we don't get into specific personnel matters.\"According to the subtitles provided by TMZ, the heckler called Trump a \"paedophile protector\". In the clip, which shows Trump from a distance, the president can be seen speaking back at the heckler, allegedly mouthing an expletive as well as using a middle-finger gesture.  A man who spoke to The Washington Post, named TJ Sabula, identified himself as the man who shouted. He said he had \"no regrets\" about what he did. Sabula reportedly said he his remarks referred to Trump's handling of the Epstein files. Trump has faced pressure for more transparency on what was uncovered by federal investigations into Jeffrey Epstein, the late convicted sex offender.Trump signed a law that compelled the Department of Justice (DoJ) to release all the files that it held on Epstein by 19 December, although only a fraction of the files have so far been made public.Trump was once friends with Epstein before they fell out, which Trump says was years before Epstein was first arrested. Trump has not been accused of any wrongdoing in connection with Epstein.United Automotive Workers (UAW), the union that represents Sabula, defended his actions, saying: \"He believes in freedom of speech, a principle we wholeheartedly embrace, and we stand with our membership in protecting their voice on the job.\"Trump was in Detroit on Tuesday to give a speech to the Detroit Economic Club. The president's public use of expletives have attracted headlines in the past - for example, when discussing the relationship between Iran and Israel last June.His predecessor Joe Biden also caused controversy for uttering an expletive during a conversation with a worker during his own visit to a factory in Detroit while on the campaign trail in 2020, before he was elected president. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "White House defends Trump over middle-finger gesture at heckler",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4fd2/live/09c26c60-f15b-11f0-9fdd-27d7df3706fc.jpg"
      ],
      "datePublished": "2026-01-14T20:14:41.000Z",
      "dateModified": "2026-01-14T20:14:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "LA 2028 Olympics open ticket raffle - with seats starting at $28",
    "url": "https://www.bbc.com/news/articles/c5y47pyp906o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f47f/live/37bbe250-f0f1-11f0-b73e-bb27305d3b96.jpg",
    "tag": "World",
    "date": "2026-01-14T15:30:09.000Z",
    "description": "13 hours agoRegan MorrisandChristal Hayes,Los AngelesSport fans can now sign up for a chance to attend the Los Angeles 2028 Olympic Games - with ticke",
    "body": "13 hours agoRegan MorrisandChristal Hayes,Los AngelesSport fans can now sign up for a chance to attend the Los Angeles 2028 Olympic Games - with tickets starting at $28 (£21).Registration has opened for fans to enter a random ticket draw covering all events that will take place at the Games. The window will remain open until mid-March. If chosen, fans will be notified via email and will be given a time slot to purchase tickets in April. One million of those tickets will sell for $28, and about one-third are set to cost less than $100 (£74.41).\"These Games belong to everyone,\" Casey Wasserman, the chairman of LA 2028 said on Tuesday. \"These Games have to be affordable and inclusive.\"The announcement of affordable ticket prices come after the price of tickets for the 2026 men's football World Cup - which will also be hosted in the US, as well as Canada and Mexico - received some public criticism. Speaking to reporters on Tuesday, LA officials said affordability and accessibility were central to their ticketing plan - and their hope that sport fans around the globe would be able to attend. Tickets for the 2024 Olympics in Paris started at $27.95 (£21).A special early purchase window will also be open for residents in the Los Angeles area and Oklahoma City, where some Olympic Games are also being held.2028 will be the first time the Olympics will be held in the US since the 1996 Games in Atlanta. Los Angeles has twice hosted the Olympics - in 1932 and 1984 - and plans to use its already established infrastructure to host the Games. Event organisers, along with hundreds of Olympians and Paralympians, gathered at the LA Memorial Coliseum on Tuesday for a ceremonial lighting of the Olympic venue's cauldron ahead of the opening of ticket registration. The Coliseum hosted events on both the previous occasions that the Olympics were held in LA, and it is set to co-host the opening ceremony along with track and field events in 2028. Organisers at the event on Tuesday explained how the ticketing would work. Once registered - using their name, email and zip code - fans will be entered into the random draw for time slots to buy tickets in April. The earlier slot a fan is given, the better their chances at securing tickets - as being given a time slot does not guarantee that there will be tickets available once a time slot is open.The first set of tickets will be up for purchase from 9-19 April. Admission for the opening and closing ceremonies of the Games will be among the tickets on offer.Most of the Games will be held across Los Angeles and southern California, but both canoeing and softball will be held in Oklahoma. LA28 chief Allison Katz-Mayfield called the random ticket-drawing process \"the fairest way to ensure that the broadest number of people can get access to tickets and that no one is advantaged or disadvantaged\". \"No matter when you go in, whether you're the first person in or the last person in, you have the same opportunity,\" she added.Registration for tickets will be open until 18 March, and there is no advantage to registering early.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "LA 2028 Olympics open ticket raffle - with seats starting at $28",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f47f/live/37bbe250-f0f1-11f0-b73e-bb27305d3b96.jpg"
      ],
      "datePublished": "2026-01-14T15:30:09.000Z",
      "dateModified": "2026-01-14T15:30:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "K-pop drum duet caps off Japan and South Korea's diplomatic meeting",
    "url": "https://www.bbc.com/news/articles/c0lx49z8ly6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6beb/live/e7aa9040-f109-11f0-802d-f33b724b1ca5.jpg",
    "tag": "World",
    "date": "2026-01-14T06:57:06.000Z",
    "description": "22 hours agoKoh EweandJake Kwon,Seoul correspondentA surreal drum duet between two East Asian world leaders has set the internet abuzz - and put a spo",
    "body": "22 hours agoKoh EweandJake Kwon,Seoul correspondentA surreal drum duet between two East Asian world leaders has set the internet abuzz - and put a spotlight on Japan and South Korea's diplomatic relationship.Decked out in matching blue jackets, South Korean President Lee Jae Myung and Japan's Prime Minister Sanae Takaichi on Tuesday played drums to the beats of K-pop hits - including Dynamite by BTS and Golden from hit film KPop Demon Hunters.The performance, a nod to Takaichi's past life as a drummer in a heavy metal band, wrapped up Lee's official visit to Japan this week.It's also part of Lee's diplomatic overtures to regional powers including Japan, with whom South Korea has a fraught history but shares a security alliance.The drumming session from Tuesday, which Lee described as \"a little clumsy\", has now spawned a viral video.During Lee's visit to Nara, Takaichi's hometown, he gifted the Japanese prime minister a drum set. The two leaders also exchanged signed drumsticks after their performance.\"When we met at APEC last year, [Lee] said it was his dream to play the drums, so we prepared a surprise,\" Takaichi later wrote on X.Footage of the jam session has won praise on social media.\"Music seems to have the power to connect hearts at a deeper level than words ever could,\" one X user wrote in Korean. \"Exchanges like this may be quiet, but they will surely help move relations between Korea and Japan forward.\"There have long been sore spots between the two neighbours, including historical grievances from Japan's colonial rule and territorial disputes.But both countries are allies of the US, and have worked together to counter China's increasing assertiveness in the region.On Tuesday, Takaichi said in a statement that cooperation between Japan, South Korea and the US has become increasingly important amid heightened tensions in the region's \"strategic environment\".Lee and Takaichi have also agreed to boost economic cooperation - a pledge that comes as China has been tightening its export of rare earths and dual-use goods to Japan.\"Just seeing them actually playing drums together - not just posing - looks like they are having so much fun, and that's what matters most,\" an X user wrote in Japanese. \"Both Korea and Japan are facing tough situations, but if we can meet each other halfway, I truly believe things will move in a positive direction.\"Lee's smoothness as a diplomat has boosted his approval ratings back home.Days before his viral jam session with Takaichi, he met Chinese President Xi Jinping in Beijing, with whom he took selfies on a Chinese smartphone.Last October, he flattered US President Donald Trump with a large golden crown. The only leader he hasn't been able to charm is North Korea's Kim Jong Un. Pyongyang has rejected Lee's overtures for peace and shown little interest in reconciliation. This week, Pyongyang demanded an apology from Seoul after accusing it of flying surveillance drones in its territory.Lee's rise to become president of South Korea had previously sounded alarm bells in Tokyo and Washington. Relatively unknown outside his own country at the time, Lee had a reputation as a firebrand who was sympathetic to socialist economic causes. The US feared South Korea would tilt towards China, South Korea's largest trading partner.Japan, meanwhile, feared a repeat of a spat in 2019, when South Korea threatened to pull out of an intelligence-sharing agreement after Japan tightened its exports to the country.That fight broke out after a South Korean court ordered Japanese companies to compensate the survivors of Japan's wartime forced labour, an issue Japan now considers resolved.Since taking office, however, Lee has walked a diplomatic tightrope among the region's major powers, from the US to China and now Japan.Lee heaped praise on Takaichi's drumming skills in a post on X, and likened their diplomatic efforts to the musical duet.\"Even if our timing was slightly different, our intention to find the same rhythm was shared,\" he wrote. \"In that same spirit, we will continue to build a future-oriented Korea–Japan relationship together, with one heart.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "K-pop drum duet caps off Japan and South Korea's diplomatic meeting",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6beb/live/e7aa9040-f109-11f0-802d-f33b724b1ca5.jpg"
      ],
      "datePublished": "2026-01-14T06:57:06.000Z",
      "dateModified": "2026-01-14T06:57:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US and UK pulling some personnel from Qatar military base",
    "url": "https://www.bbc.com/news/articles/c701xywwxw8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/06b4/live/d44d2ca0-f15f-11f0-bfbc-db36ba7a9ce1.jpg",
    "tag": "World",
    "date": "2026-01-15T01:31:46.000Z",
    "description": "3 hours agoTinshui YeungTSGT Scott Reed, USAFAl-Udeid is the largest US military base in the Middle EastThe US and UK are reducing the number of perso",
    "body": "3 hours agoTinshui YeungTSGT Scott Reed, USAFAl-Udeid is the largest US military base in the Middle EastThe US and UK are reducing the number of personnel at the Al-Udeid air base in Qatar, as US President Donald Trump considers whether to take action against Iran over its crackdown on anti-government protests. Officials have told CBS, the BBC's US partner, that the partial American withdrawal was a \"precautionary measure\". The BBC understands some UK military personnel are also being removed. A Qatari government statement said the measures reportedly being taken by the US were \"in response to the current regional tensions\".The Foreign Office has also temporarily closed the British embassy in Tehran, which will now operate remotely, a government spokesperson said.The US embassy in Doha has advised its personnel to exercise increased caution and limit non-essential travel to the Al-Udeid air base.Iran closed its airspace from 02:45 local time (22:15 GMT) on Thursday to almost all flights, according to the US Federal Aviation Administration's website.The closure was initially due to last two hours, but was later extended to 08:00 local time (03:30 GMT), according to the Reuters news agency.Several airlines have announced they will reroute flights around Iran in response, including Air India and Germany's Lufthansa.Air India warned that passengers could experience delays or cancellations as flights through the region were rerouted. Lufthansa issued a statement confirming its flights would avoid Iranian and Iraqi airspace \"until further notice\".According to rights groups, more than 2,400 anti-government demonstrators have been killed in the recent violent crackdown by the Iranian authorities.Regarding the removal of military personnel, the Qatari government said it would continue to \"implement all necessary measures to safeguard the security and safety of its citizens and residents as a top priority, including actions related to the protection of critical infrastructure and military facilities\".A UK Ministry of Defence spokesperson declined to comment on reports that UK personnel were being withdrawn \"due to operational security\".Al-Udeid is the largest US military base in the Middle East and about 10,000 personnel are based there, as well as about 100 UK staff. It is not clear how many will be leaving.Earlier this week, Trump warned the US would take \"very strong action\" against Iran if the authorities execute protesters. Iran has said it will retaliate if attacked by the US.On Wednesday, he said his administration had been told \"on good authority\" that \"the killing in Iran is stopping, and there's no plan for executions\". When questioned by a reporter, Trump said that these were \"very important sources on the other side\" and that he hoped the reports were true. The US president was also asked whether military action was now off the table, to which he replied: \"We're going to watch and see what the process is.\"The Reuters news agency, citing diplomats, reported that while some personnel had been told to leave the Al-Udeid air base, there was no immediate sign of large numbers of troops being bussed out like in the hours before an Iranian strike last year.Speaking to Fox News on Wednesday, Iran's Foreign Minister Abbas Araghchi warned Donald Trump to \"not repeat the same mistake that you did in June,\" adding: \"You know, if you try a failed experience, you will get the same result.\"He also responded to reports of a 26-year-old man whose family say he had been sentenced to death in Iran, saying that \"hanging is out of the question\" and there would be \"no hanging today or tomorrow\".As well as the temporary closure of the British embassy in Tehran, the US Mission to Saudi Arabia has advised its personnel and citizens to \"exercise increased caution and limit non-essential travel to any military installations in the region\".Italy and Poland have published statements urging their citizens to leave Iran, while Germany has issued a notice to air operators recommending that flights do not enter Tehran, citing potential risk from \"escalating conflict and anti-aviation weaponry\".Iran's government has accused the US of seeking to \"manufacture a pretext for military intervention\", with the parliament speaker warning that if the US attacked, both Israeli and US military and shipping centres in the region would become legitimate targets.The latest protests in Iran began at the end of December following the collapse of the currency and as the country deals with soaring living costs. They quickly widened into demands for political change and became one of the most serious challenges to the clerical establishment since the 1979 Islamic revolution.The US-based Human Rights Activists News Agency (HRANA) said it had so far confirmed the killing of 2,403 protesters, as well as 12 children, despite an internet blackout. More than 18,434 protesters have been arrested during the unrest, the group also reported.Amnesty International said there were \"mass unlawful killings committed on an unprecedented scale\", citing \"verified videos and credible information from eyewitnesses in Iran\".The organisation urged UN member states to recognise the \"crimes committed by security forces\" in the protests.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US and UK pulling some personnel from Qatar military base",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/06b4/live/d44d2ca0-f15f-11f0-bfbc-db36ba7a9ce1.jpg"
      ],
      "datePublished": "2026-01-15T01:31:46.000Z",
      "dateModified": "2026-01-15T01:31:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Uganda election 2026: Poll chief says he has been threatened over results declaration",
    "url": "https://www.bbc.com/news/articles/c62vd7542rno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a5ef/live/4b96a450-f140-11f0-bd56-9b1dc8f84e89.jpg",
    "tag": "World",
    "date": "2026-01-14T18:18:46.000Z",
    "description": "10 hours agoSammy AwamiBBC Africa, KampalaThe head of Uganda's electoral body says he has received threats warning him against declaring certain presi",
    "body": "10 hours agoSammy AwamiBBC Africa, KampalaThe head of Uganda's electoral body says he has received threats warning him against declaring certain presidential candidates the winners of Thursday's election.Simon Byabakama said he would not be intimidated by such threats from senior state officials, whom he did not name.He was responding to a BBC question about a widely shared video which shows a presidential assistant saying the electoral commission would never declare opposition candidate Robert Kyagulanyi, popularly known as Bobi Wine, as president, even if he were to win.\"Some people say if you don't declare so-and-so as president, you will see. I tell them that I am not in the business of donating votes,\" said Byabakama. President Yoweri Museveni, 81, who has ruled the country for nearly four decades, is seeking a seventh term in office.Bobi Wine, a 43-year-old pop star turned politician, is Museveni's main challenger, seeking to unseat him for the second time after finishing runner-up in 2021 polls.Six other candidates are also in the race, in which about 21.6 million voters are registered to vote.Campaigning has been marked by the disruption of opposition activities, including the detention of activists and the breaking-up of rallies by police.At the Electoral Commission headquarters in the capital, Kampala, Byabakama said he was not worried about threats from what he called \"idle people\".  \"You can see from my demeanour that fear is a word that does not exist in my vocabulary,\" said  the poll chief, adding that only the will of voters and the law would guide the process.In the video shared by the Daily Monitor newspaper on social media last week, Yiga Kisakyamukama, the special presidential assistant for service delivery and monitoring, was captured saying Museveni would never leave power through the ballot. \"Don't expect, don't even think, that Simon Byabakama would announce Bobi Wine. President Museveni, who is on the chair, will remain on the chair. Never think that Museveni would leave power through voting. No, no, no - don't waste our time,\" Kisakyamukama was heard saying. But Byabakama said Uganda's law, not individual opinions or threats, would determine the outcome of the presidential election.\"The law says that the candidate who receives more than 50% plus one of the total valid votes cast is the president of Uganda. It is the voters who determine how many votes a candidate gets. What the voters have said is what I will declare to the nation,\" he added. The poll chief said he would declare the results within 48 hours of the close of polling, in accordance with the country's laws. Responding to concerns about the heavy military presence in the streets, Byabakama said security forces were deployed to maintain peace and stability during the electoral process and should not intimidate voters. He also acknowledged opposition concerns about some polling stations being located within military premises, saying the commission was investigating the reports.\"If we find that it is true, we shall take the necessary measures to address it,\" he added.On Tuesday, the authorities cut internet access and limited mobile services across the country in order to curb \"misinformation, disinformation, electoral fraud and related risks\". The network outage has heightened concerns about repression in the run-up to the  vote, and has been described by the UN human rights office as \"deeply worrying\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Uganda election 2026: Poll chief says he has been threatened over results declaration",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a5ef/live/4b96a450-f140-11f0-bd56-9b1dc8f84e89.jpg"
      ],
      "datePublished": "2026-01-14T18:18:46.000Z",
      "dateModified": "2026-01-14T18:18:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump vows 'very strong action' if Iran executes protesters",
    "url": "https://www.bbc.com/news/videos/c4g0d892p7go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5436/live/ffbc4d60-f125-11f0-b385-5f48925de19a.jpg",
    "tag": "World",
    "date": "2026-01-14T09:00:19.000Z",
    "description": "US President Donald Trump says he'll take \"very strong action\" if Iran executes protesters.It comes as relatives of 26-year-old Erfan Soltani, who was",
    "body": "US President Donald Trump says he'll take \"very strong action\" if Iran executes protesters.It comes as relatives of 26-year-old Erfan Soltani, who was detained last week, told BBC Persian he is due to be executed on Wednesday.In an interview with the BBC's US partner CBS, Trump said \"we don't want to see what's happening in Iran happen.\"Follow live coverage here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump vows 'very strong action' if Iran executes protesters",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5436/live/ffbc4d60-f125-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-14T09:00:19.000Z",
      "dateModified": "2026-01-14T09:00:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Yennayer: North Africa's Amazigh people ring in the year 2976",
    "url": "https://www.bbc.com/news/articles/cj0nm44g361o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/32fe/live/3c269770-f099-11f0-b385-5f48925de19a.jpg",
    "tag": "World",
    "date": "2026-01-14T00:37:02.000Z",
    "description": "1 day agoWedaeli ChibelushiAPP/NurPhoto via Getty ImagesAcross North Africa, the Amazigh people have been coming together to usher in the year 2976.Th",
    "body": "1 day agoWedaeli ChibelushiAPP/NurPhoto via Getty ImagesAcross North Africa, the Amazigh people have been coming together to usher in the year 2976.They have, unfortunately, not cracked time travel. Rather, they are almost a thousand years ahead of much of the world because they follow a calendar that starts at 950 BC, when King Sheshonq ascended the throne of Egypt.The Amazigh new year, known as Yennayer, begins between 12 and 14 January - depending on the area in which they live in Algeria, Morocco, Tunisia and Libya - so over the last few days families have been laying on huge feasts, lighting bonfires and playing traditional music. Calls of \"aseggas ameggaz\", or happy new year, have been ringing through villages and busy city streets, while vibrant, meticulously embroidered traditional clothing has been donned for the occasion.APP/NurPhoto via Getty ImagesAmazigh culture and language has gained greater recognition over the past decadeThe Amazigh (which means \"free people\" or \"noble people\") are a range of ethnic groups that are North Africa's original inhabitants, having occupied the region since the beginning of recorded history.The exact size of the population is not known because of a dearth of official statistics, but according to estimates there are tens of millions of Amazigh people living across North Africa. Algeria and Morocco have the biggest populations - the latter is thought to be 40% Amazigh.Yennayer centres on family gatherings, celebrating renewal and the deep connection the Amazigh people have traditionally had with nature.APP/NurPhoto via Getty ImagesThese days Yennayer is marked with parades, concerts and carnivalsBecause the Amazigh are a diverse group, traditional Yennayer food differs from country to country and area to area. In Morocco's High Atlas region, \"ourkemen\", a rich mixture of legumes, spices and whole grains, is a new year's favourite.Many families in Algeria enjoy \"trèze\", a combination of sweets, dried fruit and nuts, after the main meal. The snack mix is sometimes gently thrown over the youngest child in a symbol of prosperity.But Yennayer is not just a family thing. It can also be celebrated with the wider community - parades, concerts and carnivals take the new year's spirit out on to the streets.Such proud displays of Amazigh culture are particularly significant as the community has a long history of being marginalised.APP/NurPhoto via Getty ImagesFood, including couscous, is an important aspect of the new year celebrationsIn the 7th Century, as Arab conquerors swept across North Africa, they brought with them their language and the Islamic religion.Both of these were adopted officially, at the expense of Amazigh languages and culture.For instance, during Colonel Muammar Gaddafi's rule of Libya, the Amazigh language Tamazight was banned in schools and parents were not even allowed to give their children Amazigh names.However, thanks to the dogged campaigning of Amazigh activists, their culture and language has seen greater recognition over the past decade.In 2011, Morocco recognised Tamazight as an official language. Both Algeria and Morocco also declared Yennayer a public holiday, in 2017 and 2023 respectively.So Yennayer marks not just a victory for the Amazigh people, but also a reminder of centuries-long fight that has got the community to where it is now - in 2976.APP/NurPhoto via Getty ImagesYennayer is now a public holiday in Algeria and MoroccoGetty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Yennayer: North Africa's Amazigh people ring in the year 2976",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/32fe/live/3c269770-f099-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-14T00:37:02.000Z",
      "dateModified": "2026-01-14T00:37:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US announces start of phase two of Trump's Gaza peace plan",
    "url": "https://www.bbc.com/news/articles/cjw1nxe5pvlo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9952/live/d8cccae0-f16b-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-14T20:50:09.000Z",
    "description": "US launches phase two of Gaza peace plan with new technocratic government8 hours agoDavid GrittenandJon Donnison,JerusalemReutersPhase two of the peac",
    "body": "US launches phase two of Gaza peace plan with new technocratic government8 hours agoDavid GrittenandJon Donnison,JerusalemReutersPhase two of the peace plan should see reconstruction starting in Gaza after two years of warUS envoy Steve Witkoff has announced the start of phase two of President Donald Trump's plan to end the war in Gaza, with a technocratic Palestinian government established in the territory.Under phase one, Hamas and Israel agreed a ceasefire in October, as well as a hostage-prisoner exchange, a partial Israeli withdrawal, and an aid surge.Witkoff said phase two would also see the reconstruction and full demilitarisation of Gaza, including the disarmament of Hamas and other Palestinian groups.\"The US expects Hamas to comply fully with its obligations,\" he warned, noting these include the return of the body of the last dead Israeli hostage. \"Failure to do so will bring serious consequences.\"However, two key points of phase two could be problematic.Hamas has previously refused to give up its weapons without the creation of an independent Palestinian state, and Israel has not committed to fully withdrawing from Gaza.The ceasefire is also fragile at best, with both sides accusing each other of repeated violations. Almost 450 Palestinians have been killed in Israeli strikes since it came into force, according to Gaza's Hamas-run health ministry.And humanitarian conditions in the territory remain dire, according to the UN, which has stressed the need for the unrestricted flow of critical supplies.In his statement, Witkoff declared that with the launch of phase two of Trump's 20-point peace plan on Wednesday, Gaza was \"moving from ceasefire to demilitarisation, technocratic governance, and reconstruction\".\"Phase Two establishes a transitional technocratic Palestinian administration in Gaza, the National Committee for the Administration of Gaza (NCAG), and begins the full demilitarization and reconstruction of Gaza, primarily the disarmament of all unauthorized personnel,\" he said.Following the announcement, regional mediators Egypt, Qatar and Turkey welcomed the formation of what they called the \"Palestinian Technocratic Committee to Administer the Gaza Strip\", saying it would contribute to \"efforts aimed at consolidating stability and improving the humanitarian situation\".They also revealed that the 15-member committee would be headed by Ali Shaath, a former deputy planning minister in the Palestinian Authority (PA), which governs parts of the occupied West Bank not under Israeli control.Gaza's transitional administration will operate under the supervision of a \"Board of Peace\", which will be chaired by Trump, according to the 20-point plan he unveiled three months ago.Announcements related to the board are expected in the coming days, including when the president visits the World Economic Forum in Davos next week.Nickolay Mladenov, a Bulgarian politician and former UN Middle East envoy, is set to be the board's representative on the ground in Gaza.Trump's plan says an International Stabilisation Force (ISF) will also be deployed to Gaza to train and support vetted Palestinian police forces.Israel's prime minister told Ran Gvili's parents that his return was \"a top priority\"Earlier on Wednesday, Hamas and its ally Palestinian Islamic Jihad (PIJ) said in a joint statement that they had agreed to support the efforts to form the technocratic Palestinian government \"while providing the appropriate environment\" for it to begin work.The PA - which is dominated by Fatah, Hamas's rival - also expressed support.Vice-President Hussein al-Sheikh said Trump's leadership urged all Palestinian factions, institutions and segments of society to \"ensure the success of this critical transitional phase\". He also stressed the importance of linking institutions in the West Bank and Gaza in order to uphold \"the principle of one system, one law, and one legitimate weapon\".According to Trump's plan, the PA will take over governing Gaza once it has completed reforms and can do so \"securely and effectively\".Israeli Prime Minister Benjamin Netanyahu's office said he had spoken on Wednesday evening with the parents of Ran Gvili, the last dead hostage in Gaza.He made it clear to Itzik and Talik Gvili that \"Ran's return is a top priority and that the declaratory move regarding the establishment of a technocratic committee will not affect the efforts to return Ran for a Jewish burial\", the office added.The Hostages and Missing Families Forum insisted: \"There is no phase 2 while Ran Gvili in Gaza. Phase Rani must come first.\"The Israeli government had accused Hamas of deliberately delaying the recovery of the 24-year-old police officer's remains and said it will not reopen the Rafah border crossing between Gaza and Egypt – one of its obligations under phase one - until they are handed over.Gvili was among the 251 people abducted during the Hamas-led attack on southern Israel on 7 October 2023, when about 1,200 other people were killed.Israel responded to the attack by launching a military campaign in Gaza, during which more than 71,430 people have been killed, according to the territory's health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US announces start of phase two of Trump's Gaza peace plan",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9952/live/d8cccae0-f16b-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-14T20:50:09.000Z",
      "dateModified": "2026-01-14T20:50:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Canada’s Mark Carney faces delicate balancing act in China visit ",
    "url": "https://www.bbc.com/news/articles/c98pj370mjjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/30ba/live/b52da690-f0da-11f0-a29c-c32ead86fb16.jpg",
    "tag": "World",
    "date": "2026-01-14T00:00:15.000Z",
    "description": "1 day agoNadine Yousif,Senior Canada reporterandLaura Bicker,China correspondent Canada's Prime Minister Mark Carney is en route to China for a pivota",
    "body": "1 day agoNadine Yousif,Senior Canada reporterandLaura Bicker,China correspondent Canada's Prime Minister Mark Carney is en route to China for a pivotal visit aimed at resetting ties with Beijing and finding new economic opportunities for his country outside the US.It will not be an easy task, with pressure on Canada to balance its goal of diversifying trade without risking damage to its relationship with Donald Trump or compromising national security and human rights commitments.But with ongoing uncertainty over Canada's trade future with the US – its largest customer – the country now finds itself seeking to repair strained relations to protect its economy.Senior Canadian officials have described the trip, the first to China by a Canadian prime minister since 2017, as \"consequential and historic\" and part of a \"bold\" plan to double Canada's non-US exports over the next decade.Trade will be on the agenda, along with agriculture and international security, Carney's office said. Beijing's foreign ministry said the two countries have \"shared interests\" and should work to \"increase people-to-people ties and cultural exchanges\".On Thursday, Carney meets the Premier of China, Li Qiang, as well as the Chairman of the Standing Committee of the National People's Congress of China, Zhao Leji.On Friday, the prime minister is scheduled to meet Chinese President Xi Jinping one-on-one, after the pair met last year on the sidelines of an Asia-Pacific Economic Cooperation summit in South Korea.This official visit is a significant step in the rapprochement after Canada-China relations hit a low in 2018, following the arrest of Huawei executive Meng Wanzhou in Vancouver on a US warrant on fraud charges related to Iran sanctions violations. The detention in Canada of the executive of a Chinese telecom giant angered Beijing, and China subsequently arrested two Canadians on espionage charges. All three were released in 2021 after Meng cut a deal with US prosecutors.More recently, China has been accused of meddling in Canada's politics, though a public inquiry on foreign interference found its impact in recent federal elections to be minimal. China has repeatedly denied allegations of foreign meddling.Canada and China have struggled to forge meaningful ties in the past. Ottawa views China as \"an increasingly disruptive global power\"  that \"increasingly disregards\" international rules and norms, though it recognises China's size and influence make some cooperation necessary. The Carney government does not see this upcoming visit as a deviation from that view, senior Canadian government officials told reporters this week. But they added that Canada cannot achieve its objective of reducing economic reliance on the US without increasing trade with China.Carney is said to be approaching talks with an eye on increasing collaboration in areas of mutual interest like energy and climate, and putting guardrails on areas where the two countries clash, like defence and critical minerals.\"I think we are approaching the relationship now with the realism that we haven't seen for decades,\" Colin Robertson, a former Canadian diplomat, told the BBC. Robertson added that it could result in a \"healthier relationship if both sides understand where they're coming from and what the red lines are\".It has already proven to be a careful line to walk. Ahead of Carney's visit, two Liberal MPs cut a sponsored trip to Taiwan short, telling the Globe and Mail newspaper that while Canada's position on Taiwan \"has not changed\", the trip ended early to \"avoid confusion with its foreign policy, given the overlap with the Prime Minister's engagement in Beijing\".One of Canada's main objectives during this trip is to ease Chinese tariffs on Canadian canola that have hurt farmers in the country's prairie provinces. China last year imposed the agriculture tariffs in a move widely seen as retaliation for Canadian levies on Chinese electric vehicles announced in 2024, mirroring similar levies by the US.In an editorial this week, state-run newspaper Global Times pointed to frustration expressed by Canadian farmers, suggesting \"perhaps this was the heavy price (Canada) paid for blindly following the US\". China has made it clear it wants the tariffs on EVs lifted.For China, Canada is seen as an important trading partner, with trade between the two countries valued at around $118bn in 2024. But crucially for Beijing, if President Xi manages to make a deal with Carney, it would give China more influence in a country that is on America's doorstep.The Global Times op-ed called on Ottawa to set a foreign policy path separate from that of the US and to exercise \"strategic autonomy\".One big unknown about this visit is how the US would react to any deals struck between Canada and China. Canada's economy has been hit by US tariffs, especially those on its steel, aluminium and automotive sectors. Talks to ease those levies remain on pause.Canada will soon, however, be engaged in consequential talks on renewing a long-standing North American free trade agreement with the US and Mexico that has shielded it from the bulk of Trump's sweeping tariffs. That review is set to be completed later this year.Robertson, the former diplomat, said it is likely that the Americans are watching the Canada-China relationship \"very closely\", and that Canada is keeping the US \"well informed\" of its intentions.But he added: \"At the end of the day, there's Canadian interests that we're pursuing.\"With additional reporting from Jessica Murphy in Toronto. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Canada’s Mark Carney faces delicate balancing act in China visit ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/30ba/live/b52da690-f0da-11f0-a29c-c32ead86fb16.jpg"
      ],
      "datePublished": "2026-01-14T00:00:15.000Z",
      "dateModified": "2026-01-14T00:00:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]