[
  {
    "title": "Thousands take to Lisbon streets over Portugal's proposed labour laws",
    "url": "https://www.bbc.com/news/articles/cpd257jd3zzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/82c4/live/7854ca70-bce9-11f0-b29f-75619de23640.jpg",
    "tag": "World",
    "date": "2025-11-08T22:07:31.000Z",
    "description": "2 days agoGeorge WrightGetty ImagesTens of thousands have taken to the streets of Portugal's capital, Lisbon, to protest against proposed labour laws ",
    "body": "2 days agoGeorge WrightGetty ImagesTens of thousands have taken to the streets of Portugal's capital, Lisbon, to protest against proposed labour laws which they say threaten workers' rights.The centre-right government wants to make it easier for employers to fire people,  outsource work to other companies, and limit some types of compassionate leave, including cutting bereavement leave for women who suffer miscarriages.It says the measures are needed to improve job flexibility and increase productivity in one of western Europe's poorest countries.The head of Portugal's largest union, CGTP, called the reforms \"one of the greatest attacks ever made against workers\" in the country and announced a general strike for 11 December.The bill is likely to pass in parliament with support from far-right party Chega.The union told Reuters that around 100,000 protesters filled Lisbon's main avenue, while the Associated Press also reported tens of thousands of people were present. No police estimate was available.Speaking at the protest, Miriam Alves, 31, a worker at a medical device company, told Reuters that reforms are \"clearly a step backward in working conditions and could lead to a complete lack of job security\".Archive technician Madalena Pena, 34, said the government was reversing labour rights \"in an unfair, subtle, and cunning way, without having said anything before the election\" in May.CGTP general secretary Tiago Oliveira announced the strike for next month at the protest.On the proposed changes, he said: \"If implemented, it would be a real setback in the lives of each and every one of us.\"Protesters also wanted higher wages. Official data shows more than 50% of workers earned less than 1,000 euros (£879) per month last year. The minimum wage is only 870 euros (£764).",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thousands take to Lisbon streets over Portugal's proposed labour laws",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/82c4/live/7854ca70-bce9-11f0-b29f-75619de23640.jpg"
      ],
      "datePublished": "2025-11-08T22:07:31.000Z",
      "dateModified": "2025-11-08T22:07:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Former French president Sarkozy released from prison after three weeks",
    "url": "https://www.bbc.com/news/articles/cm2eppqd2nyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0670/live/8fea4ad0-be46-11f0-8669-5560f5c90fbe.jpg",
    "tag": "World",
    "date": "2025-11-10T17:25:17.000Z",
    "description": "Former French president Nicolas Sarkozy has been released from jail, three weeks into a five-year prison term for taking part in a criminal conspiracy",
    "body": "Former French president Nicolas Sarkozy has been released from jail, three weeks into a five-year prison term for taking part in a criminal conspiracy.He will be subject to strict judicial supervision and barred from leaving France ahead of an appeal trial due to be held next year.On 21 October, the former centre-right president, 70, was sentenced to five years for conspiring to fund his 2007 election campaign with money from late Libyan dictator Muammar Gaddafi. His legal team immediately filed a request seeking his release.Writing on social media after the release, Sarkozy said his \"energy is focused solely on the single goal of proving my innocence.\"  \"The truth will prevail... The end of the story is yet to be written.\"Sarkozy's car was seen leaving La Santé prison in Paris just before 15:00 (14:00 GMT), less than an hour-and-a-half after a court agreed to his early release. Soon after, he was seen arriving at his home in western Paris.Christophe Ingrain, one of Sarkozy's lawyers, hailed his client's release as \"a step forward\" and said they would now be preparing for the appeal trial expected in March.One condition of Sarkozy's release is he does not contact any other witnesses in the so-called \"Libyan dossier\" or any justice ministry employees. During his incarceration, he was visited by Justice Minister Gérald Darmanin. The visit prompted 30 French lawyers to file a complaint against Darmanin, highlighting what they said was a conflict of interest as Darmanin was a former colleague and friend of Sarkozy's.Speaking to a court in Paris via video link on Monday morning, Sarkozy described his time in solitary confinement as \"gruelling\" and \"a nightmare\".He said he had never had the \"mad idea\" of asking Gaddafi for money and stated he would \"never admit to something I haven't done\".Sarkozy also paid tribute to prison staff who had made his time in prison \"bearable\". \"They have shown exceptional humanity,\" he said.Sarkozy's wife, the singer and model Carla Bruni-Sarkozy, and two of the former president's sons were present in the courtroom to support him. Sarkozy is the first French ex-leader placed behind bars since World War Two Nazi collaborationist leader Philippe Pétain was jailed for treason in 1945.Since entering prison, Sarkozy has been held in a cell in the isolation wing. He had a toilet, a shower, a desk, a small electric hob and a small TV – for which he paid a monthly €14 (£12) fee – and the right to a small fridge.He also had the right to receive information from the outside world and family visits, as well as written and phone contact – but was in effect in solitary confinement. He was allowed just one hour a day for exercise, which he did by himself in the wing's segregated courtyard.Two bodyguards were stationed in nearby cells, which the interior minister Laurent Nuñez said was due to Sarkozy's status. There was \"obviously a threat against him\", Nuñez said.Sarkozy was president from 2007 to 2012. Ever since he left office, he has been dogged by criminal inquiries and for months had to wear an electronic tag around his ankle after a conviction last December for trying to bribe a magistrate for confidential information about a separate case.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Former French president Sarkozy released from prison after three weeks",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0670/live/8fea4ad0-be46-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-10T17:25:17.000Z",
      "dateModified": "2025-11-10T17:25:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dozens of inmates found hanged in Ecuador prison",
    "url": "https://www.bbc.com/news/articles/c0kp220561go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0a96/live/fe60d510-be2d-11f0-bd20-5b436a1e000e.jpg",
    "tag": "World",
    "date": "2025-11-10T12:34:33.000Z",
    "description": "At least 31 inmates have been found dead in a prison in southern Ecuador, including 27 who had been hanged, officials say. Four prisoners were killed ",
    "body": "At least 31 inmates have been found dead in a prison in southern Ecuador, including 27 who had been hanged, officials say. Four prisoners were killed and more than 30 injured in clashes between rival gang members in El Oro prison in the city of Machala in the early hours of on Sunday. Hours later, security guards who had been alerted to a fresh outbreak of gang violence found the others who had been hanged on the building's third floor, Ecuador's prison service said.The country's overcrowded prisons have been the scene of a series of deadly riots and gang fights in which hundreds of inmates have been killed in recent years. Ecuador's prison service, known by its initials as Snai, said that the clashes had been triggered by plans to move some of the inmates to a newly-built prison.El Oro prison was the site of another deadly incident in September when 13 inmates and a guard were killed in clashes between rival gangs. Relatives of the prisoners have asked the authorities to step up security inside the prison, including keeping rival gangs separate, whilst residents of Machala have long demanded that the facility, which is located in the city centre, be relocated. Earlier this year, the government of President Daniel Noboa announced the construction of a new maximum security jail in the province of Santa Elena.The new prison, named El Encuentro, is expected to open in late November, and according to the interior minister, will boast all the latest security measures. Prison gangs have for years played a key role in the rise of violent crime in Ecuador and two of them, Los Lobos and Los Choneros, were declared Foreign Terrorist Organisations by the US Department of State in September.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dozens of inmates found hanged in Ecuador prison",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0a96/live/fe60d510-be2d-11f0-bd20-5b436a1e000e.jpg"
      ],
      "datePublished": "2025-11-10T12:34:33.000Z",
      "dateModified": "2025-11-10T12:34:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Louvre heist: 'Fedora man' in viral picture revealed as local teenager",
    "url": "https://www.bbc.com/news/articles/c5ylx0g6w76o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cc4e/live/e48e8c60-bd86-11f0-8456-eff94716b162.png",
    "tag": "World",
    "date": "2025-11-09T22:09:39.000Z",
    "description": "In the three weeks since the Louvre museum heist, as investigators sought to find out who was behind it and why the French crown jewels had been so ea",
    "body": "In the three weeks since the Louvre museum heist, as investigators sought to find out who was behind it and why the French crown jewels had been so easy to steal, another mystery remained: who the \"fedora man\" was.The dapper youth in a hat was photographed outside the museum that Sunday and went viral on social media, prompting theories about his identity.Police moved swiftly to arrest and charge four people for the crime, while the Louvre director admitted CCTV security was inadequate.However, the fedora man remained an enigma - until now.The dandy, it turns out, is a local teenage fan of Sherlock Holmes and Hercule Poirot who just happened to be at a real crime scene.Pedro Elias Garzon Delvaux, a 15-year-old from Rambouillet, south-west of Paris told the Associated Press (AP) news agency that he had planned to visit the Louvre with his family but found the museum was closed. \"We didn't know there was a heist,\" he said.As he asked officers about the closure, an AP photographer seeking to capture the security cordon took a picture and included Pedro in the frame.Pedro only realised the photo had gone viral four days later, when a friend sent him a screenshot asking: \"Is that you?\"When he replied that it was, the friend said he had five million views on TikTok. \"I was a bit surprised,\" Pedro told the AP.He was even more shocked when his mother called to say the picture had appeared in The New York Times. It made a big impact on him, he said, because he reads that newspaper and \"it's not every day you're in the New York Times\". \"People said, 'You've become a star'. I was astonished that just with one photo you can become viral in a few days.\"Asked why he wore an old-fashioned waistcoat and a fedora to the museum, Pedro said he began dressing this way recently, inspired by 20th-century statesmen and fictional detectives.\"I like to be chic,\" he told the AP. \"I go to school like this.\"As wild speculation about the photo of him circulated online - some wondered whether he might be a real detective or an AI fake - Pedro remained silent for weeks.\"I didn't want to say immediately it was me,\" he said. \"With this photo there is a mystery, so you have to make it last.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Louvre heist: 'Fedora man' in viral picture revealed as local teenager",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cc4e/live/e48e8c60-bd86-11f0-8456-eff94716b162.png"
      ],
      "datePublished": "2025-11-09T22:09:39.000Z",
      "dateModified": "2025-11-09T22:09:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Duduzile Zuma-Sambudla: Trial of ex-South African President Jacob Zuma's daughter starts",
    "url": "https://www.bbc.com/news/articles/cj6nppg2kklo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d58d/live/f0c82a90-be26-11f0-804a-9fd1fc4085f0.jpg",
    "tag": "World",
    "date": "2025-11-10T12:10:20.000Z",
    "description": "Jacob Zuma's daughter denies terrorism charges as her trial starts8 hours agoKhanyisile Ngcobo and Nomsa Maseko,BBC Africa, JohannesburgGallo Images v",
    "body": "Jacob Zuma's daughter denies terrorism charges as her trial starts8 hours agoKhanyisile Ngcobo and Nomsa Maseko,BBC Africa, JohannesburgGallo Images via Getty ImagesDuduzile Zuma-Sambudla has said the state's case against her is weakThe daughter of former South African President Jacob Zuma has pleaded not guilty to terrorism-related charges at the start of her trial in the port city of Durban.Duduzile Zuma-Sambudla is being prosecuted over comments she made on social media four years ago during deadly protests in South Africa following the arrest of her father.A week of anarchy in several parts of the country in July 2021, including looting and arson, left at least 300 people dead and caused damage worth an estimated $2.8bn (£2.2bn).Zuma-Sambudla, 43, has been accused of fuelling this unrest and faces charges of incitement to commit terrorism and public violence.The protests were concentrated in the provinces of Gauteng and KwaZulu-Natal and followed the former president's arrest for disobeying a court order to testify at an inquiry into allegations of corruption while he was in power.Ms Zuma-Sambudla has always denied the charges against her, with her lawyer previously labelling the state's case as weak.She has also repeatedly said the charges against her were an attempt to settle political scores with her father after he started his own political party and campaigned against the African National Congress (ANC).This was echoed by the Jacob Zuma foundation, which said the case was an \"abuse of power\" and a \"systematic campaign of political and familial harassment\" against the former president and his family.A handful of supporters from her party, uMkhonto weSizwe, turned up outside the KwaZulu-Natal high court, while her father and other party leaders attended the hearings inside.More BBC stories on South Africa:Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Duduzile Zuma-Sambudla: Trial of ex-South African President Jacob Zuma's daughter starts",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d58d/live/f0c82a90-be26-11f0-804a-9fd1fc4085f0.jpg"
      ],
      "datePublished": "2025-11-10T12:10:20.000Z",
      "dateModified": "2025-11-10T12:10:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "British ex-soldier arrested over killing of Kenyan woman in 2012",
    "url": "https://www.bbc.com/news/articles/c8jrkyzn8dvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c909/live/40a165f0-bbfb-11f0-8137-87774ba307f6.jpg",
    "tag": "World",
    "date": "2025-11-07T19:32:29.000Z",
    "description": "3 days agoSteve Mellen and Alys DaviesA former British soldier is facing extradition to Kenya in connection with the alleged murder of a 21-year-old w",
    "body": "3 days agoSteve Mellen and Alys DaviesA former British soldier is facing extradition to Kenya in connection with the alleged murder of a 21-year-old woman there in 2012.The National Crime Agency (NCA) said Robert James Purkiss was arrested in Tidworth, Wiltshire on 6 November and appeared at Westminster Magistrates' Court on Friday.He was arrested by specialist officers from the NCA's National Extradition Unit in connection with the killing of Agnes Wanjiru after a warrant was issued in September, the agency added.Mr Purkiss, 38, told the court he intended to contest the extradition and was remanded into custody ahead of his next appearance at the same court on 14 November.His lawyers told the court that he \"vehemently denies\" murder.Ms Wanjiru's body was discovered in a septic tank near a hotel in the town of Nanyuki, about 124 miles (200km) north of Nairobi, three months after she had gone missing on 31 March 2012. She had a five-month-old baby at the time.Her body was found near a British army training camp. On the night she was killed, she had reportedly been at a bar with friends where British soldiers were also present. Ms Wanjiru's niece, Esther Njoki, met the UK's defence minister last month in order to push for Mr Purkiss's extradition. In a statement issued through Leigh Day, the lawyers acting for Ms Wanjiru's family, on Friday Ms Njoki said: \"My family is incredibly relieved to hear that the suspect in my aunt's case has been arrested.\"We have waited so many years for this moment which marks an important step towards finally obtaining justice for our beloved Agnes.\"Leigh Day partner Tessa Gregory said: \"This is a huge moment for our client and her family who have been fighting for over a decade to obtain justice for Agnes.\"We hope the UK and Kenyan authorities will now work together to ensure that the suspect can face trial in Kenya as quickly as possible.\"Ms Wanjiru's family has long accused the British army of covering up her death and the Kenyan authorities of failing to properly investigate the case at the time.An inquest into her death was opened in 2018 following pressure from Ms Wanjiru's family, as well as Kenyan rights groups and feminists.In 2019, it concluded that Ms Wanjiru had been unlawfully killed by one or two British soldiers and that she had suffered stab wounds to the chest and abdomen.Later in 2021, a Sunday Times investigation reported that a British soldier had confessed to colleagues that he killed Ms Wanjiru. The soldier left the army after the incident and reportedly continued to live in the UK.In 2024, the army announced it was launching an internal review into the conduct of British soldiers in Kenya, including in Nanyuki.It found 35 suspected cases of soldiers having engaged in sexual exploitation and abuse, including transactional sex, with local women - nine of these being after the army officially banned such conduct in 2022.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "British ex-soldier arrested over killing of Kenyan woman in 2012",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c909/live/40a165f0-bbfb-11f0-8137-87774ba307f6.jpg"
      ],
      "datePublished": "2025-11-07T19:32:29.000Z",
      "dateModified": "2025-11-07T19:32:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israel says body of Lior Rudaeff has been returned from Gaza",
    "url": "https://www.bbc.com/news/articles/cwykw15dx56o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fb57/live/610c9820-bc7b-11f0-83c4-15690b7a59fb.png",
    "tag": "World",
    "date": "2025-11-08T14:46:02.000Z",
    "description": "2 days agoMallory MoenchHostages and Missing Families ForumThe body has been identified as Lior RudaeffThe Israeli military says it has identified a b",
    "body": "2 days agoMallory MoenchHostages and Missing Families ForumThe body has been identified as Lior RudaeffThe Israeli military says it has identified a body handed over from Gaza as that of Israeli-Argentinian Lior Rudaeff.The 61-year-old was killed while attempting to defend Nir Yitzhak kibbutz during the Hamas attack on southern Israel on 7 October 2023 and his body was taken to Gaza by the Palestinian Islamic Jihad (PIJ) armed group, the military said.PIJ said the body was found on Friday in Khan Younis in southern Gaza. Hamas has now returned all 20 living hostages and 23 out of 28 deceased hostages under the first phase of a ceasefire deal that started on 10 October. Four of the five dead hostages still in Gaza are Israelis and one is Thai.Israel has criticised Hamas for not yet returning all the bodies. Hamas says it is hard to find them under rubble.PIJ is an armed group allied with Hamas. It took part in the 7 October attack and previously held some Israeli hostages. The Hostages and Missing Families Forum, a campaign group, welcomed the return.\"Lior's return provides some measure of comfort to a family that has lived with agonising uncertainty and doubt for over two years,\" it said in a statement. \"We will not rest until the last hostage is brought home.\"During the first phase of the US-brokered ceasefire deal, Israel freed 250 Palestinian prisoners in its jails and 1,718 detainees from Gaza. Israel has also handed over the bodies of 300 Palestinians in exchange for the bodies of the 20 Israeli hostages returned by Hamas, along with those of three foreign hostages - one of them Thai, one Nepalese and one Tanzanian.MOHAMMED SABER/EPA/ShutterstockHamas's military wing stood guard as they searched for hostage bodies on 5 November The parties also agreed to an increase of aid to the Gaza Strip, a partial withdrawal of Israeli forces, and a halt to fighting, although violence has flared up as both sides accused one another of breaching the deal.Israel launched air strikes after accusing Hamas fighters of killing two of its soldiers on 19 October and of killing another soldier on 28 October. Hamas said it was unaware of clashes in the area of the first incident and had no connection to the second attack.Israeli military actions have killed at least 241 people since the start of the ceasefire, according to the Hamas-run health ministry, whose figures are seen by the UN as reliable.The Israeli military launched a campaign in Gaza in response to the 7 October 2023 attack, in which Hamas-led gunmen killed about 1,200 people in southern Israel and took 251 others hostage. All but one of the dead hostages still in Gaza were abducted in the attack.At least 69,169 people have been killed by Israeli attacks in Gaza since then, the health ministry reported.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israel says body of Lior Rudaeff has been returned from Gaza",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fb57/live/610c9820-bc7b-11f0-83c4-15690b7a59fb.png"
      ],
      "datePublished": "2025-11-08T14:46:02.000Z",
      "dateModified": "2025-11-08T14:46:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hadar Goldin: Israel receives body of soldier killed in 2014",
    "url": "https://www.bbc.com/news/articles/c2kp3yjy8q7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3c6b/live/619139e0-be1a-11f0-8669-5560f5c90fbe.jpg",
    "tag": "World",
    "date": "2025-11-09T19:41:15.000Z",
    "description": "1 day agoGeorge Wright and Andre Rhoden-PaulReutersIDF soldier Hadar Goldin was killed in Gaza in 2014Israel has received the body of Lt Hadar Goldin,",
    "body": "1 day agoGeorge Wright and Andre Rhoden-PaulReutersIDF soldier Hadar Goldin was killed in Gaza in 2014Israel has received the body of Lt Hadar Goldin, a soldier killed in an ambush by Hamas in 2014 and whose body has been held in Gaza since then.The Israeli military said Lt Goldin, who was 23 when he died, was formally identified and will now be buried. He left behind parents, a sister, two brothers, and a fiancée.Hamas's armed wing had said on Sunday that it would hand over Lt Goldin's body as part of a ceasefire deal.Hamas has now returned all 20 living hostages, and 24 out of 28 deceased hostages under the first phase of the deal.On Sunday, Lt Goldin's father Simcha Goldin said in a statement: \"Victory means bringing home the hostages and bringing home our soldiers to Israel.\"Israeli Prime Minister Benjamin Netanyahu and President Isaac Herzog both said they had kept a picture of Lt Goldin in their offices for the past 11 years. Netanyahu said \"we didn't give up\" on bringing him home.\"I know the agony that his family's been through, I know the longing for his return that united the people of Israel and today we're united in bringing him finally to his parents, to his family, to a grave in Israel.\"Efforts to retrieve Lt Goldin \"involved extensive intelligence efforts, alongside operational activities on the ground\" over the past decade and during the last two years of war between Israel and Hamas, the Israel Defense Forces (IDF) said.The military expressed \"deep condolences to the family and continues to make every effort to return all the deceased hostages and is prepared for the continued implementation of the agreement\".Herzog said the government would \"continue to act tirelessly\" to bring home all the hostages.Of the four hostages who remain in Gaza, three are Israeli and one is Thai.ReutersLt Goldin, from Kfar Saba, is the only deceased hostage whose remains were being held in Gaza before the Hamas-led 7 October 2023 attack on Israel, which sparked the latest war. He was killed in combat on 1 August 2014, not long after the start of a ceasefire in that year's war between Israel and Hamas. He was among a group of Israeli soldiers patrolling an agricultural area near Rafah in southern Gaza when they were attacked by a group of Hamas fighters. The Israeli military determined that Lt Goldin was killed along with two other soldiers in a firefight, and that his body was then dragged into an underground tunnel by the Hamas fighters.The Israeli military unleashed massive firepower to try to prevent Hamas from taking Lt Goldin hostage. Scores of Palestinian civilians were killed in the bombardment of Rafah, which continued for four days, including after Lt Goldin was declared dead.Nine years later, the Israeli military launched a campaign in Gaza in response to the 7 October 2023 attack, in which Hamas-led gunmen killed about 1,200 people in southern Israel and took 251 others hostage. At least 69,176 people have been killed by Israeli attacks in Gaza since then, according to the Hamas-run health ministry, whose figures the UN considers reliable.During the ongoing first phase of a US-brokered ceasefire deal, Israel freed 250 Palestinian prisoners in its jails and 1,718 detainees from Gaza.Before Lt Goldin's body was returned, Israel had also handed over the bodies of 300 Palestinians in exchange for the bodies of 20 Israeli hostages returned by Hamas, along with those of three foreign hostages - one of them Thai, one Nepalese and one Tanzanian.The parties also agreed to an increase of aid to the Gaza Strip, a partial withdrawal of Israeli forces, and a halt to fighting, although violence has flared up as both sides accused one another of breaching the deal.On Saturday in Gaza, two Palestinians were killed by Israeli fire. The Israeli military said two people had crossed the yellow line marking the line of Israeli control and posed an \"immediate threat\".Separately, one Palestinian was shot dead in Gaza by Israeli fire and another was wounded on Saturday, local medics and the Israeli military said.Gazan medical officials said the person who died was killed by Israeli fire east of Bureij refugee camp in central Gaza. Civil defence rescuers said the injured Palestinian was wounded by Israeli gunfire in Khan Younis.Israeli military actions have killed at least 241 people since the start of the ceasefire, according to the Gaza health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hadar Goldin: Israel receives body of soldier killed in 2014",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3c6b/live/619139e0-be1a-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-09T19:41:15.000Z",
      "dateModified": "2025-11-09T19:41:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Six die as Russia targets energy and residential sites in Ukraine",
    "url": "https://www.bbc.com/news/articles/ce3xdg7xrv9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7032/live/2fe80cb0-bcb3-11f0-8d79-97f33dcb026b.jpg",
    "tag": "World",
    "date": "2025-11-08T16:22:33.000Z",
    "description": "2 days agoJames Landale,Diplomatic correspondent in Kyiv and Alex KleidermanAt least six people have died after Russia launched hundreds of missile an",
    "body": "2 days agoJames Landale,Diplomatic correspondent in Kyiv and Alex KleidermanAt least six people have died after Russia launched hundreds of missile and drone attacks on energy infrastructure and residential targets in Ukraine overnight.A strike on an apartment building in the city of Dnipro killed two people and wounded 12, while three died in Zaporizhzhia. In all, 25 locations across Ukraine, including the capital city Kyiv, were hit, leaving many areas without electricity and heating. Prime Minister Yulia Svyrydenko said on Telegram that major energy facilities were damaged in the Poltava, Kharkiv and Kyiv regions, and work was under way to restore power. In Russia, the defence ministry said its forces had shot down 79 Ukrainian drones overnight.The Ukrainian air force said Russia had launched more than 450 exploding bomber drones and 45 missiles. Nine missiles and 406 drones were reportedly shot down.The Ukrainian Energy Ministry said there were power cuts in the Dnipropetrovsk, Chernihiv, Zaporizhzhya, Odesa and Kirovohrad regions, but restoration work was ongoing.Svyrydenko said critical infrastructure facilities have already been reconnected, and water supply is being maintained using generators. Russia argues its attacks on energy targets are aimed at the Ukrainian military.Russian attacks on Ukraine's energy infrastructure ahead of winter are now a familiar part of this war. But ministers in Kyiv are acutely concerned that Moscow is not just trying to damage the morale of Ukraine's people but also bring its economy to a standstill by collapsing its energy network. Analysts say this fourth winter of Russia's full scale invasion will prove a significant test of Ukraine's defensive resilience.Ukraine's President Volodymyr Zelensky said the attacks showed there must be \"no exceptions\" to Western sanctions on Russian energy as a way of putting pressure on Moscow. The missile strikes came only hours after the US gave Hungary a one-year exemption from restrictions on buying oil and gas from Russia. In October, the US effectively blacklisted two of Russia's largest oil companies, threatening sanctions on those who buy from them. But on Friday, during a visit to Washington by Hungarian Prime Minister Viktor Orban - a close personal and political ally of Donald Trump - the US president  announced the exemption for Budapest.In a message on Telegram, Zelensky said the overnight attacks showed that \"pressure must be intensified\" on Russia.He said \"for every Moscow strike on energy infrastructure - aimed at harming ordinary people before winter - there must be a sanctions response targeting all Russian energy, with no exceptions\".He said Ukraine expected \"relevant decisions from the US, Europe and the G7\".Debates about sanctions can sometimes seem technical or diplomatic. But for people in Ukraine, they are very real. If Russia can sell its oil to Hungary, it can use the money earned to build more drones and missiles, like those it launched against Ukraine on Friday night.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Six die as Russia targets energy and residential sites in Ukraine",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7032/live/2fe80cb0-bcb3-11f0-8d79-97f33dcb026b.jpg"
      ],
      "datePublished": "2025-11-08T16:22:33.000Z",
      "dateModified": "2025-11-08T16:22:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US authorities ground cargo plane model after Kentucky air disaster ",
    "url": "https://www.bbc.com/news/articles/cx2pr5y7p90o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ae88/live/91740bf0-bc81-11f0-ae46-bd64331f0fd4.png",
    "tag": "World",
    "date": "2025-11-09T03:12:21.000Z",
    "description": "2 days agoOttilie Mitchell and Harry SekulichUS aviation authorities have ordered that all models of a cargo plane that crashed mid-takeoff in Kentuck",
    "body": "2 days agoOttilie Mitchell and Harry SekulichUS aviation authorities have ordered that all models of a cargo plane that crashed mid-takeoff in Kentucky on Tuesday be grounded.It comes after a Boeing MD-11 aircraft operated by UPS burst into flames on the runway of Louisville International Airport before colliding into neighbouring businesses, killing 14 people. The American delivery firm had earlier said it would not operate the planes pending an ongoing investigation, with FedEx then following suit.Now the Federal Aviation Administration (FAA) has issued a formal notice banning all MD-11 and MD11F aircraft from flying until safety checks are carried out.In total, 70 models are in use with UPS, FedEx and Western Global Airlines.FAA officials said the Kentucky crash happened after the plane's left engine caught fire and detached from the wing during take-off. The aircraft was carrying 38,000 gallons (144,000 litres) of fuel as it took off for a flight to Hawaii, which contributed to the size of the fire after the crash.A total of 14 people were killed in the crash and subsequent fire, including one person who had been admitted to hospital, Louisville Mayor Craig Greenberg has said.He said the number of dead now matches the number of people who were reported missing, indicating officials do not expect the death toll to climb further.Boeing said it welcomed the directive and that it had already advised the three firms which use the model to stop operating it out of \"an abundance of caution\".It is unclear whether the order will impact delivery services in the US, with none of the three companies reporting disruption so far.Data collated by the live air traffic website FlightRadar24 showed 55 MD-11 planes were used over the past week. \"Contingency plans are in place to flex our integrated air and ground network to help protect time-sensitive, critical shipments such as lifesaving pharmaceuticals, medical devices, and other products move through our network without disruption,\" FedEx said in a statement.UPS also said contingency plans were in place to continue its service. A statement continued: \"Nothing is more important to us than the safety of our employees and the communities we serve.\"The final passenger flights using an MD-11 was in 2014, with the model used exclusively as a cargo carrier since.The model of aircraft involved in the crash was an MD-11F triple-engine plane, which first entered service 34 years ago with Thai Airways as a passenger jet, but was transferred to UPS in 2006.MD-11s were originally manufactured by McDonnell Douglas, before the company merged with Boeing in 1997. Production of MD-11 planes ended in 2000.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US authorities ground cargo plane model after Kentucky air disaster ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ae88/live/91740bf0-bc81-11f0-ae46-bd64331f0fd4.png"
      ],
      "datePublished": "2025-11-09T03:12:21.000Z",
      "dateModified": "2025-11-09T03:12:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US cleaning woman shot and killed after arriving at wrong home",
    "url": "https://www.bbc.com/news/articles/ce3k5qv21g1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b02f/live/c34eae70-bced-11f0-bef8-2995471bb63c.png",
    "tag": "World",
    "date": "2025-11-08T22:00:13.000Z",
    "description": "2 days agoCBSMaria Florinda Rios Perez was fatally shot after arriving at the wrong home for a house-cleaning appointment US officials are looking int",
    "body": "2 days agoCBSMaria Florinda Rios Perez was fatally shot after arriving at the wrong home for a house-cleaning appointment US officials are looking into whether to file charges against an Indiana homeowner who shot and killed a house cleaner who mistakenly showed up at the wrong address.Police say they found Maria Florinda Rios Perez dead in her husband's arms on the front porch of a home on Wednesday shortly before 0700 local time (12:00 GMT). Authorities had been responding to a call about a possible home invasion in the Indianapolis suburb of Whitestown. The two did not appear to have entered the home, police said in a statement. They have formally submitted the case to the Boone County Prosecutor's Office for review to determine whether criminal charges will be brought in the case. Police have not identified the people in the home or who fired the shot, saying in a statement on Friday that it is a \"complex, delicate, and evolving case, and it would be both inappropriate and potentially dangerous to disclose that information\". They urged patience, warning of a \"concerning spread of misinformation online\" about the case.Mauricio Velazquez, told CBS News, the BBC's US partner, that he wanted justice for his 32-year-old wife. News reports say that she was a mother of four and originally from Guatemala. In an interview with CBS affiliate WTTV, Mr Velazquez said the bullet came right through the door of the home. \"They should've called the police first instead of just shooting out of nowhere like that,\" he said through an interpreter.CBSMauricio Velazquez said the bullet that killed his wife came through the door of the home they went to early on WednesdayBoone County prosecutor Kent Eastwood told The Indianapolis Star that the case is complex due to the language of the state's stand-your-ground law.Stand-your-ground laws are in place in many US states and most permit an individual to protect themselves with the use of reasonable force, including deadly force, to prevent death or great bodily harm.Similar incidents have made headlines across the US in recent years. In 2023, Ralph Yarl, who was then 16, was shot twice after ringing the doorbell of the wrong home in Missouri. Andrew Lester, who was in his 80s, pleaded guilty and died while awaiting sentencing. In New York, 20-year-old Kaylin Gillis died after being shot upon entering the wrong driveway. The homeowner who shot her is now serving a 25-year sentence. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US cleaning woman shot and killed after arriving at wrong home",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b02f/live/c34eae70-bced-11f0-bef8-2995471bb63c.png"
      ],
      "datePublished": "2025-11-08T22:00:13.000Z",
      "dateModified": "2025-11-08T22:00:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Three dead and 15 injured in Tenerife tidal surge ",
    "url": "https://www.bbc.com/news/articles/cpd2pzxe59go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8418/live/fabce8b0-bd90-11f0-b429-db99eb1e9512.jpg",
    "tag": "World",
    "date": "2025-11-09T17:40:04.000Z",
    "description": "Three people died and 15 more were injured after powerful waves battered popular Spanish holiday island Tenerife. A woman died after being pulled into",
    "body": "Three people died and 15 more were injured after powerful waves battered popular Spanish holiday island Tenerife. A woman died after being pulled into the ocean near the Puerto de la Cruz resort and a man died at Santa Cruz de Tenerife, emergency services said on Sunday. A third man was found dead in the ocean near a beach in Granadilla.Emergency services have told the public to stay away from coastal paths and to avoid taking pictures and videos of the rough seas, as the turbulent weather continues. Rescue services said they airlifted a man who fell into water at La Guancha in the north of the island, but that he was later pronounced dead at hospital. They said another man died after he was found floating near a beach at El Cabezo in the south, with lifeguards and medical staff unable to resuscitate him. At Puerto de la Cruz, a holiday resort in northern Tenerife, one woman died of a heart attack and another 10 people were swept out to sea. Three of those were seriously injured and taken to hospital.A local waiter, who gave his name only as Pedro, told the Reuters news agency that he jumped into the water in an attempt to save people being swept out. \"As soon as I saw a man waving at me I took my clothes off, jumped to the water and I managed to grab three of them and save them. I couldn't save the woman because she passed away at that moment,\" he said. Eyewitness Carlos said he warned people taking photos to move away from the waves but \"they did not pay attention\".Officials say the Canary Islands, the Spanish archipelago Tenerife belongs to, are on alert for coastal hazards. They warned sea conditions are expected to worsen with swells reaching two-to-four metres, and tourists and locals should exercise \"extreme caution\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Three dead and 15 injured in Tenerife tidal surge ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8418/live/fabce8b0-bd90-11f0-b429-db99eb1e9512.jpg"
      ],
      "datePublished": "2025-11-09T17:40:04.000Z",
      "dateModified": "2025-11-09T17:40:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mali jihadist crisis: TikToker killed by suspected jihadists after pro-army posts",
    "url": "https://www.bbc.com/news/articles/cnvep8ppyr6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/054f/live/2679e1a0-be23-11f0-8456-eff94716b162.jpg",
    "tag": "World",
    "date": "2025-11-10T10:52:38.000Z",
    "description": "A female TikToker accused of helping Mali's army has been seized and killed execution-style by suspected jihadists.Mariam Cissé, said to be in her 20s",
    "body": "A female TikToker accused of helping Mali's army has been seized and killed execution-style by suspected jihadists.Mariam Cissé, said to be in her 20s and with over 100,000 TikTok followers, posted videos about life in her Tonka hometown in the northern Timbuktu region and often expressed support for the army.Her death has shocked the nation, which has been battling a jihadist insurgency since 2012. State TV said she had simply wanted to promote her community and support the army through her TikTok posts.Mali is grappling with a fuel blockade imposed on the capital by jihadist groups that has severely disrupted daily life, with the African Union expressing \"deep concern\".Ms Cissé was seized by the suspected jihadists while live-streaming from a market in a neighbouring town, French public radio RFI reported. \"My sister was arrested on Thursday by the jihadists,\" her brother told the AFP news agency, saying they had accused her of \"informing the Malian army of their movements\".Over the weekend she was moved to Tonka by motorbike and shot at the town's Independence Square while her brother was in the crowd, AFP reports.A security source told the agency she had been assassinated because she had been accused of filming jihadists \"for the Malian army\".In some of her TikTok videos, she wears military uniform, with one of her posts captioned Vive Mali (Long Live Mali).Her death comes as the crisis caused by the jihadist blockade has worsened, with schools and universities remaining shut for weeks.The government has suspended learning institutions since last month and said that it would do \"everything possible to address the crisis\" so that they would reopen on Monday.The dire situation has persisted, and on Friday the French foreign ministry advised its citizens to urgently leave the country while commercial flights were available.On Sunday, AU Commission chairperson Mahmoud Ali Youssouf said he was concerned about the \"rapid deterioration of the security situation where terrorist groups have imposed blockades, disrupted access to essential supplies, and severely worsened humanitarian conditions for civilian populations\".He condemned the \"deliberate attacks against innocent civilians\" that had caused \"unacceptable loss of lives and heightened instability\".He added that the AU was ready \"to support Mali, as well as all Sahel countries, during this particularly challenging period\".For weeks, Mali has been hit by fuel shortages, especially in the capital Bamako, after militants from an al-Qaeda affiliate imposed a blockade by attacking tankers on major highways.Mali is landlocked, so all fuel supplies are brought in by road from neighbouring states such as Senegal and Ivory Coast.The military seized power in Mali in 2021 and promised to improve security, but the jihadist insurgency has continued and large parts of the north and east of the country remain outside government control.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mali jihadist crisis: TikToker killed by suspected jihadists after pro-army posts",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/054f/live/2679e1a0-be23-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-10T10:52:38.000Z",
      "dateModified": "2025-11-10T10:52:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Seven dead after migrant boat sinks near Thai-Malaysian border",
    "url": "https://www.bbc.com/news/articles/cd7rp5zj484o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/caaa/live/8716e810-bd64-11f0-abab-df46b9caffa5.jpg",
    "tag": "World",
    "date": "2025-11-10T12:59:54.000Z",
    "description": "7 hours agoAndré Rhoden-Paul and Kelly Ng,SingaporeAt least seven people have died after a boat carrying undocumented migrants sank near the border be",
    "body": "7 hours agoAndré Rhoden-Paul and Kelly Ng,SingaporeAt least seven people have died after a boat carrying undocumented migrants sank near the border between Thailand and Malaysia.Thirteen people have been rescued but dozens are missing. Malaysian Coast Guard estimate about 70 people were on board when the vessel sank near the resort island of Langkawi. The migrants were among a group of 300 people, most of whom are Rohingyas, who left Myanmar's impoverished Rakhine state two weeks ago on a larger vessel before splitting into small boats, Malaysian maritime official said.Rescue efforts have entered a second day, with the search area expanded from 170 to 256 square nautical miles. Malaysia's maritime authority expects the operation, involving sea surface and aerial searches, to last seven days.The body found in the water on Sunday was that of a Rohingya woman, Malaysia's state-owned news agency Bernama reported.Of the 13 rescued, 11 are Rohingyas and two are Bangladeshis. The Rohingyas, who are primarily Muslim, are one of the many ethnic minorities in the predominantly Buddhist country, but they are denied citizenship by the government of Myanmar.Since August 2017, a deadly crackdown by Myanmar's army sent hundreds of thousands of Rohingyas fleeing across the border into Bangladesh.Conflict and poor living conditions in Bangladesh however have also prompted some Rohingyas to make precarious journeys on overcrowded vessels to Malaysia, a Muslim country which some envision to be a safe haven in the region.Officials say many of them would have each paid more than $3,000 (£2,300) for these passages by sea.These boats are often small and cramped, lacking in basic facilities like fresh water and sanitation. And they do not always make it to Malaysia. Some die while being stranded at sea, while others are sometimes detained or deported. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Seven dead after migrant boat sinks near Thai-Malaysian border",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/caaa/live/8716e810-bd64-11f0-abab-df46b9caffa5.jpg"
      ],
      "datePublished": "2025-11-10T12:59:54.000Z",
      "dateModified": "2025-11-10T12:59:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Delhi Red Fort explosion: At least eight killed after blast in car",
    "url": "https://www.bbc.com/news/articles/ceq0p8qnnrno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bd0e/live/555f73c0-be52-11f0-8669-5560f5c90fbe.jpg",
    "tag": "World",
    "date": "2025-11-10T17:51:52.000Z",
    "description": "2 hours agoDoug Faulkner and Vikas Pandey,India editor, DelhiWatch: Verified video shows aftermath of car explosion in DelhiAt least eight people have",
    "body": "2 hours agoDoug Faulkner and Vikas Pandey,India editor, DelhiWatch: Verified video shows aftermath of car explosion in DelhiAt least eight people have been killed and more injured after a car exploded near Delhi's historic Red Fort, authorities have said.Delhi City police spokesperson, Sanjay Tyagi confirmed the deaths to the BBC, and said a further 20 people had suffered injuries.Police are investigating the cause of the explosion and \"exploring all possibilities\", Mr Tyagi said.Delhi Police Commissioner Satish Golcha has told reporters that the incident happened at around 18:52 local time (13:52 GMT), when a slow-moving vehicle stopped at a red light before it exploded, damaging nearby vehicles.Mr Tyagi told the BBC the explosion happened in a Hyundai i20 car that was moving and carrying three people at the time.Mumbai, India's financial capital, has been put on high alert, as has the Uttar Pradesh state which borders Delhi.The blast happened near a metro station close to the Red Fort, one of Delhi's most high-profile landmarks.The Mughal fortress, which is visited by thousands of tourists each year, was built in the 17th Century and is where Indian prime ministers give their Independence Day speeches every year. RAJAT GUPTA/EPA/ShutterstockIndia's Prime Minister Narendra Modi has sent his condolences to those who lost loved ones in the blast.Opposition leader Rahul Gandhi said in a statement that the news was \"extremely heartbreaking\".The federal home minister Amit Shah said teams from India's National Security Guard, and National Investigation Agency are investigating the explosion, along with forensic experts.\"We are exploring all possibilities and will conduct a thorough investigation, taking all possibilities into account. All options will be investigated immediately and we will present the results to the public,\" he added.The minister, who visited the site of the explosion and a nearby hospital, said a meeting involving senior officials would be held on Tuesday morning.Security is being stepped up at \"sensitive religious sites, vulnerable districts and border areas\" in the northern state of Uttar Pradesh, according to senior police official Amitabh Yash following the blast in neighbouring Delhi.Uttar Pradesh is home to famous sites such as the Taj Mahal and is a densely populated state.REUTERS/StringerAt least eight people died and 20 more were injured when the Hyundai i20 exploded, authorities saidVeeru Sindhi, a local businessman at the site when the explosion happened, described scenes of devastation, with multiple bodies and vehicles engulfed in flames.\"I am fully shaken by what I have seen,\" he told the BBC. \"We tried to rescue people who were trapped inside the vehicles.\"One eyewitness described the aftermath of the blast as chaotic and confusing.He was just a few hundred metres away from the spot when he heard a loud explosion.\"It felt like everything stopped for a few seconds before everyone started running in all directions,\" he told the BBC.He did not go near the site but could see mangled car parts on fire and locals trying to help the injured.There has been a heavy security presence at the blast site with personnel from the Uttar Pradesh Anti-Terrorist Squad (ATS), the National Security Guard (NSG), and the Central Reserve Police Force (CRPF). Armed officers have been seen moving towards the area as investigations continue.Additional reporting by Charlotte Scarr and Dilnawaz Pasha.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Delhi Red Fort explosion: At least eight killed after blast in car",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bd0e/live/555f73c0-be52-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-10T17:51:52.000Z",
      "dateModified": "2025-11-10T17:51:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]