[
  {
    "title": "Historic Myanmar bridge destroyed in fighting",
    "url": "https://www.theguardian.com/world/2025/aug/25/myanmar-historic-gokteik-bridge-destroyed",
    "image": "https://i.guim.co.uk/img/media/d2f0dfe5389320b8cf5639dcd91ee93e380b6b55/0_0_4151_3321/master/4151.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f3fb358ca2f7b9c336b8367f98a83f0a",
    "tag": "World",
    "date": "2025-08-25",
    "description": "The renowned Gokteik bridge was bombed on Sunday, with the ruling military junta and rebel forces blaming each other for its destruction",
    "body": "<div><p>A colonial-era bridge in <a target=\"_blank\" href=\"https://www.theguardian.com/world/myanmar\">Myanmar</a> that was once the world’s tallest railway trestle has been destroyed during fighting in the years-long conflict.</p><p>A <a target=\"_blank\" href=\"https://www.theguardian.com/global-development/2025/jan/31/myanmar-military-coup-anniversary\">civil war</a> has consumed Myanmar since a 2021 coup deposed the civilian government, with the military battling myriad pro-democracy guerrilla groups and ethnic armed organisations.</p><p>Representatives from the ruling military junta and anti-coup armed groups have blamed each other for the destruction of the landmark Gokteik bridge on Sunday.</p><p>In a video statement, junta spokesperson Zaw Min Tun claimed rebel factions, including the Ta’ang National Liberation Army (TNLA) and people’s defence forces groups had “bombed and destroyed” the bridge. A separate statement by the junta said the bridge had been “exploded with mines”.</p><figure><a target=\"_blank\" href=\"https://interactive.guim.co.uk/uploader/embed/2025/08/myanmarbridge-zip/giv-32554G7A7tjZFWo9L\">Map</a></figure><p>A TNLA spokesperson rejected this and accused the junta of bombing the bridge. “[The] Myanmar army tried to bomb our bases ... this morning by using drones. They bombed our troops, but their bomb also hit Gokteik bridge,” TNLA spokesperson Lway Yay Oo said.</p><p>In recent weeks, clashes have erupted between junta forces and TNLA fighters in the nearby towns of Nawnghkio and Kyaukme – though the junta claimed to have recaptured Nawnghkio in July.</p><figure><div><picture><source srcset=\"https://i.guim.co.uk/img/media/6d018411f220b3c58f260ae998c25af4750980d8/0_0_5000_3333/master/5000.jpg?width=620&amp;dpr=2&amp;s=none&amp;crop=none\" media=\"(min-width: 660px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 660px) and (min-resolution: 120dpi)\"></source><source srcset=\"https://i.guim.co.uk/img/media/6d018411f220b3c58f260ae998c25af4750980d8/0_0_5000_3333/master/5000.jpg?width=620&amp;dpr=1&amp;s=none&amp;crop=none\" media=\"(min-width: 660px)\"></source><source srcset=\"https://i.guim.co.uk/img/media/6d018411f220b3c58f260ae998c25af4750980d8/0_0_5000_3333/master/5000.jpg?width=605&amp;dpr=2&amp;s=none&amp;crop=none\" media=\"(min-width: 480px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 480px) and (min-resolution: 120dpi)\"></source><source srcset=\"https://i.guim.co.uk/img/media/6d018411f220b3c58f260ae998c25af4750980d8/0_0_5000_3333/master/5000.jpg?width=605&amp;dpr=1&amp;s=none&amp;crop=none\" media=\"(min-width: 480px)\"></source><source srcset=\"https://i.guim.co.uk/img/media/6d018411f220b3c58f260ae998c25af4750980d8/0_0_5000_3333/master/5000.jpg?width=445&amp;dpr=2&amp;s=none&amp;crop=none\" media=\"(min-width: 320px) and (-webkit-min-device-pixel-ratio: 1.25), (min-width: 320px) and (min-resolution: 120dpi)\"></source><source srcset=\"https://i.guim.co.uk/img/media/6d018411f220b3c58f260ae998c25af4750980d8/0_0_5000_3333/master/5000.jpg?width=445&amp;dpr=1&amp;s=none&amp;crop=none\" media=\"(min-width: 320px)\"></source><img alt=\"The Gokteik viaduct, a 300-meter long bridge. Photograph: Thierry Falise/LightRocket via Getty Images\" src=\"https://i.guim.co.uk/img/media/6d018411f220b3c58f260ae998c25af4750980d8/0_0_5000_3333/master/5000.jpg?width=445&amp;dpr=1&amp;s=none&amp;crop=none\" /></picture></div><figcaption><span><svg width=\"18\" height=\"13\"></svg></span><span>The Gokteik viaduct, a 300-meter long bridge. Photograph: Thierry Falise/LightRocket via Getty Images</span> Photograph: Thierry Falise/LightRocket/Getty Images</figcaption></figure><p>Spanning 300 metres and standing 102 metres above a gorge, the structure is the highest bridge in Myanmar and was the tallest railway trestle in the world when it opened in 1901 during the British colonial era.</p><p>Videos and photos on social media showed the bridge partly collapsed and damaged.</p><p>The bridge is situated at the border of the Nawnghkio and Kyaukme townships in northern Shan State. It is part of the Mandalay-Lashio railway line and draws a number of tourists.</p><p>Myanmar’s junta is preparing for a <a target=\"_blank\" href=\"https://www.theguardian.com/world/2025/jul/31/myanmar-junta-ends-state-emergency-prepares-elections\">December election</a> that is being boycotted by opposition groups and <a target=\"_blank\" href=\"https://www.theguardian.com/world/2025/mar/10/myanmar-juntas-promise-of-elections-denounced-as-sham-by-experts\">criticised</a> by international monitors.</p><p>Analysts have predicted rebels will stage offensives around the election as a sign of their opposition.</p><p><em>With Agence France-Presse</em></p></div>"
  },
  {
    "title": "Amsterdam 'serial sex predator' fears after girl, 17, was stabbed to death 'by asylum seeker who had also raped woman and assaulted a third'",
    "url": "https://www.dailymail.co.uk/news/article-15031793/Amsterdam-serial-sex-predator-fears-girl-17-stabbed-death-asylum-seeker-raped-woman-assaulted-third.html",
    "image": "https://i.dailymail.co.uk/1s/2025/08/25/09/101517247-0-image-a-17_1756109884826.jpg",
    "tag": "World",
    "date": "2025-08-25",
    "description": "It comes as a wave of national fury has swept the Netherlands after the lifeless body of a teenager, Lisa, was discovered by police in a roadside ditch in the early hours of Wednesday morning.",
    "body": "<div><p>Dutch cops fear more victims may come forward in Amsterdam after an asylum seeker was arrested over the murder of a 17-year-old girl, the rape of a woman days earlier and the assault of a third person.</p><p>It comes as a wave of national fury has swept the Netherlands after the lifeless body of a teenager, Lisa, was discovered by police in a roadside ditch in the early hours of Wednesday morning. </p><p>The 22-year-old murder suspect was arrested for the brutal rape of a woman on August 15 in Weesperzijde, and the assault of another woman on August 10 in the same place.</p><p>He was detained by a SWAT team at a site run by the Central Agency for the Reception of Asylum Seekers (COA) on August 21 and has been remanded in custody for two weeks.</p><p>He is of Nigerian descent, according to Het Parool. </p><p>Police believe the three incidents could be connected and have appealed for more potential victims to come forward.</p><p>On Wednesday morning at around 3:30 am local time, Lisa parted with her friends and began her cycle ride home on an <a target=\"_blank\" href=\"https://www.dailymail.co.uk/news/e-bikes/index.html\">electric bike</a> from the centre of Amsterdam to the nearby town of Abcoude. </p><p>While on her way home from Leidseplein, she noticed someone following her and she called the emergency 112 number for help.</p><div>  <p>The suspected killer of 17-year-old Lisa caught on CCTV in Duivendrecht</p></div><div>  <p>On Sunday, around 500 people participated in a March Against Femicide in Rotterdam in the wake of Lisa's death, carrying signs such as 'She had dreams, no grave needed' and 'Not all men, but always men'</p></div><div>  <p>A sea of flowers at the village church in memory of Lisa, who was found dead along Holterbergweg in Duivendrecht</p></div><p> She was then brutally attacked just south of the secondary school she had just recently graduated from, the Spinoza20First in Amsterdam-Oost.</p><p>When the police arrived at the scene at 4:15 am after a call from the public, Lisa was found dead with stabs wounds on her body including her neck.</p><p>She was discovered in a ditch near the water’s edge along the Holterbergweg, close to the Johan Cruijff Arena stadium and concert venue Ziggo Dome. </p><p>Now, a fourth woman has said she was chased by a man on the same day Lisa was stabbed to death near Holterbergweg in Duivendrecht. </p><p>'I was on my way home from work, and when I turned a corner, I saw a man who looked normal, but he started running after me,' she told De Telegraaf.</p><p>'I thought he was going to hurt me or take my electric bike or phone. Luckily, he didn't overtake me, but I'm still shaking with fear.'</p><p>The violent murder of the teenager has triggered widespread outrage and a nationwide 'reclaim the night' campaign, after a <a target=\"_blank\" href=\"https://www.dailymail.co.uk/news/the-netherlands/index.html\">Dutch</a> actress and author wrote a poem that went viral about Lisa's final moments cycling home.</p><p><span>In a post shared on her </span><a target=\"_blank\" href=\"https://www.dailymail.co.uk/tvshowbiz/instagram/index.html\">Instagram</a><span>, Nienke Gravemade wrote: 'The red bag. I keep thinking about that red bag. How it dangled from her handlebars as she drove through the night. A night that belonged to her too. </span></p>\n    <div>  <p>Police are searching for two people captured on CCTV who may have witnessed the attack on Lisa on August 20: a scooter rider (left) and the occupants of a Biro microcar (right)</p></div><div>  <p>Crowds at an Ajax football match at the Johan Cruijff Arena stood in silence in memory of the teenager and held banners with her name</p></div><p>'I claim the night. I claim the streets. I demand that the fear be lifted.' </p><p>Alongside the poem, the author posted the hashtag #rechtopdenacht or 'right to the night'.</p><p>A fundraising campaign called 'We claim the night' has raised nearly €400,000 (£346,500) as of Monday morning. </p><p>The victim was described by police as having medium-length blonde hair. She was wearing a light grey hoodie, light grey trousers and black Adidas trainers when she was attacked.</p><p>She also had a red handbag hanging from the handlebars of her bicycle which was from Cowboy with a light grey frame and black chain lock.</p><p>A statement from her grief-stricken family said: 'Our hearts are broken. We hope we can mourn Lisa's loss together in peace and privacy. We are immense supported by the love and sympathy from family, friends, and fellow villagers, and we want to express our gratitude for this.'</p><p>Dozens of tips have been received but the police are specifically appealing to at least three potential witnesses spotted on CCTV around the time of the attack to piece together what happened to Lisa on her journey home.</p><p>The potential witnesses include a scooter rider, the occupants of a light-coloured delivery van, and the occupants of a Biro microcar who were driving on the road near where her body was found. </p><div>  <p>Flowers at the spot where 17-year-old Lisa was found dead along Holterbergweg in Duivendrecht</p></div><div>  <p>The village of Abcoude has been devastated by the horrific murder of the teenager</p></div><div>  <p>A fundraising campaign called 'We claim the night' has raised nearly €400,000 (£346,500) as of Monday morning</p></div><div>  <p>Chief Public Prosecutor René de Beukelaer, Amsterdam Mayor Femke Halsema, and Amsterdam Police Chief Peter Holla address the press about the death of 17-year-old Lisa from Abcoude</p></div><div>  <p>Flowers in memory of the 17-year-old girl who was found dead along a roadside in Duivendrecht</p></div><div>  <p>Police are investigating the scene where a 17-year-old girl was found dead along a roadside in Duivendrecht</p></div><div>  <p>Participants in a weekly protest march against femicide in Rotterdam where the activists want to raise awareness of the problem of domestic violence</p></div><p>A large portion of the victim's cycling route is covered by video, but clear footage of the last seven minutes - between the Breitnertoren (near Amstel Station) and Holterbergweg - are still missing.</p><p>'What happened between the victim's departure from Leidseplein and the discovery of her body is still unclear,' the force said in a statement. </p><p>'We are urgently seeking information about her last cycling route and are calling on three specific road users to come forward. Do you know anything, or were you one of them? Contact the police immediately.'</p><p>Forensic investigators are using metal detectors and police sniffer dogs to collect evidence at the scene where the teenager was killed by 'serious violence', officers said.</p><p>Bunches of flowers have been laid on a corner where the tragedy unfolded.</p><p>The Mayor of Amsterdam, Femke Halsema, condemned the attack: 'This is every woman's greatest fear. Thousands of women are rightly demanding their night back.</p><p>'Enjoying freedom should be possible without fear. Safety is not a given. There's no blueprint for addressing this.'</p><p>The village of Abcoude has been devastated by the horrific murder of the teenager.</p><div>  <p>'The loss of Lisa is incomprehensible to her family and has brought them intense grief,' the victims' services organisation Names de Familie said</p></div><div>  <p>A person bikes by an improvised memorial for 17-year-old Lisa from Abcoude, at Holterbergweg, where she was found dead, in Amsterdam</p></div><div>  <p>The new headteacher of Spinoza20First, Kimberley Kaizer, told RTL Nieuws that the school is looking for an appropriate way to hold a memorial for the teenager</p></div><div>  <p>Lisa's family have asked for her surname and photograph not to be circulated publicly as they grieve the loss of the 17 year old <br /></p></div><div>  <p>The March Against Femicide has been occurring every week since early August following the killing of two women in two days the previous month - both allegedly by their partners or ex-partners</p></div><p>'Not that everyone talks about it openly, but you can just see that people know what a terrible thing happened,' 63-year-old Cees told De Telegraaf.</p><p>'And actually, we still don't know much, because who's crazy enough to be responsible for this? Is it someone from here? I hope that will be clarified soon.'</p><p>On Sunday, around 500 people participated in a March Against Femicide in Rotterdam in the wake of Lisa's death, carrying signs such as 'She had dreams, no grave needed' and 'Not all men, but always men'.</p><p>The protest, organised by Dutch Feminist group Dolle Mina Rotterdam, has been occurring every week since early August following the killing of two women in two days the previous month - both allegedly by their partners or ex-partners.</p><p>Crowds at an Ajax football match at the Johan Cruijff Arena stood in silence in memory of the teenager and held banners with her name on Sunday.</p><p>She was a supporter of the football club and her body was discovered near its grounds. </p><p>Lisa's family have asked for her surname and photograph not to be circulated publicly. 'The loss of Lisa is incomprehensible to her family and has brought them intense grief,' the victims' services organisation Names de Familie said.</p><p>The new headteacher of Spinoza20First, Kimberley Kaizer, told RTL Nieuws that the school is looking for an appropriate way to hold a memorial for the teenager.</p><div>  <p>Dozens of tips have been released but the police are appealing to at least three potential witnesses spotted on CCTV around the time of the attack to piece together what happened to Lisa on her journey home</p></div><p>Just before the summer, she had graduated from the pre-university programme. </p><p>'We are waiting to hear what the family's wishes are; once we have that clear, we will take action. There will be time to reflect together,' Kaizer said. 'We want to adequately care for the staff and students, and provide them with space to process this news,' she added.</p><p>Following the attack, hard-right nationalist politicians such as Geert Wilders, the leader of the Freedom Party (PVV), pledged to close the Netherlands to asylum seekers.</p><p>The Netherlands faces a snap election on October 29 after Wilders pulled his party out of the Conservative coalition following a dispute about the government’s position on asylum.</p><p>He toppled the coalition after accusing ministers of not being strong enough against illegal or criminal asylum seekers, and demanded they commit to a 10-point plan on migration. </p></div>"
  },
  {
    "title": "ASEAN Weekly Disaster Update Week 341 | 18 August - 24 August 2025",
    "url": "https://reliefweb.int/report/philippines/asean-weekly-disaster-update-week-341-18-august-24-august-2025",
    "image": "https://reliefweb.int/sites/default/files/styles/large/public/previews/81/ee/81ee6a98-b134-40ec-b0f1-51be34d91e72.png",
    "tag": "World",
    "date": "2025-08-25",
    "description": "Infographic in English on Philippines about Earthquake, Flood and more; published on 25 Aug 2025 by AHA Centre",
    "body": "<div><p><strong>REGIONAL SUMMARY:</strong></p>\n<p>During the thirty-fourth week of 2025, a total of 22 disaster events were recorded across ASEAN region, including an earthquake, droughts, floods, landslides, storms, and wind-related incidents affecting Indonesia, the Philippines, Thailand, and Viet Nam. In Indonesia, <em>Badan Nasional Penanggulangan</em> <em>Bencana</em> (<a href=\"https://bnpb.go.id/\" target=\"_blank\">BNPB</a>) reported incidents in Jakarta, West Java, Central Java, East Java, Yogyakarta, Central Kalimantan, and Central Sulawesi. In the Philippines, the National Disaster Risk Reduction and Management Council (<a href=\"https://ndrrmc.gov.ph/\" target=\"_blank\">NDRRMC</a>) reported flooding in Regions I, II, V, XII, CAR, NCR, and BARMM, caused by Tropical Cyclone KAJIKI and the Southwest Monsoon. Meanwhile, in Thailand, the Department of Disaster Prevention and Mitigation (<a href=\"https://www.disaster.go.th/\" target=\"_blank\">DDPM</a>) documented flooding, storms, and strong winds across Chiang Rai, Phetchabun, Chiang Mai, and Phra Nakhon Si Ayutthaya. In Viet Nam, Disaster and Dyke Management Authority (<a href=\"https://phongchongthientai.mard.gov.vn/Pages/Trang-chu.aspx\" target=\"_blank\">VDDMA</a>) reported flooding and landslides affecting Son La, Thai Nguyen, Bac Ninh, and Dong Nai provinces.</p>\n<p><strong>HIGHLIGHT:</strong></p>\n<p>On 19 August, Low Pressure Area (LPA) was monitored outside the Philippine Area of Responsibility (PAR) and subsequently entered the PAR on 20 August. This LPA later intensified into a tropical depression, internationally named KAJIKI (locally named as “Isang” in the Philippines), and made landfall over Casiguran, Aurora. KAJIKI slightly decelerated as it traversed Quirino Province and moved west-northwestward across Ifugao Province. It then emerged over the waters west of the Ilocos Region, traversed the West Philippine Sea, and exited the PAR on 23 August. According to <a href=\"https://ndrrmc.gov.ph/\" target=\"_blank\">NDRRMC</a>, as of 25 August, KAJIKI, in and the Southwest Monsoon, had affected approximately 11.4K families (50.7K) persons, across Regions II, CAR, V, XII, and BARMM. More than 30 flooding incidents were reported in the NCR and BARMM. Approximately 1.2K people are currently staying in 6 evacuation centres, while 24.1K people are taking shelter with relatives or in locations outside designated evacuation facilities.</p>\n<p>KAJIKI continued moving west-northwestward toward mainland Southeast Asia. According to the <a href=\"https://nchmf.gov.vn/kttvsite/vi-VN/1/tin-bao-khan-cap-con-bao-so-5-post50550.html\" target=\"_blank\">NCHMF</a>, KAJIKI (referred to locally in Viet Nam as Storm No. 5), at 1600 HRS UTC+7 was located over the coastal waters of Nghe An – Ha Tinh and was moving at a speed of 15–20 km/h in a west-northwest direction. According to <a href=\"http://phongchongthientai.mard.gov.vn/Pages/thu-tuong-chinh-phu-yeu-cau-tiep-tuc-trien-khai-quyet-liet-cong-tac-ung-pho-bao-so-5.aspx\" target=\"_blank\">VDDMA</a>, the Government of Viet Nam had issued Official Dispatches No. 141/CD-TTg (dated 22 August 2025) and No. 143/CD-TTg (dated 23 August 2025), directing authorities to strengthen preparedness and response measures for KAJIKI and the associated flooding, to ensure the safety of lives and minimise damage to properties. The <a href=\"https://ahacentre.org/\" target=\"_blank\">AHA Centre</a> continues to closely monitor the situation and remains in close coordination with affected and potentially affected ASEAN Member States, stands ready to provide support if required.</p>\n<p><strong>HYDRO-METEO-CLIMATOLOGICAL:</strong></p>\n<p>For the past week, data from the ASEAN Specialised Meteorological Centre (<a href=\"http://asmc.asean.org/asmc-satellite-derived-rainfall/\" target=\"_blank\">ASMC</a>) indicated high 7-day average rainfall concentrated across Brunei Darussalam, Cambodia, Indonesia, Lao PDR, Malaysia, Myanmar, the Philippines, Singapore, Thailand, and Viet Nam. In addition to Tropical Cyclone KAJIKI, which is currently affecting the ASEAN region, another Low Pressure Area (INVEST 93W) has been observed approximately 150 km east of Eastern Samar, the Philippines, and is being closely monitored for potential development into a significant tropical cyclone (<a href=\"https://bagong.pagasa.dost.gov.ph/\" target=\"_blank\">PAGASA</a>, <a href=\"https://www.metoc.navy.mil/jtwc/jtwc.html\" target=\"_blank\">JTWC</a>).</p>\n<p><strong>GEOPHYSICAL:</strong></p>\n<p>Six (6) significant earthquakes (M&gt;5.0) were recorded by Indonesia’s <em>Badan Meteorologi, Klimatologi, dan Geofisika</em> (<a href=\"https://www.bmkg.go.id/gempabumi\" target=\"_blank\">BMKG</a>), Myanmar’s Department of Meteorology and Hydrology (<a href=\"https://www.moezala.gov.mm/\" target=\"_blank\">DMH</a>), and Thai Meteorological Department (<a href=\"https://earthquake.tmd.go.th/\" target=\"_blank\">TMD</a>). Mount Dempo (alert level II), Semeru (alert level II), Lewotobi Laki-laki (alert level III), Ibu (alert level II), and Ibu (alert level II) in Indonesia, and Kanlaon (alert level 2), Taal (alert level 1), Mayon (alert level 1), and Bulusan (alert level 1) volcanoes in the Philippines reported recent volcanic activity according to <em>Pusat Vulkanologi dan Mitigasi</em> <em>Bencana</em> <em>Geologi</em> (<a href=\"https://vsi.esdm.go.id/\" target=\"_blank\">PVMBG</a>) and the Philippines Institute of Volcanology and Seismology (<a href=\"https://www.phivolcs.dost.gov.ph/index.php/volcano-hazard/volcano-bulletin2\" target=\"_blank\">PHIVOLCS</a>).</p>\n<p><strong>OUTLOOK:</strong></p>\n<p>According to the ASEAN Specialised Meteorological Centre (<a href=\"http://asmc.asean.org/subseasonal-weather-outlook-7-20-february-2022/\" target=\"_blank\">ASMC</a>), for the coming week, warmer than usual temperatures are predicted over parts of the western Maritime Continent. For the regional assessment of extreme weather events, there is a small increase in chance of extreme hot conditions to occurs over southern Peninsular Malaysia, northern Sumatra. ENSO neutral conditions are present.</p>\n<p><strong>Sources:</strong></p>\n<p>ASEAN Disaster Monitoring &amp; Response System (DMRS); ASEAN Specialised Meteorological Centre (ASMC); Joint Typhoon Warning Centre (JTWC);</p>\n<p>Indonesia: BNPB, BMKG, PVMBG;</p>\n<p>Myanmar: DMH;</p>\n<p>Philippines: NDRRMC, PAGASA, PHIVOLCS;</p>\n<p>Thailand: DDPM, TMD;</p>\n<p>Viet Nam: VDDMA, NCHMF;</p>\n<p>Various news agencies.</p>\n</div>"
  },
  {
    "title": "Journalists killed in Israeli strike on Gaza's Nasser hospital",
    "url": "https://www.nbcnews.com/world/gaza/israel-strikes-gaza-nasser-hospital-journalists-killed-rescue-workers-rcna226926",
    "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-08/250825-nasser-hospital-mb-0924-1342b3.jpg",
    "tag": "World",
    "date": "2025-08-25",
    "description": "Israeli strikes on a hospital in southern Gaza killed four journalists Monday, including a freelancer who worked for The Associated Press, according to health officials",
    "body": "<div><p>Israeli strikes on a hospital in southern <a href=\"https://www.nbcnews.com/world/gaza/famine-declared-gaza-city-israel-military-takeover-hamas-ceasefire-rcna225776\" target=\"_blank\">Gaza</a> killed four journalists Monday, including a freelancer who worked for The Associated Press, according to health officials.</p><p>Mariam Dagga, 33, a visual journalist, freelanced for the AP during the war, as well as other news outlets. The AP said in a statement that it was shocked and saddened to learn of Dagga’s death, along with those of other journalists.</p><p>In all, 19 people were killed in the strike on Nasser Hospital, according to Zaher al-Waheidi, head of the Gaza Health Ministry’s records department.</p><p>The Israeli military said its troops carried out a strike in the area of Nasser Hospital in Khan Younis and that it would conduct an investigation into the incident. The military said it “regrets any harm to uninvolved individuals and does not target journalists as such.”</p><figure><picture><source media=\"(min-width: 1000px)\" srcset=\"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-560w,f_avif,q_auto:eco,dpr_2/rockcms/2025-08/250825-nasser-hospital-mb-0924-1342b3.jpg 2x, https://media-cldnry.s-nbcnews.com/image/upload/t_fit-560w,f_auto,q_auto:best/rockcms/2025-08/250825-nasser-hospital-mb-0924-1342b3.jpg 1x\"></source><source media=\"(min-width: 320px)\" srcset=\"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_avif,q_auto:eco,dpr_2/rockcms/2025-08/250825-nasser-hospital-mb-0924-1342b3.jpg 2x, https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/rockcms/2025-08/250825-nasser-hospital-mb-0924-1342b3.jpg 1x\"></source><img src=\"https://media-cldnry.s-nbcnews.com/image/upload/t_fit-760w,f_auto,q_auto:best/rockcms/2025-08/250825-nasser-hospital-mb-0924-1342b3.jpg\" alt=\"Israeli airstrike on southern Gaza hospital kills 8, health ministry says\" /></picture><figcaption><span>Palestinian medics evacuate an injured man following Israeli strikes on Nasser hospital in southern Gaza on Monday.</span><span>AFP - Getty Images</span></figcaption></figure><p>The Israel-Hamas war has been one of the bloodiest conflicts for media workers, with at least 192 journalists killed in Gaza in the 22-month conflict, according to the Committee to Protect Journalists. Comparatively, 18 journalists have been killed so far in Russia’s war in Ukraine, according to the CPJ.</p><p>Dagga, who has a 12-year-old son who was evacuated from Gaza earlier in the war, frequently based herself at Nasser, most recently reporting on the hospital’s doctors struggling to save children from starvation. Independent Arabia, the Arabic language version of the British Independent, said Daqqa had also worked with them.</p><p>“We are doing everything we can to keep our journalists in Gaza safe as they continue to provide crucial eyewitness reporting in difficult and dangerous conditions,” the AP said.</p><p>Al Jazeera confirmed that its journalist Mohammed Salam was also among those who were killed in the Nasser strike. Reuters reported that its contractor cameraman Hussam al-Masri was killed and its contractor photographer Hatem Khaled wounded. It was not immediately clear who the fourth journalist killed was.</p><p>Thibaut Bruttin, the director general of Reporters Without Borders, said press freedom advocates had never seen such a severe step backward for reporters’ safety. He noted that journalists have been killed both in indiscriminate strikes and in targeted attacks that Israel’s military has acknowledged carrying out.</p><p>“They are doing everything they can to silence independent voices that are trying to report on Gaza,” Bruttin said.</p><p>In some cases, such as with Al Jazeera correspondent Anas al-Sharif, who was targeted and killed by Israel earlier this month, Israel has accused journalists in Gaza of being part of militant groups. Israel’s military asserted that al-Sharif had led a Hamas cell — an allegation that Al Jazeera and al-Sharif previously dismissed as baseless.</p><p>Aside from rare guided tours, Israel has barred international media from covering the war. News organizations instead rely largely on Palestinian journalists in Gaza — as well as residents — to show the world what is happening there. Israel often questions the affiliations and biases of Palestinian journalists but doesn’t permit others in.</p><p>Many of the journalists working in Gaza are facing the same struggles to find food, for themselves and their families, as the people they are covering.</p><p>In one of Dagga’s last social media posts on Sunday, she published a selfie of herself leaning against a wall.</p></div>"
  }
]