[
  {
    "title": "EU forces free crew from tanker seized by Somali pirates",
    "url": "https://www.bbc.com/news/articles/cyv8137q060o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/36f4/live/587418e0-bc04-11f0-90b3-259a136a1615.jpg",
    "tag": "World",
    "date": "2025-11-07T18:14:17.000Z",
    "description": "EU forces free crew after Somali pirate attack on tanker 1 day agoRachel HaganEuropean Union Naval ForceThe Hellas Aphrodite was seized by pirates on ",
    "body": "EU forces free crew after Somali pirate attack on tanker 1 day agoRachel HaganEuropean Union Naval ForceThe Hellas Aphrodite was seized by pirates on ThursdayEuropean Union naval forces have rescued 24 sailors from a Maltese-flagged oil tanker that was attacked by pirates off the coast of Somalia.The Hellas Aphrodite, carrying petrol from India to South Africa, was seized on Thursday when armed pirates opened fire with machine guns and rocket-propelled grenades before boarding the vessel. The crew locked themselves inside a fortified citadel while the attackers took control of the ship.A Spanish warship, the ESPS Victoria, operating under the EU's anti-piracy mission Operation Atalanta, reached the tanker on Friday afternoon. Special forces boarded the vessel and found all 24 crew members unharmed.\"The crew is safe and no injuries have been reported. Throughout the incident, they remained in the citadel in direct contact with Atalanta,\" the EU mission said, adding that a \"show of force\" had prompted the pirates to abandon the ship before the warship arrived.It added that the threat risk in the area \"remains critical\" as the pirates are still in the area. The rescue operation involved a helicopter, drone and surveillance aircraft. Just hours earlier, another ship in the same area was approached by a small speedboat but managed to evade it.It is the latest in a spate of attacks that have created concern about a resurgence of piracy in the area. Such activity had declined when international naval patrols and security measures were introduced after peaking more than a decade ago.However, attacks by Yemen's Houthi rebels on ships in the Red Sea, which have been carried out for the past two years, have led vessels to be diverted through East Africa's Indian Ocean - creating new opportunities for Somali gangs.There were seven reported incidents of piracy that took place off the coast of Somalia last year, according to the International Maritime Bureau - including three hijackings. It reported only one incident of piracy in 2023. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "EU forces free crew from tanker seized by Somali pirates",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/36f4/live/587418e0-bc04-11f0-90b3-259a136a1615.jpg"
      ],
      "datePublished": "2025-11-07T18:14:17.000Z",
      "dateModified": "2025-11-07T18:14:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fire at Turkey perfume warehouse kills six people",
    "url": "https://www.bbc.com/news/articles/c0kprpy26k6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e8df/live/0aba36d0-bc8a-11f0-8d15-f555245abf51.jpg",
    "tag": "World",
    "date": "2025-11-08T14:54:26.000Z",
    "description": "13 hours agoAndré Rhoden-PaulKocaeli Metropolitan MunicipalityA fire at a perfume warehouse in north-western Turkey has killed six people.The blaze br",
    "body": "13 hours agoAndré Rhoden-PaulKocaeli Metropolitan MunicipalityA fire at a perfume warehouse in north-western Turkey has killed six people.The blaze broke out at 09:05 local time on Saturday in Dilovasi, Kocaeli Province's governorship said. The province's governor Ilhami Aktas told Turkish outlet CNN Turk four people were in hospital, with one in critical condition being treated at a burns unit. The cause of the fire is still unclear. Turkish President Recep Tayyip Erdogan offered his \"deepest condolences to the families\" and said the government's labour ministry has started an investigation.Justice Minister Yilmaz Tunc said a judicial investigation had been launched and three people have been detained. Images shown by Turkish media show firefighters extinguishing large flames.\"There was an explosion,\" a witness told news outlet Sabah. \"I got up, looked down; the man was burning... I extinguished the fire, then I heard shouting. When I looked towards the sound, children and women were screaming inside the factory.\"Kocaeli Metropolitan MunicipalityMayor of Kocaeli Metropolitan Municipality is shown the fire-ravaged buildingThe blaze broke out in the Mimar Sinon neighbourhood of Dilovasi, an industrial town hosting numerous depots and factories that is located around 70 kilometres (43 miles) from Istanbul.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fire at Turkey perfume warehouse kills six people",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e8df/live/0aba36d0-bc8a-11f0-8d15-f555245abf51.jpg"
      ],
      "datePublished": "2025-11-08T14:54:26.000Z",
      "dateModified": "2025-11-08T14:54:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thousands take to Lisbon streets over Portugal's proposed labour laws",
    "url": "https://www.bbc.com/news/articles/cpd257jd3zzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/82c4/live/7854ca70-bce9-11f0-b29f-75619de23640.jpg",
    "tag": "World",
    "date": "2025-11-08T22:07:31.000Z",
    "description": "6 hours agoGeorge WrightGetty ImagesTens of thousands have taken to the streets of Portugal's capital, Lisbon, to protest against proposed labour laws",
    "body": "6 hours agoGeorge WrightGetty ImagesTens of thousands have taken to the streets of Portugal's capital, Lisbon, to protest against proposed labour laws which they say threaten workers' rights.The centre-right government wants to make it easier for employers to fire people,  outsource work to other companies, and limit some types of compassionate leave, including cutting bereavement leave for women who suffer miscarriages.It says the measures are needed to improve job flexibility and increase productivity in one of western Europe's poorest countries.The head of Portugal's largest union, CGTP, called the reforms \"one of the greatest attacks ever made against workers\" in the country and announced a general strike for 11 December.The bill is likely to pass in parliament with support from far-right party Chega.The union told Reuters that around 100,000 protesters filled Lisbon's main avenue, while the Associated Press also reported tens of thousands of people were present. No police estimate was available.Speaking at the protest, Miriam Alves, 31, a worker at a medical device company, told Reuters that reforms are \"clearly a step backward in working conditions and could lead to a complete lack of job security\".Archive technician Madalena Pena, 34, said the government was reversing labour rights \"in an unfair, subtle, and cunning way, without having said anything before the election\" in May.CGTP general secretary Tiago Oliveira announced the strike for next month at the protest.On the proposed changes, he said: \"If implemented, it would be a real setback in the lives of each and every one of us.\"Protesters also wanted higher wages. Official data shows more than 50% of workers earned less than 1,000 euros (£879) per month last year. The minimum wage is only 870 euros (£764).",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thousands take to Lisbon streets over Portugal's proposed labour laws",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/82c4/live/7854ca70-bce9-11f0-b29f-75619de23640.jpg"
      ],
      "datePublished": "2025-11-08T22:07:31.000Z",
      "dateModified": "2025-11-08T22:07:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US cleaning woman shot and killed after arriving at wrong home",
    "url": "https://www.bbc.com/news/articles/ce3k5qv21g1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b02f/live/c34eae70-bced-11f0-bef8-2995471bb63c.png",
    "tag": "World",
    "date": "2025-11-08T22:00:13.000Z",
    "description": "6 hours agoCBSMaria Florinda Rios Perez was fatally shot after arriving at the wrong home for a house-cleaning appointment US officials are looking in",
    "body": "6 hours agoCBSMaria Florinda Rios Perez was fatally shot after arriving at the wrong home for a house-cleaning appointment US officials are looking into whether to file charges against an Indiana homeowner who shot and killed a house cleaner who mistakenly showed up at the wrong address.Police say they found Maria Florinda Rios Perez dead in her husband's arms on the front porch of a home on Wednesday shortly before 0700 local time (12:00 GMT). Authorities had been responding to a call about a possible home invasion in the Indianapolis suburb of Whitestown. The two did not appear to have entered the home, police said in a statement. They have formally submitted the case to the Boone County Prosecutor's Office for review to determine whether criminal charges will be brought in the case. Police have not identified the people in the home or who fired the shot, saying in a statement on Friday that it is a \"complex, delicate, and evolving case, and it would be both inappropriate and potentially dangerous to disclose that information\". They urged patience, warning of a \"concerning spread of misinformation online\" about the case.Mauricio Velazquez, told CBS News, the BBC's US partner, that he wanted justice for his 32-year-old wife. News reports say that she was a mother of four and originally from Guatemala. In an interview with CBS affiliate WTTV, Mr Velazquez said the bullet came right through the door of the home. \"They should've called the police first instead of just shooting out of nowhere like that,\" he said through an interpreter.CBSMauricio Velazquez said the bullet that killed his wife came through the door of the home they went to early on WednesdayBoone County prosecutor Kent Eastwood told The Indianapolis Star that the case is complex due to the language of the state's stand-your-ground law.Stand-your-ground laws are in place in many US states and most permit an individual to protect themselves with the use of reasonable force, including deadly force, to prevent death or great bodily harm.Similar incidents have made headlines across the US in recent years. In 2023, Ralph Yarl, who was then 16, was shot twice after ringing the doorbell of the wrong home in Missouri. Andrew Lester, who was in his 80s, pleaded guilty and died while awaiting sentencing. In New York, 20-year-old Kaylin Gillis died after being shot upon entering the wrong driveway. The homeowner who shot her is now serving a 25-year sentence. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US cleaning woman shot and killed after arriving at wrong home",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b02f/live/c34eae70-bced-11f0-bef8-2995471bb63c.png"
      ],
      "datePublished": "2025-11-08T22:00:13.000Z",
      "dateModified": "2025-11-08T22:00:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Typhoon Fung Wong bears down on the Philippines after deadly Kalmaegi",
    "url": "https://www.bbc.com/news/articles/cq509yj82y8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3665/live/41b39b30-bca9-11f0-9886-b3acf9644cc5.jpg",
    "tag": "World",
    "date": "2025-11-09T03:18:08.000Z",
    "description": "Storm declared 'super typhoon' as it hits Philippines 57 minutes agoKathryn Armstrong and Lulu Luo,Aurora, Philippines AFP via Getty ImagesDozens of f",
    "body": "Storm declared 'super typhoon' as it hits Philippines 57 minutes agoKathryn Armstrong and Lulu Luo,Aurora, Philippines AFP via Getty ImagesDozens of families in Remedios T Romualde, on the island of Mindanao, are among those who have been evacuated ahead of the typhoon's arrivalA storm bearing down on the Philippines has been upgraded to super typhoon status, with one outlying island region already experiencing \"life-threatening conditions\". Typhoon Fung Wong will bring sustained winds of 185 km/h (155mph) and torrential rain to several areas on Sunday, according to the country's meteorological service (Pagasa). Catanduanes, an island off the coast of Luzon, was the first part of the Philippines to be directly hit by the storm on Sunday morningTyphoon Fung Wong - known locally as Uwan - comes days after an earlier storm, Kalmaegi, left a trail of destruction and nearly 200 dead.Several schools have either cancelled classes on Monday or moved them online, while Philippine Airlines has cancelled a number of local flights ahead of its arrival.Typhoon Fung Wong is expected to weaken rapidly once it makes landfall but will likely remain a typhoon as it travels over Luzon. Eastern parts of the Philippines have already begun experiencing heavy rains and winds, a Pagasa official said in a briefing on Saturday evening local time.While much of the country is expected to be impacted, there are particular concerns about those areas that could take a direct hit, including Catanduanes.Residents there, as well as in other low-lying and coastal areas, had been urged to move to higher ground by Sunday morning.In the Aurora region, in the east of the country's largest island, BBC News spoke to Hagunoy, 21, who works at one of the dozen hotels which line the coast in Sabang.He said local police had repeatedly visited in recent days to ensure all guests were evacuated ahead of the storm.The hotels were all deserted on Sunday morning as residents braced for the typhoon to arrive, which was expected at around midnight.While the tide had risen sharply, Hagunoy said we would stay as long as he can to guard the property, before riding his motorbike home to safety. Staff had secured the gates and tied windows shut with rope to try to stop the glass from shattering in the wind.How do hurricanes or typhoons form and are they getting stronger?Typhoon Fung Wong has also forced the suspension of rescue operations following the passage of Kalmaegi, one of the strongest typhoons this year.Heavy rainfall sent torrents of mud down hillsides and into residential areas. Some poorer neighbourhoods were obliterated by the fast-moving flash floods.At least 204 people are now known to have died in the Philippines as a result of the earlier storm, while more than 100 are still missing. Five people also died in Vietnam, where strong winds uprooted trees, tore off roofs, and smashed large windows.Watch: Cars pile up on Philippines streets after major flooding from Typhoon KalmaegiThe Philippines government declared a state of calamity across the country after Typhoon Kalmaegi and in preparation for the coming storm.It has given government agencies more power to access emergency funds and fast-track the procurement and delivery of essential goods and services to those in need.For some Filipinos, the devastation wrought by Typhoon Kalmaegi earlier this week has left them even more anxious about the storm to come. \"We decided to evacuate because the recent typhoon brought floods in our area, and now I just want to keep my family safe,\" Norlito Dugan told the AFP news agency.He is among those who have taken shelter in a church in the city of Sorsogon in Luzon.Another resident, Maxine Dugan said: \"I'm here because the waves near my house are now huge, I live near the shore. The winds there are now very strong, and the waves are huge.\"The Philippines is one of the most vulnerable countries in the world to tropical cyclones, due to its location on the Pacific Ocean where such weather systems form.About 20 tropical cyclones form in that region every year, half of which impact the country directly.Climate change is not thought to increase the number of hurricanes, typhoons and cyclones worldwide.However, warmer oceans coupled with a warmer atmosphere - fuelled by climate change - have the potential to make those that do form even more intense. That can potentially lead to higher wind speeds, heavier rainfall, and a greater risk of coastal flooding.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Typhoon Fung Wong bears down on the Philippines after deadly Kalmaegi",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3665/live/41b39b30-bca9-11f0-9886-b3acf9644cc5.jpg"
      ],
      "datePublished": "2025-11-09T03:18:08.000Z",
      "dateModified": "2025-11-09T03:18:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US authorities ground cargo plane model after Kentucky air disaster ",
    "url": "https://www.bbc.com/news/articles/cx2pr5y7p90o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ae88/live/91740bf0-bc81-11f0-ae46-bd64331f0fd4.png",
    "tag": "World",
    "date": "2025-11-09T03:12:21.000Z",
    "description": "1 hour agoOttilie Mitchell and Harry SekulichUS aviation authorities have ordered that all models of a cargo plane which crashed mid-takeoff in Kentuc",
    "body": "1 hour agoOttilie Mitchell and Harry SekulichUS aviation authorities have ordered that all models of a cargo plane which crashed mid-takeoff in Kentucky on Tuesday be grounded.It comes after a Boeing MD-11 aircraft operated by UPS burst into flames on the runway of Louisville International Airport before colliding into neighbouring businesses, killing 14 people. The American delivery firm had earlier said it would not operate the planes pending an ongoing investigation, with FedEx then following suit.Now the Federal Aviation Administration (FAA) has issued a formal notice banning all MD-11 and MD11F aircraft from flying until safety checks are carried out.In total, 70 models are in use with UPS, FedEx and Western Global Airlines.FAA officials said the Kentucky crash happened after the plane's left engine caught fire and detached from the wing during take-off. The aircraft was carrying 38,000 gallons (144,000 litres) of fuel as it took off for a flight to Hawaii, which contributed to the size of the fire after the crash.Boeing said it welcomed the directive and that it had already advised the three firms which use the model to stop operating it out of \"an abundance of caution\".It is unclear whether the order will impact delivery services in the US, with none of the three companies reporting disruption so far.Data collated by the live air traffic website FlightRadar24 showed 55 MD-11 planes were used over the past week. \"Contingency plans are in place to flex our integrated air and ground network to help protect time-sensitive, critical shipments such as lifesaving pharmaceuticals, medical devices, and other products move through our network without disruption,\" FedEx said in a statement.UPS also said contingency plans were in place to continue its service. A statement continued: \"Nothing is more important to us than the safety of our employees and the communities we serve.\"The final passenger flights using an MD-11 was in 2014, with the model used exclusively as a cargo carrier since.The model of aircraft involved in the crash was an MD-11F triple-engine plane, which first entered service 34 years ago with Thai Airways as a passenger jet, but was transferred to UPS in 2006.MD-11s were originally manufactured by McDonnell Douglas, before the company merged with Boeing in 1997. Production of MD-11 planes ended in 2000.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US authorities ground cargo plane model after Kentucky air disaster ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ae88/live/91740bf0-bc81-11f0-ae46-bd64331f0fd4.png"
      ],
      "datePublished": "2025-11-09T03:12:21.000Z",
      "dateModified": "2025-11-09T03:12:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Six die as Russia targets energy and residential sites in Ukraine",
    "url": "https://www.bbc.com/news/articles/ce3xdg7xrv9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7032/live/2fe80cb0-bcb3-11f0-8d79-97f33dcb026b.jpg",
    "tag": "World",
    "date": "2025-11-08T16:22:33.000Z",
    "description": "12 hours agoJames Landale,Diplomatic correspondent in Kyiv and Alex KleidermanAt least six people have died after Russia launched hundreds of missile ",
    "body": "12 hours agoJames Landale,Diplomatic correspondent in Kyiv and Alex KleidermanAt least six people have died after Russia launched hundreds of missile and drone attacks on energy infrastructure and residential targets in Ukraine overnight.A strike on an apartment building in the city of Dnipro killed two people and wounded 12, while three died in Zaporizhzhia. In all, 25 locations across Ukraine, including the capital city Kyiv, were hit, leaving many areas without electricity and heating. Prime Minister Yulia Svyrydenko said on Telegram that major energy facilities were damaged in the Poltava, Kharkiv and Kyiv regions, and work was under way to restore power. In Russia, the defence ministry said its forces had shot down 79 Ukrainian drones overnight.The Ukrainian air force said Russia had launched more than 450 exploding bomber drones and 45 missiles. Nine missiles and 406 drones were reportedly shot down.The Ukrainian Energy Ministry said there were power cuts in the Dnipropetrovsk, Chernihiv, Zaporizhzhya, Odesa and Kirovohrad regions, but restoration work was ongoing.Svyrydenko said critical infrastructure facilities have already been reconnected, and water supply is being maintained using generators. Russia argues its attacks on energy targets are aimed at the Ukrainian military.Russian attacks on Ukraine's energy infrastructure ahead of winter are now a familiar part of this war. But ministers in Kyiv are acutely concerned that Moscow is not just trying to damage the morale of Ukraine's people but also bring its economy to a standstill by collapsing its energy network. Analysts say this fourth winter of Russia's full scale invasion will prove a significant test of Ukraine's defensive resilience.Ukraine's President Volodymyr Zelensky said the attacks showed there must be \"no exceptions\" to Western sanctions on Russian energy as a way of putting pressure on Moscow. The missile strikes came only hours after the US gave Hungary a one-year exemption from restrictions on buying oil and gas from Russia. In October, the US effectively blacklisted two of Russia's largest oil companies, threatening sanctions on those who buy from them. But on Friday, during a visit to Washington by Hungarian Prime Minister Viktor Orban - a close personal and political ally of Donald Trump - the US president  announced the exemption for Budapest.In a message on Telegram, Zelensky said the overnight attacks showed that \"pressure must be intensified\" on Russia.He said \"for every Moscow strike on energy infrastructure - aimed at harming ordinary people before winter - there must be a sanctions response targeting all Russian energy, with no exceptions\".He said Ukraine expected \"relevant decisions from the US, Europe and the G7\".Debates about sanctions can sometimes seem technical or diplomatic. But for people in Ukraine, they are very real. If Russia can sell its oil to Hungary, it can use the money earned to build more drones and missiles, like those it launched against Ukraine on Friday night.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Six die as Russia targets energy and residential sites in Ukraine",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7032/live/2fe80cb0-bcb3-11f0-8d79-97f33dcb026b.jpg"
      ],
      "datePublished": "2025-11-08T16:22:33.000Z",
      "dateModified": "2025-11-08T16:22:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Serbia clears the way for controversial Trump-linked property plan",
    "url": "https://www.bbc.com/news/articles/c1e3q6g5n00o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2c26/live/94914260-bc3d-11f0-94e0-178c15cf76dc.jpg",
    "tag": "World",
    "date": "2025-11-08T05:53:11.000Z",
    "description": "Serbia's parliament has passed a law which paves the way for a controversial property development led by US President Donald Trump's son-in-law Jared ",
    "body": "Serbia's parliament has passed a law which paves the way for a controversial property development led by US President Donald Trump's son-in-law Jared Kushner in the capital Belgrade.His firm Affinity Partners has sought to build a luxury hotel and apartment complex on the site of the former Yugoslav Army headquarters.The ruined building, which was bombed by Nato forces in 1999 during its intervention to stop Serbia's military campaign in Kosovo, has symbolic value to some who view it as a memorial and symbol of ongoing opposition to the military alliance.Serbia's President Aleksandar Vucic, who has pursued close ties with Trump, backed the plans despite protests and legal challenges.Last year, the Serbian government stripped the building of its protected status and agreed a 99-year lease with Kushner's firm, which had set out plans for a $500m (£379.9m) development. The decision triggered demonstrations and led to an investigation into whether a Serbian official had forged documentation used during the process to change the building's status.In a conversation with the BBC in June, Vucic defended the proposal, saying \"it's important to overcome the burden from 1999\". He continued: \"We are ready to build better relations with the US – I think that is terribly important for this country.\"The stalled planning process came to a head on Friday when Vucic's party - which has a majority in parliament - pushed ahead with a special vote on clearing the site and won.Opposition politicians have labelled the decision unconstitutional, including Aleksandar Jovanovic, who described it as a crime, and told the AFP news agency that the landmark would be replaced with \"casinos and Jacuzzis\". Meanwhile, centre-left MP Marinika Tepicċ said the government was sacrificing the country's history \"to please Trump\", Politico reported.The passage of the law has also been criticised by architectural experts, and comes after Transparency Serbia, an anti-corruption organisation, raised concerns about state-backed developments. According to Serbian media reports pre-dating his first presidential run, Trump has previously considered building a hotel in Belgrade.Last March, Kushner told the New York Times he was not aware of his father-in-law's reported past interest.The decision to clear the way for the development comes as Vucic's government seeks to maintain good relations with both Washington and Moscow.Serbia has been impacted by both Trump's tariffs and sanctions on Russian interests in the country, including on its sole oil-refinery, the majority Russian-owned Nafna Industrika Srbije (NIS).",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Serbia clears the way for controversial Trump-linked property plan",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2c26/live/94914260-bc3d-11f0-94e0-178c15cf76dc.jpg"
      ],
      "datePublished": "2025-11-08T05:53:11.000Z",
      "dateModified": "2025-11-08T05:53:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Four held after protesters set off flares during Israeli concert in Paris",
    "url": "https://www.bbc.com/news/articles/c3w9lgx1gnxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8bfa/live/e09154c0-bbde-11f0-8456-eff94716b162.png",
    "tag": "World",
    "date": "2025-11-07T11:20:34.000Z",
    "description": "2 days agoPaul KirbyEurope digital editorWatch: The moment spectators confront a protester holding a flare during the Paris concertFour people have be",
    "body": "2 days agoPaul KirbyEurope digital editorWatch: The moment spectators confront a protester holding a flare during the Paris concertFour people have been detained by French police after protesters set off flares during a concert by the Israel Philharmonic Orchestra in Paris on Thursday night.Clashes broke out in the auditorium during one of three disruptions to the performance by conductor Lahav Shani and pianist Sir Andras Schiff.The concert, which featured a programme of Beethoven and Tchaikovsky, had already been criticised by a French union for the performing arts, and pro-Palestinian activists had called for a boycott.However, Culture Minister Rachida Dati strongly defended freedom of creativity as a French value and Interior Minister Laurent Nuñez said nothing could excuse the \"serious disturbances in the hall\".Ticket-holders tried to disrupt the concert three times including twice with a flare, the Philharmonie de Paris said in a statement. At one point concertgoers said the hall became filled with smoke.Video filmed inside the Pierre Boulez auditorium showed one man brandishing a flare as he walked down steps in a seating area. He was confronted by spectators and clashes broke out.\"The troublemakers were removed and the concert, which had to be interrupted, resumed and came to a peaceful conclusion,\" the venue said, adding that it was taking legal action.The disruption prompted an angry response from government figures on Friday, with Laurent Nuñez firmly condemning the incidents and praising police for their rapid response. But Manon Aubry, a European Parliament member for the radical left France Unbowed, refused to condemn the disruption on French TV, arguing that the orchestra's artists \"represent the Israeli state [which] commits war crimes\". Ahead of the concert, pro-Palestinian activists had pushed for its cancellation. Although the CGT-Spectacle union, which represents workers in the performing arts, did not go that far. It had called on the Philharmonie de Paris to \"remind its audience of the extremely serious accusations levelled against [Israel's] leaders\" and saw the concert as \"an attempt at normalisation by the State of Israel\".Hannes Magerstaedt/Getty ImagesThe Israel Philharmonic's performance was led by conductor Lahav Shani (file photo)Rachida Dati said nothing justified a call for a cultural boycott and said there was \"no excuse for antisemitism\".The Israel Philharmonic's star conductor, 36-year-old Lahav Shani, was at the centre of another controversy in September when the organisers of the Flanders Festival in the Belgian city of Ghent cancelled his performance with the Munich Philharmonic, citing \"insufficient clarity\" on his attitude towards the Israeli government.Its decision was criticised by both the Belgian and German governments and days later Belgian Prime Minister Bart de Wever attended a Munich Philharmonic concert with Lahav Shani conducting in the German city of Essen.Condemning Thursday night's disruption, the Philharmonie de Paris said that \"regardless of people's opinions, it is utterly unacceptable to threaten the safety of the public, staff and artists... bringing [violence] into a concert hall is extremely serious\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Four held after protesters set off flares during Israeli concert in Paris",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8bfa/live/e09154c0-bbde-11f0-8456-eff94716b162.png"
      ],
      "datePublished": "2025-11-07T11:20:34.000Z",
      "dateModified": "2025-11-07T11:20:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "More than 1,000 flights cancelled as US air traffic cuts enter second day",
    "url": "https://www.bbc.com/news/articles/cj410k00yw8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6c57/live/ae258c20-bcee-11f0-81cd-cf982342e1e7.jpg",
    "tag": "World",
    "date": "2025-11-09T00:51:00.000Z",
    "description": "3 hours agoGrace Eliza GoodwinGetty ImagesTravellers wait in a long line at a security checkpoint at Houston's George Bush Intercontinental Airport on",
    "body": "3 hours agoGrace Eliza GoodwinGetty ImagesTravellers wait in a long line at a security checkpoint at Houston's George Bush Intercontinental Airport on 6 NovemberMore than 1,400 flights to, from, or within the US were cancelled on Saturday after airlines were told this week to cut traffic during the federal government shutdown.Nearly 6,000 flights were also delayed, down from over 7,000 delays on Friday, according to flight tracker FlightAware. The Federal Aviation Administration (FAA) announced earlier in the week that it would be reducing air travel capacity by up to10% at 40 of the nation's busiest airports as air traffic controllers, who are working without pay during the shutdown,  report fatigue.Republicans and Democrats remain divided over how to end the impasse in Congress as the shutdown, which began 1 October, continues. Saturday marked the 39th day of the longest shutdown in history as Republicans and Democrats still have not agreed on a funding resolution to reopen the government.  Senators are in Washington over the weekend for bipartisan negotitations aimed at ending the shutdown, which is beginning to be felt by more and more Americans amid cuts to food aid payments and the flight disruptions. In a statement on Saturday, American Airlines urged \"leaders in Washington, D.C., to reach an immediate resolution to end the shutdown\".New Jersey's Newark Liberty International Airport was experiencing some of the longest wait times. As of Saturday afternoon, arrivals to the airport were delayed by an average of more than four hours, while departures from the airport were delayed by an average of 1.5 hours, according to the FAA. The airports with the most cancelled flights on Saturday, both to and from the location, were Charlotte/Douglas International, Newark Liberty International, and Chicago O'Hare International, according to FlightAware. Departures to John F Kennedy International, Hartsfield-Jackson Atlanta International, and La Guardia were delayed by nearly three hours, over 2.5 hours, and about an hour, respectively, the FAA reported as of Saturday afternoon.With the Thanksgiving holiday approaching on 27 November, it's one of the busiest travel seasons of the year in the US. It's not just commercial flights that have been affected. Restrictions on private jets are also in place, Secretary Duffy said in a Saturday post on X.  \"We've reduced their volume at high traffic airports — instead having private jets utilize smaller airports or airfields so busy controllers can focus on commercial aviation,\" Duffy wrote. \"That's only fair.\"And things will likely get worse in the coming days as the FAA increases the percentage of cancelled flights. On Thursday, the agency announced that the flight reductions would be gradual, starting at 4% of  flights on Friday before rising to 6% by 11 November, 8% by 13 November, and the full 10% by 14 November.The FAA said the cuts were necessary to maintain safety as air traffic controllers have been overworked during the shutdown. As essential workers, the controllers are required to continue working without pay, and as a result, many have called out sick or taken on second jobs to afford necessities, unions say. Watch: \"Devastating\" - Airline travellers react to flight reductionsThe controllers are just some of the 1.4 million federal workers who have either been working without pay or been put on forced during the shutdown.Another factor impacting air travel is that most of the Transportation Security Agency (TSA) 64,000 agents are also not being paid while the shutdown is in place.During the previous government shutdown, under US President Donald Trump in 2018, it was found that up to 10% of TSA staff chose to stay at home rather than work for free.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "More than 1,000 flights cancelled as US air traffic cuts enter second day",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6c57/live/ae258c20-bcee-11f0-81cd-cf982342e1e7.jpg"
      ],
      "datePublished": "2025-11-09T00:51:00.000Z",
      "dateModified": "2025-11-09T00:51:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israel says body of Lior Rudaeff has been returned from Gaza",
    "url": "https://www.bbc.com/news/articles/cwykw15dx56o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fb57/live/610c9820-bc7b-11f0-83c4-15690b7a59fb.png",
    "tag": "World",
    "date": "2025-11-08T14:46:02.000Z",
    "description": "13 hours agoMallory MoenchHostages and Missing Families ForumThe body has been identified as Lior RudaeffThe Israeli military says it has identified a",
    "body": "13 hours agoMallory MoenchHostages and Missing Families ForumThe body has been identified as Lior RudaeffThe Israeli military says it has identified a body handed over from Gaza as that of Israeli-Argentinian Lior Rudaeff.The 61-year-old was killed while attempting to defend Nir Yitzhak kibbutz during the Hamas attack on southern Israel on 7 October 2023 and his body was taken to Gaza by the Palestinian Islamic Jihad (PIJ) armed group, the military said.PIJ said the body was found on Friday in Khan Younis in southern Gaza. Hamas has now returned all 20 living hostages and 23 out of 28 deceased hostages under the first phase of a ceasefire deal that started on 10 October. Four of the five dead hostages still in Gaza are Israelis and one is Thai.Israel has criticised Hamas for not yet returning all the bodies. Hamas says it is hard to find them under rubble.PIJ is an armed group allied with Hamas. It took part in the 7 October attack and previously held some Israeli hostages. The Hostages and Missing Families Forum, a campaign group, welcomed the return.\"Lior's return provides some measure of comfort to a family that has lived with agonising uncertainty and doubt for over two years,\" it said in a statement. \"We will not rest until the last hostage is brought home.\"During the first phase of the US-brokered ceasefire deal, Israel freed 250 Palestinian prisoners in its jails and 1,718 detainees from Gaza. Israel has also handed over the bodies of 300 Palestinians in exchange for the bodies of the 20 Israeli hostages returned by Hamas, along with those of three foreign hostages - one of them Thai, one Nepalese and one Tanzanian.MOHAMMED SABER/EPA/ShutterstockHamas's military wing stood guard as they searched for hostage bodies on 5 November The parties also agreed to an increase of aid to the Gaza Strip, a partial withdrawal of Israeli forces, and a halt to fighting, although violence has flared up as both sides accused one another of breaching the deal.Israel launched air strikes after accusing Hamas fighters of killing two of its soldiers on 19 October and of killing another soldier on 28 October. Hamas said it was unaware of clashes in the area of the first incident and had no connection to the second attack.Israeli military actions have killed at least 241 people since the start of the ceasefire, according to the Hamas-run health ministry, whose figures are seen by the UN as reliable.The Israeli military launched a campaign in Gaza in response to the 7 October 2023 attack, in which Hamas-led gunmen killed about 1,200 people in southern Israel and took 251 others hostage. All but one of the dead hostages still in Gaza were abducted in the attack.At least 69,169 people have been killed by Israeli attacks in Gaza since then, the health ministry reported.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israel says body of Lior Rudaeff has been returned from Gaza",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fb57/live/610c9820-bc7b-11f0-83c4-15690b7a59fb.png"
      ],
      "datePublished": "2025-11-08T14:46:02.000Z",
      "dateModified": "2025-11-08T14:46:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jakarta: More than 50 people injured in mosque blast at high school ",
    "url": "https://www.bbc.com/news/articles/clykgdg3l42o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7cf3/live/010a9fb0-bbba-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "World",
    "date": "2025-11-07T15:26:41.000Z",
    "description": "2 days agoJerome Wirawan,in Indonesia, and Aleks PhillipsReutersMore than 50 people have been injured in explosions during Friday prayers at a mosque ",
    "body": "2 days agoJerome Wirawan,in Indonesia, and Aleks PhillipsReutersMore than 50 people have been injured in explosions during Friday prayers at a mosque in Indonesia, with authorities identifying a 17-year-old student as the suspected perpetrator. The incident happened at around 12:15 local time (05:15 GMT) inside a school complex that housed the mosque in Kelapa Gading - a district in the capital, Jakarta. The victims, mostly pupils, sustained a range of injuries, including severe burns. The suspect was also hurt, according to Indonesia's police chief, Listyo Sigit Prabowo. He added that an investigation into the incident is under way, \"including how the suspect assembled and carried out the attack\". A bomb disposal team was deployed to the state-run high school complex following the explosions to collect evidence and ensure there were no other explosive devices.A pupil at the school alleged to Indonesia's government-owned news agency Antara that a homemade bomb had been brought in by a student who had often been bullied by other students.Other pupils told Indonesian news outlets that the suspect was a \"loner\" who often made drawings depicting violence, and who had been found lying on the ground following the explosion.A cook at the school described seeing white smoke coming from the mosque and broken windows after the \"massive\" blast.\"Our hearts were beating fast, we couldn't breathe,\" she told the Reuters news agency.A high-ranking Jakarta Metropolitan Police officer confirmed the presence of two objects resembling firearms at the scene.Images from Antara suggest one of the objects appeared to be a submachine gun and another looked like a pistol.The submachine gun-type object appears to be inscribed on its barrel with: \"14 words. For Agartha.\"On its body, it says: \"Brenton Tarrant. Welcome to Hell.\"Brenton Tarrant is the perpetrator of a 2019 mass shooting at a mosque and Islamic centre in Christchurch, New Zealand, that killed 51 and injured dozens of others.A minister who visited the scene later on Friday sought to dispel suggestions that weapons were present at the site, telling CNN Indonesia what had been pictured \"turned out to be a toy gun, not a real gun\".Lodewijk Freidrich Paulus also called on the public not to presume the explosion was a \"terrorist act\" as investigators were still combing over the scene.Another object found at the site was a dark green belt for storing gun cartridges.Indonesia has the world's largest Muslim population.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jakarta: More than 50 people injured in mosque blast at high school ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7cf3/live/010a9fb0-bbba-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-11-07T15:26:41.000Z",
      "dateModified": "2025-11-07T15:26:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kenyan activists missing in Uganda found safe after five weeks",
    "url": "https://www.bbc.com/news/articles/cn8v9vkkjm0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5682/live/9d514070-9f60-11f0-af95-eb0d48238f5d.jpg",
    "tag": "World",
    "date": "2025-11-08T09:28:26.000Z",
    "description": "19 hours agoTiffany WertheimerBobi Wine/XBob Njagi and Nicholas Oyoo were helping Bobi Wine campaign Human rights groups in Kenya say two activists wh",
    "body": "19 hours agoTiffany WertheimerBobi Wine/XBob Njagi and Nicholas Oyoo were helping Bobi Wine campaign Human rights groups in Kenya say two activists who disappeared in neighbouring Uganda five weeks ago have turned up alive and well. Eyewitnesses reported seeing Bob Njagi and Nicholas Oyoo being forced into a car by masked uniformed men after a political event where they were supporting the Ugandan opposition leader Bobi Wine. On Saturday, activist organisation Vocal Africa confirmed the men were safe, and being transported from Busia in Uganda to Kenya's capital, Nairobi.\"Let this moment signal an important shift towards upholding the human rights of East Africans anywhere in East African Community,\" the organisation wrote on its Instagram page.Ugandan police denied the men were in their custody, but Kenyan rights groups lobbied the Ugandan authorities to free them.In a joint statement, Vocal Africa, the Law Society of Kenya and Amnesty International thanked the Kenyan and Ugandan governments, activists, journalists, diplomats and \"all active citizens who have tirelessly campaigned for this moment\".Former pop star Bobi Wine, whose real name is Robert Kyagulanyi, is running for the presidency in next year's elections, challenging President Yoweri Museveni, 80, who has held power since 1986.Wine accused the Ugandan government of targeting the two Kenyans for associating with him.Ugandan security agencies have often been accused of orchestrating the detention of opposition politicians and supporters while not in uniform. Some of those arrested have later resurfaced in court facing criminal charges.The latest disappearances mirror past incidents involving politicians and activists across the East African region.Last year, Njagi was picked up in Kenya by masked men during a wave of abductions believed to have been targeting government critics in the country.He surfaced a month later, after a court ordered police to produce him. He later recounted the harrowing conditions in captivity, where he said he was often isolated and denied food.Earlier this year, Kenyan activist Boniface Mwangi and his Ugandan counterpart Agather Atuhaire were detained in Tanzania and held incommunicado for days before being abandoned at their respective national borders.They later recounted being brutally mistreated, including sexual torture at the hands of the Tanzanian authorities – allegations which police dismissed as \"hearsay\".Last year, another Uganda opposition figure, Kizza Besigye, mysteriously disappeared in Nairobi only to surface four days later in a military court in Uganda, where he faces treason charges.The cases have since sparked widespread condemnation and concerns that East African governments could be collaborating to contain dissent.You may also be interested in:How a Ugandan opposition leader disappeared in Kenya and ended up in military court'We live in fear' - forced expulsions taint Kenya's safe haven imageUganda's Yoweri Museveni: How an ex-rebel has stayed in power for 35 yearsBobi Wine: Uganda's 'ghetto president'Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kenyan activists missing in Uganda found safe after five weeks",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5682/live/9d514070-9f60-11f0-af95-eb0d48238f5d.jpg"
      ],
      "datePublished": "2025-11-08T09:28:26.000Z",
      "dateModified": "2025-11-08T09:28:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "British ex-soldier arrested over killing of Kenyan woman in 2012",
    "url": "https://www.bbc.com/news/articles/c8jrkyzn8dvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c909/live/40a165f0-bbfb-11f0-8137-87774ba307f6.jpg",
    "tag": "World",
    "date": "2025-11-07T19:32:29.000Z",
    "description": "1 day agoSteve Mellen and Alys DaviesA former British soldier is facing extradition to Kenya in connection with the alleged murder of a 21-year-old wo",
    "body": "1 day agoSteve Mellen and Alys DaviesA former British soldier is facing extradition to Kenya in connection with the alleged murder of a 21-year-old woman there in 2012.The National Crime Agency (NCA) said Robert James Purkiss was arrested in Tidworth, Wiltshire on 6 November and appeared at Westminster Magistrates' Court on Friday.He was arrested by specialist officers from the NCA's National Extradition Unit in connection with the killing of Agnes Wanjiru after a warrant was issued in September, the agency added.Mr Purkiss, 38, told the court he intended to contest the extradition and was remanded into custody ahead of his next appearance at the same court on 14 November.His lawyers told the court that he \"vehemently denies\" murder.Ms Wanjiru's body was discovered in a septic tank near a hotel in the town of Nanyuki, about 124 miles (200km) north of Nairobi, three months after she had gone missing on 31 March 2012. She had a five-month-old baby at the time.Her body was found near a British army training camp. On the night she was killed, she had reportedly been at a bar with friends where British soldiers were also present. Ms Wanjiru's niece, Esther Njoki, met the UK's defence minister last month in order to push for Mr Purkiss's extradition. In a statement issued through Leigh Day, the lawyers acting for Ms Wanjiru's family, on Friday Ms Njoki said: \"My family is incredibly relieved to hear that the suspect in my aunt's case has been arrested.\"We have waited so many years for this moment which marks an important step towards finally obtaining justice for our beloved Agnes.\"Leigh Day partner Tessa Gregory said: \"This is a huge moment for our client and her family who have been fighting for over a decade to obtain justice for Agnes.\"We hope the UK and Kenyan authorities will now work together to ensure that the suspect can face trial in Kenya as quickly as possible.\"Ms Wanjiru's family has long accused the British army of covering up her death and the Kenyan authorities of failing to properly investigate the case at the time.An inquest into her death was opened in 2018 following pressure from Ms Wanjiru's family, as well as Kenyan rights groups and feminists.In 2019, it concluded that Ms Wanjiru had been unlawfully killed by one or two British soldiers and that she had suffered stab wounds to the chest and abdomen.Later in 2021, a Sunday Times investigation reported that a British soldier had confessed to colleagues that he killed Ms Wanjiru. The soldier left the army after the incident and reportedly continued to live in the UK.In 2024, the army announced it was launching an internal review into the conduct of British soldiers in Kenya, including in Nanyuki.It found 35 suspected cases of soldiers having engaged in sexual exploitation and abuse, including transactional sex, with local women - nine of these being after the army officially banned such conduct in 2022.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "British ex-soldier arrested over killing of Kenyan woman in 2012",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c909/live/40a165f0-bbfb-11f0-8137-87774ba307f6.jpg"
      ],
      "datePublished": "2025-11-07T19:32:29.000Z",
      "dateModified": "2025-11-07T19:32:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What Hungary's Viktor Orban did - and didn't - get from Trump",
    "url": "https://www.bbc.com/news/articles/ckg4r193152o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0bbb/live/173f2ff0-bca8-11f0-9886-b3acf9644cc5.jpg",
    "tag": "World",
    "date": "2025-11-08T16:14:42.000Z",
    "description": "12 hours agoNick ThorpeBudapest, HungaryOn the surface, the Hungarian prime minister's trip was exactly what he went to Washington for: luxuriant prai",
    "body": "12 hours agoNick ThorpeBudapest, HungaryOn the surface, the Hungarian prime minister's trip was exactly what he went to Washington for: luxuriant praise and an exemption from sanctions on Russian oil, gas and nuclear supplies.And all that just five months out from a difficult election.Look closer, however, and the picture is less clear cut. The US side struck a hard trade deal - and an expensive one for Hungary. And there's no progress on Viktor Orban's biggest headache: ending the war in neighbouring Ukraine, and with it the long shadow the conflict casts over Hungary.Let's look first at Orban's key win - an exemption from US sanctions, which a White House official told the BBC was time-limited to one year, although Péter Szijjártó, Hungary's foreign minister, said would be indefinite.The time span is interesting. Trump clearly wants to help his friend win the election in April. And the exemption even partially dovetails with the European Commission demand to all member states to end the import of Russian oil, gas and nuclear fuel by the end of 2027. What is missing, from an EU perspective, is any political commitment from Orban to meet that demand - a commitment made and fulfilled by the Czech government. And the EU is trying to tighten energy sanctions - to the fury of Hungary and Slovakia.Away from the media spotlight, the Hungarian energy company MOL has been upgrading two of its refineries - Százhalombatta in Hungary and the Slovnaft facility in Bratislava - to process Brent crude instead of the high-sulphur Urals crude which flows through Russian pipelines. On Friday, MOL said 80% of its oil needs could be imported through the Adria pipeline from Croatia, albeit with higher logistical costs and technical risks. So Orban's argument, which so impressed Trump, that Hungary, as a landlocked country, has no alternative to Russian oil may not strictly be true. Overall, Hungary and Slovakia have together paid Russia $13bn (£10bn) for its oil between its full-scale invasion of Ukraine in February 2022 and the end of 2024. The one-year window granted by the US is nevertheless a valuable respite for Hungarian households this winter. Orban told pro-government reporters who travelled with him to Washington that otherwise utility bills \"could have gone up by up to three times in December\". Capping those bills by various means has been a central plank of his popularity in Hungary since 2013. Under the US exemption, Hungary can also continue to buy Russian gas through the Turkstream pipeline, which traverses the Balkans, and pay for it in hard currency ($185m in August alone) using a Bulgarian loophole. Orban has agreed to buy LNG from the US worth $600 million, according to Bloomberg.Another key part of the Washington deal is nuclear. Hungary agreed to buy US nuclear fuel rods for its Paks 1 nuclear power station (at a cost of $114m), in parallel to those bought from Russia's Rosatom and France's Framatome.Russian plans to finance and build the nuclear extension, called Paks 2, have been long delayed by technical and licensing issues. The US agreement to lift all nuclear sanctions on Hungary may help restart that project, but thorny problems remain. Hungary has also agreed to buy US technology to extend the short-term storage of spent nuclear fuel at Paks for between $100m and $200m.Perhaps the biggest part of the deal was a Hungarian commitment to buy up to 10 small modular nuclear reactors from the US, for somewhere between $10bn and $20bn. Hungary needs electricity to power the huge Chinese battery plants being built around the country. Smaller nuclear plants are less plagued by building delays, and are easier to licence.Finally, a currency swap deal - similar to a recent US-Argentina deal to prop up the peso - under which US and Hungarian central banks can exchange currency is being discussed.This would mean that in a future financial crisis in Hungary, the US central bank could feed dollars to Budapest, which boosts financial security in Hungary.So in summary, Hungary struck a deal to buy US gas, nuclear energy and unspecified weapons systems in exchange for a temporary waiver from US sanctions on Russian oil and gas. But it failed to get the re-introduction of the US visa waiver system, abolished in 2022, which harms mutual trade. And it did not get a new date for a potential Trump-Putin summit in Budapest as part of efforts to end the Russia-Ukraine war.Critics say energy dependence on Russia is being replaced by energy dependence on the US. The Orban government argues it is achieving greater diversity of supply.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What Hungary's Viktor Orban did - and didn't - get from Trump",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0bbb/live/173f2ff0-bca8-11f0-9886-b3acf9644cc5.jpg"
      ],
      "datePublished": "2025-11-08T16:14:42.000Z",
      "dateModified": "2025-11-08T16:14:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]