[
  {
    "title": "COP30 fire: BBC at the scene of 'intense' blaze",
    "url": "https://www.bbc.com/news/videos/cn5159k1krzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f1e6/live/d697fe90-c63f-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-20T21:58:46.000Z",
    "description": "The UN climate talks COP30 have been evacuated due to a fire breaking out inside the venue in Belém, Brazil.BBC journalists including Climate Editor J",
    "body": "The UN climate talks COP30 have been evacuated due to a fire breaking out inside the venue in Belém, Brazil.BBC journalists including Climate Editor Justin Rowlatt saw flames and smoke in the pavilion area before they were rushed outside.The UN said the fire was extinguished after six minutes and 13 people were treated for smoke inhalation. It is not yet known what caused the blaze.More on this story.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "COP30 fire: BBC at the scene of 'intense' blaze",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f1e6/live/d697fe90-c63f-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-20T21:58:46.000Z",
      "dateModified": "2025-11-20T21:58:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mexico: Seven bodyguards arrested over mayor's murder",
    "url": "https://www.bbc.com/news/articles/cq60rpmq641o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/925a/live/3e4c9d90-c78d-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-22T10:33:57.000Z",
    "description": "Seven bodyguards have been arrested over their alleged involvement in the murder of a popular Mexican mayor, authorities have said.Carlos Manzo, the m",
    "body": "Seven bodyguards have been arrested over their alleged involvement in the murder of a popular Mexican mayor, authorities have said.Carlos Manzo, the mayor of Uruapan and an outspoken critic of cartel violence, was shot dead on 1 November at a public event marking the Day of the Dead.The office of the attorney general of Michoacán state said in a brief statement that the public servants had been detained \"for their probable participation in the crime of aggravated homicide, in commission by omission\" in relation to Manzo's killing.It follows the arrest on Wednesday of a man police described as the mastermind behind the murder, who officials said had links to a powerful cartel.The attorney general's office in Michoacán, to the west of the capital, Mexico City, said the seven guards had been arrested by both state and federal officials, including the National Guard.Troops and agents led the suspects out of a municipal building on Friday near where Manzo had been killed, according to the Associated Press.The 40-year-old mayor was attending a Day of the Dead ceremony - which honours deceased family and friends - alongside his relatives when he was shot seven times, sending bystanders running for cover.Manzo's assassination triggered mass protests and questions have been raised about why his security detail failed to stop the lone gunman. The suspect was later restrained and shot by Manzo's bodyguards. Manzo had been outspoken about how avocado growers in the region were being extorted and threatened by criminal groups, and had also demanded that Mexico's federal government do more to rein in the cartels.The Jalisco New Generation Cartel (CJNG), which Mexico's security minister blamed for Manzo's slaying, engages in drug trafficking, as well as kidnapping for ransom and extortion.It is also infamous for targeting public officials who refuse to do its bidding.Mexican officials arrested the supposed mastermind of the assassination, named only by his forenames Jorge Amando, on Wednesday.While the CJNG is thought to be the most powerful of the criminal gangs operating in Michoacán, there are many others and their fights for control of drug, arms and fuel smuggling routes often result in deadly confrontations.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mexico: Seven bodyguards arrested over mayor's murder",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/925a/live/3e4c9d90-c78d-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-22T10:33:57.000Z",
      "dateModified": "2025-11-22T10:33:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Vietnam floods leave at least 90 dead and 12 missing",
    "url": "https://www.bbc.com/news/articles/cwywl8g31g7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/159a/live/d2d4c660-c83f-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-23T06:27:33.000Z",
    "description": "At least 90 people have died and another 12 are missing after days of heavy rain in Vietnam led to flooding and landslides.The Vietnamese government s",
    "body": "At least 90 people have died and another 12 are missing after days of heavy rain in Vietnam led to flooding and landslides.The Vietnamese government says 186,000 homes have been damaged across the country, with more than three million livestock swept away. Officials estimate there has been hundreds of millions of pounds worth of damage.The mountainous province of Dak Lak has been severely impacted, recording more than 60 deaths since 16 November, according to news agency AFP.The floods are the latest extreme weather event to hit Vietnam in recent months, after typhoons Kalmaegi and Bualoi hit the country within weeks of each other.Some 258,000 people were without power on Sunday morning and sections of major motorways and train tracks were blocked, officials said.Military and police resources have been mobilised to assist in the hardest hit areas.The government said the most severe impacts had been observed in five provinces - Quang Ngai, Gia Lai, Dak Lak, Khanh Hoa, and Lam Dong - clustered in south and south-central Vietnam.Mach Van Si, a farmer in Dak Lak, told AFP: \"Our neighbourhood was completely destroyed. Nothing was left. Everything was covered in mud.\"Prime Minister Phạm Minh Chính chaired a virtual emergency meeting on Sunday morning from South Africa, where he had been attending the G20 summit. Rainfall had exceeded 1.5m (5ft) in several areas leading up to Friday, with some areas surpassing a 5.2m level not seen since 1993. The rain is forecast to ease in the coming days.Scientists say that Vietnam has been left more exposed to extreme weather events by human-driven climate change, which has made typhoons stronger and more frequent.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Vietnam floods leave at least 90 dead and 12 missing",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/159a/live/d2d4c660-c83f-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-23T06:27:33.000Z",
      "dateModified": "2025-11-23T06:27:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man who grabbed Ariana Grande at premiere banned from Singapore",
    "url": "https://www.bbc.com/news/articles/cpd6qey9e4zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6b04/live/f42644e0-c846-11f0-b991-15c7bfbd8eea.jpg",
    "tag": "World",
    "date": "2025-11-23T08:54:26.000Z",
    "description": "3 hours agoDanai Nesta KupembaBBC NewsAn Australian man who jumped over a barricade and grabbed Hollywood star Ariana Grande has been deported and ban",
    "body": "3 hours agoDanai Nesta KupembaBBC NewsAn Australian man who jumped over a barricade and grabbed Hollywood star Ariana Grande has been deported and banned from Singapore.Johnson Wen, 26, was sentenced to nine days in prison for being a public nuisance and has now been \"barred from re-entering Singapore\", the Immigration and Checkpoints Authority (ICA) told local media. Wen pushed past photographers and charged at the actress and singer, who was attending the Asian premier for Wicked: For Good on 13 November. Co-star Cynthia Erivo wrestled him away from Grande. Wen has a history of disrupting concerts and celebrity events, including jumping on stage at Katy Perry's Sydney concert in June this year.The incident sparked outrage in Singapore, with many accusing him of re-traumatising Grande. The pop star has spoken of experiencing post-traumatic stress disorder after a suicide bomb attack at her concert in Manchester in May 2017 killed 22 people and injured hundreds.During Wen's trial, the court heard he had attempted to intrude on the film's premiere twice, according to Singaporean media.He then made a second attempt to jump the barricades. Security staff stopped him and pinned him down.Wen later posted videos thanking Grande for letting him on the carpet and said he was \"free\". Police arrested him the next day and charged him with public nuisance, to which Wen pleaded guilty. The District Judge Christopher Goh was quoted by Channel News Asia as saying that Wen was \"attention seeking\", adding that he was wrong to think he would not suffer any consequences. Grande has not commented on the case. Erivo spoke about the incident to NBC, saying that she \"just wanted to make sure my friend was safe\".\"I'm sure he didn't mean us harm, but you never know with those things, and I wanted to make sure that she was OK. That was my first instinct,\" she said. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man who grabbed Ariana Grande at premiere banned from Singapore",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6b04/live/f42644e0-c846-11f0-b991-15c7bfbd8eea.jpg"
      ],
      "datePublished": "2025-11-23T08:54:26.000Z",
      "dateModified": "2025-11-23T08:54:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Seven arrested in India after police crack $800,000 bank heist",
    "url": "https://www.bbc.com/news/articles/cy8j4m45yx2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e250/live/492bce90-c7ae-11f0-83e1-2f64c544cba6.jpg",
    "tag": "World",
    "date": "2025-11-23T11:33:59.000Z",
    "description": "48 minutes agoImran Qureshi and Jessica RawnsleySeven people have been arrested in India after a daring 70m rupees ($800,000; £600,000) heist in which",
    "body": "48 minutes agoImran Qureshi and Jessica RawnsleySeven people have been arrested in India after a daring 70m rupees ($800,000; £600,000) heist in which armed men posing as central bank officials robbed an ATM cash van.On Saturday police in the southern city of Bengaluru said they had cracked the case and recovered 57.6m rupees of the money stolen three days earlier.Bengaluru police commissioner Seemant Kumar Singh told the BBC on Sunday that a seventh man had been arrested in Bengaluru, adding it would take time to determine the amount of money \"in his possession.\"Singh said the police are still looking \"for two or, maybe, three more,\" suspects.Those arrested include Gopal Prasad, an employee of cash transport company CMS, J Xavier, a former CMS worker, and Annappa Naik, a local police constable.The robbery took place in broad daylight in the Lalbagh area of Bengaluru. The thieves pretended to be officers of the Reserve Bank of India. They stopped the transport vehicle saying they had to check the paperwork for such a large amount of money.The vehicle's cash custodian and two security guards were instructed to get into an SUV, while one of the gang members took control of the van, police said.Police said the gang had changed vehicles, used fake registration plates and selected locations with minimal CCTV coverage to transfer the boxes of cash.A massive hunt was launched on Wednesday, with more than 200 police officers deployed across Karnataka state and the neighbouring Kerala, Tamil Nadu, Telangana, Andhra Pradesh and Goa states.Detectives are investigating the role of CMS and possible violations of guidelines for transferring cash, Singh said.\"The vans should not follow the same route and timing repeatedly so as to become predictable,'' he added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Seven arrested in India after police crack $800,000 bank heist",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e250/live/492bce90-c7ae-11f0-83e1-2f64c544cba6.jpg"
      ],
      "datePublished": "2025-11-23T11:33:59.000Z",
      "dateModified": "2025-11-23T11:33:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paul Costelloe: Irish fashion designer dies aged 80",
    "url": "https://www.bbc.com/news/articles/cly3w4we7gxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b343/live/0411c700-c7b4-11f0-83e1-2f64c544cba6.jpg",
    "tag": "World",
    "date": "2025-11-22T16:39:20.000Z",
    "description": "20 hours agoGetty ImagesPaul Costelloe during London Fashion Week September 2025Irish fashion designer Paul Costelloe has died in London aged 80.Coste",
    "body": "20 hours agoGetty ImagesPaul Costelloe during London Fashion Week September 2025Irish fashion designer Paul Costelloe has died in London aged 80.Costelloe became one of the best-known names in British and Irish fashion and was personal designer to the late Diana, the Princess of Wales.His family issued a statement on Saturday saying they were \"deeply saddened to announce the passing of Paul Costelloe following a short illness\".They added: \"He was surrounded by his wife and seven children and passed peacefully in London.\"Getty ImagesPaul Costelloe at London Fashion Week in 2022He was born in Dublin where his father ran a successful company making raincoats. After studying at the Grafton Academy of Fashion Design he moved to Paris where he took a course at the Chambre Syndicale de la Haute Couture in Paris.He set up his own label in 1979, Paul Costelloe Collections, and presented collections at London Fashion Week, as well as in Paris, Milan and New York. Getty ImagesCostelloe was Princess Diana's personal designer In 1983 he was appointed personal designer to Diana, Princess of Wales, a collaboration which continued until her death in 1997.Costelloe  often used traditional Irish fabrics and textiles in his designs, including Irish linen and tweed.He collaborated with Dunnes Stores and was the closing designer for the inaugural Ireland Fashion Week in October this year.Getty ImagesPaul Costelloe and models pose on the runway at the Paul Costelloe presentation during London Fashion Week September 2017He was criticised in 1998 when he said that Irish women lacked style.\"Irish women have difficulty with style because it's not in their inner nature... like the Italians,\" he said at the timeHowever, during an interview with Irish broadcaster RTÉ this year, he said he felt that Ireland was more European than years ago.Taoiseach (Irish PM) Micheál Martin said he was \"very saddened to learn of the passing of Paul Costelloe\".\"An icon of design, Paul elevated Irish fashion to the global stage,\" he said.Tánaiste (deputy PM) Simon Harris said Costelloe had \"led a remarkable life\".Harris added: \"He built a hugely successful business through incredible talent, discipline, and an unwavering commitment to quality.\"He leaves behind a body of work that shaped modern Irish fashion and will continue to shape it in the years to come. He will be greatly missed and warmly remembered.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paul Costelloe: Irish fashion designer dies aged 80",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b343/live/0411c700-c7b4-11f0-83e1-2f64c544cba6.jpg"
      ],
      "datePublished": "2025-11-22T16:39:20.000Z",
      "dateModified": "2025-11-22T16:39:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "JFK granddaughter shares terminal cancer diagnosis",
    "url": "https://www.bbc.com/news/articles/cpvdyg348pko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2d43/live/ef259260-c7cf-11f0-b259-1f10e6cadd18.jpg",
    "tag": "World",
    "date": "2025-11-23T07:42:57.000Z",
    "description": "The granddaughter of former US President John F Kennedy has announced her diagnosis with an aggressive form of cancer.Tatiana Schlossberg said she has",
    "body": "The granddaughter of former US President John F Kennedy has announced her diagnosis with an aggressive form of cancer.Tatiana Schlossberg said she has been given less than a year to live.The 35-year-old shared the news in an essay published in The New Yorker on Saturday - the 62nd anniversary of her grandfather's assassination.The mother-of-two climate journalist has been an outspoken opponent of her relative Robert F Kennedy Jr's position as US health secretary under President Donald Trump. In her essay, Schlossberg describes her alarm at watching her second cousin be approved to the post as she was battling her illness. Schlossberg is the daughter of designer Edwin Schlossberg and diplomat Caroline Kennedy. She is the granddaughter of John F. Kennedy, the 35th president of the United States, and First Lady Jacqueline Kennedy Onassis. According to Schlossberg's essay titled A Battle With My Blood, she was diagnosed with acute myeloid leukaemia after giving birth in May 2024.She described her previously healthy lifestyle, which included running, skiing and even once swimming in New York's Hudson River, \"eerily, to raise money for the Leukemia and Lymphoma Society\".Despite treatment, including a bone marrow transplant and chemotherapy, she said doctors have told her the outcome does not look good. \"During the latest clinical trial, my doctor told me that he could keep me alive for a year, maybe,\" she writes. \"My first thought was that my kids, whose faces live permanently on the inside of my eyelids, wouldn't remember me.\" Schlossberg's son was born in 2022 and her daughter in 2024.Schlossberg, whose uncle John F Kennedy Jr died in a plane crash at age 38 and whose grandmother Jacqueline died of cancer when Schlossberg was a toddler, also describes the pain she fears her death will cause her mother, who previously served as US ambassador to Australia and Japan. \"For my whole life, I have tried to be good, to be a good student and a good sister and a good daughter, and to protect my mother and never make her upset or angry,\" she writes. \"Now I have added a new tragedy to her life, to our family's life, and there's nothing I can do to stop it.\" She also described her upset at watching her second cousin, known as RFK Jr - whose father Robert F Kennedy was also assassinated while running for president - become Trump's health secretary.\"I watched from my hospital bed as Bobby, in the face of logic and common sense, was confirmed for the position, despite never having worked in medicine, public health, or the government,\" she writes. \"Suddenly, the healthcare system on which I relied felt strained, shaky.\"Earlier this month, her brother Jack Schlossberg announced that he is planning to run for Congress in New York. He shared her essay online on Saturday, with the caption: \"Life is short - let it rip.\"The Kennedy family's generations-spanning participation in US politics - along with the personal tragedy which has often touched its members - has garnered it a prominent reputation in American life.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "JFK granddaughter shares terminal cancer diagnosis",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2d43/live/ef259260-c7cf-11f0-b259-1f10e6cadd18.jpg"
      ],
      "datePublished": "2025-11-23T07:42:57.000Z",
      "dateModified": "2025-11-23T07:42:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israeli strikes across Gaza kill 22 Palestinians, Hamas-run health ministry and civil defence say",
    "url": "https://www.bbc.com/news/articles/c20879zzqn8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e122/live/714f42f0-c7c5-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-22T20:43:36.000Z",
    "description": "16 hours agoRushdi Abualouf,Gaza correspondent, Istanbul and Jon Donnison,correspondent, JerusalemAt least 22 Palestinians have been killed in a serie",
    "body": "16 hours agoRushdi Abualouf,Gaza correspondent, Istanbul and Jon Donnison,correspondent, JerusalemAt least 22 Palestinians have been killed in a series of Israeli air strikes across northern and central Gaza, Hamas medical and civil defence officials have said.They said five sites had been hit, including residential homes. A senior Hamas commander was among the dead, according to local sources.The Israeli military said it had struck targets in Gaza in response to an incident earlier on Saturday, when it said an \"armed terrorist\" had fired at soldiers after crossing the Strip's so-called \"yellow line\" designating areas under full Israeli control. Hamas denied this.Both sides have accused each other of violating the ceasefire deal agreed on six weeks ago.More than 310 Palestinians have been killed in Israeli strikes since the ceasefire came into force, according to Gaza's health ministry.The territory's civil defence said Saturday's strikes by Israel targeted Gaza City in the north, as well as Deir al-Balah and Nuseirat camp in central Gaza.The Hamas officials said five people had been killed at the Abbas junction in the densely populated Rimal area of Gaza City. Witnesses said an Israeli strike set a car on fire.In addition, three people were killed near a mosque in Deir al-Balah, the officials said.Two houses were targeted in Israeli strikes in Nuseirat, they added, with three killed after the home of the Abu Amouneh family was hit. Seven others were killed in another strike targeting the house of the Abu Shawish family.Three more people were killed later on Saturday when a house in western Gaza City was hit, officials reported.The office of Prime Minister Benjamin Netanyahu said in a later statement: \"Today, Hamas violated the ceasefire again, sending a terrorist into Israel held territory to attack IDF soldiers. In response, Israel eliminated five senior Hamas terrorists.\"The statement also called on mediators to \"insist that Hamas fulfil its side of the ceasefire\".Following the strikes, Hamas said the army's westward push of the yellow line and continued bombardment of eastern Gaza amounted to a \"blatant breach\" of the agreement.The group called on mediators and the US to intervene urgently, warning that Israel was attempting to impose \"new facts on the ground\" and undermine the ceasefire.The Israeli military launched an offensive in Gaza in response to the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.At least 69,500 people have been killed in Israeli attacks in Gaza since then, including 280 during the ceasefire, according to the territory's health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israeli strikes across Gaza kill 22 Palestinians, Hamas-run health ministry and civil defence say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e122/live/714f42f0-c7c5-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-22T20:43:36.000Z",
      "dateModified": "2025-11-22T20:43:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mystery drones halt air traffic near Dutch city of Eindhoven",
    "url": "https://www.bbc.com/news/articles/cewjlr0v02ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1952/live/da8afd00-c7e7-11f0-a9f0-9f5579338902.png",
    "tag": "World",
    "date": "2025-11-22T21:25:47.000Z",
    "description": "15 hours agoAleks PhillipsAFP via Getty ImagesAir traffic above the southern Dutch city of Eindhoven was suspended for several hours on Saturday after",
    "body": "15 hours agoAleks PhillipsAFP via Getty ImagesAir traffic above the southern Dutch city of Eindhoven was suspended for several hours on Saturday after unidentified drones were spotted near the airport.Drones were first observed late on Friday over the nearby Volkel air force base. Weapons were deployed to try to shoot them down but the devices got away.After more sightings on Saturday, airspace around the airport was closed  until around 23:00 local time (22:00 GMT). Dutch Defence Minister Ruben Brekelmans said authorities had \"taken measures\" without elaborating. It is the latest in a series of incidents at military installations and airports in northern Europe in recent months. Russia has denied accusations it was involved in them.As well as being used by the Royal Netherlands Air Force, Volkel Air Base hosts a US Air Force squadron as part of Nato.Officials said that for security reasons they would provide no details about how the drones were first spotted on Friday or what action was taken to try to bring them down.Drones have been sighted at other Dutch air bases in the past few weeks, as well as facilities in neighbouring Belgium, Denmark and Germany.A lack of evidence pointing to their origins has plagued investigations into the incidents since they began in September, as in many cases the drones depart after a while.Some European officials have attributed the sightings to \"hybrid warfare\" on the part of Russia, as the nations that have been targeted are all allied to Ukraine.But the Kremlin has denied it has anything to do with past incursions. Defence ministers from 10 EU countries have agreed to create a \"drone wall\" in response to the sightings, while some individual nations have sought to secure anti-drone defence measures.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mystery drones halt air traffic near Dutch city of Eindhoven",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1952/live/da8afd00-c7e7-11f0-a9f0-9f5579338902.png"
      ],
      "datePublished": "2025-11-22T21:25:47.000Z",
      "dateModified": "2025-11-22T21:25:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jair Bolsonaro: Brazilian ex-president arrested after being determined a flight risk",
    "url": "https://www.bbc.com/news/articles/ce8qdm5zg10o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5656/live/8c802e20-c7a4-11f0-a788-49f2aacc0147.jpg",
    "tag": "World",
    "date": "2025-11-23T09:20:00.000Z",
    "description": "3 hours agoSofia Ferreira Santos and Alex SmithReuters/Adriano MachadoJair Bolsonaro has been taken into custody after being determined a \"concrete fl",
    "body": "3 hours agoSofia Ferreira Santos and Alex SmithReuters/Adriano MachadoJair Bolsonaro has been taken into custody after being determined a \"concrete flight risk\" while under house arrest.The right-wing former Brazilian president was found guilty of plotting a military coup in September and sentenced to more than 27 years in prison, but remains under house arrest pending appeals.Brazilian Supreme Court Justice Alexandre de Moraes said detaining the 70-year-old was a preventative measure after \"new facts\" came to light.In a video released by the court, a police official questioned the former president about damage to his ankle monitor. Bolsonaro said he burned the monitor's case with a soldering iron out of \"curiosity\", but denied wanting to remove it. Court officials said he wanted to use a planned rally outside outside his house as a cover to break free. His lawyer denied the claims.In a filing authorising the arrest, Justice Moraes said information from the centre monitoring Bolsonaro's house arrest suggested the former president's \"intention to break the electronic ankle bracelet to ensure success in his escape\".This, it said, would be \"facilitated by the confusion caused by the demonstration called by his son\".Flávio Bolsonaro, who serves a senator, called for a gathering of his supporters near his father's home to take place on Saturday night. The senator wrote on social media on Friday: \"Are you going to fight for your country, or watch it all from your phone there on your sofa? I invite you to fight with us.\"He said the vigil would enable supporters to \"pray for his health and for the return of democracy in our country\".To explain his decision, Justice Moraes cited the possibility of Bolsonaro fleeing to foreign embassies, citing \"a history of planning to request asylum through a diplomatic representation\".The court filing notes that the US embassy in the capital, Brasilia, is located about 13km (8 miles) from Bolsonaro's home.Bolsonaro's legal woes have drawn the ire of fellow right-wing populist US President Donald Trump, prompting him to impose a 50% tariff on imports of Brazilian goods.Bolsonaro is being held in a police station in Brasilia and will undergo a custody hearing on Sunday.On Friday, the former president's lawyers asked the Supreme Court to allow him to serve his whole jail sentence under house arrest, with electronic monitoring.They also asked that Bolsonaro be allowed to leave his home for medical treatment, saying he required regular treatment for pulmonary infections and other ailments.Bolsonaro's lawyer Paulo Cunha Bueno told journalists outside the Federal Police building that concerns about his ankle monitor was \"a narrative that tries to justify the unjustifiable\".He added: \"Bolsonaro did not want, in any way, to escape from his house. \"There is a patrol with armed federal agents, 24 hours a day, seven days a week at the door of his house.\"Bolsonaro was found guilty of leading a conspiracy aimed at keeping him in power after he lost the 2022 election to his left-wing rival, Luiz Inácio Lula da Silva.Supreme Court justices said that he knew of a plot which included plans to assassinate Lula and his vice-presidential running mate, Geraldo Alckmin, and to arrest and execute Moraes, who has been overseeing Bolsonaro's trial.The conspiracy failed to get the backing of the army and air force commanders. Lula was sworn in without incident on 1 January 2023.But a week later, on 8 January, thousands of Bolsonaro supporters stormed government buildings in Brasília. The security forces intervened and about 1,500 people were arrested.The justices found that the rioters had been incited by Bolsonaro whose plan, they said, was for the military to step in and return him to power.At the time, Bolsonaro's lawyers called the 27 years and three months sentence \"absurdly excessive\".He was also barred from running for public office until 2060 - eight years after the end of his sentence.The former president called the trial a \"witch hunt\" and said it was designed to prevent him running in the 2026 presidential election.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jair Bolsonaro: Brazilian ex-president arrested after being determined a flight risk",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5656/live/8c802e20-c7a4-11f0-a788-49f2aacc0147.jpg"
      ],
      "datePublished": "2025-11-23T09:20:00.000Z",
      "dateModified": "2025-11-23T09:20:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nigeria sees one of worst mass abductions as 315 taken from school",
    "url": "https://www.bbc.com/news/articles/c3w7621xypyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ac15/live/18ee9de0-c78e-11f0-bca8-3f3db1bd72a1.png",
    "tag": "World",
    "date": "2025-11-23T10:10:03.000Z",
    "description": "2 hours agoAlex Smith, Chris Ewokor,BBC Africa, in Abuja, and Elettra NeysmithBBCSt Mary's School, in Niger state, was attacked in the early hours of ",
    "body": "2 hours agoAlex Smith, Chris Ewokor,BBC Africa, in Abuja, and Elettra NeysmithBBCSt Mary's School, in Niger state, was attacked in the early hours of Friday morningMore than 300 children and staff are now thought to have been kidnapped by gunmen from a Catholic school in central Nigeria, making it one of the worst mass abductions the country has seen.The Christian Association of Nigeria said 303 students and 12 teachers were taken from on St Mary's School in Papiri, Niger state - substantially more than previously estimated.It said the figures have been revised upwards \"after a verification exercise\".The kidnapping comes amid a surge of attacks by armed groups. The revised number of people taken surpasses the 276 abducted during the infamous Chibok mass abduction of 2014.Local police said armed men stormed the school at around 02:00 local time (01:00 GMT) on Friday morning, abducting students who were staying there.Dominic Adamu, whose daughters attend the school but were not taken, told the BBC: \"Everybody is weak... it took everybody by surprise.\"One distressed woman tearfully told the BBC that her nieces, aged six and 13, had been kidnapped, adding: \"I just want them to come home.\"Police said that security agencies were \"combing the forests with a view to rescue the abducted students\".All schools in Niger state were ordered to close on Saturday in response to the kidnapping.It was initially reported that 215 pupils had been taken but that figure has since been revised. The new number is believed to be almost half of the school's student population, the news agency AFP reports.Authorities in Niger state said the school had disregarded an order to close all boarding facilities following intelligence warnings of a heightened risk of attacks.They said in a statement the move exposed pupils and staff to \"avoidable risk\". The school has not commented on that claim.The kidnapping of people for ransom by criminal gangs, known locally as bandits, has become a major problem in many parts of Nigeria.The payment of ransoms has been outlawed in an attempt to cut the supply of money to the criminal gangs, but it has had little effect.Friday's mass abduction was the third such attack in the country in a week.On Monday, more than 20 schoolgirls, who the BBC has been told are Muslim, were kidnapped from a boarding school in neighbouring Kebbi state.A church was also attacked further south in Kwara state, with two people killed and 38 others abducted.Nigerian President Bola Tinubu has postponed his foreign trips - including to this weekend's G20 summit in South Africa - in order to address the security concerns.The rising insecurity is fuelling anger as well as fear in Nigeria, with citizens demanding stronger action to protect children and communities.The mass abduction follows claims by right-wing figures in the US, including President Donald Trump, that Christians are being persecuted in Nigeria.For months, campaigners and politicians in Washington have been alleging that Islamist militants are systematically targeting Christians. The Nigerian government has dimissed this claim. Earlier this month, Trump said he would send troops into Nigeria \"guns a-blazing\" if the African nation's government \"continues to allow the killing of Christians\".The Nigerian government has called claims that Christians are being persecuted \"a gross misrepresentation of reality\".An official said that \"terrorists attack all who reject their murderous ideology - Muslims, Christians and those of no faith alike\".In the north-east, jihadist groups have been battling the state for more than a decade.Organisations monitoring violence say most of the victims of these groups are Muslim because most attacks happen in the majority Muslim north of the country.In the centre of Nigeria, there are also frequently deadly attacks between herders - who are mostly Muslim - on farmers, who are largely Christian.However, analysts say these are often motivated by competition for resources, such as water or land, rather than religion.The militant Islamist group Boko Haram took 276 girls from their school in the town of Chibok 2014.The incident courted international attention and sparked a global campaign seeking their return, which included an intervention from then-US First Lady Michelle Obama.Many have since either escaped or been freed, but as many as 100 still remain missing.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nigeria sees one of worst mass abductions as 315 taken from school",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ac15/live/18ee9de0-c78e-11f0-bca8-3f3db1bd72a1.png"
      ],
      "datePublished": "2025-11-23T10:10:03.000Z",
      "dateModified": "2025-11-23T10:10:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US insists it authored Ukraine plan after claims of Russian 'wish list'",
    "url": "https://www.bbc.com/news/articles/c4g95x50kdyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0d12/live/1dc6f2f0-c828-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-23T07:20:28.000Z",
    "description": "5 hours agoJames Chater and Jaroslav LukivUS Secretary of State Marco Rubio has insisted that a proposed 28-point plan to end the Ukraine war, which h",
    "body": "5 hours agoJames Chater and Jaroslav LukivUS Secretary of State Marco Rubio has insisted that a proposed 28-point plan to end the Ukraine war, which has been widely viewed as favourable to Russia, was \"authored by the US\".It comes after a group of senators said they had been told by Rubio that the draft - which one said he described as a Russian \"wish list\" - did not reflect Washington's position.Rubio later distanced himself from those claims and said the plan came from the US, and was \"based on input\" from both Russia and Ukraine.His intervention came as he flew to Geneva in Switzerland for talks with Ukrainian and European security officials on the plan, which US President Donald Trump has called for Kyiv to agree to swiftly.Ukraine's allies in Europe have pushed back on major provisions in the draft, which has not been made public but details of which have been widely leaked.It includes Ukraine agreeing to withdraw troops from eastern areas which Russia has been unable to take by force, and to limit the size of its armed forces.On Saturday, Republican Senator Mike Rounds said Rubio had told a group of lawmakers that the draft plan was not US policy.He told the Halifax Security Forum: \"What [Rubio] told us was that this was not the American proposal.\"Rounds said he had been assured that the plan was presented to Steve Witkoff, who acts as Trump's overseas diplomatic envoy, by \"someone... representing Russia\". The senator continued: \"It is not our recommendation. It is not our peace plan.\"Shortly after, State Department spokesperson Tommy Pigott said Rounds's account of his conversation with Rubio was \"blatantly false\".He wrote on X: \"As Secretary Rubio and the entire administration has consistently maintained, this plan was authored by the United States, with input from both the Russians and Ukrainians.\"Rubio then posted on social media himself, saying: \"The peace proposal was authored by the US. It is based on input from the Russian side. But it is also based on previous and ongoing input from Ukraine.\"On Saturday, Trump - who has made securing a deal to end the conflict a central foreign policy goal during his second term - said the plan did not represent a \"final offer\" for Ukraine, having previously said President Volodymyr Zelensky \"will have to\" approve it.In a post on X on Saturday, Vice President JD Vance said criticism of the proposed peace plan \"either misunderstands the framework or misstates some critical reality on the ground\".  \"There is a fantasy that if we just give more money, more weapons, or more sanctions, victory is at hand,\" he said, adding that peace will not be made by \"politicians living in a fantasy land\". When details of the 28-point plan first emerged, Zelensky warned that his country faced \"one of the most difficult moments in our history\" over US pressure to accept it, while Russian President Vladimir Putin said it could form the \"basis\" of an agreement.Trump previously gave Ukraine until Thursday to approve the proposal, though said that deadline could be extended if talks progress. Both Rubio and Witkoff will attend the Geneva meeting on Sunday alongside security officials from the UK, France and Germany, as well as Ukraine.Ukraine's allies have already publicly pushed back against the plan, saying in a joint statement issued at the G20 summit in South Africa that it \"would leave Ukraine vulnerable to attack\".It said the plan had elements \"essential for a just and lasting peace\" but would \"require additional work\", citing concerns over border changes and caps on Ukraine's army.The statement was signed by the leaders of Canada, Finland, France, Ireland, Italy, Japan, the Netherlands, Spain, the UK, Germany and Norway. Two senior EU officials were also among the signatories.Speaking at the gathering in Johannesburg, French President Emmanuel Macron said the plan \"cannot simply be an American proposal\", adding that any agreement had to also guarantee security for \"all Europeans\". German Chancellor Friedrich Merz said \"we are still quite a long way from a good outcome for everyone\".Meanwhile, UK Prime Minister Sir Keir Starmer spoke to both Zelensky and Trump on Saturday. No 10 said he briefed the US president on European talks about the plan.Russia launched a full-scale invasion of Ukraine in February 2022, after which Ukraine became heavily dependent on US-manufactured weapons.In its current form, the plan would see Ukrainian troops withdraw from the part of the eastern Donetsk region that they currently control, and de facto Russian control of Donetsk, as well as the neighbouring Luhansk region and the southern Crimea peninsula annexed by Russia in 2014.The plan also includes freezing the borders of Ukraine's southern Kherson and Zaporizhzhia regions along the current battle lines. Both regions are partially occupied by Russia.Kyiv would receive \"reliable security guarantees\", the plan says, although no details have been given. The document says \"it is expected\" that Russia will not invade its neighbours and Nato will not expand further.On Saturday, Zelensky announced that his head of office Andriy Yermak would lead Ukraine's negotiating team for future talks on a peace deal, including any that may involve Russia.\"Our representatives know how to defend Ukraine's national interests and exactly what must be done to prevent Russia from launching a third invasion, another strike against Ukraine,\" the president said in a video statement posted on social media.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US insists it authored Ukraine plan after claims of Russian 'wish list'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0d12/live/1dc6f2f0-c828-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-23T07:20:28.000Z",
      "dateModified": "2025-11-23T07:20:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steve Rosenberg: Putin uncompromising as leaked plan reaches Moscow",
    "url": "https://www.bbc.com/news/articles/c5y9k0mrm2ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0ab6/live/15f39120-c6f0-11f0-b222-8b5ed945ab17.jpg",
    "tag": "World",
    "date": "2025-11-21T18:21:53.000Z",
    "description": "2 days agoSteve RosenbergRussia editorEPAIt was quite a contrast.On Thursday, a US Pentagon delegation was in Kyiv. They were talking to President Zel",
    "body": "2 days agoSteve RosenbergRussia editorEPAIt was quite a contrast.On Thursday, a US Pentagon delegation was in Kyiv. They were talking to President Zelensky about a draft plan to end the war in Ukraine.The same day, on Russian state TV, President Putin was in military fatigues. He was talking to his army chiefs about fighting on.\"We have our tasks, our goals,\" the Kremlin leader declared. \"The chief one is the unconditional achievement of the aims of the special military operation.\"The Izvestia newspaper called President Putin's visit to a command post \"a signal to America that he's prepared to negotiate on Ukraine, on Russia's terms\".Which brings us back to the peace plan.On Friday night, President Putin said he had seen the US settlement plan for Ukraine.Addressing a meeting of the Russian security council in Moscow, he described the American proposals as a \"modernised\" version of the plan discussed with Trump at the Alaska summit between the leaders in August.President Putin said he thought the plans could form the basis of final peace settlement.The 28-point proposal, which has been widely leaked and reported on, appeared after a visit to America by President Putin's envoy Kirill Dmitriev. He took part in three days of discussions in Miami with President Trump's special envoy Steve Witkoff.According to drafts of the peace proposal, Ukraine would cede to Russia parts of the Donbass still under Kyiv's control; the Ukrainian armed forces would be reduced in size and Ukraine would vow not to join Nato.\"The Russian military's effective work should convince Zelensky and his regime that it's better to strike a deal and do it now,\" President Putin's spokesman Dmitry Peskov previously told journalists on a Kremlin conference call.A peace proposal does not automatically mean peace. What if there's no agreement?Pro-Kremlin commentators insist that, deal or no deal, Russia will prevail.\"Everyone thought that the idea of a peace deal had sunk in a swamp,\" wrote Russian news outlet Moskovsky Komsomolets. \"But suddenly, a rocket has shot out of this bog with a new, or rather an 'old new' peace plan, with something of the Alaska summit about it. It shot out like a jack in the box.\"How long and how far will this missile fly? Will it crash, sabotaged by Europe and Kyiv? Even if the launch is a false start, it's unlikely to change the general trend. The balance of power is shifting in Russia's favour.\"But after nearly four years of war Russia is under pressure, too. Since its full-scale invasion of Ukraine, not only has Russian's army suffered huge losses on the battlefield, but back home the economy is faltering. Russia's budget deficit is growing, revenues from oil and gas falling.\"Russia's industry is somewhere between stagnation and decline,\" declared the broadsheet Nezavisimaya Gazeta this week.It's unclear, though, whether economic pressures will change President Putin's calculations and convince him that now is the moment to end his so-called special operation: even on terms that many believe benefit Moscow.Many. But not everyone.Some elements of the peace plan haven't gone down well in Russia. Some reports suggest that Ukraine could be offered security guarantees modelled on Nato's Article 5. That might commit Western allies to treat any future Russian attack on Ukraine as an attack on the transatlantic community as a whole and trigger a combined military response.\"This is, in effect, Ukraine in Nato,\" wrote Moskovsky Komsomolets, \"only without the deployment of bases and weapons on its territory.\"The full details of the peace plan have yet to be confirmed. We may be entering another period of intense diplomacy.For now, though, Russia's war on Ukraine continues.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steve Rosenberg: Putin uncompromising as leaked plan reaches Moscow",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0ab6/live/15f39120-c6f0-11f0-b222-8b5ed945ab17.jpg"
      ],
      "datePublished": "2025-11-21T18:21:53.000Z",
      "dateModified": "2025-11-21T18:21:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Watch: Indonesia’s Semeru volcano spews giant ash clouds as it erupts",
    "url": "https://www.bbc.com/news/videos/clyzy88l87no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/55e2/live/92ceee00-c5b6-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-20T02:24:49.000Z",
    "description": "The highest mountain on Indonesia's Java Island, a volcano called Mount Semeru, has erupted, spewing gigantic columns of ash clouds as tall as 2km (1.",
    "body": "The highest mountain on Indonesia's Java Island, a volcano called Mount Semeru, has erupted, spewing gigantic columns of ash clouds as tall as 2km (1.2 miles) above its peak.Large plumes of smoke can be seen engulfing a bridge and spreading across the surrounding countryside, stopping locals in their tracks.CCTV footage showed a pyroclastic flow – a fast-moving avalanche of hot gas, ash and volcanic rock – billowing from the mountain, with a distance of 7km from the summit.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Watch: Indonesia’s Semeru volcano spews giant ash clouds as it erupts",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/55e2/live/92ceee00-c5b6-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-20T02:24:49.000Z",
      "dateModified": "2025-11-20T02:24:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who killed young Chechen woman who fled Russia for a life of freedom?",
    "url": "https://www.bbc.com/news/articles/c4gwgx803l5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/53f6/live/aacd6d30-c6c2-11f0-82b1-6148fee2770d.jpg",
    "tag": "World",
    "date": "2025-11-23T00:02:28.000Z",
    "description": "12 hours agoOlga Prosvirova & Zlata OnufrievaBBC News RussianAishat Baimuradova/Getty/BBCAishat told her friends she had been raised in a strictly rel",
    "body": "12 hours agoOlga Prosvirova & Zlata OnufrievaBBC News RussianAishat Baimuradova/Getty/BBCAishat told her friends she had been raised in a strictly religious familyWhen 23-year-old Aishat Baimuradova fled her home earlier this year, she believed she finally had a chance to live the way she wanted.Coming from Chechnya, a conservative Muslim republic in Russia, she cut her hair short, stopped covering her head, shaved off part of her eyebrow and posted quirky selfies on Instagram.She told her new friends she could finally breathe.In October, Aishat was found dead in a rented flat in neighbouring Armenia. Police say she was murdered.Two people were seen leaving the building where she was found, including a woman Aishat had befriended not long before her death. Both reportedly left for Russia soon afterwards.Russians do not need a passport to enter Armenia; their internal ID is enough. That also makes it an easy route for anyone trying to flee.Chechnya, in Russia's North Caucasus, is often described by rights groups as a state within a state - a place where power is highly personalised and loyalty to long-standing leader Ramzan Kadyrov often over-rides laws and formal institutions.For years, human rights organisations have documented enforced disappearances, torture and extrajudicial killings in the republic, as well as systematic persecution of those who dissent.Chechen officials have consistently denied these allegations, complaining of fabrications aimed at discrediting the region.Aishat Baimuradova/InstagramHer friends say Aishat was a very open person seeking connection with peopleSeveral high-profile critics of Chechen authorities have been killed abroad.In 2009, Umar Israilov, a former bodyguard of Ramzan Kadyrov, was shot dead in Vienna, where he had sought asylum. Austrian authorities called the assassination politically motivated and linked the killers to Chechnya.Former Chechen rebel Zelimkhan Khangoshvili was shot dead in a Berlin park in 2019, in an attack blamed on Russian security services.But Aishat Baimuradova is the first known Chechen woman to have died in suspicious circumstances, not long after fleeing Russia.Like many other women who escape the region, she had complained of being controlled by her family. She said she was forced into a marriage, monitored, and barred from leaving home or using her phone. The BBC was not able to reach her family for a comment.Aishat arrived in Armenia with the help of SK-SOS, a crisis group that helps people facing danger in the North Caucasus. She had complained openly of conservative gender rules and the suffocating control women face in Chechnya.At first, she worked in a small town, then moved to the capital, Yerevan, hoping for a better job and more opportunities.To many who flee, such visibility is unthinkable. Most use false names, avoid showing their faces, and refuse to meet new people. Aishat chose a different path. \"She really wanted a normal life,\" her friend who asked to remain anonymous told the BBC. \"And she wanted to trust people.\"ReutersRamzan Kadyrov has ruled Chechnya since 2007. Critics accuse him of turning the Russian republic into a state within a stateHer family tried to persuade her to come back, but when nothing came of it they disowned her, according to SK SOS.\"They said to her: 'You are no longer our daughter or our wife. We won't touch you - just don't touch us,\" Alexandra Miroshnikova, spokesperson for SK SOS, told the BBC.Her uncle told local media the family had no involvement in her death.On the night of her death, Aishat was with a woman she had recently met online, who claimed to come from Dagestan, another Russian republic in the North Caucasus.People who knew Aishat told the BBC it was the woman who had first made contact with her on social media, later coming to Armenia and inviting her to parties.A man captured with her on CCTV as they left the building where Aishat's body was found was reported by a popular Russian Telegram channel to be of Chechen origin. Investigative outlet Agentstvo identified him as a relative of a businessman close to Ramzan Kadyrov.Chechen authorities deny any connection to Baimuradova's death, condemning such suggestions as a \"terrorist information attack\". Officials have also criticised groups assisting women who flee, accusing them of \"destroying family traditions\".VALERY HACHE/AFP via Getty ImagesChechen women who have sought refuge in Europe often avoid communicating with the diasporaArmenian authorities say they are investigating two unnamed people in connection with Aishat Baimuradova's murder, but they have released no further details about them.Ramzan Kadyrov is sensitive to people criticising Chechnya from abroad, says Michael Dennis, an expert on Chechen politics at the University of Texas.\"The very existence of a diaspora is a clear signal to the entire world that something is wrong in Chechnya. It's a matter of personal pride and political image,\" Mr Dennis told the BBC.Since the early 2000s, asylum seekers from Chechnya have been coming to Europe - fleeing first the war and later Kadyrov's repressive rule.But changes to EU migration policy, followed by visa restrictions for Russians because of the war in Ukraine, have all but closed that route.That leaves the South Caucasus, where Russians can travel visa-free, as the easiest escape route, but far from the safest.In July, another escapee, 24-year-old Laura Avtorkhanova, was found in a shelter in Georgia by a group of male relatives who reportedly tried to coerce her into returning to Russia. After being questioned by police she was able to stay safely in Georgia.For other Chechen women who have fled, Aishat's death has reinvigorated a fear that has haunted them since they left Russia.Several have told the BBC how even before her murder they had steered clear of community events, avoided speaking Chechen in public and restricted their social media presence. Now they worry it may not be enough to hide from those who may want to punish them.\"The fear I've lived with all my life - embedded in my DNA - has reawakened with renewed vigour,\" said one escapee living in Western Europe, who asked to hide her name and precise location.\"It's like sleep paralysis: a monster appears, and I lie there frozen, staring into its eyes. It's the fear of being killed.\"\"You can escape,\" she said, \"but you never really feel free.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who killed young Chechen woman who fled Russia for a life of freedom?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/53f6/live/aacd6d30-c6c2-11f0-82b1-6148fee2770d.jpg"
      ],
      "datePublished": "2025-11-23T00:02:28.000Z",
      "dateModified": "2025-11-23T00:02:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]