[
  {
    "title": "Grammy Awards 2026: Who will win and how to watch",
    "url": "https://www.bbc.com/news/articles/cwy12z197q8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e1c7/live/a535b150-fcf2-11f0-9c55-8bade468c676.jpg",
    "tag": "World",
    "date": "2026-02-01T00:31:38.000Z",
    "description": "8 hours agoMark SavageMusic correspondentGetty ImagesCynthia Erivo, Sabrina Carpenter and Lady Gaga all have multiple Grammy nominations this yearAt t",
    "body": "8 hours agoMark SavageMusic correspondentGetty ImagesCynthia Erivo, Sabrina Carpenter and Lady Gaga all have multiple Grammy nominations this yearAt the ripe old age of 67, the Grammy Awards are still considered \"music's biggest night\". This year's ceremony takes place in LA on Sunday, with everyone from Harry Styles to Chaka Khan due to attend.Kendrick Lamar tops the nominations with nine nods, most of them for his sixth album, GNX. He was the main winner at last year's ceremony, too, winning both record and song of the year for his scorching diss track, Not Like Us.Other contenders include Lady Gaga, with seven nominations, along with Bad Bunny, Sabrina Carpenter and Leon Thomas, who have six each.In total, there are 95 awards, distributed over a mind-boggling eight hours. Alongside banner categories like album of the year, we'll find out who had the best album artwork, and who's made the best \"ambient, new age or chant\" album.Here's everything you need to know ahead of the ceremony.1) Who's going to win album of the year?Getty ImagesBad Bunny could be the first person to win the night's main prize with an album sung entirely in SpanishMost insiders agree that there's a three-way race for the night's biggest prize - with Bad Bunny, Kendrick Lamar and Lady Gaga the presumed favourites.None of them have ever won before, despite multiple nominations, and there are good reasons to think they're the front-runners.Gaga is a Grammy darling, with 14 wins from 45 nominations. Her seventh album, Mayhem, is a triumphant return to the maximalist pop that made her famous, delivered with the hard-won grace of someone who's endured 18 years in the pop machine. Like Beyoncé last year, voters might feel she's put in the work to earn the top title.Lamar is in a similar position. He's the only artist with album of the year nominations for five consecutive releases, and GNX is a snappy, crowd-pleasing tour de force.Giving him the prize would also go some way to correcting the Grammys' rap problem. The last time a hip-hop album won album of the year was in 2004.But Bad Bunny is the presumptive front-runner. The Puerto Rican star's musically ambitious Debí Tirar Más Fotos, fuses live instrumentation with the hip-swaying pulse of reggaeton, plena, salsa and a multitude of other Latin styles.A win for Bad Bunny would mark the first win for a Spanish language album.That said, the Grammys have a habit of making spectacularly weird decisions, so don't discount the chances of Justin Bieber or Sabrina Carpenter lifting the trophy.Notably, no matter who wins album of the year, it will be their first victory in the category.2) Will there be justice for Milli Vanilli?!Getty ImagesRob Pilatus (left) and Fab Morvan won best new artist in 1990 - but they didn't get to keep the trophies for longPop duo Milli Vanilli were stripped of their Grammy Award for best new artist in 1990, when it was discovered that the members, Fab Morvan and Rob Pilatus, had been miming to someone else's vocals.Thirty-six years later, Morvan is nominated for best audiobook for his memoir You Know It's True: The Real Story of Milli Vanilli.It's an eye-opening and harrowing story that lays bare what fame demands of you, and how Morvan struggled to rebuild his life after becoming one of music's biggest punchlines.If he wins, it could be an emotional moment of redemption.3) Can Olivia Dean win best new artist?Olivia Dean was one of the biggest break-out stars of last yearThe British star is certainly a front-runner. Her joyful, old-school pop songs were deservedly massive last year, pairing classic songcraft with an unabashedly romantic outlook.Her album, The Art Of Loving, had a golden streak in December, just as voters were filling in their ballots, boosting her odds of victory.It came out too late to be shortlisted for album of the year, though. She'll have to wait 12 months for that one.Dean faces strong competition from fellow Brit Lola Young, whose cathartically confrontational single Messy was a breakout hit last year.R&B artist Leon Thomas could also sneak off with the trophy. A former writer for Ariana Grande, SZA and Post Malone, he's the only best new artist nominee to pick up an album of the year nod, which suggests he's popular with voters.The rest of the pack includes influencer-turned-pop star Addison Rae, influencer-turned-pop star Alex Warren, frenetic girl group Katseye, chiselled rock star Sombr and LA indie outfit The Marías.For the second year in a row, all eight new artist nominees will perform during a special segment on Sunday night.4) What about the other big prizes?Getty ImagesAfter performing at last year's Super Bowl, Kendrick Lamar and SZA are hot favourites to win record of the year for their loved-up duet, LutherOne of the year's most fiercely-contested categories is record of the year - better understood as \"best single\".That's where you'll find Sabrina Carpenter's Manchild butting heads with Lady Gaga's Abracadabra and Chappell Roan's The Subway.But none of them really captured the public imagination in the same way as Rosé and Bruno Mars's APT. A honking great crossover hit, it has exactly the sort of cross-generational appeal the Grammys loves.The only serious competition is Kendrick and SZA's Luther, a sumptuous rap ballad that spent 13 weeks at number one in America last year.If APT wins, it'll be a record-breaker twice over. Rosé will become the first K-pop artist to win a Grammy; and Mars will become the only artist to win record of the year four times. (Right now, he's tied with Paul Simon on three.)The song of the year award - which recognises the songwriters - has almost exactly the same shortlist, with the addition of Golden, from the movie K-Pop Demon Hunters.The prominent use of samples and interpolations in Luther and APT could put them at a disadvantage here; which is good news for Carpenter's Manchild - whose country-pop hybrid appeals to a broad cross-section of voters.Bad Bunny could also win here for DTMF (I should have taken more photos), a gorgeous rumination on the passage of time that segues into a lively celebration of life.5) Is there a list of Grammy performers?Getty ImagesJustin Bieber will take to the stage ahead of his headline slot at this year's Coachella Music FestivalHeck, yeah. And what a list...Justin BieberSabrina CarpenterClipse & Pharrell WilliamsOlivia DeanKatseyeLady GagaLauryn Hill (Tribute to D'Angelo & Roberta Flack)Reba McIntyre with Brandy Clark and Luka NelsonThe MaríasBruno MarsPost Malone, Slash, Chad Smith (Tribute to Ozzy Osbourne)Addison RaeRoséSombrTyler, The CreatorLeon ThomasAlex WarrenLola Young6) Will Taylor Swift be performing?ReutersTaylor Swift's Life Of A Showgirl album was released after the eligibility period for this year's Grammy AwardsNot on your nelly.Rumours that Taylor Swift would turn up and tinkle the ivories were shot down by Grammy producer Ben Winston.Asked about the speculation by the showbiz website Hits Daily Double, he pointed out that the source of the story was... er, the showbiz website Hits Daily Double.\"The only reason people think Taylor might be performing or coming is because Hits decided to print it this week and it was picked up globally,\" he said.\"But Hits just totally made that up. And now I am getting asked about it by you, as if it's a real thing, when it was made up in your office!\"Also not performing: Bad Bunny. His gig headlining the Super Bowl half time show next month means he's unable to take the stage at the Grammys.7) Is it finally time for a K-pop Grammy?Getty ImagesRosé could be the first K-Pop star to win a Grammy on SundayRight now, no K-pop artist has ever won a Grammy - although BTS have received multiple nominations and even performed at the ceremony.That could change on Sunday. Rosé, one quarter of the South Korean girl group Blackpink, is nominated for three awards for APT, her irresistible, cheerleader chanting duet with Bruno Mars. In the song of the year, she goes head-to-head with the fictional girl group Huntr/x, who appear in the hit animation K-Pop Demon Hunters.And Katseye, a global girl group trained under the arduous K-pop system, are also up for best group and best pop group performance, for their single Gabriela.They might not win, but there's a growing recognition that K-pop has become a cultural and commercial force. For Audrey Nuna, one of the singers behind Huntr/x, getting to perform at the show represents a huge step forward.\"You're going to see three Korean faces,\" she told E! News. \"To think about the kids who are going to see that, and hopefully for that to shape their understanding of what they can do in this world, is the stuff that is giving me chills up my spine.\"In an interview earlier this week, the Recording Academy CEO, Harvey Mason Jr, confirmed there was a \"groundswell\" amongst voters for a separate K-pop category. Could it be created just in time for BTS's comeback? Watch this space.8) Any other notable nominees and surprises?EPAThe Dalai Lama is up for his first ever GrammyBarbra Streisand could correct a historic wrong on Sunday night. Her duets album, The Secret of Life, is nominated for best traditional pop album - a category she has lost 13 times since it was introduced in 1992.Her chances look slim, though, with stronger albums by Lady Gaga, Elton John & Brandi Carlile, and Icelandic jazz singer Laufey all in the running.Festival headliners and generally excellent people Haim could become the first ever all-female band to win best rock album.\"We really set out to make a rock album this time, so it's a huge milestone,\" Alana Haim told the BBC after their nomination. \"But we're just grateful for the women that came before us.\"Elsewhere, the Dalai Lama is nominated for best audio book, for Meditations: The Reflections Of His Holiness The Dalai Lama. It's the first time a Dalai Lama has received a Grammy nomination.And we could end the night with the youngest-ever Grammy winner. Eight year old Aura V is nominated for best children's album for Harmony, a bubbly, life-affirming record she made with her dad, Harold Simmons II. 9) Will artists address the political situation in the US?ReutersBillie Eilish has been a vocal critic of the actions of Immigration enforcement officers in the USIn the week that Bruce Springsteen released a song denouncing \"King Trump\" and \"federal thugs\" in Minneapolis, it seems impossible that politics won't feature on the Grammys stage.Billie Eilish, nominated for record and song of the year, has called on her fellow musicians to \"speak up\" about the Immigration and Customs Enforcement (ICE) officers, whose actions have resulted in the death of two protestors. Bad Bunny didn't need prompting. He previously called ICE agents \"sons of bitches\" who won't leave \"people alone and working\". President Trump has defended the immigration operation in Minnesota, saying it took \"thousands of hardened criminals\" out of the state. On Wednesday, however, he said his administration would \"de-escalate a little bit\", amid rising tensions.Grammys boss Harvey Mason Jr said it was inevitable that emotions would spill onto the stage this Sunday.\"You're going to hear and feel what's going on in the world through the music,\" he  told CNN. \"Maybe some people will choose to speak out about it, but you're definitely going to feel it in the music, in the performance, in the passion that goes into the art.\"10) Who votes for the Grammys?Getty ImagesWinners all receive a golden gramophone trophyThis year, about 15,000 people were eligible to vote for the Grammys - including musicians, producers, lyricists, and even the people who write album liner notes.To qualify, they must be currently working in the music industry, and pay an annual subscription of $150 (£120) to the Recording Academy. All former winners are also eligible to vote.Every member is allowed to vote in up to 10 categories across three fields, such as rock, classical and R&B. They are encouraged only to vote in genres where their expertise lies.Additionally, every member, regardless of their background, gets to vote for the six biggest awards of the night. Those are: Album of the year, record of the year, song of the year, best new artist, songwriter of the year and producer of the year.The 2026 awards recognise music released between 31 August, 2024 and 30 August, 2025. More than 20,000 records were submitted for consideration this year. The winners will not be revealed until the ceremony.11) How can I watch in the UK?Getty ImagesComedian Trevor Noah is hosting the ceremony for the sixth and final timeThe ceremony is split into two parts, with the first 80 awards distributed during what's called the \"premiere ceremony\" at 12:30 in Los Angeles / 20:30 in London on Sunday.It's often worth tuning in. The winners in the more obscure categories are less polished and more excited about winning, and the performances are looser and, dare I say it, more musical than the grandiose set pieces you'll see later.It's also the place to see British stars like Wet Leg, Yungblud, FKA Twigs and Sleep Token find out whether they've won in the rock and dance categories.That's also where you want to go to watch red carpet coverage, which kicks off at 15:00 in Los Angeles / 23:00 in the UK.Finally, the main show kicks off at 17:00 Los Angeles / 01:00 Monday in the UK. It's broadcast live in the US on CBS and streaming platform Paramount Plus. At present, there is no way to watch in the UK without circumventing geographical streaming restrictions, but clips from the ceremony appear on social media with incredible speed.Full speeches and select performances are usually uploaded to YouTube the following day.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Grammy Awards 2026: Who will win and how to watch",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e1c7/live/a535b150-fcf2-11f0-9c55-8bade468c676.jpg"
      ],
      "datePublished": "2026-02-01T00:31:38.000Z",
      "dateModified": "2026-02-01T00:31:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Deadly gun and bomb attacks hit Pakistan's Balochistan province",
    "url": "https://www.bbc.com/news/articles/cn42nedxqyqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e3b0/live/667a20f0-ff03-11f0-a8b8-bdd2c5f9bcad.jpg",
    "tag": "World",
    "date": "2026-02-01T00:57:25.000Z",
    "description": "7 hours agoJaroslav LukivEPA/ShutterstockSome roads in Balochistan's provincial capital Quetta have been sealed offA series of gun and bomb attacks ac",
    "body": "7 hours agoJaroslav LukivEPA/ShutterstockSome roads in Balochistan's provincial capital Quetta have been sealed offA series of gun and bomb attacks across Pakistan's south-western Balochistan province have killed 18 civilians and 15 security service personnel, the country's military says.Security forces responding to the violence killed at least 92 attackers, the military said. The Balochistan Liberation Army (BLA) rebel group had earlier said it was behind the attacks, claiming dozens of soldiers were killed.The escalation is one of the deadliest days of violence in the impoverished province, where Pakistan's government has been battling an ethnic insurgency for decades.Pakistan accused India of supporting the BLA. Delhi has repeatedly denied such accusations.The military said multiple attacks had targeted civilians around the provincial capital Quetta and other locations.Grenade and gun attacks in 12 cities and towns across the province targeted police and paramilitary installations, as well as prisons and government buildings. Some key administrative buildings in Quetta and nearby roads were reported to have been sealed off during the day. Mobile phone services were jammed, and regional train services were suspended.Prime Minister Shehbaz Sharif later praised the military, pledging to \"continue the war against terrorism until its complete eradication\".The BLA accuses Pakistan's federal government of exploiting the rich mineral resources of its largest province without the local population benefiting. Local activists also blame Pakistani security forces for enforced disappearances, which Islamabad denies.Balochistan covers nearly 44% of the country's total land, sharing a volatile border with Iran and Afghanistan and covering part of the Arabian Sea coastline. It is home to about 5% of the country's more than 240 million people. The province is also the richest in terms of natural resources, including gas and minerals. The region derives its name from the Baloch tribe, which is the largest ethnic group there. Resistance against the Pakistani government and an insurgency advocating for an independent state for the Baloch people began in 1948, after Pakistan gained independence from the British Empire.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Deadly gun and bomb attacks hit Pakistan's Balochistan province",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e3b0/live/667a20f0-ff03-11f0-a8b8-bdd2c5f9bcad.jpg"
      ],
      "datePublished": "2026-02-01T00:57:25.000Z",
      "dateModified": "2026-02-01T00:57:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Canada's Poilievre sweeps Conservative party leadership test with 87.4%",
    "url": "https://www.bbc.com/news/articles/c14r1023yy6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/11e9/live/10b8b0e0-fe55-11f0-a70e-b952f6bd3d91.jpg",
    "tag": "World",
    "date": "2026-01-31T14:45:42.000Z",
    "description": "18 hours agoNadine YousifSenior Canada reporter, Calgary, AlbertaReutersPierre Poilievre spoke to a full room of Conservative supporters in Calgary on",
    "body": "18 hours agoNadine YousifSenior Canada reporter, Calgary, AlbertaReutersPierre Poilievre spoke to a full room of Conservative supporters in Calgary on Friday, where he pitched himself to stay on as leaderPierre Poilievre has cemented his position as Canada's Conservative Party leader, having received a strong endorsement from members despite presiding over recent electoral defeats.He secured 87.4% of votes in the leadership review, held on Friday in Calgary among delegates instead of the wider membership, after delivering a speech calling for Canadians to stay united in the face of an \"uncertain world\" and amid growing separatist sentiments in Alberta and Quebec. \"A house divided cannot stand,\" Poilievre said.A leadership review is automatically triggered after an election loss - in this case Poilievre's defeat to Mark Carney's Liberals last April, in which he also lost his own seat. Despite the political setbacks, delegates who spoke to the BBC said that they still had confidence in Poilievre to lead them into the next election.\"As far as the party is concerned, I think we're in the right direction,\" said Thomas Bambrick, a delegate from Winnipeg, adding that the vote result equals to a \"resounding yes\" for trust in the Conservative leader. Ahead of the vote, Poilievre delivered a nearly hour-long speech that doubled as a pitch to Conservative voters at the party's convention in Calgary, Alberta, where he outlined his vision for Canada's future should his party form the next government. Canada's conservative leader faces leadership testWho is Pierre Poilievre?He focused much of his messaging on affordability and crime - issues that have long resonated with his base - and promised a small government that would represent \"people who have felt unseen for too long\". Poilievre also touched on geopolitical tensions facing Canada, including its strained relationship with the US, arguing that the same domestic policies he was pitching will also help Canada \"stand on its own two feet\". His speech was made on a backdrop of a growing grassroots separatist movement in the Conservative stronghold of Alberta, where a process of collecting signatures to trigger an independence referendum is under way. In Quebec, the sovereignist Parti Québécois is also polling ahead, promising its own independence referendum in the province should it be elected to the provincial government later this year. Poilievre addressed these threats to Canadian unity in his speech, blaming the Liberal Party for people losing \"hope in the confederation\". Party members who spoke to the BBC said the speech was well received, praising it for sticking to traditional Conservative messaging while also confronting separatism - what one member called \"the elephant in the room\".Ballots in Friday's vote were cast in person by delegates who were selected to represent Conservative voters in each constituency across Canada.Poilievre has remained popular with his party despite the Conservative's unexpected loss last year, as well as the loss of the seat he had held for more than 20 years.In recent months, two elected Conservative MPs have left the party to join the Liberals, who under Carney have adopted more centrist policies, raising questions about the party's unity and Poilievre's leadership. But supporters of Poilievre credit him with delivering historic gains for the party, which received a record 41% of the popular vote last year. In particular, the Conservative leader has been successful in courting young voters through his messaging on affordability issues like the cost of living and housing. He has struggled, however, with defining his party's stance on US President Donald Trump, whom many Canadians have come to view as an existential threat due to his tariffs on Canadian goods and his rhetoric around it becoming the 51st US state.Poilievre has also struggled with his likeability, with surveys showing that more than half of Canadians hold a negative view of him. Many cite his tone, which they view as overly combative. Polls indicate his party is still trailing, with a Léger poll released this week showing the Conservatives nine points behind the Liberals.Poilievre addressed some of the shortcomings in his speech on Friday, telling party members that a lesson he learned is to not waver on his messaging. \"You told us to ignore the voices who keep telling us to abandon our conservative principles,\" he said as the audience applauded. \"We will stay true to our principles.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Canada's Poilievre sweeps Conservative party leadership test with 87.4%",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/11e9/live/10b8b0e0-fe55-11f0-a70e-b952f6bd3d91.jpg"
      ],
      "datePublished": "2026-01-31T14:45:42.000Z",
      "dateModified": "2026-01-31T14:45:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Iran gas explosions kill five people, officials say",
    "url": "https://www.bbc.com/news/articles/cd9ew5p3zvko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/af8b/live/c0e0ff40-fed7-11f0-b7e1-afb6d0884c18.png",
    "tag": "World",
    "date": "2026-02-01T05:12:13.000Z",
    "description": "3 hours agoMaia DaviesBBCOfficials say a gas leak was the blame for the explosion in Bandar AbbasFive people have been killed in two separate explosio",
    "body": "3 hours agoMaia DaviesBBCOfficials say a gas leak was the blame for the explosion in Bandar AbbasFive people have been killed in two separate explosions in Iran which local officials and state media say were caused by gas leaks.One person was killed and 14 injured in a blast at a residential building in the southern city of Bandar Abbas on the Gulf coast, a local official told Iran's semi-official Mehr news agency.Another explosion killed four people in the south-western city of Ahvaz, the state-run Tehran Times reported.It comes as tensions persist in the region after a build-up of US forces in the Gulf and pressure on Tehran to strike a deal on its nuclear programme from President Donald Trump.Speaking to journalists while on his way to Florida on Saturday night, Trump was asked whether he had decided what to do in Iran and said \"I certainly can't tell you that.\" But he added, reiterating comments made to Fox News earlier on Saturday, that Iran was \"seriously\" talking to Washington.He said he hoped they would negotiate something acceptable, and noted that the US has \"very big powerful ships\" in the region.Earlier, in the port city of Bandar Abbas, state TV said an explosion had ripped though an eight-floor building, \"destroying two floors, several vehicles, and shops\" in the Moallem Boulevard area.The local fire department chief Mohammad Amin Liaqat said a preliminary assessment showed it had been caused by a gas leak and \"build-up\".\"My colleagues will give more details in the next few hours,\" he said in a video published by Mehr.Mehrdad Hassanzadeh, a regional official, told the news agency that the injured had been taken to hospital.Semi-official news agency Tasnim denied social media reports that a Revolutionary Guards Corps navy commander had been targeted in the blast.Elsewhere, Tehran Times reported a second explosion at a residential building in the Kianshahr neighbourhood of Ahvaz, near the border with Iraq.It reported that emergency officials had rescued a child trapped beneath debris and transferred him for medical treatment.Speaking to Fox News on Saturday, Trump said Iran was \"negotiating\", adding that Washington could not share its plans with its allies in the Gulf.\"We'll see if we can do something, otherwise we'll see what happens... we have a big fleet heading out there.\"Iran's President Masoud Pezeshkian said conflict would not be in the interest of either country nor the broader region.\"The Islamic Republic of Iran has never sought and in no way seeks war,\" he said during a call with his Egyptian counterpart Abdel Fattah al-Sisi, news agency AFP reported citing a statement from Iran's presidency.Separately, the head of the country's Supreme National Security Council Ali Larijani met the Qatari prime minister in Tehran on Saturday and \"reviewed ongoing efforts to de-escalate tensions in the region\", Qatar's foreign ministry said.Larijani, whom the Kremlin said had also met Russia's President Putin for talks on Friday, wrote on X: \"Contrary to the hype of the contrived media war, structural arrangements for negotiations are progressing.\" Iran's foreign minister has said Tehran is open to talks with the US provided they are based on trust and respect but cautioned that its missile defence system would \"never\" be the subject of negotiation.Trump told Tehran on Wednesday that time was \"running out\" for it to reach a deal on its nuclear programme - which Iran insists is peaceful - and later said they must also \"stop killing protesters\" to avoid military action.It came after he had promised to intervene to help those involved in a brutal crackdown on protests in the country earlier this month, although he later said he had heard on good authority that the execution of demonstrators had stopped.The US-based Human Rights Activists News Agency says it has confirmed the killing of more than 6,300 people since the unrest began in late December, and is investigating another 17,000 reported deaths.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iran gas explosions kill five people, officials say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/af8b/live/c0e0ff40-fed7-11f0-b7e1-afb6d0884c18.png"
      ],
      "datePublished": "2026-02-01T05:12:13.000Z",
      "dateModified": "2026-02-01T05:12:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US Commerce Secretary Howard Lutnick planned Epstein island visit, emails show",
    "url": "https://www.bbc.com/news/articles/crmlr0nk8y9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8525/live/9e685b50-fecf-11f0-bf43-0b2a3f17561d.jpg",
    "tag": "World",
    "date": "2026-01-31T20:02:12.000Z",
    "description": "12 hours agoGrace Eliza GoodwinGetty ImagesUS Commerce Department Secretary Howard Lutnick planned a visit to Jeffrey Epstein's island with his family",
    "body": "12 hours agoGrace Eliza GoodwinGetty ImagesUS Commerce Department Secretary Howard Lutnick planned a visit to Jeffrey Epstein's island with his family, emails show - years after Lutnick claimed to have cut ties with the convicted paedophile.The billionaire businessman, his wife, their four children and another family planned to travel to Little Saint James in 2012, according to emails included in the latest Epstein files released by the US Department of Justice (DOJ).The emails contradict statements Lutnick made in October about vowing in 2005 to \"never be in a room\" with Epstein again.A Commerce Department spokesperson said Lutnick had never been accused of any wrongdoing in connection to Epstein.On Friday, the justice department released millions of pages from Epstein files, the largest number of documents shared by the government since a law mandated their release last year.Several emails show Lutnick and his family planned a visit to Little Saint James - a private island that Epstein purchased in 1998.In one email from December 2012, Lutnick's wife Allison wrote to Epstein's assistant: \"We are looking forward to visiting you. We will be coming from Caneel Bay in the morning. We are a crowd... 2 families each with 4 kids ranging in age from 7-16! 6 boys and 2 girls. I hope that's okay. We would love to join you for lunch.\"In another email, sent to a redacted recipient days before his wife's email, Lutnick writes: \"Hi Jeff, We are landing in St. Thomas early Saturday afternoon and planning to head over to St. Bart's/Anguilla on Monday at some point... Does Sunday evening for dinner sound good?\"Lutnick then asks for specific location details for his boat captain, and mentions that another family is with his family.Other emails were exchanged in December about Howard Lutnick joining Epstein for lunch on the island. On 24 December 2012, Lutnick received an email from a redacted sender that said Epstein wanted to pass a message to him, which said: \"Nice seeing you\" - suggesting that at least one visit did happen.The emails do not indicate any wrongdoing.According to an October 2025 interview with the New York Post, Lutnick said he had cut ties with Epstein in 2005 when the pair were neighbours in New York.Lutnick explained to the newspaper that Epstein had given him and his wife a tour of his Manhattan townhouse, where the late financier showed off his massage room.\"I say to him, 'Massage table in the middle of your house? How often do you have a massage?'\" Lutnick told the Post. \"And he says, 'Every day.' And then he gets, like weirdly close to me, and he says, 'And the right kind of massage'.\"Lutnick told the outlet that, after leaving Epstein's house, \"in the six to eight steps it takes to get from his house to my house, my wife and I decided that I will never be in the room with that disgusting person ever again\".The Commerce Department said in a statement to the BBC that \"Secretary Lutnick had limited interactions with Mr Epstein in the presence of his wife and has never been accused of wrongdoing\".Three million pages, 180,000 images and 2,000 videos were posted publicly by the DOJ on Friday.Epstein was convicted in 2008 in Florida for soliciting sex from a 14-year-old girl after coming to a controversial plea agreement with prosecutors.He died in August 2019 while in jail on charges in a sex trafficking case.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US Commerce Secretary Howard Lutnick planned Epstein island visit, emails show",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8525/live/9e685b50-fecf-11f0-bf43-0b2a3f17561d.jpg"
      ],
      "datePublished": "2026-01-31T20:02:12.000Z",
      "dateModified": "2026-01-31T20:02:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Elon Musk's SpaceX applies to launch 1m satellites into orbit",
    "url": "https://www.bbc.com/news/articles/cyv5l24mrjmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/647e/live/2eac0410-febb-11f0-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-01-31T16:19:17.000Z",
    "description": "16 hours agoMaia DaviesReutersElon Musk - the boss of SpaceX as well as Tesla and X - is the world's richest personElon Musk's SpaceX has applied to l",
    "body": "16 hours agoMaia DaviesReutersElon Musk - the boss of SpaceX as well as Tesla and X - is the world's richest personElon Musk's SpaceX has applied to launch one million satellites into Earth's orbit to power artificial intelligence (AI).The application claims \"orbital data centres\" are the most cost and energy-efficient way to meet the growing demand for AI computing power.Traditionally, such centres are large warehouses full of powerful computers that process and store data. Musk's aerospace firm claims processing needs due to the expanding use of AI are already outpacing \"terrestrial capabilities\".It would increase the number of SpaceX satellites in orbit drastically. Its existing Starlink network of nearly 10,000 satellites has already been accused of creating congestion in space, which Musk denies.The new network could comprise up to one million solar-powered satellites, according to the application filed on Friday with the US Federal Communications Commission - which does not specify a timeline for the plan.SpaceX claims the system would deliver the computer capacity required to serve \"billions of users globally\".It also says it would be the first step towards \"becoming a Kardashev II-level civilisation - one that can harness the Sun's full power\", referencing a scale of hypothetical alien societies proposed by an astronomer in the 1960s.Musk wrote on his social media site X: \"The satellites will actually be so far apart that it will be hard to see from one to another. Space is so vast as to be beyond comprehension.\"Like the Starlink satellites, which provide high-speed internet, they would operate in low-Earth orbit at altitudes ranging between 500-2,000km (310-1,242 miles).SpaceX claims \"orbital data centres\" - a concept also being explored by other firms - would be a greener alternative to traditional centres, which require enormous amounts of power to run and water for cooling.An expert previously told the BBC that launching hardware into orbit remains expensive and that the infrastructure to protect, cool and power them can be complex - while a growing quantity of space debris puts the physical hardware at risk.Meanwhile, astronomers complained in 2024 that radio waves from the Starlink network were \"blinding\" their telescopes and hindering their research.Musk has previously rejected claims that his satellites were taking up too much room and crowding out competitors.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Elon Musk's SpaceX applies to launch 1m satellites into orbit",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/647e/live/2eac0410-febb-11f0-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-01-31T16:19:17.000Z",
      "dateModified": "2026-01-31T16:19:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israeli air strikes kill at least 32 Palestinians in Gaza, rescue officials say",
    "url": "https://www.bbc.com/news/articles/c701g1g00gdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/77d5/live/cbf50f70-fe96-11f0-ae1d-b56660f38b59.jpg",
    "tag": "World",
    "date": "2026-02-01T01:30:24.000Z",
    "description": "7 hours agoSofia Ferreira SantosAnadolu via Getty ImagesSeveral strikes have been reported across the Strip, including in Khan YounisAt least 32 peopl",
    "body": "7 hours agoSofia Ferreira SantosAnadolu via Getty ImagesSeveral strikes have been reported across the Strip, including in Khan YounisAt least 32 people have been killed in a wave of Israeli air strikes across the Gaza Strip on Saturday, according to local authorities.The civil defence agency, which is operated by Hamas, says children and women were among those killed. It added that in one attack, helicopter gunships hit a tent sheltering displaced people in the southern city of Khan Younis.Palestinians have described these strikes as the heaviest since the second phase of the ceasefire, brokered by US President Trump last October, came into effect earlier this month.The Israeli military confirmed that a number of strikes were carried out in response to what it said was a Hamas violation of the agreement on Friday.Both Israel and Hamas have accused each other of violating the truce since it came into effect last year.In a statement, the Israel Defense Forces (IDF) said \"eight terrorists were identified exiting the underground terror infrastructure in eastern Rafah\", an area in Gaza where Israeli forces are deployed under the October agreement.The IDF said it had, together with the Israel Security Agency (ISA), struck targets in various locations including \"four commanders and additional terrorists\" as well as a weapons storage facility, a weapons manufacturing site and \"two launch sites belonging to Hamas in the central Gaza Strip\".Hamas has condemned the strikes and urged the US to take immediate action, adding that \"these ongoing violations\" confirm that the Israeli government \"continues its brutal war of genocide against the strip\".It said that seven of the victims were from one displaced family in Khan Younis, with a civil defence spokesman adding that the strikes hit residential apartments, tents, shelters and a police station.Officials at Gaza City's Shifa hospital said an air strike on the city hit a residential apartment, killing three children and two women.\"We found my three little nieces in the street. They say 'ceasefire' and all. What did those children do? What did we do?\" said Samer al-Atbash, an uncle of the three dead children, according to Reuters news agency.Video footage and images from across Gaza showed several bodies being lifted out of rubble and a number of buildings destroyed.ReutersA police station was also hit in Gaza City, local authorities say, killing at least 12Egypt's foreign ministry condemned the strikes in a statement seen by AFP news agency, and urged all parties to \"exercise the utmost restraint\".Qatar, one of the key mediators during ceasefire talks, also denounced the \"repeated Israeli violations\", its foreign ministry said.In January, US special envoy Steve Witkoff  announced the start of phase two of the ceasefire deal.Under phase one, Hamas and Israel agreed the ceasefire in October 2025, as well as a hostage-prisoner exchange, a partial Israeli withdrawal, and an aid surge.Witkoff said phase two would see a technocratic Palestinian government established in Gaza, the reconstruction and full demilitarisation of the territory, including the disarmament of Hamas and other Palestinian groups.The war between Israel and Hamas began after the Hamas-led attack on southern Israel on 7 October 2023, when about 1,200 people were killed and 251 were taken hostage.Israel responded by launching a military campaign in Gaza, during which more than 71,660 people have been killed, according to the Hamas-run health ministry.It says at least 509 Palestinians have been killed since the ceasefire began on 10 October 2025. Four Israeli soldiers have also been killed.The health ministry's figures have been deemed reliable by the UN and other human rights groups and widely cited by international media. Israel does not allow news organisations, including the BBC, into Gaza to report independently.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israeli air strikes kill at least 32 Palestinians in Gaza, rescue officials say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/77d5/live/cbf50f70-fe96-11f0-ae1d-b56660f38b59.jpg"
      ],
      "datePublished": "2026-02-01T01:30:24.000Z",
      "dateModified": "2026-02-01T01:30:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says Iran wants a deal rather than face military action",
    "url": "https://www.bbc.com/news/articles/cd9ew2kwj0lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/19b8/live/0f1f2a20-fe1e-11f0-bd36-9d8a84b498ee.jpg",
    "tag": "World",
    "date": "2026-01-30T21:43:51.000Z",
    "description": "1 day agoMaia DaviesEPATrump declined to say whether there was a timeline for withdrawing a large US naval fleet from waters near IranDonald Trump has",
    "body": "1 day agoMaia DaviesEPATrump declined to say whether there was a timeline for withdrawing a large US naval fleet from waters near IranDonald Trump has said Iran wants to make a deal rather than face US military action, despite Tehran's insistence that its missile and defence systems will \"never\" be up for negotiation.\"I can say this, they do want to make a deal,\" the US president told reporters at the White House on Friday when asked about a build-up of forces in the Gulf, without providing details.He had warned Tehran on Wednesday that time was \"running out\" to negotiate a deal on its nuclear programme after a large US naval fleet had gathered near the country.Iran's foreign minister said there were no talks planned with the US at present but that Tehran was open to negotiations based on \"mutual respect\" and trust.Also on Friday, the Kremlin said the head of the Iran's Supreme National Security Council Ali Larijani had met Russian President Vladimir Putin.They discussed \"Middle Eastern and international issues\" among other matters, state news agency Ria-Novosoti reported.Iran insists its nuclear programme is entirely peaceful and has repeatedly denied accusations by the US and its allies that it is seeking to develop nuclear weapons.Asked on Friday whether he had given Tehran a deadline by which to strike a deal, Trump said that \"only they know for sure\".He told reporters: \"Hopefully we'll make a deal. If we do make a deal, that's good. If we don't make a deal, we'll see what happens.\"He said a large \"Armada\" was on its way to the region and declined to give a timeline for its withdrawal: \"We'll see how it all works out. They have to float someplace, so they might as well float near Iran.\"Iran's Foreign Minister Abbas Araghchi had said earlier that the country's missile defence systems would \"never\" be on the negotiating table, and repeated the government's position that its nuclear programme was peaceful.At a press conference with his Turkish counterpart after talks in Istanbul to avert US action, he said preparations were needed for \"fair and just negotiations\".He had said help was \"on the way\", before saying he had been told the execution of demonstrators had stopped.On Thursday, he said he had told Iran that it had to do two things to avoid military action: \"Number one, no nuclear. And number two, stop killing protesters.\"The US-based Human Rights Activists News Agency (HRANA) said it had confirmed the killing of more than 6,300 people, including more than 5,900 protesters, since the unrest began at the end of December.It said it was also investigating another 17,000 reported deaths received despite an internet shutdown after nearly three weeks.Another group, the Norway-based Iran Human Rights (IHR), has warned the final toll could exceed 25,000.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says Iran wants a deal rather than face military action",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/19b8/live/0f1f2a20-fe1e-11f0-bd36-9d8a84b498ee.jpg"
      ],
      "datePublished": "2026-01-30T21:43:51.000Z",
      "dateModified": "2026-01-30T21:43:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pokémon cancels event at controversial Japan shrine following backlash",
    "url": "https://www.bbc.com/news/articles/cdjn0nmnjmwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2efb/live/bda521e0-fe9a-11f0-a8b8-bdd2c5f9bcad.jpg",
    "tag": "World",
    "date": "2026-01-31T12:08:05.000Z",
    "description": "20 hours agoAleks PhillipsGetty ImagesThe event at the Yasukuni Shrine (pictured) \"should not have been held in the first place\", the Pokémon Company ",
    "body": "20 hours agoAleks PhillipsGetty ImagesThe event at the Yasukuni Shrine (pictured) \"should not have been held in the first place\", the Pokémon Company saidA Pokémon card game event at a shrine honouring Japan's war dead has been cancelled following a backlash in China.The Pokémon Company apologised for advertising the event, organised by a certified third party, through its official website, and said it \"should not have been held in the first place\".The event was due to be held on Saturday at the Yasukuni Shrine, near the Imperial Palace in Tokyo, which commemorates those who died in several wars including convicted war criminals.The blunder comes at a moment of worsening relations between China and Japan over the stance of the latter's new prime minister on Taiwan.The Yasukuni Shrine honours Japanese soldiers who died in a number of wars, including both Sino-Japanese wars and the Pacific theatre of World War Two.But the enshrinement of the names of more than 1,000 convicted war criminals among the roughly 2.5 million people it honours has long made it a controversial site for nations that were subject to harsh treatment under Japanese occupation.\"Brands that disregard history and hurt the feelings of the Chinese people will ultimately be abandoned,\" the People's Daily, the Chinese Communist Party's official news site, commented when the event came to light earlier this week. \"The relevant enterprises must accordingly take social responsibility and not make light of the heavy weight of history in the name of entertainment.\"Meanwhile, the state-run Global Times praised \"China's young net­izens\" for criticising the event, adding: \"Any enter­tain­ment or leis­ure activ­it­ies held at such a site con­sti­tute an open affront to his­tor­ical truth, and sta­ging events aimed at children there is even more egre­gious.\"The Pokémon Company said in a statement on Friday that the event had been \"mistakenly posted\" on its official card game website \"due to a lack of due diligence\".\"After the incident was discovered, the event was promptly cancelled,\" it said. \"We sincerely apologise for the various reactions and opinions that have been generated as a result of this publication.\"The firm said it would \"thoroughly review and strengthen\" its approval process to prevent a similar incident from occurring again.Beijing claims the self-governing island as part of its territory, and has not ruled out taking it by force.The row saw the governments of both nations urge their citizens not to travel to the other, while the release of two popular Japanese films in China were also postponed.Pokémon, which began as a video game in 1996, has since become an internationally renowned media franchise spanning films, TV series and trading card games.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pokémon cancels event at controversial Japan shrine following backlash",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2efb/live/bda521e0-fe9a-11f0-a8b8-bdd2c5f9bcad.jpg"
      ],
      "datePublished": "2026-01-31T12:08:05.000Z",
      "dateModified": "2026-01-31T12:08:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US government partially shuts down despite funding deal",
    "url": "https://www.bbc.com/news/articles/ce8rk33dpvmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bb3d/live/cc76c230-fe4c-11f0-9326-27237dddd2a5.jpg",
    "tag": "World",
    "date": "2026-01-31T05:10:27.000Z",
    "description": "1 day agoKwasi Gyamfi AsieduWashingtonBloomberg via Getty ImagesThe US federal government has partially shutdown despite a last-ditch funding deal app",
    "body": "1 day agoKwasi Gyamfi AsieduWashingtonBloomberg via Getty ImagesThe US federal government has partially shutdown despite a last-ditch funding deal approved by the Senate.The funding lapse began at midnight US eastern time (05:00 GMT) on Saturday, hours after senators agreed to fund most agencies until September. The bill includes just two weeks' funding for the Department of Homeland Security, which oversees immigration enforcement, instead of shutting it down entirely.The bill has yet to be approved by the House of Representatives, which is out of session.US President Donald Trump struck the deal with Democrats after they refused to give more funding for immigration enforcement following the fatal shooting of two US citizens in Minneapolis by federal agents.It is the second such government shutdown in the past year and comes just 11 weeks after the end of the previous funding impasse that lasted 43 days, the longest in US history. That shutdown in 2025, which spanned 1 October to 14 November, had widespread impacts on essential government services including air travel and left hundreds of thousands of federal workers without pay for weeks.This shutdown, however, is unlikely to be that long or widespread as the House of Representatives is set to be back in session on Monday. The White House, though, has directed several agencies, including the departments of transportation, education and defence to execute shutdown plans.\"Employees should report to work for their next regularly scheduled tour of duty to undertake orderly shutdown activities,\" a White House memo to agencies said. \"It is our hope that this lapse will be short.\"Trump has urged Republicans, who hold the majority of seats in the US House, to vote for the deal.Lawmakers plan to use the fortnight in which the DHS will continue to be funded to negotiate a deal. Democrats want that deal to include new policies for immigration enforcement agents.\"We need to rein in ICE and end the violence,\" Senate Minority Leader Chuck Schumer said referring to Immigration and Customs Enforcement.\"That means ending roving patrols. It means requiring rules, oversight, and judicial warrants... Masks need to come off, cameras need to stay on, and officers need visible identification. No secret police.\"Both Republican and Democratic lawmakers have sharply criticised tactics used by immigration agents in the wake of the fatal shooting of Alex Pretti in Minneapolis last weekend.Pretti, an intensive care nurse, was shot by a US Border Patrol agent after an altercation in which several agents tried to restrain him. On Friday, the Justice Department launched a civil rights investigation into the shooting.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US government partially shuts down despite funding deal",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bb3d/live/cc76c230-fe4c-11f0-9326-27237dddd2a5.jpg"
      ],
      "datePublished": "2026-01-31T05:10:27.000Z",
      "dateModified": "2026-01-31T05:10:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Luigi Mangione will not face death penalty if convicted, judge rules",
    "url": "https://www.bbc.com/news/articles/c78egdg3r0po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3791/live/fa232790-fdf8-11f0-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-01-30T23:30:03.000Z",
    "description": "1 day agoBrandon DrenonReutersLuigi Mangione, the man accused of gunning down UnitedHealthcare chief executive Brian Thompson, will not face the death",
    "body": "1 day agoBrandon DrenonReutersLuigi Mangione, the man accused of gunning down UnitedHealthcare chief executive Brian Thompson, will not face the death penalty if convicted, a court has ruled.US District Judge Margaret Garnett dismissed the federal firearms charges against the 27-year-old that carried the possibility of capital punishment.He will still face stalking charges, which can bring a maximum sentence of life in prison.Mangione was arrested days after he allegedly shot Thompson as the health insurance firm CEO walked into a New York City hotel on 4 December 2024. He has pleaded not guilty to all federal and state charges.After the ruling, Mangione's attorney Karen Agnifilo thanked the court for \"this incredible decision\", according to the BBC's US partner CBS News. \"We're all very relieved,\" she said. \"We're prepared, and have been prepared, to fight this case, and we look forward to fighting this case.\"In her ruling, Garnett, an appointee of former US President Joe Biden, said two of the four federal charges did not meet \"the federal statutory definition of a 'crime of violence' as matter of law\". She noted that her decision was \"solely to foreclose the death penalty as an available punishment to be considered by the jury\".Garnett's ruling was a setback for the justice department, which had called Thompson's murder a \"premeditated, cold-blooded assassination\".The judge has given the government 30 days to challenge her decision to rule out the death penalty in the case.In a win for prosecutors, Garnett said they could present evidence to the jury from Mangione's backpack that he had at the time of his arrest at a McDonald's in Altoona, Pennsylvania.Among the items in the bag were a gun, fake IDs and a notebook with writings that allegedly detailed Mangione's grievances against the US healthcare system. Defence attorneys had sought to dismiss that evidence from trial, arguing that authorities obtained it illegally without a warrant. Mangione, an Ivy League graduate from a wealthy Maryland family, is also facing nine charges in a separate case brought by New York state prosecutors, including second-degree murder.Thompson, a 50-year-old father of two, was shot from behind by a masked gunman as he walked into a Manhattan hotel for an annual investor conference. Investigators say the words \"deny\", \"defend\" and \"depose\" were written on shell casings found at the scene of Thompson's murder.Law enforcement sources say this may have been a reference to the \"three Ds of insurance\" - tactics used by companies to reject payment claims by patients.Jury selection in the federal trial is due to begin on 8 September, with opening statements due to start on 13 October. But state prosecutors are seeking to try Mangione as soon as July.In a separate incident, a Minnesota man was arrested on Wednesday for allegedly impersonating an FBI agent in an attempt to free Mangione from the Brooklyn jail he is being held in. The suspect - Mark Anderson - was carrying a barbecue fork and pizza cutter, prosecutors say. He is now being held at the same facility as Mangione.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Luigi Mangione will not face death penalty if convicted, judge rules",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3791/live/fa232790-fdf8-11f0-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-01-30T23:30:03.000Z",
      "dateModified": "2026-01-30T23:30:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Moment bright light trail streaks across New Zealand skyline",
    "url": "https://www.bbc.com/news/articles/cpwnl8gl0z4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/744b/live/34c78eb0-ff2d-11f0-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-01T07:37:25.000Z",
    "description": "15 hrs agoNew Zealand in India 2026Fixtures, results and scorecards from New Zealand's limited-overs tour of India, featuring three ODIs and five Twen",
    "body": "15 hrs agoNew Zealand in India 2026Fixtures, results and scorecards from New Zealand's limited-overs tour of India, featuring three ODIs and five Twenty20 internationals.15 hrs ago6 days agoChild rapist jailed after New Zealand extraditionDavid Bayliss's victim wrote in her diary that she feared not being believed.6 days ago7 days agoAbhishek's 14-ball 50 leads India to series winIndia take an unassailable 3-0 series lead in the T20 series against New Zealand after Abhishek Sharma hits an unbeaten 68 off 20 balls, including a 14-ball 50.7 days ago7 days agoMen's T20 World Cup 2026 - fixturesFixtures, results and scorecards for the 2026 ICC Men's T20 World Cup in India and Sri Lanka.7 days ago24 Jan 2026New Zealand calls off rescue efforts for six missing after landslidePolice say they are not expecting to find any more survivors from the landslide, with six people still unaccounted for.24 Jan 2026",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Moment bright light trail streaks across New Zealand skyline",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/744b/live/34c78eb0-ff2d-11f0-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-01T07:37:25.000Z",
      "dateModified": "2026-02-01T07:37:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Federal judge denies request to block ICE surge in Minnesota",
    "url": "https://www.bbc.com/news/articles/c78vgnz3z6eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/542f/live/0ada7050-ff36-11f0-b7e1-afb6d0884c18.jpg",
    "tag": "World",
    "date": "2026-01-31T18:21:58.000Z",
    "description": "14 hours agoOttilie MitchellWatch: Nationwide anti-ICE protests draw large crowdsA federal judge on Saturday denied a state government request to bloc",
    "body": "14 hours agoOttilie MitchellWatch: Nationwide anti-ICE protests draw large crowdsA federal judge on Saturday denied a state government request to block the Trump administration's deployment of thousands of federal immigration agents in Minneapolis, Minnesota.District Court Judge Katherine Menendez said in a ruling that the immigration enforcement operation \"has had, and will likely continue to have, profound and even heartbreaking, consequences on the State of Minnesota\".But, she said, state officials had not proved that the Trump administration's surge of US Immigration and Customs Enforcement (ICE) agents in Minneapolis was unlawful.The ruling comes as thousands nationwide have taken to the streets to protest the fatal shootings of two US citizens by federal agents.Demonstrators are expected to gather on Saturday afternoon in Minneapolis, after protests were also held in cities across the US on Friday, including New York, Los Angeles, Chicago and Washington DC. Organisers called on Americans to stay home from work and school.The deaths of Renee Good and Alex Pretti have caused public outcry across the country, and led to criticism from lawmakers in both parties.The 37-year-old nurse was the second Minneapolis resident shot and killed by federal immigration officials since their arrival in the state. Good, the first, was killed by an ICE agent on 7 January.In her ruling on Saturday, Menendez said there was \"evidence that ICE and CBP agents have engaged in racial profiling, excessive use of force and other harmful actions\". But, she said, state officials \"have provided no metric by which to determine when lawful law enforcement becomes unlawful commandeering\". State and local officials had argued in their lawsuit that Trump's deployment of 3,000 immigration agents despite objections violated the state's sovereignty. Organisers of nationwide protests on Friday, called the National Shutdown, urged \"no work. No school. No shopping\" on 30 January to send the message to \"stop funding ICE\".The action was organised over the deaths of Pretti and Good, as well as others killed by ICE, including Silverio Villegas-Gonzales, who was shot by an ICE agent in September 2025, according to the group's website.Protesters formed the letters \"SOS\" on top of a frozen lake in southern Minneapolis, while one group marched through the streets carrying a large-scale replica of the preamble to the US constitution.Singer Bruce Springsteen also performed a newly released song in honour of Pretti and Good entitled Streets of Minneapolis at a concert in the city. Getty ImagesDemonstrators spell out an SOS signal of distress on a frozen Lake Bde Maka Ska in Minneapolis On Thursday, border tsar Tom Homan suggested the Trump administration could \"draw down\" federal forces in the state if local officials co-operate.\"We are not surrendering our mission at all. We're just doing it smarter,\" he said during a news conference. Homan began leading on-the-ground efforts in Minneapolis after it was announced Border Patrol commander Gregory Bovino would be leaving the area.US President Donald Trump said on Thursday evening: \"We will keep our country safe, we'll do whatever we can to keep our country safe.\" About 3,000 federal agents were sent to Minnneapolis at Trump's directive.The DHS has said it was arresting the \"worst of the worst criminal illegal aliens\" in an effort to restore public safety in Minnesota, but critics argue migrants with clean records and US citizens are being caught up in the campaign.Dubbed Operation Metro Surge, the immigration enforcement initiative has sparked outcry from residents in Minneapolis, St Paul and other cities in the state.Minnesota Governor Tim Walz and Minneapolis Mayor Jacob Frey have called on federal agents to withdraw from Minneapolis.Getty Images",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Federal judge denies request to block ICE surge in Minnesota",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/542f/live/0ada7050-ff36-11f0-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-01-31T18:21:58.000Z",
      "dateModified": "2026-01-31T18:21:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DR Congo: More than 200 killed in mine collapse",
    "url": "https://www.bbc.com/news/articles/cly381dvnvzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fc42/live/11fb2f70-feb7-11f0-a8b8-bdd2c5f9bcad.jpg",
    "tag": "World",
    "date": "2026-01-31T13:18:00.000Z",
    "description": "19 hours agoPaul NjieHassan Lali / BBCSources say the mine, currently under rebel control, has been poorly maintainedMore than 200 people have been ki",
    "body": "19 hours agoPaul NjieHassan Lali / BBCSources say the mine, currently under rebel control, has been poorly maintainedMore than 200 people have been killed in a mine collapse in eastern Democratic Republic of Congo, rebel authorities have said.The mine, in the town of Rubaya, gave way on Wednesday due to heavy rains, Lumumba Kambere Muyisa, spokesman for the North Kivu region's rebel governor, told reporters. At the time, the death toll remained unclear.Women and children were among those mining coltan - a mineral used to manufacture electronics such as smartphones and computers - at the time.A former supervisor of the mine told the BBC the site was not properly maintained, making accidents more likely and hampering rescue efforts when they occur.He added that the fragile nature of the soil made the situation worse.Women, children and artisanal miners - those not officially employed by a mining firm - are among those killed in the collapse. Around 20 survivors are said to be receiving treatment in hospital.A source whose cousin died in the landslide expressed shock, saying it was \"a big loss\" for the family and community.\"I didn't believe he could pass away in such circumstances,\" the source, who did not wish to be named, told the BBC, describing his cousin as a \"courageous\" and \"ambitious\" man whose main goal was to provide for his wife and two children.\"I didn't believe [he was dead] because investigations were still ongoing. His body wasn't found after the accident, so I did have hope that he could be found alive. Unfortunately, some hours later, his body was discovered.\"Governor Erasto Bahati Musanga, who was appointed by M23 rebels after seizing swathes of territory in North Kivu, visited survivors of the incident on Friday.Rubaya is one of a number of towns across North Kivu under the control of the M23, who international observers say are backed by neighbouring Rwanda.The mines in Rubaya hold about 15% of the world's coltan supply and half of the DR Congo's total deposits. The metallic ore contains tantalum, which is used to produce high-performance capacitors in a range of electronic devices, making it in high demand worldwide.When a BBC team visited the site in July 2025, they observed miners digging manually to source the precious mineral. Conditions at the site are very bad, with dangerous pits dotted around its vast expanse.Since 2024, the M23 rebels have been in control of the mines. The UN has accused the group of imposing taxes on the mining sector for their own benefit.The BBC has contacted the Congolese government in Kinshasa for comment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DR Congo: More than 200 killed in mine collapse",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fc42/live/11fb2f70-feb7-11f0-a8b8-bdd2c5f9bcad.jpg"
      ],
      "datePublished": "2026-01-31T13:18:00.000Z",
      "dateModified": "2026-01-31T13:18:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mali lawmaker Mamadou Hawa Gassama jailed in Ivory Coast for insulting President Ouattara.",
    "url": "https://www.bbc.com/news/articles/c74vgxp0zr4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/eac3/live/bc4682e0-fe03-11f0-b7e1-afb6d0884c18.jpg",
    "tag": "World",
    "date": "2026-01-30T18:09:20.000Z",
    "description": "2 days agoNicolas NégoceBBC Africa, AbidjanAFP/Getty ImagesMamadou Hawa Gassama, seen here on a demonstration in 2018, is known for his outspokennessA",
    "body": "2 days agoNicolas NégoceBBC Africa, AbidjanAFP/Getty ImagesMamadou Hawa Gassama, seen here on a demonstration in 2018, is known for his outspokennessA Malian lawmaker has been jailed in neighbouring Ivory Coast for three years for insulting the 84-year-old Ivorian leader, who recently won a fourth term in office.Mamadou Hawa Gassama, who serves in the transitional parliament set up by Mali's junta, was arrested last July while on a trip to Ivory Coast.Prosecutors said he described President Alassane Ouattara as a \"tyrant\", \"an enemy of Mali\" and strongly criticised his leadership in interviews and on social media.Since Mali's military took power in 2020, relations with Ivory Coast have been strained. Ouattara, an ally of France - the former colonial power in both nations - has been critical of the takeover and other coups in West Africa.Since the Malian politician's arrest in Abidjan last July, the authorities in Bamako have not commented on the case.\"We believe that this decision is... excessive... it is very severe,\" the AFP news agency quotes Gassama's lawyer Mamadou Ismaila Konate as saying.Prosecutors argued that Gassama's remarks went beyond political critique, accusing him of deliberately seeking to undermine Ivorian institutions and sow discord between the two neighbours.It is a reminder of the diplomatic row that blew up two years after the coup, when 49 Ivorian soldiers were sentenced in Mali to 20 years in prison for undermining state security.Since then, Mali's military leaders have overseen the exit of the UN peacekeeping mission and French forces, which had deployed to Mali in 2013 to help deal with an escalating jihadist insurgency.Instead it has sought closer ties with Russia - and Russian mercenaries have been brought in to deal with the insecurity affecting several countries in the vast Sahel region.You may also be interested in:Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mali lawmaker Mamadou Hawa Gassama jailed in Ivory Coast for insulting President Ouattara.",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/eac3/live/bc4682e0-fe03-11f0-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-01-30T18:09:20.000Z",
      "dateModified": "2026-01-30T18:09:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]