[
  {
    "title": "Bowen: Momentum is the strength of Trump's Gaza plan, but lack of detail is its weakness",
    "url": "https://www.bbc.com/news/articles/cn829deeje3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/856b/live/1250dd50-9e7f-11f0-9e55-1fac313765d4.jpg",
    "tag": "World",
    "date": "2025-10-01T07:05:33.000Z",
    "description": "14 minutes agoJeremy BowenInternational EditorDonald Trump's framework agreement for ending the Gaza war and reconstructing the devastated territory has momentum behind it. Much of it comes from the president...",
    "body": "<div><div><p>14 minutes ago</p></div><p><span><p><span>Jeremy Bowen</span><span>International Editor</span></p></span></p></div><div><p>Donald Trump's framework agreement for ending the Gaza war and reconstructing the devastated territory has momentum behind it. </p><p>Much of it comes from the president himself. Momentum comes too from leading Arab and Islamic countries who have supported the plan, including Jordan, Egypt, Qatar, Saudi Arabia, the UAE, Pakistan, Indonesia and Turkey. And Israel's Prime Minister Benjamin Netanyahu, standing next to Donald Trump, accepted it too, despite the fact it contains talk of a pathway to a Palestinian state that he has repeatedly denounced.</p><p>To keep the pace up, Trump says that Hamas has \"three to four days\" to decide whether to say yes or no.</p><p>If the answer is no, the war goes on.</p><p>The proposed deal looks a lot like a plan put forward by Joe Biden well over a year ago. Since then there has been massive killing of Palestinian civilians, more destruction in Gaza, and now a famine, while Israeli hostages in Gaza have had to endure months more of agony and captivity.</p><p>There were many reports in the Israeli media that the Biden initiative failed because Netanyahu moved the goalposts with a new set of demands - under pressure from the hard right in his cabinet.</p><p>Even so, the framework plan is a significant moment. For the first time, Donald Trump is putting pressure on Israel to end the war. Donald Trump has made himself into a leader to whom it is hard to say no. Nobody wants to end up getting the roasting Ukraine's president Volodymyr Zelensky received in the Oval Office back in February. But things can change when leaders leave the White House.</p><p>Before Benjamin Netanyahu left Washington DC to go back to Israel his staff filmed him putting over his version of events. One element was the idea of an independent Palestine next to Israel, the two-state solution which the UK and other Western countries have tried to revive by recognising Palestine.</p><p>The Trump document gives an indeterminate nod to the idea of Palestinian independence. It says that after the reform of the Palestinian Authority, which is based in Ramallah and led by President Mahmoud Abbas, conditions \"may finally be in place for a credible pathway to Palestinian self-determination and statehood, which we recognise as the aspiration of the Palestinian people.\"</p><p>Even the thought of a distant prospect of a Palestinian state was too much for Netanyahu, who had given whole-hearted support to Trump at the White House, telling him in English \"I support your plan to end the war in Gaza, which achieves our war aims.\"</p><p>On the video, getting his message out in Hebrew to the people back home before the long flight home, Netanyahu is asked if he agreed to a Palestinian state. He was emphatic.</p><p>\"No, absolutely not. It's not even written in the agreement. But we did say one thing. That we would forcibly resist a Palestinian state.\" Trump, he said, agreed.</p></div><div><p>Momentum is the plan's strength. Its weakness is the lack of detail, a characteristic of Trumpian diplomacy. The document that Trump and Netanyahu endorsed, which also has the support of the UK and other European countries, comes with a rough map of stages of an IDF pull-back, but none of the nuts and bolts that determine whether diplomatic agreements designed to end a war hold together or disintegrate.</p><p>If it is to work, hard negotiation will be necessary. In that process there will be many opportunities for it to break down.</p><p>Mainstream opposition parties in Israel have endorsed the plan. It has been condemned by the extremist ultra-nationalists in the Netanyahu coalition, who had loved the \"Trump Riviera\" plan mooted at the start of the year, launched with a bizarre video showing the leaders of Israel and the US in beach gear sipping cocktails to the backdrop of a new Gazan cityscape glittering glass towers. The Israeli hard right were delighted that the Riviera plan included the removal of all of Gaza's more than two million Palestinians. Jewish extremists want the land annexed and Palestinians replaced with Jewish settlers.</p><p>But the new plan says no Palestinian will be forced to leave. Benjamin Netanyahu's key far right ally, Itamar Ben Gvir, is said to have called the proposal \"dangerous\" and \"full of holes\".</p><p>If Hamas accepts the agreement, and if Benjamin Netanyahu wants to find ways to placate the extremists who keep his coalition in power, he will have plenty of chances to sabotage the negotiations in ways that put the blame on Hamas. The structure of the Trump framework agreement allows Israel a range of opportunities to veto moves it does not like.</p><p>It may not be possible to end a deep-seated conflict that has lasted more than a century. Longer term, the UK and many countries outside Israel and the US believe that any attempted solution that does not lead to Palestinian independence will not bring peace.</p><p>When the foreign ministers of the Arab and Islamic countries issued their statement of support, they said that they believed it would lead to a full Israeli withdrawal and rebuilding of Gaza, and \"a path for just peace on basis of two-state solution under which Gaza is fully integrated with the West Bank in Palestinian state in accordance with international law.\" That could be taken as a coded reference to the decision of the International Court of Justice that the occupation of Palestinian land by Israel is illegal.</p><p>Netanyahu believes the deal takes him closer to Israel's elusive victory over Hamas. He denies any Palestinian right to the land between the river Jordan and the sea.</p><p>One plan, two very different versions of what it means. The framework is ambiguous enough for both interpretations to be possible. That is not a promising start.</p></div>"
  },
  {
    "title": "European leaders meet in high-security Danish summit after drone disruption",
    "url": "https://www.bbc.com/news/articles/cp8jdene16ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2b62/live/ba18b790-9e36-11f0-928c-71dbb8619e94.jpg",
    "tag": "World",
    "date": "2025-10-01T06:38:41.000Z",
    "description": "40 minutes agoJessica ParkerEurope correspondent in Copenhagen andPaul KirbyEurope digital editor in LondonReutersDenmark has reinforced security for the summit and allies have beefed up air defencesEU...",
    "body": "<article><div><div><p>40 minutes ago</p></div><p><span><p><span>Jessica Parker</span><span>Europe correspondent in Copenhagen</span><span> and</span></p><p><span>Paul Kirby</span><span>Europe digital editor in London</span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/2b62/live/ba18b790-9e36-11f0-928c-71dbb8619e94.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/2b62/live/ba18b790-9e36-11f0-928c-71dbb8619e94.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/2b62/live/ba18b790-9e36-11f0-928c-71dbb8619e94.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/2b62/live/ba18b790-9e36-11f0-928c-71dbb8619e94.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/2b62/live/ba18b790-9e36-11f0-928c-71dbb8619e94.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/2b62/live/ba18b790-9e36-11f0-928c-71dbb8619e94.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/2b62/live/ba18b790-9e36-11f0-928c-71dbb8619e94.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/2b62/live/ba18b790-9e36-11f0-928c-71dbb8619e94.jpg.webp\" alt=\"Reuters Police officers stand in front of Christiansborg Palace ahead of the informal meeting of European Union leaders in Copenhagen, Denmark, September 30, 2025.\" /><span>Reuters</span></p></div><p></p><figcaption>Denmark has reinforced security for the summit and allies have beefed up air defences</figcaption><p></p></figure><div><p>EU leaders gather in Copenhagen on Wednesday under pressure to boost European defence after a series of Russian incursions into EU airspace, and days after drones targeted Danish airports.</p><p>The incursions have become most acute for countries on the EU's eastern flank such as Poland and Estonia. Ten member states have already backed plans for a multi-layered \"drone wall\" to quickly detect, then track and destroy Russian drones.</p><p>Denmark has beefed up security ahead of the summit, <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/c708dzqvz1vo\">banning all civilian drone flights until Friday</a> and placing heavy restrictions on traffic in Copenhagen.</p><p>Despite the high security, there was little evidence of alarm in the centre of the capital ahead of the summit.</p></div><div><p>Denmark will also host a broader European Political Community summit on Thursday and international allies have lent support to ensure both events pass without incident.</p><p>Copenhagen airport, followed by several Danish airports and military sites on the Jutland peninsula, faced drone disruption last week.</p><p>Ten allies are providing anti-drone and surveillance support, according to Denmark's military, which has highlighted<a target=\"_blank\" href=\"https://www.forsvaret.dk/en/news/2025/allied-support-brings-foreign-troops-to-denmark/\"> an \"increased presence of foreign troops and equipment\"</a>. Among the countries contributing are Poland, the UK, the Netherlands, Finland, Sweden and the US. A German frigate has also docked in Copenhagen.</p><p>As host to dozens of European leaders over two days, Denmark will want to fend off any more unwelcome surprises in its air space.</p><p><a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/c7401vk4lgzo\">Danish police have not found any evidence </a>that Russia was behind last week's drone disruption, which caused no injuries, but the government has blamed a \"professional actor\". Prime Minister Mette Frederiksen has said there is \"primarily one country that poses a threat to Europe's security - that is Russia\".</p><p>Sweden's prime minister Ulf Kristersson also said \"everything points to [Russia]\".</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/643f/live/1cca3850-9e37-11f0-b741-177e3e2c2fc7.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/643f/live/1cca3850-9e37-11f0-b741-177e3e2c2fc7.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/643f/live/1cca3850-9e37-11f0-b741-177e3e2c2fc7.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/643f/live/1cca3850-9e37-11f0-b741-177e3e2c2fc7.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/643f/live/1cca3850-9e37-11f0-b741-177e3e2c2fc7.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/643f/live/1cca3850-9e37-11f0-b741-177e3e2c2fc7.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/643f/live/1cca3850-9e37-11f0-b741-177e3e2c2fc7.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/643f/live/1cca3850-9e37-11f0-b741-177e3e2c2fc7.jpg.webp\" alt=\"EPA/Shutterstock The German Navy air defense frigate FGS Hamburg F220 is docked in Copenhagen, Denmark, 28 September 2025\" /><span>EPA/Shutterstock</span></p></div><p></p><figcaption>A German frigate has also arrived in the Danish capital to bolster air defences</figcaption><p></p></figure><div><p>Stockholm has loaned \"a handful of powerful radar systems\" to its neighbour for the two summits, according to Kristersson.</p><p>Ukraine's Volodymyr Zelensky said Kyiv is sending a mission to Denmark for joint exercises to provide \"Ukrainian experience in drone defence\".</p><p>German Chancellor Friedrich Merz said ahead of the summit that air space incursions were getting worse and worse and it was \"reasonable to assume the drones are coming from Russia\".</p><p><a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/c3rvzdq93yro\">Drones have been seen in recent days</a> over Germany's northern state of Schleswig-Holstein, and flights have been delayed in the past week at Vilnius airport in Lithuania and at Oslo airport in Norway because of drone activity.</p><p>\"We are not at war, but we are no longer at peace either. We must do much more for our own security,\" Merz told a media event in Düsseldorf this week.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/e52a/live/82aad8f0-9e37-11f0-b741-177e3e2c2fc7.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/e52a/live/82aad8f0-9e37-11f0-b741-177e3e2c2fc7.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/e52a/live/82aad8f0-9e37-11f0-b741-177e3e2c2fc7.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/e52a/live/82aad8f0-9e37-11f0-b741-177e3e2c2fc7.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/e52a/live/82aad8f0-9e37-11f0-b741-177e3e2c2fc7.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/e52a/live/82aad8f0-9e37-11f0-b741-177e3e2c2fc7.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/e52a/live/82aad8f0-9e37-11f0-b741-177e3e2c2fc7.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/e52a/live/82aad8f0-9e37-11f0-b741-177e3e2c2fc7.jpg.webp\" alt=\"EPA/Shutterstock Von der Leyen wears a red jacket and white blouse with the blue and yellow flag of the EU in the background\" /><span>EPA/Shutterstock</span></p></div><p></p><figcaption>European Commission President Ursula von der Leyen raised the idea of a \"drone wall\" last month</figcaption><p></p></figure><div><p>Kremlin spokesman Dmitry Peskov said it was obvious Germany had long been \"indirectly involved\" in the war in Ukraine and he rejected \"unfounded accusations\" of Russian involvement in last week's disruption in Denmark.</p><p>\"Europe would be better off seeking dialogue on security issues rather than looking to build a divisive \"drone wall\", he said on Tuesday.</p><p>Such is the concern at Russian activity on Europe's eastern flank that Nato met for consultations twice in September under Article 4 of its treaty, first after <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/clydk8821nro\">drones violated Polish airspace</a> and then when <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/czrp6p5mj3zo\">Russian MiG-31 war planes entered Estonian air space</a> for 12 minutes.</p><p>\"We have to keep our skies safe,\" said Nato Secretary General Mark Rutte, who met European Commission chief Ursula von der Leyen in Brussels on the eve of the Copenhagen summit.</p><p>The idea of a drone wall was raised a month ago by von der Leyen, and Rutte said it was \"timely and necessary because in the end we cannot spend millions of euros or dollars on missiles to take out drones which are only costing a couple of thousand dollars\".</p><p>A senior EU diplomat told the BBC there were still questions over financing the plan and over command and control, but Europe's response to Russia's drone violations in Poland had led to some serious soul-searching: \"We have to be more agile and find better tools.\"</p></div><div><p>A former brigadier general in the Danish military, Ole Kvaerno, told the BBC that the drone wall was \"a political, very generic concept at the moment\", but that last week's drone activity over his country had been a wake-up call for the authorities and the broader Danish population.</p><p>He warned that the target of the next attack might be different.</p><p>\"It could be infrastructure like energy supply,\" said Kvaerno of the Danish Centre for Defence Robotics and Autonomy. \"The nature of hybrid war is that it's intended to take us by surprise. So we're not done with operational shocks like this one.\"</p><p>Another flagship project, called Eastern Flank Watch, is aimed at fortifying the EU's eastern borders by sea, air and land to protect against so-called hybrid warfare, as well as from Russia's shadow fleet. Von der Leyen said the EU would have to collaborate on this with both Nato and Ukraine.</p><p>EU leaders will be shown plans for a \"road map\" aimed at bolstering defences and developing Europe's defence industries by the end of the decade to produce state-of-the-art military equipment. The plans will then be worked on with Nato before EU leaders meet again later this month.</p><p>According to the plans for being \"2030-ready\", Europe needs to move now so its capabilities are prepared for \"the battlefields of tomorrow\".</p><p>One of the core ideas is to increasingly focus on joint procurement. The EU has already backed proposals to raise up to €150bn (£130bn) on capital markets to help fund defence investment. The UK and Canada are likely to take part in the fund.</p><p>The EU's financial support for Ukraine will also be discussed, more than three and a half years into Russia's full-scale war.</p><p>Ukraine is also a candidate to join the EU, but is facing hardening opposition from Hungary and tensions along their shared border, after Kyiv accused Budapest of sending reconnaissance drones into western Ukraine. </p><p>Hungary's Prime Minister Viktor Orban, who is one of Russia's closest allies in the EU, claimed Ukraine was \"not a sovereign country\" as it was being financed by the West.</p></div></article>"
  },
  {
    "title": "Princess Anne visits Ukraine to support child war victims",
    "url": "https://www.bbc.com/news/articles/cgrqlrjgd51o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8da7/live/8a36df20-9e8b-11f0-928c-71dbb8619e94.jpg",
    "tag": "World",
    "date": "2025-10-01T00:17:36.000Z",
    "description": "Anne visits Ukraine to support children 'traumatised' by war7 hours agoMaia DaviesWatch: Princess Anne meets President Zelensky and visits shrine to child victims of the war in Kyiv with First Lady...",
    "body": "<article><p></p><h2>Anne visits Ukraine to support children 'traumatised' by war</h2><p></p><div><div><p>7 hours ago</p></div><p><span><p><span>Maia Davies</span><span></span></p></span></p></div><p></p><figcaption>Watch: Princess Anne meets President Zelensky and visits shrine to child victims of the war in Kyiv with First Lady Zelenska</figcaption><p></p><div><p>The Princess Royal made a surprise visit to Ukraine on Tuesday to highlight the \"traumatic experiences of children living on the frontline of the conflict\", Buckingham Palace has said.</p><p>Princess Anne left a toy bear at a memorial for children killed since Russia's full-scale invasion, and spoke to young people alleged to have been taken from their homes by Russian forces.</p><p>She also discussed the UK's support for Ukraine and its ongoing resistance with President Volodomyr Zelensky.</p><p>The official visit, taken at the request of the Foreign Office, comes just weeks after her nephew <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/c3dr859vxxjo\">Prince Harry visited war-wounded veterans</a> during a surprise visit to Kyiv.</p></div><div><p>Anne, who is the King's sister, paid her respects at the Children's Memorial alongside First Lady Olena Zelenska, who opened the site in the northeastern city of Kharkiv.</p><p>The princess also visited the Child Rights Protection Centre, set up during the conflict to support young people affected by the war, where she spoke to children who had been reunited with their families and staff \"working tirelessly\" to bring more young people back.</p></div><div><p>Kyiv estimates that at least 19,500 Ukrainian children have been deported and forcibly displaced from their homes to Russia and Russian-occupied territories since February 2022. </p><p>Just 1,605 have come home so far, according to <a target=\"_blank\" href=\"https://childrenofwar.gov.ua/en/\">the government's Children of War database</a>.</p><p>The International Criminal Court issued an arrest warrant for Rusian President Vladimir Putin and his Children's Rights Commissioner, Maria Lvova-Belova, in 2023 for <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/world-europe-64992727\">the alleged unlawful deportation of children.</a></p><p>Russia denies the accusation and says it has protected children by moving them from a war zone for their safety.</p><p>Anne's visit comes weeks after the UK announced new sanctions targeting those supporting the alleged attempts \"to forcibly deport and indoctrinate\" Ukrainian children.</p></div><div><p>The princess also met female police and armed forces officers working to protect women and children, spoke to injured veterans and those with \"conflict-related trauma\" at a rehabilitation centre, and toured St Sophia's Cathedral in Kyiv.</p><p>She also visited the Kherson Cultural Exhibition, which tells the story of the southern city recaptured by Ukrainian forces in November 2022 and described by the Palace as \"a symbol of Ukraine's strength, resistance and struggle\".</p><p>It is the second visit by a Royal to the country in less than a month, after the Duke of Sussex visited Kyiv in mid-September.</p><p>Other Royals have likewise shown support for Ukraine since the war began more than three years ago - including the King, who welcomed Zelensky to his Sandringham estate in Norfolk in March.</p><p>He also raised the conflict during US President Donald Trump's recent state visit to the UK, saying: \"Today, as tyranny once again threatens Europe, we and our allies stand together in support of Ukraine, to deter aggression and secure peace.\"</p><p><a target=\"_blank\" href=\"https://www.bbc.co.uk/news/uk-65055847\">The Prince of Wales met Ukrainian refugees</a> during a two-day visit to Estonia in March - where he said their resilience was \"amazing\".</p></div></article>"
  },
  {
    "title": "Entire Ukrainian family killed in Russian drone strike, officials say",
    "url": "https://www.bbc.com/news/articles/cdxqdpgznzeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e1e4/live/fa34b6d0-9ddc-11f0-9108-f9efa9785693.png",
    "tag": "World",
    "date": "2025-09-30T09:20:57.000Z",
    "description": "An entire family - a married couple and their two young sons - have been killed in an overnight Russian drone attack in Ukraine's north-eastern Sumy region, local officials have said.Regional head Oleh...",
    "body": "<div><p>An entire family - a married couple and their two young sons - have been killed in an overnight Russian drone attack in Ukraine's north-eastern Sumy region, local officials have said.</p><p>Regional head Oleh Hryhorov said a residential building was hit in the village of Chernechchyna. The bodies of the two children, aged four and six, and their parents were later recovered from the wreckage.</p><p>Ukraine's air force said its units shot down 46 out of 65 Russian drones across the country - but there were 19 direct hits in six locations.</p><p>Russia's military has not commented. In a statement, it said 81 Ukrainian drones were destroyed overnight in five Russian regions. No casualties were reported.</p></div><div><p>Russia launched a full-scale invasion of Ukraine in February 2022.</p><p>In a post on Telegram on Tuesday morning, Hryhorov accused Russian forces of deliberately targeting a residential building in Chernechchyna.</p><p>He said the loss of an entire family was \"a tragedy that we will never forget or forgive\".</p><p>Ukraine's state emergencies service DSNS later said two residential buildings were partially destroyed in the village.</p><p>It also posted photos showing firefighters tackling blazes after the Russian strike.</p><p>In recent weeks, Russia has intensified its aerial assaults on Ukraine, regularly launching hundreds of drones and dozens of missiles.</p><p>Ukraine has long been urging its Western allies to provide it with enough advanced air defence weaponry to be able to cope with almost daily Russian strikes.</p><p>Kyiv has also been seeking Western missiles that could hit major Russian cities far from the front line, arguing that this would seriously weaken Russia's military industry and force Russian President Vladimir Putin to the negotiating table.</p><p>Last week, <a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/cly6r1mg34yo\">US Vice-President JD Vance said publicly that Washington was considering a request by Ukraine for long-range Tomahawk missiles,</a> which - if delivered - would put Moscow and other major Russian cities within reach for Ukraine's military.</p><p>On Tuesday, European Commission President Ursula von der Leyen announced \"we have agreed with Ukraine that a total of €2bn (£1.7bn) will be spent on drones now. </p><p>\"This allows Ukraine to scale up and to use its full capacity. And of course, it will also allow the European Union to benefit from this technology,\" she added.</p><p>US President Donald Trump and Europe have been leading efforts to end the war - but Putin has repeatedly rejected calls for a ceasefire.</p><p>Kyiv and its allies accuse the Russian president of stalling tactics as his troops continue making slow progress on the battlefield - despite the reporting of very high combat casualties.</p></div>"
  },
  {
    "title": "Italy PM tells Gaza aid flotilla to stop or risk 'preventing peace'",
    "url": "https://www.bbc.com/news/articles/cwyr2lwg1rjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/75e9/live/c4feee70-9e4c-11f0-99a3-13671fc07a0c.jpg",
    "tag": "World",
    "date": "2025-10-01T03:17:53.000Z",
    "description": "4 hours agoJames ChaterReutersItalian leader Giorgia Meloni says a new US proposal has sparked \"hope\" of ending the Israel-Hamas warItalian Prime Minister Giorgia Meloni has told a flotilla sailing towards...",
    "body": "<article><div><div><p>4 hours ago</p></div><p><span><p><span>James Chater</span><span></span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/75e9/live/c4feee70-9e4c-11f0-99a3-13671fc07a0c.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/75e9/live/c4feee70-9e4c-11f0-99a3-13671fc07a0c.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/75e9/live/c4feee70-9e4c-11f0-99a3-13671fc07a0c.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/75e9/live/c4feee70-9e4c-11f0-99a3-13671fc07a0c.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/75e9/live/c4feee70-9e4c-11f0-99a3-13671fc07a0c.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/75e9/live/c4feee70-9e4c-11f0-99a3-13671fc07a0c.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/75e9/live/c4feee70-9e4c-11f0-99a3-13671fc07a0c.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/75e9/live/c4feee70-9e4c-11f0-99a3-13671fc07a0c.jpg.webp\" alt=\"Reuters Giorgia Meloni, wearing a beige suit and gold, floral earrings, leans her head toward the camera. \" /><span>Reuters</span></p></div><p></p><figcaption>Italian leader Giorgia Meloni says a new US proposal has sparked \"hope\" of ending the Israel-Hamas war</figcaption><p></p></figure><div><p>Italian Prime Minister Giorgia Meloni has told a flotilla sailing towards Gaza to stop, saying the latest attempt by activists to deliver aid risks derailing a US plan to end the war.</p><p>More than 40 boats sailing in the Global Sumud Flotilla (GSF) have been accompanied by an Italian naval frigate, which Italian officials said would stop once the flotilla was 150 nautical miles (278km) from Gaza's shoreline.</p><p>Shortly after reaching that point on Wednesday, GSF said it was on \"high alert\" and that drone activity was \"increasing\" above the flotilla.</p><p>Meloni said the US proposal had sparked \"hope\" of ending the Israel-Hamas war, adding it was \"a fragile balance, which many would be happy to destroy\".</p></div><div><p>\"I fear that the flotilla's attempt to break the Israeli naval blockade could serve as a pretext to do so,\" Meloni said. </p><p>Israel has told the flotilla to deliver the humanitarian aid to an Israeli port instead, according to the AFP news agency.</p><p>The flotilla consists of more than 500 people, including Italian politicians and Swedish climate activist Greta Thunberg. </p><p>In a series of posts on Telegram early on Wednesday morning, GSF said that it has now entered the area \"where previous flotillas have been attacked and/or intercepted\". </p><p>It added that they had prepared for a possible interception after several unidentified vessels, some without lights, approached the flotilla. The unidentified vessels have since departed.</p><p>Italian officials have urged the flotilla to accept a compromise and drop the aid in Cyprus to avoid a confrontation with Israel.</p><p>\"Any other choice risks becoming a pretext for preventing peace, fuelling conflict and therefore affecting above all the people of Gaza,\" Meloni said. </p><ul><li><a target=\"_blank\" href=\"https://www.bbc.com/news/articles/c1dq9xwngv2o\">Trump and Netanyahu agree new Gaza peace plan</a></li></ul><p>But in a statement, the Global Sumud Flotilla said it would continue to sail.</p><p>\"The Italian navy will not derail this mission. The humanitarian demand to break the blockade cannot be walked back to port,\" it said.</p></div><p></p><figcaption>Watch: Greta Thunberg on whether Gaza flotilla is a 'publicity stunt'</figcaption><p></p><div><p>Last week, Italian Defence Minister Guido Crosetto condemned what he said was an <a target=\"_blank\" href=\"https://www.bbc.com/news/articles/ce3yz939qnpo\">overnight drone attack</a> by unidentified perpetrators on the flotilla. </p><p>Italy and Spain deployed naval ships to the flotilla, then off the coast of Crete, after it reported explosions, drones overhead and communications jamming - accusing Israel of a \"dangerous escalation\". </p><p>Israel did not comment on the incident - but has repeatedly said the flotilla is a Hamas operation, without citing evidence. </p><p>Pope Leo XIV also expressed concern for the safety of the flotilla. \"From all sides, people are saying, 'let's hope that there will not be violence, that people are respected'. That's very important,\" he said.</p><p>In an interview with the BBC on Sunday, Greta Thunberg pushed back against criticism that the flotilla was a publicity stunt.</p><p>\"I don't think anyone would risk their life for a publicity stunt,\" she said. </p><p><a target=\"_blank\" href=\"https://www.bbc.com/news/articles/c1dq9xwngv2o\">The US peace plan for Gaza</a> proposes an immediate end to fighting, the release within 72 hours of 20 living Israeli hostages held by Hamas as well as the remains of the more than two dozen hostages who are believed to be dead - in exchange for hundreds of detained Gazans.</p></div></article>"
  },
  {
    "title": "Nathi Mthethwa: South Africa's top diplomat in France found dead near Paris hotel",
    "url": "https://www.bbc.com/news/articles/ce3y505yq4ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ca83/live/869eb4c0-9dfd-11f0-a82d-4d2348b593b6.jpg",
    "tag": "World",
    "date": "2025-09-30T16:21:56.000Z",
    "description": "Khanyisile NgcoboJohannesburgSouth Africa's ambassador to France, Nathi Mthethwa, has been found dead near the four-star Hyatt Regency Hotel in Paris, French officials have told the BBC.Mthethwa, 58, was...",
    "body": "<div><p><span><p><span>Khanyisile Ngcobo</span><span>Johannesburg</span></p></span></p></div><div><p>South Africa's ambassador to France, Nathi Mthethwa, has been found dead near the four-star Hyatt Regency Hotel in Paris, French officials have told the BBC.</p><p>Mthethwa, 58, was reported missing by his wife on Monday evening, after a \"worrying message from him\", the Paris prosecutor's office said.</p><p>He had booked a room on the 22nd floor of the high-rise hotel, whose security window was forced open, it added.</p><p>The circumstances around his death are unclear at this stage, and an investigation has been opened, the Paris prosecutor's office said, adding that a duty magistrate was \"going to the scene\".</p></div><div><p>Mthethwa was a high-ranking member of the African National Congress, the party that brought in democratic rule in 1994 with Nelson Mandela as South Africa's first black president.</p><p>He had been serving as South Africa's ambassador to Paris since December 2023, and had previously been in government as police minister and also arts and culture minister. </p><p>He was a close ally of former President Jacob Zuma and was implicated in what is known in South Africa as the state capture inquiry, which looked into allegations of high-level corruption during Zuma's presidency.</p><p>In a statement, South Africa's Foreign Minister Ronald Lamola hailed Mthethwa as a \"distinguished servant of the nation\".</p><p>\"I have no doubt that his passing is not only a national loss but is also felt within the international diplomatic community,\" he added.</p><p>Lamola confirmed that the circumstances around Mthethwa's death were being investigated by the French authorities.</p></div>"
  },
  {
    "title": "US deporting 120 Iranians after deal struck with Tehran, Iran says",
    "url": "https://www.bbc.com/news/articles/cgrql7gd10do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7011/live/7f9904b0-9ded-11f0-84af-5952fa7ec6ed.jpg",
    "tag": "World",
    "date": "2025-09-30T13:21:54.000Z",
    "description": "Iran says 120 of its nationals are being deported from the US, as part of President Donald Trump's crackdown on immigration.\"These individuals will return to the country within the next one or two days,\"...",
    "body": "<div><p>Iran says 120 of its nationals are being deported from the US, as part of President Donald Trump's crackdown on immigration.</p><p>\"These individuals will return to the country within the next one or two days,\" Iranian foreign ministry official Hossein Noushabadi told Iran's Tasnim state news agency. </p><p>He said most of those being flown to Iran, via Qatar, had entered the US illegally - mainly through Mexico.</p><p>There has been an increased number of Iranians entering the US in recent years, including many who fear persecution at home.</p></div><div><p>White House spokesperson Abigail Jackson told the BBC: \"The Trump administration is committed to fulfilling President Trump's promise to carry out the largest mass deportation operation of illegal aliens in history, using all the tools at our disposal.\" </p><p>Noushabadi said some of those being deported held valid US residency permits, adding that US officials had sought their consent for their return.</p><p>He called on the US government \"to respect the rights of Iranian migrants and their citizenship rights under international law\".</p><p>The New York Times, citing two senior Iranian officials familiar with the matter, said the flight of deportees was expected to arrive in Iran later on Tuesday. </p><p>Iran has been working with the US on a deal to remove<b> </b>the Iranian nationals through its US Interests Section at the Pakistani embassy in Tehran.<b> </b></p><p>It is a rare instance of cooperation between Iran and the US, who do not have formal diplomatic ties.</p><p>Noushabadi said as part of the deal some 400 Iranian nationals are expected to be deported from the US, with this flight considered the first phase. </p><p>The US has already reached bilateral deportation agreements with a number of countries.</p><p>Earlier this year, Panama and Costa Rica agreed to take in several hundred African and Asian migrants from the US.</p><p>President Trump has repeatedly pledged to cut the flow of immigration to the US and plans to deport a record number of people living in the country without legal status - including to countries with controversial human rights records.</p><p>He has promised to \"launch the largest deportation programme of criminals in the history of America\" - but it is not known whether the Iranian nationals being deported have criminal records. </p><p>Trump's moves have drawn strong criticisms from human rights groups in the US and abroad, who say migrants face the risk of being sent to countries where they could be harmed.</p><p>In Iran, the regime's human rights record has been strongly criticised by rights groups, with UN experts also warning on Monday that there has been a \"dramatic escalation\" in the use of the death penalty this year.</p><p>The Iranian government has previously defended its use of executions, saying it is limited to only \"the most severe crimes\" - though human rights groups dispute this.</p></div>"
  },
  {
    "title": "Australia sunscreen scandal grows as more products pulled off shelves",
    "url": "https://www.bbc.com/news/articles/c62qdje2ll4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/80c6/live/8ea388e0-9e5b-11f0-84a5-3b487a8b7460.jpg",
    "tag": "World",
    "date": "2025-10-01T02:15:44.000Z",
    "description": "A sunscreen scandal in Australia is continuing to grow, with 18 products now pulled from shelves in the skin cancer hotspot over safety concerns.Analysis by a consumer advocacy group in June found several...",
    "body": "<div><p>A sunscreen scandal in Australia is continuing to grow, with 18 products now pulled from shelves in the skin cancer hotspot over safety concerns.</p><p>Analysis by a consumer advocacy group in June found several popular and expensive sunscreens did not provide the protection claimed by their makers.</p><p>One product, Ultra Violette's Lean Screen Skinscreen, is supposed to offer a skin protection factor (SPF) of 50+ but instead returned a result of SPF 4 and was voluntarily recalled in August.</p><p>An investigation by the medicines regulator has now warned about 20 more sunscreens from other brands, which share the same base formula, and raised \"significant concerns\" about a testing laboratory.</p></div><div><p>\"The preliminary testing indicates that this base formulation is unlikely to have an SPF greater than 21,\" the Therapeutic Goods Administration (TGA) said in an update, adding that for some of the goods the SPF rating may be as low as four.</p><p>Of the 21 products it named, eight have been recalled or manufacture stopped completely. The sale of another 10 products have been paused, and two more are being reviewed. One product named by the TGA is made in Australia but is not sold in the country.</p><p>Australia has the highest rate of skin cancers in the world - it is estimated that two out of three Australians will have at least one cut out in their lifetime - and it has some of the strictest sunscreen regulations globally.</p><p><a target=\"_blank\" href=\"https://www.bbc.com/news/articles/c4gzl41rpdqo\">The scandal has caused a massive backlash from customers in the nation</a>, but experts have warned it may also have global implications. Problems have been identified with both the manufacture of some sunscreens and the integrity of lab testing relied upon to prove their SPF claims.</p><p>The manufacturer of the base formula in question, Wild Child Laboratories Pty Ltd, has stopped making it as a result, the TGA said.</p><p>In a statement, Wild Child Laboratories boss Tom Curnow said the TGA had found no manufacturing issues at its facility.</p><p>\"The discrepancies reported in recent testing are part of a broader, industry-wide issue,\" he said.</p><p>The TGA has previously said it is looking into \"reviewing existing SPF testing requirements\" which can be \"highly subjective\", but in the update on Tuesday said it had significant concerns about testing undertaken by Princeton Consumer Research Corp (PCR Corp), a US lab.</p><p>\"The TGA is aware that many companies responsible for sunscreens manufactured using this base formulation relied on testing by PCR Corp to support their SPF claims.\"</p><p>Mr Curnow said Wild Child had ceased working with PCR laboratories and had submitted its formulas for testing with other accredited, independent laboratories.</p><p>All companies using the problematic base formula and the PCR lab have also been contacted by the TGA, it said.</p><p>\"The TGA has also written to PCR Corp regarding its concerns and has not received a response.\"</p><p>The BBC has contacted PCR Corp for comment.</p></div>"
  },
  {
    "title": "Nina Kutina: Russian woman found living in Karnataka cave with children returns home",
    "url": "https://www.bbc.com/news/articles/cjed4np5q38o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6f8e/live/99983000-9db3-11f0-a4c4-7fb78e8ccd05.jpg",
    "tag": "World",
    "date": "2025-09-30T06:08:56.000Z",
    "description": "1 day agoImran QureshiBBC News, BengaluruA Russian woman who made global headlines after being found living in a cave in India with her two young daughters has flown back to her country, an official told the...",
    "body": "<div><div><p>1 day ago</p></div><p><span><p><span>Imran Qureshi</span><span>BBC News, Bengaluru</span></p></span></p></div><div><p>A Russian woman who made global headlines after being found living in a cave in India with her two young daughters has flown back to her country, an official told the BBC.</p><p>Nina Kutina, 40, and her daughters - aged six and five - <a target=\"_blank\" href=\"https://www.bbc.com/news/articles/c8d68848d34o\">were rescued on 9 July</a> by policemen on a routine patrol in a forest in the southern state of Karnataka.</p><p>The woman, who did not have valid documents to stay in India, had been sent to a foreigners' detention centre along with her daughters.</p><p>Last week, the Karnataka high court asked the federal government to issue documents to Ms Kutina and her daughters to return home.</p></div><div><p>They left for Russia on 28 September, an official at the Foreigners' Regional Registration Office (FRRO), who wanted to stay anonymous, told BBC Hindi. Ms Kutina's minor son from another relationship, who was later found living in Goa state, also went with them.</p><p>The high court had been hearing a petition filed by Dror Shlomo Goldstein, an Israeli businessman living in Goa, who said he was the father of the two minor girls. He had asked the court to stop the children from being sent back to Russia and appealed for their custody.</p><p>Mr Goldstein hasn't commented on the court order yet. He has the option to appeal against it, but it's not clear whether a judgment in his favour could compel the children to be sent back to India.</p><p>Mr Goldstein had earlier told a TV channel that Ms Kutina had left Goa without informing him and that he had filed a police complaint. He also said that he had been \"providing for their [the woman and the two minor girls] well-being for a long time\".</p><p>In the order, the court however said that despite Mr Goldstein's claims, the mum and the children had \"rather inexplicably\"  been \"found in an isolated cave\". </p><p>The court also said that Mr Goldstein could not explain why they had been living in the cave \"until they were found there and the authorities began [taking] action for their rehabilitation\". </p></div><div><p>The police team that found the three had earlier said they were on a routine patrol near Ramteertha hills in the Gokarna forest, which borders the tourist paradise of Goa, when they spotted brightly coloured clothes hung near a cave. </p><p>When they got closer - the entrance to the cave had been curtained off with brightly coloured saris - they saw a \"little blonde girl\" running out. When the shocked policemen followed her inside, they found Ms Kutina and the other child.</p><p>The three of them had meagre possessions - plastic mats, clothes, packets of instant noodles and some other grocery items - and the cave was leaking.</p><ul><li><a target=\"_blank\" href=\"https://www.bbc.com/news/articles/c8d68848d34o\">Mystery surrounds Russian mum and children found in Indian cave</a></li></ul><p>The police told the BBC in July that they had a tough time convincing the mother that it was dangerous to stay in the isolated location with snakes and wild animals in the forest. The police quoted her as saying: \"Animals and snakes are our friends. Humans are dangerous.\"</p><p>Police said she told them that they had been living in the cave for a week when they were found. She also told the police that she came to Karnataka from Goa where she also claimed to have lived in a cave. She said that her youngest daughter was born in a Goa cave.</p><p>Ms Kutina had defended her lifestyle in video interviews to Indian news agency ANI, saying she and her children were happy living like that and that \"nature gives good health\".</p><p>The police, however, said that they could not take any chances as the area was prone to landslides during the monsoon season.</p><p>Ms Kutina and her daughters were taken for a medical examination and then shifted to a detention centre.</p><p>Mr Goldstein's lawyer, Beena PK, argued in court that deportation would not be in the interests of the children, citing India being a signatory to the United Nations Convention on the Rights of the Child and provisions of the Goa Children Act, 2003.</p><p>But the lawyer for the federal government, Arvind Kamath, told the court that this case could not be described as deportation' because Ms Kutina herself had written to the Russian embassy expressing her wish to return to her home country.</p><p>Court documents show that the Russian embassy offered Ms Kutina and the children an emergency travel window between 26 September and 9 October.</p><p><i>Follow BBC News India on </i><a target=\"_blank\" href=\"https://www.instagram.com/bbcnewsindia/\"><i>Instagram</i></a><i>, </i><a target=\"_blank\" href=\"https://www.youtube.com/@bbcnewsindia/featured\"><i>YouTube,</i></a><i> </i><a target=\"_blank\" href=\"https://x.com/BBCIndia\"><i>Twitter</i></a><i> and </i><a target=\"_blank\" href=\"https://www.facebook.com/bbcindia/\"><i>Facebook</i></a><i>.</i></p></div>"
  },
  {
    "title": "For Netanyahu, avoiding a peace deal may now be worse than agreeing one",
    "url": "https://www.bbc.com/news/articles/c0jq63edv21o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/02dd/live/b01c2190-9e19-11f0-b741-177e3e2c2fc7.jpg",
    "tag": "World",
    "date": "2025-09-30T13:36:59.000Z",
    "description": "17 hours agoLucy WilliamsonMiddle East Correspondent, JerusalemHe promised total victory for Israel, but standing next to Donald Trump at the White House on Monday, it was Benjamin Netanyahu who looked...",
    "body": "<div><div><p>17 hours ago</p></div><p><span><p><span>Lucy Williamson</span><span>Middle East Correspondent, Jerusalem</span></p></span></p></div><div><p>He promised total victory for Israel, but standing next to Donald Trump at the White House on Monday, it was Benjamin Netanyahu who looked defeated.</p><p>Israel's prime minister was saying all the right things about the peace deal he had just agreed to, but he seemed deflated, his voice hoarse and his energy dimmed, as he praised Trump as \"the greatest friend Israel has ever had in the White House\".</p><p>It is a friendship that could cost him his government.</p><p>Netanyahu's far-right allies have threatened to leave – and possibly collapse – his government if he makes too many concessions in ending the war. Coalition partners like Bezalel Smotrich and Itamar Ben-Gvir have made little secret of their desire to annex Gaza, drive out Palestinians and re-establish Jewish settlements there. </p><p>They – and Netanyahu – have been implacably opposed to any role for the Palestinian Authority in Gaza, and any pathway to a Palestinian State. The deal Netanyahu has now agreed to outlines both, though with heavy caveats.</p><p>Trump knows that by pushing the Israeli prime minister into this deal, he is asking him to risk his government. In return, he is dangling the prospect of a historic legacy – a new, more peaceful future for the region, and new ties between Israel and its Arab neighbours.</p></div><div><p>There were signs, even before Netanyahu left for Washington, that he knew this choice was coming.</p><p>Israel's president, Isaac Herzog, told an Israeli radio station that he was considering pardoning Netanyahu in the corruption cases he is currently facing in court. These trials are one reason, his critics allege, that he is reluctant to leave office and face the judges without the shield of his national duties, power and profile.</p><p>But the political exit being offered to him in this moment – a regional legacy in return for giving up his government, and possibly his political career – does not seem to have entirely won him over.</p><p>His first response to his countrymen today has been to publicly emphasise that he did not, in fact, agree to a Palestinian state.</p><p>\"Absolutely not. It's not even written in the agreement,\" he said in response to a question on camera. \"But we did say one thing – that we would forcibly resist a Palestinian state.\"</p><p>Reports in the Israeli media this morning also suggest that Israel's cabinet will not get to vote on the full terms of the deal – but only on the exchange of Israeli hostages for Palestinian prisoners.</p><p>The question is what these actions signify about his political calculation: whether Netanyahu is trying to hold his government together long enough to work his political magic on the polls, which currently predict he would lose an election, or whether he is banking on Hamas rejecting this deal – or being unable to control its commanders on the ground in Gaza – and that the war will not stop at all.</p><p>The potential continuation of the war was something he emphasised in that uncomfortable press conference in Washington, underlining – with Trump's backing – that Israel would have free rein to \"finish the job\" if Hamas failed to deliver on its side of the deal. Seen in that light, this uncomfortable moment could be the price of continuing American support for his war.</p><p>Netanyahu is known as a master of political manoeuvres, threading a path between political roadblocks to buy time. He has shifted position through previous rounds of negotiations, and has ridden through previous ceasefire deals, only to back out when a permanent end to the war is up for discussion.</p><p>Many believe he has never wanted to negotiate an end to this war, but to force Hamas into a surrender on Israel's terms. But it is hard to maintain that uncompromising image of \"total victory\" when you have publicly conceded to the very things you have spent a career preventing, and when you are waiting for your enemy's response.</p><p>For the first time since the war began, it seems that the consequences of avoiding this deal were worse than the consequences of agreeing to it. And if Trump really did force him to choose between his ally in Washington and his allies at home, why didn't Joe Biden do the same when a similar deal was on the table nine months ago – and at least 20,000 more Gazans were still alive?</p></div>"
  },
  {
    "title": "How the government shutdown will affect Americans",
    "url": "https://www.bbc.com/news/articles/cgj1p485p0no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0244/live/0623ca90-9e95-11f0-928c-71dbb8619e94.jpg",
    "tag": "World",
    "date": "2025-10-01T05:27:19.000Z",
    "description": "Jobs, travel, national parks - what impact will US shutdown have?2 hours agoMax MatzaWatch: What could happen during the US government shutdown?The US federal government has shut down after Republican and...",
    "body": "<article><p></p><h2>Jobs, travel, national parks - what impact will US shutdown have?</h2><p></p><div><div><p>2 hours ago</p></div><p><span><p><span>Max Matza</span><span></span></p></span></p></div><p></p><figcaption>Watch: What could happen during the US government shutdown?</figcaption><p></p><div><p>The US federal government has shut down after Republican and Democratic lawmakers failed to resolve a budget standoff.</p><p>The impasse affects the of funding government operations through October and beyond and is poised to cause widespread disruption for Americans in areas ranging from air travel to zoo visits.</p><p>The political gridlock is also expected to put 40% of the federal workforce – about 800,000 people – on unpaid leave.</p><p>Here's how its impact will be felt across the country.</p></div><div><ul><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/news/live/clylje0rmp2t\">Follow live updates after US government shuts down</a></li></ul></div><p></p><h2>Your next flight</h2><p></p><div><p>A federal shutdown will hit flyers in a variety of ways, potentially leading to long security queues, and delays caused by unpaid air traffic controllers choosing to stay home rather than work for free. </p><p>Air traffic control and Transportation Safety Administration (TSA) workers are considered \"essential\", so they will continue to go to work in the event of a shutdown. </p><p>But they will not be paid until the shutdown ends. During the last shutdown in 2018-2019, these workers increasingly began to call in sick, leading to airport delays.</p><p>Impact will also be felt by Americans planning to travel abroad, with US passport agencies warning that it could take longer than usual to process travel documents.</p></div><div><ul><li><a target=\"_blank\" href=\"https://www.bbc.co.uk/news/articles/crrj1znp0pyo\">How long will the shutdown last and what to know</a></li></ul></div><p></p><h2>No work - or pay - for federal workers</h2><p></p><div><p>Federal employees are expected to be hardest hit, as they will not receive any pay cheque while the shutdown continues.</p><p>Some workers may choose to take second jobs, as they have during previous shutdowns. Employees that are not deemed to be essential will be forced to stay home. In the past, these workers have then been paid retrospectively.</p><p>Several agencies, like the Centers for Disease Control and Prevention and the National Institutes of Health are likely to furlough many workers, affecting ongoing research and experiments already in progress.</p><p>President Donald Trump, who has slashed government spending and cut federal jobs since taking office, warned repeatedly that a shutdown could accelerate further layoffs and allow him to cut services and programmes he says are important to Democrats. </p><p>Contractors, who work for federal agencies but are not directly employed by the government, will miss out on work, too. These workers historically have not received any backpay,  according to the Committee for a Responsible Federal Budget.</p></div><p></p><h2>National Parks with no staff</h2><p></p><div><p>Federal lands, including National Parks and National Forests, have been closed off to visitors during past shutdowns, since the rangers and other employees were asked to stay at home.</p><p>During the last shutdown, the Trump administration made the decision to leave parks open, with few to no federal workers there to staff them. </p><p>According to park advocates, the decision led to vandalism in parks, as visitors drove through protected landscapes, looted historical sites, and rampantly littered.</p><p>A group of more than 40 former park superintendents have appealed to the White House to completely close parks down in the event of a shutdown.</p><p>\"We don't leave museums open without curators, or airports without air traffic controllers - and we should not leave our national parks open without National Park Service workers,\" said Emily Thompson of the Coalition to Protect America's National Parks.</p></div><p></p><h2>Visit to the zoo</h2><p></p><div><p>Washington DC's famous Smithsonian Institution museums will stay open until at least next Monday, 6 October.</p><p>On the Smithsonian website, the organisation said it had money available from years prior to help it stay open.</p><p>Animals at the National Zoo \"will continue to be fed and cared for,\" according to the Smithsonian, which runs the zoo.</p><p>But the popular webcams will be shut off, as they have been deemed non-essential by zoo staff.</p><p>The suspension of the broadcasts will disrupt viewers peek at the zoo's pandas, lions, elephants and naked mole rats.  </p></div><p></p><h2>Health care for the elderly and poor</h2><p></p><div><p>Medicare and Medicaid, social health programmes for the elderly and poor, will continue, but staffing shortages could lead to some interruptions for certain services. </p><p>Emergency disaster relief is also expected to be largely unaffected, however other work done by disaster agencies will be affected.</p><p>The National Flood Insurance Program will be closed, delaying some mortgages on properties that require policies from the government-run programme. </p><p>But if the shutdown drags out, it is possible that the Federal Emergency Management Administration (Fema) could run out of money for its Disaster Relief Fund. </p><p>Food assistance programmes will also be impacted, with the Supplemental Nutrition Program for Women, Infants, and Children (WIC) expected to rapidly run out of funds. </p><p>The Supplemental Nutrition Assistance Program (formerly known as food stamps) is expected to continue for longer, but is also at risk of running out of funding.</p></div></article>"
  },
  {
    "title": "Trump says US cities should be military training grounds",
    "url": "https://www.bbc.com/news/articles/cvgq044n72po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f76f/live/7f93a780-9e2f-11f0-928c-71dbb8619e94.jpg",
    "tag": "World",
    "date": "2025-10-01T02:18:40.000Z",
    "description": "5 hours agoBernd Debusmann JrVirginia andJames FitzGeraldUS President Donald Trump has said he wants to use American cities as \"training grounds\" for the military. In an unusual address to hundreds of...",
    "body": "<div><div><p>5 hours ago</p></div><p><span><p><span>Bernd Debusmann Jr</span><span>Virginia</span><span> and</span></p><p><span>James FitzGerald</span><span></span></p></span></p></div><div><p>US President Donald Trump has said he wants to use American cities as \"training grounds\" for the military. </p><p>In an unusual address to hundreds of military leaders assembled from across the world, Trump described \"civil disturbances\" as the \"enemy from within\". He added that the situation \"won't get out of control once you're involved\". </p><p>It comes after Trump deployed National Guard troops to Washington DC, Los Angeles and Portland, Oregon, in a crackdown on crime and to support immigration enforcement.</p><p>Defence Secretary Pete Hegseth also spoke, declaring an end to \"woke\" culture at the Pentagon and announcing new \"male-level\", physical fitness standards for military officials.</p></div><div><p>The president repeated his criticism of Democratic-led cities including San Francisco, Chicago, New York and Los Angeles and indicated he would continue his policy of using military for law enforcement. </p><p>\"They're very unsafe places and we're going to straighten them out one by one,\" he said, adding that it would be a \"a major part for some of the people in this room\". </p><p>\"It's a war from within. Controlling the physical territory of our borders is essential for national security. We can't let these people in,\" he added. </p><p>Illinois Governor JB Pritzker accused Trump of using military troops and Immigration and Customs Enforcement (ICE) to \"invade and disrupt\" US cities.</p><p>\"Our troops and our nation deserve better than you acting as a petty tyrant,\" he said in a post on X. </p><p>Security was extremely tight for the address at Marine Corps Base Quantico, a sprawling 55,000-acre facility in Virginia. The summit represented a rare gathering of so many senior personnel in one place.</p><p>Generals and admirals stationed around the world listened silently to the two men's remarks.</p><p>The event began with an address from Hegseth, who announced that the US military will require combatants to meet the \"highest male standard\" in physical fitness tests. </p><p>Hegseth acknowledged that the move may exclude some women from serving. </p><p>\"Standards must be uniform, gender neutral, and high,\" Hegseth told the crowd. </p><p>Hegseth outlined his visions for cultural shift at the Pentagon and a greater \"warrior ethos\". He was echoed by Trump, who spoke afterwards.</p><p>His speech focused on the culture of the US military, training, leadership, and \"fixing decades of decay\", including DEI (diversity, equity and inclusion) programmes and the promotion of a \"risk-averse\" officer corps.</p><p>He said those officers had been unnerved by \"climate change distractions\", \"woke garbage\" and fears of being labelled as \"toxic\" leaders.</p><p>As well as announcing changes to fitness standards, Hegseth vowed an end to the \"era of unprofessional appearances\" - including beard exemptions - and to anonymous complaints procedures, as part of wider departmental changes.</p><p>Illinois Senator Tammy Duckworth, a military veteran, told the BBC she was worried about what Hegseth's remarks would mean for the future of the US military.</p><p>\"His comments today are going to affect all kinds of recruiting, not just women, I don't know folks who want to serve in a military that's being used for political theatre,\" she said.</p><p>Duckworth said Hegseth was trying to get women and people of colour out of the military.</p><p>\"For a guy who's not qualified for his own job, it's pretty discriminatory to talk about women who are qualified to do their jobs,\" she said.</p><p>Hegseth also addressed his previous firing of senior commanders, saying that he went with \"his gut\" and rid the military of those he believed would not shift away from policies set in previous administrations.</p><p>\"More leadership changes will be made, I'm certain,\" he said.</p><p>No official reason was publicly provided when the generals were summoned at short notice last week, prompting a flurry of speculation around what Trump and Hegseth would say.</p><p>Speaking about Hegseth's reforms, Trump said that a focus on \"fitness, ability and character\" is not to \"protect anyone's feelings\".</p><p>\"It's to protect our country. We will not be politically correct when it comes to defending American freedom,\" he said.</p><p>The president also applauded his move to rebrand the Defence Department as the Department of War. </p><p>He said the secondary title for the Pentagon was \"so popular\", even among his detractors, and contributed to what he has repeatedly claimed are skyrocketing recruitment figures.</p><p>\"It's a historic re-assertion of our purpose, our identity and our pride,\" he said.</p></div><div><p>There was very little visible or audible reaction from the assembled generals and senior enlisted personnel in the audience, which was mostly silent except for the sound of hundreds of boots snapping to attention as he took the stage and stepped off. Many took notes in some military field notebooks as Hegseth spoke.</p><p>Trump took the stage afterwards, joking: \"I've never walked into a room so silent before.\"</p><p>He went on to remark: \"Together, we're reawakening the warrior spirit. And this is a spirit that won and built this nation.\"</p><p>In a wide-ranging address, the US president went on to tout the achievements of the American military - and his own second presidency. </p><p>He remarked that he had \"settled\" seven wars, and hoped for an eighth - if Hamas accepted the proposal for Gaza that he had put forward with Israel.</p></div><div><p>Ahead of the event, US Vice-President JD Vance had accused the media of turning the meeting into a \"big story\", stressing that it was \"not particularly unusual\" for Hegseth's generals to meet him in person.</p><p>Some observers disagreed. Giuseppe Cavo Dragone, an Italian admiral who serves as the chair of the Nato Military Committee, was quoted by the AP news agency as saying: \"As far as my 49 years of service, I've never seen that before.\"</p><p>Mark Cancian of the Center for Strategic and International Studies think tank told Reuters: \"It is mystifying why this was not done virtually so that senior officers don't have to spend a lot of time travelling.\"  </p><p>Explaining the purpose of the meeting in advance, Trump told NBC News it would be an exercise in generating some \"esprit de corps\" - suggesting that he saw an opportunity to galvanise his troops.</p><p>The attendees reportedly included officers drawn from military installations as far as Europe, South Korea and the Middle East.</p><p>Many of them arrived hours before the event, and were seated in the auditorium according to their branch of service - Army, Marine Corps, Navy, Air Force and Space Force, easily distinguishable by uniforms.</p><p>Some wore campaign medals showing they had served in Afghanistan, Iraq or the American wider war on terror that was launched following the September 11 attacks in 2001.</p><p><i>Additional reporting from Ana Faguy on Capitol Hill</i></p></div>"
  },
  {
    "title": "No more scribbles: Indian court tells doctors to fix their handwriting",
    "url": "https://www.bbc.com/news/articles/cn0r88nrx70o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5b0f/live/b5cc8b30-9dc3-11f0-a9d8-ada00bb49210.jpg",
    "tag": "World",
    "date": "2025-10-01T01:29:09.000Z",
    "description": "6 hours agoGeeta PandeyBBC News, DelhiChilukuri ParamathamaAn illegible prescription by an Indian doctor in Madhya Pradesh state last year went viralAt a time when most people use keyboards to write, does...",
    "body": "<article><div><div><p>6 hours ago</p></div><p><span><p><span>Geeta Pandey</span><span>BBC News, Delhi</span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/5b0f/live/b5cc8b30-9dc3-11f0-a9d8-ada00bb49210.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/5b0f/live/b5cc8b30-9dc3-11f0-a9d8-ada00bb49210.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/5b0f/live/b5cc8b30-9dc3-11f0-a9d8-ada00bb49210.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/5b0f/live/b5cc8b30-9dc3-11f0-a9d8-ada00bb49210.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/5b0f/live/b5cc8b30-9dc3-11f0-a9d8-ada00bb49210.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/5b0f/live/b5cc8b30-9dc3-11f0-a9d8-ada00bb49210.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/5b0f/live/b5cc8b30-9dc3-11f0-a9d8-ada00bb49210.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/5b0f/live/b5cc8b30-9dc3-11f0-a9d8-ada00bb49210.jpg.webp\" alt=\"Chilukuri Paramathama An illegible prescription by an Indian doctor in the central Indian state of Madhya Pradesh\" /><span>Chilukuri Paramathama</span></p></div><p></p><figcaption>An illegible prescription by an Indian doctor in Madhya Pradesh state last year went viral</figcaption><p></p></figure><div><p>At a time when most people use keyboards to write, does handwriting really matter?</p><p>Yes, say Indian courts, if the writer is a doctor.</p><p>Jokes around the notoriously bad handwriting of many doctors that can only be deciphered by pharmacists are common in India, as around the world. But the latest order emphasising the importance of clear handwriting came recently from the Punjab and Haryana High Court which said that \"legible medical prescription is a fundamental right\" as it can make a difference between life and death.</p><p>The court order came in a case that had nothing to do with the written word. It involved allegations of rape, cheating and forgery by a woman and Justice Jasgurpreet Singh Puri was hearing the man's petition for bail.</p><p>The woman had alleged that the man had taken money from her promising her a government job, conducted fake interviews with her and sexually exploited her.</p><p>The accused denied the charges - he said they had a consensual relationship and the case was brought on because of a dispute over money.</p><p>Justice Puri said when he looked at the medico-legal report - written by a government doctor who had examined the woman - he found it incomprehensible.</p><p>\"It shook the conscience of this court as not even a word or a letter was legible,\" he wrote in the order.</p><p>The BBC has seen a copy of the judgement which includes the report and a two-page prescription which shows the doctor's unreadable scrawl.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/9c79/live/9ef47d60-9de5-11f0-a561-d7c24224dfc6.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/9c79/live/9ef47d60-9de5-11f0-a561-d7c24224dfc6.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/9c79/live/9ef47d60-9de5-11f0-a561-d7c24224dfc6.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/9c79/live/9ef47d60-9de5-11f0-a561-d7c24224dfc6.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/9c79/live/9ef47d60-9de5-11f0-a561-d7c24224dfc6.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/9c79/live/9ef47d60-9de5-11f0-a561-d7c24224dfc6.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/9c79/live/9ef47d60-9de5-11f0-a561-d7c24224dfc6.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/9c79/live/9ef47d60-9de5-11f0-a561-d7c24224dfc6.jpg.webp\" alt=\"Getty Images Close up of a fountain pen scribbling on a piece of paper \" /><span>Getty Images</span></p></div><p></p><figcaption>Jokes around bad handwriting of doctors that can only be deciphered by pharmacists are common around the world</figcaption><p></p></figure><div><p>\"At a time when technology and computers are easily accessible, it is shocking that government doctors are still writing prescriptions by hand which cannot be read by anybody except perhaps some chemists,\" Justice Puri wrote.</p><p>The court asked the government to include handwriting lessons in the medical school curriculum and set a two-year timeline for rolling out digitised prescriptions.</p><p>Until that happens, all doctors must write prescriptions clearly in capital letters, Justice Puri said.</p><p>Dr Dilip Bhanushali, president of Indian Medical Association that has more than 330,000 doctors as members, told the BBC that they're willing to help find a solution to the problem.</p><p>In cities and bigger towns, he says, doctors have moved to digital prescriptions, but it's very difficult in rural areas and small towns to get prescriptions that are clear.</p><p>\"It's a well-known fact that many doctors have poor handwriting, but that's because most medical practitioners are very busy, especially in overcrowded government hospitals,\" he says.</p><p>\"We have recommended to our members to follow the government guidelines and write prescriptions in bold letters that should be readable to both patients and chemists. A doctor who sees seven patients a day can do it, but if you see 70 patients a day, you can't do it,\" he adds.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/8ade/live/48d588f0-9dc4-11f0-a9d8-ada00bb49210.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/8ade/live/48d588f0-9dc4-11f0-a9d8-ada00bb49210.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/8ade/live/48d588f0-9dc4-11f0-a9d8-ada00bb49210.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/8ade/live/48d588f0-9dc4-11f0-a9d8-ada00bb49210.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/8ade/live/48d588f0-9dc4-11f0-a9d8-ada00bb49210.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/8ade/live/48d588f0-9dc4-11f0-a9d8-ada00bb49210.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/8ade/live/48d588f0-9dc4-11f0-a9d8-ada00bb49210.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/8ade/live/48d588f0-9dc4-11f0-a9d8-ada00bb49210.jpg.webp\" alt=\"Chilukuri Paramathama An illegible prescription by an Indian doctor in the southern city of Nalgonda\" /><span>Chilukuri Paramathama</span></p></div><p></p><figcaption>Experts say a prescription that leaves room for ambiguity or misinterpretation can have serious consequences</figcaption><p></p></figure><div><p>This is not the first time an Indian court has called out sloppy handwriting of doctors. Past instances include the high court in Odisha state which<a target=\"_blank\" href=\"https://economictimes.indiatimes.com/news/india/peeved-at-bad-handwriting-odisha-high-court-orders-doctors-to-write-in-capital-letters/articleshow/106626323.cms?from=mdr\"> flagged</a> \"the zigzag style of writing by doctors\" and judges in Allahabad high court who <a target=\"_blank\" href=\"https://medicaldialogues.in/illegible-handwriting-of-doctors-allahabad-hc-directs-for-printed-medico-legal-reports\">lamented</a> about \"reports written in such shabby handwriting that they are not decipherable\". </p><p>Studies, however, have <a target=\"_blank\" href=\"https://www.cma.ca/healthcare-for-real/why-do-doctors-have-bad-handwriting\">failed to support</a> the conventional wisdom that doctors' handwriting is worse than others. </p><p>But experts say emphasis on their handwriting is not about aesthetics or convenience but a medical prescription that leaves room for ambiguity or misinterpretation can have serious - even tragic - consequences.</p><p>According to a 1999 <a target=\"_blank\" href=\"https://www.jpedhc.org/article/S0891-5245(00)70009-5/fulltext\">report</a> by the Institute of Medicine (IoM), medical errors caused at least an estimated 44,000 preventable deaths annually in the US, of which 7,000 were attributable to sloppy handwriting. </p><p>More recently, in Scotland a woman <a target=\"_blank\" href=\"https://www.bbc.com/news/health-46793916\">suffered chemical injuries</a> after she was mistakenly given erectile dysfunction cream for a dry eye condition. </p><p>Health authorities in the UK have admitted that \"drug errors caused appalling levels of harm and deaths\" and added that \"roll out of electronic prescribing systems across more hospitals could reduce errors by 50%\".  </p><p>India does not have robust data on harm caused by poor handwriting, but in the world's most populous country misreading of prescriptions in the past has resulted in health emergencies and many deaths.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/4dcd/live/48627140-9dc3-11f0-a9d8-ada00bb49210.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/4dcd/live/48627140-9dc3-11f0-a9d8-ada00bb49210.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/4dcd/live/48627140-9dc3-11f0-a9d8-ada00bb49210.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/4dcd/live/48627140-9dc3-11f0-a9d8-ada00bb49210.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/4dcd/live/48627140-9dc3-11f0-a9d8-ada00bb49210.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/4dcd/live/48627140-9dc3-11f0-a9d8-ada00bb49210.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/4dcd/live/48627140-9dc3-11f0-a9d8-ada00bb49210.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/4dcd/live/48627140-9dc3-11f0-a9d8-ada00bb49210.jpg.webp\" alt=\"Chilukuri Paramathama An illegible prescription by an Indian doctor in Hyderabad city\" /><span>Chilukuri Paramathama</span></p></div><p></p><figcaption>Pharmacists say that badly-written prescriptions continue to arrive at their shops</figcaption><p></p></figure><div><p>There's <a target=\"_blank\" href=\"https://health.economictimes.indiatimes.com/health-files/Doctor-s-illegible-handwriting-creating-confusion-causing-death/591\">this much reported case</a> of a woman who suffered from convulsions after taking a medicine for diabetes which had a similar sounding name to an analgesic she had been prescribed. </p><p>Chilukuri Paramathama, who runs a pharmacy in Nalgonda city in the southern Indian state of Telangana, told the BBC that in 2014, he filed a public interest petition in the high court in Hyderabad after reading news reports about a three-year-old who had died in Noida city after she was administered a wrong injection for fever.</p><p>His campaign, seeking a complete ban on handwritten prescriptions, bore fruit when in 2016, the Medical Council of India ordered that \"every physician should prescribe drugs with generic names legibly and preferably in capital letters\".</p><p>In 2020, India's junior health minister Ashwini Kumar Choubey told the parliament that medical authorities in states \"have been empowered to take disciplinary action against a doctor for violating the order\".</p><p>But nearly a decade later, Mr Chilukuri and other pharmacists say that badly-written prescriptions continue to arrive at their shops. Mr Chilukuri sent the BBC a number of prescriptions he's seen over the past few years that even he could not decipher.  </p><p>Ravindra Khandelwal, the CEO of Dhanwantary - one of Kolkata city's best-known pharmacies with 28 branches covering cities, towns and villages in West Bengal and serving more than 4,000 customers daily - says sometimes prescriptions that come to them border on the illegible.</p><p>\"Over the years, we've seen a shift from handwritten to printed prescriptions in cities, but in suburban and rural areas, most are still handwritten.\"</p><p>His staff, he says, are very experienced and able to decipher most of them to ensure customers get the right medicine.</p><p>\"Even so, sometimes we have to call the doctors because it's very important for us to dispense the correct medicine.\"</p><p><i>Follow BBC News India on </i><a target=\"_blank\" href=\"https://www.instagram.com/bbcnewsindia/\"><i>Instagram</i></a><i>, </i><a target=\"_blank\" href=\"https://www.youtube.com/@bbcnewsindia/featured\"><i>YouTube,</i></a><i> </i><a target=\"_blank\" href=\"https://x.com/BBCIndia\"><i>Twitter</i></a><i> and </i><a target=\"_blank\" href=\"https://www.facebook.com/bbcindia/\"><i>Facebook</i></a><i>.</i></p></div></article>"
  },
  {
    "title": "US shutdown looms as Trump and Democrats end meeting without a deal ",
    "url": "https://www.bbc.com/news/articles/c2kn3n315lko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4382/live/47d00c30-9d8a-11f0-92db-77261a15b9d2.jpg",
    "tag": "World",
    "date": "2025-09-30T08:01:11.000Z",
    "description": "22 hours agoAnthony ZurcherNorth America correspondentThe US is hurtling towards a government shutdown on Tuesday night, and there appears to be little appetite on either side of the partisan divide to avoid...",
    "body": "<div><div><p>22 hours ago</p></div><p><span><p><span>Anthony Zurcher</span><span>North America correspondent</span></p></span></p></div><div><p>The US is hurtling towards a government shutdown on Tuesday night, and there appears to be little appetite on either side of the partisan divide to avoid it.</p><p>A last-ditch meeting between President Donald Trump and Democratic leaders in Congress made little progress. If anything, both sides have been digging deeper into their positions.</p><p>\"I think we're headed to a shutdown because the Democrats won't do the right thing,\" Vice President JD Vance told reporters after the meeting at the White House. \"You don't put a gun to the American people's head and say, 'Unless you do exactly what Senate and House Democrats want you to do, we're going to shut down your government'.\"</p><p>Democratic Senate leader Chuck Schumer said there were still \"very large differences\" between his party and the White House.</p><p>No one sounded optimistic.</p><p>These positions hardened further on Monday night after Trump posted an obscenity-laced, AI video mocking the Democratic leadership. </p><p>It depicted House Minority Leader Hakeem Jeffries dressed in a sombrero and a fake moustache, and Schumer saying in an artificial voice that undocumented migrants should get free healthcare. Both men responded angrily, with Jeffries calling it bigotry.</p><p>In terms of the substantive demands from each side, Republicans want a short-term extension of current spending levels – essentially kicking the legislative can a bit farther down the road. </p><p>They're happy with the way things are going, particularly since the Trump administration has been implementing spending cuts on its own, without the help of congressional budget-setters.</p><p>Democrats want that practice to end. </p><p>What's the point, they wonder, with negotiating spending-level agreements if Trump will just ignore them? </p><p>They also want a firm agreement to renew the government health-insurance subsidies for low-income individuals that expire at the end of the year – something Republicans have been reluctant to do so far.</p></div><div><ul><li><a target=\"_blank\" href=\"https://www.bbc.com/news/articles/crrj1znp0pyo\">Why the US government might shut down and what to know</a></li></ul><p>Those are the negotiating positions of both sides, but government shutdown fights are about more than policy – they're about politics.</p><p>Republicans think they have the political high ground. </p><p>The party that makes demands in exchange for keeping the government open – in this case the Democrats – typically gets the lion's share of the blame when a shutdown happens.</p><p>Trump and Republican congressional leaders are already claiming that they are the reasonable ones. </p><p>They're the ones, they say, who simply want to buy more time to negotiate without the adverse consequences of a shutdown.</p><p>Of course, Democrats don't see it that way. </p><p>They believe healthcare is a winning issue for them, so they want the debate to be on whether millions of Americans will lose the ability to afford medical insurance. </p><p>Temporarily funding the government for seven weeks, in their view, just moves that subsidy deadline closer without any appreciable progress.</p><p>Complicating all this for Democrats is the reality that many Republicans seem at peace with an extended government closure.</p><p>White House budget chief Russ Vought recently circulated a memorandum explaining how the Trump administration would use a shutdown to make new, long-term reductions in federal spending and employment rolls.</p><p>Positions and government programmes deemed \"nonessential\" during the closure will be permanently shuttered – an expansion of the Department of Government Efficiency (Doge) cuts from earlier this year.</p><p>But Democratic leaders seem to believe the threats are a bluff or a negotiating tactic. </p><p>Senate Minority Leader Chuck Schumer called it \"an attempt at intimidation\".</p><p>\"Donald Trump has been firing federal workers since day one - not to govern, but to scare,\" Schumer said. \"This is nothing new and has nothing to do with funding the government.\"</p><p>Schumer and his fellow Democratic congressional leaders are also  under intense pressure from their political base to hold fast in the face of Republican attacks. </p><p>In March, Senate Democrats faced withering criticism from within their own party for reaching a six-month spending agreement with Republicans even as Trump was in the midst of his Doge budget-slashing campaign.</p><p>This time around, Democrats may feel compelled to trigger a shutdown to demonstrate their resolve.</p><p>In the end, however, a shutdown fight is a test of wills. It's a test of which side is best able to tolerate political pain.</p><p>Democrats may see a benefit to fighting Republicans, but will they be willing to stand aside as cherished federal programmes and government services – including those for low-income Americans – are shuttered?</p><p>Republicans may talk tough about slashing government, but as the incumbent party they could have the most to lose if the public mood dramatically sours.</p><p>The most recent government shutdown, during Trump's first term, lasted 35 days, setting a record as the longest in American history. </p><p>Although the fight was over spending on the president's proposed US-Mexico border wall, it ended because federal air traffic controllers – who were working without pay – began staying home, threatening massive disruption to US air travel.</p><p>Shutdowns can be unpredictable. And while both sides seem to be itching for a fight, there's no telling when, or how, this fight will end.</p></div>"
  },
  {
    "title": "Human skin DNA fertilised to make embryo for first time",
    "url": "https://www.bbc.com/news/articles/c4g2vyee0zlo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/19ca/live/e7051760-9dd9-11f0-9f23-2534d63ace40.jpg",
    "tag": "World",
    "date": "2025-09-30T15:01:42.000Z",
    "description": "Scientists make embryos from human skin DNA for first time16 hours agoJames GallagherHealth and science correspondentOHSU/Christine Torres HicksUS scientists have, for the first time, made early-stage human...",
    "body": "<article><p></p><h2>Scientists make embryos from human skin DNA for first time</h2><p></p><div><div><p>16 hours ago</p></div><p><span><p><span>James Gallagher</span><span>Health and science correspondent</span></p></span></p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/19ca/live/e7051760-9dd9-11f0-9f23-2534d63ace40.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/19ca/live/e7051760-9dd9-11f0-9f23-2534d63ace40.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/19ca/live/e7051760-9dd9-11f0-9f23-2534d63ace40.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/19ca/live/e7051760-9dd9-11f0-9f23-2534d63ace40.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/19ca/live/e7051760-9dd9-11f0-9f23-2534d63ace40.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/19ca/live/e7051760-9dd9-11f0-9f23-2534d63ace40.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/19ca/live/e7051760-9dd9-11f0-9f23-2534d63ace40.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/19ca/live/e7051760-9dd9-11f0-9f23-2534d63ace40.jpg.webp\" alt=\"OHSU/Christine Torres Hicks A clear petri dish stands is illuminated from below through an aperture in a black platform. There are blobs of fluid in the petri dish and two needle-like implements are there to perform microscopic manipulation of embryos \n\" /><span>OHSU/Christine Torres Hicks</span></p></div></figure><div><p>US scientists have, for the first time, made early-stage human embryos by manipulating DNA taken from people's skin cells and then fertilising it with sperm.</p><p>The technique could overcome infertility due to old age or disease, by using almost any cell in the body as the starting point for life.</p><p>It could even allow same-sex couples to have a genetically related child.</p><p>The method requires significant refinement - which could take a decade - before a fertility clinic could even consider using it.</p><p>Experts said it was an impressive breakthrough, but there needed to be an open discussion with the public about what science was making possible.</p></div><div><p>Reproduction used to be a simple story of man's sperm meets woman's egg. They fuse to make an embryo, and nine months later a baby is born.</p><p>Now scientists are changing the rules. This latest experiment starts with human skin.</p><p>The Oregon Health and Science University research team's technique takes the nucleus – which houses a copy of the entire genetic code needed to build the body – out of a skin cell.</p><p>This is then placed inside a donor egg that has been stripped of its genetic instructions.</p><p>So far, the technique is like the one used to create Dolly the Sheep – the world's first cloned mammal – born back in 1996.</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/6483/live/cf979fd0-9dd9-11f0-9f23-2534d63ace40.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/6483/live/cf979fd0-9dd9-11f0-9f23-2534d63ace40.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/6483/live/cf979fd0-9dd9-11f0-9f23-2534d63ace40.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/6483/live/cf979fd0-9dd9-11f0-9f23-2534d63ace40.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/6483/live/cf979fd0-9dd9-11f0-9f23-2534d63ace40.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/6483/live/cf979fd0-9dd9-11f0-9f23-2534d63ace40.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/6483/live/cf979fd0-9dd9-11f0-9f23-2534d63ace40.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/6483/live/cf979fd0-9dd9-11f0-9f23-2534d63ace40.jpg.webp\" alt=\"OHSU A largely black and white image showing a round object - it is dark in the middle with a thick band of white at the circumference. There is a bright white dot in the circle at the six o clock position. \" /><span>OHSU</span></p></div><p></p><figcaption>The big circle is the egg viewed under a microscope, the white dot at the bottom is the genetic material taken from a skin cell and placed inside </figcaption><p></p></figure><div><p>However, this egg is not ready to be fertilised by sperm as it already contains a full suite of chromosomes.</p><p>You inherit 23 of these bundles of DNA from each of your parents for a total of 46, which the egg already has.</p><p>So the next stage is to persuade the egg to discard half of its chromosomes in a process the researchers have termed \"mitomeiosis\" (the word is a fusion of mitosis and meiosis, the two ways cells divide). </p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/b030/live/e7b4c510-9de9-11f0-92db-77261a15b9d2.png.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/b030/live/e7b4c510-9de9-11f0-92db-77261a15b9d2.png.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/b030/live/e7b4c510-9de9-11f0-92db-77261a15b9d2.png.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/b030/live/e7b4c510-9de9-11f0-92db-77261a15b9d2.png.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/b030/live/e7b4c510-9de9-11f0-92db-77261a15b9d2.png.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/b030/live/e7b4c510-9de9-11f0-92db-77261a15b9d2.png.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/b030/live/e7b4c510-9de9-11f0-92db-77261a15b9d2.png.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/b030/live/e7b4c510-9de9-11f0-92db-77261a15b9d2.png.webp\" alt=\"Graphic explaining the different stages of fertilisation using skin cells. It shows the nucleus from skin cell being placed inside a donor egg that has had its genetic information removed. Then, underneath, it shows a purple nucleus having half of its 23 pairs of chromosomes removed to mimic a normal egg. Under that, a man's sperm is shown fertilising the egg and adding its chromosomes so that half come from each parent.\" /></p></div><p></p><figcaption>An explanation of how the new technique works</figcaption><p></p></figure><div><p>The study, <a target=\"_blank\" href=\"https://www.nature.com/articles/s41467-025-63454-7\">published in the journal Nature Communications</a>, showed 82 functional eggs were made. These were fertilised with sperm and some progressed onto the early stages of embryos development. None were developed beyond the six-day-stage.</p><p>\"We achieved something that was thought to be impossible,\" said Prof Shoukhrat Mitalipov, the director of the Oregon Health and Science University's centre for embryonic cell and gene therapy.</p><p>The technique is far from polished as the egg randomly chooses which chromosomes to discard. It needs to end up with one of each of the 23 types to prevent disease, but ends up with two of some and none of others. </p><p>There is also a poor success rate (around 9%) and the chromosomes miss an important process where they rearrange their DNA, called crossing over.</p><p>Prof Mitalipov, a world-renowned pioneer in the field, told me: \"We have to perfect it.</p><p>\"Eventually, I think that's where the future will go because there are more and more patients that cannot have children.\"</p></div><figure><div><p><img src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20250919-090805-05e5ba0164-web-2.30.1-2/grey-placeholder.png\" /><img srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/fe5f/live/46ac3e50-9dda-11f0-9f23-2534d63ace40.jpg.webp 240w, https://ichef.bbci.co.uk/news/320/cpsprodpb/fe5f/live/46ac3e50-9dda-11f0-9f23-2534d63ace40.jpg.webp 320w, https://ichef.bbci.co.uk/news/480/cpsprodpb/fe5f/live/46ac3e50-9dda-11f0-9f23-2534d63ace40.jpg.webp 480w, https://ichef.bbci.co.uk/news/640/cpsprodpb/fe5f/live/46ac3e50-9dda-11f0-9f23-2534d63ace40.jpg.webp 640w, https://ichef.bbci.co.uk/news/800/cpsprodpb/fe5f/live/46ac3e50-9dda-11f0-9f23-2534d63ace40.jpg.webp 800w, https://ichef.bbci.co.uk/news/1024/cpsprodpb/fe5f/live/46ac3e50-9dda-11f0-9f23-2534d63ace40.jpg.webp 1024w, https://ichef.bbci.co.uk/news/1536/cpsprodpb/fe5f/live/46ac3e50-9dda-11f0-9f23-2534d63ace40.jpg.webp 1536w\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/fe5f/live/46ac3e50-9dda-11f0-9f23-2534d63ace40.jpg.webp\" alt=\"OHSU/Christine Torres Hicks Man in olive-green scrubs in a laboratory with taps and scientific equipment in the background, smiling at the camera.\" /><span>OHSU/Christine Torres Hicks</span></p></div><p></p><figcaption>Prof Shoukhrat Mitalipov</figcaption><p></p></figure><div><p>This technology is part of a growing field aiming to make sperm and eggs outside of the body, known as in vitro gametogenesis.</p><p>The approach is still at the level of scientific discovery rather than clinical use, but the vision is to help couples who cannot benefit from IVF (in vitro fertilisation) because they don't have the sperm or eggs to use.</p><p>It could help older women who no longer have viable eggs, men who don't produce enough sperm or people whose cancer treatment has left them infertile.</p><p>The field also re-writes the rules of parenthood. The technique described today does not have to use a woman's skin cells - it could also use a man's. </p><p>That opens the door to same-sex couples having children that are genetically related to both partners. For example, in a male same-sex couple, one man's skin could be used to make the egg and a male partner's sperm used to fertilise it.</p><p>\"In addition to offering hope for millions of people with infertility due to lack of eggs or sperm, this method would allow for the possibility of same-sex couples to have a child genetically related to both partners,\" said Prof Paula Amato, from Oregon Health and Science University.</p></div><p></p><h2>Build public trust</h2><p></p><div><p>Roger Sturmey, a professor of reproductive medicine at the University of Hull, said the science was \"important\" and \"impressive\".</p><p>He added: \"At the same time, such research reinforces the importance of continued open dialogue with the public about new advances in reproductive research.</p><p>\"Breakthroughs such as this impress upon us the need for robust governance, to ensure accountability and build public trust.\"</p><p>Prof Richard Anderson, deputy director of MRC Centre for reproductive health at the University of Edinburgh, said the ability to generate new eggs \"would be a major advance\".</p><p>He said: \"There will be very important safety concerns but this study is a step towards helping many women have their own genetic children.\"</p></div></article>"
  }
]