[
  {
    "title": "Paris court blocks auction of earliest-known calculator",
    "url": "https://www.bbc.com/news/articles/c2kpkq90ygno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2c8d/live/6377d6f0-c5eb-11f0-9f1e-75cdd6519717.jpg",
    "tag": "World",
    "date": "2025-11-20T02:03:14.000Z",
    "description": "One of the world's first calculating machines will not go to auction as scheduled in France, after a Paris court provisionally blocked the historic it",
    "body": "One of the world's first calculating machines will not go to auction as scheduled in France, after a Paris court provisionally blocked the historic item from being exported.Auction house Christie's has confirmed it will not proceed with bidding for the machine La Pascaline, developed by the French mathematician Blaise Pascal in 1642.Valuations suggested the machine could fetch €2m to 3m (£1.7m to £2.6m), and Christie's called it the \"most important scientific instrument ever offered at auction\".Scientists and researchers made a legal appeal to grant heritage protections to the historic instrument, arguing it should be classified as a \"national treasure\".Pascal was just 19 years old when he developed the earliest version of a calculator, Christie's said. There are only nine of these machines still in existence.\"It is the first attempt in history to substitute the human mind with a machine,\" the official collection description reads.\"Its invention marks a breakthrough, a 'quantum leap' whose importance and significance take on a very special meaning today.\"La Pascaline was exhibited at Christie's venues in New York and Hong Kong throughout the year. The machine was included in Christie's auction of the library of the late Catalonia collector Léon Parcé, which also featured Pascal's philosophical piece Pensées and the first printed version of \"Pascal's wager\".On Wednesday, a Paris administrative court temporarily blocked an earlier export authorisation provided by France's culture minister in May. Two experts had signed off on the minister's certificate, including one from the Louvre Museum.The judge concluded there were \"serious doubts\" over the legality of the certificate, a statement from the Paris court said, adding the decision was provisional until a final judgment is delivered.In a statement to the AFP news agency, a Christie's spokesperson said: \"Given the provisional nature of this decision and in accordance with the instructions of its client, Christie's is suspending the sale of La Pascaline.\" The court noted La Pascaline's historic and scientific value could qualify it as a \"national treasure\", guaranteeing protections under the France's heritage code.The French heritage group Association Sites & Monuments, which was listed as an applicant in the court filing, welcomed the decision.Additional reporting by Sebastian Usher, Global Affairs reporter",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paris court blocks auction of earliest-known calculator",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2c8d/live/6377d6f0-c5eb-11f0-9f1e-75cdd6519717.jpg"
      ],
      "datePublished": "2025-11-20T02:03:14.000Z",
      "dateModified": "2025-11-20T02:03:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Woman jailed for 20 years over murder of Australian surfer brothers in Mexico",
    "url": "https://www.bbc.com/news/articles/c8jrjr4wrr2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e22e/live/e2e67670-c5f1-11f0-9f1e-75cdd6519717.png",
    "tag": "World",
    "date": "2025-11-20T10:12:36.000Z",
    "description": "A woman has been sentenced to 20 years in prison for her role in the murders of three tourists during a carjacking in Mexico last year.Ari Gisell, 23,",
    "body": "A woman has been sentenced to 20 years in prison for her role in the murders of three tourists during a carjacking in Mexico last year.Ari Gisell, 23, pleaded guilty to instigating the violent assault on Australian brothers Jake and Callum Robinson and their American friend Carter Rhoad, who were on a surfing trip in the northern Mexican state of Baja California in April 2024 when they disappeared.Their bodies were later found with gunshot wounds to the head at the bottom of a deep well.Ari Gisell had expressed interest in the tyres on the surfers' car and told her then-boyfriend Jesús Gerardo to \"bring me a good phone and good tyres for my pickup truck\", the court heard.Only the first and middle names of the defendants were revealed. Surnames were not, in line with Mexican court reporting rules.Jesús Gerardo and two others, Irineo Francisco and Ángel Jesús, tailed the vehicle to the campsite where the foreigners were staying, then robbed them before shooting them dead. The cases against these three men are still before the courts.According to Mexican newspaper La Silla Rota, Jesús Gerardo and Irineo Francisco have ties with the powerful drug cartel Sinaloa, which was for many years led by the notorious drug lord Joaquín \"El Chapo\" Guzmán.Because of these links, both men are being held in El Hongo, a maximum-security prison in Baja California. Ángel Jesús has been detained in a separate facility in the city of Ensenada.Prosecutors do not suspect any connections between the murders and organised crime, however, according to the Australian Broadcasting Corporation (ABC).The victims' families, who appeared via video conference, made emotional statements at the hearing on Wednesday.\"We dreamed of seeing them grow older, of having children. That's all taken now,\" said Callum and Jake's mother Debra Robinson, as reported by ABC. \"We live with their absence.\"Callum Robinson, 33, was a member of Australia's national lacrosse team and was living in San Diego, just across the US-Mexico border from Baja California.His younger brother Jake, 30, lived in Australia and had travelled to North America to visit Callum. He was due to start a new job as a doctor when he returned.Their friend Rhoad, 30, was a San Diego resident and worked in a technology services company. Rhoad was months away from marrying his fiancee when he was killed.\"He was my safety in the world,\" his fiancee Natalie Wiertz told the court. \"My life is now a nightmare.\"Ari Gisell gave a tearful apology in court, acknowledging that \"nothing I can say will compensate you or give you peace\".\"I am focused on being a better person, and I am very sorry for your losses,\" said the single mother, as quoted by La Silla Rota.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Woman jailed for 20 years over murder of Australian surfer brothers in Mexico",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e22e/live/e2e67670-c5f1-11f0-9f1e-75cdd6519717.png"
      ],
      "datePublished": "2025-11-20T10:12:36.000Z",
      "dateModified": "2025-11-20T10:12:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "More than 250 arrested in Charlotte as immigration crackdown escalates",
    "url": "https://www.bbc.com/news/articles/ckgzge16vkdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/05c3/live/74684910-c620-11f0-a9b6-afaae37ee06b.jpg",
    "tag": "World",
    "date": "2025-11-20T15:20:12.000Z",
    "description": "More than 250 people have been arrested in Charlotte, North Carolina, as part of President Donald Trump's escalating crackdown on undocumented immigra",
    "body": "More than 250 people have been arrested in Charlotte, North Carolina, as part of President Donald Trump's escalating crackdown on undocumented immigration, US officials say. Charlotte is the latest US city that Trump has targeted with federal troops, following similar measures in bigger cities like Chicago and Los Angeles earlier this year. Officials with the Department of Homeland Security (DHS) told the BBC that those arrested are criminals and gang members.But local lawmakers and residents have railed against the detainments, which the federal government has dubbed \"Operation Charlotte's Web\". The state's Democratic governor has alleged people are being targeted because of their race. In a statement released on Wednesday, a DHS spokesperson said the operation has led to the arrest of \"some of the most dangerous criminal illegal aliens\", including gang members. Others arrested had been convicted of a range of crimes, including assault on law enforcement, driving while intoxicated, theft and tampering with government documents, the department said earlier.North Carolina's Democratic Governor Josh Stein, who has denounced Trump's operations, accused agents of racially profiling residents. \"We've seen masked, heavily armed agents in paramilitary garb driving unmarked cars, targeting American citizens based on their skin colour, racially profiling and picking up random people in parking lots,\" Stein said on Sunday. \"This is not making us safer.\"The city's mayor, also a Democrat, urged federal agents to operate with \"respect\" for the city's values. She also commended those who came out in droves on Saturday to protest the Trump administration's actions in the city. \"I am deeply concerned with many of the videos I've seen,\" Mayor Vi Lyles said. \"To everyone in Charlotte who is feeling anxious or fearful: you are not alone. Your city stands with you.\" DHS has not said how long the raids will last. Chicago's crackdown started in September and is still ongoing. Like other cities subject to immigration crackdowns, some migrants in Charlotte are staying home for fear of federal agents in the city, according to local media reports.Stein says he's monitoring reports that the operation will come to Raleigh, another North Carolina city, next. \"Once again, I call on federal agents to target violent criminals, not neighbors walking down the street, going to church, or putting up Christmas decorations,\" he wrote.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "More than 250 arrested in Charlotte as immigration crackdown escalates",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/05c3/live/74684910-c620-11f0-a9b6-afaae37ee06b.jpg"
      ],
      "datePublished": "2025-11-20T15:20:12.000Z",
      "dateModified": "2025-11-20T15:20:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gustav Klimt painting becomes second most expensive artwork sold at auction",
    "url": "https://www.bbc.com/news/articles/cm2emm4737zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2512/live/c3b79e00-c533-11f0-9839-6584ec7afe70.jpg",
    "tag": "World",
    "date": "2025-11-19T09:55:50.000Z",
    "description": "A portrait by the Austrian artist Gustav Klimt was sold for $236.4m (£179m) in New York on Tuesday, making it the second-most expensive piece ever sol",
    "body": "A portrait by the Austrian artist Gustav Klimt was sold for $236.4m (£179m) in New York on Tuesday, making it the second-most expensive piece ever sold at auction. Six people took part in a 20-minute bidding battle for the Portrait of Elisabeth Lederer which was painted between 1914 and 1916. Auction house Sotheby's has not disclosed the buyer's identity.The portrait was looted by the Nazis and almost destroyed in a fire in World War Two, but was rescued in 1948. The artwork was returned to Lederer's brother, Erich, a friend and subject of Klimt's contemporary, Egon Schiele. The piece remained in Lederer's possession for most of his life, before he sold it in 1983, according to Sotheby's. The painting shows Lederer, an heiress and the daughter of one of Klimt's patrons, wearing a white robe and standing in front of a blue tapestry covered in Asian motifs. The Nazis, who annexed Austria in 1938, looted the Lederer art collection but left family portraits behind, says the National Gallery of Canada. Estée Lauder heir Leonard A Lauder made it part of his private collection in 1985, where it was displayed in his Fifth Avenue home in New York. Tuesday's sale shot past expectations, with the painting predicted to sell for  $150m before the auction. The second-highest sale for a Klimt on record was Lady with a Fan, which sold for $108.8m in 2023 in London. Several other Klimt works in Lauder's collection were auctioned at the same event, including Flowering Meadow and Forest Slope at Unterach am Attersee, which fetched between $60m and $80m each. The most expensive artwork ever sold at auction was Salvator Mundi, attributed to  Leonardo da Vinci, which sold in 2017 for $450.3m.Tuesday also saw a sculpture of a fully functioning gold toilet by the conceptual artist Maurizio Cattelan picking up $12.1m just an hour after the record-breaking Klimt sale.The 101-kg toilet received just one bid. Sotheby's said that the buyer was a famous American brand.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gustav Klimt painting becomes second most expensive artwork sold at auction",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2512/live/c3b79e00-c533-11f0-9839-6584ec7afe70.jpg"
      ],
      "datePublished": "2025-11-19T09:55:50.000Z",
      "dateModified": "2025-11-19T09:55:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ethiopia receives 12 historic artefacts held in Germany for 100 years",
    "url": "https://www.bbc.com/news/articles/c07m7pl3njmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7a39/live/dd21c420-c5dc-11f0-bca0-d197f0674a9d.jpg",
    "tag": "World",
    "date": "2025-11-20T08:01:58.000Z",
    "description": "8 hours agoWycliffe MuiaEthiopia's Ministry of TourismThe collection includes crowns, shields and paintings all considered culturally and historically",
    "body": "8 hours agoWycliffe MuiaEthiopia's Ministry of TourismThe collection includes crowns, shields and paintings all considered culturally and historically significantTwelve historical artefacts have been formally returned to Ethiopia after being kept by a German family for more than 100 years. The artefacts, originally collected in the 1920s by Germany's then-envoy to Ethiopia Franz Weiss and his wife Hedwig, were handed over on Wednesday to the Institute of Ethiopian Studies at Addis Ababa University.The collection included crowns, shields and paintings, all considered culturally and historically significant in Ethiopia. \"The artefacts still stand as a symbol of the long-standing and friendly relationship between Germany and Ethiopia,\" said Ferdinand von Weyhe, Germany's envoy to Ethiopia. Professor Ramon Wyss, whose father was born during the family's diplomatic posting in Ethiopia, handed over the items at a ceremony attended by Tourism Minister Selamawit Kassa.He said the family's intention to return the artefacts was to \"share their beauty with the public and preserve the culture and history connected to my father's birth\". Ethiopia's Tourism MinistryThe pieces are set to be opened to the public for research and academic studyThe items were either gifts or purchases, according to the family. \"I would like to thank Professor Weiss's family for practically expressing their profound love for Ethiopia by meticulously preserving these artifacts and crucially ensuring their return to their rightful homeland,\" said the tourism minister.She added that the pieces would soon be opened to the public for research and academic study, terming the move a milestone in safeguarding Ethiopia's cultural heritage.\"Efforts will continue to bring back ancient artifacts that are found in the hands of individuals and institutions all over the world,\" she said. During colonial rule in Africa, thousands of cultural artefacts were plundered. The call by African countries for the return of looted items has been met with some success in recent years - though some items are only on loan.In 2022, Germany was the first country to return some of the famous Benin Bronzes to Nigeria in a bid to deal with its \"dark colonial history\".You may also be interested in: Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ethiopia receives 12 historic artefacts held in Germany for 100 years",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7a39/live/dd21c420-c5dc-11f0-bca0-d197f0674a9d.jpg"
      ],
      "datePublished": "2025-11-20T08:01:58.000Z",
      "dateModified": "2025-11-20T08:01:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Instagram and Facebook-owner Meta notifies Australian teens of accounts shutdown",
    "url": "https://www.bbc.com/news/articles/cz919xyx7weo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/df66/live/e58d6e40-c567-11f0-ac47-e3b40c46275e.jpg",
    "tag": "World",
    "date": "2025-11-19T17:31:45.000Z",
    "description": "23 hours agoDearbail Jordan and Simon AtkinsonYounger Australian teenagers on Instagram, Facebook and Threads are being told their accounts will be sh",
    "body": "23 hours agoDearbail Jordan and Simon AtkinsonYounger Australian teenagers on Instagram, Facebook and Threads are being told their accounts will be shut down ahead of the country's social media ban for under-16s.Meta, which owns the three brands, said it had begun notifying users it believes to be between 13 and 15 years old by text, email and in-app messages that their accounts would start being deactivated from 4 December.The ban in Australia comes into force on 10 December. It affects a number of platforms which also include TikTok, YouTube, X and Reddit.Prime Minister Anthony Albanese said the \"world-leading\" ban was aimed at \"letting kids be kids\". Meta and other firms oppose the measure but said they would comply. Australia's internet regulator has estimated there are 150,000 Facebook users and 350,000 teens on Instagram in the 13-15 age bracket.From 4 December, children aged below 16 will not be able to create accounts on Meta's social media platforms. The company said it was asking young users to update their contact details so they could be notified when they became eligible to open an account. They can download and save their posts, videos and messages before their accounts are shut down.Meta said that teens who said they were old enough to use Instagram, Facebook and Threads could challenge the restriction by taking a \"video selfie\" to be used in facial age scans.They could also provide a driver's licence or other government issued-ID.All these verification methods were tested by the UK-based Age Check Certification Scheme (ACCS) earlier this year, in a report commissioned by the Australian state.While the ACCS said that all methods had their merits, it added: \"We did not find a single ubiquitous solution that would suit all use cases, nor did we find solutions that were guaranteed to be effective in all deployments.\"Social media platforms which fail to take \"reasonable steps\" to block under-16s face fines of up to A$50m (£25m). \"While we are working hard to remove all users who we understand to be under the age of 16 by 10 December, compliance with the law will be an ongoing and multi-layered process,\" Antigone Davis, vice-president and global head of safety at Meta, told Reuters Financial.Meta wants to see a law where under-16s have to get parental approval before they download a social media app. The firm told Australia's Seven News: \"Teens are resourceful, and may attempt to circumvent age assurance measures to access restricted services.\"But it said: \"We're committed to meeting our compliance obligations and are taking the necessary steps to comply with the law.\"Australia's e-Safety Commissioner, Julie Inman Grant, said the ban was aimed at protecting teens \"from pressures and risks they can be exposed to while logged in to social media accounts\".In a move seemingly to avoid being included in the ban, gaming platform Roblox this week announced that children under 16 would be unable to chat to adult strangers.Mandatory age checks will be introduced for accounts using chat features, starting in December for Australia, New Zealand and the Netherlands, then the rest of the globe from January.The e-safety commissioner has published a list of which social media platforms will be impacted by the age ban.They are: FacebookInstagramKickRedditSnapchatThreadsTikTokX (formerly Twitter)YouTubePlatforms not included are:DiscordGitHubGoogle ClassroomLEGO PlayMessengerRobloxSteam and Steam ChatWhatsAppYouTube Kids",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Instagram and Facebook-owner Meta notifies Australian teens of accounts shutdown",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/df66/live/e58d6e40-c567-11f0-ac47-e3b40c46275e.jpg"
      ],
      "datePublished": "2025-11-19T17:31:45.000Z",
      "dateModified": "2025-11-19T17:31:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nord Stream: Italy to extradite pipeline blast suspect to Germany",
    "url": "https://www.bbc.com/news/articles/c4gwgd0rjdzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0b67/live/e280c680-c593-11f0-b336-71a88b56470b.png",
    "tag": "World",
    "date": "2025-11-19T22:42:05.000Z",
    "description": "17 hours agoSarah RainsfordSouthern and Eastern Europe correspondent, RomeDanish Defence HandoutThe Nord Stream pipeline, which runs between Russia an",
    "body": "17 hours agoSarah RainsfordSouthern and Eastern Europe correspondent, RomeDanish Defence HandoutThe Nord Stream pipeline, which runs between Russia and Germany under the Baltic Sea, was attacked in 2022 Italy's top appeals court has ruled that a Ukrainian man suspected of involvement in blowing up the Nord Stream gas pipelines between Russia and Germany should be extradited to Berlin.There, former Ukrainian military officer Serhiy Kuznetsov will face a charge of anti-constitutional sabotage. He is due to be removed from Italy under German police escort in the next few days.Prosecutors believe Mr Kuznetsov coordinated and led a group that planted explosives on the pipes deep beneath the Baltic Sea in 2022, though they have not disclosed any evidence.The case has serious implications for relations between Ukraine and Germany, which is the biggest source of military aid for Kyiv in Europe.Mr Kuznetsov's lawyer said his client \"feels like a scapegoat\" and is \"very sad\" that his government has not spoken out in his defence, or even confirmed that he was a serving soldier at the time of the blasts.\"If he carried out the attack, then he did so because he was ordered to do so because he was for sure a captain of the Ukrainian army,\" Nicola Canestrini said after Wednesday's hearing.The BBC has seen a copy of Mr Kuznetsov's military ID among the court papers. He has not commented publicly on whether he was involved in the explosions.\"The Ukrainian government knows exactly where he was every day of September 2022,\" his lawyer said. \"So, if he's innocent, why don't they say it? If he did it, why don't they say it? That's his question.\"The BBC has approached government and security sources in Kyiv, but they have not commented.Mr Kuznetsov was arrested in northern Italy in late August, at a glamping site near the city of Rimini where he had booked in for a few nights with his wife and two of their children.His passport details were entered online at check-in, and in Italy that information is automatically transferred to the carabinieri, the local police.Later that night, officers came knocking at the family's door.Serhiy Kuznetsov's lawyer Nicola Canestrini says his client feels like a \"scapegoat\"A month later, a second Ukrainian suspect was detained at his home close to Poland's capital Warsaw on another arrest warrant issued by Germany.Volodymyr Zhuravlyov, an amateur deep-sea diver, has lived in Poland with his family since just before Russia's full-scale invasion of Ukraine in 2022.He was held in custody for 17 days, but a court then refused to extradite him.The judge delivered a passionate speech, arguing that no Ukrainian could be prosecuted for what he characterised as a legitimate act of self-defence against Russia's \"bloody and genocidal\" invasion of Ukraine.In Italy, further from Ukraine, the mood and the politics are very different.Mr Canestrini described the Italian appeal court's ruling as a \"great disappointment\", but said the fight for his client would now move to Germany - with the aim of having Mr Kuznetsov acquitted on the same grounds.Many Ukrainians consider whoever did destroy Nord Stream to be heroes for taking out an important revenue source for Russia, and struggle to understand why Germany - a key ally of Ukraine - is pursuing this prosecution.On Wednesday, one man stood outside the palatial courthouse in Rome wrapped in a Ukrainian flag and holding a poster that read: \"Serhiy Kuznetsov is a defender, not a criminal.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nord Stream: Italy to extradite pipeline blast suspect to Germany",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0b67/live/e280c680-c593-11f0-b336-71a88b56470b.png"
      ],
      "datePublished": "2025-11-19T22:42:05.000Z",
      "dateModified": "2025-11-19T22:42:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Albanian PM accuses Mahmood of 'ethnic stereotyping'",
    "url": "https://www.bbc.com/news/articles/cge5e1xpgzyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bf7d/live/84b04210-c598-11f0-a807-c90a622aa179.jpg",
    "tag": "World",
    "date": "2025-11-19T23:14:25.000Z",
    "description": "17 hours agoSam FrancisPolitical reporterEPAAlbania's prime minister accused Home Secretary Shabana Mahmood of \"ethnic stereotyping\" after she singled",
    "body": "17 hours agoSam FrancisPolitical reporterEPAAlbania's prime minister accused Home Secretary Shabana Mahmood of \"ethnic stereotyping\" after she singled out Albanian families in a speech about abuses of the asylum system.Edi Rama criticised Mahmood for telling MPs around 700 Albanian families were \"living in taxpayer-funded accommodation having failed their asylum claims\" as she announced major reforms on Monday.Rama called the number a \"statistical drop in the ocean of post-Brexit Britain's challenges\".Official data show the UK has deported more than 13,000 people to Albania since a returns deal was signed in 2022. Rama called the deal one of \"Europe's most successful partnerships on illegal migration.\"Mahmood's comments came as she announced major changes to the UK's \"out of control and unfair\" asylum system.Speaking in the House of Commons, Mahmood said: \"If we fail to deal with this crisis, we will draw more people down a path that starts with anger and ends in hatred.\"The reforms will make refugee status temporary, extend the wait for permanent settlement from five years to 20, and allow the removal of families with children who have no right to remain. Alongside tightening access to refugee status, the UK would create new legal routes to the UK, with an annual cap on numbers.As part of her speech, Mahmood told MPs \"we must remove those who have failed asylum claims, regardless of who they are\".\"There are, for instance, around 700 Albanian families living in taxpayer-funded accommodation having failed their asylum claims - despite an existing returns agreement, and Albania being a signatory to the European convention on human rights,\" she added.Posting on social media, Rama said: \"How can a Labour Home Secretary so poorly echo the rhetoric of the populist far-right – and single out 700 Albanian families, a statistical drop in the ocean of post-Brexit Britain's challenges – precisely at a moment when the UK and Albania have built one of Europe's most successful partnerships on illegal migration?\"\"Let us also be clear: Albanians are net contributors to the British economy, and the number of Albanians receiving UK benefits is very low relative to other communities. \"To single them out again and again is not policy - it is a troubling and indecent exercise in demagoguery.\"Official policy should never be driven by ethnic stereotyping. That is the very least humanity expects from the great Great Britain.\"Rama has repeatedly clashed with British politicians over their descriptions of Albanian nationals. In May, Sir Keir Starmer travelled to the Albanian capital Tirana only to be told by Rama he would not host UK \"return hubs\" for failed asylum seekers from other countries.During the same press conference, Rama accused the previous Conservative government of \"stigmatising\" Albanians and warning that \"cursing the Albanians was not a good idea, because the curse went back and they are now out of the parliament\".A combative figure on social media, Rama has also previously invited Reform UK leader Nigel Farage to come to Albania to debate his claim one in 50 Albanians in Britain were in prison. Rama dismissed the figure as \"bonkers\" and accused Farage of peddling \"post-truth Brexit playbook\" politics. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Albanian PM accuses Mahmood of 'ethnic stereotyping'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bf7d/live/84b04210-c598-11f0-a807-c90a622aa179.jpg"
      ],
      "datePublished": "2025-11-19T23:14:25.000Z",
      "dateModified": "2025-11-19T23:14:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US military officials in Kyiv as Europe warns against reported Russia peace plan",
    "url": "https://www.bbc.com/news/articles/cvgdgrqwnq9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d658/live/eea590e0-c5f6-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-20T11:55:36.000Z",
    "description": "4 hours agoJaroslav Lukiv, Laura Gozzi and Paul Kirby,Europe digital editorSenior Pentagon officials have arrived in Ukraine to \"discuss efforts to en",
    "body": "4 hours agoJaroslav Lukiv, Laura Gozzi and Paul Kirby,Europe digital editorSenior Pentagon officials have arrived in Ukraine to \"discuss efforts to end the war\" with Russia, the US military has said.The team, led by US Army Secretary Dan Driscoll, held talks with Ukrainian Prime Minister Yulia Svyrydenko on Thursday morning. They are expected to meet Ukrainian President Volodymyr Zelensky later in the day.Reports began surfacing on Wednesday that the US and Russia had prepared a new proposed framework to end the war, requiring major concessions from Ukraine including giving up territory and dramatically shrinking its military.It was reportedly drafted by President Donald Trump's envoy Steve Witkoff and Russian special envoy Kirill Dmitriev.Neither Washington nor Moscow have officially confirmed the plan. However, US Secretary of State Marco Rubio wrote on X that achieving a \"durable peace will require both sides to agree to difficult but necessary concessions\". He said the US was consulting both sides of the conflict to \"develop a list of potential ideas for ending this war\".Driscoll's team is the most senior military group to travel to Kyiv since Trump took office in January. He is joined by Army chief of staff Gen Randy George, top US army commander in Europe Gen Chris Donahue, and sergeant major of the army Michael Weimer. Details of the draft Witkoff-Dmitriev 28-point plan emerged more than three weeks after the two men are said to have spent three days in meetings in Miami, Florida.Citing people familiar with the matter, Axios, the Financial Times and Reuters reported that the plans call for Kyiv to give up areas of the Donbas in eastern Ukraine that it still controls, to cut significantly the size of its armed forces, and to forego many of its weapons.Zelensky has repeatedly ruled out any territorial concessions to Russia.Kirill Dmitriev's team declined to comment on the reports. The BBC has also asked the White House and a representative for Witkoff to comment. Kremlin spokesman Dmitry Peskov said on Thursday that \"contacts\" had taken place with the US, but no \"consultations or negotiations\" were happening. Neither European nor Ukrainian officials are believed to have been involved in drafting the new proposal, sparking fears it could be overwhelmingly favourable to Russia. EU foreign policy chief Kaja Kallas warned on Thursday that for any plan to work, it would need to have Ukrainians and Europeans on board, and French Foreign Minister Jean-Noël Barrot said \"the Ukrainians do not want any form of capitulation\".After meeting US officials, Ukraine's prime minister did not address the rumoured plan - but said their visit provided \"an opportunity for representatives of the American administration to assess the situation on the ground and see the consequences of Russian aggression\".Reports of the plan emerged on Wednesday, the same day Ukrainian officials said at least 26 people had been killed in a Russian missile and drone attack on blocks of flats in Ukraine's western city of Ternopil. Another 22 people were missing at the site, Zelensky said on Thursday. Zelensky was in Turkey at the time of the Ternopil attack, and unconfirmed Ukrainian reports suggested that talks had been planned with Trump's envoy in Ankara, but were called off.There was no mention of the proposed framework when the US army secretary arrived in Kyiv late on Wednesday. Army spokesman Col David Butler said only that Driscoll and his team were there \"on behalf of the [Trump] administration on a fact-finding mission to meet Ukrainian officials and discuss efforts to end the war\".A Ukrainian official told CBS, the BBC's US media partner, that talks on the trip would focus on the military situation on the ground - as well as plans for a possible ceasefire. The unnamed official said: \"Presidents Zelensky and Trump have already agreed to stop the conflict along the existing lines of engagement, and there are agreements on granting security guarantees\".Firefighters seen holding moment of silence in Ternopil after deadly Russian strikeAfter talks with the US army secretary on Wednesday, Ukrainian Defence Minister Denys Shmyhal posted on X: \"We focused on the next steps for implementing the historic defence agreements reached by President Zelensky and President Trump.\"Kyiv and its Western allies, including the US, have been calling for an immediate ceasefire along the vast front line, but Moscow has ruled that out, repeating demands that Ukraine says amount to its de facto capitulation.Earlier this month, Russian Foreign Minister Sergei Lavrov said Moscow's pre-conditions for a peace deal - including ceding territory, tough curbs on the size of Ukraine's military and the country's neutrality - had not changed since Putin laid them out in 2024.Meanwhile, a White House official confirmed to the BBC that special envoy to Ukraine Keith Kellogg would leave his post in January.He reportedly decided that this would be a natural end to his time in the post, which requires Senate approval beyond 360 days.Kellogg has been seen as an important advocate for Ukraine in the White House during a time when Trump has often appeared to side with Russia in the conflict. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US military officials in Kyiv as Europe warns against reported Russia peace plan",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d658/live/eea590e0-c5f6-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-20T11:55:36.000Z",
      "dateModified": "2025-11-20T11:55:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "KPop Demon Hunters star on how her life mirrored main character Rumi's journey",
    "url": "https://www.bbc.com/news/articles/c17pj0gr75lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5b5a/live/171a1920-c466-11f0-8669-5560f5c90fbe.jpg",
    "tag": "World",
    "date": "2025-11-18T00:32:33.000Z",
    "description": "'I hated that I looked Asian': KPop Demon Hunters star on her struggle for acceptance3 days agoChi Chi Izundu & Rebecca ThornBBC Global WomenBBCArden ",
    "body": "'I hated that I looked Asian': KPop Demon Hunters star on her struggle for acceptance3 days agoChi Chi Izundu & Rebecca ThornBBC Global WomenBBCArden Cho stars as the voice of Rumi in KPop Demon Hunters, which topped Netflix charts in 93 countries\"I hated that I looked Asian, that I didn't have blue eyes and blonde hair, because that's what was beautiful at the time,\" says Arden Cho, the actress who voiced Rumi, star of Netflix's chart-topping animated film, KPop Demon Hunters.Speaking to the BBC World Service for the Global Women series, Cho, 40, is describing her childhood in Texas, as the eldest daughter of Korean immigrant parents and her struggle for acceptance in American society.In the film, which tells the story of a female K-Pop trio who must save the world from evil forces, Rumi has to come to terms with her identity as part human, part demon - and when Cho first read the script this resonated powerfully.\"Being born in America, feeling American but having people treat me like I'm not, trying to figure out my identity as an Asian-American, as a Korean-American, as a woman,\" she says.These were all elements of her early life that mirrored Rumi's journey.\"I can honestly say that at different points in my life, I hated a lot of myself and I wanted to be someone else.\"As kids, what you see shapes who you become and I feel like I just didn't see enough people that look like me.\"NetflixCho says the film has led to \"Korea being loved\" more than ever beforeWhen it launched on Netflix in June, KPop Demon Hunters registered 33 million views in just two weeks, and reached the top 10 of the Netflix charts in 93 countries. To star in the first Hollywood animated film set in Korea, with Korean leads, was for Cho \"a dream come true\" – but it has also made her a powerful role model for Asian-American children, of the kind that she lacked when she was young.Cho says many Korean-Americans have told her it's \"such a refreshing moment\", making them proud for the first time of their dual heritage and culture.\"I feel like K-Pop really, truly, has paved the way. K-beauty has had such a big impact on Korea being loved. But I feel like this movie is the one that tipped it over the edge of, everybody wants to go to Korea, now,\" Cho says.But the film's success was not guaranteed and Cho says she felt the team making it were \"sometimes facing an uphill battle\".\"I feel like it kind of sucks to say this, but any time there's an Asian-led project, people feel like it's a risk,\" she says.So, when she took on the role, she made an effort to meet everyone working on the film in person, she says.Getty ImagesJi-Young Yoo (left) and May Hong (right) are also voice actors in the filmThe film was released against the backdrop of increased immigration raids in the US as part of the Trump administration's mass deportation effort, targeting those who are in the country illegally, which sparked protests in many states.As an Asian-American living in the US \"it's heartbreaking and disappointing,\" says Cho. \"Immigrants have made America what it is.\"Korean news sources have estimated that up to 150,000 Korean immigrants without proper documentation, including adopted children, are among those who could be deported.Cho says that when she was younger, people didn't know what it meant to be Korean in the USAs an adult, Cho came to realise that the racism she had experienced when she was younger stemmed mainly from a lack of education, as people didn't know what it meant to be Korean or Asian.\"But now in this day and age, when I feel like the world and people should know better, it is beyond disappointing and sometimes I feel like we feel so hopeless,\" she says.Because of this, it feels very special, she says, that KPop Demon Hunters could bring \"hope and joy and love to all these different communities\".\"Maybe that's why it's sort of like this movie of the summer, because we just needed some hope and something to unite us all together.\"The growth of AI is a major concern for the film industry, raising the possibility that in future it could be used to make a film like KPop Demon Hunters.Cho says she is aware that AI is already being used to replicate actors' voices, but wants to \"have hope in humanity\" that people will still seek out art created by humans.\"Sure, I'm sure they're going to have AI actors and singers. I know they already exist. I know our voices are already being manipulated, but I hope people have some respect and want and love for something real.\"KPop Demon Hunters has also been dominating the global music charts, with seven tracks from its soundtrack featured on the Billboard Hot 100. It has its own fan art, and audiences around the world are demanding a sequel.Cho tells us she wishes she could answer the question of whether that will happen - but both she and fans will have to wait for Netflix or Sony Pictures Entertainment, which made the film, to give it the green light.\"I know there's lots of murmurs, I've heard wonderful things,\" she says. \"So we shall see, and I think everyone in the world would riot if there wasn't.\"Starting conversations, building connections and challenging misinformation through features, investigations, interviews and extraordinary stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "KPop Demon Hunters star on how her life mirrored main character Rumi's journey",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5b5a/live/171a1920-c466-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-18T00:32:33.000Z",
      "dateModified": "2025-11-18T00:32:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nnamdi Kanu: Nigerian separatist leader sentenced to life for terrorism",
    "url": "https://www.bbc.com/news/articles/cj3z38e6v45o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dada/live/ceb82150-c612-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "World",
    "date": "2025-11-20T15:36:45.000Z",
    "description": "A court in Nigeria has found separatist leader Nnamdi Kanu guilty of terrorism and other charges following a decade-long legal case full of drama.He h",
    "body": "A court in Nigeria has found separatist leader Nnamdi Kanu guilty of terrorism and other charges following a decade-long legal case full of drama.He has been given four life sentences, along with other terms, to be served concurrently. The prosecution had called for the death penalty but Judge James Omotosho said that executions were now \"frowned upon\".In his ruling he said he was satisfied that Kanu had made a series of broadcasts to incite violence and killings, as part of his campaign for a separate state in south-east Nigeria, known as Biafra.Kanu was convicted on all seven charges he faced. As well as terrorism, they included treason and involvement with an outlawed movement.Kanu always denied the charges and challenged the court's jurisdiction. At the start of the trial he sacked his lawyers but refused to defend himself.He was not in court when the verdict was delivered, after being removed for unruly behaviour.Security around the courthouse in the capital, Abuja, was tightened ahead of the verdict in case of protests by Kanu's supporters.Once a relatively obscure figure, he came to national prominence in 2009 when he started Radio Biafra, a station that called for an independent state for the Igbo people, broadcast to Nigeria from London.Though he grew up in south-eastern Nigeria, where he attended the University of Nsukka, Kanu moved to the UK before graduating, and acquired British nationality.In 2014, he set up the Indigenous People Of Biafra (Ipob), a movement demanding independence.Ipob was banned as a terrorist organisation in 2017. Its armed wing - the Eastern Security Network - has been accused of killings and other acts of violence in recent years.Delivering his judgement, Justice Omotosho said: \"Mr Kanu knew what he was doing, he was bent on carrying out these threats without consideration to his own people.\"From the incontroverted evidence, it is clear that the defendant carried out preparatory act of terrorism.\"He had the duty to explain himself but failed to do so.\"Kanu is a popular figure in his movement's heartland in south-eastern Nigeria, but reaction to the verdict there has so far been muted.In court ahead of the ruling, Kanu insisted that proceedings could not continue because he had not yet filed his final written address, accusing the judge of bias and not understanding the law.The judgement was delivered after Kanu had been forcibly removed from the courtroom for unruly behaviour.He was first arrested in October 2015 but he jumped bail in 2017 and left the country after a military raid on his home. The court later revoked his bail in March 2019.Two years later, the government announced that he had been re-arrested. His lawyers say he was detained in Kenya and forcibly returned to Nigeria. Kenya has not commented.In 2022, an appeal court ordered that the charges against him be dropped, saying he had been illegally arrested abroad, but this ruling was overturned by the Supreme Court the following year.The calls for Biafran independence date back many years. In 1967 Igbo leaders declared a Biafran state, but after a brutal civil war, which led to the deaths of up to a million people, the secessionist rebellion was defeated.Many Igbo people continue to feel that they are marginalised by the Nigerian state however, it is not clear how many are in favour of independence.Additional reporting from BBC Igbo's Ebere Ekeopara in Enugu",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nnamdi Kanu: Nigerian separatist leader sentenced to life for terrorism",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dada/live/ceb82150-c612-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-20T15:36:45.000Z",
      "dateModified": "2025-11-20T15:36:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pinkfong: How the viral Baby Shark video created a $400m business",
    "url": "https://www.bbc.com/news/articles/cn8xzgw623go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/54e6/live/dd0cdb40-c4d9-11f0-a82a-7dfcc8b18fe0.jpg",
    "tag": "World",
    "date": "2025-11-18T23:00:46.000Z",
    "description": "Baby Shark: How a 90-second clip created a $400m business2 days agoOsmond ChiaBusiness reporterGetty ImagesWhen Kim Min-seok gave the go-ahead in June",
    "body": "Baby Shark: How a 90-second clip created a $400m business2 days agoOsmond ChiaBusiness reporterGetty ImagesWhen Kim Min-seok gave the go-ahead in June 2016 to publish a 90-second clip of a children's song, he had no idea what he was unleashing.It became a global phenomenon, clocking up more than 16 billion views - YouTube's most watched video ever.That song was the incredibly catchy Baby Shark.Not only has it captivated toddlers and terrorised adults around the world, it laid the foundations for its creator Pinkfong to become a media business worth hundreds of millions of dollars.“We didn’t expect it to stand out from our other content,\" Mr Kim, Pinkfong's chief executive, told the BBC from the firm's headquarters in Seoul.\"But looking back, it became a major turning point that set the stage for our global journey.”Getty ImagesPinkfong chief executive Kim Min-seok at the firm's stock market listing ceremonyOn Tuesday, that journey took Pinkfong to the South Korean stock market, where its shares rose by more than 9% on their debut, giving it a valuation of more than $400m (£304m).'We didn't expect a salary' Founded in 2010 as SmartStudy, the firm made digital content for children up to 12 years of age. It had just three employees, including Mr Kim and the firm's chief technology officer, Dongwoo Son.\"The office was tiny - even smaller than this,\" recalled Mr Kim, gesturing to the conference room he was calling from.It was so small \"we didn't even expect a salary at the time\", he said through a translator.Getty ImagesThe firm was renamed Pinkfong after its cheerful and curious fox character in 2022Pinkfong went through several major overhauls, including shifting its focus to toddlers.The firm grew to around 100 employees and prioritised simpler, learning-based games and content. \"And that's when Baby Shark emerged,\" Mr Kim said.The firm has been known as The Pinkfong Company since 2022, a name inspired by a cheerful and curious fox that featured in one of its early cartoons.It now has around 340 employees, with offices in Tokyo, Shanghai and Los Angeles.The Baby Shark momentBaby Shark is believed to have originated in the US in the 1970s and was often sung at children's summer camps.The song, which repeats the phrase \"Baby shark, doo, doo, doo, doo, doo, doo\" is \"attractive for children, though possibly annoying for adults,\" said media analyst Kevin Chew from the Nanyang Technological University. Mr Kim is also very aware of just how catchy it is.\"It's like a K-pop song. It's very fast-paced, rhythmical and it's addictive,\" he said, adding that the tune has a \"chanting\" effect, which makes it easy for children to remember.But it was not an instant hit and only gained traction when its dance routine was featured at children's events in South East Asia.Videos of children and adults dancing to the song started to spread online and the clip went viral.There was a \"festival-like feeling\" in the Pinkfong office, as the team watched its viewing numbers soar, Mr Kim said.In November 2020, the Baby Shark clip claimed the title of YouTube's most viewed.It generated around half of the firm's revenue in the years immediately after the video's release and became a springboard for new content and merchandise, he said.Baby Shark: It's got a catchy tune and plans for world domination - but the toddler hit is older than you thinkBut Pinkfong faced a legal challenge in 2019 when it was accused of plagiarising the work of an American composer.South Korea's Supreme Court rejected the case, after the company argued that its version was derived from a folk song in the public domain.The victory, Mr Kim said, gave the firm a lift as its shares went public. He added that the stock market application had been filed before the verdict was announced.One-hit wonder?Pinkfong's other franchises like Bebefinn and Sealook are growing fast but the firm must prove its success is not just reliant on Baby Shark, said Korea University business lecturer Min Jung Kim.The company's target audience is a major plus as toddlers tend to watch the same material repeatedly, she said. Kim Min-seok insists his business can grow beyond Baby Shark, which currently accounts for about a quarter of Pinkfong's revenue. Meanwhile, Bebefinn has leapt ahead, generating roughly 40% of the firm's earnings.One parent told the BBC that his family has mixed feelings about Pinkfong's videos.Father of two Saleem Nashef said he appreciates the educational qualities of the firm's content but his wife thinks Baby Shark is \"too over-stimulating for kids\". Still, the viral video is apparently inescapable, as his daughter, who is about to turn three, will have a Baby Shark-themed birthday party.Whether Pinkfong can create other characters to match Baby Shark's commercial appeal remains unclear, said Prof Kim.It raised almost $52m in its stock market debut and plans to use the money to expand its line-up of films and characters, said Mr Kim.The company also aims to become a \"tech-driven\" content creator, using viewing patterns and other data to shape its new projects.Pinkfong has already achieved \"what many creators have always dreamed of,\" Mr Kim said.But now it must show investors that it is not just a one-hit wonder.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pinkfong: How the viral Baby Shark video created a $400m business",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/54e6/live/dd0cdb40-c4d9-11f0-a82a-7dfcc8b18fe0.jpg"
      ],
      "datePublished": "2025-11-18T23:00:46.000Z",
      "dateModified": "2025-11-18T23:00:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump signs bill ordering release of Jeffrey Epstein files",
    "url": "https://www.bbc.com/news/articles/cly2y40lj5go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5ff1/live/d9a13d30-c60e-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "World",
    "date": "2025-11-20T12:20:13.000Z",
    "description": "Trump signs bill ordering US justice department to release Epstein files4 hours agoSakshi Venkatraman and David Willis,North America correspondentWatc",
    "body": "Trump signs bill ordering US justice department to release Epstein files4 hours agoSakshi Venkatraman and David Willis,North America correspondentWatch: \"I'm all for it\", Trump says on calls to release Epstein filesUS President Donald Trump says he has approved a bill that orders the release of government files on the late convicted sex offender Jeffrey Epstein - a significant turning point in a months-long fight over the documents.The justice department now has 30 days to publicly share all information from federal investigations into Epstein. However, it can withhold files that relate to active criminal investigations or are deemed to invade personal privacy.In a major reversal, Trump dropped his opposition to the measure last weekend,  after pushback from Epstein's victims and members of his own Republican Party.With his support, the resolution overwhelmingly cleared both chambers of Congress.Until recently, Trump had dismissed the need to release the documents, calling it a Democrat-led \"hoax\" to \"deflect\" attention away from his party's work. That position was itself a change from the stance he took ahead of the 2024 election.\"Perhaps the truth about these Democrats, and their associations with Jeffrey Epstein, will soon be revealed, because I HAVE JUST SIGNED THE BILL TO RELEASE THE EPSTEIN FILES!\" he wrote.Although a congressional vote was not required to release the files - Trump could have ordered the release on his own - lawmakers in the House passed the legislation with a 427-1 vote. The Senate gave unanimous consent to pass it upon its arrival, sending the bill to Trump for his signature. The lone vote against the resolution in the House, the lower chamber, was cast by Louisiana Republican Clay Higgins, who objected to the scope of information that could be released. He said it could reveal and threaten \"thousands of innocent people\" who may have talked to investigators about allegations against Epstein.Under the law now signed by Trump, Attorney General Pam Bondi must release the documents within 30 days.The files subject to release are from criminal investigations into Epstein, including transcripts of interviews with victims and witnesses, and items seized in raids of his properties. Those materials include internal justice department communications, flight logs, and people and entities connected to the late financier.But there are exceptions.The resolution allows the justice department to withhold any documents related to criminal investigations. After the estate documents were released last week, Trump said he would ask Bondi to investigate Epstein's ties to people who had apparently communicated with him. Bondi promptly said the justice department \"will pursue this with urgency and integrity\".One of the bill's architects, Republican Congressman Thomas Massie, said he had worries that the move would lead to some federal files being withheld.\"I'm concerned that [Trump is] opening a flurry of investigations, and I believe they may be trying to use those investigations as a predicate for not releasing the files. That's my concern,\" he said.Bondi can also withhold information that may identify victims, leading many to speculate that parts of the files will be redacted - although it remains unclear how heavy the redacting could be.White House: Epstein story 'a manufactured hoax'Trump had promised during his 2024 presidential campaign to make the files public, and early in the year his administration released thousands of pages of documents from the Epstein investigation, mostly flight logs. While Trump said more documents were coming, Bondi later announced in July there would be no further releases.That prompted lawmakers from both parties to introduce the resolution compelling the files' release. One of the resolution's key proponents was Republican Representative Marjorie Taylor Greene, one of Trump's fiercest political allies. She has publicly fought with Trump in recent weeks, as the US president maintained his opposition to the resolution up to a few days before the vote.After the resolution passed, Greene posted to say that she would read the name of any powerful person implicated in any released files aloud on the House floor.The anticipated files are different to the more than 20,000 pages of documents from Epstein's estate released by Congress last week, including some that mention Trump.Those include 2018 messages from Epstein in which he said of Trump: \"I am the one able to take him down\" and \"I know how dirty donald is\".Trump was a friend of Epstein's for years, but the president has said they fell out in the early 2000s, years before Epstein was first arrested. Trump has consistently denied any wrongdoing in relation to Epstein.Speaking to reporters on Monday night, Trump said Republicans had \"nothing to do with Epstein\".\"It's really a Democrat problem,\" he said. \"The Democrats were Epstein's friends, all of them.\"The family of Virginia Giuffre, who died by suicide earlier this year, said in a statement Trump signing the bill was \"nothing short of monumental\", for Giuffre and other survivors. \"As we look towards the next chapter, we remain vigilant. This work is not finished. Every name must be revealed, regardless of power, wealth, or party affiliation,\" her brother and sister-in-law, Sky and Amanda Roberts, said.Epstein was found dead in 2019 in his New York prison cell in what a coroner ruled was a suicide. He was being held on charges of sex trafficking. He had been convicted previously of soliciting prostitution from a minor in 2008.The once high-flying financier had ties with a number of high-profile figures, including Andrew Mountbatten Windsor, the brother of King Charles and former prince; Trump; Trump's former advisor Steve Bannon; and a cast of other characters from the world of media, politics and entertainment.On Wednesday, former Harvard president Larry Summers took a leave from teaching at the university while the school investigated his links to Epstein, revealed in a series of chummy email exchanges.  Watch: Moment House passes bill to release Epstein files",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump signs bill ordering release of Jeffrey Epstein files",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5ff1/live/d9a13d30-c60e-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-20T12:20:13.000Z",
      "dateModified": "2025-11-20T12:20:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Quiet, piggy': Trump responds to reporter after Epstein question",
    "url": "https://www.bbc.com/news/videos/c70j210g4e7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8667/live/6fb18b00-c4b0-11f0-b288-51552c83ad58.jpg",
    "tag": "World",
    "date": "2025-11-18T19:17:16.000Z",
    "description": "When speaking to reporters on board Air Force One on 14 November, President Donald Trump was asked about recently released emails from Jeffrey Epstein",
    "body": "When speaking to reporters on board Air Force One on 14 November, President Donald Trump was asked about recently released emails from Jeffrey Epstein which mentioned him.Trump said he knew nothing about that and said the focus should be on other people named in those emails, including former President Bill Clinton.After a journalist from Bloomberg News tried to ask a follow-up question on Epstein, the president turned to her and said: \"Quiet. Quiet, piggy.\"The exchange occurred as calls grew for the US Department of Justice to release files related to its investigation into Epstein, the late financier and convicted sex offender who died in prison in 2019.On Sunday, President Trump reversed his position and called for Republicans to vote for a bill that forces the Justice Department to release all of its files related to the Epstein case.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Quiet, piggy': Trump responds to reporter after Epstein question",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8667/live/6fb18b00-c4b0-11f0-b288-51552c83ad58.jpg"
      ],
      "datePublished": "2025-11-18T19:17:16.000Z",
      "dateModified": "2025-11-18T19:17:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What do we know about the Jeffrey Epstein files?",
    "url": "https://www.bbc.com/news/articles/c20r07dg6kro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3ca5/live/b2847ef0-6877-11f0-8dbd-f3d32ebd3327.jpg",
    "tag": "World",
    "date": "2025-11-20T13:22:38.000Z",
    "description": "3 hours agoTom Geoghegan and James FitzGeraldGetty ImagesJeffrey Epstein in Cambridge, Massachusetts, in 2004The words \"Epstein files\" have been haunt",
    "body": "3 hours agoTom Geoghegan and James FitzGeraldGetty ImagesJeffrey Epstein in Cambridge, Massachusetts, in 2004The words \"Epstein files\" have been haunting the administration of US President Donald Trump for months as it grapples with a growing crisis over the crimes of late convicted sex offender and financier Jeffrey Epstein.Pressure was building from Trump's own supporters and from voices within his own Republican Party for more transparency on what the federal investigations into Epstein uncovered.After weeks of resisting release, Trump reversed course and urged Republicans to vote to open the Epstein files to public scrutiny. Both chambers of Congress - the legislative branch of US government - approved a measure that compels the US justice department to release all files pertaining to its investigation into Epstein.The following day, Trump announced in a social media post that he had signed a bill that approved the release of the files. Now, the justice department has 30 days to release all the files - except for those that relate to an active criminal investigation, identify victims of Epstein's abuse or invade their privacy, or contain images of physical and child sex abuse, death, or injury.What are the Epstein files?In 2008, Epstein reached a plea deal with prosecutors after the parents of a 14-year-old girl told police in Florida that Epstein had molested their daughter at his Palm Beach home.Photos of girls were found throughout the house, and he was convicted of soliciting prostitution from a minor, for which he was registered as a sex offender. He escaped a heavy jail sentence as a result of the deal.Eleven years later, he was charged with running a network of underage girls for sex. He died in prison while awaiting trial and his death was ruled a suicide.These two criminal investigations amassed a vast trove of documents including transcripts of interviews with victims and witnesses, and items confiscated from raids on his various properties.The US Federal Bureau of Investigation (FBI) found over 300 gigabytes of data and physical evidence in its databases, hard drives and other storage, according to a 2025 memo from the justice department. While some of the files likely include materials gathered by prosecutors working at federal level and Florida state level to investigate Epstein, the justice department says there is a \"large volume\" of images and videos of victims and other illegal child abuse material. These files would not be released to the public, as the latest legislation passed by Congress allows the justice department to withhold information that identifies victims. There was also a separate investigation into his British co-conspirator and ex-girlfriend Ghislaine Maxwell, who was convicted in 2021 of conspiring with Epstein to traffic girls for sex.Both Epstein and Maxwell were also the subject of civil cases.Watch: \"It's exhausting\" - Epstein accuser talks to the BBC about files sagaWhat has already been released on Epstein?At various stages over the years, some materials have been put into the public domain.Last week, thousands of documents belonging to the Epstein estate were released by the House Oversight Committee, mostly emails.That was not the first tranche released by the House Oversight Committee since it subpoenaed Epstein's estate earlier in the year.An earlier release, in September, included a birthday book containing a note to Epstein bearing Trump's name, which he has denied writing.In February, weeks after Trump took office, the Department of Justice and the FBI released what they described at the time as the \"first phase of the declassified Epstein files\".A group of right-wing influencers were invited to the White House, but they were left disappointed when they realised that the 341 pages handed to them were mostly material already out there.It included flight logs from Epstein's plane and a redacted version of his contacts book containing the names of famous people he knew.In July, the Department of Justice and FBI said in a memo that no more material would be released. That is now poised to change.What happens now that Trump has approved release?The vote in the House of Representatives was forced by a discharge petition getting its critical 218th signature to trigger action on the floor.Four Republicans and all 214 Democrats in the House signed the petition.The vote to release the files took place on 18 November and the bill passed 427-to-1 in the House. Republican lawmaker Clay Higgins of Louisiana was the sole no vote. A handful of legislators did not vote.Once the bill passed in the lower chamber of Congress, it swiftly moved to the Senate where it passed via unanimous consent - a procedure that speeds up the legislative process if there is no objection. It was then signed off by Trump.There are still several hurdles to the full release of the files. Attorney General Pam Bondi will be required to release all materials and documents related to Epstein and Maxwell within 30 days of the law being enacted. But Bondi has the power to withhold any information that could jeopardise a federal investigation or identify Epstein's victims.The document that went before the House states that the attorney general could withhold or redact personal information that \"would constitute a clearly unwarranted invasion of personal privacy\".Trump has repeatedly called for an investigation into senior figures among the Democrats. Republicans have said that they fear that investigations into Epstein's links could block or delay details in the files. Representative Thomas Massie said he was concerned that a \"flurry of investigations\" could be opened as a way to avoid releasing the information. Getty ImagesEpstein with Maxwell in 2005Who is named in the Epstein files?The contents of the unreleased documents remain unknown.According to The Wall Street Journal, Trump was told by Bondi in May that his name appeared in FBI documents.He used to be friends with Epstein and the paper noted that being named in the files was not evidence of wrongdoing.A White House spokesman called the story \"fake\", although an unnamed official speaking to Reuters news agency said the administration did not dispute that Trump's name had been included.Existing materials in the public domain mention a number of high-profile figures connected to Epstein.Again, this does not imply any wrongdoing by those individuals.Dozens of names came up in a release of court documents in 2024, including Andrew Mountbatten-Windsor, the former prince and brother of King Charles III, former US President Bill Clinton and Michael Jackson.Both Clinton and the British royal deny any knowledge of Epstein's crimes. Jackson died in 2009.The release of those documents related to the case of Maxwell, who is serving 20 years in prison for child sex trafficking.Billionaire Elon Musk and Mr Mountbatten-Windsor were named in flight logs released in September.Mr Mountbatten-Windsor has previously strenuously denied any wrongdoing. Mr Musk has been quoted as saying that Epstein invited him to the island but he declined.The latest batch of emails belonging to the Epstein estate and released on 12 November also featured Clinton's former Treasury Secretary, Larry Summers, and Trump's former aide Steve Bannon.Summers later said he would be stepping back from public commitments, writing in a statement: \"I take full responsibility for my misguided decision to continue communicating with Mr Epstein.\"Mr Bannon, who is not accused of any wrongdoing, did not reply to the BBC's request for comment. Trump's name was also mentioned several times in that latest release. He has always denied any wrongdoing.What do we know about the Trump/Epstein relationship?Trump and Epstein appear to have been friends for a number of years, keeping a similar social circle.Previously released files show that Trump's details were in Epstein's \"black book\" of contacts. Flight logs also showed Trump flying on Epstein's plane on several occasions.They were pictured together at elite events in the 1990s, and photos published by CNN purport to show Epstein in attendance at Trump's wedding to then-wife Marla Maples.In 2002, Trump described Epstein as a \"terrific guy\". Epstein would later remark: \"I was Donald's closest friend for 10 years.\"According to Trump, they fell out in the early 2000s, two years before Epstein was first arrested. By 2008, Trump was saying that he had not been \"a fan of his\".The White House has suggested that their fallout was connected to Epstein's behaviour, and that \"the president kicked him out of his club for being a creep\".The Washington Post, meanwhile, has suggested that the breakdown in their relationship was due to their rivalry over some real estate in Florida.Why are people so interested in Epstein?Die-hard members of Trump's MAGA movement have long believed officials are hiding key truths about Epstein's life and death.Some of them have theorised that a child-molesting cabal has been operating at the highest levels of US society, protected by the state. The theory spread through cryptic messages posted by a pseudonymous character called Q.In one of the conspiracy theories pushed by some MAGA influencers, Epstein was an agent of the Israeli government.Some Trump allies have tried to quell the backlash. Last month, the Republican-controlled House announced an early recess for the chamber, stalling efforts to force the release of Epstein-related documents within 30 days. There are several unanswered questions about Epstein shared by the wider population too - particularly why he was given such a lenient sentence in Florida, whether he and Maxwell were really acting alone, and how he was allowed to take his own life in prison.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What do we know about the Jeffrey Epstein files?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3ca5/live/b2847ef0-6877-11f0-8dbd-f3d32ebd3327.jpg"
      ],
      "datePublished": "2025-11-20T13:22:38.000Z",
      "dateModified": "2025-11-20T13:22:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]