[
  {
    "title": "Trump-backed candidate Nasry Asfura wins Honduras presidential election",
    "url": "https://www.bbc.com/news/articles/cyvgz1jn368o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1e22/live/573d1250-e10d-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "World",
    "date": "2025-12-25T03:32:10.000Z",
    "description": "Nasry Asfura has been declared the winner of Honduras' razor-thin presidential election, after weeks of delays following technical problems and allega",
    "body": "Nasry Asfura has been declared the winner of Honduras' razor-thin presidential election, after weeks of delays following technical problems and allegations of fraud. The conservative National Party candidate - backed by US President Donald Trump - won with 40.3% of the vote, according to the National Electoral Council (CNE), edging out Salvador Nasralla of the centre-right Liberal Party, who got 39.5%. In a post on X,  Asfura said: \"Honduras: I am ready to govern. I will not let you down.\" Meanwhile, Nasralla said at a press conference: \"I will not accept a result built on omissions.\" But he also urged his supporters to remain calm.US Secretary of State Marco Rubio urged all parties to respect the result \"so that Honduran authorities may ensure a peaceful transition of authority\".  But the president of the country's Congress, Luis Redondo, posted saying the result was \"completely illegal\".The vote was held on 30 November but the count was delayed twice by technical outages, which electoral officials called \"inexcusable\".The president of the CNE, Ana Paola Hall, blamed the private company tasked with tabulating the results for the delay.She said the firm had carried out maintenance without warning or checking with the CNE.The stoppage came a day after the portal displaying real-time results had crashed.Results of the election were tight and, because of the tumultuous nature of the processing system, around 15% of the tally sheets had to be counted by hand for the winner to be decided. There have been tensions in Honduras as a result of the delays with protests held across the country last week. Thousands of supporters of the governing Libre party demonstrated in the capital Tegucigalpa over what they considered fraud in the vote.  The outgoing President, Xiomara Castro, had alleged that an \"electoral coup\" was taking place and earlier this month said the election was being marred by \"interference\" from Trump. When he endorsed Asfura for president, Trump said there would be \"hell to pay\" if his very narrow lead was overturned in the count. He also threatened to withdraw financial support from the US if Asfura didn't win.In a surprise move, the US president also pardoned Juan Orlando Hernández, a member of Asfura's National Party, who was serving a 45-year jail sentence in the US on drug and weapons charges. Castro was barred by the constitution from standing for a second term.Nine days after the vote, Nasralla accused \"corrupt people\" of manipulating the vote count in the Central American nation. He also said Trump's comments had damaged his chances of winning.  In his statement following the announcement of the result, Rubio said the US would \"look forward to working with his incoming administration to advance our bilateral and regional security co-operation\", adding the two countries would \"end illegal immigration\" to the US, while strengthening economic ties. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump-backed candidate Nasry Asfura wins Honduras presidential election",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1e22/live/573d1250-e10d-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-25T03:32:10.000Z",
      "dateModified": "2025-12-25T03:32:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Eleven arrested over mass shooting in South Africa tavern",
    "url": "https://www.bbc.com/news/articles/c75v0kwy017o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/80e7/live/f3683cb0-e10b-11f0-835c-3dfe074dbe7f.jpg",
    "tag": "World",
    "date": "2025-12-24T21:31:37.000Z",
    "description": "1 day agoNomsa MasekoandEmma RossiterEleven suspects have been arrested in connection with a mass shooting that left nine people dead at a tavern in S",
    "body": "1 day agoNomsa MasekoandEmma RossiterEleven suspects have been arrested in connection with a mass shooting that left nine people dead at a tavern in South Africa on Sunday.Police launched a manhunt for the 12 unidentified gunmen who had opened fire at patrons at around 01:00 local time (23:00 GMT Saturday) in the Bekkersdal establishment, near Johannesburg.On Wednesday, provincial deputy commissioner of police, Major General Fred Kekana said nine of the arrested suspects are Lesotho nationals, while one is from Mozambique.Another suspect, believed to be a South African mineworker, was also detained.Murders in South Africa – which has one of the highest rates in the world - are often the result of arguments, robberies and gang violence.While the attack appeared \"unprovoked\" at the time, preliminary investigations now appear to suggest a motive linked to illegal mining turf wars.During the attack, gunmen continued to shoot as people fled the tavern, killing two as well as a taxi driver who had dropped off a passenger nearby.Upon making the arrests, several unlicensed firearms including an AK-47 rifle, were found in the suspects' possession.There are about 3m legally held firearms in South Africa and at least the same number of unlicensed weapons, according to statistics cited by Gideon Joubert from the South African Gunowners' Association, Although 2025 has seen a decline in reported mass shootings, there has been a significant increase in incidents where four or more people are either killed or injured since 2020, Claire Taylor, a researcher at campaign group Gun Free South Africa, told the BBC.Among the most common locations for these attacks are licensed taverns or illegal drinking spots, known locally as shebeens.Sunday's shooting occurred just two weeks after another attack at the Saulsville Hostel in the capital Pretoria, where eleven people including a three-year-old child were killed.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Eleven arrested over mass shooting in South Africa tavern",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/80e7/live/f3683cb0-e10b-11f0-835c-3dfe074dbe7f.jpg"
      ],
      "datePublished": "2025-12-24T21:31:37.000Z",
      "dateModified": "2025-12-24T21:31:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Turkey arrests 115 IS suspects 'planning New Year's attacks'",
    "url": "https://www.bbc.com/news/articles/cn98w93l8plo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e997/live/44d2a2c0-e17a-11f0-b74d-8b6955ff49d6.jpg",
    "tag": "World",
    "date": "2025-12-25T10:19:28.000Z",
    "description": "Turkish authorities say they have disrupted planned attacks on Christmas and New Year's events after detaining more than 100 suspected members of the ",
    "body": "Turkish authorities say they have disrupted planned attacks on Christmas and New Year's events after detaining more than 100 suspected members of the so-called Islamic State group.Mass raids were carried out at 124 addresses across Istanbul, the city's chief prosecutor said, with firearms, ammunition and \"organisational documents\" seized.Officials said IS supporters had been actively planning attacks across Turkey this week, particularly against non-Muslims. Police detained 115 suspects but efforts are ongoing to trace a further 22, an official statement read.The prosecutor's office said the suspects were in contact with IS operatives outside Turkey. The announcement comes two days after Turkish intelligence agents carried out a raid against the group on the Afghanistan-Pakistan border.A Turkish national who is alleged to have held a senior role with the IS wing operating in the region was detained and accused of planning attacks against civilians. Turkey's security services regularly target people with suspected links to IS.The country shares a 900km (560 mile) border with Syria, where the group continues to operate in parts of the country.Syria's president Ahmed al-Sharaa, who has close ties to the Turkish government, has vowed to work with the US and Europe to root out surviving elements of IS. The US launched a wave of air strikes against the group's positions across Syria on Friday in response to the killing of three Americans.Two US soldiers and a civilian interpreter were killed by IS gunmen during an ambush earlier this month. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Turkey arrests 115 IS suspects 'planning New Year's attacks'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e997/live/44d2a2c0-e17a-11f0-b74d-8b6955ff49d6.jpg"
      ],
      "datePublished": "2025-12-25T10:19:28.000Z",
      "dateModified": "2025-12-25T10:19:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Five killed in explosion in packed Nigerian mosque",
    "url": "https://www.bbc.com/news/articles/c0je3v3en01o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d587/live/62ecd360-e126-11f0-b67b-690eb873de1b.jpg",
    "tag": "World",
    "date": "2025-12-25T00:19:53.000Z",
    "description": "At least five people have been killed in a bomb explosion in a packed mosque in Nigeria's north-eastern Borno state, a police spokesman has said.Nahum",
    "body": "At least five people have been killed in a bomb explosion in a packed mosque in Nigeria's north-eastern Borno state, a police spokesman has said.Nahum Daso told local media another 35 people were injured in the blast in the Gamboru market of Maiduguri, the state capital, during evening prayers. Unverified footage on social media appears to show the aftermath of the explosion, with people standing in a market area with dust particles in the air. No group has admitted carrying out the attack, but militants have previously targeted mosques and crowded places in the area with suicide attacks and improvised explosive devices (IED).Maiduguri has been central to an insurgency by the militant Islamist group Boko Haram and its offshoot Islamic State West Africa Province. Military operations by Boko Haram to create an Islamic caliphate in Borno state began in 2009. Security measures against the group have failed to prevent sporadic attacks against civilians in north-east Nigeria. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Five killed in explosion in packed Nigerian mosque",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d587/live/62ecd360-e126-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-25T00:19:53.000Z",
      "dateModified": "2025-12-25T00:19:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sean 'Diddy' Combs files appeal asking for his immediate release",
    "url": "https://www.bbc.com/news/articles/c5yqe4j15lzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5add/live/f07769e0-e101-11f0-b67b-690eb873de1b.png",
    "tag": "World",
    "date": "2025-12-24T23:30:09.000Z",
    "description": "Sean \"Diddy\" Combs has asked an appeals court to release him from prison and overturn his conviction on two prostitution-related crimes.In a court fil",
    "body": "Sean \"Diddy\" Combs has asked an appeals court to release him from prison and overturn his conviction on two prostitution-related crimes.In a court filing for an expedited appeal, the rap mogul's attorney argued that he was improperly sentenced, and that the conduct that resulted in his conviction was not criminal in nature.Attorney Alexandra Shapiro called Combs' 50-month prison sentence \"unlawful, unconstitutional, and a perversion of justice\". She asked an appeals court to order that Combs be resentenced, should the panel choose not to throw out his conviction in its entirety. The request is the latest attempt by his team to reduce his sentence or throw out his conviction.The Southern District of New York, which prosecuted Combs, declined to comment on the request to the Second Circuit Court of Appeals.Combs' lawyers had previously said they would appeal his sentence and conviction.Federal prosecutors in New York accused Combs of using his money, power, and the threat of violence to coerce women into unwanted sexual encounters.During a high-profile trial this spring, the jury heard from two of Combs' ex-girlfriends, Cassie Ventura and a woman who testified as \"Jane Doe\". They said Combs abused them and forced them to participate in so-called \"freak-offs\" with male escorts.The jury found Combs not guilty of the two most serious charges: racketeering conspiracy and sex trafficking. They convicted him of two counts of transportation to engage in prostitution.In September, after his conviction, Combs asked Judge Arun Subramanian to consider an acquittal or new trial, citing objections over the way an anti-prostitution statute known as the Mann Act was used to prosecute Combs. That bid was not successful.Ahead of his sentencing, Combs' attorneys argued he should receive a brief sentence that would essentially amount to time served, a request that would have paved the way for a swift release. Prosecutors, however, asked the judge to send Combs to prison for at least 11 years.US District Judge Arun Subramanian ultimately sentenced Combs to more than four years in prison. He said he considered Combs' contributions to society and testimonials from family and friends, but \"a history of good works can't wash away your record\".Combs' appeal argues that Judge Subramanian did not properly follow sentencing guidelines when sending him to 50-months in prison.It argues the judge \"flouted\" new guidelines and improperly considered conduct for which Combs had been acquitted when formulating his punishment. The filing argues the judge \"acted as a thirteenth juror\" in the case and calls the sentence \"draconian\". Before Judge Subramanian issued his sentence, Combs apologized to Ms Ventura and \"Jane.\"\"My actions were disgusting, shameful, and sick,\" Combs said. \"I got lost in excess, I got lost in my ego.\"Combs is also facing dozens of pending civil lawsuits, which accuse him of sexual assault, rape and sexual exploitation. Many of the lawsuits allege that the rapper used his fame and power to silence accusers through threats. Some detail allegations that the rapper - or those who worked for him - drugged people at parties before alleged assaults. Representatives for Mr Combs have repeatedly said he \"never sexually assaulted or trafficked anyone - man or woman, adult or minor\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sean 'Diddy' Combs files appeal asking for his immediate release",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5add/live/f07769e0-e101-11f0-b67b-690eb873de1b.png"
      ],
      "datePublished": "2025-12-24T23:30:09.000Z",
      "dateModified": "2025-12-24T23:30:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brazil ex-president Bolsonaro's surgery for hernia 'successful'",
    "url": "https://www.bbc.com/news/articles/c898zxyznxpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cce0/live/c5c75620-e1b9-11f0-87d9-5d6652c57a15.jpg",
    "tag": "World",
    "date": "2025-12-25T18:24:38.000Z",
    "description": "The jailed ex-president of Brazil, Jair Bolsonaro, has undergone a successful surgery for a double hernia, his wife Michelle says. The former leader i",
    "body": "The jailed ex-president of Brazil, Jair Bolsonaro, has undergone a successful surgery for a double hernia, his wife Michelle says. The former leader is serving a 27-year sentence for plotting a coup after he lost the 2022 presidential election to his left-wing rival, Luiz Inácio Lula da Silva. Brazil's Supreme Court granted permission for the 70-year-old to be transferred from the room in the federal police headquarters where he is serving his sentence to a hospital in the capital, Brasília, for the procedure. Ahead of the surgery, Jair Bolsonaro endorsed the candidacy of his eldest son, Flávio, for the 2026 presidential race. The former president made his decision known in handwritten letter that was read out by Flávio Bolsonaro outside the hospital were his father is being treated.\"During my life, I have fought tough battles, paying a high price with both my health and my family, to defend what I think is best for our country,\" Bolsonaro wrote.\"I hand over what is most important in the life of a father - my own son for the mission of rescuing our country, Brazil.\"Flávio Bolsonaro, a 44-year-old senator, had already announced his decision to run for president for his father's Liberal Party.Ealier this month, he said his father had entrusted him \"with the mission of continuing our national project\". But Jair Bolsonaro's letter, which has been published by Brazilian media, is confirmation the senator has his father's backing.The incumbent, President Lula, has already announced he plans to run again in the presidential election scheduled for October 2026. In 2022, the presidential election went into a run-off, which saw the older Bolsonaro take on ex-President Lula. When Lula narrowly won, Jair Bolsonaro refused to accept the result and plotted with top military leaders to prevent Lula from taking up office. While the plot failed to enlist enough support from the military to go ahead, it did culminate in the storming of government buildings by Bolsonaro's supporters on 8 January 2023.Bolsonaro was found guilty of coup-plotting and sentenced in September this year. Despite the guilty verdict, the older Bolsonaro still wields considerable political influence.Brazil's Congress passed a bill last week to significantly shorten Bolsonaro's sentence but President Lula said he would veto it.  Jair Bolsonaro is expected to be transferred back to federal police headquarters as soon as doctors give the go-ahead. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brazil ex-president Bolsonaro's surgery for hernia 'successful'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cce0/live/c5c75620-e1b9-11f0-87d9-5d6652c57a15.jpg"
      ],
      "datePublished": "2025-12-25T18:24:38.000Z",
      "dateModified": "2025-12-25T18:24:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pope Leo urges 'courage' to end Ukraine war in first Christmas address",
    "url": "https://www.bbc.com/news/articles/cm21728nwxlo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/44c5/live/6d80ba30-e1ad-11f0-b67b-690eb873de1b.jpg",
    "tag": "World",
    "date": "2025-12-25T16:21:18.000Z",
    "description": "Pope Leo has urged Ukraine and Russia to find the \"courage\" to hold direct talks to end the war during his first Christmas remarks to crowds in St Pet",
    "body": "Pope Leo has urged Ukraine and Russia to find the \"courage\" to hold direct talks to end the war during his first Christmas remarks to crowds in St Peter's square.He called for an end to conflicts around the world during his Urbi et Orbi address, which is traditionally delivered by the pontiff on Christmas Day to worshippers gathered in Vatican City. Speaking about Ukraine, the Pope said: \"May the clamour of weapons cease, and may the parties involved, with the support and commitment of the international community, find the courage to engage in sincere, direct and respectful dialogue.\"His plea comes as US-led negotiations on a deal to end the fighting continues. The US has sought to put together an agreement acceptable to both sides, but direct talks between Russian and Ukraine have not taken place during this latest round of diplomatic efforts.Pope Leo also decried turmoil and conflict plaguing other parts of the world, including Thailand and Cambodia where deadly border clashes have flared up despite a ceasefire in July.He asked that the South East Asian nations' \"ancient friendship\" be restored and \"to work towards reconciliation and peace\".During an earlier Christmas Day sermon in St Peter's Basilica, Pope Leo lamented conditions for homeless people the world over, and the damage caused by conflicts.\"Fragile is the flesh of defenceless populations, tried by so many wars, ongoing or concluded, leaving behind rubble and open wounds,\" he said.He said the story of the birth of Jesus showed that God had \"pitched his fragile tent\" among the people of the world. \"How, then,\" he asked, turning his attention to the conditions of Palestinians, \"can we not think of the tents in Gaza, exposed for weeks to rain, wind and cold?\"Gaza has been devastated by Israeli bombardment in a two-year war, triggered by Hamas's attack on Israel on 7 October 2023.Winter storms have compounded the plight of the territory's 2.1m population, nearly all of whom have been displaced and their homes damaged or destroyed.Aid agencies have called for Israel to allow more tents and urgently needed supplies into Gaza. Cogat, the Israeli military body which controls Gaza's border crossings, has dismissed claims of deliberate aid restrictions, saying almost 310,000 tents and tarpaulins had been delivered since the start of the ceasefire in October.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pope Leo urges 'courage' to end Ukraine war in first Christmas address",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/44c5/live/6d80ba30-e1ad-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-25T16:21:18.000Z",
      "dateModified": "2025-12-25T16:21:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US discovers a million more possible Jeffrey Epstein files",
    "url": "https://www.bbc.com/news/articles/czdgz84dn35o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4fff/live/714a9180-e0ff-11f0-aeaa-01aad3a08dd8.jpg",
    "tag": "World",
    "date": "2025-12-24T22:55:25.000Z",
    "description": "US authorities have discovered more than a million more documents potentially related to the late paedophile Jeffrey Epstein that they plan to release",
    "body": "US authorities have discovered more than a million more documents potentially related to the late paedophile Jeffrey Epstein that they plan to release in the coming days and weeks, officials say.The FBI and federal prosecutors in New York informed the Department of Justice (DoJ) of the discovery.\"We have lawyers working around the clock to review and make the legally required redactions to protect victims, and we will release the documents as soon as possible,\" the DoJ said on Wednesday.The department said it could take \"a few more weeks\" before all the files are released. The DoJ has been under scrutiny after not releasing all Epstein files by 19 December, the deadline mandated under a new law.The agency said it would \"continue to fully comply with federal law and President Trump's direction to release the files\". The statement did not specify how the FBI and the US Attorney for the Southern District of New York came across the additional material. Epstein had been facing charges of sex trafficking minors in the state when he died awaiting trial in a New York prison. The news comes after the justice department released thousands of documents - some heavily redacted - related to their investigations into Epstein. The department has been releasing the documents in batches and top officials have said hundreds of thousands of documents still are to be released. Who and what are in the Epstein files?Who was Jeffrey Epstein? The disgraced financier with powerful associatesTrump trips, a fake video and 10 possible co-conspirators: Takeaways from new Epstein filesThe files were released after Congress passed the Epstein Files Transparency Act - signed into law by US President Donald Trump - that ordered the agency to share all the documents with the public while protecting victims' identities. Many of the released documents, which include videos, photos, emails and investigative documents, have heavy redactions, including names of people the FBI appears to cite as possible co-conspirators in the Epstein case.The justice department has faced criticism from lawmakers on both sides of the aisle over the amount of redactions, which the law permits only to protect victims' identities and active criminal investigations. In a post on X after the discovery of the additional documents was announced, the top Democrat on the House Oversight Committee, a congressional panel that has been investigating the Epstein saga, accused the White House of “illegally” withholding the files.“Every day we see lies, incompetence, missed deadlines, and illegal redactions,” Representative Robert Garcia said in a statement. The law passed by Congress and signed last month by Trump states that names and information that might be embarrassing or cause \"reputational harm\" are not allowed to be redacted. It specifically asks the DoJ for internal communications and memos detailing who was investigated and decisions on whether \"to charge, not charge, investigate, or decline to investigate Epstein or his associates\".Included in the documents are emails appearing to be exchanged between FBI personnel in 2019 that mention 10 possible \"co-conspirators\" of Epstein.The emails said six of the group had been served with subpoenas. This included three in Florida, one in Boston, one in New York City, and one in Connecticut.Possible co-conspirators in Epstein's crimes are a major focus for his victims, and for several lawmakers who have demanded more transparency from the justice department.Previous releases of Epstein documents have included revelations that reverberated across the Atlantic. Andrew and Epstein is the story that will not go awayAndrew stripped of 'prince' title and will move out of Royal LodgePeter Mandelson: Rise and fall of Labour's political fixerPeter Mandelson was sacked as the UK's ambassador to the US after details emerged about his friendship with the convicted paedophile, and that he told Epstein \"I think the world of you\", the day before Epstein began his sentence for soliciting prostitution from a minor in June 2008.Lord Mandelson said in a letter to staff that \"I deeply regret\" the circumstances of his departure from the British embassy in Washington DC. He said being ambassador had been \"the privilege of my life\" and he continued \"to feel utterly awful about my association with Epstein twenty years ago and the plight of his victims\".In October, Andrew Mountbatten-Windsor lost his prince title and was asked to leave his Windsor mansion, Royal Lodge, following prolonged scrutiny over his links to Epstein. In the latest release of files on Tuesday, a 2001 email sent by a person identified as \"A\" from \"Balmoral\" to Epstein's accomplice and close associate Ghislaine Maxwell - who was sentenced to 20 years in prison in 2022 for sex trafficking of minors and other offences- asks: \"Have you found me some new inappropriate friends?\"The BBC has contacted Andrew's team for a response. He has repeatedly denied wrongdoing, and said he did not \"see, witness or suspect any behaviour of the sort that subsequently led to his [Epstein's] arrest and conviction\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US discovers a million more possible Jeffrey Epstein files",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4fff/live/714a9180-e0ff-11f0-aeaa-01aad3a08dd8.jpg"
      ],
      "datePublished": "2025-12-24T22:55:25.000Z",
      "dateModified": "2025-12-24T22:55:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zelensky hails 'new ideas' on peace after talk with US envoys",
    "url": "https://www.bbc.com/news/articles/c4g413yz9g5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fea9/live/19e89c40-e1cf-11f0-84d1-ab457a8c9836.jpg",
    "tag": "World",
    "date": "2025-12-25T22:20:14.000Z",
    "description": "6 hours agoVanessa BuschschlüterandJaroslav LukivUkraine's President Volodymyr Zelensky has given a positive assessment of a conversation he had with ",
    "body": "6 hours agoVanessa BuschschlüterandJaroslav LukivUkraine's President Volodymyr Zelensky has given a positive assessment of a conversation he had with US envoys on how to end the Russia-Ukraine war.Zelensky said Thursday's call with Steve Witkoff and Jared Kushner, which lasted nearly an hour, had yielded \"new ideas in terms of formats, meetings, and... timing on how to bring a real peace closer\".He spoke a day after giving details of an updated 20-point peace plan, agreed by US and Ukrainian envoys in Florida. Zelensky said he had asked Witkoff and Kushner to pass along Christmas greetings to US President Donald Trump \"and the entire Trump family\".The Kremlin said it was analysing proposals brought back from the US by a Russian envoy.Trump and his envoys have been holding talks with both Ukraine and Russia in an effort to reach a deal to end the war which was started by Russia's full-scale invasion of Ukraine in February 2022.There appears to have been some progress in recent days with Ukraine's president praising the \"good ideas\" put forward by Witkoff and Trump's son-in-law Kushner.Zelensky said it had been an \"active day\" for his country's diplomacy, as he went into details with the US envoys.He conceded that there was still \"work to be done on sensitive issues\" but added that \"together with the American team, we understand how to put all of this in place\".Zelensky added that Ukraine's top negotiator Rustem Umerov, the country's top security official, \"will continue discussions with the American team\".The 20-point peace plan agreed by the US and Ukraine is seen as an update to the  initial draft prepared by Witkoff several weeks ago.That draft was widely seen as heavily geared towards Russia's maximalist pre-invasion demands, which Kyiv and its European said meant the de facto capitulation of Ukraine.Describing the updated proposal on Wednesday, Zelensky had said it offered Russia the potential withdrawal of Ukrainian troops from the east and the creation of a demilitarised zone in their place.He said the plan now included security guarantees from the US, Nato and Europeans for a co-ordinated military response if Russia invaded Ukraine again.On the key question of Ukraine's industrial eastern Donetsk region, Zelensky said a \"free economic zone\" was a potential option. Any area that Ukrainian troops pulled out of would have to be policed by Ukraine, he stressed.Moscow currently controls about 75% of the Donetsk region, and some 99% of the neighbouring Luhansk. They are collectively known as Donbas.Zelensky has been under heavy pressure from Trump to cede all of Donbas to Russia during ongoing Washington-led peace negotiations.The Ukrainian leader has so far rejected any territorial concessions, and instead demanded iron-clad security guarantees for Ukraine in any potential settlement.Russian President Vladimir Putin has repeatedly warned that Ukrainian troops must leave Donbas or Russia will seize it.On Thursday, Kremlin spokesman Dmitry Peskov said Moscow was studying the proposals brought back from the US by the Russian envoy, Kirill Dmitriev.\"We are examining this material, and depending on the decisions made by the head of state, we will continue our communication with the Americans,\" he said.While diplomatic efforts to end the conflict inch forward, fighting continues on the ground. The Ukrainian military said on Thursday that it had struck one of Russia's key oil refineries in the southern region of Rostov with cruise missiles. The Novoshakhtinsk refinery near the Ukrainian border is critical for supplying fuel for Russian military operations in occupied eastern Ukraine.The Russian defence ministry said its forces had taken control of the settlement of Sviato-Pokrovske in the Donetsk region.Earlier this week, Ukrainian troops withdrew from the embattled eastern town of Siversk.The capture of the town brings Russia closer to the last remaining \"fortress belt\" cities of Sloviansk and Kramatorsk still in Ukrainian hands in the Donetsk region.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zelensky hails 'new ideas' on peace after talk with US envoys",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fea9/live/19e89c40-e1cf-11f0-84d1-ab457a8c9836.jpg"
      ],
      "datePublished": "2025-12-25T22:20:14.000Z",
      "dateModified": "2025-12-25T22:20:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Algeria's parliament approves law declaring France's colonisation a crime",
    "url": "https://www.bbc.com/news/articles/c14vdpyj1vjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7b4d/live/45fe6d40-e0e5-11f0-838b-af23dd31ce4d.jpg",
    "tag": "World",
    "date": "2025-12-24T17:37:07.000Z",
    "description": "Algeria's parliament has unanimously passed a law declaring France's colonisation of the North African state a crime, and demanding an apology and rep",
    "body": "Algeria's parliament has unanimously passed a law declaring France's colonisation of the North African state a crime, and demanding an apology and reparations. The law also criminalises the glorification of colonialism, state-run TV reports.The vote is the latest sign of increasingly strained diplomatic relations between the two countries, with some observers saying they are at their lowest since Algeria gained independence 63 years ago.France's colonisation of Algeria between 1830 and 1962 was marked by mass killings, large-scale deportations and ended in a bloody war of independence. Algeria says the war killed 1.5 million people, while French historians put the death toll much lower.France's President Emmanuel Macron has previously acknowledged the colonisation of Algeria was a \"crime against humanity\" but has not offered an apology.Lawmakers wore scarves in the colours of the national flag and chanted \"long live Algeria\" as they applauded the bill's passage through parliament, AFP news agency reports.It says the legislation states that France has \"legal responsibility\" for the \"tragedies it caused\", and \"full and fair\" compensation was an \"inalienable right of the Algerian state and people\". France has not yet commented on the vote. It comes at a time of growing pressure on Western powers to offer reparations for slavery and colonialism, and to return looted artefacts still kept in their museums.Algerian lawmakers have been demanding that France return a 16th Century bronze canon, known as Baba Merzoug, meaning \"Blessed Father\", that was regarded as the protector of Algiers, now Algeria's capital.French forces captured the city in 1830, on their third attempt, and removed the cannon - which is now in the port city of Brest in north-western France.In 2020, France returned the remains of 24 Algerian fighters who were killed resisting French colonial forces in the 19th Century.Last month, Algeria hosted a conference of African states to push for justice and reparations.Algeria's Foreign Minister Ahmed Attaf said that a legal framework would ensure that restitution was neither regarded as \"a gift nor a favour\".Diplomatic relations between between Algeria and France soured last year, when Macron announced France was recognising Moroccan sovereignty of Western Sahara and backed a plan for limited autonomy for the disputed territory.Algeria backs the pro-independence Polisario Front in Western Sahara and is seen as its main ally.French-Algerian novelist Boualem Sansal was then arrested at Algiers airport in  and jailed for five years, before being pardoned by Algeria's President Abdelmadjid Tebboune last month.Prosecutors said he had undermined national security for making remarks that questioned Algeria's borders.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Algeria's parliament approves law declaring France's colonisation a crime",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7b4d/live/45fe6d40-e0e5-11f0-838b-af23dd31ce4d.jpg"
      ],
      "datePublished": "2025-12-24T17:37:07.000Z",
      "dateModified": "2025-12-24T17:37:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Front-runner to be Bangladesh PM returns after 17 years in exile",
    "url": "https://www.bbc.com/news/articles/crk733k1k1eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/76fa/live/40b11f80-e16d-11f0-a0bc-9fe6b7032229.jpg",
    "tag": "World",
    "date": "2025-12-25T06:44:21.000Z",
    "description": "Tarique Rahman, the front-runner to be the next prime minister of Bangladesh, has returned to the country after 17 years in exile ahead of landmark ge",
    "body": "Tarique Rahman, the front-runner to be the next prime minister of Bangladesh, has returned to the country after 17 years in exile ahead of landmark general elections.The 60-year-old is the figurehead of the influential Zia family and the son of former prime minister Khaleda Zia. The party he leads, the Bangladesh Nationalist Party (BNP), is eyeing a return to power when Bangladesh goes to the polls in the new year.Rahman, who has lived in London since 2008, is expected to become the country's new leader if the BNP emerges as the largest party. Rahman's return comes in the wake of former Prime Minister Sheikh Hasina being ousted last year.He had been the subject of various criminal investigations launched while her Awami League party was in power but was cleared of all charges when her regime fell. Hasina is living in exile in India and her party is unlikely to be permitted to take part in the elections, which many view as among the most consequential in Bangladesh's history.Last month, Hasina was sentenced to death for her role in suppressing anti-government protests. According to UN investigators, up to 1,400 people died in the student-led unrest.Hasina, who was put on trial in absentia, has denied committing crimes against humanity. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Front-runner to be Bangladesh PM returns after 17 years in exile",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/76fa/live/40b11f80-e16d-11f0-a0bc-9fe6b7032229.jpg"
      ],
      "datePublished": "2025-12-25T06:44:21.000Z",
      "dateModified": "2025-12-25T06:44:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK social media campaigners among five denied US visas",
    "url": "https://www.bbc.com/news/articles/cp39kngz008o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1545/live/d4822640-e0bf-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "World",
    "date": "2025-12-24T15:09:56.000Z",
    "description": "Two British campaigners are among five people denied US visas after the State Department accused them of seeking to \"coerce\" American tech platforms i",
    "body": "Two British campaigners are among five people denied US visas after the State Department accused them of seeking to \"coerce\" American tech platforms into suppressing free speech.Imran Ahmed, an ex-Labour adviser who now heads the Centre for Countering Digital Hate (CCDH), and Clare Melford, CEO of the Global Disinformation Index (GDI), were labelled \"radical activists\" by the Trump administration and banned from entering the US.A French ex-EU commissioner and two senior figures at a Germany-based anti-online hate group were also denied visas.European leaders have condemned the measures, while the UK government said it is \"fully committed\" to upholding free speech.\"While every country has the right to set its own visa rules, we support the laws and institutions which are working to keep the internet free from the most harmful content,\" a UK government spokesperson said.French President Emmanuel Macron described the travel ban as \"intimidation and coercion aimed at undermining European digital sovereignty\" while the EU's foreign policy chief Kaja Kallas said it was \"unacceptable and an attempt to challenge our sovereignty\".The US billed the measures as a response to people and organisations that have campaigned for restrictions on American tech firms, with Secretary of State Marco Rubio saying they belonged to a \"global censorship-industrial complex\".He said: \"President Trump has been clear that his America First foreign policy rejects violations of American sovereignty. Extraterritorial overreach by foreign censors targeting American speech is no exception.\"Ahmed from the CCDH, which says it advocates for government action against hate speech and disinformation online, has links to senior Labour figures. He was previously an aide to Labour minister Hilary Benn, and Sir Keir Starmer's chief of staff Morgan McSweeney has served as a director of the group he founded.The US government labelled Ahmed a \"collaborator\" for the CCDH's purported past work with the Biden administration. BBC News has contacted the CCDH for comment.Melford founded the GDI, a non-profit that monitors the spread of disinformation, in 2018.US Undersecretary of State Sarah B Rogers accused the GDI of using US taxpayer money \"to exhort censorship and blacklisting of American speech and press\". A GDI spokesperson told the BBC that \"the visa sanctions announced today are an authoritarian attack on free speech and an egregious act of government censorship\".\"The Trump Administration is, once again, using the full weight of the federal government to intimidate, censor, and silence voices they disagree with. Their actions today are immoral, unlawful, and un-American.\"Also targeted was Thierry Breton, the former top tech regulator at the European Commission, who suggested that a \"witch hunt\" was taking place.Breton was described by the State Department as the \"mastermind\" of the EU's Digital Services Act (DSA), which imposes content moderation on social media firms. However, it has angered some US conservatives who see it as seeking to censor right-wing opinions. Brussels denies this.Breton has clashed with Elon Musk, the world's richest man and owner of X, over obligations to follow EU rules.The European Commission recently fined X €120m (£105m) over its blue tick badges - the first fine under the DSA. It said the platform's blue tick system was \"deceptive\" because the firm was not \"meaningfully verifying users\".In response, Musk's site blocked the Commission from sharing adverts on its platform.Reacting to the visa ban, Breton posted on X: \"To our American friends: Censorship isn't where you think it is.\"Also subject to bans were Anna-Lena von Hodenberg and Josephine Ballon of HateAid, a German organisation that the State Department said helped enforce the DSA.In a statement to the BBC, the two CEOs called it an \"act of repression by a government that is increasingly disregarding the rule of law and trying to silence its critics by any means necessary\". They added: \"We will not be intimidated by a government that uses accusations of censorship to silence those who stand up for human rights and freedom of expression.\"Follow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weekly US Politics Unspun newsletter. Readers in the UK can sign up here. Those outside the UK can sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK social media campaigners among five denied US visas",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1545/live/d4822640-e0bf-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-24T15:09:56.000Z",
      "dateModified": "2025-12-24T15:09:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Watch: Rescuers find survivor in wreckage of Mexican Navy medical flight",
    "url": "https://www.bbc.com/news/videos/c0edjv3jr3po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3806/live/39ea63d0-e016-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "World",
    "date": "2025-12-23T16:51:40.000Z",
    "description": "Footage captures the moment rescuers discover a survivor in the wreckage of a plane crash that killed at least 5 people, with one person still missing",
    "body": "Footage captures the moment rescuers discover a survivor in the wreckage of a plane crash that killed at least 5 people, with one person still missing. Two people were rescued and taken to an area hospital. Sky Decker, a local yacht captain, said he took two police officers to the site of the nearly submerged plane, before jumping in and finding an injured woman trapped. The crash occurred near Galveston, Texas. The aircraft was on a medical transport mission for Michou y Mau Foundation, which provides care to Mexican children with severe burns. The cause of the crash has not yet been determined.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Watch: Rescuers find survivor in wreckage of Mexican Navy medical flight",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3806/live/39ea63d0-e016-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-23T16:51:40.000Z",
      "dateModified": "2025-12-23T16:51:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Have the American Pope and American administration fallen out?",
    "url": "https://www.bbc.com/news/articles/cvg1361d32ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/abe3/live/7d6df570-e027-11f0-997b-df531e67f496.jpg",
    "tag": "World",
    "date": "2025-12-24T00:03:08.000Z",
    "description": "2 days agoLebo DisekoGlobal Religion correspondent Getty ImagesPope Leo has criticised the Trump administration's immigration policyJesse Romero, a co",
    "body": "2 days agoLebo DisekoGlobal Religion correspondent Getty ImagesPope Leo has criticised the Trump administration's immigration policyJesse Romero, a conservative Catholic podcaster, has some choice words for Pope Leo XIV.\"The Pope should tell us how to get to heaven,\" says Romero. \"He has no authority over the government; he has to stay in his lane.\"As a Donald Trump supporter, he is angry about criticism made by the American-born Pope and US bishops about his mass deportation policy. With one in five Americans identifying as Catholic, the Church plays an important role in American life - and politics.Catholics like Vice President JD Vance, and influential legal activist Leonard Leo, were an important part of Donald Trump's electoral success. They are at the heart of the cabinet too, with Secretary of State Marco Rubio, and Education Secretary Linda McMahon holding key offices.But the issue of immigration has become a faultline between Church leadership and the government, as well as amongst parishioners themselves.When cardinals gathered at the papal conclave in May, Romero had hoped for a \"Trump-like Pope,\" with a similar outlook to the president.Instead, Pope Leo XIV has spoken repeatedly about his concerns over how migrants are treated in the US, calling for \"deep reflection\" on the matter in November. The pontiff evoked the gospel of Matthew, adding that \"Jesus says very clearly, at the end of the world, we're going to be asked, 'How did you receive the foreigner?\"A week later the United States Conference of Catholic Bishops (USCCB), issued a rare \"Special Message\" voicing their \"concern for the evolving situation impacting immigrants in the United States\".The bishops said they were \"disturbed\" at what they called \"a climate of fear and anxiety\". They added that they \"oppose the indiscriminate mass deportation of people\" and \"pray for an end to dehumanizing rhetoric and violence\".It was a significant intervention, the first time the USCCB had used such a communique in a dozen years. It was backed by the Pope, who called the statement \"very important\" and urged all Catholics and \"people of goodwill, to listen carefully\" to it.Getty ImagesChicago has been a focus of the Trump administration's immigration enforcementPicking a fight with the Pope\"I think the relationship is quite tense,\" says David Gibson, director of Fordham University's Center on Religion and Culture.Conservatives had hoped that Pope Leo would bring a change from his predecessor Pope Francis's focus on issues of social justice and migration, according to Gibson. \"Many of them are angry. They want to tell the church to shut up,\" and to confine itself to issues such as abortion, Mr Gibson says.White House border czar, Tom Homan - himself a Catholic - has said that the Church \"is wrong\", and that its leaders \"need to spend time fixing the Catholic Church\". And in October, the White House Press Secretary Karoline Leavitt rejected the Chicago born Pope's suggestion that US treatment of immigrants was \"inhuman\" and not in line with \"pro-life\" beliefs.Gibson argues that the government's calculation \"is that there are enough American Catholics, especially white American Catholics, who support the Republican Party and Donald Trump, that it's politically beneficial at the end of the day to pick a fight with the Pope. That's an unprecedented calculus.\"Nearly 60% of white Catholics approve of how Trump is handling immigration, according to a new study by the think tank the Public Religion Research Institute. That figure is around 30% for Hispanics, who are 37% of the US Catholic population.Getty ImagesUS Vice President JD Vance has been vocal about how his Catholic faith has influenced his politicsThe growing power and prominence of right-wing Catholics in the political sphere is exemplified by JD Vance, a convert to the religion who says his politics are shaped by his faith. Although he has argued that current policy is not at odds with Church teaching, he has also said that there is a responsibility to remember the humanity of people who are in the country illegally.But some Catholics say that is not what is currently happening. Jeanne Rattenbury is a parishioner at St Gertrude Catholic Church in Chicago. The city has been a focus of the Trump administration's immigration enforcement.In November, Ms Rattenbury took part in a 2,000 strong celebration of Mass outside an ICE detention centre in the Broadview neighbourhood of Chicago. The \"People's Mass\" was one of a series of actions by the Coalition for Spiritual and Public Leadership (CSPL). The goal, she says, \"was to bring Communion to people inside, to minister to them, which is something that used to be allowed and is not being allowed\".The CSPL has now filed a federal lawsuit alleging it was blocked from providing religious ministry.\"I am proud to be a Catholic when the Catholic Church, from the Pope to the bishops, are saying immigrants have a right to be treated with respect. They have a right to have their inherent human dignity respected\", Ms Rattenbury says.Such is the strength of feeling that a church near Boston has used its Christmas nativity scene to make the point that Jesus was a refugee. St Susanna Parish in Dedham, Massachusetts, replaced baby Jesus with a hand-painted notice saying \"ICE was here\". Some in the community have complained, and the Catholic Archdiocese of Boston ordered that the display be removed, saying it was divisive and contravened rules on sacred objects. So far, the church has not done so.While many US Catholics maintain conservative positions on issues such as abortion, in line with that of the Church, they are also more likely to see themselves as progressive than white evangelical Christians, who overwhelmingly voted Republican in the last three elections. Around a third of white Catholics on the other hand have consistently voted for the Democratic Party.And nearly a third of Catholics in the US were born in other countries. \"This is a church that was built on immigration,\" says David Gibson. \"The Catholic brand in the United States is an immigrant church.\"Getty ImagesClergy say they have been blocked from giving Eucharist to migrants at an Illinois detention facility'Inconsistent with the Gospel'Bishop Joseph Tyson of Yakima, Washington State, was one of the 216 who supported the USCCB's Special Message. Just five bishops voted against it and three abstained.\"There's a fundamental disagreement of how the church sees immigrants in our parishes, from how the current administration views immigrants.\"We see a lot more positives in those immigrants.\"He says he is not arguing for open borders, a point that Pope Leo has also made, but is against \"indiscriminate deportation\".\"The deportations we are seeing of our parishioners and of our people in the United States [are] not surgical, [or] targeted to criminals,\" the bishop says.He estimates that around half of the families in his predominantly Hispanic diocese have someone in their household facing some sort of issue with their immigration status. Priests too are often immigrants themselves, putting the Church in an increasingly tenuous position.Bishop Tyson says that more than a third of clergy he has ordained have at some point been on a temporary visa before gaining a green card, a process that in the current climate can feel precarious.\"I have a seminarian in the Chicago area. He's on a T-visa, but [ICE] showed up, and he was afraid that he was going to be picked up,\" he said.\"Anybody can have their paperwork revoked, [so] we have our men carrying their papers with them at all times.\"Bishop Tyson argues that current US policy goes against Catholic teaching.\"It should weigh heavily on the consciences of Catholics in public life who support indiscriminate deportation. It is inconsistent with the Gospel of Life.\"For Jesse Romero though, it is US bishops and the Pope who are going against Catholic doctrine. He argues the Catechism - which summarises the teachings of the Church - is clear that immigrants should keep to all laws, including those about whether they should be in the country.\"We have a large swath of bishops in the Catholic Church of America that have a more modernist, liberal, progressive view of Scripture and theology.\"Romero says he prays for their conversion. While he accepts the Pope and the bishops as leaders of the faith, \"it doesn't mean that in their private opinions, they're going to get everything right. They're men\".\"The only person that is sinless is Jesus. He's perfect. Everybody else, we've got to pray for each other.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Have the American Pope and American administration fallen out?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/abe3/live/7d6df570-e027-11f0-997b-df531e67f496.jpg"
      ],
      "datePublished": "2025-12-24T00:03:08.000Z",
      "dateModified": "2025-12-24T00:03:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Christmas around the world: Waterskiing Santas and giant cuts of meat",
    "url": "https://www.bbc.com/news/articles/ce8nep787pyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6bb2/live/dc53f350-e1a8-11f0-b67b-690eb873de1b.jpg",
    "tag": "World",
    "date": "2025-12-25T15:01:32.000Z",
    "description": "13 hours agoGetty ImagesWorkers sell off cuts of meat during the traditional Christmas Eve auction at Smithfield meat market in London, UKFrom skiing ",
    "body": "13 hours agoGetty ImagesWorkers sell off cuts of meat during the traditional Christmas Eve auction at Smithfield meat market in London, UKFrom skiing Santas in the US and Mass with Pope Leo XIV at the Vatican, to giant cuts of meat being thrown into crowds in London, Christmas celebrations have been held around the world.Worshippers in Ukraine, China and Pakistan gathered for Christmas Eve services at their local churches.While most Christians mark Christmas on 25 December, many Orthodox Christians do not celebrate until 7 January. Here are some of the best images of the holiday cheer around the world.ReutersPope Leo XIV delivers the traditional Christmas Day Urbi et Orbi speech to the city and the world from the main balcony of St Peter's Basilica at the VaticanGetty ImagesTwo women take a photo in front of the Christmas tree in Nativity Square in Bethlehem, held to be the birthplace of Jesus Christ, in the occupied West BankGetty ImagesA woman lights a candle with her son during a Christmas Eve service in Kyiv, UkraineGetty ImagesWorshippers attend a Christmas Eve mass at the Church of the Saviour in Beijing, ChinaGetty ImagesChristians attend midnight Mass at Central Brooks Memorial Church in Karachi, PakistanGetty ImagesA man decorates a Christmas tree during Christmas Eve celebrations in Islamabad, PakistanGetty ImagesGirls stand alongside a Christmas nativity scene at St Mary's Church in the village of Uswetakeiyawa, Sri LankaReutersWomen hold candles as they attend a Christmas Eve mass in Nairobi, KenyaGetty ImagesThe Chartres cathedral in France is illuminated in bright colours ahead of midnight MassGetty ImagesA skiing Santa delights crowds during an annual Waterskiing Santa event in Alexandria, Virginia, in the US on Christmas EveGetty ImagesPeople wearing Santa costumes walk along the sand of Bondi Beach in Sydney, AustraliaGetty ImagesPolice officers dressed in festive gear deliver gifts on Christmas Eve in Lima, PeruGetty ImagesFishermen dressed as Santa and the Grinch on a boat in Valparaiso Bay, ChileGetty ImagesTwo men dressed as Santas take a selfie in the snow in Gulmarg in Indian-administered Kashmir",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Christmas around the world: Waterskiing Santas and giant cuts of meat",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6bb2/live/dc53f350-e1a8-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-25T15:01:32.000Z",
      "dateModified": "2025-12-25T15:01:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]