[
  {
    "title": "Kenyan landslide kills 21 after heavy rainfall",
    "url": "https://www.bbc.com/news/articles/c20eeqn2qlyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/99e2/live/c6eda100-b764-11f0-b8ce-31e36e4a3dbe.jpg",
    "tag": "World",
    "date": "2025-11-01T20:53:17.000Z",
    "description": "The Kenyan government has confirmed that 21 people have died following a landslide in the western part of the country after heavy rainfall. Interior M",
    "body": "The Kenyan government has confirmed that 21 people have died following a landslide in the western part of the country after heavy rainfall. Interior Minister Kipchumba Murkomen said the bodies had been transferred to a nearby airstrip after the landslide in Marakwet East late on Friday night.He said on X that more than 30 people were still unaccounted for after being reported missing by their families while 25 people with serious injuries had been airlifted to receive further medical attention.The Kenyan Red Cross, which is helping to coordinate rescue efforts, said that the most affected areas are still not accessible by road due to mudslides and flash flooding. The Kenyan government paused the search and rescue operation on Saturday evening but said it would resume on Sunday.\"Preparation to supply more food and non-food relief items to the victims is underway,\" said Murkomen, adding: \"Military and police choppers are on standby to transport the items.\"Kenya is in its second rainy season when it usually experiences a few weeks of wet weather compared to a heavier, more prolonged period earlier in the year. The government has urged people living near seasonal rivers as well as areas that experienced landslides on Friday to move to safer ground.Meanwhile, flash flooding and landslides in Uganda, near the border with Kenya, have killed a number of people since last Wednesday.On Saturday, the Uganda Red Cross said another mudslide had occurred in Kapsomo village in the east of the country, destroying a house and killing four people inside. The Red Cross said floods had severely affected most villages near riverbanks in the Bulambuli District. It said continuous heavy rainfall had caused the River Astiri and the River Sipi \"to overflow, resulting in widespread destruction of homes, crop fields, and community infrastructure\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kenyan landslide kills 21 after heavy rainfall",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/99e2/live/c6eda100-b764-11f0-b8ce-31e36e4a3dbe.jpg"
      ],
      "datePublished": "2025-11-01T20:53:17.000Z",
      "dateModified": "2025-11-01T20:53:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hurricane Melissa death toll rises to 28 in Jamaica",
    "url": "https://www.bbc.com/news/articles/c1e34p92q0vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fd15/live/3ad7d090-b7d3-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-11-02T11:37:48.000Z",
    "description": "The number of people killed in Jamaica as a result of Hurricane Melissa has risen to 28, the Caribbean nation's prime minister has announced.Andrew Ho",
    "body": "The number of people killed in Jamaica as a result of Hurricane Melissa has risen to 28, the Caribbean nation's prime minister has announced.Andrew Holness confirmed nine other deaths on Saturday, adding that there were reports of possible fatalities still being verified - suggesting the figure may yet rise.Emergency responders and aid agencies have struggled to reach certain parts of the island in the aftermath of the storm due to blocked roads, debris and flooding.The category five hurricane - the strongest type - has caused dozens of deaths across the Caribbean, bringing powerful winds and landslides to Cuba and Haiti.The full scale of the destruction Melissa wrought on Jamaica has only become clear in the past few days as the hurricane knocked out communication systems and power to much of the island after it made landfall on Tuesday.Communities on the island's western portion, such as Black River and Montego Bay, have seen the worst of the destruction.Images have emerged showing buildings razed to the ground, debris and belongings strewn on streets, and whole neighbourhoods still under floodwater.The Red Cross says that 72% of people across Jamaica still do not have electricity and around 6,000 are in emergency shelters.Jamaican officials confirmed to news agency AFP that multiple field hospitals were being established to treat people in the worst-affected areas in the west.Aid reaching those in need was initially held up by the temporary closure of Jamaica's airports. Now that it is arriving in the country, landslides, downed power lines and fallen trees have made certain roads impassable - complicating its distribution.With so many in need of clean drinking water, food and medicine, there have been reports of desperate people entering supermarkets and pharmacies to gather what they can.Melissa has become the most powerful storm on record to hit Jamaica, and one of the strongest seen in the Caribbean.At its peak, the hurricane had sustained winds of 185mph (295 km/h). A category five hurricane - those capable of catastrophic damage - has winds in excess of 157mph.At least 31 people have been killed in Haiti as a result of Melissa, while at least two deaths have been reported in the Dominican Republic.In Cuba, thousands of people have been evacuated as more than 60,000 homes have been damaged or destroyed.The impact of climate change on the frequency of storms is still unclear, but increased sea surface temperatures warm the air above and make more energy available to drive hurricanes, cyclones and typhoons. As a result, they are likely to be more intense with more extreme rainfall.Ahead of the start of this year's Atlantic hurricane season, the US National Oceanic and Atmospheric Administration predicted above-normal activity.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hurricane Melissa death toll rises to 28 in Jamaica",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fd15/live/3ad7d090-b7d3-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-11-02T11:37:48.000Z",
      "dateModified": "2025-11-02T11:37:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump remodels Lincoln bathroom in latest White House renovation",
    "url": "https://www.bbc.com/news/articles/c1d0066ew7lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4358/live/2da7f0e0-b746-11f0-92af-41f9e45019bf.jpg",
    "tag": "World",
    "date": "2025-11-01T23:44:10.000Z",
    "description": "US President Donald Trump has unveiled renovations to the bathroom in the Lincoln Bedroom, as his remodelling of the White House continues.Trump share",
    "body": "US President Donald Trump has unveiled renovations to the bathroom in the Lincoln Bedroom, as his remodelling of the White House continues.Trump shared photos of the new bathroom on social media, saying it had been \"renovated in the 1940s in an art deco green tile style, which was totally inappropriate for the Lincoln Era\".He claimed the new black and white marble is \"very appropriate for the time of Abraham Lincoln and, in fact, could be the marble that was originally there!\".It is the latest change Trump has made to the White House this year. In October, its East Wing was demolished to make way for his new multi-million dollar ballroom.The bathroom is a part of Abraham Lincoln's office and cabinet room, which former President Harry Truman fixed up as a part of his massive renovation of the White House in the late 1940s. The wallpaper of Lincoln's office and bedroom was once coloured in green and gold, according to the White House Historical Association. After Trump's remodelling, it now features gold fixtures and accents for the sink, bathtub faucet and shower door, as well as a chandelier. The White House said the renovation was privately funded at no cost to the taxpayer.The US president's attempts to put his own stamp on the White House have prompted criticism from conservation groups and his political opponents.  Trump previously said his ballroom addition to the East Wing would not \"interfere with the current building\". But in October, he said the \"existing structure\" had to be torn down. Trump said the ballroom construction was being fully funded by him and \"some friends of mine - donors\".Conservationists argued Trump should have sought public review before making the changes, which they say would overwhelm the classical style of the White House. The White House hit back at its critics, saying \"unhinged leftists\" were \"clutching their pearls over President Donald J Trump's visionary addition of a grand, privately funded ballroom to the White House - a bold, necessary addition\".Other changes to the White House include his decision in August to pave over grass in the Rose Garden with stone, transforming a lawn into a patio. Trump also added touches of gilded gold all over the Oval Office, including additional portraits framed in gold, gold-framed mirrors and a gold leaf for the presidential seal on the ceiling of the office.In response to his latest bathroom renovation, the Democrats accused Trump of being more focused on remaking the White House than solving the government shutdown.Central to the shutdown, which is now entering its second month, is a dispute over whether to extend health insurance subsidies.\"Donald Trump actually cares more about his toilet than he does about fixing your healthcare,\" Democratic Senate Minority Leader Chuck Schumer wrote in a post on social media.Speaking at an event on Saturday, former US President Barack Obama said Trump has been \"focused on critical issues, like paving over the Rose Garden so folks don't get mud on their shoes and gold plating the Oval Office and building a $300m ballroom\" than resolving the shutdown. \"If you can't visit a doctor, don't worry. He will save you a dance,\" he added. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump remodels Lincoln bathroom in latest White House renovation",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4358/live/2da7f0e0-b746-11f0-92af-41f9e45019bf.jpg"
      ],
      "datePublished": "2025-11-01T23:44:10.000Z",
      "dateModified": "2025-11-01T23:44:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump tells military to plan for 'action' over his claim that Nigeria allows killing of Christians",
    "url": "https://www.bbc.com/news/articles/cev18jy21w7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b7de/live/58bad5e0-b7d2-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "World",
    "date": "2025-11-02T12:07:25.000Z",
    "description": "Trump tells military to prepare for 'action' against Islamist militants in NigeriaUS President Donald Trump has ordered the preparation of plans for m",
    "body": "Trump tells military to prepare for 'action' against Islamist militants in NigeriaUS President Donald Trump has ordered the preparation of plans for military action in Nigeria to tackle Islamist militant groups, accusing the government of not doing enough to halt the killing of Christians.Trump did not say which killings he was referring to, but claims of a genocide against Nigeria's Christians have been circulating in recent weeks and months in some right-wing US circles.Groups monitoring violence say there is no evidence to suggest that Christians are being killed more than Muslims in Nigeria, which is roughly evenly divided between followers of the two religions.The government of Africa's most populous nation has not responded to the threat of US military action.However, Nigeria's President Bola Tinubu insisted that there was religious tolerance in the country and said the security challenges were affecting people \"across faiths and regions\".Trump wrote in a social media post on Saturday that he had instructed the US Department of War to prepare for \"possible action\".He warned that he might send the military into Nigeria \"guns-a-blazing\" unless the Nigerian government intervened, and said that all aid to what he called \"the now disgraced country\" would be cut.Trump added: \"If we attack, it will be fast, vicious, and sweet, just like the terrorist thugs attack our CHERISHED Christians!\"Secretary of State for War Pete Hegseth replied to the post by writing: \"Yes sir.\"The Department of War is preparing for action. Either the Nigerian Government protects Christians, or we will kill the Islamic Terrorists who are committing these horrible atrocities.\"Trump earlier announced that he had declared Nigeria a \"Country of Particular Concern\" because of the \"existential threat\" posed to its Christian population. He said \"thousands\" had been killed, without providing any evidence.This is a designation used by the US State Department that provides for sanctions against countries \"engaged in severe violations of religious freedom\".Following this announcement, Tinubu said his government was committed to working with the US and the international community to protect communities of all faiths.\"The characterisation of Nigeria as religiously intolerant does not reflect our national reality,\" the Nigerian leader said in a statement.Jihadist groups such as Boko Haram and Islamic State West Africa Province have wrought havoc in north-eastern Nigeria for more than a decade, killing thousands of people - however most of these have been Muslims, according to Acled, a group which analyses political violence around the world.In central Nigeria, there are also frequent clashes between mostly Muslim herders and farming groups, who are often Christian, over access to water and pasture. Deadly cycles of tit-for-tat attacks have also seen thousands killed, but atrocities have been committed on both sides and human rights group say there is no evidence that Christians have been disproportionately targeted.Trump has frequently expressed satisfaction over not having embroiled the US in a war during his tenure, and has cast himself as a peace-making president.But the Republican leader is facing a growing number of voices domestically, particularly from the political right, who have drawn attention to the situation in Nigeria.Additional reporting by Chris Ewokor in Abuja",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump tells military to plan for 'action' over his claim that Nigeria allows killing of Christians",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b7de/live/58bad5e0-b7d2-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-11-02T12:07:25.000Z",
      "dateModified": "2025-11-02T12:07:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tanzania election: Samia Suluhu Hassan wins vote as hundreds feared dead in unrest",
    "url": "https://www.bbc.com/news/articles/cm2ww0e0jewo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/79ba/live/230fab30-b6e9-11f0-8541-9720c7d6d108.jpg",
    "tag": "World",
    "date": "2025-11-01T14:11:26.000Z",
    "description": "President Samia Suluhu Hassan has been declared the winner of Tanzania's presidential election, securing another term amid days of unrest across the c",
    "body": "President Samia Suluhu Hassan has been declared the winner of Tanzania's presidential election, securing another term amid days of unrest across the country.Samia won 98% of the votes in Wednesday's poll, the electoral commission said. In her Saturday victory speech she said the election was \"free and democratic\", accusing protesters of being \"unpatriotic\".Opposition parties rejected the results,  calling the vote a mockery of the democratic process as Samia's main challengers had been either imprisoned or barred from running.International observers have expressed concern over the lack of transparency and widespread turmoil that has reportedly left hundreds of people dead and injured.The nationwide internet shutdown is making it difficult to verify the death toll.The government has sought to play down the scale of the violence - and authorities have extended a curfew in a bid to quell the unrest.Receiving her victory certificate on Saturday, Samia, 65, said: \"We thank the security forces for ensuring that the violence did not stop voting. \"The government strongly condemns the violent incidents. These incidents were not patriotic at all,\" she said.Earlier on Saturday, electoral commission chief Jacobs Mwambegele declared Samia \"the winner of the presidential election\".Samia secured about 31.9 million votes, or 97.66% of the total, with turnout nearing 87% of the country's 37.6 million registered voters, the electoral chief said. In Tanzania's semi-autonomous archipelago of Zanzibar - which elects its own government and leader - CCM's Hussein Mwinyi, who is the incumbent president, won with nearly 80% of the vote.The opposition in Zanzibar said there had been \"massive fraud\", the AP news agency reported.Why elections are a time of fear for albino TanzaniansNo protests were reported on Saturday morning, but tension remained high in Dar es Salaam, where security forces manned roadblocks across the port city.On Friday demonstrators Dar es Salaam and other cities took to the streets, tearing down Samia's posters and attacking police and polling stations despite warnings from the army chief to end the unrest.The demonstrations are mostly led by young protesters, who have denounced the election as unfair.They accuse the government of undermining democracy by suppressing the main opposition leaders - one is in jail and another was excluded on technical grounds.A spokesperson from the opposition Chadema party on Friday told AFP news agency that \"around 700\" people had been killed in clashes with security forces, while a diplomatic source in Tanzania told the BBC there was credible evidence that at least 500 people had died.Foreign Minister Mahmoud Kombo Thabit has described the violence as a \"few isolated pockets of incidents here and there\" and said \"security forces acted very swiftly and decisively to address the situation\".In a statement, the UN chief Antonio Guterres said he was  \"deeply concerned\" about the situation in Tanzania, \"including reports of deaths and injuries during the demonstrations\". He urged all parties involved to \"prevent further escalation\".The UK, Canada and Norway have expressed similar concerns, citing \"credible reports of a large number of fatalities and significant injuries, as a result of the security response to protests\".There were two main opposition contenders - Tundu Lissu, who is being held on treason charges, which he denies, and Luhaga Mpina of the ACT-Wazalendo party - but he was excluded on legal technicalities.Sixteen fringe parties, none of whom have historically had significant public support, were allowed to run.Samia's ruling party Chama Cha Mapinduzi (CCM), and its predecessor Tanu, have dominated the country's politics and have never lost an election since independence.Ahead of the election, rights groups condemned government repression, with Amnesty International citing a \"wave of terror\" involving enforced disappearances, torture, and extrajudicial killings of opposition figures.The government rejected the claims, and officials said the election would be free and fair.Samia came into office in 2021 as Tanzania's first female president following the death of President John Magufuli.Additional reporting by Akisa Wandera in Nairobi",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tanzania election: Samia Suluhu Hassan wins vote as hundreds feared dead in unrest",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/79ba/live/230fab30-b6e9-11f0-8541-9720c7d6d108.jpg"
      ],
      "datePublished": "2025-11-01T14:11:26.000Z",
      "dateModified": "2025-11-01T14:11:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sudan war: More than 60,000 flee el-Fasher after its capture by RSF militia, UN says",
    "url": "https://www.bbc.com/news/articles/c0qppe4vdevo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5b6d/live/b14320f0-b679-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-10-31T18:01:15.000Z",
    "description": "2 days agoAnbarasan Ethirajan,Global affairs reporter and Natasha BootyMore than 60,000 people have fled the Sudanese city of el-Fasher, which was cap",
    "body": "2 days agoAnbarasan Ethirajan,Global affairs reporter and Natasha BootyMore than 60,000 people have fled the Sudanese city of el-Fasher, which was captured by the paramilitary Rapid Support Forces (RSF) over the weekend, according the UN refugee agency. There have been reports of mass executions and crimes against humanity as the RSF fighters stormed the city after an 18-month siege marked by starvation and heavy bombardment.The flow of those fleeing the violence towards the town of Tawila, about 80km (50 miles) west of el-Fasher, had increased in the past few days, the UNHCR's Eujin Byun told the BBC.They were narrating horrendous stories of atrocities, including rape, and the agency was struggling to find enough shelter and food for them, she said.But the RSF has detained one of its militiamen, Abu Lulu, who has been accused of summary executions.The group shared footage showing the fighter's arrest after BBC Verify identified him as being responsible for the execution of multiple unarmed men near el-Fasher.TikTok has confirmed to the BBC that it has banned the account associated with Lulu. It is not clear whether he had controlled the account in his name.Sudan was plunged into a civil war in April 2023 after a vicious struggle for power broke out between its army and the RSF.It has led to a famine and claims of a genocide in the western Darfur region.More than 150,000 people have died in the conflict across the country, and about 12 million have fled their homes in what the UN has called the world's largest humanitarian crisis.The takeover of el-Fasher reinforces the geographic split in the country, with the RSF now in control of western Sudan and much of neighbouring Kordofan to the south, and the army holding the capital, Khartoum, central and eastern regions along the Red Sea.The two warring rivals had been allies - coming to power together in a coup in 2021 - but fell out over an internationally backed plan to move towards civilian rule.Additional reporting by Merlyn Thomas",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sudan war: More than 60,000 flee el-Fasher after its capture by RSF militia, UN says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5b6d/live/b14320f0-b679-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-31T18:01:15.000Z",
      "dateModified": "2025-10-31T18:01:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anger lingers in Serbia a year after train station tragedy",
    "url": "https://www.bbc.com/news/articles/ckgkk841r4eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7d88/live/96db54a0-b7b7-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "World",
    "date": "2025-11-01T20:27:57.000Z",
    "description": "16 hours agoGuy DelauneyBalkans correspondent, in Novi SadWatch: Video shows aftermath of railway station roof collapse in SerbiaA sea of people flowe",
    "body": "16 hours agoGuy DelauneyBalkans correspondent, in Novi SadWatch: Video shows aftermath of railway station roof collapse in SerbiaA sea of people flowed along the roads leading up to Novi Sad railway station.They came in their tens of thousands to remember the 16 people who died there this time last year, on another unseasonably warm and sunny autumn day.The victims were standing or sitting underneath a concrete canopy at the recently-renovated facility, when it collapsed. The two youngest were just six years old, the oldest, 77.Regular protests have rocked Serbia in the 12 months that have followed. But on Saturday morning, the huge crowd participated in an event that put the emphasis on quiet commemoration.At 11:52 (10:52 GMT), the time of the disaster, they observed a silence for 16 minutes - one for each of the victims. Family members cried. One woman needed to be physically supported by men wearing the red berets of armed forces veterans.After the silence, relatives laid flowers at the front of the station. The rubble of the collapsed canopy has been cleared away, but otherwise the building appears to have remained untouched since the disaster.Twisted metal protruding from the walls and broken glass still offer evidence of the catastrophe.Fourteen dead in Serbia railway station canopy collapseFury over Serbia station tragedy prompts first arrestsAnadolu via Getty ImagesHuge protests have been held against the government since the accidentNovi Sad station was supposed to be a symbol of Serbia's progress, under President Aleksandar Vučić's Progressive Party. The country's second city would be a key stop on the high-speed railway line whipping passengers from Belgrade to Budapest in less than three hours.Vučić and Hungary's Prime Minister Viktor Orban jointly opened the renovated facility in 2022. Its angular, Yugoslav-era form had been upgraded as part of the high-speed project.But now, after another renovation and the disaster that followed, the station stands as the prime example of everything that is wrong in Serbia.For the government's flagship infrastructure project to prove deadly to its citizens was more than many people could bear. They took to the streets, carrying placards reading \"corruption kills\".University students quickly took leadership. Getty ImagesFamilies of those who died at Novi Sad laid flowers at the train stationAnti-government demonstrations are not exactly a novelty in Serbia, but in contrast to previous movements which fizzled out, the student-led anti-corruption protests have persisted.\"Every other protest movement was organised by political opposition parties and people in Serbia don't trust them,\" says Aleksa, a 23-year-old management student at Novi Sad University.\"We are the most trusted group in the country - that's why, even though we have made mistakes, people believe in us.\"The students have shunned the opposition parties. After initially demanding accountability from the authorities, they are now calling for fresh elections.They plan to submit a list of independent, expert candidates who could run a technocratic government. This would, they say, be the best way to rid Serbian institutions of the cronyism and corruption which they hold responsible for the railway station disaster.In September, 13 people, including former construction, infrastructure and Transport Minister Goran Vesić, were charged in a criminal case over the collapse.A resolution in the European Parliament last month called for full and transparent legal proceedings and an assessment \"of potential corruption or negligence\" - underlining the \"need to examine more broadly the extent to which corruption led to the lowering of safety standards and contributed to this tragedy\".The government has denied accusations of corruption.Students are more trusted in Serbia than opposition parties, says AleksaThe student protesters' approach has gained the respect of some opposition leaders.\"They showed integrity and perseverance,\" says Biljana Djordjević, an MP and co-leader of the Green-Left Front.\"The new generation have found their way of participating, that is the difference this time. They have cut across generations in the families, we always wanted them to be more vocal, and now they are.\"Political scientist Srdjan Cvijić, from the Belgrade Centre for Security Policy, believes the students have cut through in a way that Serbia's opposition parties simply could no longer do.\"Until last year, the regime had been effectively managing to render traditional politics disgusting to the overall population,\" he says.\"They haven't managed to do so with the student movement and the result is that the student movement has managed to pierce into the traditional electorate of the ruling party in a way that nobody previously managed to do.\"Perhaps this explains a sudden change in tone from President Vučić. He has generally taken a combative line with the protesters, accusing them of attempting a \"colour revolution\" - the kind of popular movements that were behind pro-European protests which toppled governments in European countries in earlier years.  These changes in former Soviet republics in the early years of the 21st Century pushed the likes of Georgia and Ukraine in a pro-EU direction.But on the eve of the commemoration, Vučić apologised for his fiery rhetoric towards protesters, claiming that he had \"said some things that I am now sorry for saying\".The students responded dismissively. They told the president, \"You have blood on your hands.\"This day may have been about respect and remembrance. But the anger remains.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anger lingers in Serbia a year after train station tragedy",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7d88/live/96db54a0-b7b7-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-11-01T20:27:57.000Z",
      "dateModified": "2025-11-01T20:27:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sudan war: A boy's escape from el-Fasher amid accusations of spying",
    "url": "https://www.bbc.com/news/articles/clyk1nq6v4lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/052b/live/90f93950-b670-11f0-bb84-5d792dcc8544.jpg",
    "tag": "World",
    "date": "2025-11-01T01:02:54.000Z",
    "description": "'I was accused of spying and beaten' - a boy's escape from captured Sudan city1 day agoBushra Mohamed and Akisa Wandera,BBC AfricaAFP via Getty Images",
    "body": "'I was accused of spying and beaten' - a boy's escape from captured Sudan city1 day agoBushra Mohamed and Akisa Wandera,BBC AfricaAFP via Getty ImagesPeople are arriving in Tawila after having travelled on foot for three daysTwelve-year-old Abdiwahab - not his real name - sobs as he recounts what happened to him as he escaped from the western Sudanese city of el-Fasher.The young boy left el-Fasher on Sunday as it fell to the paramilitary Rapid Support Forces (RSF), the paramilitary group that has been fighting a two-and-a-half-year civil war against the army.In a video received by the BBC, his face reflects deep sorrow and fatigue, his voice low as he describes being assaulted \"many times\" by RSF fighters. Fearing reprisal attacks from RSF fighters, Abdiwahab had joined a wave of people - including some of his family - trying to get out.The UN estimates that 60,000 have managed to get out of el-Fasher with many narrating horrendous stories of atrocities, including rape.'We saw people murdered in front of us' - siege survivors speak to the BBCNew videos show executions after RSF militia takes key Sudan cityA simple guide to what is happening in SudanAfter three days of walking Abdiwahab reached the relative safety of Tawila - an 80km (50-mile) journey - but he arrived on his own.''I left the city with my father and siblings but because of the chaos we were separated, I came to Tawila alone,\" he says on the video.He was assaulted on the way and accused of being involved in espionage.\"I walked along the road, and on the road, [the RSF] caught me, many times. They beat me and hit me, saying, 'this little boy is a spy'.\"This chimes with other accounts of how men and boys are especially at risk as they face arbitrary arrest, violence and summary execution.Abdiwahab says that RSF fighters had already taken his mother and one of his sisters about a month ago, and he does not know if they are still alive.Ali, not his real name, who is now a volunteer aid worker after fleeing el-Fasher himself a fortnight ago, was the one who filmed Abdiwahab's account.He is stationed at the entrance to Tawila where a temporary camp has been established and where new arrivals gather before being relocated to permanent camps inside the town.In a voice note to the BBC explaining the context, Ali's words were almost drowned out by the noise and chaos at the camp.\"[Abdiwahab] keeps asking me about his parents. I decided to take him home until we found them,\" Ali says.He noticed how the boy was traumatised, fearing that any light appearing at night was an RSF vehicle coming to get him.\"He saw a light in the distance and held me tight, screaming. He froze.\"ReutersAid agencies are overwhelmed by the number of people who need helpAli says each new arrival to the camp carries a story of survival and despair.There are many unaccompanied minors, including children who lost their parents on the road, coming in every day.\"Just yesterday, twin children around 10 years old arrived with a woman who said their parents had died on the way,\" the volunteer aid worker says.\"The situation is terrifying. People continue arriving with many conditions, some with injuries and malnutrition. Those who arrived are begging us to go and save the people on the road, because many are dying trying to come to Tawila,\" Ali says.Survivors spoke of \"passing dead bodies scattered along the road and hearing the cries of the wounded calling for help\".But even relief work has become deadly.Ali says the organisations operating in Tawila are afraid to leave the town after five Red Crescent volunteers were killed in another state earlier this week.\"They are waiting for assurances and confirmation that the situation is safe,\" he says.Many mothers arriving in Tawila are in desperate need of food, water and medical help, according to the charity Save the Children.Some women reported being attacked by armed men on motorbikes and robbed as they fled.\"Women who managed to escape with their children as fighting raged made it to Tawila without food or water. They are now entirely dependent on already stretched humanitarian assistance,\" the aid agency said in a statement.The UN's refugee agency has said it was struggling to find enough shelter and food for civilians seeking refuge in the town.But not everyone is making it out of el-Fasher, where there have been reports of mass killings.This week, RSF leader Gen Mohamed Hamdan Dagalo admitted to \"violations\" in the city and said they would be investigated. A senior UN official has said that the RSF had given notice that they had arrested some suspects.Estimates vary as to how many civilians are still strapped in the city.Save the Children puts it at more than 260,000 people, including an estimated 130,000 children, who have to contend with famine-like conditions, the collapse of health services and no safe route out.More BBC stories on the conflict:Reports of mass killings in Sudan have echoes of its dark pastMy son's whole body is full of shrapnelRare footage shows plight of civilians in besieged Sudan cityLast surgeons standing in city's only hospitalBBC smuggles in phones to reveal hunger and fearGetty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sudan war: A boy's escape from el-Fasher amid accusations of spying",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/052b/live/90f93950-b670-11f0-bb84-5d792dcc8544.jpg"
      ],
      "datePublished": "2025-11-01T01:02:54.000Z",
      "dateModified": "2025-11-01T01:02:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "I blew the whistle on a massive tax fraud - and they sued me",
    "url": "https://www.bbc.com/news/articles/c2kp19ed78wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/de0f/live/2aef0270-9f8c-11f0-b741-177e3e2c2fc7.jpg",
    "tag": "World",
    "date": "2025-11-02T08:20:00.000Z",
    "description": "4 hours agoTheo LeggettBusiness CorrespondentJas BainsJas Bains alerted Danish authorities to a £1bn tax scam and they hit him with a lawsuit\"We'd be ",
    "body": "4 hours agoTheo LeggettBusiness CorrespondentJas BainsJas Bains alerted Danish authorities to a £1bn tax scam and they hit him with a lawsuit\"We'd be met at airports in 20-foot limousines, and taken to places like the Atlantis hotel in Dubai or the Singapore Grand Prix. There'd be a hundred grand spent in the bar.\"In 2013, Jas Bains was an ambitious young lawyer, enjoying the high life that came with working for an extremely profitable City hedge fund.Today, he is jobless and has lost most of his wealth, having spent years fighting legal battles and attempting to clear his name of association with a huge tax scam.The irony, he says, is that he blew the whistle on the scam in the first place – only to find himself one of the targets of a £1.4bn lawsuit.He is reflecting one month after the case ended, bringing to a close eight years of legal arguments and one of the highest value civil cases ever heard in the UK.The Danish tax authority was left licking its wounds, after failing to establish that a large group of defendants, including Mr Bains, were liable for huge losses it had suffered.It all began in 2009, when a banker named Sanjay Shah established a London-based hedge fund called Solo Capital. It also had offices in Dubai. It was one of a network of funds, banks and legal outfits that were to become heavily implicated in the so-called cum-ex trade.This focused on transactions where shares were sold from one investor to another immediately before the payment of a dividend (cum, or with, dividend) but delivered afterwards (ex-dividend).Those involved exploited delays in processing the sale to create confusion over who actually owned the shares at the moment when the dividend was paid. This tactic allowed both parties to claim rebates on withholding tax - a levy which had only been paid once, when the dividend was issued.From the outside, it was complicated, but for those involved it led to ever bigger and more elaborate trades which ultimately cost taxpayers across Europe billions.It initially became popular in Germany, before spreading to other countries including France, Belgium, Italy and Austria. Solo Capital targeted Denmark, with the bulk of its cum-ex trades taking place from 2013 onwards.Jas Bains joined the company in 2010, as its head lawyer, but went on to run the London office. At the time, Solo was \"a successful firm, making money in five or six different areas pretty well\".Getty ImagesSanjay Shah was imprisoned in Denmark in a separate criminal trial last year And making money meant enjoying the high life, with staff going on sprees to places like Las Vegas, Singapore and Dubai.\"What I will say about Sanjay is he knew how to throw a party,\" he says.\"One time we were in the Ku De Ta club at the Marina Bay Sands Hotel in Singapore. He bought 20 bottles of vintage Dom Perignon champagne, and people were just spraying each other with the stuff.\"People have likened it to Wolf of Wall Street and such like.\"It didn't end there. \"Sanjay organised private concerts in Dubai with Prince. A small room with him and his friends at three or four million dollars for an evening ... private concerts with Snoop Dogg.\"By mid-2014, however, Mr Bains had fallen out with his boss and left the company for a competitor. At the time, the cum-ex transactions targeting Denmark were dramatically picking up.\"I was hearing from people who'd left Solo that Sanjay was doing some big trades in 2014, but look, I'd moved on, it didn't have much to do with me,\" he says.\"But then I heard, actually Sanjay made close to €100m in trades from Denmark in 2013, closer to €250m in 2014 and he was looking for a billion in 2015.\"Alarm bells were ringing.Jas BainsAt the height of his career Jas Bains enjoyed living the high life in Las Vegas, Singapore and Dubai.\"I thought this can't be right. It's not that I thought the trades were invalid or criminal in some way. It's just any country that has a billion Euros syphoned off it will scream bloody murder.\"Solo Capital wasn't the only company now targeting Denmark. Others were getting in on the act. Jas believed it was only a matter of time before the house of cards came tumbling down.\"I was quite confident I'd done nothing wrong, but I knew if this carried on and blew up in spectacular style, I was going to get pulled in,\" he explains.With that in mind, in 2015, he decided to blow the whistle.He contacted a Danish lawyer, who in turn put him in touch with the Danish police. He went on to spend two and a half years assisting them with understanding how the cum-ex scam worked.Danish prosecutors did not target Mr Bains. Their attention was focused firmly on Mr Shah. The 54-year-old was eventually extradited from Dubai to face fraud charges – and in December last year was sentenced to 12 years in jail.It was the heaviest penalty ever handed out in Denmark for a fraud case. He is currently appealing.'Impossible to get a job'But when the Danish tax authority, Skatteforvaltningen (Skat), launched its huge case, seeking to recover its lost money, Mr Bains was one of the more than 100 individual and corporate defendants initially targeted - alongside Mr Shah.With that lawsuit hanging over him it became out of the question for him to work as a lawyer, or to get a role in the City of London. \"It's impossible to get a job if you're being sued as part of a two billion dollar international tax fraud case,\" he says.However, in October, High court judge Mr Justice Andrew Baker threw out Skat's claims.Acknowledging that \"greed can be a powerful motive, and I consider there was substantial greed here\", he nevertheless concluded that Skat has failed to prove it was a victim of deception.The authority's \"controls for assessing and paying dividend tax refund claims were so flimsy as to be non-existent,\" he said.That seemed to echo a statement previously made by Mr Shah in a 2021 German TV interview, which was also cited in the ruling:\"Why would they pay out for years and years and then, after four years of payments they say, 'Oh, we made a mistake, or we were cheated'\", he said.\"If there's a big sign on the street saying 'please help yourself', then me or somebody else would go and help themselves.\"There may still be an appeal. But for Mr Bains, the ruling provided some much-needed closure – and, he says, a chance to move on.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "I blew the whistle on a massive tax fraud - and they sued me",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/de0f/live/2aef0270-9f8c-11f0-b741-177e3e2c2fc7.jpg"
      ],
      "datePublished": "2025-11-02T08:20:00.000Z",
      "dateModified": "2025-11-02T08:20:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Molecule: The dangerous weight-loss drug that went viral on Russian TikTok",
    "url": "https://www.bbc.com/news/articles/c201xe61x0lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/eb01/live/aaa06120-b3e7-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-11-02T00:07:32.000Z",
    "description": "Young Russians are being seduced by a cheap, dangerous weight-loss pill called Molecule12 hours agoSofya VolyanovaBBC News Russian Maria22-year-old Ma",
    "body": "Young Russians are being seduced by a cheap, dangerous weight-loss pill called Molecule12 hours agoSofya VolyanovaBBC News Russian Maria22-year-old Maria suffered serious side effects after trying the unlicensed weight loss drug promoted on TikTokMolecule, a pill promising rapid weight loss, went viral on Russian TikTok earlier this year.Young people's feeds started filling up with captions like \"Take Molecule and forget food exists\", and \"Do you want to sit in the back of the class in oversized clothes?\"Clips showed fridges lined with blue boxes featuring holograms and \"Molecule Plus\" labels.The orders began piling in, as teenagers shared their \"weight-loss journeys\" on social media.But there was a catch.Maria, 22, had purchased the pill from a popular online retailer. She took two pills per day and, after two weeks, says her mouth dried up and she completely lost her appetite.\"I had absolutely no desire to eat, let alone drink. I was nervous. I was constantly biting my lips and chewing my cheeks.\"Maria developed severe anxiety and began having negative thoughts. \"These pills were having a profound effect on my psyche,\" she says.Maria, who lives in St Petersburg, says she wasn't prepared for such severe side effects.Other TikTok users mentioned dilated pupils, tremors and insomnia. And at least three schoolchildren are reported to have ended up in hospital.TikTokClips shared on TikTok show fridges lined with soft drinks and blue boxes of MoleculeIn April, a schoolgirl in Chita, Siberia, needed hospital care after overdosing on Molecule. According to local reports, she was trying to lose weight quickly, in time for the summer.The mother of another schoolgirl told local media her daughter was admitted to intensive care after taking several pills at once.And in May, a 13-year-old boy from St Petersburg needed hospital care after experiencing hallucinations and panic attacks. He had reportedly asked a friend to buy him the pill because he was being teased at school about his weight.Substance banned in UK, EU and USThe packaging for Molecule pills often lists \"natural ingredients\" such as dandelion root and fennel seed extract.But earlier this year, journalists at the Russian newspaper Izvestiya submitted pills they had purchased online for testing and found they contained a substance called sibutramine.TikTokThe pills contain a substance called sibutramine, which is banned in many countriesFirst used as an antidepressant in the 1980s and later as an appetite suppressant, studies later found sibutramine increased the risk of heart attacks and strokes - while only slightly promoting weight loss.It was banned in the US in 2010, and is also illegal in the UK, EU, China and other countries.In Russia, it is still used to treat obesity, but available only to adults and by prescription. Purchasing and selling sibutramine without a prescription is a criminal offence. But that hasn't stopped individuals and small businesses from selling it online - often in higher doses than legal medication - and without requiring prescriptions.The unlicensed pills cost about £6-7 ($8-9) for a 20-day supply - much cheaper than recognised weight-loss injections like Ozempic, which on the Russian market sell for £40-160 ($50-210) per monthly pen.\"Self-administration of this drug is very unsafe,\" says endocrinologist Ksenia Solovieva from St Petersburg, warning of potential overdose risks, \"because we do not know how much of the active ingredient such 'dietary supplements' may contain\".TikTokTeenagers and young people order unlicensed weight loss pills sold as dietary supplements from popular marketplacesRussians regularly receive prison sentences for purchasing and reselling Molecule pills. But it's proving difficult for authorities to get a grip on the drug being sold illegally.In April, the government-backed Safe Internet League reported the growing trend involving young people to the authorities - prompting several major online marketplaces to remove Molecule from sale. But it soon began appearing online under a new name, Atom, in near-identical packaging.A law was recently passed allowing authorities to block websites selling \"unregistered dietary supplements\" without a court order - but sellers have been getting around this by categorising them as \"sports nutrition\" instead.On TikTok, you can find retailers selling Molecule under listings that look like they are for muesli, biscuits and even lightbulbs. And some retailers aren't even trying to hide it any more.A few weeks ago, the BBC found Molecule listings on a popular Russian online marketplace. When approached for comment, the site said it had promptly removed any products containing sibutramine. But it admitted it was difficult to find and remove listings that didn't explicitly mention sibutramine.If you do manage to get your hands on Molecule, it's hard to know exactly what you're getting - and it's unclear where the pills are being manufactured.The BBC found some sellers with production certificates from factories in Guangzhou and Henan, in China. Others claim to be sourcing the pills from Germany.Some packets state they were produced in Remagen in Germany - but the BBC has discovered there is no such company listed at the address given.Certain Kazakh vendors selling Molecule to Russians told the BBC they bought stock from friends or warehouses in the capital Astana but couldn't name the original supplier.Details of support with eating disorders in the UK are available at BBC Action Line Meanwhile, online eating-disorder communities have become spaces where Molecule is promoted, with users relying on hashtags and coded terms to slip past moderation.Ms Solovieva says Molecule is particularly harmful when taken by young people who already have eating disorders. For those in or near relapse, an easily available appetite suppressant can be seriously dangerous, she says.Anna Enina, a Russian influencer with millions of followers who herself has admitted using unlicensed weight-loss pills in the past, publicly warned her subscribers: \"As someone who has struggled with an eating disorder... the consequences will be dire. You'll regret it tenfold.\"Maria from St Petersburg now discourages others from trying MoleculeTwenty-two-year old Maria suffered bad side effects, and is one of those who regrets it. After taking too many Molecule pills, she was sent to hospital.Now she discourages other young women and girls from taking the pills in weight-loss forums. She even reached out to one teenage user's parents to alert them.But Molecule remains popular online.And every video that appears on Maria's TikTok feed is a reminder of the pills that made her sick.More weekend picks",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Molecule: The dangerous weight-loss drug that went viral on Russian TikTok",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/eb01/live/aaa06120-b3e7-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-11-02T00:07:32.000Z",
      "dateModified": "2025-11-02T00:07:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Egypt's Grand Museum opens, displaying Tutankhamun tomb in full for first time",
    "url": "https://www.bbc.com/news/articles/ckg4q403rpzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4234/live/32740f10-b66e-11f0-bb84-5d792dcc8544.jpg",
    "tag": "World",
    "date": "2025-11-01T18:39:38.000Z",
    "description": "18 hours agoYolande Knell,Middle East correspondent, in Cairo, and Wael Hussein,in CairoGetty ImagesThe new museum will show all of the artefacts disc",
    "body": "18 hours agoYolande Knell,Middle East correspondent, in Cairo, and Wael Hussein,in CairoGetty ImagesThe new museum will show all of the artefacts discovered by Howard Carter and his team in the tomb of Tutankhamun Near one of the Seven Wonders of the Ancient World - the Great Pyramid of Khufu at Giza - Egypt has officially opened what it intends as a cultural highlight of the modern age.The Grand Egyptian Museum (GEM), described as the world's largest archaeological museum, is packed with some 100,000 artefacts covering some seven millennia of the country's history from pre-dynastic times to the Greek and Roman eras.Prominent Egyptologists argue that its establishment strengthens their demand for key Egyptian antiquities held in other countries to be returned – including the famed Rosetta Stone displayed at the British Museum.A main draw of the GEM will be the entire contents of the intact tomb of the boy king Tutankhamun, displayed together for the first time since it was found by British Egyptologist Howard Carter. They include Tutankhamun's spectacular gold mask, throne and chariots.Watch: Pharaoh drone display and fireworks mark opening of Egypt's Grand MuseumReutersThe museum is packed with some 100,000 artefacts, including a statue of King Ramses II\"I had to think, how can we show him in a different way, because since the discovery of the tomb in 1922, about 1,800 pieces from a total of over 5,500 that were inside the tomb were on display,\" says Dr Tarek Tawfik, president of the International Association of Egyptologists and former head of the GEM.\"I had the idea of displaying the complete tomb, which means nothing remains in storage, nothing remains in other museums, and you get to have the complete experience, the way Howard Carter had it over a hundred years ago.\"Costing some $1.2bn (£910m; €1.1bn), the vast museum complex is expected to attract up to 8m visitors a year, giving a huge boost to Egyptian tourism which has been hit by regional crises.\"We hope the Grand Egyptian Museum will usher in a new golden age of Egyptology and cultural tourism,\" says Ahmed Seddik, a guide and aspiring Egyptologist by the pyramids on the Giza Plateau.Apart from the Tutankhamun exhibit and a new display of the spectacular, 4,500-year-old funerary boat of Khufu - one of the oldest and best-preserved vessels from antiquity - most of the galleries at the site have been opened to the public since last year.\"I've been organising so many tours to the museum even though it was partially open,\" Ahmed continues. \"Now it will be at the pinnacle of its glory. When the Tutankhamun collection opens, then you can imagine the whole world will come back, because this is an iconic Pharoah, the most famous king of all antiquity.\"\"It's an absolute must-see,\" says Spanish tourist, Raúl, who is awaiting the full public opening on 4 November. \"We're just waiting to go and check out all of the Egyptian artefacts,\" says Sam from London, who is on an Egypt tour. \"It's a once in a lifetime opportunity.\"Getty ImagesThe majority of the museum, including the Grand Staircase, has been open to the public since last yearAnother British tourist says she previously saw the Tutankhamun exhibits on display at the neoclassical Egyptian Museum in bustling Tahrir Square. \"The old museum was pretty chaotic, and it was a bit confusing,\" she comments. \"Hopefully the Grand Museum will be a lot easier to take in and I think you will just get more out of it.\"The new museum is colossal, spanning 500,000 square metres (5.4m sq ft) – about the size of 70 football pitches. The exterior is covered in hieroglyphs and translucent alabaster cut into triangles with a pyramid shaped entrance.Among the GEM showstoppers are a 3,200-year-old, 16m-long suspended obelisk of the powerful pharaoh, Ramesses II, and his massive 11m-high statue. The imposing statue was moved from close to the Cairo railway station in 2006, in a complex operation in preparation for the new institution.A giant staircase is lined with the statues of other ancient kings and queens and on an upper floor a huge window offers a perfectly framed view of the Giza pyramids.The museum was first proposed in 1992, during the rule of President Hosni Mubarak, and construction began in 2005.  It has now taken nearly as long to complete as the Great Pyramid, according to estimates.ReutersThe vast complex is expected to attract up to eight million visitors a yearThe project was hit by financial crises, the 2011 Arab Spring – which deposed Mubarak and led to years of turmoil - the Covid-19 pandemic, and regional wars.\"It was my dream. I'm really happy to see this museum is finally opened!\" Dr Zahi Hawass, Egypt's former long-time minister of tourism and antiquities, tells the BBC. The veteran archaeologist says it shows that Egyptians are equals of foreign Egyptologists when it comes to excavations, preservation of monuments and curating museums.\"Now I want two things: number one, museums to stop buying stolen artefacts and number two, I need three objects to come back: the Rosetta Stone from the British Museum, the Zodiac from the Louvre and the Bust of Nefertiti from Berlin.\"Dr Hawass has set up online petitions – attracting hundreds of thousands of signatures – calling for all three items to be repatriated.The Rosetta Stone, found in 1799, provided the key to deciphering hieroglyphics. It was discovered by the French army and was seized by the British as war booty.  A French team cut the Dendera Zodiac, an ancient Egyptian celestial map, from the Temple of Hathor in Upper Egypt in 1821. Egypt accuses German archaeologists of smuggling the colourfully painted bust of Nefertiti, wife of Egyptian pharaoh Akhenaten, out of the country more than a century ago.\"We need the three objects to come as a good feeling from these three countries, as a gift, as Egypt gave the world many gifts,\" Dr Hawass says.Getty ImagesThe Dendera Zodiac is currently in the Louvre but the opening of the Grand Egyptian Museum has renewed calls for it to be returnedAnother leading Egyptologist, Dr Monica Hanna, names the same objects, \"taken under a colonialist pretext\", as ones which must be repatriated. She adds: \"The GEM gives this message that Egypt has done its homework very well to officially ask for the objects.\"The British Museum told the BBC that it had received \"no formal requests for either the return or the loan of the Rosetta Stone from the Egyptian Government\".Egyptian Egyptologists voice their excitement about the new museum becoming a centre for academic research, driving new discoveries.Already, Egyptian conservators based there have painstakingly restored items belonging to Tutankhamun, including his impressive armour made of textiles and leather. According to Egyptian law, such restorations can only be done by Egyptians.\"Colleagues from around the world have been in awe of the fantastic conservation work that has been done,\" says Dr Tawfik, adding that the entire project is a source of great national pride. \"As well as ancient Egyptian history, we are also showcasing modern Egypt because it's Egypt that built this museum.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Egypt's Grand Museum opens, displaying Tutankhamun tomb in full for first time",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4234/live/32740f10-b66e-11f0-bb84-5d792dcc8544.jpg"
      ],
      "datePublished": "2025-11-01T18:39:38.000Z",
      "dateModified": "2025-11-01T18:39:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tracking the ICE tactics used in Trump's mass deportation drive",
    "url": "https://www.bbc.com/news/videos/c6299nrj76yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bd5c/live/035a7e20-b70f-11f0-aa13-0b0479f6f42a.png",
    "tag": "World",
    "date": "2025-11-02T05:29:22.000Z",
    "description": "Immigration raids have been taking place across the US since President Donald Trump entered office - as he aims to deliver on his promise to launch \"t",
    "body": "Immigration raids have been taking place across the US since President Donald Trump entered office - as he aims to deliver on his promise to launch \"the largest deportation programme\" in the country's history.The tactics being used by Immigration and Customs Enforcement, known as ICE, and other federal agencies have led to protests.BBC Verify has gathered more than 70 videos to track how Trump's crackdown has unfolded so far - as Jake Horton explains.Produced by Aisha Sembhi. Graphics by Mesut Ersoz.Additional reporting by Kayleen Devlin, Shayan Sardarizadeh, Kevin Nguyen and Olga Robinson.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tracking the ICE tactics used in Trump's mass deportation drive",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bd5c/live/035a7e20-b70f-11f0-aa13-0b0479f6f42a.png"
      ],
      "datePublished": "2025-11-02T05:29:22.000Z",
      "dateModified": "2025-11-02T05:29:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Desperation in Black River, Jamaica, after Hurricane Melissa",
    "url": "https://www.bbc.com/news/articles/c0jdd186l0go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b0d2/live/9a1bc190-b712-11f0-ba75-093eca1ac29b.jpg",
    "tag": "World",
    "date": "2025-11-01T02:10:13.000Z",
    "description": "'We need food, we have no food' - desperation takes hold in Jamaica after hurricane1 day agoBrandon Drenonin Black River, Jamaica Watch: BBC reports f",
    "body": "'We need food, we have no food' - desperation takes hold in Jamaica after hurricane1 day agoBrandon Drenonin Black River, Jamaica Watch: BBC reports from \"ground zero\" of Hurricane Melissa's destructionPeople walk along muddied roads scavenging the wreckage for food. Others jump into damaged stores in the hope of finding bottled water or other supplies. As the death toll rises, residents of Black River are still searching for loved ones while they also battle to survive, days after Hurricane Melissa made this Jamaican port city ground zero of the devastation seen across the Caribbean. Residents here say they have been living in a state of chaos the last three days since Melissa slammed into them as one of the most powerful category five storms ever recorded in the region.The fierce winds and storm surge that barrelled through here have decimated nearly everything, leaving roads unusable and a trail of destruction that has them increasingly desperate and isolated with no electricity or running water.Capsized boats lie kerbside. Brick buildings are split in half. Giant sheets of metal are twisted between tree branches. Vehicles sit in crumbled pieces. Residents who spoke to the BBC said they have seen no aid trucks in the area so far and described having to eat what food they can find in debris by the roads in the coastal town, nearly 150km (93 miles) west of the capital, Kingston. Others made their way inside battered supermarkets, taking what they could for themselves. Brandon Drenon / BBC\"We have to use whatever we see here, on the street and also in the supermarket,\" Demar Walker explained, sitting in a shaded area down the street from the store to escape the heat and 80% humidity.He said he and others had to climb into the market due to its roof caving in and took what they could. They tossed water and items to others also in need.\"We had to throw food to other people.\"Nearby, others told the BBC of a local pharmacy being looted in Black River, describing anarchy as people ran in and out carrying armfuls of drugs and alcohol.\"I saw items covered in mud being hauled out,\" Aldwayne Tomlinson told the BBC. \"At first, I thought the place was still open, but then I really got a second glance.\"I heard a lady say: 'Mi need go get some alcohol.' That's when I knew they were looting the pharmacy as well.\"Brandon Drenon / BBCDemar Walker was one of many looking for resources at a damaged store 'We need food' A short walk from the market, Jimmy Esson leaned against a massive metal beam that had been knocked to the ground.\"I lost everything, all my things,\" he said. \"We need food. We have no food.\"Survival is the primary concern on most people's minds here. The other is the rising death toll. Officials in Jamaica said on Thursday that at least 19 people had died in the country, a big jump from the five that had been counted the day before. Another 30 have died in neighbouring Haiti due to the storm.Brandon Drenon / BBCJimmy Esson says he lost everything in the storm \"My community, we have dead bodies there,\" Mr Walker said.He said he, like many others in the area, still has not heard from family and doesn't know if they made it out of the storm alive. Mr Walker is stuck in Black River, sleeping in whoever's house is still standing that will accept him, he says, while his eight-year-old son is in Westmoreland, the next parish over.Westmoreland shares Jamaica's western coast, along with Black River in the St Elizabeth parish, and was also severely damaged by Melissa.\"There's no way of getting to my family to find out if they're OK,\" he said as his eyes began to swell. Along with the unusable roads making travel difficult, there is little to no cell phone service and no electricity or running water in many hard-hit spots.Brandon Drenon / BBCDemar Walker has not been able to contact his eight-year-old son since the storm\"The entire town of Black River is devastated,\" the town's Mayor Richard Solomon has said. He noted to local media the desperation of residents who are looting and - while not condoning it - said he understood why it was happening.\"It is a delicate balance,\" Solomon said of the response to it. \"Persons are seizing the opportunity to pick up what they can off the ground [from damaged stores]. However, you have others being a little bit more forceful, where they are trying to get into people's properties to get all sorts of supplies.\"Local officials estimate that 90% of the houses here were destroyed. Much of the town's vital infrastructure has been destroyed too, including the local hospital, police station and fire station.\"There are entire communities that seem to be marooned and areas that seem to be flattened,\" Information Minister Dana Morris Dixon said.Aid supplies are starting to arrive more rapidly to the main airport in Kingston, but smaller regional airports - some of which are located near where humanitarian assistance is most needed - remain only partly operational.Aid agencies and the military are bringing in the urgently needed supplies from Kingston by land but many roads remain unpassable in places, including in places like Black River.The town is about a two-hour drive from Kingston but the main road in is - at various points - flooded, damaged and clogged with cars.Michael Tharkurdeen, a local medic, was in the town's fire station when the storm hit.\"We were upstairs, the entire bottom floor was flooded. The water was around maybe four feet going five feet. When the water came in, the seas came in, flooded everywhere,\" he said.\"Nobody could be on the bottom floor. Trust me, there were waves there about this high,\" he added, pointing to his shoulder.People who did make it to him from the flooded-out buildings nearby arrived in bad condition. They had \"lacerations on their hands, their feet\", he says. \"Kids, elders, everybody.\"Mr Tharkurdee also found a man \"lifeless\" and with \"no pulse\" once the flood waters receded.Brandon Drenon / BBC\"I'm not a doctor, I'm a medic, so I couldn't pronounce him dead,\" he said. \"All we could have done was document that and cover his body.\"By mid-afternoon on Friday, a fleet of military helicopters flew into Black River - with many hoping they came with desperately needed supplies.Armed officials carrying machine guns descended onto the streets and soon the crowds rummaging the looted pharmacy and grocery store had cleared. A line of cars that had jammed the sole road in the area had been cleared.A relative quiet replaced the noise and chaos of hundreds of people fighting for their survival.\"St Elizabeth, we want it to come back again,\" Shawn Morris said of the area's future and his hopes to get aid here.\"It's not about the money,\" he said. \"We need food and water.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Desperation in Black River, Jamaica, after Hurricane Melissa",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b0d2/live/9a1bc190-b712-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-11-01T02:10:13.000Z",
      "dateModified": "2025-11-01T02:10:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Campari shares worth €1.3bn seized by police over alleged tax evasion",
    "url": "https://www.bbc.com/news/articles/cpq11v5d1rno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/14c4/live/17bb4860-b703-11f0-ba75-093eca1ac29b.jpg",
    "tag": "World",
    "date": "2025-11-01T11:27:16.000Z",
    "description": "Shares worth €1.3bn (£1.1bn; $1.5bn) have been seized from the company that controls the manufacturer of Campari over alleged tax evasion, Italian pol",
    "body": "Shares worth €1.3bn (£1.1bn; $1.5bn) have been seized from the company that controls the manufacturer of Campari over alleged tax evasion, Italian police have said.Officials ordered the confiscation of the Campari Group shares from Luxembourg-based Lagfin as part of a year-long investigation into how it absorbed its Italian arm.It is accused of failing to pay a similar figure to that of the shares seized in taxes during that merger. The company said it had always acted according to tax laws.Campari - which also produces alcohol brands including Aperol, Grand Marnier and Courvoisier - said neither it nor its subsidiaries were involved in the case. However, chair Luca Garavoglia is among those under investigation, local media reports.Lagfin - which owns more than 50% of Campari shares and has 80% of voting rights - told the BBC in a statement that it had \"always acted in the most scrupulous respect of any applicable laws and regulations, including any Italian tax laws\".Prosecutors in Milan launched a probe into the company last year. Financial police said on Friday that they allegedly found €5.3bn of undeclared capital gains between 2018 and 2020 on which it had not paid a so-called \"exit tax\", levied on firms that transfer their headquarters abroad.It is also accused of transferring its Italian assets into foreign ownership solely for tax purposes, according to Italian financial newspaper Il Sole 24 Ore.Mr Garavoglia, the billionaire who inherited ownership of Campari from his late mother, is implicated alongside Giovanni Berto, the head of Campari's Italian branch, local media reports.Lagfin said it will \"defend itself vigorously\" in the matter, which it characterised as a \"tax dispute\".The company stressed that Campari had never been involved \"in any manner whatsoever\" in the matter, adding that, as it held 80% of Campari's voting rights, the seizure was \"absolutely unable to affect the position of Lagfin as controlling shareholder of Campari\".One of the largest global producers of spirits, Campari is valued at around €7bn on the Milan Stock Exchange.The company has its roots in 1860, when Gaspare Campari's homemade bitter liqueur became a popular tipple among patrons of his Milan bar. It became so successful that, in 1904, his family began manufacturing it commercially, and from the 1990s onwards the firm began acquiring other alcohol brands.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Campari shares worth €1.3bn seized by police over alleged tax evasion",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/14c4/live/17bb4860-b703-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-11-01T11:27:16.000Z",
      "dateModified": "2025-11-01T11:27:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mexico: Fire at shop in Hermosillo kills 23, officials say",
    "url": "https://www.bbc.com/news/articles/c0mxxm49jggo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/84c1/live/6ff195c0-b7c1-11f0-9a06-b73d4d9f63e2.png",
    "tag": "World",
    "date": "2025-11-02T09:13:14.000Z",
    "description": "3 hours agoBen HattonSonora Public Security SecretariatA fire that broke out at discount shop in Mexico has killed at least 23 people and injured 11 o",
    "body": "3 hours agoBen HattonSonora Public Security SecretariatA fire that broke out at discount shop in Mexico has killed at least 23 people and injured 11 others, local officials say.The blaze broke out on Saturday in the centre of the north-western city of Hermosillo at a branch of Waldo's - Mexico's largest discount chain.Multiple local authorities described the incident as an explosion, though regional Governor Alfonso Durazo said the exact cause had yet to be determined. The Sonora state public security secretariat said it had ruled out the possibility it was an attack or act of deliberate violence against civilians.  Children are among the victims, officials said, with a 15-year-old girl among those taken to hospital.Images from the scene show thick, black smoke billowing from the building, with the flames appearing to have spread to cars parked in front of the shop.After the fire was extinguished, scorch marks can be seen rising from the shop's doors and windows, one of which appears completely destroyed. The car immediately in front of this window is entirely burnt out.\"To the families who lost a loved one... I share your pain and offer you my full solidarity,\" Durazo said in a video address.He added that an \"extraordinary, transparent and thorough\" investigation had been launched to clarify the causes of the incident and determine who was responsible.Sonora state's Attorney General Gustavo Salas Chávez told reporters early on Sunday that most of those killed had died due to \"exposure to toxic gases\".He said there was no indication that the fire had been started intentionally, but added that he could not rule out an investigation into the cause.Mexican President Claudia Sheinbaum wrote on social media: \"My heartfelt condolences to the families and loved ones of those who lost their lives.\"Waldo's shops are a common sight on Mexico high streets, with hundreds of outlets across the country.The fire comes on the weekend when Mexico celebrates the Day of the Dead, where festivities are held for people to honour deceased loved ones.The state government said it was cancelling cultural events planned for Sunday after the incident.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mexico: Fire at shop in Hermosillo kills 23, officials say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/84c1/live/6ff195c0-b7c1-11f0-9a06-b73d4d9f63e2.png"
      ],
      "datePublished": "2025-11-02T09:13:14.000Z",
      "dateModified": "2025-11-02T09:13:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]