[
  {
    "title": "Will Hamas really relinquish control in Gaza?",
    "url": "https://www.bbc.com/news/articles/cn51w77vlp9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4908/live/348990d0-ab66-11f0-ba75-093eca1ac29b.jpg",
    "tag": "World",
    "date": "2025-10-20T20:58:30.000Z",
    "description": "Hamas ruled Gaza with an iron rod - will it really give up control?3 days agoPaul Adams,Diplomatic correspondent, Jerusalem and Rushdi Abualouf,Gaza c",
    "body": "Hamas ruled Gaza with an iron rod - will it really give up control?3 days agoPaul Adams,Diplomatic correspondent, Jerusalem and Rushdi Abualouf,Gaza correspondentBBCHow does a group that has governed the Gaza Strip for almost 20 years, ruling two million Palestinians with an iron rod and fighting Israel in repeated wars, suddenly lay down its arms and relinquish control?Judging by a steady stream of gruesome images emerging from Gaza since the ceasefire came into effect on 10 October, Hamas seems intent on reasserting its authority.Its masked men, back on the streets, have been seen beating and executing opponents. Impromptu firing squads have dispatched kneeling men they say are members of rival groups, including some of Gaza's powerful clans.Other victims, cowering in terror, are shot in the legs or beaten with heavy clubs.Some of those now being attacked by Hamas had been part of groups involved in looting and diverting aid, according to one aid worker I spoke to, exacerbating the humanitarian crisis. The UN has also accused criminal gangs of stealing aid.This is not yet a world in which, as US President Donald Trump's 20-point Gaza peace plan envisages, Hamas fighters turn over their weapons, submit to an amnesty, leave Gaza and hand over to an international stabilisation force.AFP via Getty ImagesThe ceasefire came into effect on Friday 10 October​ - Hamas and Israel have both blamed each other for blatant violations of itFor his part, President Trump initially seemed ambivalent about the brutality.On his way to Israel on 13 October, he signalled the US had given Hamas - designated a terrorist group by the US, UK, Israel and others - a green light to restore order.\"We have given them approval for a period of time,\" he told reporters aboard Air Force One.Three days later, he hardened his tone. \"If Hamas continues to kill people in Gaza, which was not the Deal,\" he wrote on Truth Social, \"we will have no choice but to go in and kill them.\"So, where does this situation on the ground in Gaza today leave Hamas? And ultimately, after two years of war that has resulted in unparalleled suffering for its own people and the violent death of most of its key figures, what, if anything, does the future really hold for the group?'A complete loss of law and order'For many Gazans, traumatised and exhausted by two years of perpetual suffering - and a war that has killed 68,000 people in Gaza according to the Hamas-run Health Ministry - this ugly endgame is nerve-wracking, but doesn't come as a surprise.Of the Gazans I spoke to - among them, aid workers, lawyers, as well as a former adviser to a Hamas leader - each has a different take on the likelihood of Hamas laying down its arms and relinquishing control. And indeed - given the situation on the ground - whether now is the time for them to do so.Anadolu via Getty ImagesPalestinians gathered to celebrate following the announcement of the ceasefire agreement \"It's been two years with a complete loss of law and order,\" aid worker Hanya Aljamal says from her home in Deir al-Balah, in the middle of the Gaza Strip. \"We need someone to take over.\"As unqualified as Hamas is to rule the Strip, they are a better option than the gangs.\"Dr Ahmad Yousef, a former advisor to Ismail Haniyeh, who was Hamas's political leader, is of the opinion that a firm grip is needed at present.\"As long as there are still people who try to take the law into their hands, we need somebody to scare them and squeeze them to the corner,\" says Dr Yousef, who now runs a Gaza think tank and remains close to the Hamas leadership.'As unqualified as Hamas is to rule the Strip, they are a better option than the gangs,' argues aid worker Hanya Aljamal \"This will take time. Not a long time. Within a month we will host those police forces and soldiers from Turkey and Egypt,\" he continues, referring to the international stabilisation force for Gaza, outlined in the peace plan, that could be composed of troops from Egypt and Turkey, among others. \"This is the moment where they will set their guns aside.\"Other Gazans are more sceptical, and fearful. Some aren't convinced that Hamas will give up their power - or weapons at all.Moumen al-Natour, a Gaza-based lawyer imprisoned several times by Hamas, is one of them. AFP via Getty ImagesMany Palestinians and Israelis doubt Hamas is willing to step back from a political roleHe has been in hiding since July, when he says masked Hamas gunmen came to his Gaza City apartment and ordered him to report to al-Shifa hospital for interrogation.\"Hamas is [sending] a message to the world and to President Donald Trump… that they will neither relinquish power nor hand over their weapons.\"If I fell into Hamas' hands now, they would make a video and kill me in the street with a shot to the head,\" he says in one of a series of videos sent to us from an undisclosed location in the Gaza Strip. The wall behind him is riddled with bullet holes.Moumen al-Natour, a Gaza-based lawyer: 'If I fell into Hamas' hands now, they would make a video and kill me in the street with a shot to the head'\"It is a gang, not a government,\" he says of Hamas. \"I don't want them to remain in Gaza… I don't want them in government, and I don't want them in security. I don't want to see their ideas spread in mosques, in the streets, or in schools.\"'Still the dominant player in Gaza'Mr al-Natour has his own take on what Gaza could look like.The disparate array of militias now under Hamas assault could, in his view, be integrated into a new security apparatus. But with their competing agendas, sometimes murky pasts and, in some cases, controversial links to the Israeli military, it's a problematic proposition.\"The fact is – and sometimes it's very hard for Israelis to admit this – that Hamas still exists and is the dominant player in Gaza.\" says Dr Michael Milshtein, a former head of the department for Palestinian Affairs in Israeli Military Intelligence.\"Relying on suspicious players - clans, militias, gangs, many of them criminals, many of them affiliated with ISIS [the Islamic State group], many of them involved in terror attacks against Israel - and considering them as a kind of alternative to Hamas is an illusion.\"'Hamas still exists and is the dominant player in Gaza' says Dr Michael Milshtein, a former head of the department for Palestinian Affairs in Israeli Military IntelligenceHamas officials have said the group is willing to hand over political control of Gaza. The Trump ceasefire plan, to which it gave its qualified support, envisages \"temporary transitional governance of a technocratic, apolitical Palestinian committee\".But even if the group is willing to step back from a political role – something many Palestinians and Israelis still doubt - persuading its battle-hardened fighters to lay down their weapons is a big step for an organisation whose power, even before October 2023, relied heavily on the force of arms.Rise of Hamas and its iron gripTo begin to answer the complex question of what may happen to Hamas next requires delving backwards into how exactly it consolidated power in the first place.From its origins in the 1980s as an offshoot of the Egyptian Muslim Brotherhood and a rival to the secular Palestine Liberation Organization (PLO), Hamas morphed into a violent militant group responsible for the deaths of Israeli civilians.Initially, Israel offered discreet support to Hamas, seeing it as a useful counterweight to the PLO and its dominant faction, Fatah, led at the time by Yasser Arafat.\"The major enemy was Fatah,\" says Ami Ayalon, former head of Israel's domestic security service, Shin Bet, \"because they were the people who demanded a Palestinian state.\"But when Hamas launched deadly suicide bomb attacks in the 1990s and 2000s on Israelis, Israel responded with a series of high-profile assassinations.A violent power struggle with Fatah left Hamas, which won a 2006 election, in sole control of the Gaza Strip.Eighteen years of Hamas rule have followed, characterised by an Israeli military and economic blockade, and bouts of armed conflict in 2008-09, 2012, 2014 and 2021.Despite Israeli claims since October 2023 that \"Hamas is ISIS\", the government of Israeli Prime Minister Benjamin Netanyahu has previously convinced itself that Hamas did not pose a strategic threat.\"His was a policy of managing the conflict,\" says Mr Ayalon. \"He said we are not going to solve it and we are totally against the reality of two states, so the only way is to divide and control.\"With Hamas in control in Gaza and the Palestinian Authority, led by President Mahmoud Abbas, ruling in part of the occupied West Bank, the Palestinians remained hopelessly divided, enabling Israel to argue that it had no unified leadership to negotiate peace with.\"[Netanyahu] did everything in order to support Hamas in Gaza,\" Mr Ayalon says. \"He let Qatar send them… more than $1.5bn.\"Getty ImagesIsrael has gone to enormous lengths to eliminate Hamas's key political and military figuresThe money from Qatar was meant to pay the wages of civil servants and support the poorest families, but security chiefs feared it was being used for other purposes.Mr Ayalon adds: \"It was clear to the director of the Shin Bet and the head of Mossad that this money would go to military infrastructure.Netanyahu has defended allowing payments to Hamas, saying it was meant to aid the civilian population.Hamas was always preparing for warAs 7 October brutally revealed, Hamas was always preparing for war. Nowhere was this more obvious than in its elaborate network of tunnels.Tunnels had already been used to mount attacks on Israeli army positions during the second Palestinian uprising, or \"Intifada\" that began in 2000.In 2006, Hamas fighters used a tunnel under the border with Israel to attack a military post near Kerem Shalom, killing two Israel soldiers and kidnapping a third, Gilad Shalit. He was held for five years until his release, in 2011, in exchange for 1,027 Palestinian prisoners, including Yahya Sinwar, who would go on to mastermind the Hamas attacks of October 2023.Getty ImagesYahya Sinwar, one of those behind the Hamas attacks of October 2023Over time, Hamas' tunnel network expanded, to include workshops, weapons-manufacturing sites and command centres.Regional developments also played a role. In 2012, after the fall of the Libyan dictator Muammar Gaddafi and the brief rise to power of the Muslim Brotherhood in Egypt, Hamas was able to smuggle increasingly sophisticated weapons into Gaza, including sniper rifles, mobile rocket launchers and equipment for the manufacture of long-range rockets.Hamas is thought to have benefitted from the help of technicians and fighters with experience of tunnelling in places like Lebanon and Iraq.Iran was also a key supporter, seeing Hamas as a natural component in its \"Axis of Resistance,\" a loose coalition of militant groups across the Middle East with a shared antipathy towards Israel and the United States.In 2020, a US State Department report said that Iran was providing around $100m a year to Palestinian militant groups including Hamas.Yousef Masoud/SOPA Images/LightRocket via Getty ImagesOver time, Hamas' tunnel network expandedSome tunnels were reportedly dug as deep as 230ft (70m) below ground, took years to build and cost tens of millions of dollars each. These were designed to protect senior Hamas commanders and house long-range weapons.A local expert with extensive knowledge of the tunnels told the BBC the cost of the entire project totalled roughly $6bn (£4.5bn).Precise figures are hard to come by, but it's thought that the scattered network extended for as much as 250 miles (400km), in a strip of land just 26 miles long and, at its widest, seven miles across.Tunnels: a project shrouded in secrecyPublic discussion of the tunnels - their location or cost - could expose Gazans to accusations of espionage, leading to arrest and worse. But many knew what was happening. Local residents would see the tell-tale signs: sand and clay being removed, new entrances appearing unexpectedly and machinery being brought in under cover of darkness.What began as an opportunistic response to Gaza's isolation became, over the span of three decades, a multi-layered subterranean industrial and military complex.It emerged later that much of it was concealed under Gaza's civilian infrastructure, including hospitals, schools and, in the case of a tunnel containing a Hamas data centre, the headquarters of the UN Relief and Works Agency (UNRWA) in Gaza City.Anadolu via Getty ImagesAt least 67,938 people have been killed by Israeli attacks in Gaza since since October 2023, according to the Hamas-run health ministryAfter 7 October 2023, when Hamas fighters stormed into Israel, killing around 1,200 people and taking 251 hostage, it also became a massive underground prison. Not all of those held hostage were concealed in tunnels, but many were, especially as the war ground on.Eli Sharabi, who became one of the most high profile of those taken, was first moved from a safe house into a tunnel after 52 of his 491 days in captivity. \"They tied us with ropes in our legs and hands,\" he told the BBC earlier this month. \"I fainted from time to time from the pain. One time they broke my ribs.\"By the time he was released, in February, he had lost more than 30kg (4st 10lb).EPAEli Sharabi, who was held hostage, was moved from a safe house into a tunnel. 'They tied us with ropes,' he has saidHamas used the hostages as bargaining chips, to secure ceasefires or the release of Palestinians held in Israeli prisons. As negotiations over their fate continued, Hamas drip fed the Israeli public with a cruel series of videos, often showing the hostages in situations of extreme distress.Eventually it was, says Dr Yousef, internal and external pressure that forced Hamas to abandon the strategy.\"Qatar, Egypt and Turkey and also the people here in displacement camps sent a strong message to Hamas leaders outside that enough is enough.\"Getty ImagesIsrael assassinated Hamas's powerful leader, Ismail Haniyeh, in Tehran in July 2024In the meantime, Israel continues to destroy what it can of the tunnel network, often demolishing civilian neighbourhoods above in the process.And the job is far from done.\"According to publications from the defence establishment, estimates speak of damage to between 25% and 40% of the tunnels,\" says Yehuda Kfir, an Israeli civil engineer and underground warfare researcher at Haifa's Technion University.\"No doubt [Hamas] aspires to rehabilitate the infrastructure, including restoring tunnels that were dealt with in various ways by the IDF.\"A leadership in tattersRestoring tunnels is one thing. Reconstituting the organisation is another. After the events of the past two years, Hamas' leadership is in tatters.Israel has gone to enormous lengths - in Gaza, Iran, Lebanon and Qatar - to eliminate the group's key political and military figures. From its best known, internationally recognisable leaders, travelling the world to promote their cause, to its battalion commanders on the ground in Gaza, Hamas has lost almost everyone of consequence.Israel assassinated Hamas's powerful leader, Ismail Haniyeh, in Tehran in July 2024. Three months later, Haniyeh's successor, the elusive Yahya Sinwar, was killed in the ruins of a house in Rafah.ReutersIsmail Haniyeh (left) was assassinated in Tehran in July 2024, followed three months later by his successor Yahya Sinwar (centre). Hamas deputy leader Saleh al-Arouri (right) was killed in Beirut blastDespite the loss of these leading figures - and thousands of members of its armed wing - the group battled on, recruiting a fresh generation of radicalised young fighters and splintering into small cells intent on carrying out hit-and-run guerrilla-style operations.But Hamas in October 2025 is a pale shadow of the organisation that carried out the attacks of 7 October. Today's leaders are less well known and, crucially, have little political experience.Ezzedine al-Haddad, who is 55, now heads the five-member military council that commands Hamas' armed wing, the Izz al-Din al-Qassam Brigades.EPA/ ShutterstockMany of the group's key political and military figures have been killed. (L-R) Ismail Haniyeh, Yahya Sinwar, Mohammed Deif and Sheikh Ahmed YassinOutside Gaza, the remnants of the group's political leadership include Khaled Meshaal (the subject of a botched Israeli assassination attempt in Jordan in 1997), Khalil al-Hayya and Muhammad Darwish.All are believed to have escaped death on 9 September, when Israeli jets attacked a building in Doha, Qatar, where they were meeting to discuss the latest US ceasefire proposals.Hamas is 'tired of war'Despite the violence still raging in Gaza, the former Hamas adviser, Ahmed Yousef, says the group is tired of war. Without mentioning 7 October directly, he describes the cause of the war as a \"terrible mistake\" and that a \"different approach\" is needed.Anadolu via Getty ImagesPeople sit among the rubble and wreckage of war in Gaza. The former Hamas adviser, Ahmed Yousef, claims Hamas is also tired of war\"I'm talking to many of them and they have said that they are not interested in ruling Gaza anymore,\" he says. \"But Hamas has more than 100,000 members and those people are not going to disappear.\"Hamas, he suggests, is looking to rebrand itself in order to continue to play a political role in the future, a process he likens to the ANC's transition from guerrilla warfare to political rule in post-apartheid South Africa.\"If tomorrow there [are] elections,\" he says, \"I'm sure Hamas will come under different names, giving the impression it is more peaceful and more willing to be part of political life. \"Violence is not going to be part of any political party.\"Dr Milshtein is doubtful.\"Even if there will be a new local regime in Gaza, of course behind the scenes Hamas will be the dominant player,\" he argues.Anadolu via Getty ImagesIsrael may have to deal with Hamas for some time to comeDisarmament, he continues, is even less likely: he predicts another Gaza war within the next five years.But Ami Ayalon, the former Shin Bet chief, believes Israel should find another way to tackle its enemy.\"Unless we defeat the ideology, they will flourish,\" he says. \"The only way to defeat the ideology is by creating and presenting to the Palestinian and the Israeli people a new horizon. A horizon of two states.\"For now, that horizon does not exist, perhaps making Dr Milshtein's prediction more likely than Ami Ayalon's vision of a shared future.But Hamas, however diminished, is far from a spent force. One way or another, Israel may have to deal with it for some time to come.Additional reporting: BBC MonitoringTop picture credit: Getty ImagesBBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. You can now sign up for notifications that will alert you whenever an InDepth story is published - click here to find out how.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Will Hamas really relinquish control in Gaza?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4908/live/348990d0-ab66-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-20T20:58:30.000Z",
      "dateModified": "2025-10-20T20:58:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Russia: Ten dead in blast at munitions plant in Urals",
    "url": "https://www.bbc.com/news/articles/ckgzx82p1x5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d091/live/3bb0f920-afe9-11f0-a143-2b4ebe719445.png",
    "tag": "World",
    "date": "2025-10-23T10:35:21.000Z",
    "description": "2 hours agoIan AikmanAstra/TelegramCCTV cameras captured the moment of the blast in Kopeisk near ChelyabinskAn explosion at a Russian munitions factor",
    "body": "2 hours agoIan AikmanAstra/TelegramCCTV cameras captured the moment of the blast in Kopeisk near ChelyabinskAn explosion at a Russian munitions factory in the Urals has left at least 10 people dead, the region's governor has said.Alexei Teksler said at least 19 people had also been injured in the blast, which took place in the Kopeisk district of the Chelyabinsk region, which borders Kazakhstan.The governor did not say which factory had been hit, but verified video shows a fireball filmed from the road beside the Plastmass plant in the area. The factory produces and recycles explosives for the Russian military.Authorities have not said what caused the blast, but Teksler stressed that the incident \"was not a drone attack\".Verify live: Videos show blast at Russia munitions factoryThe fire - which was first reported late on Wednesday - has since been extinguished, and a search and rescue operation at the plant was ongoing on Thursday morning, Teksler said.The whereabouts of 12 members of staff was still unknown, he added.Friday has been declared a day of mourning in the region and investigators have opened a criminal inquiry into the blast.BBC Verify has located two videos of the explosion. One is CCTV showing the moment of the blast, captured around 3km (1.9 miles) from the site. The other shows the fireball filmed from a car driving down an adjacent road.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Russia: Ten dead in blast at munitions plant in Urals",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d091/live/3bb0f920-afe9-11f0-a143-2b4ebe719445.png"
      ],
      "datePublished": "2025-10-23T10:35:21.000Z",
      "dateModified": "2025-10-23T10:35:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New Zealand: Wild winds leave tens of thousands without power",
    "url": "https://www.bbc.com/news/articles/cwyp07kpgrvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/13d6/live/c8af7710-afd6-11f0-84cb-eff459ebf026.jpg",
    "tag": "World",
    "date": "2025-10-23T06:36:52.000Z",
    "description": "Strong winds of up to 155km/h (96mph) in New Zealand have left around 90,000 homes without power and forced authorities to cancel more than 100 flight",
    "body": "Strong winds of up to 155km/h (96mph) in New Zealand have left around 90,000 homes without power and forced authorities to cancel more than 100 flights, local media reports.The winds are affecting the whole of the South Island and the southern parts of the North Island, according to the country's meteorological service.New Zealand authorities issued rare red wind warnings - the highest alert level - in central regions including Canterbury and Wellington earlier on Thursday, though they lifted them hours later. In some places, roofs have reportedly been ripped off houses, while trees and electricity poles have been knocked down. A man in Wellington died after being struck by a tree branch.People have been urged to stay indoors and avoid travel, and to prepare for further power and communication outages.The power cut appears to be affecting homes mostly in the South Island, though authorities say that the electricity supply was being restored progressively.The man killed by a tree branch on Tuesday had been on a popular walking trail in the New Zealand capital.Also in Wellington, a woman was blown onto oncoming traffic on a road by a strong gust of wind, in a moment that was captured in a viral dashcam video. She appeared to survive.Flights in and out of the city have been cancelled because of the winds, while some roads and libraries are also closed.Meanwhile, Canterbury officials have declared a state of emergency to support disaster response efforts.Authorities have also warned of heavy rain across the South Island, with water levels in the Waimakariri River in Canterbury rising rapidly. Local officials said the river may overflow in the coming hours and have urged local residents to prepare for evacuation.The wild winds on Thursday come as tens of thousands of teachers, doctors and other public workers take part in what has been termed a \"mega strike\", calling for better pay and working conditions.But the extreme weather has forced them to change some of their plans, with some outdoor rallies moved indoors or cancelled.Similar gusts are also sweeping across Australia, bringing a heatwave to the country's outback. Authorities have issued fire bans for fear of bush fires.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New Zealand: Wild winds leave tens of thousands without power",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/13d6/live/c8af7710-afd6-11f0-84cb-eff459ebf026.jpg"
      ],
      "datePublished": "2025-10-23T06:36:52.000Z",
      "dateModified": "2025-10-23T06:36:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tunisia boat accident leaves 40 migrants dead, officials say",
    "url": "https://www.bbc.com/news/articles/c0rp5805ykzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8ca4/live/5e3c76b0-afce-11f0-be1a-29a37cb41475.jpg",
    "tag": "World",
    "date": "2025-10-23T06:39:20.000Z",
    "description": "At least 40 migrants, including children, have died after their boat sank off the coast of Tunisia, in one of the deadliest maritime disasters in the ",
    "body": "At least 40 migrants, including children, have died after their boat sank off the coast of Tunisia, in one of the deadliest maritime disasters in the region this year, authorities say. The boat sank off the Mediterranean port of Mahdia in central Tunisia while carrying about 70 migrants, an official said. All the people on board were from sub-Saharan Africa, the official added, without providing further details.This is the latest disaster to hit migrants trying to cross the Mediterranean from Africa to Europe.Over 210,000 people tried to cross the Central Mediterranean in 2023, according to data shared by the UN. More than 60,000 were intercepted and sent back to African shores, while nearly 2,000 lost their lives at sea.About 30 migrants were rescued in the latest disaster which occurred on Wednesday. Tunisian authorities have opened an investigation into the causes and circumstances surrounding the boat's sinking.The country is facing growing pressure to manage migrants fleeing conflict and poverty in search of better opportunities in Europe.The sea migration route between Africa and Europe is one of the most dangerous in the world. Last February, a boat sank off the Tunisian city of Sfax with more than 40 Sudanese people on board. In 2023, the European Union (EU) signed a deal with Tunisia to tackle irregular migration.The deal includes $118m (£90m) to stop smuggling, strengthen borders and return migrants.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tunisia boat accident leaves 40 migrants dead, officials say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8ca4/live/5e3c76b0-afce-11f0-be1a-29a37cb41475.jpg"
      ],
      "datePublished": "2025-10-23T06:39:20.000Z",
      "dateModified": "2025-10-23T06:39:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "SpaceX says it has cut Starlink services to Myanmar scam camps",
    "url": "https://www.bbc.com/news/articles/cpd2e5541d1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6929/live/1836c3f0-af42-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-10-22T13:51:40.000Z",
    "description": "23 hours agoJonathan Head,South East Asia correspondent and Rachel HaganElon Musk's SpaceX says it has cut Starlink satellite communication links to m",
    "body": "23 hours agoJonathan Head,South East Asia correspondent and Rachel HaganElon Musk's SpaceX says it has cut Starlink satellite communication links to more than 2,500 devices used by scam compounds in Myanmar.More than 30 compounds are believed to be operating along the Thai-Myanmar border, where people from around the world are trafficked and forced to work on scams generating tens of billions of dollars annually.Announcing the move, Lauren Dreyer, head of Starlink business operations, said the firm takes action on the rare occasion it identifies violations.The service's termination follows Monday's takeover of one of the largest compounds, KK Park, by the Myanmar military, as it retakes territory lost to insurgent groups over the past two years.Campaigners have long warned that Starlink technology has enabled the mainly Chinese crime syndicates to operate from remote locations along the border.Myanmar has become infamous for these operations, which defraud victims through romantic ploys and bogus investment schemes. Workers are lured under the guise of legitimate jobs, only to be held captive and forced into criminal activity.Survivors recount gruelling conditions, long hours, torture and beatings for failing to meet targets. Many of the victims come from African countries.\"In Myanmar... SpaceX proactively identified and disabled over 2,500 Starlink Kits in the vicinity of suspected 'scam centers',\" Dreyer said in a post on X.\"We are committed to ensuring the service remains a force for good and sustains trust worldwide: both connecting the unconnected and detecting and preventing misuse by bad actors,\" she added.On Monday Myanmar's military said it had \"cleared\" KK Park, releasing more than 2,000 workers and confiscating 30 Starlink terminals. Photographs show the satellite dishes on the compound's rooftops and footage supplied to the BBC showed thousands of workers leaving KK Park on foot.However, at least 30 other scam compounds remain active along the border, employing tens of thousands globally. Many are protected by militia groups loyal to the Myanmar military and it is unclear whether they have also lost access to Starlink services they once relied on.These centres have become a key component of Myanmar's wartime economy, as the junta battles various rebel groups while relying on Chinese support to maintain its hold on power.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "SpaceX says it has cut Starlink services to Myanmar scam camps",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6929/live/1836c3f0-af42-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-22T13:51:40.000Z",
      "dateModified": "2025-10-22T13:51:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Milnerton High School: Eight pupils suspended over South Africa bullying video",
    "url": "https://www.bbc.com/news/articles/cq6zyq9vggno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0615/live/043b5160-af31-11f0-b1c6-736a05ed5483.jpg",
    "tag": "World",
    "date": "2025-10-22T13:30:39.000Z",
    "description": "23 hours agoKhanyisile NgcoboJohannesburgSouth African authorities have suspended eight pupils linked to a case of alleged bullying that has caused na",
    "body": "23 hours agoKhanyisile NgcoboJohannesburgSouth African authorities have suspended eight pupils linked to a case of alleged bullying that has caused national outrage.A video showing a horrific assault at Milnerton High School in Cape Town last week has been widely shared on social media.Several boys are seen repeatedly hitting a fellow pupil with various objects, including a hockey stick, hose pipe and belt. According to reports, the boy was one of nine allegedly assaulted.Angry parents gathered outside the school on Wednesday in protest and were dispersed by police firing tear gas.They were joined by members of political parties who announced planned demonstrations at the school.Bullying in schools is a significant problem in South Africa, with videos depicting the violent attacks often going viral. This latest clip is among the most horrific to emerge in recent years.The mother of the 16-year-old boy being attacked in the video told local online publication, News24, that her son had had cancer and had completed his chemotherapy earlier this year.\"My child had just beaten cancer [only] for something like this to happen to him,\" she is quoted as saying.The teen's uncle later told local broadcaster eNCA that the boy had since been removed from the school.Various organisations have also condemned the incident, which took place on 16 October, while the police have confirmed that an assault case has been opened.Among those to speak out was Amnesty International South Africa, which said the video was \"deeply disturbing\" and called for \"timely disciplinary action\".The video, which is just over two minutes long, shows the boy pleading with his attackers to stop hitting him. While he makes this impassioned plea, one of the boys hits him again with a belt, eliciting laughter from some of the others. Some of the boys are also seen making funny faces and cheering the boy's attackers as the camera pans across the room.\"No child should ever endure such brutality in a space where [pupils] should be safe and protected from harm,\" the international human rights organisation said in a post on X.South Africa's education ministry said it had been in contact with the Western Cape education department, which has oversight over the school, and confirmed that the suspended pupils would face disciplinary action.The provincial department said it was \"treating the matter with the seriousness it warrants\".Both bodies have urged the public not to share the video of the assault or details of those involved, saying that this \"not only exacerbates the trauma experienced by the victim but also undermines the rights and dignity of all the [pupils] involved\".The chairperson of parliament's education committee also shared her \"utter horror and deep concern\" over the video.Joy Maimela said that the incident \"is not merely bullying but borders on assault – a criminal offence that demands urgent and decisive action from all relevant authorities\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Milnerton High School: Eight pupils suspended over South Africa bullying video",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0615/live/043b5160-af31-11f0-b1c6-736a05ed5483.jpg"
      ],
      "datePublished": "2025-10-22T13:30:39.000Z",
      "dateModified": "2025-10-22T13:30:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Uganda road crash leaves more than 40 dead",
    "url": "https://www.bbc.com/news/articles/cgql9lwddw5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9d67/live/4da725e0-af36-11f0-ba75-093eca1ac29b.jpg",
    "tag": "World",
    "date": "2025-10-22T11:01:39.000Z",
    "description": "1 day agoBasillioh Rukanga and Maia DaviesWatch: Four vehicles were involved in the crash on a major highway on the Kampala-Gulu HighwayForty-six peop",
    "body": "1 day agoBasillioh Rukanga and Maia DaviesWatch: Four vehicles were involved in the crash on a major highway on the Kampala-Gulu HighwayForty-six people have been killed after several vehicles crashed on a major highway in Uganda, the police say.The police revised down an earlier death toll of 63, saying they had mistakenly included victims who were unconscious and were now being treated.The crash occurred when two buses travelling in opposite directions \"met head on\" while trying to overtake two other vehicles – a lorry and a car – on the Kampala-Gulu Highway at 00:15 local time (21:15 GMT), the Uganda Police Force said.One of the buses swerved in an attempt to avoid a crash, but in the process caused a \"head on and side collision\" that led to a \"chain reaction\" in which other vehicles lost control and overturned.As well as the fatalities, the passengers of the vehicles involved and several others were injured, police said. An investigation has been launched.The injured have been taken to different hospitals in the western town of Kiryandongo. In a statement, police said they were working with health and emergency services to verify the numbers and provide accurate updates as investigations continue into the cause of the tragedy.President Yoweri Museveni said he had learnt of the tragic accident \"with sadness\" and sent his condolences to the bereaved families. He urged caution to prevent such tragedies.He directed that each bereaved family be given five million shillings each ($1,430; £1,070) and a million shillings to the injured.The highway between the capital Kampala in the south and the northern city of Gulu is one of the country's busiest.Following the crash, police have urged motorists to avoid \"dangerous and careless overtaking\".It said this \"remains one of the leading causes of crashes in the country\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Uganda road crash leaves more than 40 dead",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9d67/live/4da725e0-af36-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-22T11:01:39.000Z",
      "dateModified": "2025-10-22T11:01:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rubio warns against West Bank annexation after Israel's parliament advances move",
    "url": "https://www.bbc.com/news/articles/cn8xvj108z9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8c45/live/c2ffab50-afcc-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-10-23T09:03:18.000Z",
    "description": "3 hours agoYolande Knell,Middle East Correspondent and Chris GrahamThe US Secretary of State has said that a move by Israel's parliament towards annex",
    "body": "3 hours agoYolande Knell,Middle East Correspondent and Chris GrahamThe US Secretary of State has said that a move by Israel's parliament towards annexation of the occupied West Bank would threaten Washington's plan to end the conflict in Gaza.\"That's not something we can be supportive of right now,\" Marco Rubio said before leaving for Israel as part of US efforts to shore up a fragile ceasefire deal.In an apparent attempt to embarrass Israel's Prime Minister Benjamin Netanyahu, far-right politicians took the symbolic step of giving preliminary approval to a bill granting Israel authority to annex the West Bank.The Palestinians claim the West Bank - occupied by Israel since 1967 - as part of a hoped-for independent state.Last year, the International Court of Justice - the UN's top court - said Israel's occupation was illegal.Netanyahu has previously spoken in support of annexing West Bank land but has not advanced this due to the risk of alienating the US - Israel's most important ally - and Arab countries which have built relations with Israel after decades of enmity. Ultra-nationalists in Netanyahu's governing coalition have repeatedly called for Israel to annex the West Bank outright, though the bill was put forward by MPs outside the government.The bill passed in a 25-24 vote. It is unclear whether it has support to win a majority in the 120-seat Knesset (parliament), and there are ways the prime minister can delay or defeat it.The Palestinian foreign ministry condemned the Knesset's move, saying Israel would have no sovereignty over Palestinian land.Israel has built about 160 settlements housing 700,000 Jews during its occupation of the West Bank and East Jerusalem. An estimated 3.3 million Palestinians live alongside them.The settlements are illegal under international law - a position supported by an advisory opinion of the International Court of Justice last year.As he boarded the plane to Israel, Rubio said annexation would be \"counterproductive\" and \"threatening\" for the peace deal - reiterating US opposition to annexation.His visit on Thursday comes hot on the heels of trips by US Vice-President JD Vance and two special envoys, as the Trump administration attempts to push for the start of talks on the second critical phase of his 20-point Gaza peace plan.The first phase - which includes a ceasefire, the partial withdrawal of Israeli forces and an influx of aid - came into effect earlier this month.Both Israel and Hamas have accused each other of breaching the agreement over deadly incidents, but it has so far held.Rubio voiced similar optimism to that of Vance for preserving the ceasefire.\"Every day there'll be threats to it, but I actually think we're ahead of schedule in terms of bringing it together, and the fact that we made it through this weekend is a good sign,\" he said.The second phase of the peace plan would involve setting up an interim government in Gaza, deploying an international stabilisation force, the withdrawal of Israeli troops, and the disarmament of Hamas.The war in Gaza began with the Hamas-led attack on southern Israel on 7 October 2023, in which around 1,200 people were killed and 251 taken hostage.In the ensuing conflict, more than 68,000 Palestinians have been killed in Gaza, according to the territory's Hamas-run health ministry, whose figures are seen by the UN as reliable.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rubio warns against West Bank annexation after Israel's parliament advances move",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8c45/live/c2ffab50-afcc-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-23T09:03:18.000Z",
      "dateModified": "2025-10-23T09:03:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US forces kill two in strike on alleged drug boat in the Pacific ",
    "url": "https://www.bbc.com/news/articles/cd9k2w8ell0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4dcf/live/1966f600-af83-11f0-ba75-093eca1ac29b.jpg",
    "tag": "World",
    "date": "2025-10-23T00:36:29.000Z",
    "description": "12 hours agoBernd Debusmann Jrat the White HouseUS forces have struck a second vessel alleged to be carrying drugs in the Pacific Ocean, amid an escal",
    "body": "12 hours agoBernd Debusmann Jrat the White HouseUS forces have struck a second vessel alleged to be carrying drugs in the Pacific Ocean, amid an escalating US campaign against seaborne drug smuggling.Defence secretary Pete Hegseth said three people on board the vessel were killed and no US forces were harmed. The strike comes about eight hours after the US announced a separate attack on a boat in the Pacific, which killed two people. Both vessels were known to US intelligence and were believed to be carrying drugs along a known trafficking route in international waters, Hegseth added.The strikes marks the eighth and ninth US strike against suspected drug boats since 2 September - but the first in the Pacific. Most attacks have been in the Caribbean Sea. President Donald Trump said he has legal authority to continue bombing boats in international water but said he may go to the US Congress if he decides to expand targets on land.\"We're allowed to do that, and if we do (it) by land, we may go back to Congress,\" Trump said to reporters in the Oval Office on Wednesday. He said his administration was \"totally prepared\" to expand the anti-drug operations on land, which would mark a deep escalation. In the Oval Office with Trump, US Secretary of State Marco Rubio added that \"if people want to stop seeing drug boats blow up, stop sending drugs to the United States\".Video of the strike appears to show a long, blue speed boat moving through the water before being struck by US ordinance. \"Narco-terrorists intending to bring position to our shores will find no safe harbour anywhere in our hemisphere,\" Hegseth wrote on X. \"Just as Al Qaeda wages war on our homeland, these cartels are waging war on our border and our people.\" \"There will be no refuge or forgiveness - only justice,\" he added. In a leaked memo recently sent to US lawmakers, the Trump administration said it determined it was involved in a \"non-international armed conflict\" with drug-trafficking organisations.At least 34 people have been killed in the American strikes on alleged drug boats, including a recent strike on a semi-submersible vessel in the Caribbean.Two men survived a strike last week, and were repatriated to Colombia and Ecuador. Ecuador's government later released one man - identified as Andrés Fernando Tufiño - saying there was no evidence of wrongdoing. The other man, from Colombia, reportedly remains hospitalised. US President Donald Trump and administration officials have repeatedly justified the strikes as counter-narcotics measures necessary to fight drug-trafficking organisations, several of which have been designated as terrorist organisations by the US. Citing a defence official, CBS has reported that the strike took place in international waters near Colombia. Speaking in the Oval Office on Wednesday, Trump defended the operations, calling them \"a national security problem\".News of the strike comes amid rising tensions between the Trump administration and the Colombian government of President Gustavo Petro, whom Trump has characterised as \"a thug and a bad guy\".\"He better watch it or we'll take very serious action against him and his country,\" Trump said. \"He has led his country into a death trap.\"Read: What's at stake as Trump boat strikes strain US-Colombia allianceOn Sunday, Trump denounced Petro as an \"illegal drug leader\" who is \"strongly encouraging the massive production of drugs, in big and small fields, all over Colombia.\"Trump added that the US will no longer offer subsidies to Colombia, which has historically been one of its closest allies in Latin America. Both Colombia and nearby Ecuador have significant Pacific coastlines that experts have said are used to funnel drugs north towards the US through Central America and Mexico. US estimates from the Drug Enforcement Agency, or DEA, indicate that the vast majority of cocaine bound for US cities passes through the Pacific. Drug seizures in the Caribbean - where the bulk of confirmed US strikes have so far taken place - account for a relatively small percentage of the total, although US officials have warned it is rising.To date, US officials have offered few details on the identities of those killed in the strikes or what drug trafficking organisations they allegedly belong to.Around 10,000 US troops, as well as dozens of military aircraft and ships, have been deployed to the Caribbean as part of the operation.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US forces kill two in strike on alleged drug boat in the Pacific ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4dcf/live/1966f600-af83-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-23T00:36:29.000Z",
      "dateModified": "2025-10-23T00:36:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mosquitoes found in Iceland for first time after record heat",
    "url": "https://www.bbc.com/news/articles/clyz3vv62pgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c517/live/7a52d060-af1f-11f0-9f87-dd1917f781b7.jpg",
    "tag": "World",
    "date": "2025-10-22T08:22:17.000Z",
    "description": "Mosquitoes have been found in Iceland for the first time after the country experienced record-breaking heat this spring.Insect enthusiast Bjorn Hjalta",
    "body": "Mosquitoes have been found in Iceland for the first time after the country experienced record-breaking heat this spring.Insect enthusiast Bjorn Hjaltason encountered the mosquitoes over several nights last week while using wine-soaked ropes to observe moths, local media reported.Mr Hjaltason found two female mosquitoes and one male which were later confirmed to be Culiseta annulata, one of few species that can successfully survive winter.Iceland was one of only two mosquito-free havens in the world prior to the discovery, partly due to its cold climate. The only other recorded mosquito-free zone is Antarctica.The mosquitoes were found in Kjós, a glacial valley to the South West of the Icelandic capital of Reykjavik.Mr Hjaltason shared the news of his discovery on a Facebook page for local wildlife alongside pictures of the insects, describing \"a strange fly on a red wine ribbon\", according to Icelandic media.\"I could tell right away that this was something I had never seen before\" he said in the post, which was screenshotted and shared by Iceland's Morgunblaðið news site, adding \"the last fortress seems to have fallen.\"Mr Hjaltason sent the insects to the Icelandic Institute of Natural History to be identified, where entomologist Matthías Alfreðsson confirmed his suspicions.The species are common across parts of Europe and North Africa but it it isn't clear how they reached Iceland, Alfreðsson told CNN. Iceland's cold climate and lack of stagnant water in which the insects can breed are key contributors to the country's former lack of mosquitoes, the World Population Review said.But this year, the country broke multiple records for its high temperatures. Typically, Iceland rarely experiences highs of more than 20C (68F) in May, and when it does those heatwaves will last for no more than two to three days, its Met Office notes. That threshold was exceeded for 10 consecutive days this year in different parts of the country, though.Iceland also saw its hottest ever day in May, with temperatures reaching 26.6C (79.8F) at Eglisstaðir Airport.A June study published by the Global Heat Health Information Network noted that such shifts could have \"significant\" impacts on delicate ecosystems, which have adapted to the cold climate and are sensitive to temperature shifts.Last year was the world's hottest on record, and the UN's climate body has established that human influence has \"unequivocally\" warmed the atmosphere, oceans and land.Further monitoring will be required in spring to see if the mosquito species has \"truly become established in Iceland\", Alfreðsson added.Hjaltason, meanwhile, has speculated on the origin of the specimens he observed.\"One always suspects Grundartangi - it's only about six kilometers from me, and things often arrive with ships and containers, so it's possible something came in that way,\" he told Morgunblaðið.\"But if three of them came straight into my garden, there were probably more.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mosquitoes found in Iceland for first time after record heat",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c517/live/7a52d060-af1f-11f0-9f87-dd1917f781b7.jpg"
      ],
      "datePublished": "2025-10-22T08:22:17.000Z",
      "dateModified": "2025-10-22T08:22:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cameroon election results: Constitutional Council dismisses complaints",
    "url": "https://www.bbc.com/news/articles/c1d041g5nwgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d60a/live/a73814f0-af6a-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-10-22T18:41:19.000Z",
    "description": "18 hours agoPaul NjieBBC Africa, YaoundéJudges in Cameroon have dismissed calls for the partial or total cancellation of the heavily disputed presiden",
    "body": "18 hours agoPaul NjieBBC Africa, YaoundéJudges in Cameroon have dismissed calls for the partial or total cancellation of the heavily disputed presidential election, saying they will announce the result on Monday.Major cities in the country have been rocked by protests, with opposition supporters alleging that the 12 October poll was marred by irregularities, including ballot-stuffing. Judges on the Constitutional Council dismissed eight petitions, citing insufficient evidence of irregularities or a lack of jurisdiction to annul results. Opposition candidate Issa Tchiroma Bakary has declared himself the winner - a claim rejected by allies of 92-year-old President Paul Biya, who is seeking another seven-year term.Biya has been in power for 43 years, and addressed only one campaign rally ahead of the election. Tchiroma Bakary, 76, is a former government spokesman who broke ranks with Biya to challenge him for power. He refused to file complaints with the Constitutional Council, whose judges have been appointed by Biya, choosing instead to declare himself the \"legal and legitimate president\". Can the world's oldest president keep his title?The African president who keeps defying death rumoursIn a video statement posted on social media, Tchiroma Bakary said he had won the election with about 55% of the vote, based on what he waid were returns representing 80% of the electorate.\"If the Constitutional Council proclaims falsified and truncated results, it will be complicit in a breach of trust,\" he declared.Tchiroma Bakary also warned that \"with their backs against the wall, the people will have no choice but to take their destiny into their own hands and seek victory wherever they can find it\".Biya's ruling party has dismissed his claims of victory and several officials have described it as illegal because only the Constitutional Council can proclaim official results.The influential Catholic Church this week urged the judges to ensure that the verdict reflected the will of voters.The growing tensions have sparked fears of post-electoral violence in a country already rocked by a separatist conflict in the Anglophone regions and Boko Haram insurgency in the Far North region.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cameroon election results: Constitutional Council dismisses complaints",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d60a/live/a73814f0-af6a-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-22T18:41:19.000Z",
      "dateModified": "2025-10-22T18:41:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israel's 'yellow line' in Gaza gives Netanyahu room for manoeuvre",
    "url": "https://www.bbc.com/news/articles/cx2y9ny653no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/21b4/live/9bc9bf30-ae8c-11f0-ba75-093eca1ac29b.jpg",
    "tag": "World",
    "date": "2025-10-21T14:47:34.000Z",
    "description": "2 days agoLucy WilliamsonMiddle East Correspondent, JerusalemUnder Donald Trump's peace plan for Gaza, the \"yellow line\" - which Israel withdrew to ea",
    "body": "2 days agoLucy WilliamsonMiddle East Correspondent, JerusalemUnder Donald Trump's peace plan for Gaza, the \"yellow line\" - which Israel withdrew to earlier this month - is the first of three stages of Israeli military withdrawal. It leaves it in control of about 53% of the Gaza Strip.One Israeli newspaper, Yedioth Ahronoth, referred to it as \"effectively the new border\" in Gaza.It's a remark that will please the far-right coalition partners of Prime Minister Benjamin Netanyahu.The fortifications and demarcations Israel is now building along this boundary are meant to clearly divide the territory, but they may also help to blur the differing hopes and expectations of Mr Netanyahu's allies in Washington and at home.How long he can keep both sets of expectations in play depends largely on this next stage of negotiations.The boundary marked by the yellow line is temporary, but further withdrawal of Israeli forces rests on resolving the difficult issues pinned to the second stage of Donald Trump's deal – including the transfer of power in Gaza and the process for disarming Hamas.Washington is keen that nothing upset this next delicate stage of negotiations. US Vice-President JD Vance flew in on Tuesday to push Netanyahu to press on with peace talks. Trump's negotiators Steve Witkoff and Jared Kushner met with the Israeli PM on Monday.Israeli newspapers have been reporting that Netanyahu is receiving a stern message from his American allies to \"show restraint\" and not to endanger the ceasefire.When Israel complained that Hamas had violated the terms of the ceasefire on Sunday, killing two soldiers, the response advocated by Mr Netanyahu's far-right National Security Minister was a one-word demand: \"War\".Instead, Israel carried out an intense, but brief, wave of air strikes, before reinstating the truce, and was careful to emphasise that its troops had been attacked inside the yellow line – keen to show Washington that Israel had not broken the rules.Netanyahu has said the war will not end until Hamas is dismantled – its disarmament, and the full demilitarisation of Gaza, are among the conditions he has set.But Israeli commentators are lining up to say that the real decisions over Israel's military action in Gaza are now being made in Washington.The yellow line – and the daunting task facing negotiators in this second stage of the deal – are clues as to why Netanyahu's coalition partners have chosen to wait, rather than carry out a threat to bring down his government.The dream for many extremist settlers – and ministers – is that the next stage of this process will prove impossible to resolve and the yellow line will indeed become the de facto border, opening the way to new settlements on Gazan land. Some hardliners would like Israel to annex the whole of the Gaza Strip.The vast majority of Israelis want an end to the war and for the remaining bodies of the hostages, and Israel's serving soldiers, to come home.But Israel's prime minister is known as a politician who likes to keep his options as open as possible, for as long as possible, and this is a deal in stages, with caveats built in.Agreeing to this first stage meant withdrawing to positions that left Israel in control of more than half of Gaza, and agreeing to a ceasefire in order to get hostages home.From here, it will become harder to align the goals of his US and domestic allies.Benjamin Netanyahu has repeatedly underlined that violations of the deal by Hamas – including its failure to disarm – would allow Israel to return to war.\"If this is achieved the easy way, so much the better,\" he told the Israeli public earlier this month. \"If not, it will be achieved the hard way.\"Donald Trump has said the same.  But Washington has so far shown a tolerance for delays and violations in implementing the deal on the ground, leaving Netanyahu with far less political room than perhaps he'd like.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israel's 'yellow line' in Gaza gives Netanyahu room for manoeuvre",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/21b4/live/9bc9bf30-ae8c-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-21T14:47:34.000Z",
      "dateModified": "2025-10-21T14:47:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Singapore court acquits women for pro-Palestinian walk",
    "url": "https://www.bbc.com/news/articles/cdxrqyq5qqro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/61cb/live/bd7070b0-aee2-11f0-b285-f39e045c9ed6.jpg",
    "tag": "World",
    "date": "2025-10-22T03:38:35.000Z",
    "description": "Singaporean women acquitted over pro-Palestinian walk1 day agoTessa WongAsia Digital ReporterProvided by Kokila AnnamalaiSiti Amirah Mohamed Asrori, K",
    "body": "Singaporean women acquitted over pro-Palestinian walk1 day agoTessa WongAsia Digital ReporterProvided by Kokila AnnamalaiSiti Amirah Mohamed Asrori, Kokila Annamalai and Mossammad Sobikun Nahar had been charged with organising an illegal processionA court in Singapore has acquitted three women who organised a walk to the presidential office to show support for the Palestinian cause.The women were prosecuted for organising an illegal procession. But a judge ruled their actions did not meet the full charge.One of the women told the BBC she felt that the unexpected acquittal would \"give a new sense of energy and hope\" to activists in Singapore.Public demonstrations are uncommon in Singapore, which has very strict rules against protests and requires a police permit for any gathering promoting a cause. Authorities have also effectively banned public gatherings related to the Israel-Gaza war.Any permit applications for public assemblies related to the Israel-Gaza war would be turned down because of the \"real risk that such events could give rise to public disorder\", as the war was a sensitive topic, authorities have said.Singapore's government has argued that rules on demonstrations are necessary to maintain peace and harmony in the tiny country. Critics say that these rules stifle freedom of expression and civil activism.The latest case centred on an event organised in February 2024 by community organiser Mossammad Sobikun Nahar and content creator Siti Amirah Mohamed Asrori. They were assisted by community organiser Kokila Annamalai.About 70 people showed up to take part in the walk from a shopping mall to the presidential office, known as the Istana.Pictures of the event posted online showed the participants carrying umbrellas painted to look like watermelons, a symbol associated with the Palestinian cause.Prosecutors later charged the three women for organising a procession without a permit in a prohibited area.During their trial, the defence argued that the women had not known that their route on the perimeter of the Istana was in a prohibited area as they had travelled along public roads.While the judge ruled that the women had indeed organised a procession, they also would \"not have any inkling that using that route would be illegal or prohibited\".He noted they had used a public pavement and there were no signs indicating it was a prohibited area. \"It is clear from the evidence that the three of them were trying their level best not to run afoul of the law,\" he said.If they had been convicted, each of the women could have been fined up to S$10,000 (£5,760; US$7,705), or jailed for up to six months, or received both penalties.Provided by Kokila AnnamalaiThe three women posed with their supporters on Tuesday outside the State Courts in SingaporeThe trial drew some attention in Singapore. Pictures of the three women dressed in clothing in the colours of the Palestinian flag and keffiyeh scarves for their court appearances went viral online.Ms Annamalai told the BBC that the women deliberately chose their outfits to send a statement and \"show our defiance and solidarity\".With activists in the past convicted for holding unlawful public assemblies - even if they were only attended by one person - some had expected the women to receive convictions.Local media reports on Tuesday said there were \"loud gasps\" when the verdict was read out in the courtroom packed with the women's supporters.Ms Annamalai said she had been \"fully prepared to be convicted\" and that their acquittal \"came as a surprise\".\"But it is also difficult to feel celebratory about it because we shouldn't have been charged in first place,\" she added.She said their acquittal \"can provide that new sense of energy and hope\" as there was a \"long fight ahead\" for the civil rights movement and supporters of Palestine in Singapore. \"The community needed a win,\" she said.In a statement to the BBC, Singapore's prosecutorial office said it would file an appeal.Police have launched investigations into other offline and online events related to the Israel-Gaza war.The latest was in January when a group of local university students organised a memorial event for Palestinian students in front of a building said to house a research centre operated by an Israeli university. Six people have been questioned.The Singapore government has consistently supported the two-state solution for Israel and Palestine, and has supported Palestine's membership in the United Nations.In September, Singapore's foreign minister said they would recognise a Palestinian state \"when it has an effective government that accepts Israel's right to exist and categorically renounces terrorism\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Singapore court acquits women for pro-Palestinian walk",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/61cb/live/bd7070b0-aee2-11f0-b285-f39e045c9ed6.jpg"
      ],
      "datePublished": "2025-10-22T03:38:35.000Z",
      "dateModified": "2025-10-22T03:38:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says 'existing structure' of White House East Wing to be torn down",
    "url": "https://www.bbc.com/news/articles/czxn7lwzx5po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e04a/live/41d51fa0-aff5-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "World",
    "date": "2025-10-23T12:16:51.000Z",
    "description": "10 minutes agoAoife WalshWashingtonIs Trump allowed to demolish part of the White House to build a ballroom?US President Donald Trump has said the \"ex",
    "body": "10 minutes agoAoife WalshWashingtonIs Trump allowed to demolish part of the White House to build a ballroom?US President Donald Trump has said the \"existing structure\" of the White House East Wing must be torn down in order to construct a new $250m (£186m) ballroom.  Crews began demolishing parts of the structure on Monday, and two administration officials earlier told the BBC's US partner CBS that it will be completely torn down by the weekend.It marks a significant expansion of the construction project announced over the summer. Trump previously said his ballroom addition would not \"interfere with the current building\". He rejected accusations he had not been transparent over the extent of the works, telling reporters on Wednesday: \"I think we've been more transparent than anyone's ever been.\" But criticism from opposition politicians has intensified as the scale of the works comes into focus. Democratic members of the US House of Representatives have now written to the president, raising their own transparency concerns and requesting a range of documents that relate to the demolition. Conservationists have also suggested the project should have faced more scrutiny at the outset.The White House is considered a special building that is exempt from the National Historic Preservation Act of 1966, which would ordinarily require public reviews of projects in which historic buildings are impacted.However, Prof Priya Jain, the chair of a heritage preservation committee at the Society of Architectural Historians, said she \"would be surprised if that process was not followed at the White House in the past\".\"That process is so well established, and is followed on thousands of buildings, and would have been best practice,\" Prof Jain explained to the BBC.Trump says White House renovation is 'music to my ears' as criticism mountsWho is paying for Trump's White House ballroom?The White House has served as the historic home of the US president for two centuries. The East Wing was constructed in 1902 and was last modified in 1942.It is a section of the White House that holds offices for the first lady and other staff, as well as meetings and special events. Trump said the building had gone through several changes over the years and was \"very, very much changed from what it was originally\". He added that was \"never thought of as being much\" and that the changes have been wanted \"for at least 150 years\". The construction was being fully funded by Trump and \"some friends of mine - donors\". The military was also involved, he added.The US president announced construction had begun in a social media post on Monday, saying \"ground has been broken\" on the \"much-needed\" ballroom space.He said that the East Wing was \"completely separate\" from the White House, although it is attached to the main structure.The Trump administration officials told CBS it was always the case that the East Wing would have to be modernised to enhance security and technology, but that during the planning process, it became apparent that the best option would be to demolish the entirety of the East Wing.Watch as parts of White House East Wing torn downTrump's comments came after the National Trust for Historic Preservation, a Washington non-profit organisation that protects historic US sites, wrote a letter to White House officials saying it was \"deeply concerned\" by the project.The trust asked Trump to pause demolition work, arguing that the White House was a national historic landmark and that officials needed to hold a public review process of the plan for the ballroom.Some Democrats have been critical of the renovation, including Hilary Clinton, who ran against Trump for the US presidency in 2016.In a post on X, she wrote that the White House was not Trump's house, and \"he's destroying it\".Additional reporting by Bernd Debusmann JrGetty ImagesThe East Wing hosted special events - pictured are former House Speaker Nancy Pelosi and husband Paul in 2009Follow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weekly US Politics Unspun newsletter. Readers in the UK can sign up here. Those outside the UK can sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says 'existing structure' of White House East Wing to be torn down",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e04a/live/41d51fa0-aff5-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-23T12:16:51.000Z",
      "dateModified": "2025-10-23T12:16:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What we learned from Virginia Giuffre's memoir",
    "url": "https://www.bbc.com/news/articles/c5ylepx85nxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/23c3/live/6a6a6f00-ada3-11f0-b0cb-ebfbdbe55f66.jpg",
    "tag": "World",
    "date": "2025-10-20T15:50:04.000Z",
    "description": "3 days agoNoor NanjiCulture reporterGetty ImagesMuch of Virginia Giuffre's story has been heard before but in her memoir, published posthumously, the ",
    "body": "3 days agoNoor NanjiCulture reporterGetty ImagesMuch of Virginia Giuffre's story has been heard before but in her memoir, published posthumously, the abuse is described in appalling detail.Two days ahead of the book's official publication, the BBC got hold of a copy.There are revelations about Ms Giuffre's encounters with convicted sex offender Jeffrey Epstein and his former girlfriend Ghislaine Maxwell - as well as more details of her allegations about Prince Andrew, which he has always denied.Here's what we learned from the 367-page-long book.Prince Andrew allegations - and an 'orgy'In the memoir, Ms Giuffre says she had sex with Prince Andrew on three separate occasions.The third time, she says, was on Epstein's island as part of what Ms Giuffre called \"an orgy\".\"Epstein, Andy, and approximately eight other young girls and I had sex together,\" she says.\"The other girls all appeared to be under the age of 18 and didn't really speak English. Epstein laughed about how they couldn't really communicate, saying they are the easiest girls to get along with.\"She later recalls seeing the photo of Epstein walking in New York's central park with Prince Andrew, published in newspapers around the world in 2011.\"I was of course revolted to see two of my abusers together, out for a stroll,\" she writes.\"But mostly I was amazed that a member of the Royal Family would be stupid enough to appear in public with Epstein\".Prince Andrew, who reached a financial settlement with Ms Giuffre in 2022, has repeatedly denied any wrongdoing. In 2019, he told BBC Newsnight he did not remember meeting Ms Giuffre \"at all\", and that they \"never had any sort of sexual contact.\"News Syndication'Epstein told me I'd had a miscarriage'Shortly after the alleged \"orgy\" Ms Giuffre says she \"wasn't in great shape\", and had irregular bleeding and a tenderness in her abdomen.She says Epstein took her to a hospital, where she remembers being taken to an examination room. However, she says she is unclear what happened next due to pain medication affecting her memory.Soon after, she writes, one of the other girls in Epstein's house suggested to her that an incision mark near her belly button could mean she had surgery for an ectopic pregnancy.\"But Epstein told me I'd suffered a miscarriage, which is altogether something different,\" Ms Giuffre says.\"Epstein never wore a condom. Neither did the men he and Maxwell trafficked me to.\"Memories of Epstein 'torture' GiuffreAt the centre of the abuse was the late Epstein and his former girlfriend Maxwell, who is currently serving a 20-year sentence on sex-trafficking charges.Ms Giuffre says that even after many years, the memories of what Epstein put her through \"torture\" her - and says she she feared she might \"die a sex slave\" at the hands of Epstein and his circle.The memoir includes shocking descriptions of sadomasochistic sex.She says Epstein developed an interest in it over time, and began to \"experiment with whips and restraints and other instruments of torture\".\"In session after session, he would play out various fantasies, with me as the victim,\" she writes.She says the chains and contraptions he used on her \"caused so much pain that I prayed I would black out\". But she adds: \"When I did, I'd awaken to more abuse\".Ms Giuffre also details the physical effects such abuse had on her body, with dark circles under her eyes and her ribs visible beneath her skin.Rather than offering any care, Epstein was \"disgusted\" at her appearance, she says.\"'You're not the same girl you were,' Epstein said coldly. 'You need to clean yourself up',\" she writes in the book.Maxwell's part in the abuseMs Giuffre goes into detail about how she first met Maxwell, and how she introduced her to Epstein.She says Maxwell turned up at the Mar-a-Lago spa, where a teenage Ms Giuffre was working.\"She looks to be in her late thirties, and her British accent reminds me of Mary Poppins,\" Ms Giuffre recalls.She says Maxwell asked her to come for a job interview as a masseuse.When she arrived at the house, Ms Giuffre says she was taken to a room where Epstein was completely naked on a massage table. \"Just do what I do,\" she says Maxwell told her.Ms Giuffre says she started giving Epstein a massage. She says Maxwell then took her clothes off, and undressed Ms Giuffre, and they sexually abused her.\"The disappointment was excruciating. I blamed myself. 'Is sex all anyone will ever want from me',\" she writes.She later describes how Maxwell facilitated the introduction to Prince Andrew in March 2001.She writes that Maxwell woke her up and told her it was going to be a \"special day\" - that \"just like Cinderella\" she was going to meet a \"handsome prince\".Ms Giuffre later writes that even decades later, she remembers how much she feared both Epstein and Maxwell.Disappointment at Epstein's deathOne of the other themes running through the book is Ms Giuffre's desire for accountability.Epstein was convicted in Florida in 2008 for soliciting prostitution from a person under the age of 18. He died in 2019 while awaiting trial on sex trafficking charges.Ms Giuffre describes feeling disappointed at his death. \"This wasn't how justice was supposed to work out,\" she says.On Prince Andrew, she recalls standing outside a courtroom and telling journalists: \"He knows exactly what he's done… and I hope he comes clean about it.\"She later writes that she hopes the royal - who has always denied wrongdoing - will be \"held to account\".The most powerful words are perhaps saved for the ending of the book.\"In my mind, I hold a picture of a girl reaching out for help and easily finding it,\" Ms Giuffre writes.\"I picture a woman, too, who - having come to terms with her childhood pain - feels that it's within her power to take action against those who hurt her.\"If this book moves us even an inch closer to a reality like that - if it helps just one person - I will have achieved my goal.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What we learned from Virginia Giuffre's memoir",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/23c3/live/6a6a6f00-ada3-11f0-b0cb-ebfbdbe55f66.jpg"
      ],
      "datePublished": "2025-10-20T15:50:04.000Z",
      "dateModified": "2025-10-20T15:50:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]