[
  {
    "title": "Video shows Maduro's arrival in US and journey into custody",
    "url": "https://www.bbc.com/news/videos/cly308pn4r8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024xn/ichef.bbci.co.uk/images/ic/$widthxn/p0ms16wm.jpg",
    "tag": "World",
    "date": "2026-01-04T10:57:05.000Z",
    "description": "Venezuelan President Nicolás Maduro and his wife Cilia Flores have been placed in custody at a New York detention centre after he was captured during ",
    "body": "Venezuelan President Nicolás Maduro and his wife Cilia Flores have been placed in custody at a New York detention centre after he was captured during US strikes on Caracas.Footage shows a handcuffed Maduro emerging from a plane after it landed at Stewart Air National Guard Base in New York state on Saturday evening.He was then taken to the offices of the US Drug Enforcement Administration (DEA). The White House shared a video of him at the office on social media, with the caption: \"Perp walked.\"He was later taken into a helicopter at a New York heliport, which is believed to have transported him and Flores to the Metropolitan Detention Center, a federal facility in Brooklyn where they are being held.Follow live updates on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Video shows Maduro's arrival in US and journey into custody",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024xn/ichef.bbci.co.uk/images/ic/$widthxn/p0ms16wm.jpg"
      ],
      "datePublished": "2026-01-04T10:57:05.000Z",
      "dateModified": "2026-01-04T10:57:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tokyo fish auction sees bluefin tuna fetching record $3.2m",
    "url": "https://www.bbc.com/news/articles/c8d0q16zvzgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/aae5/live/b1027960-ea09-11f0-b696-4d18e91c1002.jpg",
    "tag": "World",
    "date": "2026-01-05T08:19:49.000Z",
    "description": "A bulky bluefin tuna made a splash at Tokyo's Toyosu fish market on Monday morning, fetching a record 510.3 million yen ($3.2m; £2.4m) at the market's",
    "body": "A bulky bluefin tuna made a splash at Tokyo's Toyosu fish market on Monday morning, fetching a record 510.3 million yen ($3.2m; £2.4m) at the market's first auction of the year.The winning bid for the 243kg fish came from Kiyomura Corp, the operator of popular sushi chain Sushi Zanmai, which has outlets across the country and abroad.\"The year's first tuna brings good luck,\" said Kiyoshi Kimura, the company's president and a familiar figure at the annual new year's auction, Kyodo reported.Mr Kimura, who has been dubbed the Tuna King, is known to bid high for bluefin tuna at new year's auctions. The entrepreneur told reporters after the auction that he was \"surprised at the price\", AFP reported.\"I'd thought we would be able to buy a little cheaper, but the price soared before you knew it,\" he said.Mr Kimura paid 56.5 million yen for a bluefin tuna in 2012 and 155 million yen in 2013 - setting record prices both times.In 2019 he bought a bluefin tuna with 333.6 million yen ($2.1m; £1.6m) - another historic price.Despite telling reporters at the time that he thought he \"did too much\", however, Mr Kimura has now gone on to break his own record again.The first auction at Tokyo's Toyosu fish market typically sees fish selling for exorbitant prices.Last year, the first tuna at the auction was bought for 207 million yen by Onodera Group, another food company that owns a sushi chain. It said that the fish would be served at its restaurants across the country.The frenetic energy at fish markets during such pre-dawn auctions has become a popular tourist attraction in Tokyo. Monday's auction, which started at around 05:00 local time (20:00 GMT), was no exception.The million-dollar tuna was sliced up for customers at Kimura's sushi restaurants shortly after it was auctioned off.\"I feel like I've begun the year in a good way after eating something so auspicious as the year starts,\" one of the customers at Mr Kimura's restaurant told AFP.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tokyo fish auction sees bluefin tuna fetching record $3.2m",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/aae5/live/b1027960-ea09-11f0-b696-4d18e91c1002.jpg"
      ],
      "datePublished": "2026-01-05T08:19:49.000Z",
      "dateModified": "2026-01-05T08:19:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "All 116 injured in Swiss ski resort fire identified",
    "url": "https://www.bbc.com/news/articles/c62w3zpl4ldo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/02ae/live/78c311f0-ea62-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "World",
    "date": "2026-01-05T14:12:19.000Z",
    "description": "All 116 people injured in a bar fire at a Swiss ski resort have now been identified, officials have said.Forty people were killed when a fire tore thr",
    "body": "All 116 people injured in a bar fire at a Swiss ski resort have now been identified, officials have said.Forty people were killed when a fire tore through a busy venue in Crans-Montana on New Year's Eve, with victims' age ranging from 14 to 39 years old.While the dead had all previously been identified, work had been ongoing to establish who the injured are, some of whom remain in a critical condition. Swiss police confirmed on Monday that 83 people remained in hospital, with the injured including at least 12 nationalities.Most of the injured suffered severe burns, which in some cases meant they could not be identified, police have said.Investigators said 119 people had been injured but that number has been revised down in the latest update. A criminal investigation has been launched into the French couple who managed the Le Constellation bar - a venue known to be popular with a younger crowd in the ski resort town, where the drinking age is 16.Sparklers on bottles being carried too close to the ceiling were the likely cause of the fire, a preliminary investigation has found.Beatrice Pilloud, Valais canton lead prosecutor, said in a statement that investigators were looking into whether the acoustic foam on the venue's ceiling was \"the cause of the problem\", as well as \"whether it complies with regulations\".Details have begun to emerge about some of those who lost their lives in the tragedy. Among them was Charlotte Niddam, believed to be 15, who was a pupil at two UK schools. Her family wrote on social media: \"It is with great sadness that we announce the passing of our beautiful daughter and sister Charlotte.\"The mother of Arthur Brodard, 16, confirmed he had died in the fire.She said in a video message: \"We can start our mourning, knowing that he is in peace and in the light.\"Italian media named junior golfer Emanuele Galeppini, 16, as also being among the victims.Italian Golf Federation paying tribute to the \"young athlete who carried with him passion and authentic values\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "All 116 injured in Swiss ski resort fire identified",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/02ae/live/78c311f0-ea62-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-05T14:12:19.000Z",
      "dateModified": "2026-01-05T14:12:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Berlin power cut: Activist group says it was behind fire that cut electricity supply",
    "url": "https://www.bbc.com/news/articles/c78v984ywgeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cf05/live/8b2fa930-e999-11f0-8c13-1355ac9f9bd1.jpg",
    "tag": "World",
    "date": "2026-01-04T18:44:05.000Z",
    "description": "A far-left activist group in Germany has claimed responsibility for a suspected arson attack that left tens of thousands of homes, as well as hospital",
    "body": "A far-left activist group in Germany has claimed responsibility for a suspected arson attack that left tens of thousands of homes, as well as hospitals and businesses, without power in around-freezing temperatures.The Vulkangruppe (Volcano Group) said in a statement that the fossil fuel economy, not cutting power, was the target of the action.It will take until Thursday to reconnect power for all customers, with some schools due to be closed at the start of this week.Early on Saturday, several cables on a bridge were spotted burning near a power plant in south-west Berlin. The fire was quickly put out, but around 45,000 households and 2,200 businesses were left without electricity.The state economy minister told German media that incendiary devices had caused the damage.Berlin's mayor condemned the attack, accusing \"suspected left-wing extremists\" of knowingly endangering lives, especially those of patients in hospitals.Hospitals and care facilities had received emergency power generators, officials said. The response had included transferring individuals from care sites and people requiring care in their own homes from the affected area to care facilities with reported available capacity.Some hospitals had their electricity restored by Sunday.As of Sunday afternoon, around 10,000 households and 300 businesses had been reconnected, with most still waiting to receive power back.Some schools, which were due to reopen on Monday after the Christmas holidays, will remain closed.The capital's electricity operator said it would take until Thursday to reconnect all customers.The Vulkangruppe in its statement apologised to less affluent residents impacted by the power cuts, but said it had less sympathy for \"the many owners of villas\".The statement said the attack on the gas-fired power plant was an \"act of self-defence\" and solidarity with those who protect the earth.Police told AFP news agency they believed the statement was \"plausible\" while they continued to investigate, with other media reporting police thought it was credible.The Vulkangruppe previously claimed responsibility for a suspected arson attack that halted production at Tesla's Berlin car factory in 2024.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Berlin power cut: Activist group says it was behind fire that cut electricity supply",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cf05/live/8b2fa930-e999-11f0-8c13-1355ac9f9bd1.jpg"
      ],
      "datePublished": "2026-01-04T18:44:05.000Z",
      "dateModified": "2026-01-04T18:44:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thirty-two Cubans killed during US attack on Venezuela",
    "url": "https://www.bbc.com/news/articles/cj9r0eyw0jno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/952a/live/cf102dd0-ea2c-11f0-b67b-690eb873de1b.jpg",
    "tag": "World",
    "date": "2026-01-05T14:59:21.000Z",
    "description": "The Cuban government says 32 of its nationals were killed during the US operation to seize Venezuelan leader Nicolás Maduro.It described the dead as m",
    "body": "The Cuban government says 32 of its nationals were killed during the US operation to seize Venezuelan leader Nicolás Maduro.It described the dead as members of its armed forces and intelligence agencies were killed \"in combat actions\", declaring two days of national mourning. The armed forces added the Cubans \"fell, after fierce resistance, in direct combat against the attackers or as a result of bombardments of installations\"Cuba, a long-standing ally of Venezuela, has for years supplied Maduro with his personal security detail and has personnel throughout the Venezuelan military.Cuban President Miguel Díaz-Canel said the country had been providing protection to Maduro and his wife \"at the request\" of Venezuela. US spies had been monitoring Maduro's movements for months before US forces struck, according to US General Dan Caine.Gen Caine said that they had learned where the former leader moved, lived, travelled, ate, and worked.The New York Times reported that the CIA had also recruited a \"Venezuelan source\"  who it says informed the Americans of Maduro's exact location.Many of those killed are believed to have been part of Maduro's close security detail, who were with him at the time. Venezuela has not confirmed how many people were killed, but its armed forces  have said that a \"large part\" of Maduro's security team were among the casualties.An official statement from the Cuban government read: \"Our compatriots fulfilled their duty with dignity and heroism\".The total death toll - according to an unnamed Venezuelan official cited by the New York Times - stood at 80 and was expected to rise. BBC News has not independently verified that report. In the days following the seizure of Maduro, questions have been raised over whether the Trump administration could consider a similar operation against Cuba, which, like Venezuela, has had decades of adversarial relations with the US.Speaking to reporters on Sunday, US President Donald Trump said military action would not be necessary because \"Cuba is ready to fall\". He continued: \"I don't think we need any action. Looks like it's going down. It's going down for the count.\"On Saturday, US Secretary of State Marco Rubio described Cuba as a \"disaster\" run by \"incompetent, senile men\". \"If I lived in Havana, and I was in the government, I'd be concerned - at least a little bit,\" Rubio said.In July last year, Trump signed a memorandum imposing tighter restrictions on Cuba, reversing moves by his predecessor, Joe Biden, easing pressure on the Caribbean island nation. The White House said it would end \"economic practices that disproportionately benefit the Cuban government, military, intelligence, or security agencies at the expense of the Cuban people\".It also said existing restrictions on Americans visiting Cuba would be more stringently enforced. During his first term as president, Trump took a similar approach to Cuba, implementing a raft of additional sanctions.His administration has continued an economic embargo on Cuba, despite calls by international organisations including the United Nations to end it. The blockade was initially imposed in 1962 and has been in place ever since. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thirty-two Cubans killed during US attack on Venezuela",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/952a/live/cf102dd0-ea2c-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2026-01-05T14:59:21.000Z",
      "dateModified": "2026-01-05T14:59:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Niger state: At least 30 killed in Kasuwan-Daji village attack in Nigeria",
    "url": "https://www.bbc.com/news/articles/c0r4nwy7k48o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f487/live/67759550-e975-11f0-8d69-9f0dae13c5ba.jpg",
    "tag": "World",
    "date": "2026-01-04T19:49:57.000Z",
    "description": "1 day agoTiffany Wertheimer,Makuochi OkaforandBBC HausaZakari KontagoraBandits set fire to the village market and looted goodsArmed men have violently",
    "body": "1 day agoTiffany Wertheimer,Makuochi OkaforandBBC HausaZakari KontagoraBandits set fire to the village market and looted goodsArmed men have violently stormed a village in Nigeria's Niger state, killing at least 30 people and looting shops, state authorities have said.The attackers emerged from a forest near the village of Kasuwan-Daji on Saturday and set fire to the local market, looted shops and kidnapped an unspecified number of people, police said.\"The gunmen entered the town on motorcycles carrying weapons, rounded up people and then proceeded to slaughter them, while others were shot dead,\" a local journalist told the BBC's Hausa service.Attacks and kidnappings by armed criminal gangs, known as bandits, have been a problem in Nigeria for years, but reports in western and central regions have spiked recently.Abdullahi Rofia, an official with the Niger State Emergency Management Agency, confirmed the journalist's report that villagers were rounded up and killed.He told the BBC that people in the community were terrified: \"They are hiding, they are too afraid to talk to anybody.\"They are scared that if you talk, they will turn and do the same to you.\"Niger state police spokesperson, Wasiu Abiodun, said an emergency team has been deployed to help the injured and security forces are working to rescue those kidnapped. It is illegal to pay ransom money to the criminal groups, which the government has classified as terrorists, but there are claims this is often ignored.Zakari KontagoraThe attack on Kasuwan-Daji is the latest is a spike of violent attacks against villages in Niger stateA witness to the attack told BBC Hausa that there were no security forces in the village. \"We want the government to help us. In the past, we used to hear about this problem in other places, but now it is happening in our villages,\" he said.The fear is driving people from their homes where they were born and raised.\"We are dying like chickens, and does the government care about us? \"The government hears and sees what is happening, but it is not doing anything about it. What can we do as ordinary people?\"Zakari KontagoraVillagers say the attacks are driving people away from the villages they grew up in",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Niger state: At least 30 killed in Kasuwan-Daji village attack in Nigeria",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f487/live/67759550-e975-11f0-8d69-9f0dae13c5ba.jpg"
      ],
      "datePublished": "2026-01-04T19:49:57.000Z",
      "dateModified": "2026-01-04T19:49:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ten found guilty of cyber-bullying Brigitte Macron ",
    "url": "https://www.bbc.com/news/articles/c78v6z7597yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4f78/live/6fdb5c40-ea22-11f0-b94e-6394fb6ab4de.jpg",
    "tag": "World",
    "date": "2026-01-05T12:17:12.000Z",
    "description": "13 hours agoHugh Schofield,Paris correspondentandKathryn ArmstrongTen people have been found guilty of cyber-bullying Brigitte Macron, the wife of Fre",
    "body": "13 hours agoHugh Schofield,Paris correspondentandKathryn ArmstrongTen people have been found guilty of cyber-bullying Brigitte Macron, the wife of French President Emmanuel Macron, by a Paris court. The defendants were accused of spreading false claims about her gender and sexuality, as well as making \"malicious remarks\" about the 24-year age gap between the couple. Most of the defendants were handed suspended prison sentences of up to eight months, but one was jailed immediately for failing to attend court. Some had their social media accounts suspended.The judge said the eight men and two women had acted with a clear desire to do harm to Brigitte Macron, making remarks online that were degrading and insulting.Two of the defendants - self-styled independent journalist Natacha Rey and internet fortune-teller Amandine Roy – were found guilty of slander in 2024 for claiming that France's first lady had never existed.They said her brother Jean-Michel Trogneux had changed gender and started using her name. They were later cleared on appeal. The argument used by the appeals court in clearing them was that saying someone had changed gender was not necessarily an \"attack on their honour\".  The Macrons are now taking that case to the high court of appeal.\"The most important things are the prevention courses and the suspension of some of the accounts\" of the perpetrators, Jean Ennochi, Brigitte Macron's lawyer, said after the verdict was handed down, the AFP news agency reported.Tiphaine Auzière, Brigitte Macron's daughter from a previous marriage, previously told the trial that the cyber-bullying had negatively affected her mother's health and living conditions.She said her mother \"has had to be careful about her choices of outfits, of posture... she knows perfectly well that her image will be used to back these theories\".While her mother had \"learned to live with it\", Auzière said, she suffered from the repercussions on her grandchildren who were taunted at school.Monday's ruling in France is a forerunner of a much bigger trial due in the US, where the Macrons have filed a defamation lawsuit against right-wing influencer Candace Owens, who has also voiced conspiracy theories about the first lady's gender. They alleged that she \"disregarded all credible evidence disproving her claim in favour of platforming known conspiracy theorists and proven defamers\".Owens has regularly repeated the claims on her podcast and social media channels, and in March 2024 stated that she would stake her \"entire professional reputation\" on her belief that the first lady \"is in fact a man\".The presidential couple were initially advised that the best course was to ignore the online gossip, because to go to law would simply amplify it.But last year there was a radical change of course. The Macrons decided that the scale of the online attacks was now too large to ignore. So, at risk of exposing their private selves in a US court, they determined to push back against the conspiracy theorists.A conspiracy theory claiming that Brigitte Macron is a transgender woman has circulated since her husband was first elected in 2017.Brigitte Macron first met her now-husband when she was a teacher at his secondary school.The couple married in 2007, when the future French president was 29 and she was in her mid-50s.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ten found guilty of cyber-bullying Brigitte Macron ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4f78/live/6fdb5c40-ea22-11f0-b94e-6394fb6ab4de.jpg"
      ],
      "datePublished": "2026-01-05T12:17:12.000Z",
      "dateModified": "2026-01-05T12:17:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Venezuela swears in interim leader after Maduro appears in court",
    "url": "https://www.bbc.com/news/articles/ce8gen8nnvlo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c543/live/bad368e0-ea91-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-05T22:33:18.000Z",
    "description": "Venezuela swears in interim president after defiant Maduro pleads not guilty in US court 3 hours agoFiona NimoniandMadeline HalpertReuters/Getty Image",
    "body": "Venezuela swears in interim president after defiant Maduro pleads not guilty in US court 3 hours agoFiona NimoniandMadeline HalpertReuters/Getty ImagesDelcy Rodriguez (right) was sworn in as the interim president of Venezuela on Monday Delcy Rodriguez has been sworn in as Venezuela's interim president in a parliamentary session that began with demands for the release from US custody of ousted leader Nicolas Maduro.Rodriguez, 56, vice president since 2018, said she was pained by what she called the \"kidnapping\" of Maduro and his wife Cilia Flores who were seized by US forces in an overnight raid on Saturday.In dramatic scenes inside a New York court room two hours earlier, Maduro insisted he was still the president of Venezuela as he pleaded not guilty to four charges of drug trafficking and terrorism.Meanwhile the US faced sharp criticism at the UN, but the US ambassador said the largest energy reserves in the world could not be left in the hands of an illegitimate leader, a \"fugitive from justice\".Before the court appearance, the UN Security Council held an emergency session to discuss the situation in Venezuela. The ambassador for Venezuela, Samuel Moncada, said his country had been the target of an \"illegitimate armed attack lacking any legal justification\". The US ambassador to the UN, Mike Waltz, justified the attack by describing Maduro as \"an illegitimate so-called president\". Waltz added that the US had carried out a \"surgical law enforcement operation\" to apprehend Maduro, whom he is also referred to as a \"fugitive from justice\". Maduro has been accused of narco-terrorism conspiracy, cocaine importation conspiracy, possession of machine guns and destructive devices and conspiracy to possess machine guns and destructive devices.During Monday afternoon's court appearance, a member of the public began to yell in Spanish at Maduro that he would \"pay\" for what he had done.Maduro turned to him and replied that he was a \"kidnapped president\" and a \"prisoner of war\" before being escorted out in shackles behind his wife through the back court door.\"I'm a decent man. I am still president of my country,\" Maduro said earlier during the 30-minute hearing. Judge Alvin Hellerstein, 92, interjected to tell Maduro that there would be a \"time and a place to get into all of this\".Getty ImagesA supporter of ousted Venezuela's President Nicolas Maduro carry his portrait during a rally outside the National Assembly in Caracas on. Speaking just hours after Saturday's attack - which saw over 150 aircraft and 200 US personnel enter Venezuela - Trump had vowed the US would \"run\"  Venezuela until \"a safe and proper and judicious transition\" was possible.He also promised US oil companies would move into the country to fix infrastructure \"and start making money for the country\".But despite the US president's claims, Maduro's allies remain in charge.In comments made to the US magazine The Atlantic on Sunday once it became clear Rodriguez would be sworn in, Trump warned she could \"pay a very big price, probably bigger than Maduro\" if she \"doesn't do what's right\".During a cabinet meeting, Rodriguez indicated her government would engage in some cooperation with the US, saying:  \"We invite the US government to collaborate with us on an agenda of co-operation orientated towards shared development within the framework of international law.\"Thousands of Venezuelans gathered outside the Federal Legislative Palace to show support for Maduro, his wife and the interim president Rodriguez as she was sworn in. Speaking after taking her oath, Rodriguez told the National Assembly she did so \"with pain\" because of the suffering caused by \"illegitimate military aggression\".She vowed to guarantee the peace of the country, \"the spiritual tranquillity of our people, the economic and social tranquillity of our people\".The assembly also heard from Maduro's son who expressed his support for his parents - saying that they \"will return\" to Venezuela.He also offered his \"unconditional support\" to Rodriguez.The next court hearing in Maduro's case has been scheduled for 17 March.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Venezuela swears in interim leader after Maduro appears in court",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c543/live/bad368e0-ea91-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-05T22:33:18.000Z",
      "dateModified": "2026-01-05T22:33:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'I'm a prisoner of war' - In the room for Maduro's dramatic court hearing",
    "url": "https://www.bbc.com/news/articles/cq6v25eldmdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a626/live/b3618b80-ea6b-11f0-b385-5f48925de19a.jpg",
    "tag": "World",
    "date": "2026-01-05T19:35:52.000Z",
    "description": "6 hours agoMadeline Halpertin court in New YorkThe sound of clanking leg shackles could be heard moments before Venezuelan leader Nicolás Maduro walke",
    "body": "6 hours agoMadeline Halpertin court in New YorkThe sound of clanking leg shackles could be heard moments before Venezuelan leader Nicolás Maduro walked into the door of a New York City courtroom for the first time.He then told packed rows of reporters and the public that he had just been \"kidnapped\". Minutes after his entrance, the Judge Alvin Hellerstein asked Maduro to confirm his identity so the proceedings could start. \"I am, sir, Nicolás Maduro. I am president of the Republic of Venezuela and I am here kidnapped since January 3rd,\" he told the court in a calm Spanish before an interpreter translated for the court. \"I was captured at my home in Caracas, Venezuela.\" The 92-year-old judge quickly interjected to tell Maduro that there would be a \"time and a place to get into all of this\". During the dramatic 40-minute arraignment on Monday afternoon, Maduro and his wife, Cilia Flores, pleaded not guilty to drugs and weapon charges. \"I'm innocent. I'm a decent man,\" Maduro said, with Flores adding that she was \"completely innocent\". The 63-year-old and his wife were transferred to a New York jail after they were arrested by US forces at their compound in Venezuela on Saturday, as part of a surprise overnight operation that also saw strikes on military bases.Dressed in blue and orange jail shirts and khaki pants, the two wore headphones to listen to a Spanish translation during the hearing, an attorney sitting between them. Maduro took meticulous notes on a yellow legal pad that he asked a judge to confirm that he could keep with him after the hearing. When Maduro walked into the room - the same federal courtroom where Sean \"Diddy\" Combs was tried and convicted just months earlier - he turned around to nod at several members of the audience and greet them. He maintained this calm and expressionless demeanour during the proceedings, even at the end, when a man watching from the public area suddenly shouted that Maduro would \"pay\" for his crimes. \"I'm a president and prisoner of war,\" he shouted towards the man in the audience in Spanish. The man was then escorted out of the room in tears.The proceedings were emotional for others in the court as well. Maibort Petit, a reporter from Venezuela who has covered Maduro's administration, said the US missile strikes during Maduro's arrest damaged her family home near Fuerte Tiuna in Caracas.She said it was surreal to watch her former leader escorted into court in prison garb by US marshals. Maduro's wife, Flores, was much quieter, with bandages near her eyes and forehead for injuries her lawyers said she sustained during their weekend arrest. She spoke softly with her blonde hair tied back in a bun while her lawyers asked that she be given proper medical treatment, including an xray of potentially bruised ribs and a fracture.  Maduro and his wife did not seek bail during the proceedings, but can do so at a later date, meaning they will remain in federal custody. The US has accused Maduro of narco-terrorism conspiracy, cocaine importation conspiracy, possession of machine guns and destructive devices and conspiracy to possess machine guns and destructive devices.Maduro was charged alongside his wife, son and several others. The next court hearing in the case has been scheduled for 17 March.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'I'm a prisoner of war' - In the room for Maduro's dramatic court hearing",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a626/live/b3618b80-ea6b-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-05T19:35:52.000Z",
      "dateModified": "2026-01-05T19:35:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'We need Greenland': Trump repeats threat to annex Danish territory ",
    "url": "https://www.bbc.com/news/articles/c4g0zg974v1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ad2c/live/b80291e0-ea1e-11f0-b67b-690eb873de1b.jpg",
    "tag": "World",
    "date": "2026-01-05T14:07:49.000Z",
    "description": "11 hours agoThomas Mackintosh'We need Greenland from the standpoint of national security,' Trump saysNick BeakeEurope correspondentDonald Trump has ag",
    "body": "11 hours agoThomas Mackintosh'We need Greenland from the standpoint of national security,' Trump saysNick BeakeEurope correspondentDonald Trump has again proposed annexing Greenland, after Denmark's leader urged him to \"stop the threats\" over the island. Speaking to reporters, the US president said \"we need Greenland from the standpoint of national security\".Trump has repeatedly raised the prospect of the semi-autonomous Danish territory becoming an annexed part of the US, citing its strategic location for defence purposes and mineral wealth. Greenland's Prime Minister Jens Frederik Nielsen responded by saying \"that's enough now\" and described the notion of US control over the island as a \"fantasy\". He said: \"No more pressure. No more insinuations. No more fantasies of annexation. We are open to dialogue. We are open to discussions. But this must happen through the proper channels and with respect for international law.\"Earlier, Denmark's Prime Minister Mette Frederiksen had said \"the US has no right to annex any of the three nations in the Danish kingdom\".Frederiksen added that Denmark \"and thus Greenland\" was a Nato member and covered by the alliance's security guarantee, and said a defence agreement granting the US access to the island was already in place. The Danish prime minister released her statement after Katie Miller - the wife of one of Trump's senior aides, Stephen Miller - posted on social media a map of Greenland in the colours of the American flag alongside the word \"SOON\".The Danish ambassador to the US responded to the post by Miller - a right-wing podcaster and former aide to Trump during his first term - with a \"friendly reminder\" that the two countries were allies and saying Denmark expected respect for its territorial integrity.The back and forth over the future Greenland comes in the wake of a major military operation against Venezuela on Saturday, seizing its president Nicolás Maduro and his wife and removing them to New York.Trump later said the US would \"run\" Venezuela and US oil companies would \"start making money for the country\".The situation has reignited fears that the US may consider using force to secure control of Greenland, a vast island in the Arctic - something the US president has previously refused to rule out. Trump has claimed that making it part of the United States would serve American security interests due to its strategic location and its abundance of minerals critical to high-tech sectors. The Trump administration's recent move to appoint a special envoy to Greenland prompted anger in Denmark.Greenland, which has a population of 57,000 people, has had extensive self-government since 1979, though defence and foreign policy remain in Danish hands. While most Greenlanders favour eventual independence from Denmark, opinion polls show overwhelming opposition to becoming part of the US.In comments to the BBC, UK Prime Minister Sir Keir Starmer said that only Denmark and Greenland could decide the territory's fate. \"Greenland and the Kingdom of Denmark must decide the future of Greenland, and only Greenland and the Kingdom of Denmark,\" he said.Separately, a representative for the European Union has rejected a claim by Trump that the EU \"needs\" the US to control the territory. Trump told reporters aboard Air Force One at the weekend that \"the EU needs us to have [Greenland] and they know that.\"European Commission chief spokesperson Paula Pinho told the BBC that it was \"certainly not\" the EU's position, adding that she was unaware of any discussions with the US about the issue.More on this storyFollow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weekly US Politics Unspun newsletter. Readers in the UK can sign up here. Those outside the UK can sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'We need Greenland': Trump repeats threat to annex Danish territory ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ad2c/live/b80291e0-ea1e-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2026-01-05T14:07:49.000Z",
      "dateModified": "2026-01-05T14:07:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South Korea's Lee Jae Myung meets China's Xi as he seeks a reset in ties",
    "url": "https://www.bbc.com/news/articles/c70lw9x581no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a006/live/cffa0380-ea2a-11f0-bee8-cb37bc70a803.jpg",
    "tag": "World",
    "date": "2026-01-05T08:51:15.000Z",
    "description": "16 hours agoJake Kwon,Seoul correspondentandKoh EweReutersVisiting Beijing at this time is a significant move for Lee Jae MyungSouth Korea's President",
    "body": "16 hours agoJake Kwon,Seoul correspondentandKoh EweReutersVisiting Beijing at this time is a significant move for Lee Jae MyungSouth Korea's President Lee Jae Myung is meeting Chinese leader Xi Jinping as he seeks to reset frayed ties with his country's biggest trading partner.Regional security and Beijing's unofficial ban on Korean pop culture are also on the agenda for Monday's meeting, which is their second summit since November, when  Xi visited South Korea. Given what a vital economic partner China is, experts say Lee is looking for assurances that it would not weaponise that relationship in the face of political tensions in the region.For weeks, China and Japan have been engaged in a diplomatic row over the former's claim on self-governed Taiwan, which puts Seoul, a key regional power, in an awkward spot.Getty ImagesBeijing ramped up the rhetoric against Japan after its prime minister Sanae Takaichi suggested in parliament that Tokyo could respond with its own self defence force in case of a Chinese attack on Taiwan. So visiting Beijing at this time is a significant move for Lee. Like Japan, South Korea too is an ally of the US, which supports Taiwan and supplies arms for its defence.  Xi is expected to hold a welcoming ceremony for Lee in Beijing's Great Hall of the People, state-run CCTV reports.Lee, who arrived in Beijing on Sunday, will then meet China's Premier Li Qiang and the chairman of parliament, Zhao Leji, before flying to Shanghai.Speaking before Korean residents in Beijing on Sunday, Lee said his visit would \"serve as a new starting point to fill in the gaps in Korea-China relations, restore them to normal and upgrade them to a new level\".This is the first visit by a South Korean leader since 2019. The relationship soured under Lee's predecessor, impeached ex-president Yoon Suk Yeol, who was very critical of China.    On the other side, Xi's eagerness to meet Lee signals the pressure he faces in finding a regional ally, Park Seung-chan, professor of China studies at Yongin University told the BBC.\"China may beat around the bush but its demand is clear: side with China and denounce Japan.\"Beijing has been leveraging the two countries' shared history of fighting against Japan during the 20th Century, Mr Park said. Lee is expected to hold a memorial service in Shanghai for activists who fought for Korea's independence from Japan.While Korea is \"still showing all its deference towards China\", it wants to \"strengthen its relationships with both Japan and China\", Mr Park added.Seoul has long walked a diplomatic tightrope between Beijing and Tokyo. Lee is reportedly planning to visit Japan later this month to meet Takaichi. And on Friday, South Korea's national security director Wi Sung-lac told reporters the country \"respects the One China policy\" - the diplomatic acknowledgment that Beijing is the only Chinese government. Security on the Korean Peninsula will also be part of the discussions with China, Wi told reporters.Lee has sought to engage North Korea diplomatically, but there has been little progress so far. He needs Chinese cooperation in pressuring the North's Kim Jong Un to give up his nuclear weapons. Beijing is the dictator's biggest supporter, economically and diplomatically, Russia aside.\"China is a very important cooperative partner in moving toward peace and unification on the Korean Peninsula,\" Lee said on Sunday.Earlier in the day Seoul's military said Pyongyang fired ballistic missiles off its east coast. And on Monday the North's state news agency said the country test-fired hypersonic missiles to assess deterrence capabilities following recent developments, a reference to  the US's capture of Venezuelan president Nicolas Maduro over the weekend. It remains unclear how much Lee will be able to push China on North Korea. In September, Xi had pledged to strengthen Beijing's \"traditional friendship\" with Pyongyang.And Seoul and Beijing are not natural allies. US troops have been stationed in South Korea for decades in case of an attack from the North, and last year the two sides agreed to cooperate on building nuclear-powered submarines. The announcement drew warnings from China.There are other sore spots, such as China's unofficial restrictions on South Korean music and dramas that have been in place for a decade. K-pop and K-dramas are either unavailable or difficult to access on Chinese media platforms.While China has never acknowledged a ban on Korean artists, it's believed to be a protest against South Korea's decision to deploy a US anti-missile system in 2016, which China sees as a threat to its military operations in the region. Persuading Beijing to lift these restrictions is said to be high on Lee's agenda. China is a massive market for Korean entertainment, which is already a huge global success.                                                        Lee will also be seeking to put a stop to China's build-up of maritime structures in waters between the two countries. Beijing says the structures are fish-farming equipment, but they have sparked security concerns in Seoul.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South Korea's Lee Jae Myung meets China's Xi as he seeks a reset in ties",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a006/live/cffa0380-ea2a-11f0-bee8-cb37bc70a803.jpg"
      ],
      "datePublished": "2026-01-05T08:51:15.000Z",
      "dateModified": "2026-01-05T08:51:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump intervention warning over Iran protests 'reckless' says foreign minister ",
    "url": "https://www.bbc.com/news/articles/c2057md3gvro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fea1/live/bafc3380-e855-11f0-b67b-690eb873de1b.jpg",
    "tag": "World",
    "date": "2026-01-04T00:11:46.000Z",
    "description": "Donald Trump's warning that the US will intervene if peaceful protesters are killed was \"reckless and dangerous\", Iran's foreign minister has said.Abb",
    "body": "Donald Trump's warning that the US will intervene if peaceful protesters are killed was \"reckless and dangerous\", Iran's foreign minister has said.Abbas Araghchi's comments came after the US president said Washington \"will come to their rescue\" in reference to demonstrators taking part in protests over Iran's economy, writing in a brief social media post: \"We are locked and loaded and ready to go.\"Araghchi indicated Iran's armed forces were on standby and \"know exactly where to aim\" in the event of an attack.At least eight people are reported to have died during the week-long protests, as of Saturday morning.Trump wrote on Friday: \"If Iran shots [sic] and violently kills peaceful protesters, which is their custom, the United States of America will come to their rescue.\"The US president did not specify what action Washington might take. Previously, it has carried out strikes on Iran's nuclear sites, which elicited a retaliatory strike on a US base in Qatar.\"Given President Trump's deployment of the National Guard within US borders, he of all people should know that criminal attacks on public property cannot be tolerated,\" Araghchi wrote on X.Iran would \"forcefully reject any interference in their internal affairs\", he added.On Saturday, Iran's Supreme Leader Ayatollah Ali Khamenei addressed the wave of protests, saying that \"rioters must be put in their place\". He said shopkeepers' original protest about the collapse in foreign exchange rates was \"legitimate\", but he claimed people \"provoked by the enemy\" were taking advantage to shout anti-government slogans.Protests have spread to a number of cities and towns with running battles reported between security forces and demonstrators. On Saturday the state-affiliated Mehr and Fars news agencies reported that two protesters and a member of the security forces were killed in the western town of Malekshahi when, they said, protesters tried to enter a police station.The EU said it was \"concerned\" by reports of deaths and called for Tehran to exercise \"maximum restraint\" against the protesters as well as upholding their right to \"freedom of expression, association and peaceful assembly\".The protests began in Tehran, with shopkeepers angered by another sharp fall in the value of the Iranian currency, the rial, against the US dollar on the open market.By Tuesday, university students were involved and the protests had spread to several cities, with people chanting against the country's clerical rulers.Two people have since died in clashes between protesters and security forces in the south-western city of Lordegan, according to the semi-official Fars news agency and the human rights group Hengaw, which said they were protesters, naming them as Ahmad Jalil and Sajjad Valamanesh.Three people were killed in Azna, while another died in Kouhdasht, all in the west of the country, Fars reported. It did not specify whether they were demonstrators or security forces personnel.One death was reported in Fuladshahr, central Iran, and another casualty in Marvdasht, in the south.BBC has not been able to independently verify the deaths.The demonstrations have been the most widespread since an uprising in 2022 sparked by the death in custody of Mahsa Amini, a young woman accused by morality police of not wearing her veil properly, but they have not been on the same scale.Iranian President Masoud Pezeshkian has previously said he will listen to the \"legitimate demands\" of the protesters. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump intervention warning over Iran protests 'reckless' says foreign minister ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fea1/live/bafc3380-e855-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2026-01-04T00:11:46.000Z",
      "dateModified": "2026-01-04T00:11:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Greece: Thousands stranded across Europe as air space disrupted",
    "url": "https://www.bbc.com/news/articles/cgezjlzwz1do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a327/live/d85d0ed0-e978-11f0-b67b-690eb873de1b.jpg",
    "tag": "World",
    "date": "2026-01-04T14:36:13.000Z",
    "description": "1 day agoAleks PhillipsandNikos PapanikolaouGetty ImagesThessaloniki Airport closed entirely after air traffic communication was knock outThousands of",
    "body": "1 day agoAleks PhillipsandNikos PapanikolaouGetty ImagesThessaloniki Airport closed entirely after air traffic communication was knock outThousands of passengers are stranded across Europe after a communications failure forced Greece to close its airspace, causing widespread cancellations and delays.Officials are working to understand why radio communications were disrupted on Sunday morning, prompting the temporary suspension of arrivals and departures.Some departures have since been allowed to resume - though inbound flights are still being told to divert or return to their point of origin. Athens' main airport is among the worst affected, while Thessaloniki airport has closed entirely.The timing of the disruption has raised fears that travellers will not be able to get home before the start of the working week.\"I was supposed to fly to London, via Stockholm, with SAS,\" one passenger at Athens International Airport told Greek broadcaster Mega TV. \"I'm working on Newport Hospital tomorrow morning. I'm not going to be there on time, I don't know what else to say. \"Who is going to pay for the additional cost this travel will cost me? We still don't know if and when we're going to leave, no one is telling us anything.\"More than 90 flights have been affected in and out of Athens airport alone - though some flights have since been able to resume.A member of staff in the airport told the BBC that 35 aircraft an hour were now being allowed to take off, but it was still unable to take inbound flights.Flights departing from Dublin, Barcelona and Paris were earlier ordered to return to their airports of origin, while services from Copenhagen and Malta were cancelled altogether. Other arrivals into Athens were placed on standby, while flights in and out of other Greek airports have also been affected. Three flights out of Heraklion airport on the island of Crete, including one to Munich, have been delayed, according to public broadcaster ERT.Most inbound flights are being diverted to Turkey if not cancelled outright, it reports.Reuters / Flightradar24Greek airspace was nearly empty earlier on Sunday due to the technical faultThe disruption comes at a busy time for air travel in and out of Athens, which typically sees more than 600 scheduled flights per day, as people return from winter holidays.In the chaos, some passengers have complained of a lack of information. One told news site Flash: \"We have no updates. They told us that we will be able to leave but I don't think this is true. On the departures board I can't see my flight, and I'm supposed to leave shortly.\"Another, who had been on a flight to Rhodes when it turned around and headed back to Athens, told news agency Reuters: \"From that moment until now we have no information whatsoever.\"Domestic travellers may have the option of getting home on Greece's rail network, but this would take significantly longer.The issue that caused the disruption is thought to concern the radio system used by air traffic controllers to communicate with planes in their airspace.Panagiotis Psarros, chair of the Association of Greek Air Traffic Controllers, told ERT that all frequencies were \"suddenly lost\", adding: \"We could not communicate with aircraft in the sky.\"The broadcaster later reported than an initial investigation by the Greek security services suggested the problem may be due to the failure of an antenna in the Gerania Mountains near Athens. Italy, Turkey and Cyprus are assisting Greece in managing the situation.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Greece: Thousands stranded across Europe as air space disrupted",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a327/live/d85d0ed0-e978-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2026-01-04T14:36:13.000Z",
      "dateModified": "2026-01-04T14:36:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": " World leaders react to US capture of Venezuelan leader Nicolás Maduro",
    "url": "https://www.bbc.com/news/articles/czx1rpxzyx9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9283/live/10947cd0-e969-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "World",
    "date": "2026-01-04T06:02:11.000Z",
    "description": "'Deeply shocked': World leaders react to US attack on Venezuela 2 days agoClaire KeenanTrump on Venezuela: \"We are going to run the country\"Leaders ar",
    "body": "'Deeply shocked': World leaders react to US attack on Venezuela 2 days agoClaire KeenanTrump on Venezuela: \"We are going to run the country\"Leaders around the world have responded with a mix of condemnation and support to the US capture of Venezuela's President Nicolás Maduro. Following a large-scale strike on Venezuela on Saturday, Maduro and his wife were captured by US forces and removed from the country. The pair have been indicted on drug charges in New York. In an initial response, UK Prime Minister Keir Starmer said his government would \"shed no tears\" for the end of Maduro's regime.Neighbouring Latin American countries condemned the actions, as did Venezuela's long-term allies, Russia and China. China said it was \"deeply shocked and strongly condemns\" the use of force against a sovereign country and its president. Russia accused the US of committing \"an act of armed aggression\".Iran, which is locked in its own dispute with Trump over his promise of intervention in its country, called the strikes a \"flagrant violation of the country's national sovereignty\".Trump said the US will \"run\" Venezuela \"until we can do a safe, proper and judicious transition\". Many Latin American leaders condemned the US actions. Brazil's President Luiz Inacio Lula Da Silva wrote on X that the actions \"cross an unacceptable line\", adding that \"attacking countries in flagrant violation of international law is the first step toward a world of violence, chaos, and instability\". Colombian President Gustavo Petro called the strikes an \"assault on the sovereignty\" of Latin America, while Chile's President Gabriel Boric expressed \"concern and condemnation\" and called for \"a peaceful solution to the serious crisis affecting the country\".Cuban President Miguel Diaz-Canel accused the US of a \"criminal attack\", while Uruguay said in an official statement that it was monitoring developments \"with attention and serious concern\" and \"rejects, as it always has, military intervention\".Trump has indicated that Cuba could become part of a broader US policy in the region, calling it a failing nation. US Secretary of State Marco Rubio said Cuba was a disaster run by incompetent leaders who supported Maduro's administration and that the government in Havana should be concerned.The Venezuelan Interior Minister Diosdado Cabello urged citizens to remain calm and to trust the country's leadership and military, saying \"the world needs to speak out about this attack\" according to news agency Reuters. But Argentinian President Javier Milei – who Trump has described as his \"favourite president\" – wrote \"freedom moves forward\" and \"long live freedom\" on social media.Getty ImagesGovernment supporters hold posters of the late Hugo Chávez (left) and Venezuela's President Nicolás MaduroMeanwhile, UK Prime Minister Sir Keir Starmer refused to be drawn into whether or not the military action may have broken international law.He did not condemn the US strikes in an interview with the BBC's Sunday with Laura Kuenssberg programme on Saturday morningHe said he was waiting to establish all the facts but would not \"shy away from this\", adding he was a \"lifelong advocate of international law\".The UK was not involved in the strikes and Sir Keir said he had not spoken to Trump about the operation.Later on Saturday, he posted on X that the UK \"regarded Maduro as an illegitimate president and we shed no tears about the end of his regime\".\"The UK government will discuss the evolving situation with US counterparts in the days ahead as we seek a safe and peaceful transition to a legitimate government that reflects the will of the Venezuelan people,\" he added.The EU's top diplomat Kaja Kallas reiterated the bloc's position that Maduro lacks legitimacy, that there should be a peaceful transition of power, and that the principles of international law must be respected.French President Emmanuel Macron said the transition of power \"must be peaceful, democratic, and respectful of the will of the Venezuelan people\" in a post on X.He added he hoped González - the opposition's 2024 presidential candidate - could ensure the transition.German Chancellor Friedrich Merz said the legality of the US operation was \"complex\" and international law in general must apply. He warned that \"political instability must not be allowed to arise in Venezuela\".UN Secretary General Antonio Guterres said he was \"deeply concerned that the rules of international law have not been respected\", his spokesperson said. He was \"deeply alarmed\" by the strikes, which set a \"dangerous precedent\". In the US, Senate Minority Leader Chuck Schumer, a Democrat, said: \"Let me be clear, Maduro is an illegitimate dictator, but launching military action without congressional authorisation, without a federal plan for what comes next, is reckless.\"Elsewhere, Prime Minister Benjamin Netanyahu of Israel, a staunch US ally, congratulated Trump on his \"bold and historic leadership on behalf of freedom and justice\". Canada's Foreign Minister Anita Anand said \"Canada calls on all parties to respect international law and we stand by the people of Venezuela and their desire to live in a peaceful and democratic society\". Canada was engaging with international partners, she said. Norway's Foreign Minister Espen Barth Eide said \"international law is universal and binding for all states. \"The American intervention in Venezuela is not in accordance with international law.\" More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": " World leaders react to US capture of Venezuelan leader Nicolás Maduro",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9283/live/10947cd0-e969-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2026-01-04T06:02:11.000Z",
      "dateModified": "2026-01-04T06:02:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump's seizure of Maduro raises thorny legal questions, in US and abroad",
    "url": "https://www.bbc.com/news/articles/cr4krkz7242o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ba5b/live/0e7126c0-ea5d-11f0-abe2-ab0fb32e3a9d.jpg",
    "tag": "World",
    "date": "2026-01-05T18:02:12.000Z",
    "description": "7 hours agoKayla EpsteinGetty ImagesOn Monday morning, a handcuffed Nicholas Maduro stepped off a helicopter in New York City, flanked by armed federa",
    "body": "7 hours agoKayla EpsteinGetty ImagesOn Monday morning, a handcuffed Nicholas Maduro stepped off a helicopter in New York City, flanked by armed federal agents. The Venezuelan president had spent the night in a notorious federal jail in Brooklyn, before authorities transported him to a Manhattan courthouse to face criminal charges.Attorney General Pam Bondi has said Maduro was brought to the US to \"face justice\". But international law experts question the legality of the Trump administration's actions, and argue the US may have violated international statutes governing the use of force. Domestically, however, the US's actions fall into a legal grey area that may still result in Maduro standing trial, regardless of the circumstances that brought him there.The US maintains its actions were legally justified. The Trump administration has accused Maduro of \"narco-terrorism\" and enabling the transport of \"thousands of tonnes\" of cocaine to the US.\"All personnel involved acted professionally, decisively, and in strict accordance with US law and established protocols,\" Bondi said in a statement.Maduro has long denied US allegations that he oversees an illegal drug operation, and in court in New York on Monday he entered a plea of not guilty.Watch: Nicolás Maduro and wife en route to New York courtAlthough the charges are focused on drugs, the US prosecution of Maduro comes after years of criticism of his leadership of Venezuela from the wider international community.In 2020, UN investigators said Maduro's government had committed \"egregious violations\" amounting to crimes against humanity - and that the president and other top officials were implicated. The US and some of its allies have also accused Maduro of rigging elections, and did not recognise him as the legitimate president.Maduro's alleged links to drugs cartels are the focus of this legal case, yet the US methods in putting him before a US judge to answer these charges are also under scrutiny.Conducting a military operation in Venezuela and whisking Maduro out of the country under the cover of darkness was \"completely illegal under international law,\" said Luke Moffett, a professor at the Queen's University Belfast School of Law.Professor Moffett and other experts pointed to a host of issues raised by the US operation.The United Nations Charter prohibits members from threatening or using force against other states. It allows for \"self-defence if an armed attack occurs\" but that threat must be imminent, Prof Moffett said. The other exception occurs when the UN Security Council approves such an action, which the US did not obtain before it took action in Venezuela.International law would consider the drug-trafficking offences the US alleges against Maduro to be a law enforcement matter, experts say, not a violent attack that might justify one country to take military action against another.In public statements, the Trump administration has characterised the operation as, in the words of Secretary of State Marco Rubio, \"basically a law enforcement function\", rather than an act of war or a military campaign.Maduro has been under indictment on drug trafficking charges in the US since 2020; the justice department has now issued a superseding - or revised - indictment against the Venezuelan leader. The Trump administration essentially says it is now enforcing it.\"The mission was conducted to support an ongoing criminal prosecution tied to large-scale narcotics trafficking and related offenses that have fuelled violence, destabilised the region, and contributed directly to the drug crisis claiming American lives,\" Bondi said in her statement.But since the operation, several legal experts have said the US broke international law by taking Maduro out of Venezuela on its own.\"A country cannot go into another foreign country and arrest people,\" said Milena Sterio, an expert on international criminal law at Cleveland State University College of Law. \"If the US wants to arrest someone in another country, the proper way to do that is extradition.\"Even if an individual faces indictment in America, \"The US has no right to go around the wold enforcing the arrest warrant in the territory of other sovereign states,\" she said.Maduro's lawyers in court in Manhattan on Monday said they would challenge the legality of the US operation which took him from Caracas to New York.There's also a long-running legal debate about whether presidents must follow the UN Charter. The US Constitution considers treaties the country enters to be the \"supreme law of the land\".But there's a clear historic example of a presidential administration arguing it did not have to comply with the charter.In 1989, the George HW Bush administration removed Panama's military leader Manuel Noriega and brought him to the US to face drug trafficking charges. An internal Justice Department memo from the time argued that the president had the legal authority to order the FBI to arrest individuals who violated US law, \"even if those actions contravene customary international law\" - including the UN Charter.Getty ImagesGeneral Manuel Antonio Noriega speaks in May 1988 in Panama CityThe author of that memo, William Barr, became the US attorney general during Trump's first term, and brought the initial 2020 indictment against Maduro.However, the memo's reasoning later came under criticism from legal scholars. US courts have not explicitly weighed in on the matter.In the US, the question of whether this operation broke any domestic laws is complicated.The US Constitution gives Congress the power to declare war, but puts the president in charge of the armed forces. A Nixon-era law called the War Powers Resolution places restrictions on the president's ability to use military force. It requires the president to consult Congress before committing US troops abroad \"in every possible instance,\" and notify Congress within 48 hours of deploying forces.The Trump administration did not give Congress a heads up before the action in Venezuela \"because it endangers the mission,\" Rubio said on Saturday.However, several presidents have tested the limits of their powers to order military actions without congressional approval, and Trump has been carrying out military strikes on alleged drug boats in the Caribbean for months despite bipartisan criticism.US federals courts now have jurisdiction over Maduro, regardless of how he arrived.Maduro could argue that the US violated international laws when it forcibly brought him to New York. But extensive legal precedent suggests a trial against Maduro would go forward, Prof Sterio said.\"Our courts have long recognised that for a defendant, even if they are kidnapped or abducted or forcibly brought to the US, that is not grounds for tossing out the case,\" she said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump's seizure of Maduro raises thorny legal questions, in US and abroad",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ba5b/live/0e7126c0-ea5d-11f0-abe2-ab0fb32e3a9d.jpg"
      ],
      "datePublished": "2026-01-05T18:02:12.000Z",
      "dateModified": "2026-01-05T18:02:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]