[
  {
    "title": "Brigitte Macron: Trial begins for 10 accused of sexist cyber-bullying of president's wife",
    "url": "https://www.bbc.com/news/articles/ce3knel0895o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/563d/live/5e280f00-b329-11f0-9c26-756530926d22.jpg",
    "tag": "World",
    "date": "2025-10-27T11:59:48.000Z",
    "description": "Ten people accused of sexist cyber-bullying of the French president's wife, Brigitte Macron, are due to go on trial this week in Paris.The defendants ",
    "body": "Ten people accused of sexist cyber-bullying of the French president's wife, Brigitte Macron, are due to go on trial this week in Paris.The defendants are accused of spreading unsubstantiated claims over her gender and sexuality, as well as making \"malicious remarks\" about the 24-year age gap between Brigitte and her husband, Emmanuel Macron.If found guilty, the defendants face up to two years' imprisonment.Among the ten people due to appear in the dock on Monday and Tuesday are an elected official, a gallery owner and a teacher, according to French media.Two of them - self-styled independent journalist Natacha Rey and internet fortune-teller Amandine Roy – were found guilty of slander last year for claiming that France's first lady had never existed, and that her brother Jean-Michel Trogneux had changed gender and started using her name.But a court of appeals later acquitted Rey and Roy on the grounds that their statements did not constitute defamation. Mrs Macron and her brother are appealing the decision.A conspiracy theory centred around the notion that Brigitte Macron is a transgender woman has been swirling since her husband won a first term in office in 2017.The unsubstantiated claims over Mrs Macron's gender have been gaining ground in the US, mostly promoted by right-wing influencer Candace Owens.Last July the Macrons filed a lawsuit against Owens, alleging that she \"disregarded all credible evidence disproving her claim in favour of platforming known conspiracy theorists and proven defamers\".Speaking to the BBC's Fame Under Fire podcast, the Macrons' lawyer in the case, Tom Clare, said that Brigitte Macron had found the claims \"incredibly upsetting\" and they were a \"distraction\" to the French president.\"It is incredibly upsetting to think that you have to go and subject yourself, to put this type of proof forward,\" he said.Emmanuel Macron has said pursuing legal action against Owens was about \"defending his honour\" and that the influencer had peddled false information \"with the aim of causing harm, in the service of an ideology and with established connections to far-right leaders.\"Mrs Macron first met her now-husband when she was a teacher at his secondary school. The couple ended up marrying in 2007, when Mr Macron was 29 and Mrs Macron was 54.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brigitte Macron: Trial begins for 10 accused of sexist cyber-bullying of president's wife",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/563d/live/5e280f00-b329-11f0-9c26-756530926d22.jpg"
      ],
      "datePublished": "2025-10-27T11:59:48.000Z",
      "dateModified": "2025-10-27T11:59:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Argentina elections: Javier Milei and his 'chainsaw' austerity win big",
    "url": "https://www.bbc.com/news/articles/c4gw8qpyvqdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/68fd/live/97d1f7c0-b324-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-10-27T09:30:24.000Z",
    "description": "Argentina's Milei wins big in midterms with 'chainsaw' austerity11 hours agoIone WellsSouth America correspondent in Buenos AiresAFP via Getty ImagesJ",
    "body": "Argentina's Milei wins big in midterms with 'chainsaw' austerity11 hours agoIone WellsSouth America correspondent in Buenos AiresAFP via Getty ImagesJavier Milei won nearly 41% of the vote in Argentina's midterm electionsArgentina's President Javier Milei has led his party to a landslide victory in Sunday's midterm elections, after defining the first two years of his presidency with radical spending cuts and free-market reforms.His party, La Libertad Avanza, won nearly 41% of the vote, taking 13 of 24 Senate seats and 64 of the 127 lower-house seats that were contested.His gains will make it easier for Milei to push ahead with his programme to slash state spending and deregulate the economy.President Donald Trump congratulated Milei on social media, saying: \"He's making us all look good.\" Before the vote, Trump made it clear a $40bn US lifeline for Argentina would depend on Milei keeping political momentum.Milei's supporters welcomed that, though critics accused Trump of foreign interference in Argentina's elections.In a nod to his North American ally, Milei told cheering supporters: \"We must consolidate the path of reform we have embarked upon to turn Argentina's history around once and for all… to make Argentina great again.\"Before these elections his party had just seven Senate seats and 37 seats in the lower house.That meant his programme of spending cuts and reforms faced various political obstacles.His vetoes of bills to boost funding for state universities, people with disabilities and children's healthcare were all overturned by opposition lawmakers.After Sunday's result, hundreds of his supporters gathered, cheering, outside a hotel in Buenos Aires where he was watching the result.\"Milei didn't have 15% of Congress in his favour. Now, with many more deputies and senators, he'll be able to change the country in a year,\" one young voter called Dionisio said.\"Our province was devastated by previous governments,\" another voter, Ezequiel, said.\"Now, thank God, freedom has won. We want our daughter to grow up in this beautiful country. What happened in previous years is regrettable.\"Getty ImagesHundreds of Milei's supporters gathered in the streets to celebrate the election resultThese elections were the first national test of President Milei's popularity since he took office in 2023, pledging to shrink state spending by taking a metaphorical \"chainsaw\" to it. He brandished a real one during his campaign rallies.He's since cut budgets for education, pensions, health, infrastructure, and subsidies, and laid off tens of thousands of public sector workers.Supporters, including Trump, hail him for taming inflation - which hit triple figures annually before he took office - cutting the deficit, and restoring investor confidence.His critics, though, argue the price has been job losses, a decline in manufacturing, crumbling public services, a fall in people's purchasing power and an imminent recession.Juliana, who works with children with disabilities in Tucumán province, is concerned that a law to increase funding for people with disabilities - which Milei vetoed, before being overturned - could be \"in danger\" with the president's position strengthened in Congress.\"Our salaries are low, it remains the same, while other things are increasing. We still don't see a change,\" she added.Veronica, a retired police officer, has been hit by Milei's pension cuts.\"You see a lot of poverty,\" she said. \"It's very hard: for retirees, for people with children with disabilities, for young people. There's a lot of unemployment. Many factories have closed.\"Juliana (L) and Veronica (R) are concerned about possible spending cuts Milei has also kept inflation down by propping up the peso, leaving it overvalued and draining reserves ahead of $20bn of debt repayments next year.This had caused alarm that Argentina could be hurtling towards an economic crisis.That, coupled with a poor election result in Buenos Aires province in September, spooked the financial markets that Milei's cost-cutting agenda may not be politically sustainable.These factors prompted the US to step in to help. It has now offered Argentina a potential $40bn lifeline via the combination of a currency swap, buying pesos and arranging private investment.\"If he wins, we're staying with him. If he doesn't win, we're gone,\" Trump had threatened.Before this election, doubts had grown about Milei's political future due to some voters tiring of his austerity programme, as well as a series of corruption scandals that had rocked his party.This election turnout was 67.9%, the lowest in a national election in decades, representing widespread apathy with politicians of all stripes.Some voters backed him reluctantly.\"Milei has two years left and should try to do what he can,\" said Dardo, a business owner in Buenos Aires. \"I think we're on the right path, but the middle and working classes are suffering too much.\"He is sceptical the support from the US will help, saying \"we're going to have to pay for it at some point\".Others, like political science student Thiago, said they understood the need for fiscal balance but questioned Milei's means.\"There's a lack of investment in hospitals, infrastructure, in people with disabilities,\" he said. \"There's a certain false hope.\"This election result, though, shows that many Argentines remain unwilling to return to the Peronist model Milei blames for decades of economic mismanagement. Getty ImagesMilei's took office in 2023 with a pledge to shrink state spending by taking a metaphorical \"chainsaw\" to it\"Argentines showed that they do not want to return to the failed model, the model of inflation… the model of a useless state,\" he declared.Financial markets are expected to rally after the win: a sign that, for now, Milei's political survival has also kept his economic experiment alive - and US support in place.His new mandate gives him the power to implement more radical changes ahead of the next presidential election in 2027, when his name could be on the ballot once more.The question now is whether ordinary voters start feeling better off, or if the pain of some of his cuts tests people's patience once more.For now, it appears a significant proportion of voters are – once again – prepared to give him time.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Argentina elections: Javier Milei and his 'chainsaw' austerity win big",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/68fd/live/97d1f7c0-b324-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-27T09:30:24.000Z",
      "dateModified": "2025-10-27T09:30:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says he had 'perfect' MRI at Walter Reed hospital",
    "url": "https://www.bbc.com/news/articles/cze6y0y36ppo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4ee6/live/1bde2750-b343-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-10-27T14:48:15.000Z",
    "description": "President Donald Trump said he had an MRI scan during a recent visit to Walter Reed National Military Medical Center. \"I did. I got an MRI. It was per",
    "body": "President Donald Trump said he had an MRI scan during a recent visit to Walter Reed National Military Medical Center. \"I did. I got an MRI. It was perfect,\" the president told reporters on board Air Force One on Monday on his way to a week-long trip in Asia. Trump, who at age 79 is one of the oldest presidents in US history, did not say why he got the scan, which can be used to check for a wide range of issues. The scan took place during Trump's visit to Walter Reed earlier this month, when his  physician said he was in \"exceptional health\".\"The doctor said [it] was some of the best reports, for the age, they've ever seen,\" Trump said Monday.Asked why he received the MRI, which stands for magnetic resonance imaging, Trump told reporters to \"ask the doctors\".Presidential physician Dr Sean Barbabella said in a statement at the time that Trump's appointment was a \"scheduled follow-up evaluation\" \"as part of his ongoing health maintenance plan and included advanced imaging, laboratory testing, and preventative health assessments\".The president \"continues to demonstrate excellent overall health\", Dr Barbabella said. MRI scans use strong magnetic fields to create an image of the inside of a patient's body, and is especially useful for looking at soft tissues, according to the US National Institutes of Health (NIH).Earlier this year, the White House announced that Trump had been diagnosed with a medical condition in his veins called chronic venous insufficiency.Press Secretary Karoline Leavitt said Trump had noticed swelling in his legs, prompting a check-up with his doctor who diagnosed him with the condition.Chronic venous insufficiency occurs when leg veins don't allow blood to flow back up to the heart, causing it to pool in the lower limbs. It is a \"benign and common\", in older individuals, according to a note from Barbabella.Trump had also been recently photographed with patches of makeup on the back of his hand. The White House has said it is unrelated to the vein condition but is instead bruising as a result of frequent handshaking.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says he had 'perfect' MRI at Walter Reed hospital",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4ee6/live/1bde2750-b343-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-27T14:48:15.000Z",
      "dateModified": "2025-10-27T14:48:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ivory Coast president, 83, secures fourth term after two rivals barred",
    "url": "https://www.bbc.com/news/articles/cddrzl9nmm2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0f9b/live/28e1d410-b366-11f0-ba75-093eca1ac29b.jpg",
    "tag": "World",
    "date": "2025-10-27T19:47:11.000Z",
    "description": "24 minutes agoWedaeli Chibelushi and Thomas NaadiIvory Coast's President Alassane Ouattara has secured a fourth term in an election which two of his b",
    "body": "24 minutes agoWedaeli Chibelushi and Thomas NaadiIvory Coast's President Alassane Ouattara has secured a fourth term in an election which two of his biggest challengers were barred from, provisional results show.Ouattara, 83, won 89.8% of the vote, the electoral commission said on Monday, and businessman Jeal-Louis Billon came a distant second with only 3.09%.The landslide victory is not a huge surprise, as after being banned from the presidential race, former President Laurent Gbagbo and Credit Suisse ex-CEO Tidjane Thiam had urged their supporters to boycott the vote.Voter turnout reached just 50.1%, according to the electoral commission. Monday's results are provisional and the final outcome will be announced by the Constitutional Council after it rules on any election petitions.On Sunday, the opposition group made up of Gbagbo and Thiam's parties denounced the election as a \"civilian coup d'etat,\" saying they would not recognise Ouattara as a validly elected leader.Ouattara first assumed the presidency in 2011, following Gbagbo's arrest after his refusal to accept defeat in the 2010 election.Ouattara was originally restricted to serving two terms, but a 2016 constitutional overhaul allowed him to seek re-election in 2020, in a vote that was boycotted by the opposition.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ivory Coast president, 83, secures fourth term after two rivals barred",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0f9b/live/28e1d410-b366-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-27T19:47:11.000Z",
      "dateModified": "2025-10-27T19:47:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lithuania to shoot down smuggling balloons, PM warns",
    "url": "https://www.bbc.com/news/articles/cp8em20q975o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/afed/live/41b2ccb0-b339-11f0-8c7d-e3b2a8158887.jpg",
    "tag": "World",
    "date": "2025-10-27T14:07:06.000Z",
    "description": "6 hours agoLauren TurnerGetty ImagesLithuania will begin to shoot down balloons used to smuggle cigarettes from neighbouring Belarus, its prime minist",
    "body": "6 hours agoLauren TurnerGetty ImagesLithuania will begin to shoot down balloons used to smuggle cigarettes from neighbouring Belarus, its prime minister has warned.The measure comes after balloons entering Lithuanian airspace forced Vilnius Airport to close multiple times over the past week, including at the weekend, with the government also closing Belarus border crossings temporarily each time.Border checkpoints will now be closed indefinitely in response to the helium weather balloons. Prime Minister Inga Ruginiene said \"we are ready to take even the most severe actions when our airspace is violated\".Announcing the actions at a press conference on Monday, Ruginiene said the army was taking \"all necessary measures\" to shoot down balloons.About the border closure, Ruginiene said diplomats will still be able to travel between the two countries, and EU citizens and Lithuanians can enter from Belarus, but no other movement will be allowed. \"In this way, we are sending a signal to Belarus and saying that no hybrid attack will be tolerated here, and we will take all the strictest measures to stop such attacks,\" she said.There has been no immediate response from Belarus.Lithuania plans to consult its allies over the threat posed from the balloons and may discuss activating Nato's Article 4 - a request for consultation by a Nato member country on any issue of concern, especially related to its security - she added.State Border Guard Service via APLithuanian airports were closed three times at the weekend due to weather balloons from Belarus, affecting 112 flights and more than 16,500 passengers, according to Baltic News Service. Earlier this month, 25 balloons entered Lithuania from Belarus, leading to 30 flight cancellations affecting 6,000 passengers, Lithuania's National Crisis Management Centre (NCMC) told the BBC.The phenomenon is not new: as of 6 October, 544 balloons were recorded entering Lithuania from Belarus this year, an NCMC spokesman said, while 966 were recorded last year. Other European airports - including in Copenhagen and Munich - have also been affected by air incursions, including drone sightings, in recent weeks. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lithuania to shoot down smuggling balloons, PM warns",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/afed/live/41b2ccb0-b339-11f0-8c7d-e3b2a8158887.jpg"
      ],
      "datePublished": "2025-10-27T14:07:06.000Z",
      "dateModified": "2025-10-27T14:07:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Red Cross heading to Gaza to retrieve another hostage body, says Israel",
    "url": "https://www.bbc.com/news/articles/cly9z0mvzyko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d7ad/live/d2161320-b36b-11f0-a5ed-d926a0229916.jpg",
    "tag": "World",
    "date": "2025-10-27T19:31:53.000Z",
    "description": "39 minutes agoDavid GrittenJerusalemAFP via Getty ImagesEfforts are continuing to find the bodies of the hostages that are still in GazaThe Israeli mi",
    "body": "39 minutes agoDavid GrittenJerusalemAFP via Getty ImagesEfforts are continuing to find the bodies of the hostages that are still in GazaThe Israeli military says the Red Cross is on its way to northern Gaza for the handover of another deceased hostage. If confirmed, it will be the 16th body of a hostage who died on or after the 7 October attacks to be returned to Israel.It comes as the Israeli government said it has allowed a member of Hamas into territory in Gaza controlled by the Israel Defense Forces (IDF) to help Red Cross and Egyptian personnel search for the bodies of the remaining dead hostages.Israel accuses Hamas of violating the two-week-old Gaza ceasefire deal because it has not returned all of the 28 hostages' bodies it was holding.The Palestinian group says it is committed to the deal brokered by the US, Egypt, Qatar and Turkey, but that it needs help to find remains buried under the rubble left by two years of war.\"The Red Cross, the Egyptian technical team, and a Hamas person have been permitted to enter beyond the IDF's Yellow Line position in Gaza under close IDF supervision,\" government spokeswoman Shosh Bedrosian told a briefing on Monday.She also said the Egyptians would bring in more equipment, including \"tractor-type vehicles\".All 20 living Israeli hostages were released soon after the ceasefire took effect on 10 October in exchange for 250 Palestinian prisoners and 1,718 detainees from Gaza.Israel has also handed over the bodies of 195 Palestinians in exchange for the bodies of the 13 Israeli hostages returned by Hamas, along with those of two foreign hostages - one of them Thai and the other Nepalese.Eleven of the dead hostages still in Gaza are Israelis, one is Tanzanian, and one is Thai.\"Hamas knows where they are located and there is no other option but for them to be released back home,\" Ms Bedrosian said.ReutersExcavators were filmed digging in the Khan Younis area of southern Gaza on MondayEarlier, the group representing the Israeli hostages' families demanded that immediate action be taken to ensure Hamas handed over all the bodies. This includes delaying the second phase of US President Donald Trump's Gaza peace plan.\"The families urge the government of Israel, the United States administration, and the mediators not to advance to the next phase of the agreement until Hamas fulfils all of its obligations,\" the Hostages and Missing Families Forum said.It came after Israeli media cited an Israeli security official as saying that the Trump administration wanted to move to the second phase even if not all the hostages were found.On Saturday, Hamas's chief negotiator Khalil al-Hayya said in a statement that the group was facing \"challenges\" because Israeli forces had \"altered the terrain of Gaza\".\"Moreover, some of those who buried the bodies have been martyred or no longer remember where they buried them,\" he added.All but one of the dead hostages still in Gaza were among the 251 people abducted during the Hamas-led attack on southern Israel on 7 October 2023, during which about 1,200 other people were killed.Israel responded by launching a military campaign in Gaza, during which more than 68,500 people have been killed, according to the territory's Hamas-run health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Red Cross heading to Gaza to retrieve another hostage body, says Israel",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d7ad/live/d2161320-b36b-11f0-a5ed-d926a0229916.jpg"
      ],
      "datePublished": "2025-10-27T19:31:53.000Z",
      "dateModified": "2025-10-27T19:31:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Freed Israeli hostage Evyatar David who was forced to dig own grave is 'growing back to his old self', father says",
    "url": "https://www.bbc.com/news/articles/cy4pyw1jmgwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c64e/live/075e5c00-b352-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "World",
    "date": "2025-10-27T17:44:13.000Z",
    "description": "2 hours agoMichale Shuval,BBC Arabic, Jerusalem and Jaroslav LukivThe father of a released Israeli hostage who was forced to dig his own grave in a Ga",
    "body": "2 hours agoMichale Shuval,BBC Arabic, Jerusalem and Jaroslav LukivThe father of a released Israeli hostage who was forced to dig his own grave in a Gazan tunnel by Hamas has told the BBC his son's health is \"improving every day\".Avishai David was speaking after his 24-year-old son Evyatar David and two other freed hostages - Guy Gilboa Dalal and Eitan Mor - were discharged from hospital to a hero's welcome at their homes on Sunday.\"I can't explain how happy it makes me feel to see him growing back to his old self,\" the father added.In August, two months before Evyatar's release, Hamas had posted a video showing him emaciated in a narrow concrete tunnel - a move that drew condemnation from Israel and many Western leaders.Avishai David told the BBC he was happy to see his son's \"vitality improving every day, his colour returning [to his face], his cheeks getting fuller\".\"Thank God, he pulled through it and he's strong.\"The father said he had suffered for months knowing that his son was only \"80km away... and I can't help him\".\"It devastated me,\" he said, adding that he \"couldn't sleep, eat, drink properly.\"In August, Evyatar's brother Ilay told the BBC the Hamas video was a \"new form of cruelty\".\"He's a human skeleton. He was being starved to the point where he can be dead at any moment, and he suffers a great deal,\" Ilay said at the time.In the footage itself, Evyatar said: \"I haven't eaten for days... I barely got drinking water.\" He was seen digging what he said would be his own grave.On Sunday, cheering crowds - including many friends and neighbours - greeted Evyatar David as he returned to his hometown of Kfar Saba in central Israel. Dr Michal Shteinman, director at Rabin Medical Centre where the three released hostages were treated, told the BBC their bodies still bore the marks of \"this horrific captivity\".\"We can see their blood tests... and we've also heard their stories... they are not lying. You can see the marks of this metabolic trauma. Their skin tells their story. You can see the scars and the wounds.\"But Dr Shteinman added that the hostages \"came back stronger than they were\".Evyatar was abducted from the Nova music festival during the Hamas-led attack on southern Israel on 7 October 2023.He and 19 other living hostages have been released by Hamas under the first phase of a US-brokered ceasefire deal earlier this month.Hamas has also transferred 15 out of 28 deceased hostages. Thirteen were Israelis, one was Nepalese and the other Thai.In exchange, Israel has freed 250 Palestinian prisoners and 1,718 detainees from Gaza, and returned 15 bodies of Palestinians for every Israeli hostage's remains.The IDF launched a military campaign in Gaza in response to the 7 October 2023 attack, in which Hamas-led gunmen killed about 1,200 people in southern Israel and took 251 others hostage.More than 68,000 people have been killed by Israeli attacks in Gaza since then, according to the Hamas-run health ministry, whose figures are seen by the UN as reliable.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Freed Israeli hostage Evyatar David who was forced to dig own grave is 'growing back to his old self', father says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c64e/live/075e5c00-b352-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-27T17:44:13.000Z",
      "dateModified": "2025-10-27T17:44:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump does not rule out seeking third term - but says he will not use VP loophole",
    "url": "https://www.bbc.com/news/articles/c797q57ple9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/38d4/live/025ab950-b349-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "World",
    "date": "2025-10-27T15:22:03.000Z",
    "description": "5 hours agoBernd Debusmann Jrat the White HouseUS President Donald Trump has not ruled out the possibility of seeking a third term for the White House",
    "body": "5 hours agoBernd Debusmann Jrat the White HouseUS President Donald Trump has not ruled out the possibility of seeking a third term for the White House, saying he would \"love to do it\". But Trump rejected the possibility of running for vice-president in 2028 - an idea floated by some supporters as a way for him to circumvent the US constitution that bars the president from running for a third term.Speaking to reporters during his trip to Asia, Trump described the idea as \"too cute\" and said it \"wouldn't be right\". It is unclear what method he would use to run again. Last week, former Trump strategist Steve Bannon said that a \"plan\" was in place to secure the 79-year-old president another term. Speaking to reporters aboard Air Force One on his way to Japan from Malaysia, Trump said that while he would \"be allowed\" to run again as vice-president, he had no plans to do so.\"I think people wouldn't like that,\" he said. \"It's too cute. It wouldn't be right.\" Talking about the possibility of a third term, Trump said: \"I haven't really thought about it. But I have the best poll numbers that I've ever had.\" Additionally, Trump also suggested vice-president JD Vance and Secretary of State Marco Rubio as potential successors, calling them \"unstoppable\".\"All I can tell you is that we have a great group of people, which they don't,\" he added, referrring to Democrats.Can Trump serve a third term as US president?The 22nd amendment of the US constitution bars presidents from seeking a third term. Repealing the amendment would require approval from two-thirds of both the House of Representatives and the Senate, or a constitutional convention called by  two-thirds of state legislatures - a process viewed as highly unlikely.Last week, former Trump adviser Steve Bannon - who remains a vocal supporter - claimed there was a \"plan\" to secure a third term for Trump.\"Trump is going to be president in '28, and people ought to just get accommodated with that,\" Bannon told  The Economist. \"At the appropriate time, we'll lay out what the plan is.\" In March, Trump told CNBC he would \"probably not\" run again, though he later said  he was \"not joking\" about the possibility. It is still unclear which Democrats intend to run for the White House in 2028, although several have already expressed an interest. On Sunday, California Governor Gavin Newsom told CBS, the BBC's US partner, that  he would \"be lying\" if he said he was not giving serious thought to a presidential bid. Former vice-president Kamala Harris also told the BBC she may run again and that she could \"possibly\" be president in the future. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump does not rule out seeking third term - but says he will not use VP loophole",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/38d4/live/025ab950-b349-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-27T15:22:03.000Z",
      "dateModified": "2025-10-27T15:22:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UN peacekeeping force in Lebanon shoots down Israeli drone",
    "url": "https://www.bbc.com/news/articles/cjw9n1d7njyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9753/live/525cd4b0-b326-11f0-ba75-093eca1ac29b.jpg",
    "tag": "World",
    "date": "2025-10-27T11:55:37.000Z",
    "description": "8 hours agoHugo Bachega,Middle East correspondent and Samantha GranvilleEPADowning an Israeli drone is a rare action by the UN's peacekeeping mission ",
    "body": "8 hours agoHugo Bachega,Middle East correspondent and Samantha GranvilleEPADowning an Israeli drone is a rare action by the UN's peacekeeping mission in Lebanon, known as UnifilThe UN peacekeeping mission in Lebanon says it shot down an Israeli drone that flew over a patrol operating in the south of the country on Sunday, in the latest incident involving the force and Israel's military.Unifil said the drone was flying in an \"aggressive manner\" near the border town of Kfar Kila and that peacekeepers applied \"necessary defensive countermeasures\".The Israeli military, however, said the drone was carrying out \"routine intelligence-gathering activity\".\"An initial inquiry suggests that Unifil forces stationed nearby deliberately fired at the drone and downed it. The drone's activity did not pose a threat to Unifil forces,\" spokesman Lt Col Nadav Shoshani posted on X.He said Israeli forces later dropped a grenade towards the area where the drone fell.\"It should be emphasised that no fire was directed at Unifil forces. The incident is being further reviewed through military coordination channels,\" he added.Unifil said the grenade was dropped by another Israeli drone \"close\" to a patrol.\"Moments later, an Israeli tank fired a shot towards the peacekeepers. Fortunately, no injury or damage was caused to the Unifil peacekeepers and assets.\"Despite a ceasefire that came into force last November that ended the war with the Lebanese movement Hezbollah, Israel has continued to fly drones over Lebanon and carry out air strikes on people and targets in Lebanon it says are linked to the group.The military says it is acting to prevent Hezbollah from regrouping and rearming.The UN and the Lebanese government say Israel's actions are a violation of the country's sovereignty and in breach of the ceasefire deal.Downing an Israeli drone is a rare action by Unifil, which has been operating on Lebanon's southern border since 1978 and is set to begin a year-long withdrawal from the country at the end of 2026.The last known instance occurred in October 2024, when a German naval vessel participating in Unifil intercepted and neutralised a drone off Lebanon's coast during the war between Israel and Hezbollah.ReutersThe Israeli military has intensified its attacks in Lebanon recently, as Hezbollah insists it will not disarmThe latest flare-up comes amid ongoing tension along the Israel-Lebanon border despite a ceasefire reached last year.Under the agreement, Israeli troops were to withdraw from southern Lebanon, while Hezbollah was to move its fighters north of the Litani River and dismantle its military infrastructure there - a plan the group and its allies strongly oppose.Only the Lebanese army and Unifil are authorised to deploy armed personnel in the area south of the Litani, but Israel has maintained positions at several strategic border sites and has stepped up air strikes in recent weeks on what it said have been Hezbollah operatives and infrastructure, despite international and domestic pressure.Lebanon faces an intense week of diplomatic activity aimed at reviving the truce and consolidating state authority in the south.A new meeting of the US and French-led ceasefire monitoring mechanism - chaired by its recently appointed head, Gen Joseph Clearfield, and attended by US envoy Morgan Ortagus - is expected to take place alongside visits by Arab League Secretary-General Ahmed Aboul Gheit and Egyptian intelligence chief Hassan Rashad.US envoy Tom Barrack is also due to return to Beirut ahead of the arrival of incoming US Ambassador Michel Issa, who is set to take over the Lebanon portfolio next month.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UN peacekeeping force in Lebanon shoots down Israeli drone",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9753/live/525cd4b0-b326-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-27T11:55:37.000Z",
      "dateModified": "2025-10-27T11:55:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Venezuelan official says 'no doubt' Trump wants to overthrow government",
    "url": "https://www.bbc.com/news/articles/clyg2wljz6xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dd72/live/87226ef0-b2de-11f0-81fc-83f36fcf5991.jpg",
    "tag": "World",
    "date": "2025-10-27T02:40:15.000Z",
    "description": "'No doubt' Trump wants to topple our government, Venezuelan official tells BBC18 hours agoTabby WilsonAFP via Getty ImagesTarek William SaabThere is \"",
    "body": "'No doubt' Trump wants to topple our government, Venezuelan official tells BBC18 hours agoTabby WilsonAFP via Getty ImagesTarek William SaabThere is \"no doubt\" that US president Donald Trump is trying to overthrow the Venezuelan government, the country's attorney general has told the BBC.Tarek William Saab, a close ally of President Nicolás Maduro, says Trump wants to turn Venezuela into a \"colony\" of the US.Trump has accused Maduro of being the leader of a drug-trafficking organisation, which he denies, and there are fears in Venezuela that a US military build-up is aimed at removing the long-time Trump opponent from power.The US says it has killed at least 43 people in strikes on alleged drug boats off South America, and Trump has said the US is \"looking at land now\" after getting \"the sea very well under control\".When asked about the possibility of a land invasion of Venezuela, Saab told the BBC's Newshour programme that \"it shouldn't happen, but we are prepared\".He added that Venezuela was \"still ready to resume dialogue\" with the US, despite its \"illegitimate\" fight against drug trafficking.The US is among many nations that do not recognise Maduro as Venezuela's legitimate leader, after the last election in 2024 was widely dismissed as neither free nor fair. Opposition tallies from polling stations showed its candidate had won by a landslide.But Saab said the US wanted regime change in Venezuela, accusing it of hoping to seize the country's natural resources, including reserves of gold, oil and copper.US Congress members on both sides of the political aisle have raised concerns over the legality of Trump's strikes on boats and his authority to order them.Republican Senator Lindsey Graham told reporters on Sunday that future land strikes were a \"real possibility\", and that Trump told him he plans to brief members of Congress on future military operations when he got back from Asia.Over the past two months, the US has been steadily building up a force of warships, fighter jets, marines, spy planes, bombers and drones in the Caribbean, which it has framed as part of a crackdown on drug-trafficking and \"narco-terrorists\".Many analysts believe this is also part of a wider intimidation campaign seeking to remove President Maduro from power.The Venezuelan leader has accused the US of \"fabricating war\" after it also ordered the deployment of the world's largest warship to the Caribbean, the USS Gerald R Ford, which is yet to arrive.On Sunday, guided-missile destroyer USS Gravely arrived in Trinidad and Tobago, a dual-island nation just off Venezuela's coast, as part of the US's largest military deployment to the Caribbean Sea in decades. It is officially visiting until Thursday to conduct joint training and exercises.Venezuela's government has since issued a statement condemning what it called \"a military provocation by Trinidad and Tobago in coordination with the CIA\".Venezuela also claimed that they had captured a \"mercenary group with direct information from the US intelligence agency\", and alleged that a \"false flag attack is underway\" in the waters between Venezuela and Trinidad and Tobago.A false flag operation is a political or military action carried out with the intention of blaming an opponent for it.Venezuela's President Maduro has made accusations of false flag attacks before, including a plan to plant explosives in the US embassy in Caracas in early October.Additional reporting by Ione Wells",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Venezuelan official says 'no doubt' Trump wants to overthrow government",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dd72/live/87226ef0-b2de-11f0-81fc-83f36fcf5991.jpg"
      ],
      "datePublished": "2025-10-27T02:40:15.000Z",
      "dateModified": "2025-10-27T02:40:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paul Biya: Cameroon's 92-year-old president wins controversial eighth term",
    "url": "https://www.bbc.com/news/articles/cdx45zln4qvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7b69/live/1b2971c0-b34d-11f0-ba75-093eca1ac29b.jpg",
    "tag": "World",
    "date": "2025-10-27T18:06:35.000Z",
    "description": "2 hours agoKathryn Armstrong and Natasha BootyReutersPaul Biya, 92, posts his ballot as his wife Chantal, 54, watches onCameroon's 92-year-old preside",
    "body": "2 hours agoKathryn Armstrong and Natasha BootyReutersPaul Biya, 92, posts his ballot as his wife Chantal, 54, watches onCameroon's 92-year-old president has won a controversial eighth term, in a fiercely disputed election.Paul Biya, who is the world's oldest head of state, won 53.7% of the vote, compared to the 35.2% of opposition leader Issa Tchiroma Bakary, the Constitutional Council declared.Before the announcement, Tchiroma Bakary -  a former Biya ally - insisted he had won the election, but the ruling Cameroon People's Democratic Movement (CPDM) dismissed his claim.The election, held on 12 October, has been marred with deadly violence, and in recent days, hundreds of Tchiroma Bakary's supporters have defied protest bans in several cities, and clashed with security forces.Biya thanked voters for \"once again\" trusting him.\"I sincerely hope that, together, we resolutely undertake to build a peaceful, united and prosperous Cameroon,\" he said in a statement.On Sunday, at least four people were killed during protests in Cameroon's economic capital of Douala.The regional governor, Samuel Dieudonné Diboua, said police posts had come under attack and security forces had defended themselves.The unrest continued on Monday, when a number of people were shot dead near  Tchiroma Bakary's residence in the city of Garoua, a local journalist on the scene told the BBC.Around the same time, the opposition leader wrote on Facebook that shots were being fired at civilians gathered outside his home. He later claimed that snipers had been stationed at the house across from his, and were \"firing at point-blank range at the people\".The authorities have not yet commented on these reports.Protesters were denouncing what they said was a plan by the ruling CPDM, to \"steal the victory\" from Tchiroma Bakary.The situation is so tense in the capital, Yaoundé, that almost all shops and schools have remained closed, while most civil servants and office workers stayed home.ReutersSupporters of Issa Tchiroma Bakary have clashed with security forces in recent daysIn total, 10 candidates were in the running for the presidential office, including former Prime Minister Bello Bouba Maigari.Voter turnout was 58%.At least 10 petitions alleging electoral malpractice have been rejected by the Constitutional Council.Residents in Yaoundé have been voicing their opinions on Biya's controversial victory.\"We are at the beginning of another nightmare,\" Amungwa Nicodemus told the BBC.\"The economy is declining, corruption is endemic, a lot of things are going wrong.\"Another resident, Abolo Denis, urged Cameroonians to accept the result, saying that peace is of the utmost importance.\"What struck me first, after the proclamation of the results, was the silence - graveyard silence,\" said Vivian Muma, in the northern city of Bamenda. \"The silence tells it all. Cameroonian people decided, but those who [make] the decisions, they decided otherwise,\" she said.MARCO LONGARI/AFP via Getty ImagesSupporters of Issa Tchiroma Bakary allege the ruling CPDM had a plan to \"steal the victory\" from the opposition leaderThe governing party has hailed Biya's victory \"under the sign of greatness and hope\" in online posts.Biya, who came to power in 1982, is rarely seen in public and is known for spending time outside Africa in Swiss hotels. These long absences coupled with his advanced age has, in the past, led to rumours he was dead.While his leadership has been praised for the expansion of schools and public universities, and his handling of the Bakassi dispute - which saw the oil-rich peninsula handed to Cameroon instead of Nigeria - his tenure has also faced criticisms. A violent separatist insurgency in the English-speaking west has been running for almost a decade, unemployment stands at 40% for the under-35s, roads and hospitals are crumbling, and freedom of speech has been limited.Analysts have warned in recent days that Cameroon, a once peaceful country, could descend into political turmoil if the election results did not reflect the will of the people.\"Biya now has a notably shaky mandate given many of his own citizens don't believe he won the election,\" Murithi Mutiga, Africa Program Director at the International Crisis Group, said in a statement.\"We call on Biya to urgently initiate a national mediation to prevent further escalation,\" he added.More on the Cameroon election",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paul Biya: Cameroon's 92-year-old president wins controversial eighth term",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7b69/live/1b2971c0-b34d-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-27T18:06:35.000Z",
      "dateModified": "2025-10-27T18:06:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hurricane Melissa could be strongest to ever hit Jamaica",
    "url": "https://www.bbc.com/news/articles/c2dr0z57nygo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8721/live/02b294f0-b357-11f0-ba75-093eca1ac29b.jpg",
    "tag": "World",
    "date": "2025-10-27T19:04:27.000Z",
    "description": "Jamaica in path of 'life-threatening' category five Hurricane Melissa 1 hour agoVanessa BuschschlüterPhoto by RICARDO MAKYN/AFP via Getty ImagesA slow",
    "body": "Jamaica in path of 'life-threatening' category five Hurricane Melissa 1 hour agoVanessa BuschschlüterPhoto by RICARDO MAKYN/AFP via Getty ImagesA slow-moving but deadly hurricane is inching towards Jamaica, threatening to unleash torrential rains and destructive winds on the Caribbean island.With wind speeds of up to 165mph (270km/h), Hurricane Melissa was upgraded to a category five storm  on Monday - the maximum strength. The storm is expected to make landfall in the early hours of Tuesday.Authorities fear Melissa, which has already been blamed for the deaths of four people Haiti and the Dominican Republic, could become the strongest hurricane ever to hit Jamaica.Meteorologists warn that Melissa's slow pace means it is set to dump torrential rain on affected areas for longer, increasing the risk of deadly flooding and landslides.Watch: Hurricane Melissa strengthens as Jamaica braces for impact\"This extreme rainfall potential, owing to the slow motion, is going to create a catastrophic event here for Jamaica,\" Jamie Rhome, deputy director of the US-based National Hurricane Center (NHC), said.The Jamaican government has ordered evacuations for parts of the capital, Kingston, and the entire island has been classed as \"threatened\".  An update from the NHC at 15:00GMT said that Melissa was about 145 miles (233km) southwest of Kingston, Jamaica. It was moving at just 3mph (6 km/h).Damian Anderson, a 47-year-old teacher from the mountainous town of Hagley Gap in the south-east, said impassable roads had already cut off his community.\"We can't move. We're scared,\" he was quoted as saying by Reuters news agency.Melissa could strengthen further in the next 12 to 24 hours, forecasters warned. Metereologists say destructive winds and life-threatening storm surges are expected to hit Jamaica overnight on Monday or early on Tuesday. If the hurricane continues on the forecasted track, its core will \"move near or over Jamaica tonight and early Tuesday, across south-eastern Cuba Tuesday night, and across the south-eastern Bahamas on Wednesday\" local time, the NHC said. While forecasters say it is likely to fluctuate in strength in the coming hours, it is likely to reach Jamaica and south-eastern Cuba as \"an extremely powerful major hurricane, and will still be at hurricane strength when it moves across the south-eastern Bahamas\".According to the NHC, 40 inches of rain (100cm) are possible in parts of Jamaica over the next four days. Jamaica's Prime Minister Andrew Holness has ordered the immediate evacuation of several vulnerable communities across the island. In a post on X, he urged \"every Jamaican to prepare, stay indoors during the storm, and comply with evacuation orders\". \"We will weather this storm and rebuild stronger,\" he wrote. Officials also urged residents in low-lying and flood-prone areas to seek shelter in safer areas.In some rural areas, school buses were used to ferry vulnerable people to shelters and across the country. Toll booths have been opened to avoid any queues from forming.Orlando Barría/EPA/ShutterstockHeavy rains brought by Hurricane Melissa flooded neighbourhoods in Santo Domingo, the capital of the Dominican RepublicAt least three people are known to have died and hundreds of homes have been flooded in Haiti as Melissa brought torrential rainfall to the island of Hispaniola.In the Dominican Republic, located on the eastern side of Hispaniola, one person also died. Local media identified the victim as a 79-year-old man who had been swept away by  floodwaters in the capital, Santo Domingo. A 13-year-old has also been reported missing after being dragged away by strong currents as he was swimming in the sea. Several people were rescued after being trapped in their cars by the rising floodwater. If you are in the region, tell us about your preparations for the hurricane.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hurricane Melissa could be strongest to ever hit Jamaica",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8721/live/02b294f0-b357-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-27T19:04:27.000Z",
      "dateModified": "2025-10-27T19:04:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "El-Fasher: UN pleads for safe passage for civilians trapped in war-hit Sudan city",
    "url": "https://www.bbc.com/news/articles/c4gw8w73lngo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dec0/live/d1509a80-b30e-11f0-86d7-1f99098a746f.jpg",
    "tag": "World",
    "date": "2025-10-27T09:52:22.000Z",
    "description": "10 hours agoBarbara Plett Usher,Africa correspondent and Richard Kagoe,Africa editor, BBC World ServiceThe UN has called for safe passage for trapped ",
    "body": "10 hours agoBarbara Plett Usher,Africa correspondent and Richard Kagoe,Africa editor, BBC World ServiceThe UN has called for safe passage for trapped civilians out of the Sudanese city of el-Fasher after paramilitary fighters announced they had seized control of the army's main base there. Sudan's military has not acknowledged loss of the site, which would be a significant victory for the Rapid Support Forces (RSF) in the ongoing civil war. UN chief António Guterres said the latest fighting marked a \"terrible escalation\" in the conflict, adding that the suffering of civilians was \"unbearable\", AFP news agency reports.El-Fasher is the last army foothold in the vast western region of Darfur, and has been besieged by the RSF and its allies for 18 months.Heavy fighting has been reported since Saturday after RSF fighters captured the home of the North Darfur governor.UN Human rights chief Volker Türk warned that the \"risk of further large-scale, ethnically motivated violations and atrocities in el-Fasher is mounting by the day\".The Sudanese Doctors' Network said the RSF had already carried out ethnically motivated killings of dozens of people in the city and had looted medical facilities and pharmacies.Imran Abdullah, an adviser to the RSF commander, denied the group's fighters were targeting civilians.\"On the contrary, they are the sole guarantor and protector of all those fleeing conflict areas, particularly in el-Fashir,\" he told BBC Arabic's Middle East Lifeline radio programme. Social media videos verified by the BBC now show RSF combatants celebrating the capture of the army's el-Fasher headquarters.They claim to have seized full control of the city, but the army's local allies say fighting continues in some parts. Communication lines to el-Fasher have been almost completely cut off, while those who managed to flee are enduring harrowing hours filled with fear and uncertainty.\"We've witnessed many of our relatives being massacred - they were gathered in one place and all killed. Now we have no idea what has happened to those who are still alive,\" one man told the BBC. Another resident who fled said they were \"extremely worried, as we still have no information about what has happened to the people inside el-Fasher - the children, the elderly, the wounded\".Sudan's fertile region where food is rotting amid famine and warA simple guide to the war in SudanThe RSF has been accused of targeting civilians in airstrikes and trapping nearly 250,000 people after encircling the city with an earth wall, leaving many on the brink of starvation.The city is one of the worst battlegrounds of Sudan's civil war, leading the UN to  call it an \"epicentre of suffering\". The UN's top humanitarian official Tom Fletcher said he was deeply alarmed at the reports of civilian casualties. \"With fighters pushing further into the city and escape routes cut off, hundreds of thousands of civilians are trapped and terrified - shelled, starving, and without access to food, healthcare, or safety,\" Fletcher said in a statement.\"Civilians must be allowed safe passage and be able to access aid,\" he added.The US has also called for safe passage and is trying to negotiate a ceasefire.Taking el-Fasher would be a crucial comeback for the RSF after defeat in Khartoum. But it is likely a sign that the civil war will continue, not end.Sudan has been ravaged by conflict since 2023, after top commanders of the RSF and Sudanese army fell out and a vicious power struggle ensued.More than 150,000 people have died across the country and about 12 million have fled their homes, creating one of the worst humanitarian crises.The army controls most of the north and the east, with el-Fasher being until now the last major urban centre in Darfur still held by government forces and its allies.The RSF controls almost all of Darfur and much of the neighbouring Kordofan region.The group has previously said that it hopes to form a rival government in el-Fasher when it assumes complete control.Additional reporting by Natasha Booty, Damian Zane, Danai Nesta Kupemba and Peter Mwai",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "El-Fasher: UN pleads for safe passage for civilians trapped in war-hit Sudan city",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dec0/live/d1509a80-b30e-11f0-86d7-1f99098a746f.jpg"
      ],
      "datePublished": "2025-10-27T09:52:22.000Z",
      "dateModified": "2025-10-27T09:52:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Has Trump's 'peace deal' solved the Thailand-Cambodia dispute?",
    "url": "https://www.bbc.com/news/videos/cy40n3ykx93o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f7fc/live/f823d880-b272-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-10-26T13:39:19.000Z",
    "description": "Donald Trump has claimed to have ended another war, this time between Thailand and Cambodia, following deadly controntations at their shared border in",
    "body": "Donald Trump has claimed to have ended another war, this time between Thailand and Cambodia, following deadly controntations at their shared border in July.The US president is in the Malaysian capital, Kuala Lumpur, where he signed a peace accord between the two countries.Both have agreed to withdraw their heavy weapons from the disputed region, and to establish an interim observer team to monitor it - but the underlying issues remain fundamentally unresolved. So what does the \"Kuala Lumpur Peace Accord\", as Trump has called it, actually amount to? The BBC's Tessa Wong has this analysis.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Has Trump's 'peace deal' solved the Thailand-Cambodia dispute?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f7fc/live/f823d880-b272-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-26T13:39:19.000Z",
      "dateModified": "2025-10-26T13:39:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "International troops won't want to enforce Gaza peace, says King of Jordan",
    "url": "https://www.bbc.com/news/articles/cge5ngz11xpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0fa7/live/44cab9e0-b31f-11f0-ba75-093eca1ac29b.jpg",
    "tag": "World",
    "date": "2025-10-27T06:01:02.000Z",
    "description": "14 hours agoFergal KeaneSpecial correspondentWatch: Would Jordan provide security inside Gaza? The country's king explains his answer to BBC PanoramaC",
    "body": "14 hours agoFergal KeaneSpecial correspondentWatch: Would Jordan provide security inside Gaza? The country's king explains his answer to BBC PanoramaCountries would reject being asked to \"enforce\" peace in Gaza if deployed under the Trump ceasefire plan, King Abdullah of Jordan has told the BBC.\"What is the mandate of security forces inside of Gaza? And we hope that it is peacekeeping, because if it's peace enforcing, nobody will want to touch that,\" said King Abdullah in an exclusive interview for BBC Panorama.\"Peacekeeping is that you're sitting there supporting the local police force, the Palestinians, which Jordan and Egypt are willing to train in large numbers, but that takes time. If we're running around Gaza on patrol with weapons, that's not a situation that any country would like to get involved in.\"The King's comments reflect concern from the US and other nations about being dragged into a continuing conflict between Hamas and Israel, or Hamas and other Palestinian groups. According to the UN, peace enforcement uses coercive measures including military force, while peacekeeping operates with the consent of the parties to a conflict and troops only use force in self-defence and defence of their mandate.Under US President Trump's 20-point peace plan, Arab states and international partners are to commit stabilisation forces that \"will train and provide support to vetted Palestinian police forces in Gaza, and will consult with Jordan and Egypt who have extensive experience in this field.\" Hamas is to disarm and give up political control of the territory.However Hamas has not yet disarmed and has mobilised thousands of fighters to reassert its grip on parts of the territory, Israel has carried out air strikes and other Palestinian armed groups are reportedly operating in parts of Gaza under Israeli control.King Abdullah said he would not send Jordanian forces into Gaza because his country was \"too close politically\" to the situation. More than half of Jordan's population is of Palestinian descent, and over decades, the country has taken in 2.3 million Palestinian refugees fleeing earlier wars with Israel - the largest number in the region.Asked if he trusted Hamas to keep its promise to give up any political role in Gaza, he replied: \"I don't know them, but those that are working extremely close to them - Qatar and Egypt - feel very, very optimistic that they will abide by that.\"If we don't solve this problem, if we don't find a future for Israelis and Palestinians and a relationship between the Arab and Muslim world and Israel, we're doomed.\"This year, 253 sick and wounded children, including Habiba - whose two arms and leg were amputated - have been evacuated from Gaza to JordanThe main mediation efforts during the war have been carried out by Qatar and Egypt working with the United States.The Jordanians have been part of an international effort trying to deliver aid to Gaza and evacuating sick and wounded children. The King has flown over the territory on three missions parachuting aid supplies.\"Looking over the back ramp was just shocking,\" he said. \"The devastation of that part of Gaza was just a shock to me.\"I've seen it myself, and how we, as the international community, are allowing this to happen is mind-boggling.\"The King asked for President Trump's support to evacuate 2,000 seriously ill Palestinian children from Gaza. In a White House meeting with the Jordanian monarch in February, Trump called it a \"beautiful gesture\".Since then, 253 children have been evacuated to Jordan. In all, more than 5,000 have been medically evacuated, most to Egypt, the United Arab Emirates and Qatar. More than 15,000 Gazans are still awaiting evacuation, including about 3,000 children, according to the World Health Organization.To get children and their guardians out of the territory they must undergo a comprehensive security check by Israel and host countries. The World Health Organization has described the process as \"excruciatingly slow\". The Israeli military group which oversees aid for Gaza - Cogat - insists it places \"great importance\" on facilitating humanitarian aid to Gaza, including the evacuation of patients with \"complex medical conditions\". It stresses the necessity of security checks on individuals travelling through Israeli territory.Queen Rania praised President Trump for pressuring Israel and negotiating a ceasefireIn her interview for Panorama, Jordan's Queen Rania criticised the international community for, as she put it, failing to stop the war for two years.\"You know what it's like to be a parent over the last two years? To watch your children suffering, starving, shaking in terror, and to be powerless to do anything about it, and to know that the whole world is watching and not to do anything about it. That nightmare, it's the nightmare of any parent, but that nightmare has been the daily reality for Palestinians for the last two years.\"The Queen, who is of Palestinian descent, praised President Trump for his efforts to bring about the ceasefire between Israel and Hamas. She said he had used America's diplomatic, military and financial support as leverage on Israel.\"To his credit, Trump was the first president in a long time to actually apply pressure on Israel. Beforehand, when they crossed lines, the US president would just maybe just say a few words of rebuke or they just get a slap on the wrist. President Trump actually got [Israeli PM Benjamin] Netanyahu to actually agree to a ceasefire. And I hope that he continues to be engaged in this process.\"Abdelrahman (r) was treated in Jordan after losing his left leg following an Israeli air strikeIsrael repeatedly accused Hamas of prolonging the war with its refusal to release Israeli hostages, and said the organisation - proscribed as a terror group by the UK, US and EU - used civilians as human shields in Gaza. According to the Hamas-run health ministry in the territory, more than 68,000 people have been killed since Israel invaded Gaza.Israel's invasion followed the 7 October attack by Hamas in which more than 1,200 people, mostly Israeli civilians, were killed and 251 taken hostage into Gaza. Since then, arrest warrants for alleged war crimes have been issued by the International Criminal Court against Netanyahu and former defence minister Yoav Gallant, as well as the military commander of Hamas, Mohammed Deif, although Hamas later confirmed he had been killed in an air strike.The signing of the Trump ceasefire agreement also saw the release of 20 living Israeli hostages from Gaza with continuing efforts to recover the remains of the dead. Israel released 250 Palestinian prisoners who had been convicted of crimes including murder and deadly attacks against Israelis, and about 1,700 detainees from Gaza who had been held by Israel without charge.When I asked Queen Rania if she believed a lasting peace was possible, she said hope for this was not naive, but a form of defiance.\"I truly believe that Palestinians and Israelis can exist side by side,\" she said. \"In the current atmosphere, there's too much animosity, too much anger and grief and hatred and cynicism between the two peoples to actually forge a peace on their own. I'm not being naive here. But I think with the push of the international community, that is the only way.\"So many times during the past two years, hope had felt elusive. Choosing hope was not easy… it's hard, it's heavy. But it's the only path that doesn't deny Palestinians or betray their struggle or our humanity.\"With additional reporting by Alice Doyard, Suha Kawar, David McIlveen and Liam Connell.Get our flagship newsletter with all the headlines you need to start the day. Sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "International troops won't want to enforce Gaza peace, says King of Jordan",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0fa7/live/44cab9e0-b31f-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-10-27T06:01:02.000Z",
      "dateModified": "2025-10-27T06:01:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]