[
  {
    "title": "COP30 evacuated after fire breaks out",
    "url": "https://www.bbc.com/news/articles/ce9d9p5jrjgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f9a2/live/a8b3dd70-c63d-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-20T19:13:21.000Z",
    "description": "1 day agoGeorgina Rannard and BBC climate team,Belém, BrazilThe UN climate talks COP30 have been evacuated due to a fire breaking out inside the venue",
    "body": "1 day agoGeorgina Rannard and BBC climate team,Belém, BrazilThe UN climate talks COP30 have been evacuated due to a fire breaking out inside the venue in Belém, Brazil.BBC journalists saw flames and smoke in the pavilion area before they were rushed outside where fire engines raced past.The UN said the fire was extinguished after six minutes and 13 people were treated for smoke inhalation. It is not yet known what caused the blaze. The talks were in the final hours of trying to agree on next steps to tackle climate change but the fire has disrupted negotiations and the talks remain closed.\"It was climbing the walls and onto the ceiling. People were screaming,\" Dr Harshita Umesh, who was giving a talk next to the place where they fire broke out, told BBC News.\"Then I ran, I think I tripped and fell.\"Dr Umesh, who is a medical doctor, said that ambulance staff told her that first responders inhaled \"toxic fumes\" and were given oxygen masks to the site.Emergency medicine specialist Kimberly Humphrey, currently helping patients at the COP medical centre, told the BBC that the injuries are \"Mainly people with smoke inhalation, someone with a lung injury from smoke.\"\"People are pretty traumatised and shocked,\" she added.\"There's a huge panic, people have been running out of here, it's a very dramatic moment... UN security guards are telling us to leave,\" said BBC Climate Editor Justin Rowlatt shortly after the fire broke out.\"You can see huge columns of smoke rising up into the air through the hole that's been burnt in the top of the conference centre,\" he said.BBC journalists saw two ambulances driving towards the entrance more than 90 minutes after the fire started.A Brazilian security officer putting a chain through the gates of the venue told the BBC the premises must be evacuated and locked. After the fire broke out, orange flames burned a hole through the sheeting that covers the venue, which is in a former aerodrome. One video shows a man spraying a fire extinguisher at the fire before running away.One eyewitness told the BBC that he believes an electrical fire was the cause.A woman was taken away in a wheelchair, but it is not clear if that was connected to the fire.Hundreds of people were left sitting on the floor or on plastic chairs outside in high temperatures and humidity. The fire is likely to delay the closing of a deal in the talks.A number of country delegations were forced to take shelter outside under the roof of a petrol station, a member of the UK delegation told the BBC. He said the fire halted negotiations.The UN, which runs COP climate meetings, said the fire brigade is checking the venue to assess safety and that the summit has been temporarily taken over by Brazilian authorities.Thousands of people are attending the UN climate talks, including members of delegations from around the world.Nearly 200 countries are trying to agree on how to make progress in tackling climate change. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "COP30 evacuated after fire breaks out",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f9a2/live/a8b3dd70-c63d-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-20T19:13:21.000Z",
      "dateModified": "2025-11-20T19:13:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "COP30 fire: BBC at the scene of 'intense' blaze",
    "url": "https://www.bbc.com/news/videos/cn5159k1krzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f1e6/live/d697fe90-c63f-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-20T21:58:46.000Z",
    "description": "The UN climate talks COP30 have been evacuated due to a fire breaking out inside the venue in Belém, Brazil.BBC journalists including Climate Editor J",
    "body": "The UN climate talks COP30 have been evacuated due to a fire breaking out inside the venue in Belém, Brazil.BBC journalists including Climate Editor Justin Rowlatt saw flames and smoke in the pavilion area before they were rushed outside.The UN said the fire was extinguished after six minutes and 13 people were treated for smoke inhalation. It is not yet known what caused the blaze.More on this story.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "COP30 fire: BBC at the scene of 'intense' blaze",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f1e6/live/d697fe90-c63f-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-20T21:58:46.000Z",
      "dateModified": "2025-11-20T21:58:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Grizzly bear on loose after attacking school group in Canada, injuring 11",
    "url": "https://www.bbc.com/news/articles/cz68x1n5qd6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f7c5/live/7f3df530-c6e6-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-21T14:55:18.000Z",
    "description": "5 hours agoSakshi VenkatramanBBC NewsA grizzly bear is on the loose after attacking a school group in Canada, leaving 11 people injured, two criticall",
    "body": "5 hours agoSakshi VenkatramanBBC NewsA grizzly bear is on the loose after attacking a school group in Canada, leaving 11 people injured, two critically.The incident happened on Thursday afternoon on a walking trail in the town of Bella Coola, in the province of British Columbia. Residents have been warned to remain indoors while armed officers try to track down the animal.A male teacher \"got the whole brunt of it\" and some children were hit with bear spray as the adults tried to fend off the animal, Veronica Schooner, a parent, told the Canadian Press.Ms Schooner said her 10-year-old son was part of the school group, though he was not attacked. \"He said that bear ran so close to him, but it was going after somebody else,\" she said, adding that \"he even felt its fur\".British Columbia Emergency Health Services said two people were critically injured, two more were seriously hurt, and seven others were treated at the scene, reports the Canadian Press.The group were from Acwsalcta School, which is run by the indigenous Nuxalk Nation, in the town located 700km (435 miles) north-west of Vancouver. \"Officers are armed\" the Nation wrote on Facebook. \"Remain indoors and off the highway.\" \"It's hard to know what to say during this very difficult time. We are so grateful for our team and our students.\" The Nation's officials have temporarily shut the school, offering counselling services.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Grizzly bear on loose after attacking school group in Canada, injuring 11",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f7c5/live/7f3df530-c6e6-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-21T14:55:18.000Z",
      "dateModified": "2025-11-21T14:55:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Canadian man loses legal battle to reclaim C$1.2m-dollar stash",
    "url": "https://www.bbc.com/news/articles/c20kl7x3ylyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2b64/live/56add2c0-c6c3-11f0-82b1-6148fee2770d.jpg",
    "tag": "World",
    "date": "2025-11-21T12:37:03.000Z",
    "description": "A Canadian man has lost a 16-year legal battle to reclaim more than C$1.2m (£651,000) in cash seized from his home.Police found the large amount of mo",
    "body": "A Canadian man has lost a 16-year legal battle to reclaim more than C$1.2m (£651,000) in cash seized from his home.Police found the large amount of money stashed in various places around Marcel Breton's north-western Ontario home during a search for an illegal firearm in 2009, as well as a variety of drugs.Breton was convicted of various offences but was acquitted at a retrial after arguing the search of his property had not been lawful.But earlier this week, an Ontario appeals court upheld a 2023 ruling that decided most of the seized money should go to the Canadian government, putting an end to his chances of recouping it.The trial judge had concluded that Breton did not lawfully possess the cash found around his property.Police recovered C$1,235,620 buried under his garage, C$32,000 stored elsewhere in the garage, and bundles of money totalling $15,000 in the under-floor heating ducts of the living room.In particular, the trial judge noted that it was \"unusual for an average person to have such a large amount of money buried in tubs underneath their property\", that the most common denomination was C$20 - an amount an expert said was commonly associated with the drug trade - and that the cash was found near drugs and drug paraphernalia.Breton also did not report any income to the revenue agency between 2001 and 2008, the judge said.But the appeals court upheld the decision for the $15,000 found inside the vents of his home to be returned to him, as the judge could not rule out that it had been obtained lawfully as it was not bundled in consistent denominations like the cash found in the garage.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Canadian man loses legal battle to reclaim C$1.2m-dollar stash",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2b64/live/56add2c0-c6c3-11f0-82b1-6148fee2770d.jpg"
      ],
      "datePublished": "2025-11-21T12:37:03.000Z",
      "dateModified": "2025-11-21T12:37:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bengaluru: Men posing as Reserve Bank of India officials pull off $800,000 heist",
    "url": "https://www.bbc.com/news/articles/c4gpgp07zdko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6cde/live/0e447af0-c68e-11f0-967a-cd30d7317be5.jpg",
    "tag": "World",
    "date": "2025-11-21T07:24:28.000Z",
    "description": "Armed men posing as officials from India's central bank have robbed a vehicle transporting 70m rupees ($800,000; £600,000) in the southern state of Ka",
    "body": "Armed men posing as officials from India's central bank have robbed a vehicle transporting 70m rupees ($800,000; £600,000) in the southern state of Karnataka, police say.A massive operation has been launched to find the men who robbed the van in the heart of Bengaluru city in daylight.The robbery occurred on Wednesday afternoon. Six men in an SUV stopped a cash transport van on a busy road as it was moving money between bank branches, Bengaluru police commissioner Seemant Kumar Singh told the BBC.The van was carrying a driver, a cash custodian and two armed security guards.Mr Singh says the robbers told the people in the van that they were officials from the Reserve Bank of India and needed to verify if they had the correct documents to transport such a huge amount of money. The gang told the cash custodian and guards to leave their weapons in the van and get into the SUV, while the driver was instructed to continue driving with the cash, police said.The SUV followed the cash van for a few kilometres before the gang forced the driver out of the van, made the cash custodian and guards get out of the SUV, transferred the cash at gunpoint, and fled.The area had little CCTV coverage, and police are investigating if the gang used multiple vehicles in the operation.The cash transportation service company has filed a police complaint.The SUV used in the heist had a fake number plate and a sticker that read \"Government of India\", a police official told the BBC on condition of anonymity. The official added that police were also investigating if the company employees had anything to do with the heist.Karnataka Chief Minister Siddaramaiah told reporters that police have recovered the SUV used in the heist.But Home Minister G Parameshwara has said that it is not yet clear which vehicle the suspects had used to escape. \"It was verified that they changed vehicles and moved the money,\" he told reporters.He said he was confident police would solve the case soon, as they had with other recent high-profile bank robberies in Karnataka.In May, 59kg of gold worth 532.6m rupees was stolen from a Vijayapura district bank using a duplicate locker key. Police have since recovered 39kg of gold and some cash, and arrested 15 people, including two former employees.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bengaluru: Men posing as Reserve Bank of India officials pull off $800,000 heist",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6cde/live/0e447af0-c68e-11f0-967a-cd30d7317be5.jpg"
      ],
      "datePublished": "2025-11-21T07:24:28.000Z",
      "dateModified": "2025-11-21T07:24:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Japan edges closer to restarting world's biggest nuclear power plant Kashiwazaki-Kariwa",
    "url": "https://www.bbc.com/news/articles/cev8j9ylr14o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/86f1/live/79b0fd10-c6c3-11f0-82b1-6148fee2770d.jpg",
    "tag": "World",
    "date": "2025-11-21T11:19:42.000Z",
    "description": "Japan is edging closer to approving the restart of the world's largest nuclear power plant - the first time it would be operated since the 2011 Fukush",
    "body": "Japan is edging closer to approving the restart of the world's largest nuclear power plant - the first time it would be operated since the 2011 Fukushima disaster.Hideyo Hanazumi, governor of the Niigata region where the Kashiwazaki-Kariwa power plant is located, said he has given the green light for the partial restart.The plan to resume operations at the facility, operated by utility company Tepco, still needs approval from the prefecture's government assembly and Japan's nuclear regulator before it can proceed.If approved, it would be the first time Tepco would be allowed to recommence nuclear reactor operations in Japan since its Fukushima plant went into meltdown following a tsunami.Residents in Niigata are divided over whether the plant should be restarted or not.Hanazumi told a news conference on Friday that his decision would be discussed in December at a prefectural government assembly, where he would seek the assembly's approval. The approval would be for the recommencement of operations at the Kashiwazaki-Kariwa plant's No 6 reactor, followed by the No 7. The resumption of operations at the facility is part of Tepco's business reconstruction plan following the Fukushima meltdown, which was caused by a 9.0-magnitude earthquake and massive tsunami.When the plant's reactors were flooded by the tsunami, it caused radiation to leak out and forced 150,000 people to be evacuated from the area.Japan ordered all its nuclear power plant reactors to be shut down in 2011 following the disaster. Since then, 14 reactors have resumed operations.Tepco was ordered to pay trillions of Japanese yen in damages to those affected and is also paying for the plant's decommissioning costs.A survey released by Niigata prefecture last month suggested 50% of its residents supported the plant's restart, while 47% were against it. It also indicated that almost 70% of people in the prefecture were concerned about Tepco running the plant. Friday's decision demonstrates a desire among some in Japan to move towards increased use of atomic energy to reduce dependence on fossil fuels, as the country pursues a goal of net zero carbon emissions.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Japan edges closer to restarting world's biggest nuclear power plant Kashiwazaki-Kariwa",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/86f1/live/79b0fd10-c6c3-11f0-82b1-6148fee2770d.jpg"
      ],
      "datePublished": "2025-11-21T11:19:42.000Z",
      "dateModified": "2025-11-21T11:19:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Five killed and more than 450 injured in Bangladesh earthquake",
    "url": "https://www.bbc.com/news/articles/cvgke7e2jx8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3eae/live/f272a0c0-c6ee-11f0-b222-8b5ed945ab17.jpg",
    "tag": "World",
    "date": "2025-11-21T16:10:07.000Z",
    "description": "4 hours agoMatt SpiveyReutersAt least five people have been killed, including one child, and more than 450 injured after a 5.5 magnitude earthquake hi",
    "body": "4 hours agoMatt SpiveyReutersAt least five people have been killed, including one child, and more than 450 injured after a 5.5 magnitude earthquake hit Bangladesh.The epicentre of the earthquake was close to the Narsingdi district, about 30 kilometres (18.6 miles) from the capital, Dhaka.People rushed from residential buildings as buildings shook and makeshift structures collapsed. At least 10 students were injured in a stampede as they tried to leave Dhaka University on Friday.\"We have never experienced an earthquake this powerful in the last five years,\" said the country's environmental adviser Syeda Rizwana Hasan.At least three people were killed when a railing and debris fell from a five-storey building in Dhaka's Armanitola area, deputy police commissioner Mallik Ahsan Uddin Sami said.Nitai Chandra De Sarkar, director of the department's monitoring division, said 461 people have been reported injured across the country, including 252 in the Gazipur district, north of Dhaka.Sarker told the BBC: \"Our main task at the moment is to assess casualties and damage. We are not yet seeing the challenge of rescue from the rubble or debris management at that level.\"Bengali Sadman Sakib told Reuters news agency: \"I have never felt such tremor in my 30 years of life. We were at the office when the furniture started shaking.\"We rushed down the stairs on the street and saw other people on the road already.\"A student called Abdullah, who was sleeping at the time of the earthquake, told Reuters the \"whole building was shaking\".Abdul Goni/Anadolu via Getty ImagesTremors were felt in eastern Indian states bordering Bangladesh, but there were no reports of major damage.The earthquake caused Ireland's second cricket test match in Bangladesh to stop temporarily.Coaches and players not involved gathered at the boundary, while those in the stands took shelter. The game was stopped for three minutes but play soon resumed.Ireland's head coach Heinrich Malan said: \"I've been involved in a couple of earthquakes from my time living in New Zealand.\"It's never a nice feeling and you're trying to understand what is happening in the moment around you, but also the bigger impacts about where the earthquake struck.\"Everything stood still for a couple of minutes and we got back to business, but we're thinking of everyone and hoping there wasn't too much damage done.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Five killed and more than 450 injured in Bangladesh earthquake",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3eae/live/f272a0c0-c6ee-11f0-b222-8b5ed945ab17.jpg"
      ],
      "datePublished": "2025-11-21T16:10:07.000Z",
      "dateModified": "2025-11-21T16:10:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US judge resigns after being disciplined for wearing Elvis wig in court",
    "url": "https://www.bbc.com/news/articles/c5yq3g7lqgqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d002/live/6b379640-c70e-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "World",
    "date": "2025-11-21T18:26:27.000Z",
    "description": "2 hours agoNadine YousifThe State of Missouri's Commission on Retirement, Removal and Discipline of JudgesJudge Thornhill of Missouri was disciplined ",
    "body": "2 hours agoNadine YousifThe State of Missouri's Commission on Retirement, Removal and Discipline of JudgesJudge Thornhill of Missouri was disciplined for referencing Elvis Presley and dressing up as the singer in court. A Missouri court is all shook up following the resignation of a judge who was disciplined for wearing an Elvis Presley wig in court and occasionally playing the singer's songs during proceedings. Matthew EP Thornhill, the longest-serving circuit judge in St Charles County, is a self-described Elvis lover, according to his biography page. But his love for the King of Rock'n'Roll contributed to a disciplinary commission demanding his suspension, citing his frequent \"irrelevant\" Elvis references in court. In a letter explaining his actions, Judge Thornhill said his aim was \"to add levity at times when I thought it would help relax litigants\".\"I now recognize that this could affect the integrity and solemnity of the proceedings,\" Judge Thornhill wrote in a letter dated 12 November to the Missouri Supreme Court. According to a report by Missouri's Commission on Retirement, Removal and Discipline of Judges, which investigates allegations of judicial misconduct, Judge Thornhill \"would routinely wear an Elvis Presley wig on or about October 31\" - or Halloween - in court while conducting court business.The report shows images of the judge sitting on the bench while donning an Elvis wig with his signature black pompadour and sunglasses. It adds that, on occasion, Judge Thornhill would give litigants or witnesses the option of being sworn in while playing Elvis music from his phone. He would also refer to the singer occasionally during court proceedings, including mentioning his date of birth or death and lyrics from his music, according to the inquiry report. St Charles County Circuit CourtJudge Matthew EP Thornhill is a self-described Elvis lover, according to his biography page.Judge Thornhill's burning love for all things Elvis is well-documented. In an interview with a local media outlet last year, he said he had visited Graceland, where the singer lived and is buried, 13 times. He added that Elvis was always on his mind since he was a child.The disciplinary report also cites unrelated conduct, like sharing his political affiliation or preferred candidates in elections from the bench, as well as promoting his own election campaign by asking witnesses, lawyers and litigants if they had seen his \"Thornhill for Judge\" signs around town. The commission found that Judge Thornhill had \"failed to maintain order and decorum in the courtroom\", and recommended he be suspended without pay for six months, then serve for another 18 months before retiring. In the 12 November letter, Judge Thornhill did not dispute any of the allegations, saying they are \"substantially accurate\" and acknowledged he had made a mistake. He agreed to the terms set out by the commission, which allowed him to conclude his service on the bench and retire after 20 years. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US judge resigns after being disciplined for wearing Elvis wig in court",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d002/live/6b379640-c70e-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-21T18:26:27.000Z",
      "dateModified": "2025-11-21T18:26:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Streaming platform Twitch added to Australia's teen social media ban",
    "url": "https://www.bbc.com/news/articles/cx2n2955g10o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/63b5/live/7adb6b90-c67c-11f0-82c9-67e583f6a4cd.jpg",
    "tag": "World",
    "date": "2025-11-21T02:33:49.000Z",
    "description": "18 hours agoLana LamSydneyGetty ImagesTwitch is the latest platform to be included in Australia's teen social media banTwitch, a streaming platform po",
    "body": "18 hours agoLana LamSydneyGetty ImagesTwitch is the latest platform to be included in Australia's teen social media banTwitch, a streaming platform popular with gamers, has been added to Australia's  teen social media ban that starts next month.It joins other platforms such as Facebook, Instagram, TikTok and Snapchat that must ensure under-16s cannot open accounts and that existing ones are closed from 10 December.Australia's internet regulator overseeing the ban said Twitch - owned by Amazon -had been included as its main purpose was \"online social interaction\" where users were encouraged to chat to each other about posted content.A Twitch spokesperson said Australians under 16 will not be able to open a Twitch account from 10 December and that from 9 January existing under-16s accounts will be deactivated.On her reasons why Twitch had been included, eSafety Commissioner Julie Inman Grant said it was \"a platform most commonly used for livestreaming or posting content that enables users, including Australian children, to interact with others in relation to the content posted\".No more platforms are expected to be added to the ban before the start date next month, Ms Inman Grant said. The government has previously said the ban was aimed at reducing the \"pressures and risks\" children can be exposed to on social media, including harmful content.Founded in 2007, Twitch is a popular livestreaming platform, where people typically play video games while chatting to viewers.Last year, it launched plans to share more of its revenue with creators as part of a shake-up, allowing streamers to make money through fans subscribing to their channel.The revenue is split equally between Twitch and the creator, after fees are paid.Twitch's policy forbids anyone under 13 to use its platform, and users aged between 13 and the legal age of adulthood in their country can only join if they have permission from their parent or guardian.Ms Inman Grant also said on Friday that Pinterest, on which users can compile online notice boards of images, would not be included in the ban because its core purpose was not about online social interaction.Instead, the platform was \"more commonly used by individuals collating images for inspiration and idea curation\", she said.Australia's world-first under-16s social media ban also includes YouTube, Reddit, Kick, Threads and X.The ban means tech companies must take \"reasonable steps\" to stop under-16s from using their platforms or risk being fined up to $49.5m (US$32m, £25m).Earlier this week, Meta - which owns Facebook, Instagram and Threads - announced it would start closing accounts of teenagers under 16 from 4 December, a week before the official ban. It's not clear how companies will enforce the ban but some possibilities included the use of government IDs, face or voice recognition and age inference. The latter of these uses online information other than a date of birth - such as online behaviour or interactions - to estimate a person's age.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Streaming platform Twitch added to Australia's teen social media ban",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/63b5/live/7adb6b90-c67c-11f0-82c9-67e583f6a4cd.jpg"
      ],
      "datePublished": "2025-11-21T02:33:49.000Z",
      "dateModified": "2025-11-21T02:33:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Frida Kahlo self-portrait sells for $55m, setting auction record for a female artist",
    "url": "https://www.bbc.com/news/articles/cdege1867lno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/300e/live/b18c50e0-c67d-11f0-b68a-77526b7bca21.jpg",
    "tag": "World",
    "date": "2025-11-21T03:23:18.000Z",
    "description": "17 hours agoOsmond ChiaBusiness reporterA surrealist painting by famed Mexican artist Frida Kahlo has sold for $54.7m (£41.8m) - shattering the auctio",
    "body": "17 hours agoOsmond ChiaBusiness reporterA surrealist painting by famed Mexican artist Frida Kahlo has sold for $54.7m (£41.8m) - shattering the auction record for an artwork by a woman. The painting, from the 1940s, went for more than 1,000 times its original auction price in 1980, after a tense bidding battle between two collectors, according to the auction house Sotheby's.The work - titled El sueño (la cama), which is translated to The dream (The bed)  - depicts Kahlo asleep in a canopy bed beneath a skeleton entwined with dynamite.The auction broke the previous record figure for a female artist's work of $44m, as well as for the highest amount paid for a Kahlo portrait - $34.9 million in 2021.The self-portrait is one of Kahlo's \"psychologically charged\" artworks, Sotheby's said, and was painted during a turbulent chapter in her life - the year her former lover was assassinated, and shortly after her divorce and remarriage.Kahlo, who died in 1954, is widely regarded as one of the greatest painters in the past century and became known for her personal portraits.Her work often conveyed her painful relationship with her body, disabled through polio in her childhood and serious injuries following a bus accident.Few could have imagined El sueño (la cama) would eventually sell for $55m when it was first went under the hammer at Sotheby's for $51,000 in 1980, the auction house's head of Latin American art Anna Di Stasi said. \"This record-breaking result shows just how far we have come, not only in our appreciation of Frida Kahlo's genius, but in the recognition of women artists at the very highest level of the market,\" she added.The previous highest price at auction for a work by a female artist is Georgia O'Keeffe's Jimson Weed / White Flower No.1, which was sold at Sotheby's in 2014 for $44m.El sueño (la cama) is one of the few Kahlo paintings in the public market since the Mexican authorities declared her artworks as artistic monuments in the 1980s, preventing them from being exported without authorisation.Kahlo's story was adapted into a biographical film starring Salma Hayek in 2002, telling the story of her rocky relationship with her husband, artist Diego Rivera, and her injuries.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Frida Kahlo self-portrait sells for $55m, setting auction record for a female artist",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/300e/live/b18c50e0-c67d-11f0-b68a-77526b7bca21.jpg"
      ],
      "datePublished": "2025-11-21T03:23:18.000Z",
      "dateModified": "2025-11-21T03:23:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "More than 250 arrested in Charlotte as immigration crackdown escalates",
    "url": "https://www.bbc.com/news/articles/ckgzge16vkdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/05c3/live/74684910-c620-11f0-a9b6-afaae37ee06b.jpg",
    "tag": "World",
    "date": "2025-11-20T15:20:12.000Z",
    "description": "More than 250 people have been arrested in Charlotte, North Carolina, as part of President Donald Trump's escalating crackdown on undocumented immigra",
    "body": "More than 250 people have been arrested in Charlotte, North Carolina, as part of President Donald Trump's escalating crackdown on undocumented immigration, US officials say. Charlotte is the latest US city that Trump has targeted with federal troops, following similar measures in bigger cities like Chicago and Los Angeles earlier this year. Officials with the Department of Homeland Security (DHS) told the BBC that those arrested are criminals and gang members.But local lawmakers and residents have railed against the detainments, which the federal government has dubbed \"Operation Charlotte's Web\". The state's Democratic governor has alleged people are being targeted because of their race. In a statement released on Wednesday, a DHS spokesperson said the operation has led to the arrest of \"some of the most dangerous criminal illegal aliens\", including gang members. Others arrested had been convicted of a range of crimes, including assault on law enforcement, driving while intoxicated, theft and tampering with government documents, the department said earlier.North Carolina's Democratic Governor Josh Stein, who has denounced Trump's operations, accused agents of racially profiling residents. \"We've seen masked, heavily armed agents in paramilitary garb driving unmarked cars, targeting American citizens based on their skin colour, racially profiling and picking up random people in parking lots,\" Stein said on Sunday. \"This is not making us safer.\"The city's mayor, also a Democrat, urged federal agents to operate with \"respect\" for the city's values. She also commended those who came out in droves on Saturday to protest the Trump administration's actions in the city. \"I am deeply concerned with many of the videos I've seen,\" Mayor Vi Lyles said. \"To everyone in Charlotte who is feeling anxious or fearful: you are not alone. Your city stands with you.\" DHS has not said how long the raids will last. Chicago's crackdown started in September and is still ongoing. Like other cities subject to immigration crackdowns, some migrants in Charlotte are staying home for fear of federal agents in the city, according to local media reports.Stein says he's monitoring reports that the operation will come to Raleigh, another North Carolina city, next. \"Once again, I call on federal agents to target violent criminals, not neighbors walking down the street, going to church, or putting up Christmas decorations,\" he wrote.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "More than 250 arrested in Charlotte as immigration crackdown escalates",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/05c3/live/74684910-c620-11f0-a9b6-afaae37ee06b.jpg"
      ],
      "datePublished": "2025-11-20T15:20:12.000Z",
      "dateModified": "2025-11-20T15:20:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Spain's attorney general convicted in controversial leak case",
    "url": "https://www.bbc.com/news/articles/cly4ypj92j9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6975/live/96461d80-c631-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-20T17:27:58.000Z",
    "description": "Spain's Attorney General, Álvaro García Ortiz, has been forced to step down after being found guilty of revealing confidential information in a deeply",
    "body": "Spain's Attorney General, Álvaro García Ortiz, has been forced to step down after being found guilty of revealing confidential information in a deeply controversial case, which accentuated the country's political division.The Supreme Court found that García Ortiz had unlawfully revealed details of the tax status of businessman Alberto González Amador, boyfriend of a senior conservative politician. The court handed him a two-year ban from the post and a fine of €7,200 (£6,438). He must also pay €10,000 to Mr González Amador as compensation.The trial of García Ortiz fuelled already acrimonious relations between the left-wing government of Prime Minister Pedro Sánchez and right-wing opposition.Their contrasting positions were underlined by reactions to the conviction.\"Sánchez must apologise to Spaniards, resign and call elections, in that order,\" said Ester Muñoz, spokeswoman for the conservative People's Party.The government said it did not agree with the ruling but respected it and would proceed with the appointment of a new attorney general.However, a number of politicians on the left expressed outrage at what they saw as a politically motivated ruling.Health Minister Mónica García, of the Sumar party, said the conviction dealt a \"lethal blow to [the concept of] presumption of innocence\" and threw ordinary Spaniards \"under the bus\" when it came to the rule of law.The complex case dates back to March 2024, when the attorney general's office issued a press release stating that Mr González Amador had requested a plea bargain after being found to have evaded tax payments worth €350,951. The document corrected mistaken press reports stating that the attorney general's office had proposed the bargain.The source of the incorrect reports was the head of communications of the conservative regional president of Madrid, Isabel Díaz Ayuso. Ms Díaz Ayuso is the partner of Mr González Amador.Mr González Amador filed a complaint against the attorney general, claiming his privacy had been breached. The case against García Ortiz also saw him accused of leaking information about the affair to the media. Prosecutors pointed to the attorney general's decision to change his phone as incriminating.However, there was no direct evidence linking García Ortiz to the leak and several journalists testified during the trial that he had not been the source of their information. Regarding the press statement, the attorney general said he was simply correcting the erroneous reports.García Ortiz can appeal against the ruling.This comes as a severe blow for the prime minister, who has been under judicial pressure on various fronts. His brother is due to go on trial for influence peddling, his wife is under investigation for her business activities and two former senior figures in the Socialist Party, José Luis Ábalos and Santos Cerdán, are accused of overseeing a massive kickback scheme.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Spain's attorney general convicted in controversial leak case",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6975/live/96461d80-c631-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-20T17:27:58.000Z",
      "dateModified": "2025-11-20T17:27:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Scientists reveal what triggered Santorini 'earthquake swarm'",
    "url": "https://www.bbc.com/news/articles/cz7p783g2j5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/94dd/live/926786e0-c6f9-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "World",
    "date": "2025-11-21T01:52:15.000Z",
    "description": "18 hours agoVictoria GillScience correspondentgettyThe \"swarm\" of tens of thousands of earthquakes near the Greek island of Santorini earlier this yea",
    "body": "18 hours agoVictoria GillScience correspondentgettyThe \"swarm\" of tens of thousands of earthquakes near the Greek island of Santorini earlier this year was triggered by molten rock pumping through an underground channel over three months, scientists have discovered.They used physics and artificial intelligence to work out exactly what caused the more than 25,000 earthquakes, which travelled about 20km (12 miles) horizontally through the Earth's crust. They used each of the tremors as virtual sensors, then used artificial intelligence to analyse patterns associated with them.One of the lead researchers, Dr Stephen Hicks from UCL, said combining physics and machine learning in this way could help forecast volcanic eruptions.What happened in Santorini?The seismic activity started to stir beneath the Greek islands of Santorini, Amorgos, and Anafi in January 2025. The islands experienced tens of thousands of earthquakes - many of which were over magnitude 5.0 and could be felt.Many tourists fled, and locals feared that the nearby underwater volcano, Kolumbo, might be about to erupt -  or that this was a seismic prelude to a larger earthquake, like the devastating, magnitude 7.7 quake that struck the same region in 1956.The scientists, who published their findings in the journal Science, created a 3D map of the Earth around Santorini. They then mapped the evolving patterns of seismic activity of each tremor and the movement and stress in the crust. This resulted in a detailed model of exactly what drove this months-long seismic swarm.The team found that the event was driven by the horizontal movement of magma - from beneath Santorini and the Kolumbo volcano - through a 30km channel that is more than 10km beneath the seafloor.The researchers estimated that the volume of magma that moved through the crust could have filled 200,000 Olympic-sized swimming pools. These \"magma intrusions\", as they are known, smashed through layers of rock, triggering thousands of tremors. Lead author on the study, Anthony Lomax, a research geophysicist who develops scientific software to analyse seismic activity, explained: \"The tremors act as if we had instruments deep in the Earth, and they're telling us something.\"[When we analyse] the pattern those earthquakes make in our 3D model of the Earth, it matches very, very well what we expect for magma moving horizontally.\"Does this mean the Santorini unrest is over?For now, the researchers say, it appears to be over.\"The magma remained quite deep - more than 8km depth - in the crust,\" explained Dr Hicks. \"We know that magma can ascend and erupt at the surface in a matter of hours to days, but because the activity has now died down, we can be almost certain that the melt eventually got stuck and cooled down deep in the crust.\"Volcanoes, though, can enter prolonged phases of unrest and unpredictability that can last many years. Recent volcanic activity in south-west Iceland has demonstrated that.And these researchers say using AI, in combination with the fundamental physics of how the Earth's crust moves and responds to stress, could transform the ability to monitor, understand and even forecast volcanic activity. This could help keep people in seismically active parts of the world safe.\"Ultimately, this could be used as a forecasting tool,\" explained Dr Hicks. Whenever we see a cluster of earthquakes, \"that is data that can be used to work out the most likely cause\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Scientists reveal what triggered Santorini 'earthquake swarm'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/94dd/live/926786e0-c6f9-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-21T01:52:15.000Z",
      "dateModified": "2025-11-21T01:52:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cuter and closer: Raccoons may be on their way to becoming America's next pet",
    "url": "https://www.bbc.com/news/articles/c1j8j48e5z2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e4c6/live/dd0af140-c65f-11f0-8896-e9b6ea3ac435.jpg",
    "tag": "World",
    "date": "2025-11-21T02:38:18.000Z",
    "description": "Raccoons may be inching closer to becoming America's next pet.Affectionately referred to as trash pandas, the masked mammals known for rummaging rubbi",
    "body": "Raccoons may be inching closer to becoming America's next pet.Affectionately referred to as trash pandas, the masked mammals known for rummaging rubbish bins for easy food, are evolving based on their proximity to humans, even starting to look cuter, a new study says. Evaluation of nearly 20,000 photos found \"a clear reduction in snout length\" in urban raccoons compared to their rural cousins - a physical shift consistent with the early stages of domestication seen in cats and dogs.Some that have been adopted as pets have become TikTok celebrities. One particularly bold dumpster-diver even sprinted across the pitch during a Major League Soccer match in Philadelphia last year.The stripe-tailed mammals, also nicknamed \"backyard bandits\", are widespread across the contiguous US. Their ability to thrive in both wild and urban settings has left them occupying an unusual space in American life - beloved pet in some neighbourhoods, persistent pest in others.The proximity to humans could signal that the creatures are growing more comfortable around us, or, scientifically speaking, dampening their innate flight responses, according to the study published in the journal Frontiers in Zoology.The softening of their features could be due to shifts in their fight-or-flight response on the cellular level, it says.This urban domestication starts with trash, the study's co-author, Raffaela Lesch of the University of Arkansas at Little Rock, told Scientific American.\"Trash is really the kickstarter,\" she said. \"Wherever humans go, there's trash — and animals love our trash.\"But to take advantage of this endless buffet, wildlife must strike a delicate balance: bold enough to root through bins and navigate human environments, yet not so bold as to pose a threat. \"If you have an animal that lives close to humans, you have to be well-behaved enough,\" Lesch said. \"That selection pressure is quite intense.\"The finding, the authors said, is consistent with the \"domestication syndrome phenotype\". Domestication syndrome - anatomical and morphological changes such as curly tails, floppy ears, depigmentation, smaller brains and reduced facial skeletons - are commonly cited as some of the most salient traits, the study says. Those traits are also seen among more common household pets, such as dogs that evolved from wolves.The study's authors also hypothesised that the domestication process is wrongly believed to be initiated by humans, who have captured or selectively bred animals in the past. The process might actually begin much earlier than previously thought, they said, notably when animals became habituated to human environments.\"Only animals with dampened flight (or fight) responses would succeed best,\" the authors wrote. \"This makes the initial stages of the domestication process a process of pure natural selection.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cuter and closer: Raccoons may be on their way to becoming America's next pet",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e4c6/live/dd0af140-c65f-11f0-8896-e9b6ea3ac435.jpg"
      ],
      "datePublished": "2025-11-21T02:38:18.000Z",
      "dateModified": "2025-11-21T02:38:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steve Rosenberg: Putin uncompromising as leaked plan reaches Moscow",
    "url": "https://www.bbc.com/news/articles/c5y9k0mrm2ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0ab6/live/15f39120-c6f0-11f0-b222-8b5ed945ab17.jpg",
    "tag": "World",
    "date": "2025-11-21T18:21:53.000Z",
    "description": "2 hours agoSteve RosenbergRussia editorEPAIt was quite a contrast.On Thursday, a US Pentagon delegation was in Kyiv. They were talking to President Ze",
    "body": "2 hours agoSteve RosenbergRussia editorEPAIt was quite a contrast.On Thursday, a US Pentagon delegation was in Kyiv. They were talking to President Zelensky about a draft plan to end the war in Ukraine.The same day, on Russian state TV, President Putin was in military fatigues. He was talking to his army chiefs about fighting on.\"We have our tasks, our goals,\" the Kremlin leader declared. \"The chief one is the unconditional achievement of the aims of the special military operation.\"The Izvestia newspaper called President Putin's visit to a command post \"a signal to America that he's prepared to negotiate on Ukraine, on Russia's terms\".Which brings us back to the peace plan.On Friday night, President Putin said he had seen the US settlement plan for Ukraine.Addressing a meeting of the Russian security council in Moscow, he described the American proposals as a \"modernised\" version of the plan discussed with Trump at the Alaska summit between the leaders in August.President Putin said he thought the plans could form the basis of final peace settlement.The 28-point proposal, which has been widely leaked and reported on, appeared after a visit to America by President Putin's envoy Kirill Dmitriev. He took part in three days of discussions in Miami with President Trump's special envoy Steve Witkoff.According to drafts of the peace proposal, Ukraine would cede to Russia parts of the Donbass still under Kyiv's control; the Ukrainian armed forces would be reduced in size and Ukraine would vow not to join Nato.\"The Russian military's effective work should convince Zelensky and his regime that it's better to strike a deal and do it now,\" President Putin's spokesman Dmitry Peskov previously told journalists on a Kremlin conference call.A peace proposal does not automatically mean peace. What if there's no agreement?Pro-Kremlin commentators insist that, deal or no deal, Russia will prevail.\"Everyone thought that the idea of a peace deal had sunk in a swamp,\" wrote Russian news outlet Moskovsky Komsomolets. \"But suddenly, a rocket has shot out of this bog with a new, or rather an 'old new' peace plan, with something of the Alaska summit about it. It shot out like a jack in the box.\"How long and how far will this missile fly? Will it crash, sabotaged by Europe and Kyiv? Even if the launch is a false start, it's unlikely to change the general trend. The balance of power is shifting in Russia's favour.\"But after nearly four years of war Russia is under pressure, too. Since its full-scale invasion of Ukraine, not only has Russian's army suffered huge losses on the battlefield, but back home the economy is faltering. Russia's budget deficit is growing, revenues from oil and gas falling.\"Russia's industry is somewhere between stagnation and decline,\" declared the broadsheet Nezavisimaya Gazeta this week.It's unclear, though, whether economic pressures will change President Putin's calculations and convince him that now is the moment to end his so-called special operation: even on terms that many believe benefit Moscow.Many. But not everyone.Some elements of the peace plan haven't gone down well in Russia. Some reports suggest that Ukraine could be offered security guarantees modelled on Nato's Article 5. That might commit Western allies to treat any future Russian attack on Ukraine as an attack on the transatlantic community as a whole and trigger a combined military response.\"This is, in effect, Ukraine in Nato,\" wrote Moskovsky Komsomolets, \"only without the deployment of bases and weapons on its territory.\"The full details of the peace plan have yet to be confirmed. We may be entering another period of intense diplomacy.For now, though, Russia's war on Ukraine continues.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steve Rosenberg: Putin uncompromising as leaked plan reaches Moscow",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0ab6/live/15f39120-c6f0-11f0-b222-8b5ed945ab17.jpg"
      ],
      "datePublished": "2025-11-21T18:21:53.000Z",
      "dateModified": "2025-11-21T18:21:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]