[
  {
    "title": "French soldier dies after being shot in head during 'game' ",
    "url": "https://www.bbc.com/news/articles/cj4z25gl24eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f227/live/efd50e10-0e61-11f1-ac78-0950755f28c4.png",
    "tag": "World",
    "date": "2026-02-20T14:19:27.000Z",
    "description": "French soldier dies after being shot in head during 'game' with other soldiers15 hours agoJessica RawnsleyLoïc Mizon/X20-year-old Brigadier Alexandre ",
    "body": "French soldier dies after being shot in head during 'game' with other soldiers15 hours agoJessica RawnsleyLoïc Mizon/X20-year-old Brigadier Alexandre Lanckbeen had been serving with the 35th Parachute Artillery RegimentA French soldier has died after he was shot in the head while taking part in a game with other soldiers during a party, according to local media.Brigadier Alexandre Lanckbeen was critically injured during the incident last Saturday while attending a party involving alcohol at the Percy Military Teaching Hospital in Clamart, west of Paris.According to French prosecutors, a loaded handgun was discharged during what was described as a game between the soldiers, and a bullet struck Lanckbeen in the head.Loïc Mizon, the military governor of Paris, said he had learned with \"deep sadness\" of the 20-year-old's death on Friday as a result of his injuries.\"I wish to express my deepest compassion to his family and loved ones and assure them of the full support of the armed forces,\" he said in a post on X.Brigadier Lanckbeen served with the 35th Parachute Artillery Regiment based in Tarbes, and was deployed as part of Operation Sentinelle, a long-running domestic security operation.According to prosecutors, on Saturday evening four soldiers housed at Percy Hospital had begun playing a game known within the military that involves attempting to disarm a colleague and disable their weapon.The weapon is usually unloaded when the game is played but in this case it was not, according to local media.During the game, a shot was fired which struck Lanckbeen in the head.Three soldiers who were also deployed as part of Operation Sentinelle appeared before a Paris court on Tuesday in connection with the shooting, according to local media.One soldier was charged with \"violence with a weapon resulting in permanent disability and breaching orders by consuming alcohol\", reports said.The other two soldiers were reportedly charged with \"involuntary bodily harm resulting in a work incapacity exceeding three months, through a manifestly deliberate violation of regulatory obligation of safety or caution\".They were also charged with \"altering the scene of a crime or offense to obstruct the course of justice\".Following Lanckbeen's death, the charges are expected to be reclassified.The inquiry has been handed to the criminal investigation service in Hauts-de-Seine.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "French soldier dies after being shot in head during 'game' ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f227/live/efd50e10-0e61-11f1-ac78-0950755f28c4.png"
      ],
      "datePublished": "2026-02-20T14:19:27.000Z",
      "dateModified": "2026-02-20T14:19:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Venezuelan opposition politician released after amnesty law passed",
    "url": "https://www.bbc.com/news/articles/cy57en3590no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/58cf/live/96774be0-0e4c-11f1-9189-e7ebb4fb5ccd.jpg",
    "tag": "World",
    "date": "2026-02-20T13:37:44.000Z",
    "description": "15 hours agoJack BurgessReutersVenezuelan opposition politician Juan Pablo Guanipa has announced on social media that he has been freed after \"almost ",
    "body": "15 hours agoJack BurgessReutersVenezuelan opposition politician Juan Pablo Guanipa has announced on social media that he has been freed after \"almost nine months of unjust imprisonment\". His comments come shortly after the country's interim President, Delcy Rodríguez, signed an amnesty bill approved by its National Assembly that could lead to the release of hundreds of political prisoners. Rodríguez's interim government has faced pressure from the US to speed up the release of Venezuela's remaining political prisoners after delays to the law. However, Guanipa described the bill as a \"flawed document\" that excludes many Venezuelans who remain \"unjustly\" behind bars. Guanipa is the leader of Venezuela's centre-right Justice First party and was a former vice-president of the National Assembly.Venezuela's socialist government has always denied holding political prisoners but first announced days after Maduro's capture, on 8 January, that \"a significant number\" of prisoners would be freed as a goodwill gesture.Opposition and human rights groups have said the government under Maduro for years used detentions of political prisoners to stamp out dissent and silence critics.Interim President Rodriguez has described the amnesty bill as being intended for the offering and receiving of forgiveness.Meanwhile, exiled opposition figurehead Edmundo González wrote on social media on Friday that there would be \"no lasting reconciliation without memory or responsibility\" in Venezuela. He added that a \"legitimate\" amnesty must come with \"truth, recognition and reparation\".Activists within the South American country have denounced delays to the amnesty law and a lack of transparency over who is being freed.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Venezuelan opposition politician released after amnesty law passed",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/58cf/live/96774be0-0e4c-11f1-9189-e7ebb4fb5ccd.jpg"
      ],
      "datePublished": "2026-02-20T13:37:44.000Z",
      "dateModified": "2026-02-20T13:37:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Authorities in Italy accuse man of training dog to illegally dump his rubbish",
    "url": "https://www.bbc.com/news/articles/cy57erz57xyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/af9f/live/3b795c80-0e5e-11f1-9120-a910fc22c6ac.png",
    "tag": "World",
    "date": "2026-02-20T15:57:17.000Z",
    "description": "Dog trained to illegally dump rubbish, Italian authorities say13 hours agoKerena CobbinaWatch: Video footage shows a small dog carrying a bag along a ",
    "body": "Dog trained to illegally dump rubbish, Italian authorities say13 hours agoKerena CobbinaWatch: Video footage shows a small dog carrying a bag along a roadA dog owner in Italy has been accused of training their canine to dump bags of rubbish on the side of a road.Video footage released by police shows a small dog leisurely walking down a road in Catania's San Giorgio district in Sicily carrying a bag of rubbish in its mouth before dropping it.Local authorities say the dog's actions - which were captured on video on two consecutive days - are evidence that \"leaves little room for doubt\" the canine had been trained to drop off the bags so that its owner could avoid being filmed discarding them.Fly tipping is illegal in Italy, but it remains a common problem. Local authorities have been trying to step up efforts to get a grip on the issue by using methods such as surveillance cameras to catch culprits.\"Ingenuity can never become an alibi for incivility,\" the municipality of Catania said in a post on its official Facebook page.\"Respect for urban etiquette and the environment is everyone's duty,\" it added.The post did not say whether any action had been taken.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Authorities in Italy accuse man of training dog to illegally dump his rubbish",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/af9f/live/3b795c80-0e5e-11f1-9120-a910fc22c6ac.png"
      ],
      "datePublished": "2026-02-20T15:57:17.000Z",
      "dateModified": "2026-02-20T15:57:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nasa targets March 6 date to send humans back around the Moon ",
    "url": "https://www.bbc.com/news/articles/c86y1g6wde3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/041d/live/dd9135c0-0e80-11f1-801d-ed3cff6bf876.jpg",
    "tag": "World",
    "date": "2026-02-20T17:00:26.000Z",
    "description": "12 hours agoRebecca Morelle,Science Editor,Alison Francis,Senior Science JournalistandGreg Brosnan,Senior Science JournalistShutterstockThe astronauts",
    "body": "12 hours agoRebecca Morelle,Science Editor,Alison Francis,Senior Science JournalistandGreg Brosnan,Senior Science JournalistShutterstockThe astronauts will begin their journey on Nasa's Space Launch System rocket Nasa is targeting early March to launch a crew around the Moon for the first time in more than 50 years, in what would be humankind's furthest trip into space.The Artemis II mission will see four astronauts embark on a 10-day journey around the far side of the Moon and back to Earth, paving the way for a future lunar landing.Nasa set the earliest launch date of March 6 (early on March 7 in the UK) following a successful \"wet dress rehearsal\" - a critical pre-launch test where the rocket is filled with fuel and taken through the countdown sequence.It was the Artemis team's second attempt at a practice run at the Kennedy Space Center in Florida.\"Every night I look up at the Moon and I see it and I get real excited because I can feel she's calling us and we're ready,\" Nasa's Lori Glaze told a news conference on Friday.\"The excitement for Artemis II is really, really starting to build, we can really start to feel it. It's coming.\"The first rehearsal, which took place at the beginning of February, ended early because of a hydrogen fuel leak at the launch pad.Glaze said issues including with seals and filters had now been remedied.\"Yesterday we were able to fully tank the SLS rocket within the planned time line […] we also succesfully demonstrated the launch countdown,\" she said.Three Americans - Reid Wiseman, Victor Glover and Christina Koch - and one Canadian, Jeremy Hansen, make up the Artemis II crew.Glaze said the crew were excited following the successful rehearsal and would go into quarantine later on Friday.They'll begin their journey on Nasa's mega Moon rocket: the 98m-tall (322ft) Space Launch System, or SLS.It's only flown once before in November 2022 for the Artemis I mission, but this was with no people onboard.The crew will be strapped into the Orion capsule, which is located at the top of the rocket.The inside of their spacecraft is about the size of a minibus, and it's where the four will live, eat, work and sleep during the 10-day mission.The first day of their journey will be spent in orbit around the Earth, then if all systems are working well, the astronauts will head towards the Moon.The voyage takes about four days, and the crew will travel around the far side of the Moon, which is the side we never see from Earth.They'll be at a distance of 6,500-9,500km (4,000 to 6,000 miles) above the lunar surface, and will have several hours dedicated to studying and taking images of the Moon.After the fly by, the astronauts will begin their four-day journey home. They will end the mission with a splash down in the Pacific Ocean.NASAApollo 17 astronaut Harrison Schmitt visited the Moon in 1972The mission, if successful, will pave the way for Artemis III, which will see astronauts set foot on the lunar surface. The last time humans visited the Moon was in 1972 for the Apollo 17 mission.Nasa says the landing will happen by 2028, but this is a very ambitious timescale.Elon Musk's SpaceX company has a contract to build the lander for Artemis III - which will be flown to the Moon on a SpaceX Starship rocket. But delays to the Starship rocket have led Nasa to ask SpaceX for a new streamlined plan to speed a return to the Moon.Nasa has also asked rival company Blue Origin - which is owned by Jeff Bezos - to come up with an accelerated lunar plan for Artemis III.As the tech billionaires battle it out, the US is under pressure to return to the Moon. China is aiming for a lunar landing by 2030, and has been making steady progress towards this.Both nations are planning to land at the Moon's south pole - and are competing for the best spots to build their lunar bases.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nasa targets March 6 date to send humans back around the Moon ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/041d/live/dd9135c0-0e80-11f1-801d-ed3cff6bf876.jpg"
      ],
      "datePublished": "2026-02-20T17:00:26.000Z",
      "dateModified": "2026-02-20T17:00:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "At least 10 killed in Israeli strikes on Lebanon - state media",
    "url": "https://www.bbc.com/news/articles/cvg8914dkl0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bc8b/live/745620e0-0ebf-11f1-9120-a910fc22c6ac.jpg",
    "tag": "World",
    "date": "2026-02-21T02:42:05.000Z",
    "description": "2 hours agoHugo Bachega,Middle East correspondentandTabby Wilson,BBC NewsEPAAt least 10 people have been killed in Israeli air strikes on eastern Leba",
    "body": "2 hours agoHugo Bachega,Middle East correspondentandTabby Wilson,BBC NewsEPAAt least 10 people have been killed in Israeli air strikes on eastern Lebanon, according to state media. A senior Hezbollah official was among those killed, the Iranian-backed militant group said in a statement.Israel's military said it was targeting sites that belonged to the group in the Bekaa Valley, which it alleged constituted \"a violation of the understandings between Israel and Lebanon\".The strikes are among the deadliest in Lebanon since a ceasefire ended the war between Israel and Hezbollah in November 2024.The Bekaa attack came hours after an Israeli strike on a Palestinian refugee camp in southern Lebanon. In a statement shared to X, the Israeli army said it had \"struck a Hamas command centre from which terrorists operated\" in the Ain al-Helweh area. Two people were killed in the strike on the densely populated camp, which is on the outskirts of the port city of Sidon.Israel has carried out near-daily strikes on Lebanon since the ceasefire took effect in November 2024, following 13 months of conflict.Under the first phase of the deal, which was brokered by the US and France, both Israeli troops and Hezbollah fighters were required to leave southern Lebanon. Following the talks, Israeli Prime Minister Benjamin Netanyahu's office issued a statement saying the meeting \"took place in a good atmosphere\" and that it \"was agreed that ideas would be formulated to advance possible economic cooperation between Israel and Lebanon\".It also said that Israeli envoys \"clarified that the disarmament of Hezbollah is obligatory, regardless of the advancement of economic co-operation\".Lebanese Prime Minister Nawaf Salam was more cautious, saying Lebanon remained \"far\" from diplomatic normalisation with Israel and that the talks were focused on \"defusing tension\".The group is considered a terrorist organisation by Israel and many other nations, including the UK and US.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "At least 10 killed in Israeli strikes on Lebanon - state media",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bc8b/live/745620e0-0ebf-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-21T02:42:05.000Z",
      "dateModified": "2026-02-21T02:42:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jharkhand: Mother and infant burnt to death over witchcraft allegations",
    "url": "https://www.bbc.com/news/articles/c98q93gdy3do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/07ce/live/7fe59480-0e2f-11f1-8cd2-611404a18f3d.jpg",
    "tag": "World",
    "date": "2026-02-20T10:10:42.000Z",
    "description": "19 hours agoMohammad Sartaj AlamBBC Hindi, JharkhandMohammad Sartaj Alam/BBCThe spot where the woman and child were burned after a mob stormed their h",
    "body": "19 hours agoMohammad Sartaj AlamBBC Hindi, JharkhandMohammad Sartaj Alam/BBCThe spot where the woman and child were burned after a mob stormed their houseFour people have been arrested in the eastern Indian state of Jharkhand for allegedly burning to death a woman and her 10-month-old son on suspicion of practising witchcraft earlier this week.The woman's husband, who was also attacked, suffered severe burns and is in hospital.Police say they are searching for more people who may be involved. The accused are in custody and haven't commented publicly yet.According to the National Crime Records Bureau, more than 2,500 people, mostly women, were killed in India on suspicion of witchcraft between 2000 and 2016.Mohammad Sartaj Alam/BBCThe murders occurred in the Kudsai hamlet of Jharkhand stateSuch cases are often reported from areas inhabited by disadvantaged tribal communities, where superstition is rife and a non-existent public health system leads to dependence on quacks for medical advice.The murders in Jharkhand occurred in the Kudsai hamlet, a remote tribal settlement of around 50 mud houses located 250km (155.3 miles) from the state capital, Ranchi.​The violence appears to have been triggered by recent incidents in the village, including rumours of sudden cattle deaths and the illness and death of a local man named Pustun Birua.His wife Jano Birua says she consulted an informal healthcare provider - common in villages where no doctors are available - when he began suffering from anxiety and fainting spells. He told her that her husband was not suffering from any physical illness.Asked why she did not take him to a hospital, she said: \"We are poor people, so it wasn't possible to take him that far.\"Meanwhile, rumours spread that Jyoti Sinku was practising witchcraft and was responsible for the man's illness.Pustun Birua died on Tuesday evening. That night, according to Jyoti's husband Kolhan Sinku who is in hospital, a mob of about a dozen people, including five women, stormed their home and set fire to his wife and child.Recalling the horror from his hospital bed, he said: ​\"I pleaded with folded hands to have the matter resolved in the village council but the attackers didn't listen to me.\"Based on the testimonies of Kolhan Sinku and another family member, the district police have registered a complaint of murder and criminal conspiracy.Police say four men have been arrested and a special police team has been set up to track down other members of the mob.They added that they would organise programmes in rural areas to raise awareness against superstitions.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jharkhand: Mother and infant burnt to death over witchcraft allegations",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/07ce/live/7fe59480-0e2f-11f1-8cd2-611404a18f3d.jpg"
      ],
      "datePublished": "2026-02-20T10:10:42.000Z",
      "dateModified": "2026-02-20T10:10:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Asos co-founder dies after Thailand balcony fall",
    "url": "https://www.bbc.com/news/articles/ce8w0n061ryo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5b0a/live/49b53ef0-0e30-11f1-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-20T14:35:49.000Z",
    "description": "Asos co-founder dies after Thailand apartment block fall14 hours agoOsmond Chia,Business reporterandJennifer Meierhans,Business reporterBloomberg via ",
    "body": "Asos co-founder dies after Thailand apartment block fall14 hours agoOsmond Chia,Business reporterandJennifer Meierhans,Business reporterBloomberg via Getty ImagesQuentin Griffiths died in the Thai city of PattayaA co-founder of online fashion giant Asos died after falling from a high-rise apartment block in Thailand, police have said.Quentin Griffiths has been named by Thai police as the man found dead on the ground in the eastern seaside city of Pattaya on 9 February.A police investigator told the BBC Griffiths, a British passport holder, was by himself, his room was locked from the inside, and there was no trace of any break-ins at the time of the death. An autopsy did not reveal any evidence of foul play.Griffiths co-founded Asos in 2000 and remained a significant shareholder after leaving the firm five years later.City AM/ShutterstockQuentin Griffiths, pictured in 2008An Asos spokesperson said: \"We're saddened to hear about the passing of Quentin, one of our original co-founders.\"He played an important role in Asos's earliest days and we're forever grateful for his contribution.\"Our thoughts are with his family and friends.\"A Foreign Office spokesperson said: \"We are supporting the family of a British national who has died in Thailand and are in contact with the local authorities.\"Police in Pattaya told the BBC Griffiths was found dead outside a luxury hotel where he had been staying in as a long-term resident in a suite on the 17th floor.He was involved in two ongoing court cases that might have caused him stress, police also told the BBC.Griffiths was separated from his second wife, a Thai national, and had reportedly been engaged in a legal dispute with her over a business they ran together, the BBC understands.He co-founded Asos in London with Nick Robertson, Andrew Regan and Deborah Thorpe.Its name originally stood for As Seen On Screen as it sold fashion inspired by clothing worn by TV and film stars.It grew to become an online fashion marketplace stocking hundreds of brands as well as its own lines and at one time was valued at more than £6bn.Its largest shareholders include Danish billionaire Anders Holch Povlsen - who owns Danish clothing giant Bestseller and Mike Ashley, owner of Frasers Group.Additional reporting by Thanyarat Doksone in BangkokIf you are suffering distress or despair, details of help and support in the UK are available at BBC Action Line",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Asos co-founder dies after Thailand balcony fall",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5b0a/live/49b53ef0-0e30-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-20T14:35:49.000Z",
      "dateModified": "2026-02-20T14:35:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anna Murdoch-Mann, mother of News Corp heir, dies aged 81",
    "url": "https://www.bbc.com/news/articles/cp8150xj36wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b76b/live/95cffad0-0eb9-11f1-b048-c9424b2cf5fd.jpg",
    "tag": "World",
    "date": "2026-02-21T03:02:20.000Z",
    "description": "2 hours agoOttilie MitchellRon Galella Collection via Getty ImagesAnna Murdoch-Mann, writer and ex-wife of media baron Rupert Murdoch, has died aged 8",
    "body": "2 hours agoOttilie MitchellRon Galella Collection via Getty ImagesAnna Murdoch-Mann, writer and ex-wife of media baron Rupert Murdoch, has died aged 81, his media outlets have announced.Married to the mogul for 31 years, she was described by the New York Post as an \"active partner\" in building News Corp.She was mother to three of Murdoch's children, Elisabeth, James, and Lachlan Murdoch - who is now chairman of Fox and News Corp - and stepmother to his daughter, Prudence.Murdoch-Mann was an active philanthropist and died on 17 February \"surrounded by family\" at her home in Palm Beach, Florida.Born Anna Torv in Glasgow and raised as a Catholic, she moved to Australia aged nine. After her parents' divorce, she is said to have brought up her own siblings.Murdoch-Mann became a reporter for the Sydney Daily Telegraph and the Sydney Daily Mirror, where she met Rupert Murdoch and served on the board of his company.\"He never made a major business decision without her input\" The Australian, another title in his media stable, writes.She penned several novels during their marriage, including the 1988 Family Business about a multi-generational media dynasty. Ron Galella Collection via Getty ImagesMurdoch-Mann in 1987 with her then-husband and sons Lachlan (far-left) and James.Muriel McKay was killed by her kidnappers and there have been renewed efforts to find her body in recent years.The then-Murdochs divorced in 1999 in one of the most expensive separations in history - Murdoch-Mann received a $1.7bn (£1bn) settlement.Murdoch married his third wife, Wendi Deng, 17 days later, Australian media report.In an exclusive interview after her separation, Murdoch-Mann told Australian Women's Weekly \"I think there's going to be a lot of heartbreak and hardship\" over the succession for Murdoch's media empire.\"There's been such a lot of pressure that they needn't have had at their age,\" she added.This battle inspired the television series Succession, and played out in courts in real life. It concluded with Murdoch's eldest son Lachlan set to control the news group as of late last year.His mother also remarried, first to financier William Mann who died in 2017. Murdoch-Mann later wed her third husband, Ashton dePeyster, who survives her along with 10 grandchildren and one great-grandchild.The philanthropist served on the boards of several children's hospitals including in Los Angeles and Haiti. In 1998, she was made a Dame of the Order of St Gregory by Pope John Paul II.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anna Murdoch-Mann, mother of News Corp heir, dies aged 81",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b76b/live/95cffad0-0eb9-11f1-b048-c9424b2cf5fd.jpg"
      ],
      "datePublished": "2026-02-21T03:02:20.000Z",
      "dateModified": "2026-02-21T03:02:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Austrian climber found guilty after girlfriend froze to death on mountain",
    "url": "https://www.bbc.com/news/articles/c0k1xkllknmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1d26/live/cb2c34f0-0e5f-11f1-b048-c9424b2cf5fd.png",
    "tag": "World",
    "date": "2026-02-20T11:10:31.000Z",
    "description": "18 hours agoBethany BellBBC Vienna correspondentReutersThomas P, who cannot be identified under Austrian law, is appealing against the guilty verdictA",
    "body": "18 hours agoBethany BellBBC Vienna correspondentReutersThomas P, who cannot be identified under Austrian law, is appealing against the guilty verdictAn Austrian climber has been found guilty of gross negligent manslaughter after his girlfriend froze to death on Austria's highest mountain last year.The man, named only as Thomas P in line with Austrian privacy laws, has been given a five-month suspended sentence and fined €9,600 (£8,400).His girlfriend, Kerstin G, died of hypothermia during a climbing trip on the Grossglockner mountain in January 2025.In a statement sent to the BBC, the court said it considered Thomas P's previous clean record and the loss of a person close to him \"to be mitigating factors\". It said it also took into account \"the public discussion on social media, which was incriminating for the defendant\".The judge, Norbert Hofer, himself an experienced climber who works with mountain and helicopter rescue teams in Tyrol, said Thomas P was an excellent Alpinist, but that his girlfriend was light-years behind him in terms of her climbing abilities.He said the couple should have turned back as Kerstin G did not have enough experience in winter conditions.Although the judge decided Thomas P had misjudged the situation, he said he had not left her behind \"wilfully\": \"I don't see you as a murderer, I don't see you as cold-hearted.\"The court also heard from Andrea B, a former girlfriend of Thomas P, who described how he had left her alone on a previous tour on the Grossglockner in 2023. She said she had been at the end of her tether, feeling dizzy and her headlight had gone out. She said she was crying and screaming when he suddenly disappeared, walking ahead and leaving her behind.Grossglockner mountain in AustriaThe judge also questioned Thomas P's account of how he had left Kerstin on the mountainside. Hofer suggested instead that, based on her position in the photos taken by the rescue team, she may have had a fall.The court heard how the mountain rescue team found her body hanging upside down from a rock face, according to Austrian reports.\"We were amazed that she remained in that position,\" one of the rescuers told the court. If the wind had been any stronger, \"she would have fallen over the south face\".The prosecution said there were strong winds of up to 74 km/h (45 mph), and it was very cold. It was -8C, with a windchill temperature of -20C, they said.They argued that as the more experienced climber, Thomas P was \"the responsible guide for the tour\". They said he failed to turn back or call for help in time to help his girlfriend.Thomas P should never have allowed himself to get into this situation, the prosecutor said.Thomas P pleaded not guilty. He told the court he was deeply sorry. He said he had loved his girlfriend, who was very sporty and that they had planned the trip together.His lawyer Kurt Jelinek said the couple had found themselves in a really difficult and stressful situation.He said Kerstin G was not inexperienced and knew what she was getting into.Her parents told the court she had been \"really active\" in mountaineering since 2020, and her mother said she would not have \"gone along blindly\".Forensic pathologist Claudia Wöss confirmed to the court that she had died of hypothermia, adding that she had found evidence of viral pneumonia and the painkiller ibuprofen in Kerstin G's body. She was unable to assess whether her physical capacity had been impaired by the illness, and if it had made a sudden decline in her condition more likely.www.foto-webcam.euThis still from webcam footage shows the couple still climbing at 21:00 on 18 JanuaryProsecutors say the couple got stuck on the mountain and that Thomas P failed to call the police and did not send any distress signals when a police helicopter flew overhead at around 22:30.Video footage from the helicopter showed the couple still climbing. The judge noted that no distress signals were sent.The defence argued that at that point Thomas P and girlfriend still felt fine and did not call for help as they were close to the summit.Webcam images show lights from their torches as they scaled the mountain.But shortly afterwards, the defence said the situation changed dramatically, when Kerstin G became exhausted close to the summit.The defence said that she told Thomas P to go to get help.At 00:35 on 19 January, he called the mountain police. The content of the conversation is disputed. Rescuers said it wasn't an emergency call but the lawyer says he denies telling police that everything was fine.He scaled the summit and descended on the other side, leaving Kerstin G behind. Prosecutors say he left her at 02:00.Webcam images show his torch-lit figure coming down from the summit.The trial sparked interest and debate, not just in Austria but in mountain climbing communities far beyond its borders, raising questions about when personal judgement and risk-taking become a matter of criminal liability.The case is subject to appeal.Get our flagship newsletter with all the headlines you need to start the day. Sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Austrian climber found guilty after girlfriend froze to death on mountain",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1d26/live/cb2c34f0-0e5f-11f1-b048-c9424b2cf5fd.png"
      ],
      "datePublished": "2026-02-20T11:10:31.000Z",
      "dateModified": "2026-02-20T11:10:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump lashes out at Supreme Court justices over tariffs ruling ",
    "url": "https://www.bbc.com/news/articles/cd9g0e7zd8wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e655/live/f8089780-0eb8-11f1-b048-c9424b2cf5fd.jpg",
    "tag": "World",
    "date": "2026-02-21T02:19:29.000Z",
    "description": "3 hours agoDaniel BushWashington correspondentWatch: Trump says he's \"ashamed\" of Supreme Court judges over tariffs rulingUS President Donald Trump la",
    "body": "3 hours agoDaniel BushWashington correspondentWatch: Trump says he's \"ashamed\" of Supreme Court judges over tariffs rulingUS President Donald Trump lashed out in unusually personal terms against the six Supreme Court justices who handed him one of the biggest setbacks of his second term in office by striking down the administration's global tariffs.The court's Friday ruling was \"deeply disappointing\". The justices who joined the majority opinion should be \"absolutely ashamed\" and lacked the courage to \"do the right thing\", Trump said, turning his response into a sweeping attack against a co-equal branch of government.The broadside was remarkable even for a president known for blowing past political norms and publicly berating those who challenge his authority.\"I'm ashamed of certain members of the court. Absolutely ashamed for not having the courage to do what's right for our country,\" Trump said at the start of a press conference at the White House, which was held a few hours after the decision was released.Trump did not mince words from there as he assessed the decision, which held that presidents do not have inherent authority to impose sweeping tariffs on any country.For the next 45 minutes, Trump criticised the ruling and made the case that he would find other methods to continue imposing tariffs on other countries. But throughout he repeatedly returned to the justices in ways that made clear he felt personally slighted by the decision.The president did not discriminate against Republican and Democratic appointees, either.The six justices who struck down Trump's tariffs were equally divided among the court's liberal and conservative wings. Three - Justices Elena Kagan, Sonia Sotomayor and Ketanji Brown Jackson - were appointed by Democratic presidents. The other three were appointed by Republicans. Chief Justice John Roberts is a George W Bush pick who wrote the majority opinion, and Justices Neil Gorsuch and Amy Coney Barrett were appointed by Trump in his first term in office.Trump went after them all.Watch: BBC inside Trump press briefing slamming Supreme Court tariffs ruling\"They're just being fools and lapdogs for the Rhinos and the radical left Democrats,\" Trump said, using shorthand for a term - Republicans in Name Only - that is deployed by some on the right to disparage other Republicans deemed not sufficiently loyal to the party.The president also claimed that the court was influenced by \"foreign interests\" in its decision, though he did not provide any details or evidence for the assertion.\"It's my opinion that the court has been swayed by foreign interests,\" he said.Trump declined to elaborate when a reporter pressed him to explain what he meant.When asked if he regretted nominating Gorsuch and Coney Barrett, the president stopped short of saying that he had made a mistake. But Trump said their votes were an \"embarrassment\" and brought up their families, a highly unusual move.\"It's an embarrassment to their families, to one another,\" Trump said.BBC NewsAt the same time, Trump heaped praise on the three members of the court, Justices Clarence Thomas, Samuel Alito, and Brett Kavanaugh, who voted to keep his tariffs authority intact. He gave special attention to Kavanaugh, his other first-term appointee.In a lengthy dissent, Kavanaugh said the government would be forced to refund billions in tariff revenue and said the process would be a \"mess.\" The president thanked Kavanaugh, as well as Thomas and Alito, \"for their strength and wisdom and love of our country\".Court watchers and trade experts said Trump's reaction wasn't surprising given how much he had invested in the outcome of the case.\"I think the court was well aware of the importance to the president of this decision,\" said Alan Wm Wolff, a former deputy director-general of the World Trade Organization.Colin Grabow, a trade expert at the Cato Institute, a libertarian think tank in Washington, said the decision represented \"a victory for the rule of law\".\"It's unfortunate that he attacked these justices,\" Grabow said. \"The Supreme Court said [Trump] went too far,\" he added. \"President Trump took that as an affront. It's not a surprise.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump lashes out at Supreme Court justices over tariffs ruling ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e655/live/f8089780-0eb8-11f1-b048-c9424b2cf5fd.jpg"
      ],
      "datePublished": "2026-02-21T02:19:29.000Z",
      "dateModified": "2026-02-21T02:19:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cameroon soldiers handed rare prison sentences after killing of 21 civilians in Northwest region",
    "url": "https://www.bbc.com/news/articles/cev74dywd7eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/567f/live/e26fabc0-0e5e-11f1-9120-a910fc22c6ac.jpg",
    "tag": "World",
    "date": "2026-02-20T13:44:30.000Z",
    "description": "15 hours agoPaul NjieBBC Africa, YaoundéAFP via Getty ImagesThe conflict in the Anglophone reasons has lasted for almost a decadeThree Cameroonian sol",
    "body": "15 hours agoPaul NjieBBC Africa, YaoundéAFP via Getty ImagesThe conflict in the Anglophone reasons has lasted for almost a decadeThree Cameroonian soldiers have been sentenced to prison for their role in the killing of at least 21 civilians in the country's troubled Anglophone region.The jail terms for the crimes, which took place six years ago in the Northwest region, range from five to 10 years per person.A military court previously found the soldiers guilty of murder, arson and destruction - a rare occurrence in a country where military personnel are seldom convicted of crimes against civilians.Nevertheless, lawyers for the victims told the BBC they were disappointed with the length of the jail terms handed down on Thursday, calling them \"insignificant\".The convictions centre on the events of 14 February 2020, when soldiers, supported by a local militia of ethnic Fulanis, raided the village of Ngarbuh and killed civilians.The victims included 13 children, according to Human Rights Watch, who added that the assailants burnt down homes and beat up residents.What followed was a rare instance of Cameroon's government acknowledging the atrocities of its soldiers in the Anglophone regions, which have been wracked by a separatist conflict for nearly 10 years.The authorities initially denied responsibility for the attack on Ngarbuh but later backpedalled following international pressure and the findings of an investigation ordered by the country's President, Paul Biya.Alongside the three soldiers sentenced on Thursday evening, a militia member also received a jail term for murder, arson and destruction. One of the victims' lawyers, Sother Menkem, told the BBC: \"The sentence was so mild, I even qualify it as friendly because we are talking of a massacre.\"Menkem pointed out that under Cameroonian law, the minimum sentence for felonies such as murder and arson is 10 years.\"I expected at least 30 years' imprisonment or more because [the soldiers] instilled much fear on the inhabitants of that area,\" he said.The soldiers' lawyers argued that their clients were merely doing their job.A man who lost several relatives in the February 2020 attack told the BBC he needed time to process the court's decision.He has since moved out of the conflict-hit region for safety reasons.The military court rejected the victims' demand for compensation, a move decried by another of their lawyers, Richard Tamfu.Human Rights Watch and legal representatives of the victims have insisted that the soldiers were acting on the instructions from their superiors and therefore criticise the fact that no senior military officer was prosecuted at the trial.The case dragged on for six years after hearings were postponed multiple times.Since 2017, separatist fighters in the country's two English-speaking regions have been campaigning for the creation of a breakaway state. Human rights groups have accused both the rebels and state forces of committing widespread abuses.The UN says the conflict has killed at least 6,000 people and forced over half a million others to flee their homes.More about Cameroon from the BBC:Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cameroon soldiers handed rare prison sentences after killing of 21 civilians in Northwest region",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/567f/live/e26fabc0-0e5e-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-20T13:44:30.000Z",
      "dateModified": "2026-02-20T13:44:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hamas holds vote to choose new interim leader, source tells BBC",
    "url": "https://www.bbc.com/news/articles/c23z0kdypm3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0638/live/db384d80-0dc3-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "World",
    "date": "2026-02-20T00:37:14.000Z",
    "description": "1 day agoRushdi AbualoufGaza correspondent, IstanbulReutersKhaled Meshaal, part of Hamas's \"old guard\", who has already led the group, is said to be o",
    "body": "1 day agoRushdi AbualoufGaza correspondent, IstanbulReutersKhaled Meshaal, part of Hamas's \"old guard\", who has already led the group, is said to be one of the frontrunnersHamas is holding an election for a new interim leader, a senior Palestinian official familiar with the armed group's affairs has told the BBC.Voting is taking place across Gaza, the occupied West Bank and among Hamas's members elsewhere. The outcome may signal which direction the movement intends to take - particularly as the US and other mediators discuss post-war governance of Gaza, reconstruction efforts and the future status of armed groups there.The elections come after most of Hamas's senior leadership were killed in Israeli strikes following the group's 7 October 2023 attacks on Israel, in which about 1,200 people were killed and 251 others taken hostage.People in Gaza have already cast their votes in secret, according to the source, but it is unclear whether the process has concluded elsewhere. When announced, the new leader will hold office for a year.Hamas governs the Gaza Strip and in recent years has had growing support in the West Bank, though its activities there are heavily constrained by the Israeli military and Palestinian Authority security forces.A US-backed ceasefire in Gaza came into effect in October, and negotiations continue over the deal's later phases.Under the proposed terms of the US plan, Hamas would have no role in the future governance of the territory. Governance would eventually be handed over to the Palestinian Authority, which administers parts of the West Bank, once it has undergone reforms.Yahya Sinwar, the overall head of Hamas, was killed by Israeli forces in Gaza in October 2024, and its political leader, Ismail Haniyeh, was killed in an Israeli attack in Iran in July that year. Hamas's military chief Mohammed Deif was also killed that July, in an Israeli air strike on Gaza.The position of overall head of Hamas has remained vacant since the deaths of Haniyeh and Sinwar, with the movement being led by an interim committee headed by Qatar-based Mohammad Darwish after the latter was killed.Under the movement's rules, the head of Hamas is chosen by an electoral college of around 86 members drawn from the General Shura Council, Hamas's top decision-making body representing Gaza, the West Bank, Palestinian prisoners in Israel, and officials based abroad.According to the official, the race is primarily between:Khalil al-Hayya, who leads Hamas in Gaza and is widely seen as aligned with Sinwar and HaniyehKhaled Meshaal, the head of Hamas abroad and one of the movement's veteran figures, who previously served as its overall leader for nearly two decadesMeshaal is currently thought to reside in Doha, Qatar.Other internal discussions have included additional names, but no formal shortlist has been announced.Impact of warThe war that followed Hamas's 7 October attack has had a deep impact on the movement's internal politics. Israeli strikes have killed senior Hamas figures and significantly diminished the group's military and political structures, weakening the influence of its Gaza-based leadership.More than 72,000 people have been killed in Gaza, the Hamas-run health ministry says, though it does not distinguish between civilians and fighters.For years, Hamas has been shaped by a persistent internal rivalry between two broad currents.One, often described as aligned with the Muslim Brotherhood, and represented by Meshaal and parts of the external leadership, is viewed by observers as more pragmatic and less ideologically rigid. The other was seen as closer to Iran, a vital Hamas ally that supplies financial backing and weaponry, and was represented most prominently by Sinwar and leaders inside Gaza.In 2017, when Haniyeh became head of the political bureau and Sinwar assumed leadership inside Gaza, decision-making shifted heavily towards the territory. The recent war, however, appears to have reopened space for figures from the movement's so-called \"old guard\", traditionally linked to Meshaal.Getty ImagesKhalil al-Hayya, seen here meeting Iran's Supreme Leader Ali Khamenei in February, is considered ideologically close to Yahya SinwarUnder Hamas's internal regulations, its political leadership is composed of 18 members: six representing Gaza, six representing the West Bank and prisoners, and six representing Hamas abroad.Figures associated with the \"old guard\" appear to be regaining more prominence after years of Gaza-dominated decision making, according to officials familiar with the discussions.With Gaza devastated by years of conflict and its political landscape in flux, the selection of a new leader is seen as a critical step in determining how Hamas navigates mounting internal and external pressures in the year ahead.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hamas holds vote to choose new interim leader, source tells BBC",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0638/live/db384d80-0dc3-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-20T00:37:14.000Z",
      "dateModified": "2026-02-20T00:37:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DAG: How photography helped the British empire classify India",
    "url": "https://www.bbc.com/news/articles/cn7jjz1r3meo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/864b/live/6cf0c0e0-0bcb-11f1-b5e2-dd58fc65f0f6.jpg",
    "tag": "World",
    "date": "2026-02-21T01:21:13.000Z",
    "description": "4 hours agoSudha G TilakDAGFemale dancers or nautch girls, early 20th Century. The photograph was taken by  Edward Taurines, one of the first European",
    "body": "4 hours agoSudha G TilakDAGFemale dancers or nautch girls, early 20th Century. The photograph was taken by  Edward Taurines, one of the first European photographers with a studio in Bombay (now Mumbai) which specialised in photographs showcasing the city for a Western audience. In the second half of the 19th Century, photography became one of the British Empire's most persuasive instruments for knowing - and classifying - India.A new exhibition - called Typecasting: Photographing the Peoples of India, 1855-1920, and organised by DAG, the Delhi-based art gallery - brings together nearly 200 rare photographs from a period when the camera was deployed to classify communities, fix identities and make India's complex social differences legible to the colonial government.Spanning 65 years, the exhibition maps an expansive human geography: from Lepcha and Bhutia communities in the north-east to Afridis in the north-west; from Todas in the Nilgiris to Parsi and Gujarati elites in western India. It also turns its gaze to those assigned to the lower rungs of the colonial social order - dancing girls, agricultural labourers, barbers and snake charmers.These images did not merely document India's diversity; they actively shaped it, translating fluid, lived realities into apparently stable and knowable \"types\".Curated by historian Sudeshna Guha, the exhibition centres on folios from The People of India, the influential eight-volume photographic survey published between 1868 and 1875. From this core, it expands outward to include albumen and silver-gelatin prints by photographers such as Samuel Bourne, Lala Deen Dayal, John Burke and the studio Shepherd & Robertson - practitioners whose images helped define the visual language of that time.\"Taken together, this material tells the history of ethnographic photography and its effect on the British administration and the Indian population, in a project which in size and depth has never before been seen in India,\" says Ashish Anand, CEO of DAG.Here's a selection of images from the exhibition:DAGWomen carrying cow dung cakes, Bombay, 1890, by Edward Taurines. Here, the women are presented in service to the household, engaged in domestic tasks typically performed within the home - but repositioned outdoors for the camera.DAGIndian woman, photographed by Felix Morin, 1890. Women feature prominently in the photographs at the show. This carefully composed colonial-era portrait captures both the ethnographic gaze of the period and the formal elegance of early photography.DAGThis 1862 photograph - 'Group of Afridis from the Khyber Pass' taken by Charles Shepherd - shows men from a Pathan tribe the British described as \"fiercely independent\" found along the Afghan border.DAGA street barber, by an unidentified photographer. Such images frequently captured street trades and everyday performances, turning ordinary labour into ethnographic subjects.DAGWilliam Johnson, a founding member of the Photographic Society of Bombay, published this image titled 'Brahmani Ladies' in the 1857 issue of The Indian Amateur's Photographic Album. The accompanying text named the two women, describing them as young and intelligent, and noted that they were in Bombay - with their father's encouragement and their husbands' support - to study English at a mission school.DAGA group of Parsis, possibly photographed by William Johnson, sit before a colonial bungalow - asserting their distinct identity through clothing and bearing, while occupying a colonial architectural world.DAGA group of young Bhutias, 1890. The volume includes photographs of people from Sikkim, Bhutan and Tibet - regions beyond the British rule. The Lepchas, Bhutias and Tibetans were photographed by Benjamin Simpson.DAGMusicians at ancient Buddhist rock-cut shrines in Maharashtra, photographed by Charles Scott, undated.DAGAn Indian family in Singapore, late 19th Century. Some images depict people from the Malay Peninsula, Singapore and Chittagong in Bangladesh.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DAG: How photography helped the British empire classify India",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/864b/live/6cf0c0e0-0bcb-11f1-b5e2-dd58fc65f0f6.jpg"
      ],
      "datePublished": "2026-02-21T01:21:13.000Z",
      "dateModified": "2026-02-21T01:21:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump 'considering' limited military strike on Iran",
    "url": "https://www.bbc.com/news/articles/cdxzk4gvzp0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1a63/live/ac7525e0-0ea4-11f1-8fa9-a78fde43271a.jpg",
    "tag": "World",
    "date": "2026-02-20T22:38:45.000Z",
    "description": "6 hours agoBernd Debusmann Jr,White House reporterandCachella SmithGetty ImagesIran's Foreign Minister Abbas Araghchi has said a proposal for an agree",
    "body": "6 hours agoBernd Debusmann Jr,White House reporterandCachella SmithGetty ImagesIran's Foreign Minister Abbas Araghchi has said a proposal for an agreement with the US will be ready in daysUS President Donald Trump has said he is considering a limited military strike on Iran in order to pressure its leaders to agree a deal to curb the nuclear programme.The president made the remark in response to a question from a journalist hours after officials had suggested the possibility of a strike.On Thursday, Trump said the world would find out \"over the next, probably, 10 days\" whether a deal would be reached or the US would take military action. The US has been increasing its military presence in the region in recent weeks.The US and its European allies suspect that Iran is moving towards the development of a nuclear weapon, something Iran has always denied.  US and Iranian officials have met over the issue in Switzerland and said progress has been made in the talks.Speaking on Friday, Iran's Foreign Minister Abbas Araghchi said Iran was preparing \"a draft of a possible agreement\" and would hand it over to US Special Envoy Steve Witkoff in the next few days.The talks in Geneva were held as American forces continued ramping up their presence in the vicinity of Iran.The deployment includes the world's largest warship, USS Gerald R Ford, appearing to be heading towards the region.USS Abraham Lincoln aircraft carrier is also being deployed, joining an increase of destroyers, combat ships and fighter jets.Satellite images have also shown that Iran has reinforced military facilities, and the country's Supreme Leader, Ayatollah Ali Khamanei, has posted messages to social media threatening US forces.\"The US President constantly says that the US has sent a warship toward Iran. Of course, a warship is a dangerous piece of military hardware,\" one of Khamenei's posts read.Trump takes questions from journalists several times a week - often in lengthy sessions in the Oval Office or on Air Force One - but his comments do not necessarily always translate into concrete actions, and often contradict each other.He is fond of reminding reporters that he prefers to keep his intentions to himself and a small circle of insiders to avoid potential adversaries knowing his next moves.\"I'm not going to talk to you about that,\" he snapped at a reporter on Thursday when asked about potential military action. \"We're going to make a deal or get a deal one way or the other.\"Even if an operation is carried out, Trump has so far yet to specify what the precise military objective would be, with US officials having reportedly presented him with a wide range of options for what could be a weeks-long campaign.In the past, Trump has also used deadlines to achieve an element of surprise.At the time of Operation Midnight Hammer in July last year - which saw US forces strike Iranian nuclear facilities - White House officials were still publicly discussing the possibility of successful talks.The day before US missiles and bombs struck the facility, White House Press Secretary Karoline Leavitt read a statement from Trump in which he said that because \"negotiations may or may not take place with Iran in the near future, I will make my decision whether or not to go within the next two weeks\".Any strikes in the near future would come at a challenging time domestically for the Trump administration, with polls showing that a growing number of Americans disapprove of Trump's handling of immigration and the economy.Unlike the one-day strike in Iran last year and the quick operation to capture Nicolás Maduro in January, a protracted, multi-week conflict with Iran threatens alienating parts of Trump's Maga base which were drawn to his campaign promise of an end to messy foreign entanglements.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump 'considering' limited military strike on Iran",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1a63/live/ac7525e0-0ea4-11f1-8fa9-a78fde43271a.jpg"
      ],
      "datePublished": "2026-02-20T22:38:45.000Z",
      "dateModified": "2026-02-20T22:38:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The day Andrew Mountbatten-Windsor was arrested",
    "url": "https://www.bbc.com/news/videos/cvg192yp9geo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/105b/live/33336e40-0de0-11f1-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-19T22:20:22.000Z",
    "description": "On Thursday morning Andrew Mountbatten-Windsor was arrested at Sandringham Estate in Norfolk, on his 66th birthday. The former prince was taken to a p",
    "body": "On Thursday morning Andrew Mountbatten-Windsor was arrested at Sandringham Estate in Norfolk, on his 66th birthday. The former prince was taken to a police station in Aylsham on suspicion of misconduct in public office - he was later released under investigation, Thames Valley Police said. In statement, King Charles III said \"the law must take its course\". The King and Queen have both been seen carrying out Royal duties as normal. Andrew's arrest came after Thames Valley Police said they were assessing a complaint over the alleged sharing of confidential material by the former prince with late sex offender Jeffrey Epstein. Andrew, has previously denied any wrongdoing in relation to Epstein; he has not responded to the BBC's requests for comment on the specific allegations in relation to the release of millions of Epstein files in January. Video by Rachel Flynn and Marina Costa.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The day Andrew Mountbatten-Windsor was arrested",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/105b/live/33336e40-0de0-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-19T22:20:22.000Z",
      "dateModified": "2026-02-19T22:20:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]