[
  {
    "title": "Vietnam floods leave at least 90 dead and 12 missing",
    "url": "https://www.bbc.com/news/articles/cwywl8g31g7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/159a/live/d2d4c660-c83f-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-23T06:27:33.000Z",
    "description": "At least 90 people have died and another 12 are missing after days of heavy rain in Vietnam led to flooding and landslides.The Vietnamese government s",
    "body": "At least 90 people have died and another 12 are missing after days of heavy rain in Vietnam led to flooding and landslides.The Vietnamese government says 186,000 homes have been damaged across the country, with more than three million livestock swept away. Officials estimate there has been hundreds of millions of pounds worth of damage.The mountainous province of Dak Lak has been severely impacted, recording more than 60 deaths since 16 November, according to news agency AFP.The floods are the latest extreme weather event to hit Vietnam in recent months, after typhoons Kalmaegi and Bualoi hit the country within weeks of each other.Some 258,000 people were without power on Sunday morning and sections of major motorways and train tracks were blocked, officials said.Military and police resources have been mobilised to assist in the hardest hit areas.The government said the most severe impacts had been observed in five provinces - Quang Ngai, Gia Lai, Dak Lak, Khanh Hoa, and Lam Dong - clustered in south and south-central Vietnam.Mach Van Si, a farmer in Dak Lak, told AFP: \"Our neighbourhood was completely destroyed. Nothing was left. Everything was covered in mud.\"Prime Minister Phạm Minh Chính chaired a virtual emergency meeting on Sunday morning from South Africa, where he had been attending the G20 summit. Rainfall had exceeded 1.5m (5ft) in several areas leading up to Friday, with some areas surpassing a 5.2m level not seen since 1993. The rain is forecast to ease in the coming days.Scientists say that Vietnam has been left more exposed to extreme weather events by human-driven climate change, which has made typhoons stronger and more frequent.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Vietnam floods leave at least 90 dead and 12 missing",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/159a/live/d2d4c660-c83f-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-23T06:27:33.000Z",
      "dateModified": "2025-11-23T06:27:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Man who grabbed Ariana Grande at premiere banned from Singapore",
    "url": "https://www.bbc.com/news/articles/cpd6qey9e4zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6b04/live/f42644e0-c846-11f0-b991-15c7bfbd8eea.jpg",
    "tag": "World",
    "date": "2025-11-23T08:54:26.000Z",
    "description": "20 hours agoDanai Nesta KupembaBBC NewsAn Australian man who jumped over a barricade and grabbed Hollywood star Ariana Grande has been deported and ba",
    "body": "20 hours agoDanai Nesta KupembaBBC NewsAn Australian man who jumped over a barricade and grabbed Hollywood star Ariana Grande has been deported and banned from Singapore.Johnson Wen, 26, was sentenced to nine days in prison for being a public nuisance and has now been \"barred from re-entering Singapore\", the Immigration and Checkpoints Authority (ICA) told local media. Wen pushed past photographers and charged at the actress and singer, who was attending the Asian premier for Wicked: For Good on 13 November. Co-star Cynthia Erivo wrestled him away from Grande. Wen has a history of disrupting concerts and celebrity events, including jumping on stage at Katy Perry's Sydney concert in June this year.The incident sparked outrage in Singapore, with many accusing him of re-traumatising Grande. The pop star has spoken of experiencing post-traumatic stress disorder after a suicide bomb attack at her concert in Manchester in May 2017 killed 22 people and injured hundreds.During Wen's trial, the court heard he had attempted to intrude on the film's premiere twice, according to Singaporean media.He then made a second attempt to jump the barricades. Security staff stopped him and pinned him down.Wen later posted videos thanking Grande for letting him on the carpet and said he was \"free\". Police arrested him the next day and charged him with public nuisance, to which Wen pleaded guilty. The District Judge Christopher Goh was quoted by Channel News Asia as saying that Wen was \"attention seeking\", adding that he was wrong to think he would not suffer any consequences. Grande has not commented on the case. Erivo spoke about the incident to NBC, saying that she \"just wanted to make sure my friend was safe\".\"I'm sure he didn't mean us harm, but you never know with those things, and I wanted to make sure that she was OK. That was my first instinct,\" she said. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Man who grabbed Ariana Grande at premiere banned from Singapore",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6b04/live/f42644e0-c846-11f0-b991-15c7bfbd8eea.jpg"
      ],
      "datePublished": "2025-11-23T08:54:26.000Z",
      "dateModified": "2025-11-23T08:54:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Seven arrested in India after police crack $800,000 bank heist",
    "url": "https://www.bbc.com/news/articles/cy8j4m45yx2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e250/live/492bce90-c7ae-11f0-83e1-2f64c544cba6.jpg",
    "tag": "World",
    "date": "2025-11-23T11:33:59.000Z",
    "description": "17 hours agoImran Qureshi and Jessica RawnsleySeven people have been arrested in India after a daring 70m rupees ($800,000; £600,000) heist in which a",
    "body": "17 hours agoImran Qureshi and Jessica RawnsleySeven people have been arrested in India after a daring 70m rupees ($800,000; £600,000) heist in which armed men posing as central bank officials robbed an ATM cash van.On Saturday police in the southern city of Bengaluru said they had cracked the case and recovered 57.6m rupees of the money stolen three days earlier.Bengaluru police commissioner Seemant Kumar Singh told the BBC on Sunday that a seventh man had been arrested in Bengaluru, adding it would take time to determine the amount of money \"in his possession.\"Singh said the police are still looking \"for two or, maybe, three more,\" suspects.Those arrested include Gopal Prasad, an employee of cash transport company CMS, J Xavier, a former CMS worker, and Annappa Naik, a local police constable.The robbery took place in broad daylight in the Lalbagh area of Bengaluru. The thieves pretended to be officers of the Reserve Bank of India. They stopped the transport vehicle saying they had to check the paperwork for such a large amount of money.The vehicle's cash custodian and two security guards were instructed to get into an SUV, while one of the gang members took control of the van, police said.Police said the gang had changed vehicles, used fake registration plates and selected locations with minimal CCTV coverage to transfer the boxes of cash.A massive hunt was launched on Wednesday, with more than 200 police officers deployed across Karnataka state and the neighbouring Kerala, Tamil Nadu, Telangana, Andhra Pradesh and Goa states.Detectives are investigating the role of CMS and possible violations of guidelines for transferring cash, Singh said.\"The vans should not follow the same route and timing repeatedly so as to become predictable,'' he added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Seven arrested in India after police crack $800,000 bank heist",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e250/live/492bce90-c7ae-11f0-83e1-2f64c544cba6.jpg"
      ],
      "datePublished": "2025-11-23T11:33:59.000Z",
      "dateModified": "2025-11-23T11:33:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "COP30 fire: BBC at the scene of 'intense' blaze",
    "url": "https://www.bbc.com/news/videos/cn5159k1krzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f1e6/live/d697fe90-c63f-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-20T21:58:46.000Z",
    "description": "The UN climate talks COP30 have been evacuated due to a fire breaking out inside the venue in Belém, Brazil.BBC journalists including Climate Editor J",
    "body": "The UN climate talks COP30 have been evacuated due to a fire breaking out inside the venue in Belém, Brazil.BBC journalists including Climate Editor Justin Rowlatt saw flames and smoke in the pavilion area before they were rushed outside.The UN said the fire was extinguished after six minutes and 13 people were treated for smoke inhalation. It is not yet known what caused the blaze.More on this story.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "COP30 fire: BBC at the scene of 'intense' blaze",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f1e6/live/d697fe90-c63f-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-20T21:58:46.000Z",
      "dateModified": "2025-11-20T21:58:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israel kills top Hezbollah official in first attack on Beirut in months",
    "url": "https://www.bbc.com/news/articles/cn81j54xjx1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9268/live/f96bce90-c87b-11f0-b59b-8f3754d4238d.jpg",
    "tag": "World",
    "date": "2025-11-23T19:31:39.000Z",
    "description": "9 hours agoHugo BachegaMiddle East correspondent, BeirutIsrael's military has killed a senior member of the militant group Hezbollah in an air strike ",
    "body": "9 hours agoHugo BachegaMiddle East correspondent, BeirutIsrael's military has killed a senior member of the militant group Hezbollah in an air strike on the southern suburbs of the Lebanese capital, Beirut, despite a ceasefire.It described Haitham Ali al-Tabtabai, Hezbollah's chief of staff, as a veteran of the group who had held a series of senior positions.Lebanon's health ministry said at least five people were killed and 28 others wounded in the strike, which hit an apartment building in the densely populated Dahieh district.Hezbollah confirmed Tabtabai's death, adding Israel had crossed a \"red line\" in carrying out the strike.The strike is Israel's first on southern Beirut for months.It comes as Israel has escalated its campaign on people and targets it says are linked to Hezbollah - a Shia Muslim group supported by Iran - despite a ceasefire brokered by the US and France that came into effect last November.Israeli officials say Hezbollah has been trying to rebuild its military capabilities, is smuggling weapons into Lebanon and stepping up the production of explosive drones as an alternative to rockets and missiles, and there are growing fears of an escalation of hostilities.In a statement after the strike, Israeli Prime Minister Benjamin Netanyahu said: \"Under my leadership, the State of Israel will not allow Hezbollah to rebuild its power, and we will not allow it to once again pose a threat to the State of Israel.\"He said he expected the Lebanese government \"to fulfill its commitment to disarm Hezbollah\".Lebanon's President Joseph Aoun has urged the international community to put pressure on Israel - which continues to occupy at least five locations in southern Lebanon - to stop the attacks and withdraw from the country, saying the Israeli actions are a violation of the agreement that put an end to 13 months of conflict.The Lebanese government has vowed to disarm Hezbollah, but the group has rejected calls to discuss the future of its weapons before Israel stops its attacks, fully withdraws from Lebanon, and releases Lebanese prisoners. A Western diplomatic official, who spoke on condition of anonymity, told the BBC the authorities are under pressure from the Trump administration, which is growing impatient with what they see as the slow progress against the group, considered a terrorist organisation by countries including the US and UK.The latest conflict between Israel and Hezbollah erupted after the Lebanese group started firing rockets at Israeli positions the day after the Hamas attacks of 7 October 2023. Hezbollah said it was acting in solidarity with Palestinians in Gaza.Lebanese authorities said Israel's attacks killed about 4,000 people there - including many civilians - and led to the displacement of more than 1.2 million residents. Israeli authorities said more than 80 of its soldiers and 47 of its civilians were killed in the hostilities.The US government imposed sanctions on Tabtabai in 2016 and designated him a terrorist. It has a $5m (£3.8m) award on offer for information about him.The US described him as a key Hezbollah military leader who once commanded the group's special forces in Syria and Yemen, adding his actions in these countries were part of a larger Hezbollah effort to provide training, material, and personnel \"in support of its destabilising regional activities\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israel kills top Hezbollah official in first attack on Beirut in months",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9268/live/f96bce90-c87b-11f0-b59b-8f3754d4238d.jpg"
      ],
      "datePublished": "2025-11-23T19:31:39.000Z",
      "dateModified": "2025-11-23T19:31:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jair Bolsonaro says ankle monitor damage caused by paranoia",
    "url": "https://www.bbc.com/news/articles/c4gplp979j1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5d71/live/be453ed0-c8aa-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-23T20:49:58.000Z",
    "description": "Jair Bolsonaro, the former Brazilian president convicted of plotting a coup, has blamed medicine-induced \"paranoia\" for damage he caused to his ankle ",
    "body": "Jair Bolsonaro, the former Brazilian president convicted of plotting a coup, has blamed medicine-induced \"paranoia\" for damage he caused to his ankle monitor - a day after he was removed from house arrest into detention.At a hearing in Brasília, he admitted trying to open the monitor with a soldering iron on Friday until he \"came to his senses\", court documents show. He said he had had no intention of fleeing.Officials say the right-wing politician, 70, was taken into custody because he was a flight risk ahead of a supporters' vigil outside his home. He will remain in detention.In September, Bolsonaro was sentenced to more than 27 years in prison for the coup plot.Bolsonaro is being held in a police station in the capital.His legal woes have drawn the ire of fellow right-wing populist US President Donald Trump, prompting him to impose a 50% tariff on imports of Brazilian goods.Bolsonaro was found guilty of leading a conspiracy aimed at keeping him in power after he lost the 2022 election to his left-wing rival, Luiz Inácio Lula da Silva.Supreme Court justices said that he had known of a plot which included plans to assassinate Lula and his vice-presidential running mate, Geraldo Alckmin, and to arrest and execute Moraes, who has been overseeing Bolsonaro's trial.The conspiracy failed to get the backing of the army and air force commanders. Lula was sworn in without incident on 1 January 2023.But a week later, on 8 January, thousands of Bolsonaro supporters stormed government buildings in Brasília. The security forces intervened and about 1,500 people were arrested.The justices found that the rioters had been incited by Bolsonaro whose plan, they said, was for the military to step in and return him to power.Bolsonaro was also barred from running for public office until 2060 - eight years after the end of his sentence.The former president called the trial a \"witch hunt\" designed to prevent him running in the 2026 presidential election.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jair Bolsonaro says ankle monitor damage caused by paranoia",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5d71/live/be453ed0-c8aa-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-23T20:49:58.000Z",
      "dateModified": "2025-11-23T20:49:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "JFK's granddaughter Tatiana Schlossberg shares terminal cancer diagnosis",
    "url": "https://www.bbc.com/news/articles/cpvdyg348pko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2d43/live/ef259260-c7cf-11f0-b259-1f10e6cadd18.jpg",
    "tag": "World",
    "date": "2025-11-23T07:42:57.000Z",
    "description": "The granddaughter of former US President John F Kennedy has announced her diagnosis with an aggressive form of cancer.Tatiana Schlossberg said she has",
    "body": "The granddaughter of former US President John F Kennedy has announced her diagnosis with an aggressive form of cancer.Tatiana Schlossberg said she has been given less than a year to live.The 35-year-old shared the news in an essay published in The New Yorker on Saturday - the 62nd anniversary of her grandfather's assassination.The mother-of-two climate journalist has been an outspoken opponent of her relative Robert F Kennedy Jr's position as US health secretary under President Donald Trump. In her essay, Schlossberg describes her alarm at watching her cousin be approved to the post as she was battling her illness. Schlossberg is the daughter of designer Edwin Schlossberg and diplomat Caroline Kennedy. She is the granddaughter of John F. Kennedy, the 35th president of the United States, and First Lady Jacqueline Kennedy Onassis. According to Schlossberg's essay titled A Battle With My Blood, she was diagnosed with acute myeloid leukaemia after giving birth in May 2024.She described her previously healthy lifestyle, which included running, skiing and even once swimming in New York's Hudson River, \"eerily, to raise money for the Leukemia and Lymphoma Society\".Despite treatment, including a bone marrow transplant and chemotherapy, she said doctors have told her the outcome does not look good. \"During the latest clinical trial, my doctor told me that he could keep me alive for a year, maybe,\" she writes. \"My first thought was that my kids, whose faces live permanently on the inside of my eyelids, wouldn't remember me.\" Schlossberg's son was born in 2022 and her daughter in 2024.Schlossberg, whose uncle John F Kennedy Jr died in a plane crash at age 38 and whose grandmother Jacqueline died of cancer when Schlossberg was a toddler, also describes the pain she fears her death will cause her mother, who previously served as US ambassador to Australia and Japan. \"For my whole life, I have tried to be good, to be a good student and a good sister and a good daughter, and to protect my mother and never make her upset or angry,\" she writes. \"Now I have added a new tragedy to her life, to our family's life, and there's nothing I can do to stop it.\" She also described her upset at watching her cousin, known as RFK Jr - whose father Robert F Kennedy was also assassinated while running for president - become Trump's health secretary.\"I watched from my hospital bed as Bobby, in the face of logic and common sense, was confirmed for the position, despite never having worked in medicine, public health, or the government,\" she writes. \"Suddenly, the healthcare system on which I relied felt strained, shaky.\"Earlier this month, her brother Jack Schlossberg announced that he is planning to run for Congress in New York. He shared her essay online on Saturday, with the caption: \"Life is short - let it rip.\"The Kennedy family's generations-spanning participation in US politics - along with the personal tragedy which has often touched its members - has garnered it a prominent reputation in American life.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "JFK's granddaughter Tatiana Schlossberg shares terminal cancer diagnosis",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2d43/live/ef259260-c7cf-11f0-b259-1f10e6cadd18.jpg"
      ],
      "datePublished": "2025-11-23T07:42:57.000Z",
      "dateModified": "2025-11-23T07:42:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Aonishiki: Ukraine sumo prodigy becomes champion in Japan",
    "url": "https://www.bbc.com/sport/articles/cp84m625d33o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/84fa/live/b3e42500-c869-11f0-9801-5751a93d23e1.jpg",
    "tag": "World",
    "date": "2025-11-23T13:09:18.000Z",
    "description": "A Ukrainian refugee has become the first person from his country to win an elite-level sumo tournament.Danylo Yavhusishyn - known by his sumo ring nam",
    "body": "A Ukrainian refugee has become the first person from his country to win an elite-level sumo tournament.Danylo Yavhusishyn - known by his sumo ring name Aonishiki - arrived in Japan as an 18-year-old in 2022 after the Russian invasion of his country.Now aged 21, he is the first Ukrainian to claim the prized Emperor's Cup and the first European in almost eight years to do so.He is now on the verge of being promoted to the second-highest rank of Ozeki, in what would be the fastest promotion in history.Aonishiki finished the 15-day tournament in Fukuoka, Japan, with a record of 12 wins and three losses and went on to win the championship play-off against Yokozuna grand champion Hoshoryu, a 26-year-old Mongolian who won last month's London tournament.In his winning ceremony interview, Aonishiki was asked if he felt satisfied with his results after three years in sumo.\"No, I think this is just the beginning,\" he replied.The name Aonishiki contains the Japanese character for \"blue\" - a reference to the Ukrainian flag.Aonishiki is only the second Ukrainian in the top division in sumo. He first tried sumo aged seven, after also practicing judo and freestyle wrestling.He impressed in youth amateur sumo competitions, and fled to Germany with his family after Russia's invasion.He moved to Japan by himself in April 2022, without knowing the language, with the help of a university sumo club captain he met previously at a youth championship event.Despite only being in professional sumo for a short time, he has gained fans in Japan and worldwide with his impressive skills, constant improvement and competitiveness.He often defeats opponents with seldom-used techniques, receiving praise from both professionals and sumo enthusiasts.Aonishiki, who was one of the most cheered wrestlers at last month's Grand Sumo Tournament at the Royal Albert Hall in London, is tipped by many to become the first-ever European to reach sumo's highest rank of Yokozuna grand champion.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Aonishiki: Ukraine sumo prodigy becomes champion in Japan",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/84fa/live/b3e42500-c869-11f0-9801-5751a93d23e1.jpg"
      ],
      "datePublished": "2025-11-23T13:09:18.000Z",
      "dateModified": "2025-11-23T13:09:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israeli strikes across Gaza kill 22 Palestinians, Hamas-run health ministry and civil defence say",
    "url": "https://www.bbc.com/news/articles/c20879zzqn8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e122/live/714f42f0-c7c5-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-22T20:43:36.000Z",
    "description": "1 day agoRushdi Abualouf,Gaza correspondent, Istanbul and Jon Donnison,correspondent, JerusalemAt least 22 Palestinians have been killed in a series o",
    "body": "1 day agoRushdi Abualouf,Gaza correspondent, Istanbul and Jon Donnison,correspondent, JerusalemAt least 22 Palestinians have been killed in a series of Israeli air strikes across northern and central Gaza, Hamas medical and civil defence officials have said.They said five sites had been hit, including residential homes. A senior Hamas commander was among the dead, according to local sources.The Israeli military said it had struck targets in Gaza in response to an incident earlier on Saturday, when it said an \"armed terrorist\" had fired at soldiers after crossing the Strip's so-called \"yellow line\" designating areas under full Israeli control. Hamas denied this.Both sides have accused each other of violating the ceasefire deal agreed on six weeks ago.More than 310 Palestinians have been killed in Israeli strikes since the ceasefire came into force, according to Gaza's health ministry.The territory's civil defence said Saturday's strikes by Israel targeted Gaza City in the north, as well as Deir al-Balah and Nuseirat camp in central Gaza.The Hamas officials said five people had been killed at the Abbas junction in the densely populated Rimal area of Gaza City. Witnesses said an Israeli strike set a car on fire.In addition, three people were killed near a mosque in Deir al-Balah, the officials said.Two houses were targeted in Israeli strikes in Nuseirat, they added, with three killed after the home of the Abu Amouneh family was hit. Seven others were killed in another strike targeting the house of the Abu Shawish family.Three more people were killed later on Saturday when a house in western Gaza City was hit, officials reported.The office of Prime Minister Benjamin Netanyahu said in a later statement: \"Today, Hamas violated the ceasefire again, sending a terrorist into Israel held territory to attack IDF soldiers. In response, Israel eliminated five senior Hamas terrorists.\"The statement also called on mediators to \"insist that Hamas fulfil its side of the ceasefire\".Following the strikes, Hamas said the army's westward push of the yellow line and continued bombardment of eastern Gaza amounted to a \"blatant breach\" of the agreement.The group called on mediators and the US to intervene urgently, warning that Israel was attempting to impose \"new facts on the ground\" and undermine the ceasefire.The Israeli military launched an offensive in Gaza in response to the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.At least 69,500 people have been killed in Israeli attacks in Gaza since then, including 280 during the ceasefire, according to the territory's health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israeli strikes across Gaza kill 22 Palestinians, Hamas-run health ministry and civil defence say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e122/live/714f42f0-c7c5-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-22T20:43:36.000Z",
      "dateModified": "2025-11-22T20:43:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rubio hails 'tremendous progress' at Ukraine peace talks",
    "url": "https://www.bbc.com/news/articles/ce3zwy808dpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ef5e/live/ea587380-c88b-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-24T02:02:10.000Z",
    "description": "A \"tremendous amount of progress\" has been achieved in talks to finalise a US-proposed peace plan to end the Russia-Ukraine war, Secretary of State Ma",
    "body": "A \"tremendous amount of progress\" has been achieved in talks to finalise a US-proposed peace plan to end the Russia-Ukraine war, Secretary of State Marco Rubio has said.But \"there's still some work to be done\", Rubio said after meeting Ukrainian and European negotiators in Geneva, Switzerland.Ukrainian President Volodymyr Zelensky said there were \"signals that President [Donald] Trump's team is hearing us\". Ukraine and its European allies had expressed concern over the leaked proposals, seen as favouring Russia and welcomed by Vladimir Putin as \"the basis\" for settlement. Zelensky had said Ukraine \"might face a very difficult choice: either losing dignity, or risk losing a key partner\".Speaking to reporters late on Sunday, Rubio said the negotiating teams in Geneva had had a \"very good day\".He said the main goal had been to try to narrow \"open items\" from the 28-point US plan - and the parties involved had achieved that in a \"substantial way\".However, America's top diplomat added that any final agreement would have to be agreed by the Ukrainian and US presidents - before the package was sent to Russia -  and that there were still a couple of issues they need to continue to work on.A joint US-Ukraine statement issued later on Sunday said that an \"updated and refined peace framework\" had been agreed by both countries, and that they agreed to \"intensive work on joint proposals in the coming days\".Several media outlets reported they had seen an alternative plan from Kyiv's European allies led by the UK, France and Germany. The BBC has not seen the document and Rubio denied any knowledge of its existence. Earlier on Sunday, Trump accused Ukraine's leaders of showing \"zero gratitude\" for US efforts to end the Russia-Ukraine war.The US president also pointed out that Europe - where Kyiv has some of its staunchest allies - was continuing to buy oil from Russia.Moscow relies heavily on its oil and gas exports to continue financing its war in Ukraine.The Geneva talks are focusing on the US draft, the leaked version of which includes a Ukrainian troop withdrawal from the part of the eastern Donetsk region that they currently control, and the de facto Russian control of Donetsk, as well as the neighbouring Luhansk region in addition to the southern Crimea peninsula annexed by Russia in 2014.The plan also includes freezing the borders of Ukraine's southern Kherson and Zaporizhzhia regions along the current battle lines. Both regions are partially occupied by Russia.The US plan also limits Ukraine's military to 600,000 personnel - from about 880,000 now.The draft crucially includes a pledge for Ukraine not to seek membership of Nato. Instead, Kyiv would receive \"reliable security guarantees\" about which no details have been given. The document says \"it is expected\" that Russia will not invade its neighbours and that Nato will not expand further.The draft also suggests Russia will be \"reintegrated into the global economy\", through the lifting of sanctions and by inviting Russia to rejoin the G7 group of the world's most powerful countries - making it the G8 again.Russia currently controls about 20% of Ukrainian territory and its troops have been making slow advances along the vast front line, despite reported heavy losses.Trump has given Ukraine until this coming Thursday to agree the proposals. But he then said this was not his \"final offer\" for Kyiv, after Ukraine's allies from Europe, Canada and Japan voiced concerns.And Rubio told reporters on Sunday he was \"very optimistic that we're going to get there in a very reasonable period of time very soon\", whether it was Thursday, other days, or Monday the following week.Before the talks began in Geneva, Rubio and the State Department were forced to insist the widely-leaked plan had been authored by the US.That came after a bipartisan group of US senators claimed the secretary of state had told them the draft was a Russian proposal and did not represent the Trump administration's position.Rubio rebutted that account and said it had been authored by the US with \"input\" from Moscow and Kyiv, while a State Department spokesperson described the senators' account of their conversation with Rubio as \"blatantly false\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rubio hails 'tremendous progress' at Ukraine peace talks",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ef5e/live/ea587380-c88b-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-24T02:02:10.000Z",
      "dateModified": "2025-11-24T02:02:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Machu Picchu hit by a row over tourist buses",
    "url": "https://www.bbc.com/news/articles/ce8g8wrd61zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ed66/live/70165840-c619-11f0-934b-cf5196b3cbea.jpg",
    "tag": "World",
    "date": "2025-11-24T00:06:53.000Z",
    "description": "4 hours agoJane ChambersBusiness reporter, Aguas Calientes, PeruAFP via Getty ImagesMachu Picchu attracts more than 1.6 million tourists per year, but",
    "body": "4 hours agoJane ChambersBusiness reporter, Aguas Calientes, PeruAFP via Getty ImagesMachu Picchu attracts more than 1.6 million tourists per year, but getting there is not easyMachu Picchu, the remains of a 15th Century Inca city, is Peru's most popular tourist destination, and a Unesco world heritage site. Yet a continuing dispute over the buses that take visitors up to the mountain-top site recently saw some 1,400 stranded tourists needing to be evacuated.Cristian Alberto Caballero Chacón is head of operations for bus company Consettur, which for the past 30 years has transported some 4,500 people every day to Machu Picchu from the local town of Aguas Calientes.It is a 20-minute journey, and the only alternative is an arduous, steep, two-hour walk.He admits that in the past few months \"there have been some conflicts between people from different communities here\".This conflict revolves around Consettur losing its licence to a rival bus firm in this remote part of Peru, where, unless you want to hike over Andes mountains, the only access is by public transport.To get to Machu Picchu without walking, tourists must first take a train to Aguas Calientes, which takes from two to three and a half hours. And then transfer to a bus for the final leg.Wilson ChiloA fleet of buses ferry tourists to Machu Picchu from the local town of Aguas CalientesBack in September, local protestors angry that Consettur was being replaced following what they saw as an insufficiently open bidding process, blocked the railway line to Aguas Calientes with rocks.This resulted in Peruvian authorities having to clear the tracks and evacuate tourists on special train services.A number of local people, who didn't want to go on the record, say the protestors were unhappy that Consettur had a monopoly on the lucrative bus service, and that its position as sole provider was simply due to be transferred to new company San Antonio de Torontoy. A round-trip bus ticket costs $24 (£18) for a foreigner and $15 for a Peruvian.Although Consettur's licence ran out in September, it is continuing to run its buses. And due to legal challenges, San Antonio de Torontoy has yet to start.It's a complex situation, involving people from different local communities wanting a slice of the bus income, but Mr Caballero is adamant that Consettur is not a monopoly.\"The owners of the business have been running the company for the past 30 years, and they are people who come from around here,\" he says. \"This is not a monopoly. Consettur is made up of 12 different companies with various partners.\"These partners include the local district council, which owns 38% of Consettur.Meanwhile, San Antonio de Torontoy is based slightly further away in the wider Urubamba Province.AFP via Getty ImagesUnless you fancy a long hike, the only way to get to the town of Aguas Calientes is by trainAs the row and legal dispute over the buses rumbles on, Australian tourist Annalise Jaksic complains about the cost of the trains to Aguas Calientes. The cheapest round-trip ticket is $140, rising to $2,000 for luxury first class.Speaking in Aguas Calientes, she says: \"We thought it was one train [all the way to Machu Picchu]. And we thought if there was any more transport to get up there it would all be included, because you pay so much money for the train.\"Her friend and travelling companion Todd Carland adds that buying the entry tickets for the site \"was a nightmare for us\". He says it was difficult to arrange because they weren't doing it through an expensive guided tour. A standard adult price for Machu Picchu is $57.The mayor of Aguas Calientes, Elvis La Torre, is also unhappy about the tickets, because he says that most of the revenues do not stay locally.\"Only 10% of the ticket sales stay in the region. The rest of the money goes to the Ministry of Culture to look after other archaeological sites around Peru and pay for wages.\"He wants more money to go to his community and the surrounding region to help improve tourism and fund more projects to help the locals. The Ministry of Culture was asked for a comment.Wilson ChiloCristian Alberto Caballero Chacón says Consettur would welcome the competitionOutside on one of the side streets that are full of stalls offering tourism souvenirs, like fluffy alpacas and scarves, Dina Huillca is sitting on the pavement selling roses, tomatoes and mint. She travels from her village to get here, and says that \"more needs to be done for the local communities\".She adds: \"We don't have basic services like running water, or a hospital, and the schools need to be in better condition.\"Carlos González is president of the chamber of tourism for this region of Peru, the Department of Cusco. He has an ambitious desire to see the state control of all public transport in Peru.\"We are pushing for an update in the law so that the vice ministry of tourism can take care of all the travel resources in our country,\" he says. \"If we don't have a unified approach to Peru as a destination we can't be competitive in the long term.\"He also wants to change tourists' experiences in Machu Picchu, with more entrances, and separate areas where different types of visitors can gather.\"[Such as] spiritual travellers going and having meditative rituals in one area,\" says Mr Gonzalez. \"And let's not forget the younger crowd who are more inclined to do their Tik Toks and their stories for Instagram. They also need a place for doing that and enjoying themselves in a young fashion.\"But he says that Peru's unstable national governments make change difficult. The country has had six different presidents in the past six years.\"I've been a leader of the tourism sector for five years now, and I have lost count of how many ministers, vice ministers and congress people I have spoken to.\"Back in Aguas Calientes, Mr Caballero says he'd be happy to see both Consettur and San Antonio de Toronto run buses to and from Machu Picchu.\"If they are given the final approval we don't have a problem with working with them. We won't stop them.\"Read more global business and tech stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Machu Picchu hit by a row over tourist buses",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ed66/live/70165840-c619-11f0-934b-cf5196b3cbea.jpg"
      ],
      "datePublished": "2025-11-24T00:06:53.000Z",
      "dateModified": "2025-11-24T00:06:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC visits US-led Gaza ceasefire monitoring centre in Israel",
    "url": "https://www.bbc.com/news/videos/cjw9wzvw63zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/778e/live/9bcb6560-c610-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "World",
    "date": "2025-11-20T14:46:04.000Z",
    "description": "US and Israeli soldiers as well as military representatives from more than 20 other countries, diplomats and aid workers, are now based at a warehouse",
    "body": "US and Israeli soldiers as well as military representatives from more than 20 other countries, diplomats and aid workers, are now based at a warehouse in southern Israel, monitoring the almost six-week-old ceasefire in Gaza.The US-led Civil-Military Coordination Centre (CMCC) is tasked with managing the next stages of President Donald Trump's Gaza peace plan, including the entry of humanitarian supplies and plans for reconstruction. However, there is no formal Palestinian representation there, which has prompted criticism.Our Middle East correspondent Yolande Knell was given access to the site.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC visits US-led Gaza ceasefire monitoring centre in Israel",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/778e/live/9bcb6560-c610-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-20T14:46:04.000Z",
      "dateModified": "2025-11-20T14:46:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Marjorie Taylor Greene went from Trump ally to quitting Congress",
    "url": "https://www.bbc.com/news/articles/cwywjz202r7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ab26/live/986dcfa0-c7ca-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "World",
    "date": "2025-11-22T17:43:11.000Z",
    "description": "1 day agoAnthony ZurcherNorth America correspondent, WashingtonKey moments from Trump and Greene's public falloutMarjorie Taylor Greene came into Cong",
    "body": "1 day agoAnthony ZurcherNorth America correspondent, WashingtonKey moments from Trump and Greene's public falloutMarjorie Taylor Greene came into Congress as one of Donald Trump's staunchest defenders. Sworn into office just days before the 6 January 2021 attack on the US Capitol, Greene supported the president - and echoed his contention that the 2020 presidential election was \"stolen\" - when many in the Republican Party disavowed him.Now, five years later, Greene will leave Congress having been branded a \"traitor\" by the man she once revered.Over the course of just a handful of months, Greene broke with Trump in the most dramatic fashion. Although Greene had criticised Trump's decision to launch airstrikes on Iran, his support for Israel during the Gaza War and a lack of sufficient regulation of big technology companies earlier this year, the final fracture began over Jeffrey Epstein, the late financier and convicted paedophile who had connections to the wealthy and powerful. She condemned Trump's unwillingness to order his justice department to fully release its files on the case, and appeared alongside Epstein's victims – and Democrats - to force a House vote on the matter.It didn't end there, however.Greene would also question Republican strategy during the recent government shutdown, siding with Democrats in calling on her party to address expiring healthcare subsidies for low-income Americans.She publicly berated Trump for what she said was an undue emphasis on foreign policy at the expense of addressing economic and affordability concerns.\"The American people aren't motivated by foreign wars or bailouts for other countries,\" she wrote on X earlier this month. \"They want leaders who show up, do the job, and fight for them every single day!\"Getty ImagesGreene spoke at a press conference alongside US lawmakers and Epstein's accusers at the US Capitol in SeptemberGreene continued to insist that she supported Trump, but it became increasingly clear that she has a view of the \"America First\" movement that differs from the US president's. An activist turned congresswoman who made her name railing against the political establishment had now found that the Maga – \"Make America Great Again\" - movement she supported had become the establishment.And as the weight of Trump's power focused on her ouster – she broke for the exits with a few parting shots.\"I refuse to be a 'battered wife' hoping it all goes away and gets better,\" she said in her resignation statement. \"If I am cast aside by Maga Inc and replaced by Neocons, Big Pharma, Big Tech, Military Industrial War Complex, foreign leaders, and the elite donor class that can't even relate to real Americans, then many common Americans have been cast aside and replaced as well.\"Watch: Marjorie Taylor Greene announces resignation in video messageThroughout her career, she often embraced controversy and leaned into conflict. A gym instructor in Georgia, she began engaging in politics in 2016, as Trump started his successful campaign for the White House. She made frequent trips to Washington DC, where she would berate Democratic members of Congress for what she said were their socialist and pro-Islam policies.She promoted baseless QAnon conspiracy theories, questioning whether shootings in a US school were \"staged\" and alleging that the Democratic party was secretly run by a group of powerful paedophiles.Once in Congress, she clashed with Democrats - and members of her own party. Although she renounced some of her past conspiratorial views, the House voted to remove her from her committee assignments shortly after she took office.When Republicans returned to power in Congress she had a political rehabilitation of sorts, working with then Speaker of the House Kevin McCarthy to consolidate conservative support in the chamber. When McCarthy was ousted, Greene fought with his replacement, Mike Johnson, and launched an unsuccessful bid to remove him as well. In 2023, she was expelled from the conservative House Freedom Caucus.She had become a political wildcard – still despised by many on the left but also viewed with suspicion by conservatives. She still had close ties with Trump, which gave her influence in Washington. And then she didn't.AFP via Getty ImagesGreene and Trump on the campaign trail in 2024In a brief interview on Friday night, Trump told ABC News that Greene's departure from Congress was \"great news for the country\".He would later post on Truth Social that Greene \"went bad\" but that he would \"always appreciate Marjorie and thank her for her service to our country\".Greene said she will return to her home in Georgia and a \"new path ahead\". Although she had reportedly expressed interest in the state's governor race next year, she recently said she would not seek that office – or seek to unseat incumbent Democratic Senator Jon Ossoff.Her decision to resign effective 5 January, however, leaves open the possibility that she could change her mind and run for office in a state where Republican politicians, like the current Georgia governor Brian Kemp, have shown that it is possible to win elections even without Trump's support.The move also allows Greene to reposition herself politically, as the Republican Party begins grappling with an environment where public support for Trump - particularly his handling of the economy - appears to be souring and the president, limited by the constitution, will never appear on a presidential ballot again.At 51, Greene's tenure in Congress may be at an end, but her involvement in American political life may be far from over.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Marjorie Taylor Greene went from Trump ally to quitting Congress",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ab26/live/986dcfa0-c7ca-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-22T17:43:11.000Z",
      "dateModified": "2025-11-22T17:43:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fifty children escape after mass school abduction in Nigeria",
    "url": "https://www.bbc.com/news/articles/cpwk5qzzppzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/86ec/live/f9992680-c883-11f0-bd12-71741f879d80.jpg",
    "tag": "World",
    "date": "2025-11-23T17:53:05.000Z",
    "description": "11 hours agoRichard Kagoe,Nairobi, Kenya and Wedaeli ChibelushiFifty of the 315 children kidnapped by gunmen from a Catholic school in Nigeria's Niger",
    "body": "11 hours agoRichard Kagoe,Nairobi, Kenya and Wedaeli ChibelushiFifty of the 315 children kidnapped by gunmen from a Catholic school in Nigeria's Niger State on Friday have escaped. The Christian Association of Nigeria says they have been reunited with their families.A major military-led search and rescue operation is under way for the remaining 265 children and 12 teachers who were taken with them.Authorities in several Nigerian states ordered schools to shut following the mass abduction in Niger and another smaller hostage-taking in Kebbi state on Monday when 20 pupils were kidnapped from a boarding school.  In another development, 38 people abducted from a church service in Kwara state last week were freed on Sunday, the state governor said.Two people were killed in the attack on Christ Apostolic Church in Eruku.Orders were given for many schools to close in the states of Kebbi, Niger, Katsina, Yobe and Kwara.News of the children's escape brought welcome relief for families and for a country that has been agonising over the fate of hundreds of schoolchildren abducted in Nigeria's northwest. According to a Christian group involved in the case, the pupils managed to escape between Friday and Saturday in what is being described as a brave and risky attempt to flee their captors.The students and teachers were taken from St Mary's School in Papiri, Niger state. Earlier reports spoke of 303 students and 12 teachers being taken. Their number surpasses the 276 abducted during the infamous Chibok mass abduction of 2014.Local police say armed men stormed St Mary's at around 02:00 (01:00 GMT), abducting students staying there.Niger state governor Mohammed Umaru Bongo announced on Saturday that all schools in the area would close, warning that was \"not a time for blame game\".Calling for the release of the abductees, Pope Leo XIV expressed \"immense sadness\" and urged the authorities to act swiftly.Dominic Adamu, whose daughters attend the school but were not taken, told the BBC: \"Everybody is weak... It took everybody by surprise.\"One distressed woman tearfully told the BBC that her nieces, aged six and 13, had been kidnapped, adding: \"I just want them to come home.\"The military, police and local vigilantes are conducting a search for the children, combing nearby forests and remote routes believed to have been used by the gunmen.Authorities in Niger state said St Mary's School had disregarded an order to close all boarding facilities following intelligence warnings of a heightened risk of attacks. The school has not commented on that allegation.The kidnapping of people for ransom by criminal gangs, known locally as bandits, has become a major problem in many parts of Nigeria.The payment of ransoms has been outlawed in an attempt to cut the supply of money to the criminal gangs, but it has had little effect.On Monday, more than 20 schoolgirls, who the BBC has been told are Muslim, were kidnapped from a boarding school in Kebbi state.Authorities there have now ordered all secondary schools and colleges to close.Nigerian President Bola Tinubu postponed foreign trips - including to this weekend's G20 summit in South Africa - in order to address the security concerns.This week's attacks follows claims by right-wing figures in the US, including President Donald Trump, that Christians are being persecuted in Nigeria.For months, campaigners and politicians in Washington have been alleging that Islamist militants are systematically targeting Christians. The Nigerian government has dismissed this claim.Earlier this month, Trump said he would send troops into Nigeria \"guns a-blazing\" if the African nation's government \"continues to allow the killing of Christians\".The Nigerian government has called claims that Christians are being persecuted \"a gross misrepresentation of reality\".An official said that \"terrorists attack all who reject their murderous ideology - Muslims, Christians and those of no faith alike\".In the north-east, jihadist groups have been battling the state for more than a decade.Organisations monitoring violence say most of the victims of these groups are Muslim because most attacks happen in the majority-Muslim north of the country.In the centre of Nigeria, there are also frequently deadly attacks between herders - who are mostly Muslim - on farmers, who are largely Christian.However, analysts say these are often motivated by competition for resources, such as water or land, rather than religion.The militant Islamist group Boko Haram took 276 girls from their school in the town of Chibok in 2014.The incident drew international attention and sparked a global campaign seeking their return, which included an intervention from then-US First Lady Michelle Obama.Many have since either escaped or been freed, but as many as 100 remain missing.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fifty children escape after mass school abduction in Nigeria",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/86ec/live/f9992680-c883-11f0-bd12-71741f879d80.jpg"
      ],
      "datePublished": "2025-11-23T17:53:05.000Z",
      "dateModified": "2025-11-23T17:53:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'We worry more about food' say Venezuelans living under threat of US military action",
    "url": "https://www.bbc.com/news/articles/c3e0jnww2e9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/723a/live/572f0fe0-c6f3-11f0-a863-434ee92aa5e3.jpg",
    "tag": "World",
    "date": "2025-11-23T00:02:59.000Z",
    "description": "1 day agoNicole Kolsterin CaracasBBCLike Alejandro Orellano, many Venezuelans say they are more worried about their personal finances than about a US ",
    "body": "1 day agoNicole Kolsterin CaracasBBCLike Alejandro Orellano, many Venezuelans say they are more worried about their personal finances than about a US invasionWhile Nicolás Maduro's government lives on edge under a military threat from US President Donald Trump, ordinary Venezuelans spend their time trying to figure out what to eat each day.It's Wednesday morning at Quinta Crespo, a popular market in downtown Caracas. Here, a possible escalation of the conflict is not the main concern of Venezuelans, who glance at the news while checking their wallets to find enough cash to pay.\"There's not going to be an intervention, nothing like that. What's really troubling us is the rise of the dollar,\" Alejandro Orellano tells BBC Mundo as he savours a coffee, waiting for customers who never seem to arrive.In the past weeks, Trump's government has deployed thousands of troops and military assets to within striking distance of Venezuela, including the world's largest warship. On Saturday, at least four international airlines cancelled flights into or out of the country after a Friday notice from US aviation authorities warned of \"heightened military activity in or around Venezuela\".This comes after a series of US airstrikes against alleged drug boats in the Caribbean and eastern Pacific killed more than 80 people.It's part of a broader effort the administration says is necessary to stem the flow of narcotics into the US, but Maduro insists the sabre-rattling is designed to push him out of office.In the streets of Caracas, daily life continues while the government tells the population that they must be ready for a US invasionAlejandro downplays the rhetoric between Washington and Caracas.He's been selling vegetables in this market for five years. \"Look, look how empty this is,\" he insists, pointing to a long, lonely aisle full of fresh fruits and vegetables.A Christmas carol plays, but the festive atmosphere feels overshadowed.The common enemy of the people is here: the sharp rise in food prices and the lack of purchasing power. In part, this is due to the rapid depreciation of the bolívar, which will have lost 80% of its value this year, according to International Monetary Fund (IMF) figures.A kilo of chicken, for example, costs about four times the official monthly minimum wage. And although the government offers bonuses to retirees and public workers, the money is still not enough to cover the basic food basket.Consuelo, 74, is sceptical about an armed conflict with the US and says Venezuelans cannot afford to stock food in preparation for a war.\"Let whatever happens happen! And that's it!\" she tells the BBC, adding that worrying about the spectre of war doesn't help much.\"Is it true? Is it false? That just makes you sick, walking around nervous, it's better to stay calm. Emotions can also affect your health,\" continues this retired university professor who still works.\"I haven't done any panic buying; you need a lot of money to do that.\"Two economists living in Venezuela consulted by the BBC for this report preferred not to comment for fear of government reprisals.\"Inflation has reached levels of around 20% monthly,\" another expert who requested anonymity pointed out.The IMF projects a 548% price increase this year and says it will be worse in 2026, when it could soar to 629% - the highest figure on the continent.Others see a potential US intervention as an opportunity for regime change but are afraid to speak openly about it.\"We're scared, silent, afraid they'll throw us in jail. I used to post things, but not anymore - I shouldn't - because I don't know who might turn me in,\" a merchant from Ciudad Bolívar (in Bolívar state, south) tells the BBC by phone.\"There's hope, faith, but people are quiet out of fear. You don't hear anyone talking about it; it's just at home, with your family, but there's a hint of joy,\" says the woman anonymously.Consuelo says that uncertainty also makes Venezuelans nervousMuch of society avoids speaking openly about issues that could be sensitive for Maduro's government, after a wave of arrests followed anti-government protests over the disputed 2024 presidential elections, which have been widely rejected by the international community. The opposition and many countries, including the US, rejected the result and recognised opposition candidate Edmundo González as the legitimate president-elect.After the elections, more than 2,000 people were arrested, official figures show. At present, 884 individuals remain in prison for political reasons, according to the non-governmental organisation Foro Penal.Barbara Marrero, a 40-year-old pastry chef, says: \"We're all waiting for something to happen because it's fair and necessary. We've been living in absolute misery for years.\"Venezuelans live day by day waiting for something to happen, but everyone is afraid [to speak] and nobody says anything.\"Esther Guevara, 53, who works in a medical lab, doesn't hide her concern amid tensions over the US naval fleet deployment.\"I'm worried because I don't really know what's happening - they might invade, strike… people think it will be ok, but this is serious,\" she says. \"A lot of innocent people could die.\"\"I feel like something's cooking out there, but I'm waiting,\" she adds.Javier Jaramillo also does not believe that an attack on Venezuela is imminentIt's now midday.Everything goes on as usual along a busy boulevard in eastern Caracas. Street vendors pushing sales. Pedestrians coming and going.There's Javier Jaramillo, 57, looking for goods to resell at Christmas. He's curious about the USS Gerald R Ford, the aircraft carrier Washington moved to the Caribbean.\"I don't think that attack will happen. I think there could be dialogue, an agreement, or a deal.\"Still, he says that when there are power cuts, he thinks: \"'They've come in,' 'They're going to come in.'\"Trump has suggested he is open to a diplomatic dialogue with Maduro, but also said he would not rule out military action.Either way, Javier repeats: \"We're more worried about food. Venezuela is in bad shape. Inflation is eating us alive.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'We worry more about food' say Venezuelans living under threat of US military action",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/723a/live/572f0fe0-c6f3-11f0-a863-434ee92aa5e3.jpg"
      ],
      "datePublished": "2025-11-23T00:02:59.000Z",
      "dateModified": "2025-11-23T00:02:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]