[
  {
    "title": "COP30 evacuated after fire breaks out",
    "url": "https://www.bbc.com/news/articles/ce9d9p5jrjgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f9a2/live/a8b3dd70-c63d-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-20T19:13:21.000Z",
    "description": "1 hour agoGeorgina Rannard and BBC climate team in Belém, BrazilThe UN climate talks COP30 have been evacuated due to a fire breaking out inside the v",
    "body": "1 hour agoGeorgina Rannard and BBC climate team in Belém, BrazilThe UN climate talks COP30 have been evacuated due to a fire breaking out inside the venue in Belém, Brazil.BBC journalists saw flames and smoke in the pavilion area before they were rushed outside where fire engines raced past.The UN has said the fire is now contained \"with limited damage\". It is not yet known what caused the blaze. The talks were in the final hours of trying to agree on next steps to tackle climate but the fire has disrupted negotiations.\"It was climbing the walls and onto the ceiling. People were screaming,\" Dr Harshita Umesh, who was giving a talk next to the place where they fire broke out, told BBC News.\"Then I ran, I think I tripped and fell.\"Dr Umesh, who is a medical doctor, said that ambulance staff told her no-one has burn injuries but that some first responders inhaled \"toxic fumes\" and are now using oxygen masks.Emergency medicine specialist Kimberly Humphrey, currently helping patients at the COP medical centre, told the BBC that the injuries are \"Mainly people with smoke inhalation, someone with a lung injury from smoke.\"\"People are pretty traumatised and shocked,\" she added.\"There's a huge panic, people have been running out of here, it's a very dramatic moment... UN security guards are telling us to leave,\" said BBC Climate Editor Justin Rowlatt.\"It looks actually as if they are beginning to get it under control but you can see huge columns of smoke rising up into the air through the hole that's been burnt in the top of the conference centre.\"BBC journalists saw two ambulances driving towards the entrance more than 90 minutes after the fire started.A Brazilian security officer putting a chain through the gates of the venue with a chain told the BBC they are evacuating the premises and locking it.After the fire broke out, orange flames burned a hole through the sheeting that covers the venue, which is in a former aerodrome. One video shows a man spraying a fire extinguisher at the fire before running away.One eyewitness told the BBC that he believes an electrical fire was the cause.A woman was taken away in a wheelchair, but it is not clear if that was connected to the fire.Hundreds of people are now sitting on the floor or on plastic chairs outside in high temperatures and humidity. Others have left the COP entirely to return to accommodation. The fire is likely to delay the closing of a deal in the talks.A number of country delegations were forced to take shelter outside under the roof of a petrol station, a member of the UK delegation told the BBC. He said the fire has halted negotiations.The UN, which runs COP climate meetings, said the fire brigade is checking the venue to assess safety and that the summit has been temporarily taken over by Brazilian authorities.Thousands of people are attending the UN climate talks, including members of delegations from around the world.Nearly 200 countries are trying to agree on how to make progress in tackling climate change. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "COP30 evacuated after fire breaks out",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f9a2/live/a8b3dd70-c63d-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-20T19:13:21.000Z",
      "dateModified": "2025-11-20T19:13:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South Korea: Arrests made after ferry runs aground",
    "url": "https://www.bbc.com/news/articles/cx2p2l4j8vjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f93f/live/26aa2350-c5cc-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-20T07:57:43.000Z",
    "description": "Korean coast guard arrests helmsman who was on his phone when ferry ran aground12 hours agoGeorge Wright and Leehyun Choi'I thought I might die': Pass",
    "body": "Korean coast guard arrests helmsman who was on his phone when ferry ran aground12 hours agoGeorge Wright and Leehyun Choi'I thought I might die': Passenger on South Korea ferry that ran aground speaks outTwo people have been arrested and a boat captain is under investigation after a ferry ran aground on rocks off South Korea's south-west coast. All 267 passengers and crew on board the Queen Jenuvia 2 were rescued after it became stuck near the uninhabited island of Jogdo, off the coast of Jangsan Island in Shinan County, on Wednesday. Twenty-seven people sustained minor injuries from the impact of grounding.The coast guard told the BBC they had arrested the helmsman and the first mate for gross negligence resulting in injuries.The helmsman initially blamed a steering wheel malfunction, but later admitted he had been on his phone and missed the point at which he was supposed to change course.The vessel has now docked at a nearby port.Authorities say they are still investigating the exact cause of the accident.Some passengers described it in real time on social media. \"There was a loud bang, and then the ship tilted,\" one was quoted as saying by South Korea's Yonhap news agency. \"An announcement told everyone to put on life jackets, so we're wearing them and waiting on the top deck.\"The 26,000-tonne ferry was travelling to the port city of Mokpo after departing from the resort island of Jeju, officials said.The area is near the site where the Sewol ferry sunk in 2014. More than 300 people were killed in that incident, mostly children heading for a school trip.The salvaged wreck of the Sewol ferry was brought to Mokpo nearly three years later.Describing Wednesday's incident, Kim Namhyun, a diving instructor on Jeju Island, told Reuters: \"I thought I might die. The sound was too loud.\"But having seen the Sewol ferry, I knew that in situations like this, you have to stay calm, move outside, wear a life jacket, and wait.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South Korea: Arrests made after ferry runs aground",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f93f/live/26aa2350-c5cc-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-20T07:57:43.000Z",
      "dateModified": "2025-11-20T07:57:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "COP30 fire: BBC at the scene of 'intense' blaze",
    "url": "https://www.bbc.com/news/videos/cn5159k1krzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f1e6/live/d697fe90-c63f-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-20T18:58:26.000Z",
    "description": "The UN climate talks COP30 have been evacuated due to a fire breaking out inside the venue in Belém, Brazil.BBC journalists including Climate Editor J",
    "body": "The UN climate talks COP30 have been evacuated due to a fire breaking out inside the venue in Belém, Brazil.BBC journalists including Climate Editor Justin Rowlatt saw flames and smoke in the pavilion area before they were rushed outside.The Brazilian government says that the fire is now under control and that no-one has been injured.More on this story.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "COP30 fire: BBC at the scene of 'intense' blaze",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f1e6/live/d697fe90-c63f-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-20T18:58:26.000Z",
      "dateModified": "2025-11-20T18:58:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Police arrest alleged mastermind of Mexican mayor's murder",
    "url": "https://www.bbc.com/news/articles/c70901djjw8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a071/live/25b863f0-c606-11f0-aaa8-8bac9838c2fd.jpg",
    "tag": "World",
    "date": "2025-11-20T13:20:19.000Z",
    "description": "Police in Mexico have arrested a man they accuse of being the mastermind behind the murder of a popular mayor. Carlos Manzo, the mayor of Uruapan, was",
    "body": "Police in Mexico have arrested a man they accuse of being the mastermind behind the murder of a popular mayor. Carlos Manzo, the mayor of Uruapan, was shot dead on 1 November at a public event marking the Day of the Dead.Manzo was an outspoken critic of cartel violence in his home state of Michoacán and his assassination triggered mass protests.Mexico's security minister said the man suspected of ordering his murder had links to the powerful Jalisco New Generation Cartel (CJNG).\"This arrest represents a key step in dismantling the criminal structure responsible for this attack,\" Security Minister Omar García Harfuch said.He did not say what the possible motive of the attack may have been, but local officials in Mexico are often targeted by criminal gangs for failing to do their bidding.García Harfuch said the suspect, whom he named as Jorge Amando, withholding his surname, had been the one who had ordered the deadly attack on Carlos Manzo. He said that Jorge Amando, who is also known as The Graduate, had communicated with those who carried out the killing via WhatsApp. According to the official, The Graduate pressured his men to open fire on Manzo even if he was surrounded by people.The 40-year-old mayor was attending a Day of the Dead ceremony - which honours deceased family and friends - alongside his relatives when he was shot seven times, sending bystanders running for cover. Manzo had spoken out publicly about how avocado growers in the region were being extorted and threatened by criminal groups.He had also demanded that Mexico's federal government, led by President Claudia Sheinbaum, do more to rein in cartels who hold sway in much of the state. The Jalisco New Generation Cartel, which Mexico's security minister blamed for the attack on Manzo, engages in drug trafficking as well as kidnapping for ransom and extortion.It is also infamous for targeting public officials who refuse to do its bidding.While the CJNG is thought to be the most powerful of the criminal gangs operating in Michoacán, there are many others and their fights for control of drug, arms and fuel smuggling routes often result in deadly confrontations.The assassination of Manzo triggered mass protests.At one large rally in Mexico City last weekend, many of the protesters carried placards with the photo of the mayor, while other held up banners reading \"we are all Carlos Manzo\".Some of the protesters clashed with police in Mexico's central Zócalo square. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Police arrest alleged mastermind of Mexican mayor's murder",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a071/live/25b863f0-c606-11f0-aaa8-8bac9838c2fd.jpg"
      ],
      "datePublished": "2025-11-20T13:20:19.000Z",
      "dateModified": "2025-11-20T13:20:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Spain's attorney general convicted in controversial leak case",
    "url": "https://www.bbc.com/news/articles/cly4ypj92j9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6975/live/96461d80-c631-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-20T17:27:58.000Z",
    "description": "Spain's Attorney General, Álvaro García Ortiz, has been forced to step down after being found guilty of revealing confidential information in a deeply",
    "body": "Spain's Attorney General, Álvaro García Ortiz, has been forced to step down after being found guilty of revealing confidential information in a deeply controversial case, which accentuated the country's political division.The Supreme Court found that García Ortiz had unlawfully revealed details of the tax status of businessman Alberto González Amador, boyfriend of a senior conservative politician. The court handed him a two-year ban from the post and a fine of €7,200 (£6,438). He must also pay €10,000 to Mr González Amador as compensation.The trial of García Ortiz fuelled already acrimonious relations between the left-wing government of Prime Minister Pedro Sánchez and right-wing opposition.Their contrasting positions were underlined by reactions to the conviction.\"Sánchez must apologise to Spaniards, resign and call elections, in that order,\" said Ester Muñoz, spokeswoman for the conservative People's Party.The government said it did not agree with the ruling but respected it and would proceed with the appointment of a new attorney general.However, a number of politicians on the left expressed outrage at what they saw as a politically motivated ruling.Health Minister Mónica García, of the Sumar party, said the conviction dealt a \"lethal blow to [the concept of] presumption of innocence\" and threw ordinary Spaniards \"under the bus\" when it came to the rule of law.The complex case dates back to March 2024, when the attorney general's office issued a press release stating that Mr González Amador had requested a plea bargain after being found to have evaded tax payments worth €350,951. The document corrected mistaken press reports stating that the attorney general's office had proposed the bargain.The source of the incorrect reports was the head of communications of the conservative regional president of Madrid, Isabel Díaz Ayuso. Ms Díaz Ayuso is the partner of Mr González Amador.Mr González Amador filed a complaint against the attorney general, claiming his privacy had been breached. The case against García Ortiz also saw him accused of leaking information about the affair to the media. Prosecutors pointed to the attorney general's decision to change his phone as incriminating.However, there was no direct evidence linking García Ortiz to the leak and several journalists testified during the trial that he had not been the source of their information. Regarding the press statement, the attorney general said he was simply correcting the erroneous reports.García Ortiz can appeal against the ruling.This comes as a severe blow for the prime minister, who has been under judicial pressure on various fronts. His brother is due to go on trial for influence peddling, his wife is under investigation for her business activities and two former senior figures in the Socialist Party, José Luis Ábalos and Santos Cerdán, are accused of overseeing a massive kickback scheme.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Spain's attorney general convicted in controversial leak case",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6975/live/96461d80-c631-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-20T17:27:58.000Z",
      "dateModified": "2025-11-20T17:27:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Woman jailed for 20 years over murder of Australian surfer brothers in Mexico",
    "url": "https://www.bbc.com/news/articles/c8jrjr4wrr2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e22e/live/e2e67670-c5f1-11f0-9f1e-75cdd6519717.png",
    "tag": "World",
    "date": "2025-11-20T10:12:36.000Z",
    "description": "A woman has been sentenced to 20 years in prison for her role in the murders of three tourists during a carjacking in Mexico last year.Ari Gisell, 23,",
    "body": "A woman has been sentenced to 20 years in prison for her role in the murders of three tourists during a carjacking in Mexico last year.Ari Gisell, 23, pleaded guilty to instigating the violent assault on Australian brothers Jake and Callum Robinson and their American friend Carter Rhoad, who were on a surfing trip in the northern Mexican state of Baja California in April 2024 when they disappeared.Their bodies were later found with gunshot wounds to the head at the bottom of a deep well.Ari Gisell had expressed interest in the tyres on the surfers' car and told her then-boyfriend Jesús Gerardo to \"bring me a good phone and good tyres for my pickup truck\", the court heard.Only the first and middle names of the defendants were revealed. Surnames were not, in line with Mexican court reporting rules.Jesús Gerardo and two others, Irineo Francisco and Ángel Jesús, tailed the vehicle to the campsite where the foreigners were staying, then robbed them before shooting them dead. The cases against these three men are still before the courts.According to Mexican newspaper La Silla Rota, Jesús Gerardo and Irineo Francisco have ties with the powerful drug cartel Sinaloa, which was for many years led by the notorious drug lord Joaquín \"El Chapo\" Guzmán.Because of these links, both men are being held in El Hongo, a maximum-security prison in Baja California. Ángel Jesús has been detained in a separate facility in the city of Ensenada.Prosecutors do not suspect any connections between the murders and organised crime, however, according to the Australian Broadcasting Corporation (ABC).The victims' families, who appeared via video conference, made emotional statements at the hearing on Wednesday.\"We dreamed of seeing them grow older, of having children. That's all taken now,\" said Callum and Jake's mother Debra Robinson, as reported by ABC. \"We live with their absence.\"Callum Robinson, 33, was a member of Australia's national lacrosse team and was living in San Diego, just across the US-Mexico border from Baja California.His younger brother Jake, 30, lived in Australia and had travelled to North America to visit Callum. He was due to start a new job as a doctor when he returned.Their friend Rhoad, 30, was a San Diego resident and worked in a technology services company. Rhoad was months away from marrying his fiancee when he was killed.\"He was my safety in the world,\" his fiancee Natalie Wiertz told the court. \"My life is now a nightmare.\"Ari Gisell gave a tearful apology in court, acknowledging that \"nothing I can say will compensate you or give you peace\".\"I am focused on being a better person, and I am very sorry for your losses,\" said the single mother, as quoted by La Silla Rota.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Woman jailed for 20 years over murder of Australian surfer brothers in Mexico",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e22e/live/e2e67670-c5f1-11f0-9f1e-75cdd6519717.png"
      ],
      "datePublished": "2025-11-20T10:12:36.000Z",
      "dateModified": "2025-11-20T10:12:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "More than 250 arrested in Charlotte as immigration crackdown escalates",
    "url": "https://www.bbc.com/news/articles/ckgzge16vkdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/05c3/live/74684910-c620-11f0-a9b6-afaae37ee06b.jpg",
    "tag": "World",
    "date": "2025-11-20T15:20:12.000Z",
    "description": "More than 250 people have been arrested in Charlotte, North Carolina, as part of President Donald Trump's escalating crackdown on undocumented immigra",
    "body": "More than 250 people have been arrested in Charlotte, North Carolina, as part of President Donald Trump's escalating crackdown on undocumented immigration, US officials say. Charlotte is the latest US city that Trump has targeted with federal troops, following similar measures in bigger cities like Chicago and Los Angeles earlier this year. Officials with the Department of Homeland Security (DHS) told the BBC that those arrested are criminals and gang members.But local lawmakers and residents have railed against the detainments, which the federal government has dubbed \"Operation Charlotte's Web\". The state's Democratic governor has alleged people are being targeted because of their race. In a statement released on Wednesday, a DHS spokesperson said the operation has led to the arrest of \"some of the most dangerous criminal illegal aliens\", including gang members. Others arrested had been convicted of a range of crimes, including assault on law enforcement, driving while intoxicated, theft and tampering with government documents, the department said earlier.North Carolina's Democratic Governor Josh Stein, who has denounced Trump's operations, accused agents of racially profiling residents. \"We've seen masked, heavily armed agents in paramilitary garb driving unmarked cars, targeting American citizens based on their skin colour, racially profiling and picking up random people in parking lots,\" Stein said on Sunday. \"This is not making us safer.\"The city's mayor, also a Democrat, urged federal agents to operate with \"respect\" for the city's values. She also commended those who came out in droves on Saturday to protest the Trump administration's actions in the city. \"I am deeply concerned with many of the videos I've seen,\" Mayor Vi Lyles said. \"To everyone in Charlotte who is feeling anxious or fearful: you are not alone. Your city stands with you.\" DHS has not said how long the raids will last. Chicago's crackdown started in September and is still ongoing. Like other cities subject to immigration crackdowns, some migrants in Charlotte are staying home for fear of federal agents in the city, according to local media reports.Stein says he's monitoring reports that the operation will come to Raleigh, another North Carolina city, next. \"Once again, I call on federal agents to target violent criminals, not neighbors walking down the street, going to church, or putting up Christmas decorations,\" he wrote.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "More than 250 arrested in Charlotte as immigration crackdown escalates",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/05c3/live/74684910-c620-11f0-a9b6-afaae37ee06b.jpg"
      ],
      "datePublished": "2025-11-20T15:20:12.000Z",
      "dateModified": "2025-11-20T15:20:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zelensky to speak to Trump after US proposes Russia-Ukraine peace plan",
    "url": "https://www.bbc.com/news/articles/cly1ypqlle0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3a25/live/7d2b1c00-c63c-11f0-8c98-11fe43704bb5.jpg",
    "tag": "World",
    "date": "2025-11-20T19:47:32.000Z",
    "description": "Volodymyr Zelensky will speak to Donald Trump after the US presented Ukraine with a draft peace plan to end the war with Russia.The plan was reportedl",
    "body": "Volodymyr Zelensky will speak to Donald Trump after the US presented Ukraine with a draft peace plan to end the war with Russia.The plan was reportedly drafted by US special envoy Steve Witkoff and his Russian counterpart Kirill Dmitriev, without Ukraine's involvement. In a statement, Zelensky's office said the US believed the draft plan could \"help reinvigorate diplomacy\" and added that Ukraine had \"agreed to work on the plan's provisions in a way that would bring about a just end to the war\".Kyiv supported \"all substantive proposals capable of bringing genuine peace closer,\" the statement said. The Ukrainians did not share any details of what the proposal entails, although according to sources quoted by Axios, the Financial Times and Reuters, it includes plans for Kyiv to give up areas of the Donbas in eastern Ukraine that it still controls, to cut significantly the size of its army, and to forego many of its weapons. If confirmed, these demands would be heavily slanted towards Moscow's interest - explaining Kyiv's lukewarm reaction to the draft.But in a press briefing for reporters at the White House, press secretary Karoline Leavitt rejected suggestions the plan demands major concessions from Ukraine.She said Witkoff and Secretary of State Marco Rubio had been \"engaging both sides equally to understand what these countries would commit to\".\"It's a good plan for both Russia and Ukraine,\" she said, without providing further details. \"We believe that it should be acceptable to both sides. And we're working very hard to get it done.\"Moscow downplayed the significance of the plan, which is rumoured to include 28 points. Kremlin spokesman Dmitry Peskov said that while there had been \"contacts\" with the US there was \"no process that could be called 'consultations'\".The statement from Zelensky's office came after a meeting in Kyiv on Thursday between the Ukrainian president and senior US military figures, including US Army Secretary Dan Driscoll, army chief of staff Gen Randy George and top US army commander in Europe Gen Chris Donahue.Despite Kyiv's tepid reaction to the draft, Zelensky said he \"appreciated the efforts of President Trump and his team to return security to Europe\" – perhaps a way to keep the US president onside despite his administration's apparent soft approach to Russia.Neither Ukraine nor its European partners were involved in drafting the new plan, and on Thursday European foreign ministers warned against coming up with proposals without consulting Kyiv or Brussels.\"For any plan to work, it needs Ukrainians and Europeans on board,\" said EU foreign policy chief Kaja Kallas. Peskov, the Kremlin's spokesman, warned that any peace deal would have to address the \"root causes of the conflict\" - a phrase Moscow has used as shorthand for a series of maximalist demands which, to Ukraine, are tantamount to surrender. Ukrainian MP Lisa Yasko told the BBC that Ukraine had \"not been consulted\".\"It looks like someone wants to decide things for us,\" she said. \"And that's very painful for most of us Ukrainians.\"Since starting his second term earlier this year, Trump has launched into various initiatives aimed at ending the war in Ukraine, including a bilateral summit with Putin in Alaska, several visits by his envoy Witkoff to Moscow, and rounds of talks with Zelensky and other Western leaders. But as the fourth anniversary of Russia's full-scale invasion of Ukraine nears, the two sides remain deeply at odds over how to end the conflict. While Ukraine has become adept at targeting Russian military infrastructure and energy facilities with long-range drones, Moscow's attacks on Ukrainian targets continue unabated. Earlier this week, at least 26 people were in a Russian missile and drone attack on blocks of flats in Ukraine's western city of Ternopil. More than people were still missing at the site on Thursday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zelensky to speak to Trump after US proposes Russia-Ukraine peace plan",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3a25/live/7d2b1c00-c63c-11f0-8c98-11fe43704bb5.jpg"
      ],
      "datePublished": "2025-11-20T19:47:32.000Z",
      "dateModified": "2025-11-20T19:47:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gustav Klimt painting becomes second most expensive artwork sold at auction",
    "url": "https://www.bbc.com/news/articles/cm2emm4737zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2512/live/c3b79e00-c533-11f0-9839-6584ec7afe70.jpg",
    "tag": "World",
    "date": "2025-11-19T09:55:50.000Z",
    "description": "A portrait by the Austrian artist Gustav Klimt was sold for $236.4m (£179m) in New York on Tuesday, making it the second-most expensive piece ever sol",
    "body": "A portrait by the Austrian artist Gustav Klimt was sold for $236.4m (£179m) in New York on Tuesday, making it the second-most expensive piece ever sold at auction. Six people took part in a 20-minute bidding battle for the Portrait of Elisabeth Lederer which was painted between 1914 and 1916. Auction house Sotheby's has not disclosed the buyer's identity.The portrait was looted by the Nazis and almost destroyed in a fire in World War Two, but was rescued in 1948. The artwork was returned to Lederer's brother, Erich, a friend and subject of Klimt's contemporary, Egon Schiele. The piece remained in Lederer's possession for most of his life, before he sold it in 1983, according to Sotheby's. The painting shows Lederer, an heiress and the daughter of one of Klimt's patrons, wearing a white robe and standing in front of a blue tapestry covered in Asian motifs. The Nazis, who annexed Austria in 1938, looted the Lederer art collection but left family portraits behind, says the National Gallery of Canada. Estée Lauder heir Leonard A Lauder made it part of his private collection in 1985, where it was displayed in his Fifth Avenue home in New York. Tuesday's sale shot past expectations, with the painting predicted to sell for  $150m before the auction. The second-highest sale for a Klimt on record was Lady with a Fan, which sold for $108.8m in 2023 in London. Several other Klimt works in Lauder's collection were auctioned at the same event, including Flowering Meadow and Forest Slope at Unterach am Attersee, which fetched between $60m and $80m each. The most expensive artwork ever sold at auction was Salvator Mundi, attributed to  Leonardo da Vinci, which sold in 2017 for $450.3m.Tuesday also saw a sculpture of a fully functioning gold toilet by the conceptual artist Maurizio Cattelan picking up $12.1m just an hour after the record-breaking Klimt sale.The 101-kg toilet received just one bid. Sotheby's said that the buyer was a famous American brand.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gustav Klimt painting becomes second most expensive artwork sold at auction",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2512/live/c3b79e00-c533-11f0-9839-6584ec7afe70.jpg"
      ],
      "datePublished": "2025-11-19T09:55:50.000Z",
      "dateModified": "2025-11-19T09:55:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Paris court blocks auction of earliest-known calculator",
    "url": "https://www.bbc.com/news/articles/c2kpkq90ygno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2c8d/live/6377d6f0-c5eb-11f0-9f1e-75cdd6519717.jpg",
    "tag": "World",
    "date": "2025-11-20T02:03:14.000Z",
    "description": "One of the world's first calculating machines will not go to auction as scheduled in France, after a Paris court provisionally blocked the historic it",
    "body": "One of the world's first calculating machines will not go to auction as scheduled in France, after a Paris court provisionally blocked the historic item from being exported.Auction house Christie's has confirmed it will not proceed with bidding for the machine La Pascaline, developed by the French mathematician Blaise Pascal in 1642.Valuations suggested the machine could fetch €2m to 3m (£1.7m to £2.6m), and Christie's called it the \"most important scientific instrument ever offered at auction\".Scientists and researchers made a legal appeal to grant heritage protections to the historic instrument, arguing it should be classified as a \"national treasure\".Pascal was just 19 years old when he developed the earliest version of a calculator, Christie's said. There are only nine of these machines still in existence.\"It is the first attempt in history to substitute the human mind with a machine,\" the official collection description reads.\"Its invention marks a breakthrough, a 'quantum leap' whose importance and significance take on a very special meaning today.\"La Pascaline was exhibited at Christie's venues in New York and Hong Kong throughout the year. The machine was included in Christie's auction of the library of the late Catalonia collector Léon Parcé, which also featured Pascal's philosophical piece Pensées and the first printed version of \"Pascal's wager\".On Wednesday, a Paris administrative court temporarily blocked an earlier export authorisation provided by France's culture minister in May. Two experts had signed off on the minister's certificate, including one from the Louvre Museum.The judge concluded there were \"serious doubts\" over the legality of the certificate, a statement from the Paris court said, adding the decision was provisional until a final judgment is delivered.In a statement to the AFP news agency, a Christie's spokesperson said: \"Given the provisional nature of this decision and in accordance with the instructions of its client, Christie's is suspending the sale of La Pascaline.\" The court noted La Pascaline's historic and scientific value could qualify it as a \"national treasure\", guaranteeing protections under the France's heritage code.The French heritage group Association Sites & Monuments, which was listed as an applicant in the court filing, welcomed the decision.Additional reporting by Sebastian Usher, Global Affairs reporter",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Paris court blocks auction of earliest-known calculator",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2c8d/live/6377d6f0-c5eb-11f0-9f1e-75cdd6519717.jpg"
      ],
      "datePublished": "2025-11-20T02:03:14.000Z",
      "dateModified": "2025-11-20T02:03:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dick Cheney: Bush lauds ex-vice-president as 'thinker and listener' at funeral",
    "url": "https://www.bbc.com/news/articles/c93x3er4l9zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b468/live/1788f5e0-c63a-11f0-8c98-11fe43704bb5.jpg",
    "tag": "World",
    "date": "2025-11-20T19:19:47.000Z",
    "description": "56 minutes agoReutersDemocrats and Republicans have come together to mourn former US Vice-President Dick Cheney at his funeral in Washington DC. Chene",
    "body": "56 minutes agoReutersDemocrats and Republicans have come together to mourn former US Vice-President Dick Cheney at his funeral in Washington DC. Cheney, who served under President George W Bush from 2001-09, died from complications of pneumonia and cardiac and vascular disease in early November. He was 84.  Bush, a Republican, said in his eulogy: \"In a profession that attracts talkers, he was a thinker and a listener.\" Former President Joe Biden, a Democrat, also attended.Cheney was one of the most powerful vice-presidents in history, a key architect of Bush's \"war on terror\" after the 9/11 terrorist attacks, and an early advocate of the invasion of Iraq.Watch: George W Bush honours former Vice President Dick CheneyGetty ImagesGeorge W Bush speaks at Cheney's funeralIn recent years, Cheney found himself out of favour in the Republican Party after he condemned President Donald Trump's refusal to accept the result of the 2020 election. Trump was also at loggerheads with Cheney's daughter, former Wyoming congresswoman Liz Cheney.His daughter also paid tribute to him on Thursday, speaking about her father's legacy. \"He knew the bonds of party must always yield to the single bond we share as Americans,\" she said. \"For him, a choice between defence of the Constitution and defence of your political party was no choice at all.\"Getty ImagesIn last year's White House election, both Cheneys endorsed the Democratic nominee, Kamala Harris.  Harris was at the funeral, along with other former US Vice-Presidents Mike Pence and Al Gore.Trump and Vice-President JD Vance did not attend. Neither did former Presidents Barack Obama and Bill Clinton, both Democrats.Getty Images",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dick Cheney: Bush lauds ex-vice-president as 'thinker and listener' at funeral",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b468/live/1788f5e0-c63a-11f0-8c98-11fe43704bb5.jpg"
      ],
      "datePublished": "2025-11-20T19:19:47.000Z",
      "dateModified": "2025-11-20T19:19:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Albanian PM accuses Mahmood of 'ethnic stereotyping'",
    "url": "https://www.bbc.com/news/articles/cge5e1xpgzyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bf7d/live/84b04210-c598-11f0-a807-c90a622aa179.jpg",
    "tag": "World",
    "date": "2025-11-19T23:14:25.000Z",
    "description": "21 hours agoSam FrancisPolitical reporterEPAAlbania's prime minister accused Home Secretary Shabana Mahmood of \"ethnic stereotyping\" after she singled",
    "body": "21 hours agoSam FrancisPolitical reporterEPAAlbania's prime minister accused Home Secretary Shabana Mahmood of \"ethnic stereotyping\" after she singled out Albanian families in a speech about abuses of the asylum system.Edi Rama criticised Mahmood for telling MPs around 700 Albanian families were \"living in taxpayer-funded accommodation having failed their asylum claims\" as she announced major reforms on Monday.Rama called the number a \"statistical drop in the ocean of post-Brexit Britain's challenges\".Official data show the UK has deported more than 13,000 people to Albania since a returns deal was signed in 2022. Rama called the deal one of \"Europe's most successful partnerships on illegal migration.\"Mahmood's comments came as she announced major changes to the UK's \"out of control and unfair\" asylum system.Speaking in the House of Commons, Mahmood said: \"If we fail to deal with this crisis, we will draw more people down a path that starts with anger and ends in hatred.\"The reforms will make refugee status temporary, extend the wait for permanent settlement from five years to 20, and allow the removal of families with children who have no right to remain. Alongside tightening access to refugee status, the UK would create new legal routes to the UK, with an annual cap on numbers.As part of her speech, Mahmood told MPs \"we must remove those who have failed asylum claims, regardless of who they are\".\"There are, for instance, around 700 Albanian families living in taxpayer-funded accommodation having failed their asylum claims - despite an existing returns agreement, and Albania being a signatory to the European convention on human rights,\" she added.Posting on social media, Rama said: \"How can a Labour Home Secretary so poorly echo the rhetoric of the populist far-right – and single out 700 Albanian families, a statistical drop in the ocean of post-Brexit Britain's challenges – precisely at a moment when the UK and Albania have built one of Europe's most successful partnerships on illegal migration?\"\"Let us also be clear: Albanians are net contributors to the British economy, and the number of Albanians receiving UK benefits is very low relative to other communities. \"To single them out again and again is not policy - it is a troubling and indecent exercise in demagoguery.\"Official policy should never be driven by ethnic stereotyping. That is the very least humanity expects from the great Great Britain.\"Rama has repeatedly clashed with British politicians over their descriptions of Albanian nationals. In May, Sir Keir Starmer travelled to the Albanian capital Tirana only to be told by Rama he would not host UK \"return hubs\" for failed asylum seekers from other countries.During the same press conference, Rama accused the previous Conservative government of \"stigmatising\" Albanians and warning that \"cursing the Albanians was not a good idea, because the curse went back and they are now out of the parliament\".A combative figure on social media, Rama has also previously invited Reform UK leader Nigel Farage to come to Albania to debate his claim one in 50 Albanians in Britain were in prison. Rama dismissed the figure as \"bonkers\" and accused Farage of peddling \"post-truth Brexit playbook\" politics. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Albanian PM accuses Mahmood of 'ethnic stereotyping'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bf7d/live/84b04210-c598-11f0-a807-c90a622aa179.jpg"
      ],
      "datePublished": "2025-11-19T23:14:25.000Z",
      "dateModified": "2025-11-19T23:14:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nord Stream: Italy to extradite pipeline blast suspect to Germany",
    "url": "https://www.bbc.com/news/articles/c4gwgd0rjdzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0b67/live/e280c680-c593-11f0-b336-71a88b56470b.png",
    "tag": "World",
    "date": "2025-11-19T22:42:05.000Z",
    "description": "22 hours agoSarah RainsfordSouthern and Eastern Europe correspondent, RomeDanish Defence HandoutThe Nord Stream pipeline, which runs between Russia an",
    "body": "22 hours agoSarah RainsfordSouthern and Eastern Europe correspondent, RomeDanish Defence HandoutThe Nord Stream pipeline, which runs between Russia and Germany under the Baltic Sea, was attacked in 2022 Italy's top appeals court has ruled that a Ukrainian man suspected of involvement in blowing up the Nord Stream gas pipelines between Russia and Germany should be extradited to Berlin.There, former Ukrainian military officer Serhiy Kuznetsov will face a charge of anti-constitutional sabotage. He is due to be removed from Italy under German police escort in the next few days.Prosecutors believe Mr Kuznetsov coordinated and led a group that planted explosives on the pipes deep beneath the Baltic Sea in 2022, though they have not disclosed any evidence.The case has serious implications for relations between Ukraine and Germany, which is the biggest source of military aid for Kyiv in Europe.Mr Kuznetsov's lawyer said his client \"feels like a scapegoat\" and is \"very sad\" that his government has not spoken out in his defence, or even confirmed that he was a serving soldier at the time of the blasts.\"If he carried out the attack, then he did so because he was ordered to do so because he was for sure a captain of the Ukrainian army,\" Nicola Canestrini said after Wednesday's hearing.The BBC has seen a copy of Mr Kuznetsov's military ID among the court papers. He has not commented publicly on whether he was involved in the explosions.\"The Ukrainian government knows exactly where he was every day of September 2022,\" his lawyer said. \"So, if he's innocent, why don't they say it? If he did it, why don't they say it? That's his question.\"The BBC has approached government and security sources in Kyiv, but they have not commented.Mr Kuznetsov was arrested in northern Italy in late August, at a glamping site near the city of Rimini where he had booked in for a few nights with his wife and two of their children.His passport details were entered online at check-in, and in Italy that information is automatically transferred to the carabinieri, the local police.Later that night, officers came knocking at the family's door.Serhiy Kuznetsov's lawyer Nicola Canestrini says his client feels like a \"scapegoat\"A month later, a second Ukrainian suspect was detained at his home close to Poland's capital Warsaw on another arrest warrant issued by Germany.Volodymyr Zhuravlyov, an amateur deep-sea diver, has lived in Poland with his family since just before Russia's full-scale invasion of Ukraine in 2022.He was held in custody for 17 days, but a court then refused to extradite him.The judge delivered a passionate speech, arguing that no Ukrainian could be prosecuted for what he characterised as a legitimate act of self-defence against Russia's \"bloody and genocidal\" invasion of Ukraine.In Italy, further from Ukraine, the mood and the politics are very different.Mr Canestrini described the Italian appeal court's ruling as a \"great disappointment\", but said the fight for his client would now move to Germany - with the aim of having Mr Kuznetsov acquitted on the same grounds.Many Ukrainians consider whoever did destroy Nord Stream to be heroes for taking out an important revenue source for Russia, and struggle to understand why Germany - a key ally of Ukraine - is pursuing this prosecution.On Wednesday, one man stood outside the palatial courthouse in Rome wrapped in a Ukrainian flag and holding a poster that read: \"Serhiy Kuznetsov is a defender, not a criminal.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nord Stream: Italy to extradite pipeline blast suspect to Germany",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0b67/live/e280c680-c593-11f0-b336-71a88b56470b.png"
      ],
      "datePublished": "2025-11-19T22:42:05.000Z",
      "dateModified": "2025-11-19T22:42:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dozens go on trial over deadly North Macedonia nightclub fire",
    "url": "https://www.bbc.com/news/articles/cp3x3909rqvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5774/live/04ec5cd0-c575-11f0-92f5-0fd46a9dc2cf.jpg",
    "tag": "World",
    "date": "2025-11-19T18:57:33.000Z",
    "description": "1 day agoPaul Kirby,Europe digital editor and Guy Delauney,Balkans correspondentAFPThe club's owner, nearest the camera, is among those on trialThirty",
    "body": "1 day agoPaul Kirby,Europe digital editor and Guy Delauney,Balkans correspondentAFPThe club's owner, nearest the camera, is among those on trialThirty-five people and three institutions have gone on trial in North Macedonia over a devastating fire at a nightclub that killed 63, mainly young, people in March.\"I know about the pain of loved ones, we are all parents,\" Judge Diana Gruevska-Ilievska told the crowded courtroom, filled with defendants and dozens of victims' relatives. She promised the case would be conducted in a transparent and disciplined manner.Club Pulse, in the eastern town of Kocani, was packed with young Macedonians attending a concert by a popular hip-hop duo when sparks from pyrotechnic devices set fire to the ceiling.Prosecutors told the trial that years of failings had turned the club into a death trap.Three former mayors of Kocani, the nightclub's owner and public licensing officials are among those charged. They are accused of endangering public safety by allowing an unsafe venue to operate. The judge warned the court that the trial could last for \"five months or five years\".Defence lawyers attempted to delay the start of proceedings due to the charges being merged into a single case. The judge rebuffed them, ruling this did \"not violate any rights of the parties\".At the time of the tragedy, authorities said only one proper exit was functioning at the club as the back door had been locked.Sparks from the pyrotechnics spread quickly on the club's ceiling, which had been made of flammable material.About 500 people were inside the club at the time, leaving 59 dead and some 200 others injured. Four of the injured died later. Many were unable to escape because of blocked exits.Outrage after the fire prompted protests in the Macedonian capital Skopje and elsewhere, with victims' families organising local marches in Kocani itself. AFP via Getty ImagesLast Saturday, victims' families marched through the centre of Skopje holding pictures of those who diedAnother protest entitled \"March of the Angels\" took place in Skopje days before the trial began, organised under a Macedonian social media campaign called \"Who's Next?\". Prosecutors told the trial that the Kocani disaster was not the result of one person's actions or mistakes - rather it arose out of a series of institutional failures and a lack of responsibility.None of the defendants had wanted to face up to the danger that had been there for years, according to prosecutor Borche Janev.Prosecutors allege that licences for the club were issued unlawfully, inspections were not carried out and overcrowding was allowed at the venue. Another allegation is that there was no permit for the band to set off the pyrotechnic devices that started the fire.\"If we remain silent and lose the truth... we will never have the strength as a society to embark on a path to healing,\" Janev was quoted by local media as telling the court.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dozens go on trial over deadly North Macedonia nightclub fire",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5774/live/04ec5cd0-c575-11f0-92f5-0fd46a9dc2cf.jpg"
      ],
      "datePublished": "2025-11-19T18:57:33.000Z",
      "dateModified": "2025-11-19T18:57:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israeli strikes in Gaza kill 25 Palestinians, health ministry says",
    "url": "https://www.bbc.com/news/articles/c62e27j69q9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ee12/live/26ae8300-c572-11f0-92f5-0fd46a9dc2cf.jpg",
    "tag": "World",
    "date": "2025-11-20T07:30:46.000Z",
    "description": "13 hours agoRushdi Abualouf,Gaza correspondent, in Istanbul and David GrittenAt least 25 Palestinians were killed in Israeli strikes across the Gaza S",
    "body": "13 hours agoRushdi Abualouf,Gaza correspondent, in Istanbul and David GrittenAt least 25 Palestinians were killed in Israeli strikes across the Gaza Strip on Wednesday, the Hamas-run health ministry has said, in what was one of the deadliest days since the ceasefire came into effect five weeks ago.Ten people were killed when a ministry of religious endowments building in the eastern Zeitoun neighbourhood of Gaza City was hit, according to rescuers.Israel's military said it struck \"Hamas terrorist targets\" after gunmen opened fire towards an area where its soldiers were operating in the southern city of Khan Younis in violation of the ceasefire deal.Hamas questioned the claim and denounced what it said was a \"dangerous escalation\" that could jeopardise the ceasefire.The flare-up of violence comes after the UN Security Council passed a resolution that endorsed US President Donald Trump's Gaza peace plan to end two years of devastating war.Mahmoud Bassal, a spokesman for Gaza's Hamas-run Civil Defence agency, told the BBC that Israeli air, drone and artillery strikes hit several locations in Gaza City and Khan Younis shortly after sunset on Wednesday.The attacks marked a sharp escalation after several days of relative calm, he said.The Civil Defence reported that the strike in Zeitoun caused severe damage to the religious endowments ministry's building and surrounding structures, and posted a video showing its rescue workers appearing to find two people buried under rubble.Photos published by the Anadolu news agency meanwhile showed the bodies of three young children reportedly recovered from the scene.In a separate incident in Gaza City, one person was killed and several others were wounded when a drone struck a group of people at Shejaiya junction on Salah al-Din Street, Gaza's main north-south road, according to Mr Bassal.He said another person was killed when a tank shell struck a house belonging to the Balboul family in Shejaiya's Mushtaha Street, which is also in eastern Gaza City.The Civil Defence reported that another 13 people were killed in the Khan Younis area.Mr Bassal said three of them were killed in a strike on a group inside a sports club run by the UN agency for Palestinian refugees (Unrwa).In a statement, the Israel Defense Forces (IDF) said that \"several terrorists opened fire toward the area where IDF soldiers are operating in Khan Younis\" earlier on Wednesday.\"This action constitutes a violation of the ceasefire agreement. No IDF injuries were reported,\" it added. \"In response, the IDF began striking Hamas terrorist targets across the Gaza Strip.\"Israeli public broadcaster Kan cited a security source as saying the targets of the strikes were the commander of the Zeitoun Battalion of Hamas's military wing, the Izz al-Din al-Qassam Brigades, and the commander of its naval force.Hamas denounced the Israeli strikes, saying in a statement that it considered them a \"dangerous escalation through which the war criminal [Israeli Prime Minister Benjamin] Netanyahu seeks to resume the genocide against our people\".It also urged the US to \"honour its stated commitments and exert immediate pressure on Israel to enforce the ceasefire and halt its attacks\".But a US official told Reuters news agency that Hamas was aiming to break the ceasefire and not fulfil its commitment to disarm.On Monday, the UN Security Council passed a resolution that sought to shore up the fragile ceasefire, which took effect on 10 October.Member states authorised the creation of a transitional governance body called the Board of Peace, which will be chaired by President Trump, and a temporary International Stabilisation Force (ISF), which will be tasked with ensuring \"the process of demilitarizing the Gaza Strip\".Trump hailed the resolution as \"a moment of true historic proportion\".Hamas reiterated that it would not give up its weapons without a Palestinian state, arguing its fight against Israel was legitimate \"resistance\".Israel's ambassador to the UN stressed the importance of disarmament, saying that his country would \"not stop or let up\" until Hamas no longer presented \"a threat\".The Israeli military launched an offensive in Gaza in response to the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.At least 69,500 people have been killed in Israeli attacks in Gaza since then, including 280 during the ceasefire, according to the territory's health ministry.The Israeli military has said three of its soldiers have been killed in attacks in Gaza since the ceasefire began and that its has targeted scores of fighters.On Wednesday afternoon, Israel's military also carried out several strikes in southern Lebanon saying it targeted weapons storage facilities belonging to Hezbollah.Israel accuses the Iran-backed armed group of trying to rebuild its capabilities following a war that ended last November.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israeli strikes in Gaza kill 25 Palestinians, health ministry says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ee12/live/26ae8300-c572-11f0-92f5-0fd46a9dc2cf.jpg"
      ],
      "datePublished": "2025-11-20T07:30:46.000Z",
      "dateModified": "2025-11-20T07:30:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]