[
  {
    "title": "Nicolas Sarkozy illegal campaign financing conviction upheld ",
    "url": "https://www.bbc.com/news/articles/c74x55epn34o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e10a/live/6f4d87d0-caec-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-26T15:11:59.000Z",
    "description": "France's highest court has upheld a sentence against former French President Nicolas Sarkozy over the illegal financing of his 2012 re-election campai",
    "body": "France's highest court has upheld a sentence against former French President Nicolas Sarkozy over the illegal financing of his 2012 re-election campaign.He was found guilty of overspending on his campaign, then hiring a PR firm named Bygmalion to cover it up.Sarkozy, 70, was handed the one-year sentence in 2024 of which six months were suspended, meaning they could be served by wearing an electronic tag instead of going to jail.He has always denied all allegations. Prosecutors in the case said Sarkozy's UMP party spent nearly double the €22.5m (£19.4m) cap on his campaign, splurging on lavish campaign rallies and events.To hide the costs, UMP then asked Bygmalion to invoice the party, rather than the campaign.Today's is the second definitive conviction for the former president, who was in power from 2007 to 2012.Last December the High Court of Appeal upheld a corruption conviction and Sarkozy had to wear an electronic monitoring bracelet for six months.Then, in September, he was sentenced to five years in jail after being found guilty of criminal conspiracy.He spent 20 days in jail before he was released earlier in November. An appeal trial will be held next year. Until then Sarkozy will be subject to strict judicial supervision and barred from leaving France.Days after his release, Sarkozy's team announced the former president was writing a book about his three weeks in jail, titled \"A prisoner's diary\". An excerpt from the book was published on social media: \"In prison there is nothing to see, and nothing to do. I forget the silence that does not exist at La Santé [prison], where there is much to listen to. Here, the noise is, unfortunately, constant. But - like in the desert - inner life strengthens in jail.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nicolas Sarkozy illegal campaign financing conviction upheld ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e10a/live/6f4d87d0-caec-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-26T15:11:59.000Z",
      "dateModified": "2025-11-26T15:11:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chicago man accused of setting train passenger on fire had 72 prior arrests",
    "url": "https://www.bbc.com/news/articles/cr4drle9k12o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d991/live/700b27c0-cac6-11f0-b7d6-15745cdbcf61.jpg",
    "tag": "World",
    "date": "2025-11-26T13:54:36.000Z",
    "description": "A Chicago man who allegedly doused a woman in gasoline and lit her on fire on 17 November was a \"career criminal\", the White House has said. Lawrence ",
    "body": "A Chicago man who allegedly doused a woman in gasoline and lit her on fire on 17 November was a \"career criminal\", the White House has said. Lawrence Reed who was arrested for the crime had 72 prior arrests that include eight felony convictions and seven misdemeanours, according to the White House. The victim, 26-year-old Bethany MaGee, survived the attack but is \"now fighting for her life with horrific burns\", the White house said in a statement.In court on Monday, Mr Reed yelled three times in succession \"I'm guilty\", after the judge warned he could receive a life sentence for charges that include committing a terrorist attack, according to reports from inside the courtroom. The White House has sought to blame the incident on Democrats' policies on crime, casting them as \"soft\". Both the state of Illinois and the city of Chicago are led by Democrats, and President Donald Trump is currently seeking to withhold federal funds from Illinois over its elimination of \"cash bail\", where an arrested person posts a sum of money to be released from jail before trial.The suspect \"was walking free because of the radical, dangerous 'no cash bail' law proudly signed by Governor JB Pritzker and celebrated by Chicago's defund-the-police Mayor Brandon Johnson\", the White House said in a statement it released on Tuesday. Mayor Johnson said in a statement that the attack \"was a tragic incident, and the Mayor's prayers are with the victim and her family.\"Mr Reed, 50, has a history of mental illness and has been arrested 72 times since he turned 18, according to a Chicago affiliate of the BBC's partner CBS News.In August, he was charged with aggravated battery for allegedly hitting a social worker and after his arrest was released with electronic monitoring against prosecutors' objections. The attack against Ms MaGee happened while she was \"minding her own business and reading her phone\", prosecutors said. According to the criminal complaint, she was approached by Mr Reed arriving from the back of the train car who then doused her with gasoline before she ran.As he chased her, the complaint said, Mr Reed ignited the rest of the liquid in the bottle and set Ms MaGee on fire. Footage of the incident appeared to show Mr Reed watching Ms MaGee as she rolled on the floor engulfed in flames attempting to extinguish the fire. Last week,  Mayor Johnson said the attack \"should have never happened\", characterising it as \"an absolute failure of our criminal justice as well as our mental health institutions\". He said the suspect clearly faced mental health challenges and presented a danger to himself and the community.As a county commissioner, Johnson in 2020 introduced a nonbinding resolution to redirect funds from police and jails to other public services, but while running for mayor in 2023 he promised not to cut police spending.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chicago man accused of setting train passenger on fire had 72 prior arrests",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d991/live/700b27c0-cac6-11f0-b7d6-15745cdbcf61.jpg"
      ],
      "datePublished": "2025-11-26T13:54:36.000Z",
      "dateModified": "2025-11-26T13:54:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US suspends immigration requests for Afghans after National Guard shooting",
    "url": "https://www.bbc.com/news/articles/cgex957qg97o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d509/live/9022caa0-cb65-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-27T07:28:01.000Z",
    "description": "50 minutes agoJames ChaterWatch: US President Donald Trump says alleged gunman was Afghan nationalThe US has suspended processing all immigration requ",
    "body": "50 minutes agoJames ChaterWatch: US President Donald Trump says alleged gunman was Afghan nationalThe US has suspended processing all immigration requests from Afghans, after an Afghan man was identified as the suspect in the shooting of two National Guard soldiers near the White House.The US Citizenship and Immigration Services said the decision was made pending a review of \"security and vetting protocols\".The suspect of Wednesday's shooting, which left two National Guard members critically injured, is said to have arrived in the US from Afghanistan in September 2021.US President Donald Trump said the attack was an \"act of terror\", adding that he would take steps to remove foreigners \"from any country who does not belong here\". Tens of thousands of Afghans entered the US under special immigration protections following the chaotic US withdrawal from the country in 2021 under former President Joe Biden.The Department of Homeland Security named the suspect in a press release as Rahmanullah Lakamal, \"a criminal alien from Afghanistan\". An official has told the BBC's US news partner CBS that he applied for asylum in 2024, and his application was granted earlier this year.The 29-year-old is understood to have entered the country under the programme called Operation Allies Welcome. Trump said following the shooting that the US \"must now re-examine every single alien who has entered our country from Afghanistan under Biden\".The Joint Task Force DC, which is co-ordinating the National Guard deployments to the nation's capital, said the attack took place at around 14:15 EST (17:15 GMT) on Wednesday near the Farragut Square Metro Station.The soldiers had been on a high-visibility patrol near the corner of 17th and I streets - a busy lunch spot for office workers.Metropolitan Police Assistant Chief Jeff Carroll said the suspect \"came around the corner\" and \"immediately started firing\", adding that the soldiers had been \"ambushed\".ReutersSecurity officials cordoned off the scene of the attack near the White House in Washington DC on WednesdayOther National Guard members nearby heard the gunfire and intervened, holding the suspect down until police arrived, he said.The suspect was shot four times, law enforcement sources told CBS.Thousands of National Guard soldiers from across the US have been deployed to Washington DC to tackle what Trump has described as \"out of control\" crime.There have been similar deployments in other cities across the US, which have faced legal challenges by opponents who accuse the Trump administration of overreach.Trump imposed a travel ban on nationals of Afghanistan - and 11 other countries - earlier this year.Afghan nationals holding Special Immigration Visas - available to those who worked directly with the US military and feared retribution from the Taliban as a result of that co-operation - were among a few exceptions to the sweeping bans. The Taliban returned to power following the US withdrawal in 2021.Trump has also ended a programme that granted deportation protections for thousands of people from Afghanistan.The temporary protected status programme allowed migrants to get work permits if the US government deemed it unsafe for them to return to their home countries due to war.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US suspends immigration requests for Afghans after National Guard shooting",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d509/live/9022caa0-cb65-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-27T07:28:01.000Z",
      "dateModified": "2025-11-27T07:28:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pope Leo heads to Turkey and Lebanon in first foreign trip six months into papacy",
    "url": "https://www.bbc.com/news/articles/cy5g3076lqzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8587/live/8c7b86a0-cb3b-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-27T04:03:10.000Z",
    "description": "4 hours agoAleem MaqboolReligion editor, travelling with Pope Leo XIVPope Leo XIV is beginning the first foreign trip of his papacy. Over the next six",
    "body": "4 hours agoAleem MaqboolReligion editor, travelling with Pope Leo XIVPope Leo XIV is beginning the first foreign trip of his papacy. Over the next six days he will first visit Turkey for an historic Christian anniversary. He will then visit Lebanon just days after Israeli airstrikes on its capital, Beirut.Visits to both countries had originally been planned by the late Pope Francis, but the overarching theme – building bridges – is one Pope Leo has made his own from the moment he stepped on to the balcony of St Peter's Basilica after his election in May.In the first six months of his papacy, he has conveyed a sense of being extremely measured, even cautious. But on this trip, his powers of diplomacy will be closely scrutinised.A key moment of the trip will take place in the Turkish town of Iznik, the site of the ancient city of Nicaea. Pope Leo and leaders of other Christian traditions will gather to mark the anniversary of an ancient council that took place there 1,700 years ago.  In 325 AD, among other key decisions, more than 200 bishops at the council affirmed the belief that Jesus was the son of God, eventually leading to what is known as the Nicene Creed.Eastern and Western branches of Christianity later dramatically split, but during this trip there will be messages of togetherness and healing divisions.In Turkey the Pope will also visit the Blue Mosque, as both his immediate predecessors Pope Francis and Pope Benedict XVI had done. He will have meetings with other religious leaders in a gesture of inter-religious dialogue before flying on to the second leg of the trip.The Vatican says plans for the Pope's visit to Lebanon have not changed following the Israeli airstrikes on Beirut earlier in the week.He will meet more faith leaders and hear from young people in Lebanon, his visit giving a boost in particular to the estimated third of the country that is Christian.On the final day of the trip, Pope Leo will celebrate Mass at the Beirut waterfront at the site of the 2020 port explosion, praying for the more than 200 people who were killed and 7,000 others injured.Over recent months, though he has spoken out on some issues dear to him such as the dignity of migrants, he has certainly not been as overtly political as his predecessor could be.He has walked such a fine line that in some cases both progressives and traditionalists within the Catholic Church have made the case that he supports their school of thought.It was for similar reasons that cardinals of different persuasions were thought to have coalesced around him at conclave.Pope Francis was seen as a visionary but one who was not overly worried about creating consensus, leaving behind a somewhat divided Church. Pope Leo has so far operated very differently, gently holding on to some of the progressive ideals of his predecessor while paying heed to the views of traditionalists.He has repeatedly called for an end to war, but in a different way to Pope Francis, who memorably made daily calls to the Holy Family Church in Gaza to offer his support.In meetings on this trip - with Turkish President Recep Tayyip Erdogan and Lebanese civic leaders - Pope Leo may be drawn to comment on his views on conflict in the region.We may hear something of his impressions at the end of his trip, as it is customary for the Pope to hold a news conference with travelling press on the return flight to Rome.What we will hear more of this trip is a pope speaking in a Chicagoan accent. Although Pope Leo, who speaks several languages fluently, has mainly given public addresses in Italian up to this point, the Vatican has confirmed that he will speak English throughout the Turkish leg of his trip, with some French too during his time in Lebanon.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pope Leo heads to Turkey and Lebanon in first foreign trip six months into papacy",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8587/live/8c7b86a0-cb3b-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-27T04:03:10.000Z",
      "dateModified": "2025-11-27T04:03:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": " Australia social media ban: Teens challenge law before High Court",
    "url": "https://www.bbc.com/news/articles/c9d9l7w1g8yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5c30/live/8bdd6030-ca9e-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-26T06:37:56.000Z",
    "description": "Australia's landmark social media ban for children is being challenged in the nation's highest court, with two teenagers alleging the law is unconstit",
    "body": "Australia's landmark social media ban for children is being challenged in the nation's highest court, with two teenagers alleging the law is unconstitutional as it robs them of their right to free communication.From 10 December, social media firms - including Meta, TikTok and YouTube - must ensure that Australians aged under 16 cannot hold accounts on their platforms.The law, which is being watched closely around the world, was justified by campaigners and the government as necessary to protect children from harmful content and algorithms. However, 15-year-olds Noah Jones and Macy Neyland - backed by a rights group - will argue the ban completely disregards the rights of children.\"We shouldn't be silenced. It's like Orwell's book 1984, and that scares me,\" Macy Neyland said in a statement.After news of the case broke, Communications Minister Anika Wells told parliament the government would not be swayed.\"We will not be intimidated by threats. We will not be intimidated by legal challenges. We will not be intimidated by big tech. On behalf of Australian parents, we will stand firm,\" she said.The Digital Freedom Project (DFP) announced the case had been filed in the High Court on Wednesday. Teenagers rely on social media for information and association, and a ban could hurt the nation's most vulnerable kids - young people with disability, First Nations youth, rural and remote kids and LGBTIQ+ teenagers - the most, the group said on their website.Led by a New South Wales parliamentarian, John Ruddick, DFP said their challenge would hinge on the ban's impact on political communication, and whether it was proportional to the law's aims.Other measures to improve online safety should be used instead, the group argued, pointing to digital literacy programmes, the forced introduction of age-appropriate features for platforms, and age assurance technologies which have greater privacy protections.Noah Jones argued the government's policy was \"lazy\". \"We are the true digital natives and we want to remain educated, robust, and savvy in our digital world... They should protect kids with safeguards, not silence.\"Australian media have previously reported that Google, which owns YouTube, has also been considering launching a constitutional challenge.Though opposed by the tech companies who will be charged with enforcing it, the ban is supported by most Australian adults, according to polls. However, some mental health advocates say it may cut kids off from connection, and others say it could push youngsters to even-less-regulated corners of the internet.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": " Australia social media ban: Teens challenge law before High Court",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5c30/live/8bdd6030-ca9e-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-26T06:37:56.000Z",
      "dateModified": "2025-11-26T06:37:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South East Asia floods: Scores killed and thousands evacuated from record rainfall",
    "url": "https://www.bbc.com/news/articles/ckg97wx144jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9254/live/7976c7d0-ca74-11f0-8dce-cdba4388e3a7.jpg",
    "tag": "World",
    "date": "2025-11-26T09:29:52.000Z",
    "description": "'Once in 300 years' rain hits Thai city as floods ravage South East Asia23 hours agoKelly NgWatch: People cling to floating debris during catastrophic",
    "body": "'Once in 300 years' rain hits Thai city as floods ravage South East Asia23 hours agoKelly NgWatch: People cling to floating debris during catastrophic floods in ThailandParts of Thailand are battling record floods, which have killed at least 33 people and prompted authorities to deploy military ships and helicopters to support relief efforts.The deluge has hit 10 provinces across the country's south over the past week, with the city of Hat Yai, a business hub bordering Malaysia, recording its heaviest rainfall in 300 years - 335mm in a single day.Photos show vehicles and houses submerged in the city, while desperate residents await rescue on their rooftops.Relentless rains have also ravaged neighbouring countries. In Vietnam, the death toll has risen to 98 in a week, while in Malaysia, more than 19,000 people have been forced from their homes.In Indonesia, at least 19 people have been killed and at least seven others remained buried under landslides in North Sumatra, according to the Indonesian National Search and Rescue Agency.More than 2 million people in Thailand have been affected by the floods, but just 13,000 have been moved to shelters. The vast majority are cut off and unable to get help, according to Reuters news agency.The Thai military, which has been put in charge of tackling the crisis, said it is preparing to dispatch an aircraft carrier and a flotilla of 14 boats loaded with relief supplies, along with field kitchens that are said to be able to deliver 3,000 meals a day.Medical teams on board the aircraft carrier will convert it into a \"floating hospital\" if required, the navy said.ReutersA drone view shows dozens of vehicles at least partially submerged in a carpark Hat YaiBoats, high-clearance trucks, and jet skis have also been deployed to evacuate residents, said the governor of Songkhla province, where Hat Yai is located.The cabinet on Tuesday declared Songkhla a disaster zone, freeing up funds for relief.However, many people remain stranded amid the rising waters. A volunteer rescue group, the Matchima Rescue Center, told Reuters it had been inundated with thousands of calls in the last three days, with people asking to be evacuated.People have also posted urgent calls for help on Matchima's Facebook page. \"Many people are trapped... Please help,\" one user wrote. \"It's very difficult right now. The water has reached the second floor, where there are children, the elderly, the sick, and the disabled!!!\" Another wrote that his household had been waiting for help for three days: \"Every second is crucial now... Please help share. My [phone's] battery is at 40%. Thank you everyone.\"Some also wrote about not having had any food and water for days.A clip that has gone viral on social media shows three young boys hanging from power lines, trying to inch their way to safety while brown murky waters continue to rise below them.In Malaysia, more than 19,000 people have been evacuated to safety, with 126 evacuation centres set up in the northern border areas.In the states of Kelantan and Perlis, rescue teams waded through knee-deep floodwaters to evacuate residents in areas where rising waters had cut off access to roads.Heavy seasonal rain is common around this time of year in South East Asia, but this year has seen exceptionally high levels of flooding in the region.ReutersThe Thai military said it is preparing to dispatch an aircraft carrier and a flotilla of 14 boats loaded with relief supplies",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South East Asia floods: Scores killed and thousands evacuated from record rainfall",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9254/live/7976c7d0-ca74-11f0-8dce-cdba4388e3a7.jpg"
      ],
      "datePublished": "2025-11-26T09:29:52.000Z",
      "dateModified": "2025-11-26T09:29:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump defends Witkoff after leak appears to show envoy coaching Russias",
    "url": "https://www.bbc.com/news/articles/c3r7xr94ln8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a3a2/live/5d76f740-cabe-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-26T10:25:06.000Z",
    "description": "Donald Trump has defended his special envoy Steve Witkoff as doing the \"standard thing\" after a leaked recording appeared to show him advising a Russi",
    "body": "Donald Trump has defended his special envoy Steve Witkoff as doing the \"standard thing\" after a leaked recording appeared to show him advising a Russian official on how to appeal to the US president.Trump told reporters on Wednesday that he had not heard the audio, but that Witkoff was doing \"what a dealmaker does\" to \"sell\" a US-authored peace plan to both Russia and Ukraine.The leaked call from last month emerged days after the 28-point draft peace plan was presented by the US, which largely reflected Russian positions on ending its full-scale war in Ukraine.Witkoff has visited Moscow several times this year and will meet Russian President Vladimir Putin again next week.He has never gone to Kyiv in his role as special envoy, though other US officials have visited and US army secretary Dan Driscoll went to Kyiv this week. Trump says he will hold further talks with the Ukrainians.Diplomatic talks have continued after the initial draft plan was criticised by Ukrainian and European leaders as being too favourable to Russia. Among the proposals was handing Russia territory in eastern Ukraine currently controlled by Kyiv. The plan has since been revised to better reflect Ukraine's interests and the views of European allies. Ukrainian President Volodymyr Zelensky has said he was ready to meet Trump to discuss outstanding \"sensitive points\".In the leaked audio recording obtained and shared as a transcript by Bloomberg, Witkoff appeared to advise Yuri Ushakov, Putin's foreign policy adviser, on how to get on Trump's good side.BBC News has not independently verified the reported 14 October call, but Trump said it represented a \"very standard form of negotiations\". During the leaked conversation, the two men reportedly talked about ending the war, with Ushakov asking if it would be useful to get their bosses - Putin and Trump - to speak.Witkoff is quoted as saying that \"my guy is ready to do it\", before suggesting how to go about the call.\"Just reiterate that you congratulate the president [Trump] on this achievement... that you respect that he is a man of peace and you're just, you're really glad to have seen it happen,\" Witkoff is quoted as saying. \"I think from that it's going to be a really good call.\"\"I told the president that you - that the Russian Federation has always wanted a peace deal. That's my belief,\" Witkoff adds, according to the transcript. \"The issue is is that we have two nations that are having a hard time coming to a compromise.\"He continues: \"I'm even thinking that maybe we set out like a 20-point peace proposal, just like we did in Gaza.\"The call ends with Witkoff telling Ushakov of an imminent Zelensky visit to the White House, and that \"if possible\", Trump and Putin should talk before that meeting.What followed was a two-and-a-half hour phone call between the US and Russian presidents, news of which emerged as Zelensky was on his way to Washington last month.Before the Trump-Putin call, the US president had appeared to be running out of patience with his Russian counterpart and had suggested he might provide Ukraine with long-range Tomahawk missiles.By the time Zelensky entered the White House, the atmosphere seemed to have changed. Trump said giving Kyiv Tomahawks could escalate the conflict and that he believed Putin \"wants to end the war\".Asked about the call being leaked, Yuri Ushakov told Russian state media that it was done to \"hinder, probably\" and that it was \"unlikely\" to be done to improve relations.He also confirmed that Witkoff would be visiting Moscow next week as per a \"preliminary agreement\".It was not clear who was behind the leak, but Bloomberg has also transcribed another reported call between Ushakov and Putin envoy Kirill Dmitriev, who spent days with Witkoff in Miami in late October weeks before the 28-point draft plan emerged.According to that transcript, Dmitriev tells his Russian colleague: \"We'll just make this paper from our position, and I'll informally pass it along, making it clear that it's all informal. And let them do like their own.\"Apparently angered by the report, Dmitriev complained of a \"well-funded, well-organised malicious media machine built to spread fake narratives, smear opponents and keep people confused\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump defends Witkoff after leak appears to show envoy coaching Russias",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a3a2/live/5d76f740-cabe-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-26T10:25:06.000Z",
      "dateModified": "2025-11-26T10:25:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hong Kong residents react as deadly fire tears through housing estate",
    "url": "https://www.bbc.com/news/articles/cvgjnlx1g6yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/57a5/live/b7641ed0-caec-11f0-8c06-f5d460985095.png",
    "tag": "World",
    "date": "2025-11-26T22:12:59.000Z",
    "description": "'I am devastated': Hong Kong residents in disbelief after fire destroys blocks of flats10 hours agoPhoebe Kong & Koey Lee,BBC Chinese, in Hong Kong,Da",
    "body": "'I am devastated': Hong Kong residents in disbelief after fire destroys blocks of flats10 hours agoPhoebe Kong & Koey Lee,BBC Chinese, in Hong Kong,Danny Vincent,in Hong Kong,andKathryn ArmstrongWatch: Deadly fire engulfs Hong Kong apartment blocks\"When you get closer the heat rises and you can feel it and the smoke is really heavy.\"Student Thomas Liu was one of many people drawn to the scene of a deadly fire that tore through much of the eight-block Wang Fuk Court housing complex in Hong Kong's Tai Po district.At least 44 people have died in Wednesday's devastating blaze so far, and with hundreds still missing it's expected this number will rise. The cause is not yet known, but three construction company executives have been arrested on suspicion of manslaughter connected to flammable materials, including mesh and plastic sheets, that may have allowed the fire to spread quickly. \"It's a disaster,\" Thomas said of the fire, telling the BBC he had seen a body being taken away. \"Many people sent us WhatsApp messages or called us, saying they still have relatives inside or can't find them,\" Mui Siu-fung, a councillor for the Tai Po district, told BBC Chinese. More than a thousand other people were forced to evacuate the estate as the flames spread, with some heading to centres that have been set up to house them. Police also moved people from nearby buildings. The fire was gradually being contained but officials said they did not know when it would be fully extinguished. Flames could be seen coming from individual apartments as many people watched on in silence.One woman said her friends live inside the building and she was waiting to hear if they managed to get out.ReutersHarry Cheung has lived in block two of the Wang Fuk Court complex for decadesHarry Cheung, who has lived in block two of the Wang Fuk Court complex for more than 40 years, told Reuters he heard \"a very loud noise\" and saw fire erupt in a nearby block.\"I immediately went back to pack up my things,\" the 66-year-old resident said.\"I don't even know how I feel right now. I'm just thinking about where I'm going to sleep tonight because I probably won't be able to go back home.\"A woman in her sixties, whose surname is Kam and who lives in the adjacent Kwong Fuk Estate, told the South China Morning Post (SCMP) that several of her friends living in Wang Fuk Court had been accounted for - but not all.One friend has daily afternoon naps and may have been sleeping when the fire broke out at 14:51 local time (06:51 GMT), Ms Kam said, adding that the woman's daughters have not yet been able to contact her. Another resident, 65-year-old Jason Kong, told Reuters that a neighbour called him and said he was still trapped inside one of the tower blocks. \"I am devastated. There are so many neighbours and friends. I do not know what is going on anymore. Look, all the apartments are just burning. I do not know what to do. I hope the government can help us to settle down after this.\"An elderly woman who lives in one of the affected blocks told the BBC she was not at home when the fire broke out but that she was worried about her apartment because it was not insured. \"I'm very upset that I have no home to go to now,\" she said. While the cause of the fire that engulfed the multiple high-rise blocks was unknown, police say a mesh material and plastic sheets were found outside the buildings - both of which are not believed to be fireproof. Styrofoam was also found on the building's windows. These materials may have caused the fire to spread more quickly, said police.Some people have expressed anger that such a massive fire could have happened and criticised the response.\"When there's a wildfire, they will deploy helicopters and drop water bombs, but why is there no such deployment and how can they leave other buildings burning?\" Ms Poon, another resident of Wang Fuk Court, who is in her sixties, asked.\"The community is so close to the fire station and we thought the fire could be put out soon, but now the fire has spread. I'm so disappointed,\" she told the SCMP. Ms Poon noted that she had been given no instructions from the government on where to seek help.The BBC spoke to some Tai Po residents who had brought supplies to the victims and affected residents - including dozens of blankets and heat packs.Hong Kong chief executive John Lee said government departments were assisting residents affected by the fire.When asked about their feelings about the fire, the residents said \"the government is incompetent\" and that they were \"immensely heartbroken\".  \"We don't want to see any more casualties,\" said one. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hong Kong residents react as deadly fire tears through housing estate",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/57a5/live/b7641ed0-caec-11f0-8c06-f5d460985095.png"
      ],
      "datePublished": "2025-11-26T22:12:59.000Z",
      "dateModified": "2025-11-26T22:12:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guinea-Bissau coup: Soldiers seize power and detain President Umaro Sissoco Embaló",
    "url": "https://www.bbc.com/news/articles/c0edww3qgq2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/62f2/live/8831fae0-cadf-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "World",
    "date": "2025-11-27T07:17:24.000Z",
    "description": "1 hour agoNicolas Negoce,Paul Njie,BBC Africa reportersandWedaeli ChibelushiAFP via Getty ImagesThe soldiers gave an address on state TVA group of mil",
    "body": "1 hour agoNicolas Negoce,Paul Njie,BBC Africa reportersandWedaeli ChibelushiAFP via Getty ImagesThe soldiers gave an address on state TVA group of military officers say they have seized control of Guinea-Bissau amid reports that the president, Umaro Sissoco Embaló, has been arrested.Shortly after gunshots were heard in the capital, Bissau, government sources told the BBC that Embaló had been detained.The officers then appeared on state TV, saying they had suspended the electoral process, as the West African nation awaited the outcome of Sunday's presidential election. They said they were acting to thwart a plot by unnamed politicians who had \"the support of a well-known drug baron\" to destabilise the country, and announced the closure of its borders and imposed a night-time curfew.Sandwiched between Senegal and Guinea, the coup-prone country is  known as a notorious drug-trafficking hub where the military has been influential since independence from Portugal in 1974.The election results were expected on Thursday - both Embaló and his closest rival Fernando Dias had claimed victory.Dias was supported by former Prime Minister Domingos Pereira, who had been disqualified from running.Late on Wednesday afternoon, Embaló told France 24 in a phone call: \"I have been deposed.\"Government sources have since told the BBC that Dias, Pereira and Interior Minister Botché Candé have also been detained.The putschists have taken army chief Gen Biague Na Ntan and his deputy, Gen Mamadou Touré, into custody too, the sources say.In a joint statement, leaders of election observation missions from the African Union and the West African bloc Ecowas expressed \"deep concern with the announcement of a coup d'etat by the armed forces\".They said the country had been prepared for the announcement of the election results after what it described as an \"orderly and peaceful\" process.\"It's regrettable that this announcement came at a time when the missions had just concluded meeting with the two leading presidential candidates, who assured us of their willingness to accept the will of the people,\" they said.Gunshots heard near presidential palace in the capital BissauWitnesses in Bissau heard gunfire earlier on, at around 13:00 GMT, but it was not immediately clear who was involved in the shooting or if there were any casualties.Hundreds of people on foot and in vehicles fled, seeking shelter as the shots rang out, the AFP news agency reported.Later on, General Denis N'Canha, head of the military household at the presidential palace, read out a statement declaring a takeover.He said officers had formed \"the High Military Command for the Restoration of Order\" and instructed the population to \"remain calm\".Checkpoints have been erected across Bissau and the streets were deserted ahead of the curfew, that was due to start at 19:00 GMT.Portugal has called for a return to constitutional order, with its foreign ministry urging \"all those involved to refrain from any act of institutional or civic violence\".The former Portuguese colony has witnessed at least nine coups or attempted coups over the last five decades.Corbis via Getty ImagesPresident Embaló was elected in December 2019Embaló has said he has survived multiple coup attempts during his time in office. However, his critics allege he has fabricated crises in order to crack down on dissent.The 53-year-old had wanted to make history as the country's only president to secure a second consecutive mandate in the last 30 years.He had initially said he would not seek a second term. Prior to the delayed polls, his legitimacy had been questioned, with the opposition saying his term should have officially ended in February 2025.Guinea-Bissau is one of the poorest countries in the world with a population of more than two million people.Its coastline has many uninhabited islands, making it ideal for drug traffickers - with the UN dubbing it a \"narco-state\" as it has been a key transit point for cocaine coming from Latin America to Europe. Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guinea-Bissau coup: Soldiers seize power and detain President Umaro Sissoco Embaló",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/62f2/live/8831fae0-cadf-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-27T07:17:24.000Z",
      "dateModified": "2025-11-27T07:17:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC on the scene of the Hong Kong apartment block blaze",
    "url": "https://www.bbc.com/news/videos/c1w9q910nz4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dce7/live/622d0500-cb5d-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "World",
    "date": "2025-11-27T06:55:53.000Z",
    "description": "Watch: Indonesia's Semeru volcano spews giant ash clouds as it eruptsJava Island’s tallest mountain, a volcano called Mount Semeru, has spewed tall pl",
    "body": "Watch: Indonesia's Semeru volcano spews giant ash clouds as it eruptsJava Island’s tallest mountain, a volcano called Mount Semeru, has spewed tall plumes of ash clouds that engulfed bridges and the surrounding countryside.AsiaPakistan: Suicide attack outside Islamabad court kills 12 At least 12 people have been killed after a suicide attack outside a court in Islamabad on TuesdayAsiaPhilippines typhoon aftermath: 'Water levels are rising fast'A weakened Typhoon Fung-wong is now passing over the South China Sea, after leaving two people dead in the Philippines.AsiaWaves smash Philippines coastline as typhoon hitsFootage from 9 November shows swells from Typhoon Fung-wong surging over houses and palm trees.AsiaShipping containers swept away in deadly Philippines floods At least three people have died, officials say. Residents sought shelter from high water on rooftops.AsiaTrump imitates India's PM Narendra Modi in South KoreaTrump impersonated Modi while recalling his conversations from the May India-Pakistan conflictAsiaTrump in Malaysia: Dancing and a 'peace deal'US President Donald Trump in Malaysia: Dancing and a 'peace deal'AsiaMillions of Diwali lamps light up Indian town to set new world recordA record 2.6 million earthen lamps were lit on Sunday in Ayodhya, Uttar Pradesh.AsiaHow South Korea is using a holographic cop to fight crime A life-sized holographic police officer has been installed in central Seoul in a bid to deter crime. The BBC took to the streets to ask people if they think it’ll work.AsiaWatch: Race to reach hikers stranded by Mount Everest blizzardChinese state media reports say around 350 people have been rescued and efforts are under way to reach more than 200 others.AsiaWatch: Moments as 6.9 magnitude earthquake hit PhilippinesAt least 69 people are killed after it struck on Tuesday night with officials declaring a \"state of calamity\".AsiaWatch: Typhoon Ragasa leaves trail of destruction in ChinaThe \"king of storms\" has forced the evacuation of nearly two million people from the southern Chinese province of Guangdong.AsiaWatch: Moment water shatters glass doors of Hong Kong hotelA person was swept off their feet as water burst into the building. AsiaMoment sinkhole pulls down power lines in busy Bangkok streetSocial media footage showed the massive crater in Thailand's capital leaving cars teetering on the edge.AsiaWatch: BBC correspondent reports from southern China hit by 'king of storms'The BBC's Laura Bicker says residents of southern China are largely heeding warnings from authorities as the storm lashes the region with wind and rain.AsiaWatch: Flood destroys bridge as Super Typhoon Ragasa hits TaiwanAt least two people died and dozens are missing after the typhoon lashed Taiwan's east coast with heavy wind and rain.AsiaFive die after Indian city receives worst single-spell rainfall in yearsSeveral neighbourhoods in Kolkata have been inundated, with water entering people's homes. AsiaWatch: Philippines anti-corruption protests turn violentThousands of demonstrators took to the streets of the capital Manila, with some clashing with police.AsiaWatch: Hugs on tarmac as family reunite after Afghan ordealThe couple's family say they are \"overwhelmed with gratitude and relief\" at their release.AsiaWatch: Bear caught on CCTV searching for food in Indian templeThe curious creature ransacked an office in its quest to find tasty treats.Asia",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC on the scene of the Hong Kong apartment block blaze",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dce7/live/622d0500-cb5d-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-27T06:55:53.000Z",
      "dateModified": "2025-11-27T06:55:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Daybreak aerial footage reveals scale of Hong Kong apartment block blaze",
    "url": "https://www.bbc.com/news/videos/c1e4ld1830yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e8f4/live/f140cf60-cb3f-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-27T03:28:52.000Z",
    "description": "Dawn has revealed the scale of destruction in Hong Kong, after a major fire engulfed public housing apartments in the Tai Po district yesterday.More t",
    "body": "Dawn has revealed the scale of destruction in Hong Kong, after a major fire engulfed public housing apartments in the Tai Po district yesterday.More than 800 firefighters were still tackling the blaze at Wang Fuk Court this morning, which has been classified as a level five blaze.Some 900 residents have been evacuated to temporary shelters, but hundreds more remain unaccounted for.Follow live coverage here",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Daybreak aerial footage reveals scale of Hong Kong apartment block blaze",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e8f4/live/f140cf60-cb3f-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-27T03:28:52.000Z",
      "dateModified": "2025-11-27T03:28:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Car nearly hits first responders in Midwest blizzard conditions",
    "url": "https://www.bbc.com/news/videos/clykg1j4501o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4db4/live/d0255600-cb2d-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "World",
    "date": "2025-11-27T01:12:05.000Z",
    "description": "Many Thanksgiving travellers across the US will experience a white holiday as a winter storm leaves behind a fresh blanket of snow. In the Midwest, bl",
    "body": "Many Thanksgiving travellers across the US will experience a white holiday as a winter storm leaves behind a fresh blanket of snow. In the Midwest, blizzard conditions have led to hazardous road collisions. Winter storm alerts and hazardous weather outlooks have been issued for parts of Michigan, Minnesota, Montana, North Dakota, South Dakota, Wisconsin. Another storm is expected on 29 November, which will bring additional snowfall to western and central states.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Car nearly hits first responders in Midwest blizzard conditions",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4db4/live/d0255600-cb2d-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-27T01:12:05.000Z",
      "dateModified": "2025-11-27T01:12:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sean Duffy wants more civility in air travel. Not everyone is on board",
    "url": "https://www.bbc.com/news/articles/cg5m73e2l6do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5935/live/a24eaad0-ca59-11f0-96b0-df24c333db3c.jpg",
    "tag": "World",
    "date": "2025-11-26T21:43:21.000Z",
    "description": "US transportation secretary wants more civility in air travel. Not everyone is on boardUS Transportation Secretary Sean Duffy is urging air travellers",
    "body": "US transportation secretary wants more civility in air travel. Not everyone is on boardUS Transportation Secretary Sean Duffy is urging air travellers to dress better and be more civil - and it's touching a nerve at a time when many Americans consider air travel more frustrating than ever. Ahead of what's expected to be the busiest Thanksgiving travel season in 15 years, Duffy launched a campaign last week titled \"The Golden Age of Travel Starts with You\", in which he harked back to the 1950s and 60s to call for a return to civility and class in air travel. But as air traffic controllers remain short-staffed and customers face frequent flight delays, both social media users and aviation experts say Duffy is missing the point. A video advert for the Department of Transportation's campaign juxtaposes old footage of smiling airport staff and orderly passengers with modern social media videos of people starting fights on planes, putting their bare feet up on seats and engaging in other disruptive behaviour. \"Manners don't stop at the gate. Things aren't what they used to be,\" Duffy chimes in. \"Let's bring civility and manners back. Ask yourself, are you helping a pregnant woman put her bag in the overhead bin? Are you dressing with respect?\"The Federal Aviation Administration (FAA) predicts this week will be the busiest Thanksgiving travel season in 15 years - with more than 52,000 flights on 25 November alone. And aviation experts say Duffy's message won't have much effect on the flying atmosphere. Scott Keyes, an air travel expert and founder of the flight deals site Going.com, told the BBC that, while it sounds great to ask everyone to just be nicer to each other, in terms of the actual efficacy of that message, \"you might as well ask a wall to start printing you money\". \"Very few people show up for their flight itching to pick a fight with another passenger,\" Mr Keyes said. And once they reach the level of agitation where they've started picking a fight with a flight attendant or passenger, he said they're unlikely to remember Duffy's words or calm down. The underlying problem, he argues, is people letting their tempers get the best of them, which he sees as a worsening problem across all of society, not just on airplanes, and not just in the US. Since the secretary started posting about the campaign on X, some of his subsequent posts have been flooded with thousands of comments critical of Duffy's message.\"If you want us to be respectful humans at the airport stop treating us like cattle,\" one X user commented. \"Remove the demoralising and humiliating TSA checks (that accomplish nothing) and find a way to get the airlines to give more than 2 inches of space per seat.\"Henry Harteveldt, a travel industry analyst and president of Atmosphere Research Group, told the BBC that, while Duffy makes a valid point that being considerate was important, his call to dress nicer won't change a thing. \"You could be dressed in black tie and still be a jerk, and you could be wearing sweatpants and a sweatshirt and be the most considerate person in the world. The clothes, in this case, do not make the person,\" Mr Harteveldt said. A number of commenters on Duffy's X post have pointed out that the reason they dress so casually is because of how cramped plane cabins have become, as well as the expectation of extended delays. \"Tell you what,\" one X user commented. \"You get the planes running on time, and we won't dress to spend the night in the damn airport.\" Another wrote: \"Can I get my legroom back?\"One X user, who has nearly 500,000 followers, posted: \"Duffy is absolutely right...BUT our declining travel dress is also a reflection of how airlines treat us. Cattle boarding, tiny seats, penny pinching every beverage cost and just generally miserable.\" Echoing what many social media users have pointed out, Mr Harteveldt said the airlines bore some responsibility for passengers' bad behaviour, too, by making their \"economy cabins so unpleasant and so physically uncomfortable\" that they naturally put passengers in a bad mood. Couple that with minimal flight attendant staffing, minimal amenities on board, and the airlines' embrace of the pay-for-what-you-want business model, \"you don't get people smiling as they walk down the loading bridge to the plane,\" he said. Still, others have praised the secretary's core message of respect and kindness, with one commenting: \"I will do my small part to spread civility in my own life.\"The Department of Transportation (DOT) says the campaign isn't only about saying \"please\" and \"thank you\" - it's also about reducing the amount of violent and disruptive incidents on airplanes and in airports. The agency says that since 2019 there's been a 400% increase in in-flight outbursts, including both unruly behaviour and violent attacks. Since 2021, the department has recorded 13,800 unruly passenger incidents, while one in five attendants have experienced a physical incident.But experts dispute that air travel has declined in quality. Dan Bubb, an aviation historian and professor at University of Nevada Las Vegas, told the BBC that, despite the rise in incivility cases, statistically that number wasn't very significant. There are far more travellers and flights now than there used to be, and Prof Bubb said that makes it difficult to compare today's airline incidents with past decades. Mr Keyes pointed out what he sees as another major issue with Duffy's message: air travel used to bring a host of other issues we no longer face today. \"It's laughable how much worse air travel was back then,\" Mr Keyes said. Flying was far less safe, he said, noting that planes crashed and were hijacked more frequently. Flights were also far more expensive relative to income. Among other drawbacks: the cabins were filled with cigarette smoke, and flight attendants faced rampant sexism and stringent physical requirements. Mr Keyes believes the FAA and DOT could make more of a difference in reducing passenger stress by pushing airlines to minimise the number of delays and cancellations. Prof Bubb said it would also help to \"give passengers a little more physical space in terms of seat size and legroom, include meal service in the price of their tickets, reduce alcohol consumption, make going through security at airports less stressful, make parking at airports easier, expand boarding area space at airport gates\". And, he added, we do still need to encourage passengers to be courteous to flight crews and each other.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sean Duffy wants more civility in air travel. Not everyone is on board",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5935/live/a24eaad0-ca59-11f0-96b0-df24c333db3c.jpg"
      ],
      "datePublished": "2025-11-26T21:43:21.000Z",
      "dateModified": "2025-11-26T21:43:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Watch: Moment researcher finds rare flower after 13-year search",
    "url": "https://www.bbc.com/news/videos/cm28z27mm89o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/eb8f/live/95fc1340-cab2-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "World",
    "date": "2025-11-26T06:58:20.000Z",
    "description": "A team of UK and Indonesian scientists have found a rare Rafflesia hasseltii in a rainforest in West Sumatra.Indonesian botanist Septian Andriki and U",
    "body": "A team of UK and Indonesian scientists have found a rare Rafflesia hasseltii in a rainforest in West Sumatra.Indonesian botanist Septian Andriki and University of Oxford Botanic Garden deputy director Chris Thorogood trekked through dense rainforest in Indonesia for almost a day in search of the rare flora, which has not been seen in the wild for more than a decade.Mr Andriki broke down in tears upon their discovery, telling the BBC that it had been \"13 years of waiting\".Courtesy of BBC Indonesian.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Watch: Moment researcher finds rare flower after 13-year search",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/eb8f/live/95fc1340-cab2-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-26T06:58:20.000Z",
      "dateModified": "2025-11-26T06:58:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Delhi pollution: Children are hit hardest by toxic air in Indian capital",
    "url": "https://www.bbc.com/news/articles/cx23lyp2dmeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f281/live/934173f0-c8ed-11f0-bd6f-997d9323e7f8.jpg",
    "tag": "World",
    "date": "2025-11-27T01:02:03.000Z",
    "description": "'I panic every time she coughs' - Delhi's toxic air is making its children sick7 hours agoNikita Yadav,Vikas PandeyandNikhil Inamdar,in DelhiAFP via G",
    "body": "'I panic every time she coughs' - Delhi's toxic air is making its children sick7 hours agoNikita Yadav,Vikas PandeyandNikhil Inamdar,in DelhiAFP via Getty ImagesHospitals in Delhi have seen an influx of children complaining of breathing difficultiesThe toxic haze shrouding the Indian capital, Delhi, spares no-one, but its children are counting the biggest cost of the city's worsening and recurrent pollution problem. Nowhere is this more evident than at paediatricians' clinics. The BBC visited one such facility in Noida, near Delhi, on a weekday morning a few days back. In a packed waiting hall outside the doctor's consulting room, anxious parents stood in line with children sneezing, coughing or complaining of breathing difficulties. Most started falling ill in October, when the capital's air quality dipped to hazardous levels and waiting times for doctor's appointment had stretched longer than usual.Toxic air is a recurring problem in Delhi and across parts of northern India during the winter. There isn't a single cause behind the problem, but a mix of factors like low wind speeds, industrial emissions, vehicle exhaust, dropping temperatures and the seasonal burning of crop stubble in neighbouring states.Since the last month, Delhi's Air Quality Index (AQI) - which measures different types of pollutants, including the level of fine particulate matter PM2.5 that can clog lungs - has been hovering between 300 and 400. This is more than 20 times the limit recommended by the World Health Organization. Readings above 400 affect all healthy people and seriously impact those with existing diseases, but high exposure to PM2.5 hits children and the elderly the hardest.Across the capital, many hospitals have seen an influx of children who are sick because of the unbreathable air.\"These particles can affect the child's immunity, especially because their system is still developing and the cells are learning an immune response in the early years,\" Dr Shishir Bhatnagar, the paediatrician at the Noida clinic, told the BBC.\"These cases have increased tenfold in recent years. In my experience, if I normally see an average 20-30% of patients with such complaints, that number shoots up to 50-70% during the pollution season.\" Each year, the government rolls out emergency steps - halting construction, banning polluting vehicles - to curb the smog. This year, it even tried cloud seeding to trigger artificial rain, without success.But none of it has helped ease the pollution crisis that sparks anxiety among the city's 20 million people - particularly among parents of young children. NurPhoto via Getty ImagesHigh exposure to PM2.5 - or fine particulate matter - hits children the hardestKhushboo Bharti, 31, says she shudders every time she remembers the night of 13 November, when she had to rush her one-year-old daughter Samaira to the emergency.\"I remember her waking up with a violent cough that made her vomit several times,\" Ms Bharti says.She tried the usual home remedies, but nothing worked. Eventually, she took the baby to the hospital in the middle of the night. \"On the way there, Samaira didn't react to anyone or anything. It was very unlike her, she is a bubbly child. She wouldn't even lift her head. It was the worst moment of my life.\"At the hospital, the toddler was treated with strong steroid nebulisation and was on oxygen support for two days. She was later diagnosed with pneumonia.Since then, Ms Bharti is constantly on the edge. \"Even if she coughs just a few times, I panic.\"Samaira has now recovered, but other parents like Gopal*, who had to take his two-year-old daughter Renu* to a government hospital last week because of chest congestion, fear that the lethal air may have caused irrevocable damage to their children's health. \"Doctors told me she might have to be on inhalers for some time,\" Gopal told the BBC. Research over the years has highlighted the devastating impact air pollution is having on young children across the world - leading to stunted development, weaker immunity and lower cognitive ability. A recent study from the University of Cambridge incorporating data from almost 30 million people has also found that exposure to certain pollutants is associated with a higher risk of developing various types of dementia, including Alzheimer's disease.These growing risks have made many parents like Ms Bharti consider moving out of Delhi. \"What is the point of living in a city where my daughter can't even breathe safely?\" she asks. \"My husband's business is in Delhi, so we can't drop everything and leave. But the moment we have a chance, we'll move.\" NurPhoto via Getty ImagesWomen and children protest against air pollution in DelhiFor now, Delhi has moved to limit children's exposure - postponing outdoor sports and shifting primary classes to hybrid mode.The relatively privileged will benefit from these, but for hundreds of thousands of economically disadvantaged children, born in working class families and living by the roadside or in shanty towns, \"the onslaught on their lungs is enormous\", Dr A Fathahudeen, a Kerala-based pulmonologist, told the BBC. Living in cramped homes also exposes them to greater pollution from cooking fuels, traffic and poor ventilation. And the toxic air outdoor makes things worse. \"These children are consistently exposed to high degrees of pollution so their lung defence systems are reduced. If you fail to treat such childhood infections, it can cause permanent damage to the lungs,\" says Dr Fathahudeen. He points out that several studies show how early childhood infections caused by the exposure of \"immature lungs\" to air pollution can lead to chronic obstructive airway disease in adulthood, similar to what's seen among smokers. Dr Fathahudeen says those who can should strictly keep their children indoors and make sure they are properly hydrated and wear N95 masks - which filter out 95% of the pollutants - when outdoors. But parents question how long can they keep children shut indoors. \"They're growing, they need space to play and while they do get brief moments in nature, we are now forced to stop them,\" said Seema*, a mother. \"They protest sometimes, but what choice do we have? We know how crucial physical activity is, but not at the cost of breathing this toxic air,\" she says. *Names have been changedFollow BBC News India on Instagram, YouTube, X and Facebook.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Delhi pollution: Children are hit hardest by toxic air in Indian capital",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f281/live/934173f0-c8ed-11f0-bd6f-997d9323e7f8.jpg"
      ],
      "datePublished": "2025-11-27T01:02:03.000Z",
      "dateModified": "2025-11-27T01:02:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]