[
  {
    "title": "Landslide in Indonesia's West Java kills seven, dozens missing",
    "url": "https://www.bbc.com/news/articles/c87r53y4dx0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1631/live/4ba68cc0-f8e9-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "World",
    "date": "2026-01-24T06:02:41.000Z",
    "description": "6 hours agoHarry SekulichBBCAt least seven people have died and more than 80 others are missing after a landslide hit Indonesia's West Java province, ",
    "body": "6 hours agoHarry SekulichBBCAt least seven people have died and more than 80 others are missing after a landslide hit Indonesia's West Java province, officials said.The landslide occurred in the West Bandung region, south-east of the capital Jakarta, following days of intense rainfall.More than thirty homes were destroyed after \"landslide material buried residential areas, causing fatalities and affecting local residents\", Indonesia's disaster mitigation agency said in a statement.Flooding, landslide and extreme weather alerts have also been issued for the broader region.The landslide hit the village of Pasirlangu around 02:30AM on Saturday (19:30 GMT).Two dozen people were evacuated safely from the affected region, according to Abdul Muhari, communication chief of the National Search Agency.Images shared by local news outlets showed homes buried under mud and debris.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Landslide in Indonesia's West Java kills seven, dozens missing",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1631/live/4ba68cc0-f8e9-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-24T06:02:41.000Z",
      "dateModified": "2026-01-24T06:02:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'A natural partner': US treasury secretary weighs in on Alberta separatism",
    "url": "https://www.bbc.com/news/articles/cy8ylqx0zw4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1ab7/live/8bdfe0c0-f8cb-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-24T03:20:10.000Z",
    "description": "US Treasury Secretary Scott Bessent has weighed in on a separatist movement in Alberta, saying the western Canadian province is a \"natural partner for",
    "body": "US Treasury Secretary Scott Bessent has weighed in on a separatist movement in Alberta, saying the western Canadian province is a \"natural partner for the US\". \"Alberta has a wealth of natural resources, but they won't let them build a pipeline to the Pacific,\" Bessent told an American right-wing commentator in an interview on Thursday. \"I think we should let them come down into the US, and Alberta is a natural partner for the US. They have great resources. The Albertans are very independent people.\" The top US official's comments come amid strained ties between US and Canada, and as signatures are being collected in the province seeking an independence referendum. In comments to conservative host Jack Posobiec, Bessent went on to say there is a \"rumour that they may have a referendum on whether they want to stay in Canada or not\". A group in Alberta has until May to collect at least 178,000 signatures - or 10% of eligible voters - for a referendum campaign. Asked about Bessent's remarks on Friday, federal Finance Minister Francois-Philippe Champagne said he'd tell him \"thanks but no thanks, we will do our own things\".He said Canadians are \"able to develop our natural resources at home\" and pointed to a deal recently inked by Prime Minister Mark Carney with Alberta that opens the door for an oil pipeline to the Pacific. It's a project long pushed for by Canada's oil heartland but one which faces significant hurdles.A spokesman for Alberta Premier Danielle Smith said in a statement to the BBC that the province supports new pipelines \"west, east, north, and south, and we will continue to work with our US partners on building more pipeline capacity to US markets\". \"But the premier also believes the overwhelming majority of Albertans are not interested in becoming a US state\".Late last year over 430,000 signatures were gathered for a petition calling for a united Canada to counter the separatist push, and polls indicate a majority of Albertans want to stay in Canada. Many supporters of separatism have also told media they are seeking independence from Canada - not to join the US. Mitch Sylvestre, who is spearheading the referendum petition, told the CBC on Friday he doesn't think anyone in his movement is eyeing the US.He said he thought Bessent's comment on Alberta and the US being \"natural partners\" was obvious given the energy trade between them.Still, some organisers of the movement have said they have travelled to Washington to meet officials from the Trump administration.Meanwhile, trade talks between the US and Canada are on ice, and President Donald Trump has expressed irritation with the prime minister over a blunt speech he delivered at the World Economic Forum in Davos calling out \"great powers\" for weaponising their economic might.Trump responded in his own speech with: \"Canada lives because of the United States. Remember that, Mark, the next time you make your statements.\"Other US officials have also criticised Carney's speech, including Commerce Secretary Howard Lutnick, who this week accused Canada of being \"arrogant\" and Carney of pandering to a domestic audience by adopting an anti-US stance.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'A natural partner': US treasury secretary weighs in on Alberta separatism",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1ab7/live/8bdfe0c0-f8cb-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-24T03:20:10.000Z",
      "dateModified": "2026-01-24T03:20:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Iran protests: Eyewitness tells of people getting shot",
    "url": "https://www.bbc.com/news/articles/c9dvvzzpwylo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/509c/live/71c5cbf0-f86c-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-23T15:33:01.000Z",
    "description": "'I saw people getting shot': Eyewitness tells of Iran protest crackdown21 hours agoSoroush PakzadParniaParnia was visiting family in Isfahan when the ",
    "body": "'I saw people getting shot': Eyewitness tells of Iran protest crackdown21 hours agoSoroush PakzadParniaParnia was visiting family in Isfahan when the protests beganWarning: This story contains details which some readers might find distressing.An Iranian woman who witnessed the bloody crackdown on protests in Iran has described how her neighbourhood turned into a \"war zone\" as security forces opened fire at crowds with live ammunition.A government-imposed internet blackout in Iran, now in its third week, has prevented many accounts of what has happened from reaching the wider world.But some Iranians who have left the country have been able to share what they have seen.Parnia, who lives in London, told the BBC that she was visiting her family in the central city of Isfahan when the protests broke out in the capital, Tehran. They quickly spread across the country, and within days there were hundreds of protesters in the Hakim Nezami and Khaghani neighbourhoods of Isfahan.\"There were women and men from seven to 70 years old,\" she said. \"On just one street there were 200 to 300 people. People were chanting 'Death to the dictator' and 'Long live the shah'.\" The \"dictator\" was Iran's Supreme Leader Ayatollah Ali Khamenei, and the shah a reference to Iran's late last monarch, overthrown in the 1979 Islamic revolution, and his son, the exiled Crown Prince Reza Pahlavi.Isfahan has seen protests and crackdowns down the years. But Parnia said she had never seen anything like what happened during the recent unrest, which was sparked by anger over the collapse of the Iranian currency.First, security forces fired tear gas at the protesters, she said. Then they formed a line and fired birdshot.\"I saw people getting shot and falling down, and I saw blood on the street.\"Parnia said she ran away down alleyways and was suddenly pulled into an apartment block by a woman. Inside, she said, were many injured protesters.\"I saw the lobby floor covered in blood, and I saw a girl whose leg was full of pellets.\"Videos verified by the BBC from that night show large numbers of people in the streets in Isfahan. Some streets were blocked by traffic sign poles and large metal sheets, in an apparent effort by protesters to protect themselves from gunfire.Footage also showed protesters breaking through the gates of the building of the national broadcaster Irib, which was later set on fire.Phone footageThe building of the state broadcaster in Isfahan was set on fireOn Friday morning, 9 January, Khamenei said Iran would not back down from dealing with what he called \"destructive elements\", a day after US President Donald Trump had threatened to hit Iran \"very hard\" if authorities started killing people.Following Khamenei's speech, the powerful Revolutionary Guards sent a text message to people across Iran, telling them to avoid gatherings on streets in areas of unrest. The messages also warned against co-operating with what it described as \"terrorist mercenaries\" - an act it said would constitute treason.Despite the risks, Parnia went out to protest again on Friday evening.\"The protesters were hopeful,\" she said. \"You could see fear on everyone's faces. We were afraid to pass in front of the security forces and come closer together,\" she said.\"We thought even if we get killed, it would be a reason for Trump to act faster.\"Footage obtained by the BBC from the previous day shows large crowds on main streets in Parnia's neighbourhood. But she said on the Friday it was different.Phone footageHundreds of people gathered on the streets of Isfahan to protest\"Protesters were in small groups gathered in alleyways. Every time that someone tried to gather in the larger street, we could hear live fire sound followed by screams and shouts.\"Because of the internet blackouts, and protesters avoiding taking their phones with them, the BBC has not yet obtained footage from Friday night.Parnia also described a scene of \"total chaos\" at a local clinic that was treating wounded protesters.\"No phone lines were working. Nobody could call their families, and many refused to go to hospitals, fearing they could be arrested there,\" she said. \"All the nurses could do was clean the wounds and send them home. The next day you could still smell the tear gasses in the air. Security forces were present and there were checkpoints across the city.\"Parnia left Isfahan that same day and travelled to the capital, Tehran, to catch a flight back to London.\"I arrived in Tehran at 6pm. All the shops were closed and many people gathered in the streets. At 8pm everyone started to chant and I could hear gunshots,\" she said.\"The airport was so busy. Many foreign airlines were cancelled and people were frustrated. Luckily, I found an Iranian flight to leave.\"Since her return to the UK, Parnia has been in touch with her friends in Isfahan.She said she learned from a source that doctors at Feiz eye hospital in Isfahan had carried out around 300 surgical procedures to remove the eyes of patients with birdshot-related facial injuries.\"Every time you go out into the streets, you see random people with eye patches,\" Parnia's friends told her.According to several health workers who spoke to the BBC, hospitals are monitored and controlled by security forces, and people with gunshot wounds in Isfahan are being arrested.\"Many of the injured are developing infections. Some doctors are referring them to surgeons who can treat them in private clinics,\" Parnia's cited her friends as saying.While Iranian authorities have said around 3,000 people were killed during the protests, US-based human rights group HRANA has so far confirmed more than 4,600 deaths, with another 9,700 cases still under review. According to the group, at least 7,300 people have also sustained serious injuries. Many believe the true figures may be even higher.Parnia said she was now preparing to join Iranian opposition protests in the UK, saying she wants to be a voice for the silenced protesters.She also expressed anger at international media reports suggesting that Iranians and the country's political opposition was not united.\"Iranians have shown what they want in the streets and paid a high price for it.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iran protests: Eyewitness tells of people getting shot",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/509c/live/71c5cbf0-f86c-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-23T15:33:01.000Z",
      "dateModified": "2026-01-23T15:33:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Boy, 12, dies from injuries after Sydney shark attack",
    "url": "https://www.bbc.com/news/articles/c2k98ql703no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d2a3/live/77e07e20-f8dc-11f0-b385-5f48925de19a.jpg",
    "tag": "World",
    "date": "2026-01-24T05:10:24.000Z",
    "description": "7 hours agoKaty Watson,Australia correspondentandHarry SekulichA young boy who was bitten by a shark in Sydney Harbour last week has died in hospital.",
    "body": "7 hours agoKaty Watson,Australia correspondentandHarry SekulichA young boy who was bitten by a shark in Sydney Harbour last week has died in hospital. Twelve-year-old Nico Antic had been jumping off a rock ledge with friends on 18 January when he was attacked by what authorities suspected was a bull shark.\"We are heartbroken to share that our son, Nico has passed away,\" his parents Lorena and Juan said in a statement. The incident was one of four reported shark attacks along the New South Wales coast over two days.\"Nico was a happy, friendly, and sporty young boy with the most kind and generous spirit. He was always full of life and that's how we'll remember him,\" his family, who were originally from Argentina, added.Nico's friends were praised for their bravery after jumping into the water to help him after he was attacked last Sunday afternoon.However he suffered serious leg injuries and was taken to Sydney Children's Hospital in a critical condition. He was placed in an induced coma after undergoing surgery.An online fundraiser set up for Nico's family has raised $240,000 (£121,308).There has been a spate of reported shark attacks along Australia's east coast in the past week, three of them in Sydney. On Monday, a surfer on Sydney's northern beaches escaped a lurking shark without physical injury, while hours later a 27-year-old man suffered \"life-changing\" injuries in a shark attack at a nearby beach. One day later, a man on the Mid North Coast of New South Wales was pulled from the water after surviving a shark bite.The man, 39, sustained a chest wound and was taken to hospital. The attacks followed several days of heavy rain, which experts say created a \"perfect storm\" of conditions for bull sharks who prefer murky water. They also say rain flushes nutrients into the water, which can draw sharks closer to shore.Beaches across Sydney were closed to protect the public until weather improved, many of which have reopened for the Australia Day public holiday long weekend.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Boy, 12, dies from injuries after Sydney shark attack",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d2a3/live/77e07e20-f8dc-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-24T05:10:24.000Z",
      "dateModified": "2026-01-24T05:10:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pentagon to offer 'more limited' support to US allies",
    "url": "https://www.bbc.com/news/articles/cj9r8ezym3ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ebca/live/3fb6e610-f8dc-11f0-8902-65b5cd997fa5.jpg",
    "tag": "World",
    "date": "2026-01-24T07:57:00.000Z",
    "description": "Pentagon to offer 'more limited' support to US allies in defence strategy shift4 hours agoClaire KeenanReutersHomeland security is the top priority in",
    "body": "Pentagon to offer 'more limited' support to US allies in defence strategy shift4 hours agoClaire KeenanReutersHomeland security is the top priority in the Pentagon's new National Defense StrategyThe US will offer \"more limited\" support to allies, according to the Pentagon's new National Defense Strategy.In a significant shift to its security priorities, the US Department of Defense now considers security of the US homeland and Western Hemisphere - not China - as its primary concern.Previous versions of the strategy -  published every four years - named the threat posed by China as the top defence priority. Relations with China will now be approached through \"strength, not confrontation\", the report says.The defence strategy reinforces recent calls from President Donald Trump, including for greater \"burden-sharing\" from allies in countering threats posed by Russia and North Korea.The new 34-page report follows last year's publication of the US National Security Strategy, which said Europe faced civilisational collapse and did not cast Russia as a threat to the US. At the time, Moscow said the document was \"largely consistent\" with its vision.By comparison, in 2018, the Pentagon described \"revisionist powers\", such as China and Russia, as the \"central challenge\" to US security.The new strategy calls on American allies to step up, saying partners have been \"content\" to let Washington subsidise their defence, although it denies the shift signals a US move towards \"isolationism\".\"To the contrary, it means a focused and genuinely strategic approach to the threats our nation faces,\" it says.Washington has long neglected the \"concrete interests\" of Americans, the report says, adding the US does not want to conflate American interests \"with those of the rest of the world – that a threat to a person halfway around the world is the same as to an American.\"Instead, it says allies, especially Europe, \"will take the lead against threats that are less severe for us but more so for them\". Russia, which launched a full-scale invasion of Ukraine nearly four years ago, is described as a \"persistent but manageable threat to NATO's eastern members\".Unlike in previous versions of the strategy, Taiwan, the self-governing island claimed by China, is not mentioned. However, the document does write that the US aims to \"prevent anyone, including China, from being able to dominate us or our allies\".Late last year, the US announced a vast arms sale to Taiwan worth $11bn (£8.2bn), leading China to hold military drills around the island in response.The strategy also outlines a \"more limited\" role for US deterrence of North Korea. South Korea is \"capable of taking primary responsibility\" for the task, it adds. In the 12 months since Trump began his second term as president, the US has seized Venezuelan President Nicolás Maduro, carried out strikes against alleged drug boats in the eastern Pacific and Caribbean, and more recently, applied pressure on US allies to acquire Greenland. The strategy reiterates that the Pentagon \"will guarantee US military and commercial access to key terrain, especially the Panama Canal, Gulf of America, and Greenland\".The document says the Trump administration's approach will be \"fundamentally different from the grandiose strategies of the past post–Cold War administrations\". It adds: \"Out with utopian idealism; in with hardnosed realism.\"At the World Economic Forum earlier this week, Trump claimed the US had \"never gotten anything\" from Nato and \"we've never asked for anything\".He further criticised the organisation, incorrectly claiming \"the United States was paying for virtually 100% of Nato\".Canadian Prime Minister Mark Carney said the old world order is \"not coming back\" and urged fellow middle powers - like South Korea, Canada and Australia - to come together. \"Middle powers must act together because if we're not at the table, we're on the menu,\" Carney said at the Davos meeting. That came as French President Emmanuel Macron also warned of a \"shift towards a world without rules\". ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pentagon to offer 'more limited' support to US allies",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ebca/live/3fb6e610-f8dc-11f0-8902-65b5cd997fa5.jpg"
      ],
      "datePublished": "2026-01-24T07:57:00.000Z",
      "dateModified": "2026-01-24T07:57:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TikTok US venture to collect precise user location data",
    "url": "https://www.bbc.com/news/articles/cvgnj7v2rr5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/84a7/live/bf04a0d0-f8c6-11f0-9647-8187f9f2760e.jpg",
    "tag": "World",
    "date": "2026-01-24T03:06:29.000Z",
    "description": "9 hours agoLily JamaliNorth America Technology correspondent, San FranciscoTikTok's new US joint venture has made changes to its privacy policy that i",
    "body": "9 hours agoLily JamaliNorth America Technology correspondent, San FranciscoTikTok's new US joint venture has made changes to its privacy policy that include expanding the type of location data the company can collect from its 200 million American users.The new policy was published after investors closed a deal with TikTok's Chinese owner ByteDance on Thursday to run the popular short-form video app's business in the US.The new joint venture said in its updated privacy terms that it may now \"collect precise location data, depending on your settings\" -  a change from the previous policy which allowed for the collection of \"approximate\" location data.TikTok did not immediately respond to the BBC's request for comment on the change. The company policy added that the sensitive personal information would be processed \"in accordance with applicable law\" and that users can turn off location services in their device settings at any time.Even before the new venture was established, TikTok collected location information based on a user's SIM card or IP address, or both.But it stopped short of collecting even approximate GPS information from American users operating the most updated version of the app, according to a 2024 version of its privacy policy.Precise location sharing hasn't yet been enabled in the US, where it is expected to be optional and turned off by default so users will be asked to opt in with a pop-up message. TikTok has not said when the update is due to reach American users.TikTok already collects similar data from users in the UK and Europe as part of a new \"Nearby Feed\" feature that lets users find events and businesses near them.The new American TikTok joint venture is also extending its permissions for gathering information about users interactions with TikTok's artificial intelligence (AI) tools.This includes prompts and questions submitted by users, as well as information about how, when, and where AI content was prompted or created.TikTok USDS Joint Venture LLC is comprised of three managing investors including cloud computing giant Oracle, which is investing heavily in AI infrastructure and has taken on significant debt to finance its ambitions in the burgeoning space.Oracle is chaired by Larry Ellison, a Republican megadonor and longtime ally of US President Donald Trump, whose administration helped broker the US TikTok deal.The agreement follows years of tussling between Washington and Beijing that began in Trump's first presidential term, when he tried unsuccessfully to ban the app over national security concerns.In 2024, the US passed a law that required the platform to be banned in the US by January 2025 if ByteDance failed to sell its US operations to American investors.Trump repeatedly postponed the enforcement of legislation until the joint venture was finalised this week.The 2024 law was prompted in part by concerns about the possibility that Beijing might access the data of TikTok's American users.In a statement onThursday, the new joint venture said its mandate was \"to secure U.S. user data, apps and the algorithm through comprehensive data privacy and cybersecurity measures\".Oracle will oversee the retraining of TikTok's powerful content recommendation algorithm on existing American user data, the joint venture said in its statement, adding that the algorithm \"will be secured in Oracle's U.S. cloud environment.\"ByteDance retains a minority stake just shy of 20% in the joint venture.Other managing investors include the US tech investment firm Silver Lake and Abu-Dhabi state-owned investment fund MGX, which has done business with the Trump family's crypto venture World Liberty Financial.On Friday, Republican Representative John Moolenaar, who chairs the House Select Committee on China, expressed concern about ByteDance's ongoing involvement in TikTok's US operations.\"Does this deal ensure China does not have influence over the algorithm? Can the parties involved assure Americans their data is secure?\" he said in a statement. \"Those are questions that need to be answered as the Select Committee does oversight of this deal.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TikTok US venture to collect precise user location data",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/84a7/live/bf04a0d0-f8c6-11f0-9647-8187f9f2760e.jpg"
      ],
      "datePublished": "2026-01-24T03:06:29.000Z",
      "dateModified": "2026-01-24T03:06:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New Zealand calls off rescue efforts for six missing after landslide",
    "url": "https://www.bbc.com/news/articles/c050vnl7p10o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/df25/live/7f6f15a0-f8de-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "World",
    "date": "2026-01-24T06:34:24.000Z",
    "description": "6 hours agoClaire KeenanReutersPolice say they are not expecting to find any more survivors from the landslide Rescue efforts for six missing people b",
    "body": "6 hours agoClaire KeenanReutersPolice say they are not expecting to find any more survivors from the landslide Rescue efforts for six missing people buried by a landslide in New Zealand on Thursday have been called off, with efforts now moving to recovering bodies, police have said. \"Tragically it is now apparent that we will not be able to bring them home alive,\" Anderson said, adding that formal identification is underway. Two teenagers are among those who remain unaccounted for, with the youngest aged 15 years old. Search teams located human remains beneath dirt and debris on Friday evening,  Police Superintendent Tim Anderson said, after a landslide hit a popular campsite in Mount Maunganui. \"This is heartbreaking news for the families and the dozens of people who have been working day and night, hoping for a positive outcome,\" Anderson said. In a separate incident, two people died - a grandmother and her grandchild - in a different landslide at Welcome Bay, nearby Mount Maunganui, public service broadcaster Radio New Zealand (RNZ) reported. Heavy rain has fallen on New Zealand's North Island for days, with more wet weather forecast for the area over the weekend.Police said conditions have added to the difficulty of rescue efforts, and described the scene at Mount Maunganui as \"incredibly challenging... to work through\". Watch: Footage captures moment landslide starts in Mount Maunganui in New ZealandFire and emergency services worked through the night to locate those unaccounted for at the campsite before the operation was formally handed over to police on Saturday. The safety of workers on the ground is of \"upmost importance\", Anderson said. Police have confirmed the names of the six individuals unaccounted for as Lisa Anne Maclennan, 50, from Morrinsville, Måns Loke Bernhardsson, 20, from Sweden, Jacqualine Suzanne Wheeler, 71, from Rotorua, and Susan Doreen Knowles, 71, from Ngongotaha. The youngest victims have been identified by police as Sharon Maccanico, 15, from Auckland and Max Furse-Kee, 15, from Auckland. ReutersMembers of the public lay floral tributes at scene of the landslide in Mount MaunganuiChief Coroner Judge Anna Tutton confirmed the identification process is underway, but warned it would likely be \"complex\" and \"painstaking\". \"We will work very carefully - and as quickly as we can - to reunite families,\" she said. Prime Minister Christopher Luxon visited the site on Friday. He said it was \"inspiring\" to see the show of community support as locals helped clear debris in flood-hit areas. Mount Maunganui is a sacred Māori site and one of the most popular campgrounds in New Zealand. It has been repeatedly hit by landslides in recent years.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New Zealand calls off rescue efforts for six missing after landslide",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/df25/live/7f6f15a0-f8de-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-24T06:34:24.000Z",
      "dateModified": "2026-01-24T06:34:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alleged drug kingpin and ex-Olympian Ryan Wedding arrested",
    "url": "https://www.bbc.com/news/articles/cj0nd8z1z59o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d4b3/live/8e484db0-f8a9-11f0-b385-5f48925de19a.jpg",
    "tag": "World",
    "date": "2026-01-23T22:24:59.000Z",
    "description": "Alleged drug kingpin and ex-Olympian Ryan Wedding arrested after years on the run14 hours agoAna FaguyandMax MatzaWatch: Ryan Wedding escorted by poli",
    "body": "Alleged drug kingpin and ex-Olympian Ryan Wedding arrested after years on the run14 hours agoAna FaguyandMax MatzaWatch: Ryan Wedding escorted by police in handcuffs after arrestFormer Canadian Olympic snowboarder and alleged drug kingpin Ryan Wedding has been arrested in Mexico and will be extradited to the US after years on the run, FBI Director Kash Patel has said.Wedding, who had been on the FBI's Ten Most Wanted Fugitives list, is accused of running a transnational drug trafficking operation that moved tonnes of cocaine across international borders.Wedding, 44, was also wanted on murder charges. US officials had said they believed Wedding was living in Mexico under the Sinaloa drug cartel's protection.The head of Canada's federal police force, which assisted in the investigation, spoke alongside Patel on Friday to praise the law enforcement operation.\"No single agency or nation can combat transnational organised crime alone,\" said Mike Duheme, Commissioner of the Royal Canadian Mounted Police (RCMP). \"We can finally say that our communities, our countries, are much safer with the arrest of Ryan Wedding,\" he added.Wedding is expected to make his first court appearance in Los Angeles on Monday.FBIWedding, seen in an undated photo released by the FBIWedding is accused of running a vast drug trafficking operation responsible for importing some 60 metric tonnes of cocaine a year.The organisation operated across North America, as well as several countries in Latin America and the Caribbean, and was also the largest supplier of cocaine to Canada, bringing in an estimated $1bn a year. Before he was arrested, Wedding was accused of killing a federal witness in a case against him. Officials say he has also ordered the murders of several others.Wedding is now facing a slew of felony charges, including witness tampering and intimidation, murder, money laundering and drug trafficking.The FBI had previously placed a $15m (£11m) reward for information leading to his arrest. Patel declined to comment on whether anyone would be claiming the reward money.US officials have released limited details regarding how Wedding was captured, except to say that his arrest took place on Thursday night in Mexico City. Mexico's top security official, Omar García Harfuch, said in a post on X that Patel had visited Mexico City on Thursday, and departed with two fugitives on the FBI's 10 Most Wanted list. He did not name the men arrested, but said one was a \"Canadian citizen who voluntarily surrendered\" at the US embassy in Mexico. Watch: FBI director calls Ryan Wedding \"a modern day Pablo Escobar\"The Associated Press, citing an unnamed Mexican Security Cabinet member,  reported that Wedding is the Canadian who turned himself in at the US embassy. In his remarks at a news conference, Patel described Wedding as a \"modern-day Pablo Escobar\", referring to the Colombian cartel leader. US officials have also compared him to Mexican drug dealer Joaquín \"El Chapo\" Guzmán.\"When you go after a guy like Ryan Wedding, it takes a united front,\" Patel said, thanking Canadian and Mexican authorities for their help in the investigation.Patel also thanked the FBI Hostage Rescue Team, who participated in taking Wedding into custody.In an interview with Vanity Fair, Patel praised the team, which had also been involved in the capture of Venezuelan President Nicholas Maduro weeks earlier.\"This was a complex, high-stakes operation with zero margin for error,\" Patel told the magazine. \"I was on the ground with our team in Mexico and witnessed extraordinary teamwork, precision, and trust between our agents and partners in Mexico.\"Wedding's aliases include \"El Jefe,\" \"Giant,\" \"Public Enemy,\" \"James Conrad King,\" and \"Jesse King\", the FBI said. He has reportedly had plastic surgery to change his appearance while on the run.Officials allege that he launched his criminal enterprise following his release from a US federal prison in 2011, where he was serving a sentence for cocaine distribution.Authorities allege he has ordered dozens of murders across the globe, including in the US, Canada and Latin America.Getty ImagesThe FBI had offered a $15m reward for Ryan WeddingOfficials say he had been living in luxury in Mexico. In December, Mexican authorities announced that they had seized $40m in racing motorcycles owned by Wedding. They also seized other valuable items, including luxury paintings, artworks, drugs and two Olympic gold medals.It is unclear to whom the medals belong. Wedding competed for Canada in the 2002 Olympic Games in Salt Lake City, but did not win any medals. He came in 24th place in the men's giant parallel slalom ski event.In November, the FBI seized his rare 2002 Mercedes CLK-GTR, which had been valued at $13m.Patel also spoke about the recent arrest of another man in Mexico who had been on the FBI's most wanted list. American man Alejandro Castillo was wanted for the murder of his ex-girlfriend. According to the FBI, he has been in hiding in Mexico for nearly 10 years, and will now be extradited back to North Carolina for trial. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alleged drug kingpin and ex-Olympian Ryan Wedding arrested",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d4b3/live/8e484db0-f8a9-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-23T22:24:59.000Z",
      "dateModified": "2026-01-23T22:24:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ukraine condemns 'brutal' Russian strikes ahead of second day of peace talks  ",
    "url": "https://www.bbc.com/news/articles/cwyr6p30054o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2200/live/7b09f080-f90f-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-24T08:48:40.000Z",
    "description": "Ukraine has condemned a fresh wave of Russian strikes overnight which killed one person and injured 23 others, as talks with the US aimed at ending th",
    "body": "Ukraine has condemned a fresh wave of Russian strikes overnight which killed one person and injured 23 others, as talks with the US aimed at ending the war are set to resume.Ukraine's Foreign Minister Andrii Sybiha said the \"brutal\" attack - \"cynically\" ordered by Russian leader Vladimir Putin - had \"hit not only our people, but also the negotiation table\".Delegations from Russia, Ukraine and the US have been meeting in Abu Dhabi for the first trilateral talks since the Kremlin launched a full-scale invasion of its neighbour in 2022.A source told the BBC that some progress had been made but the key issue of territory remains unresolved.The mayor of Ukrainian capital Kyiv said one person had died and four had been wounded while Kharkiv's mayor reported that 19 people had been hurt during a sustained assault on the city in the early hours of Saturday morning.On the second day of the three-way talks in Abu Dhabi, Sybiha said the \"barbaric\" overnight assault proved  \"that Putin's place is not at the board of peace, but at the dock of the special tribunal\".US President Donald Trump said last week that Putin had accepted an invitation to join his Board of Peace - an organisation focused on ending global conflicts. Putin has not confirmed this. Kyiv's mayor Vitali Klitschko said on Telegram that three of the four people who had been injured had been hospitalised.He added that the capital's critical infrastructure had been damaged, leaving 6,000 buildings without heating.Temperatures have fallen to around -12C in parts of Ukraine. In a statement following the assaults, President Volodymyr Zelensky said: \"The main target of the Russians was the energy infrastructure.\"Last week, Russia attacked Kyiv's power infrastructure, forcing Zelensky to initially call off his trip to the World Economic Forum in Davos, Switzerland.  In Kharkiv, Mayor Ihor Terekhov said 19 people had been injured during the strikes in the early hours of Saturday morning. A maternity hospital and a hostel for displaced people were damaged.Russia occupies roughly 20% of Ukraine, including parts of the eastern Donbas region. The Kremlin wants Ukraine to hand over large areas of the territory, but Ukraine has ruled this out.In Davos, Zelensky said: \"It's all about the land. This is the issue which is not solved yet.\"He said that he had reached an agreement with Trump on future US security guarantees for Ukraine in the event of a deal.He gave no detail but said it would need to go before US Congress and the Ukrainian parliament before signing.Global News Podcast: Can Ukraine get peace without losing land?The day before the talks in Abu Dhabi began, US special envoy Steve Witkoff and Trump's son-in-law Jared Kushner met with Putin in Moscow. After the four-hour meeting, Kremlin aide Yury Ushakov said: \"Vladimir Putin has emphasised Russia's sincere commitment to settling the Ukraine crisis by political and diplomatic means.\"But he said \"bringing about a lasting settlement would be unlikely without addressing the territorial issue based on the formula as agreed in Anchorage\".Last August, Trump and Putin met in Anchorage, Alaska to discuss ending the war, resulting in an agreement to allow Russia to take the Donbas region and keep control of the Crimean peninsula, which it allegally annexed in 2014.Zelensky ruled out giving up the Donbas which is made up of Luhansk and Donetsk and has been partly occupied by Russia for 12 years.Following the first day of talks in Abu Dhabi, Rustem Umerov, who is leading the Ukrainian delegation, said on social media: \"The meeting focused on the parameters for ending Russia's war and the further logic of the negotiation process aimed at advancing toward a dignified and lasting peace.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ukraine condemns 'brutal' Russian strikes ahead of second day of peace talks  ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2200/live/7b09f080-f90f-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-24T08:48:40.000Z",
      "dateModified": "2026-01-24T08:48:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nelson Mandela's personal items can be sold after daughter wins South Africa court battle",
    "url": "https://www.bbc.com/news/articles/cp822g353y6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/204a/live/eabd0df0-f83c-11f0-9942-9d94373efa41.jpg",
    "tag": "World",
    "date": "2026-01-23T12:16:21.000Z",
    "description": "Mandela's prison key, sunglasses and shirt can be sold after daughter wins court battleA South African court has dismissed an appeal by the country's ",
    "body": "Mandela's prison key, sunglasses and shirt can be sold after daughter wins court battleA South African court has dismissed an appeal by the country's heritage body to stop the sale and export of various artefacts connected to anti-apartheid hero Nelson Mandela.The 70 personal items include a cell key from Robben Island, where Mandela was imprisoned for 18 of the 27 years he was locked up, a pair of Aviator sunglasses and one of his signature floral shirts. They were due to be exported to the US for auction.The objects belong to his eldest daughter, Makaziwe Mandela and Christo Brand, a Robben Island warden during Mandela's incarceration. In trying to stop their sale, the authorities said they were part of the country's heritage and were therefore legally protected from export.The South African Heritage Resources Agency (Sahra) first found out about the potential sale in a British newspaper article from late 2021, claiming that the key would go for more than £1m ($1.35m).The agency then wrote to the US auction house, Guernsey, that was planning the sale to ask it to suspend the auction and return the assets to South Africa.Other items in the lot were a copy of the 1996 South African Constitution personally signed by Mandela, one of his charcoal drawings, an ID card, a tennis racquet he used on Robben Island and gifts from world leaders, including one from former US President Barack Obama and his wife Michelle.Mandela's daughter wanted to use the proceeds from the sale to build a memorial garden at the late former president's grave in Qunu, in Mthatha, Eastern Cape province.In its ruling, the Supreme Court of Appeal argued that Sahra's interpretation of what items fell under the National Heritage Resources Act was overly broad.The ruling also states that whereas Makaziwe and Brand explained in detail why their respective assets were not heritage objects, Sahra made no attempt to explain on what grounds it believed they were.It is not yet clear whether the authorities will seek other legal avenues to block the sale. The BBC has contacted the sport, arts and culture department for comment.Makaziwe, Mandela's only daughter with his first wife, welcomed the Supreme Court's judgment, blasting the heritage agency for presuming \"to know my father's last wishes better than those who were beside him at the end - his family\".\"Nobody is more invested in ensuring Tata's [Mandela's] legacy endures in the way he would want to be remembered than those who carry his name,\" she said.She added that no decision had yet been made on what would happen to the items meant to go on auction.Some supporters of the government's position argued that items connected to Mandela should not be sold or exported but instead kept in South Africa for future generations.Others believe that Mandela's family should decide what happens to the objects.Mandela died in 2013 at the age of 95. He led the African National Congress in its struggle against apartheid - a system of legally enforced racism - and was released from prison in 1990.He was awarded the Nobel Peace Prize in 1993 along with then-President FW de Klerk.Mandela became South Africa's first democratically elected president in 1994.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nelson Mandela's personal items can be sold after daughter wins South Africa court battle",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/204a/live/eabd0df0-f83c-11f0-9942-9d94373efa41.jpg"
      ],
      "datePublished": "2026-01-23T12:16:21.000Z",
      "dateModified": "2026-01-23T12:16:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stuck between the US and Russia, Canada must prove it can defend its Arctic territory",
    "url": "https://www.bbc.com/news/articles/c9vx0p77pn8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3489/live/afa7c900-f87b-11f0-875b-85e16a28ee0c.jpg",
    "tag": "World",
    "date": "2026-01-24T00:05:27.000Z",
    "description": "12 hours agoBernd Debusmann Jrat the White HouseCanada's Arctic is a massive, treacherous, and largely inhospitable place, stretched out over nearly 4",
    "body": "12 hours agoBernd Debusmann Jrat the White HouseCanada's Arctic is a massive, treacherous, and largely inhospitable place, stretched out over nearly 4 million square kilometres of territory - but with a small population roughly equal to Blackburn in England or Syracuse, New York.\"You can take a map of continental Europe, put it on the Canadian Arctic, and there's room to spare,\" Pierre Leblanc, the former commander of the Canadian Forces Northern Area told the BBC. \"And that environment is extremely dangerous.\"Standing at the defence of that massive landmass is an aging string of early warning radars, eight staffed military bases and about 100 full-time Coast Guard personnel covering 162,000km of coast, about 60% of Canada's total oceanfront.The Arctic region is the scene of intense geopolitical competition, bordered by Russia and the US on either side of the North Pole - and increasingly attractive to China, which has declared itself a \"near Arctic state\" and vastly expanded its fleet of naval vessels and icebreakers. Standing in the middle is Canada, whose population is a small fraction of the larger Arctic players. Nearly four years after Arctic security was thrust into the headlines following Russia's invasion of Ukraine, the defence of Canada's far north has again been brought to the forefront of public consciousness by Donald Trump's designs on Greenland, a self-governing part of the Kingdom of Denmark that the White House says is vital to safeguarding the US from would-be enemies abroad.Canada's Arctic has not gone unnoticed by the Trump administration, which has reportedly become increasingly concerned by perceived vulnerabilities to US adversaries, and in April signed an executive order underscoring American \"commitment to ensuring both freedom of navigation and American domination in the Arctic waterways.\"The Canadian government, for its part, has sought to reassure the US and Nato allies that it is doing its part to protect the region.Speaking at the World Economic Forum in Davos, Prime Minister Mark Carney said that Canada is working to secure \"our shared objectives of security and prosperity in the Arctic\" through \"unprecedented\" investments in radar systems, submarines, aircraft and \"boots on the ground\" in the region.Col Leblanc, who spent a total of nine years in the Canadian Arctic, said those investments have marked a \"major shift\" in Arctic security, noting that increases in Canadian defence expenditure  - from 2% to 5% of GDP by 2035 - have meant \"real action\" in terms of additional over-the-horizon radar and aircraft dedicated to the Arctic.Much of this focus, he added, has been prompted by the Trump administration's renewed focus on the Arctic and Greenland.\"[That] certainly helps the Canadian government move in the right direction,\" Leblanc added. Still, challenges persist, including limited port facilities and difficulties resupplying far-flung bases that are sometimes thousands of cold, empty miles apart.While Canada and other US Nato allies have opposed the Trump's administration bid to \"take over\" Greenland to protect the Arctic, several experts who spoke to the BBC agreed with the administration's broad assessment that the need for additional defences in the region are urgently needed.Troy Bouffard, the director of the Fairbanks, Alaska-based Center for Arctic Security and Resilience, said that while on-the-ground cooperation between the US and Canada in the Arctic \"remains the envy of the world\", much of the existing defence infrastructure was designed to combat Cold War-era threats, rather than existing ones.In particular, he warned of the prospect of hypersonic missiles that travel at least five times the speed of sound, making them much harder to detect and intercept than traditional ballistic missiles, which would follow predictable arcs over the North Pole.Such a threat is no longer theoretical. Russia has used hypersonic missiles in combat in Ukraine, including a January strike that saw the first operational use of the nuclear-capable \"Oreshnik\" missile that carries multiple warheads at approximately 10 times the speed of sound.\"That technology has changed everything for us. We have to relook at the entire North American defence system and re-do it,\" he said. \"What exists right now cannot defend against hypersonic cruise missiles, at all. Like 0%.\"Traditional ground-based radar systems, he added, \"are not going to work\" against these emerging technologies. Space-based satellites must also contend with coverage gaps in high latitudes, prompting a renewed focus and investments in over-the-horizon radar.Notably, over-the-horizon technology - along with space-based sensors - form a key part of the Trump administration's planned Golden Dome missile defence system for North America.For now, it is unclear what role Canada will play in the Golden Dome, a project Trump said at Davos Canada should \"be thankful for\".On Friday, Trump posted on Truth Social that Canada was opposed to having the Golden Dome over Greenland \"even though The Golden Dome would protect Canada. Instead, they voted in favor of doing business with China, who will 'eat them up' within the first year!\". The BBC has contacted Carney's office for comment.Those negotiations have been strained by the often antagonistic relationship between the US and Canada, with Trump in May posting that Canada could pay $61bn to join the programme or become the 51st US state and join for free.Trump's remarks prompted Canada's ambassador to the UN, Bob Rae, to compare it to a \"protection racket\". Despite tensions, Michael Byers, an expert in Arctic security at the University of British Columbia, said that American concerns over Arctic security, and their threats of tariffs, have helped prompt Canada's government to re-focus on the Arctic.\"Whether or not American concerns are justified, there is a feeling in Ottawa that we have to satisfy [them],\" he said. \"No one takes the 51st state issue seriously, but what we do take seriously are the economic pressures that the US is able to impose.\"\"The Canadian government is very aware of that possibility,\" he added.High level tensions between Ottawa and Washington, however, have yet to turn into tensions on-the-ground in the Arctic - with those there expressing confidence that the US and Canada are cooperating for the time being.\"That's the business of politicians,\" Bouffard said. \"It has complicated things, but the practitioners are still going to work together until they're not allowed to. Everyone's going to have to rise above the rhetoric.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stuck between the US and Russia, Canada must prove it can defend its Arctic territory",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3489/live/afa7c900-f87b-11f0-875b-85e16a28ee0c.jpg"
      ],
      "datePublished": "2026-01-24T00:05:27.000Z",
      "dateModified": "2026-01-24T00:05:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shark attacks: How Sydney's beaches became a 'perfect storm'",
    "url": "https://www.bbc.com/news/articles/c0err023g5lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b8c1/live/44a385f0-f843-11f0-8ab6-81a112385ec5.jpg",
    "tag": "World",
    "date": "2026-01-24T05:11:18.000Z",
    "description": "Four attacks in 48 hours: How east Australia's beaches became a 'perfect storm' for sharks7 hours agoGavin ButlerGetty ImagesThere are manifold reason",
    "body": "Four attacks in 48 hours: How east Australia's beaches became a 'perfect storm' for sharks7 hours agoGavin ButlerGetty ImagesThere are manifold reasons why recorded shark encounters are rising in Australia's oceans - but fatalities are relatively rareIt's \"extraordinary\", says shark researcher Chris Pepin-Neff: four shark bites within 48 hours, and three of them within a 15-kilometre stretch of Australia's east coast.On 18 January, a 12-year-old boy was taken to hospital with critical injuries and later died after being attacked while swimming in Sydney Harbour. The next day, an 11-year-old's surfboard was bitten at Dee Why beach, hours before a man was attacked at nearby Manly and taken to hospital in critical condition.Then, on 20 January, a fourth surfer \"sustained a wound to his chest\" after a shark bit his board some 300km (186 miles) up the coast.\"This is the closest - in both proximity and in time - series of shark bites that I've ever seen in my 20 years of research,\" says Pepin-Neff, who is an associate professor of public policy at the University of Sydney.The rapid spate of incidents triggered local and international alarm, with dozens of beaches closed amid fear of further attacks. Predictably, calls for shark culls have gathered momentum and volume.Experts, however, have cautioned against such measures, advocating instead for a greater awareness of shark behaviour and urging a rethink of humans' relationship to these fish.There are multiple factors that likely contributed to the recent spate of incidents, they say – and it's not the sharks that are the problem.Why suddenly so many shark attacks in Australia?Non-provoked shark attacks are usually precipitated by environmental conditions, attractants in the water, or both.The three recent incidents in Sydney - all of which are thought to have involved bull sharks – followed several days' worth of heavy rain, during which the city's official weather station recorded 127 millimetres of downpour within 24 hours – its wettest January day in 38 years.That rainfall would have created \"perfect conditions\" for bull sharks, according to Rebecca Olive, senior research fellow at RMIT University.\"Bull sharks thrive in warm, brackish water, which most other sharks flee,\" she told the BBC. \"They love river mouths and estuaries, so the freshwater that flooded off the land following the recent rain events was perfect for them.\"Olive and other experts further note that this freshwater would have likely flushed sewage and nutrients into the sea, thus drawing in bait fish and, in turn, sharks.\"There's clearly an attractant in the water,\" Pepin-Neff says, suggesting that a \"perfect storm\" of low salinity freshwater could have created a \"biodiversity explosion\".\"The bait fish come to the surface, the bull sharks come to the surface, everybody's in the near shore area – and now we have a problem.\"Are shark attacks increasing overall?Official statistics show that shark bite incidents in Australia have gradually increased over the past 30 years – rising from around eight to 10 per year in the 1990s, to yearly averages in the mid-20s from the 2010s onwards.That doesn't mean sharks are becoming more aggressive, though. More likely is that the higher numbers reflect better data collection, as well as a number of compounding human factors.These include a growing coastal population, an increased uptake of water sports and thicker wetsuits that allow swimmers to stay in the ocean for longer.\"The number of total encounters is definitely much higher than it was, just because the population of people who go in the water and do all these things is really high,\" Pepin-Neff explains.They also point out, however, that the rate of shark bites \"doesn't tick up at the amount it should for the proportion of people who are going in the water and doing more things\".Getty ImagesDozens of beaches were closed amid the recent spate of attacks on Australia's east coastOlive echoes this point, noting that \"given how many people use the ocean each day, incidents and attacks are relatively uncommon, and fatalities are even less common\".If it seems as though sharks are becoming more prolific or dangerous, Olive suggests this may just be a result of them being more visible to members of the community – whether because of better reporting systems, the proliferation of drone footage or the outsized attention that shark encounters receive from the media.Pepin-Neff adds that broad, imprecise language around encounters is likely fuelling fears and distorting people's understanding of the risk.When shark sightings, encounters and bites all get conflated under the catchall umbrella of an \"attack\", the danger seems greater than it is.\"There is a problem in being able to meaningfully describe what happened without using the words 'shark attack',\" they explain. \"And that creates a more emotional community experience that is slightly different to what actually happened.\"Do shark culls work?In the wake of Sydney's recent flurry of shark attacks, heightened fears have reinvigorated calls for a cull. Typically, this would involve using nets or baited drumlines to catch and kill sharks near popular beaches.Experts reject the suggestion.\"I can understand when there are calls for culls in response [to an attack]... but I'm strongly opposed to culling sharks in order that we can maintain an illusion of safety while surfing or swimming in the ocean,\" says Olive.Pepin-Neff, meanwhile, stresses that scientific research does not support shark culls as an effective method of reducing the danger of an attack.\"It just doesn't work,\" they say. \"It makes politicians feel better, and it makes activists feel better, and it makes nobody in the water any safer.\"In cases of shark encounters, they add, the variable is not the sharks themselves, but rather the attractant that's drawing them to the area.\"It doesn't matter if you kill all the sharks in Sydney Harbor – if there's a shark up the coast and the attractant is still in the water, then the shark's going to come in.\"How can people avoid shark attacks?Both Olive and Pepin-Neff suggest that the best way to minimise risk is to be more conscious and wary of the factors that exacerbate the likelihood of a shark encounter. On an individual level, this might mean avoiding swimming and surfing after heavy rain. For councils it might mean creating more shark enclosures where people can swim safely.More broadly, however, they emphasise the need for beach-goers to adopt a less idyllic and more pragmatic attitude towards the ocean.\"In Australia we've got to treat the beach like the bush,\" says Pepin-Neff. \"Australians know how to navigate the wild. We just need to reinforce that the ocean is still the wild.\"This will require a rethink not only of our relationship with the water, they add, but also our relationship with sharks.\"This idea that the ocean is always safe but the sharks are always dangerous – it's the opposite,\" they say. \"The ocean is never safe, and the sharks are not always dangerous.\"We're in the way, not on the menu.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shark attacks: How Sydney's beaches became a 'perfect storm'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b8c1/live/44a385f0-f843-11f0-8ab6-81a112385ec5.jpg"
      ],
      "datePublished": "2026-01-24T05:11:18.000Z",
      "dateModified": "2026-01-24T05:11:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Greenland: What natural resources does the island have?",
    "url": "https://www.bbc.com/news/articles/cly9230yw15o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ae80/live/c49ff570-f868-11f0-b385-5f48925de19a.jpg",
    "tag": "World",
    "date": "2026-01-23T12:39:51.000Z",
    "description": "Trump covets mineral-rich Greenland, but what natural resources does it actually have?24 hours agoArchie MitchellandDanielle Kaye,Business reportersGe",
    "body": "Trump covets mineral-rich Greenland, but what natural resources does it actually have?24 hours agoArchie MitchellandDanielle Kaye,Business reportersGetty ImagesDonald Trump has made clear he covets Greenland.Now he claims to have secured the \"framework\" of a future deal, to address defence on the island - a deal that he says includes rights to rare earth minerals.So what natural resources does Greenland have?Greenland is believed to sit on top of large reserves of oil and natural gas.It is also said to be home to the vast majority of raw materials considered crucial for electronics, green energy and other strategic and military technologies – to which Trump has been pushing to secure America's access.Overall, 25 of 34 minerals deemed \"critical raw materials\" by the European Commission are found in Greenland, including graphite, niobium and titanium, according to the 2023 Geological Survey of Denmark and Greenland.Greenland's strategic importance is \"not just about defence\", Senator Ted Cruz, a Republican from Texas, said at a Senate hearing last year about the potential acquisition of Greenland, pointing to the island's \"vast reserves of rare earth elements\".Trump has sometimes downplayed the importance of those resources, pointing to what he claims is rising Russian and Chinese influence in the region to justify his claims that the US has to \"have\" the island.\"I want Greenland for security - I don't want it for anything else,\" he told reporters at the World Economic Forum in Davos on Wednesday, pointing in part to the difficulty of exploring in the Arctic region. \"You have to go 25ft down through ice to get it. It's not, it's not something that a lot of people are going to do or want to do.\"But access to the island's natural resources have loomed large in the background for the administration, which has put the US economy at the centre of its geopolitical vision and has made combatting China's dominance of the rare earths industry a priority.   Trump's interest in controlling Greenland is \"primarily about access to those resources, and blocking China's access\", according to Steven Lamy, professor of international relations at the University of Southern California.Even before Trump's second term, the US had been tightening its ties with Greenland, including by reopening its consulate in the island's capital, Nuuk, in 2020, responding to Russia and China's expanding military presence in the Arctic.Since Trump returned to office, his allies have talked up the island's commercial potential, as rising temperatures expand sea routes and opportunities to explore the region's fisheries and other natural resources, especially those related to defence, such as energy and critical minerals, that the administration sees as a priority.\"This is about shipping lanes. This is about energy. This is about fisheries. And, of course, it's about your mission, which is keeping us safe and monitoring space, monitoring our adversaries, and making sure the American people can sleep safely in their homes, day in and day out,\" Mike Waltz, the current US ambassador to the United Nations and then Trump's national security adviser, told US troops stationed in Greenland last year.And Louisiana Governor Jeff Landry told CNBC this month that Trump was a \"business president\" who believed the island represented \"a more robust trading opportunity\".Over the summer, the Trump administration signed off on the possibility of backing an American company's mining project in Greenland, via $120m (£90m) in financing from the Export-Import Bank of the United States.The plan built on other deals the Trump administration has agreed with Australia and Japan, as well as private firms, to secure US access to supply and production of rare earths, an industry now dominated by China.Dr Patrick Schröder, a senior research fellow at Chatham House, said the scale of Greenland's critical minerals holdings had the potential to \"shift the dial\" for the US, allowing it to reduce its reliance on China - a key priority for the administration.But critics of Trump's designs on the island, say it is not clear why US control would be necessary to access the island's resources. Analysts also warn that tapping them is easier said than done.Among other challenges, mining in Greenland currently is expensive and hampered by severe weather conditions, a lack of infrastructure and a small labour force, Lamy said.While exploration permits have been given for 100 blocs of the island, there are just two productive mines in Greenland.\"Greenland has been trying to attract outside investments into its extractive industries for a long time, and has not had a lot of luck because the business case just hasn't really been there,\" said Mikkel Runge Olesen, a senior researcher at the Danish Institute for International Studies.\"It's true that there are huge quantities of minerals of various kinds in Greenland. However, it also costs a lot of money to extract those minerals.\"But Prof Andrew Shepherd, director of the Centre for Polar Observation and Modelling, said rapidly melting layers of ice are increasingly easing the process, exposing rock for potential mining and creating river runoff.\"Getting all the fieldwork done traditionally has been very hard to do because you have to get energy to remote regions,\" he told the BBC.\"With the melting ice, you get the potential for hydro power in the area where the land is being exposed… so this presents itself as an interesting prospect.\"Jennifer Spence, director of the Arctic Initiative at the Harvard Kennedy School, said when it came to mining in Greenland, \"it's all still about potential\". Still, she thinks the island's strategic shipping location and rare earths deposits were key factors drawing Trump's attention. \"His logic is that there's a national security imperative,\" Spence said. \"My belief is that this is much more economically driven.\"Additional reporting by Natalie Sherman",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Greenland: What natural resources does the island have?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ae80/live/c49ff570-f868-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-23T12:39:51.000Z",
      "dateModified": "2026-01-23T12:39:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ukraine war: High stakes but low expectations for Ukraine talks with Russia and US",
    "url": "https://www.bbc.com/news/articles/c3edde1pwx8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f239/live/171990f0-f87c-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-23T21:33:55.000Z",
    "description": "15 hours agoSarah RainsfordEastern Europe correspondent , KyivReutersThis was the first time the three delegations have met in the same room together.",
    "body": "15 hours agoSarah RainsfordEastern Europe correspondent , KyivReutersThis was the first time the three delegations have met in the same room together.Negotiators from Russia, Ukraine and the US have been meeting in Abu Dhabi for their first trilateral talks since Russia's full-scale invasion of Ukraine in 2022.But whilst the talks take a new format, the core differences remain the same.The stakes are high, but expectations are limited.Donald Trump is pushing hard for a peace deal in Ukraine – the one he promised but hasn't yet delivered – and he said this week that the two sides would be \"stupid\" if they couldn't agree.But despite some intense shuttle diplomacy by his own envoys, they are hosting the first trilateral talks involving Ukrainian and Russian negotiators with some major issues still unresolved.Ukraine is engaging with the process because it wants peace more than anyone, but also because it needs to keep the US onside. It learned that lesson the hard way last year, when Donald Trump briefly suspended intelligence sharing and military aid.Getty ImagesUkraine wants peace more than anyone in this processNow, Ukraine's President Volodymyr Zelensky says his talks with Trump in Davos were \"really positive\" and he hopes for more air defence support against Russia's relentless attacks as a result.Often grim-faced after his encounters with the US leader, this time Zelensky seemed unusually upbeat.But he remains cautious on the outcome of talks in the United Arab Emirates.He's described the meetings, which may last two days, as \"a step\", but shied away from calling it a positive one.\"We have to wish it will push us a bit closer to peace,\" is how he put it.For a while, Zelensky has talked about being 90% of the way to producing a framework deal for peace, but the final 10% was always going to be the hardest - and Russia could still reject the whole thing.\"It's all about the eastern part of our country. It's all about the land. This is the issue that's not resolved yet,\" he explained, spelling out the biggest obstacle that he says still remains.Russia insists that Ukraine should hand over the big slice of the eastern Donbas region, which it has failed to win on the battlefield. Ukraine refuses.Politicians often talk about their red lines, but for this country the line in the Donbas is drawn with the blood of the soldiers who died defending it.Zelensky can't cross it.As I write this, the music from another soldier's funeral is drifting up from a church in the street.On my way back into Ukraine this time, we drove past so many military graves in roadside cemeteries, all marked with flags.The other big issue up for discussion in the UAE is what the US would do, militarily, if Russia were to invade Ukraine again someday. That's what Ukraine calls its \"security guarantees\", and says are essential.Zelensky says the deal between the US and Ukraine is done, but we have no real details.Russia's response also remains a wide-open question.There's also the giant new doubt about how good a guarantee from Donald Trump really is: the US president's fixation on \"acquiring\" Greenland has severely undermined Nato.He's also undermined the very principle of protecting a nation's sovereignty, the whole basis for Western support for Ukraine.So can Kyiv trust him to come to the rescue in the next crisis? For now, it doesn't have much choice.As for trusting Vladimir Putin, no one here is under any illusions that his aims have changed.\"He really doesn't want it,\" is what Zelensky said in Davos about Putin and peace.The Kremlin has said that if it doesn't get what it wants at the talking table, it will \"achieve its aims on the battlefield\" - though it's failed so far, despite sacrificing a huge number of soldiers.So once again, it's targeting civilian infrastructure across the country - but in a more deliberate, sustained, and devastating way than ever before.In the depths of a bitter winter, that's left people freezing in their homes.Today, the mayor of Kyiv again called on city residents to leave if they have somewhere to go.\"The enemy will most likely continue to attack the critical infrastructure of the city and the country,\" Vitali Klitschko warned.After repeat attacks, the system is very fragile.\"I address the residents and say honestly: the situation is extremely difficult and this may not be the most difficult moment yet.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ukraine war: High stakes but low expectations for Ukraine talks with Russia and US",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f239/live/171990f0-f87c-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-23T21:33:55.000Z",
      "dateModified": "2026-01-23T21:33:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Frank Gardner: Not only Americans risked life and limb to serve in Afghanistan",
    "url": "https://www.bbc.com/news/articles/cj3v2mlvzdvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/623c/live/324e36c0-f889-11f0-b385-5f48925de19a.jpg",
    "tag": "World",
    "date": "2026-01-23T19:02:50.000Z",
    "description": "17 hours agoFrank GardnerBBC Security CorrespondentPA MediaBlast walls, rocket attacks, Forward Operating Bases (FOBs), Improvised Explosive Devices (",
    "body": "17 hours agoFrank GardnerBBC Security CorrespondentPA MediaBlast walls, rocket attacks, Forward Operating Bases (FOBs), Improvised Explosive Devices (IEDs)... and long queues in the canteen. Anyone who deployed to Afghanistan, in whatever role, between 2001-2021 will have their own vivid memories of that time. It started with the flight in – to Kandahar, Kabul or Camp Bastion. It could be a long, slow descent with the lights out on an RAF jet, or a rapid, corkscrew down in a C-130 transport plane. In both cases the aim was to avoid being blown out of the air by a Taliban surface-to-air missile.Over the course of 20 years thousands of servicemen and women, as well as civilians, from dozens of countries deployed to Afghanistan, answering the US call for assistance. That call came in the form of invoking Nato's Article 5 of its charter – the only time it has ever happened in Nato's 77-year history – which states that an attack on one member shall be deemed an attack on all.America was reeling from the devastating 9/11 attacks when al-Qaeda, which was being sheltered by the Taliban in Afghanistan, murdered nearly 3,000 people by flying packed airliners into New York's Twin Towers and the Pentagon in Washington.The Taliban were swiftly driven from power in a joint effort by the US military, the CIA and Afghanistan's Northern Alliance. Then it was all about trying to hunt down the remnants of al-Qaeda as Britain's Royal Marines, together with UK Special Forces, pursued them over the mountains but many escaped to safety to regroup in Pakistan. It was not until ten years later that the US Navy's Seal Team Six commandos tracked down the al-Qaeda leader, Osama Bin Laden, in a villa in Abbottabad, Pakistan.The first two years of the US-led \"Operation Enduring Freedom\" as it was called, were relatively quiet. By late 2003, as America's attention switched to Iraq, US servicemen we met even started referring to Afghanistan as \"Op Forgotten\". But it was still dangerous. From a rain-soaked Kandahar airbase we watched Romanian troops edge nervously out on patrol in their Soviet-era armoured vehicles, wary of the next ambush. Flying into a remote US-manned firebase in the mountainous Paktika province in a Blackhawk helicopter, my BBC crew and I were told cheerfully: \"You've come to the worst place in the world\". Sure enough, the Taliban launched Chinese-made rockets at the base after dark, planted there, we were told, by farmers who had been either bribed or coerced into doing so.Everything changed after 2006, when the UK deployed in force to Helmand province, a part of Afghanistan that had been relatively peaceful until then. The Taliban made their intentions clear. If you come, they said, then we will fight you. And yet the UK government at the time appeared shocked at the ferocity of the fighting 3 Para now found themselves engaged in, with British paratroopers calling in mortar and artillery fire so close to their positions it was termed \"danger close\", in an effort to stop their bases from being overrun.Over the next eight years, until the end of combat operations in 2014, it was not just Americans who were risking life and limb to serve in Afghanistan. Brits, Canadians, Danes and Estonians were among those who saw the toughest fighting in Kandahar and Helmand provinces. It would also be churlish to ignore the bravery and sacrifice of so many Afghans who fought and died over two decades.I say \"fighting\" but most soldiers' biggest fears stemmed from the hidden IEDs, those expertly concealed Improvised Explosive Devices. The Taliban, who of course knew every inch of their terrain, were often able to guess correctly exactly where troops would need to cross an irrigation ditch or canal and so place the bomb accordingly. In the space of a split second, in a blinding flash and puff of black smoke, a fit, healthy, 20-something individual would have their life either ended or catastrophically changed, facing amputation and a host of other complications. So prevalent were these IEDs that soldiers were going out of the gates of their FOBs - Forward Operating Bases - on patrol praying that if they got hit it would result in a below-the-knee amputation, not one above the knee.The courage and resilience of the people I have met since, who have managed, despite terrible loss and adversity, to turn their shattered lives around, is both humbling and awe-inspiring. These are just some of the people who answered America's call for help after the 9/11 attacks. It is little wonder there has been such nationwide outrage at that country's president's suggestion that they somehow dodged the fighting.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Frank Gardner: Not only Americans risked life and limb to serve in Afghanistan",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/623c/live/324e36c0-f889-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-23T19:02:50.000Z",
      "dateModified": "2026-01-23T19:02:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]