[
  {
    "title": "US judge resigns after being disciplined for wearing Elvis wig in court",
    "url": "https://www.bbc.com/news/articles/c5yq3g7lqgqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d002/live/6b379640-c70e-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "World",
    "date": "2025-11-21T18:26:27.000Z",
    "description": "18 hours agoNadine YousifThe State of Missouri's Commission on Retirement, Removal and Discipline of JudgesJudge Thornhill of Missouri was disciplined",
    "body": "18 hours agoNadine YousifThe State of Missouri's Commission on Retirement, Removal and Discipline of JudgesJudge Thornhill of Missouri was disciplined for referencing Elvis Presley and dressing up as the singer in courtA Missouri court is all shook up following the resignation of a judge who was disciplined for wearing an Elvis Presley wig in court and occasionally playing the singer's songs during proceedings. Matthew EP Thornhill, the longest-serving circuit judge in St Charles County, is a self-described Elvis lover, according to his biography page. But his love for the King of Rock'n'Roll contributed to a disciplinary commission demanding his suspension, citing his frequent \"irrelevant\" Elvis references in court. In a letter explaining his actions, Judge Thornhill said his aim was \"to add levity at times when I thought it would help relax litigants\".\"I now recognise that this could affect the integrity and solemnity of the proceedings,\" Judge Thornhill wrote in a letter dated 12 November to the Missouri Supreme Court. The judge \"would routinely wear an Elvis Presley wig on or about October 31\" - or Halloween - in court while conducting court business, according to a report by Missouri's Commission on Retirement, Removal and Discipline of Judges, which investigates allegations of judicial misconduct.The report shows images of Judge Thornhill sitting on the bench while donning an Elvis wig with his signature black pompadour and sunglasses. It adds that, on occasion, he would give litigants or witnesses the option of being sworn in while playing Elvis music from his phone. He would also refer to the singer occasionally during court proceedings, including mentioning his date of birth or death and lyrics from his music, according to the inquiry report. St Charles County Circuit CourtJudge Matthew EP Thornhill is a self-described Elvis lover, according to his biography page.Judge Thornhill's burning love for all things Elvis is well-documented. In an interview with a local media outlet last year, he said he had visited Graceland, where the singer lived and is buried, 13 times. He added that Elvis was always on his mind since he was a child.The disciplinary report also cites unrelated conduct, like sharing his political affiliation or preferred candidates in elections from the bench, as well as promoting his own election campaign by asking witnesses, lawyers and litigants if they had seen his \"Thornhill for Judge\" signs around town. The commission found that Judge Thornhill had \"failed to maintain order and decorum in the courtroom\" and recommended he be suspended without pay for six months, then serve for another 18 months before retiring. In the 12 November letter, Judge Thornhill did not dispute any of the allegations, saying they were \"substantially accurate\". He acknowledged he had made a mistake and agreed to the terms set out by the commission, which allowed him to conclude his service on the bench and retire after 20 years. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US judge resigns after being disciplined for wearing Elvis wig in court",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d002/live/6b379640-c70e-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-21T18:26:27.000Z",
      "dateModified": "2025-11-21T18:26:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "COP30 fire: BBC at the scene of 'intense' blaze",
    "url": "https://www.bbc.com/news/videos/cn5159k1krzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f1e6/live/d697fe90-c63f-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-20T21:58:46.000Z",
    "description": "The UN climate talks COP30 have been evacuated due to a fire breaking out inside the venue in Belém, Brazil.BBC journalists including Climate Editor J",
    "body": "The UN climate talks COP30 have been evacuated due to a fire breaking out inside the venue in Belém, Brazil.BBC journalists including Climate Editor Justin Rowlatt saw flames and smoke in the pavilion area before they were rushed outside.The UN said the fire was extinguished after six minutes and 13 people were treated for smoke inhalation. It is not yet known what caused the blaze.More on this story.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "COP30 fire: BBC at the scene of 'intense' blaze",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f1e6/live/d697fe90-c63f-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-20T21:58:46.000Z",
      "dateModified": "2025-11-20T21:58:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cuter and closer: Raccoons may be on their way to becoming America's next pet",
    "url": "https://www.bbc.com/news/articles/c1j8j48e5z2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e4c6/live/dd0af140-c65f-11f0-8896-e9b6ea3ac435.jpg",
    "tag": "World",
    "date": "2025-11-21T02:38:18.000Z",
    "description": "Raccoons may be inching closer to becoming America's next pet.Affectionately referred to as trash pandas, the masked mammals known for rummaging rubbi",
    "body": "Raccoons may be inching closer to becoming America's next pet.Affectionately referred to as trash pandas, the masked mammals known for rummaging rubbish bins for easy food, are evolving based on their proximity to humans, even starting to look cuter, a new study says. Evaluation of nearly 20,000 photos found \"a clear reduction in snout length\" in urban raccoons compared to their rural cousins - a physical shift consistent with the early stages of domestication seen in cats and dogs.Some that have been adopted as pets have become TikTok celebrities. One particularly bold dumpster-diver even sprinted across the pitch during a Major League Soccer match in Philadelphia last year.The stripe-tailed mammals, also nicknamed \"backyard bandits\", are widespread across the contiguous US. Their ability to thrive in both wild and urban settings has left them occupying an unusual space in American life - beloved pet in some neighbourhoods, persistent pest in others.The proximity to humans could signal that the creatures are growing more comfortable around us, or, scientifically speaking, dampening their innate flight responses, according to the study published in the journal Frontiers in Zoology.The softening of their features could be due to shifts in their fight-or-flight response on the cellular level, it says.This urban domestication starts with trash, the study's co-author, Raffaela Lesch of the University of Arkansas at Little Rock, told Scientific American.\"Trash is really the kickstarter,\" she said. \"Wherever humans go, there's trash — and animals love our trash.\"But to take advantage of this endless buffet, wildlife must strike a delicate balance: bold enough to root through bins and navigate human environments, yet not so bold as to pose a threat. \"If you have an animal that lives close to humans, you have to be well-behaved enough,\" Lesch said. \"That selection pressure is quite intense.\"The finding, the authors said, is consistent with the \"domestication syndrome phenotype\". Domestication syndrome - anatomical and morphological changes such as curly tails, floppy ears, depigmentation, smaller brains and reduced facial skeletons - are commonly cited as some of the most salient traits, the study says. Those traits are also seen among more common household pets, such as dogs that evolved from wolves.The study's authors also hypothesised that the domestication process is wrongly believed to be initiated by humans, who have captured or selectively bred animals in the past. The process might actually begin much earlier than previously thought, they said, notably when animals became habituated to human environments.\"Only animals with dampened flight (or fight) responses would succeed best,\" the authors wrote. \"This makes the initial stages of the domestication process a process of pure natural selection.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cuter and closer: Raccoons may be on their way to becoming America's next pet",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e4c6/live/dd0af140-c65f-11f0-8896-e9b6ea3ac435.jpg"
      ],
      "datePublished": "2025-11-21T02:38:18.000Z",
      "dateModified": "2025-11-21T02:38:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nigeria sees one of worst mass abductions as 315 taken from school",
    "url": "https://www.bbc.com/news/articles/c3w7621xypyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ac15/live/18ee9de0-c78e-11f0-bca8-3f3db1bd72a1.png",
    "tag": "World",
    "date": "2025-11-22T11:32:39.000Z",
    "description": "50 minutes agoAlex Smith, Chris Ewokor,BBC Africa, in Abuja, and Elettra NeysmithBBCSt Mary's School, in Niger state, was attacked in the early hours ",
    "body": "50 minutes agoAlex Smith, Chris Ewokor,BBC Africa, in Abuja, and Elettra NeysmithBBCSt Mary's School, in Niger state, was attacked in the early hours of Friday morningMore than 300 children and staff are now thought to have been kidnapped by gunmen from a Catholic school in central Nigeria, making it one of the worst mass abductions the country has seen.The Christian Association of Nigeria said 303 students and 12 teachers were taken from on St Mary's School in Papiri, Niger state - substantially more than previously estimated.It said the figures have been revised upwards \"after a verification exercise\".The kidnapping comes amid a surge of attacks by armed groups. The revised number of people taken surpasses the 276 abducted during the infamous Chibok mass abduction of 2014.Local police said armed men stormed the school at around 02:00 local time (01:00 GMT) on Friday morning, abducting students who were staying there.Dominic Adamu, whose daughters attend the school but were not taken, told the BBC: \"Everybody is weak... it took everybody by surprise.\"One distressed woman tearfully told the BBC that her nieces, aged six and 13, had been kidnapped, adding: \"I just want them to come home.\"Police said that security agencies were \"combing the forests with a view to rescue the abducted students\".It was initially reported that 215 pupils had been taken - but that figure has since been revised upwards. The new number is believed to be almost half of the school's student population, the news agency AFP reports.Authorities in Niger state said the school had disregarded an order to close all boarding facilities following intelligence warnings of a heightened risk of attacks.They said in a statement the move exposed pupils and staff to \"avoidable risk\". The school has not commented on that claim.The kidnapping of people for ransom by criminal gangs, known locally as bandits, has become a major problem in many parts of Nigeria.The payment of ransoms has been outlawed in an attempt to cut the supply of money to the criminal gangs - but this has had little effect.Friday's mass abduction was the third such attack in the country in a week.On Monday, more than 20 schoolgirls, who the BBC has been told are Muslim, were kidnapped from a boarding school in neighbouring Kebbi state.A church was also attacked further south, in Kwara state, with two people killed and 38 others abducted.Nigerian President Bola Tinubu has postponed his foreign trips - including to this weekend's G20 summit in South Africa - in order to address the security concerns.The central government has ordered more than 40 federal colleges to close and public schools in some states have been shut.But the rising insecurity is fuelling anger as well as fear in Nigeria, with citizens demanding stronger action to protect children and communities.The mass abduction follows claims by right-wing figures in the US, including President Donald Trump, that Christians are being persecuted in Nigeria - an allegation dismissed by the Nigerian government.For months, campaigners and politicians in Washington have been alleging that Islamist militants are systematically targeting Christians in Nigeria.Earlier this month, Trump said he would send troops into Nigeria \"guns a-blazing\" if the African nation's government \"continues to allow the killing of Christians\".The Nigerian government has called claims that Christians are being persecuted \"a gross misrepresentation of reality\".An official said that \"terrorists attack all who reject their murderous ideology - Muslims, Christians and those of no faith alike\".In the north-east, jihadist groups have been battling the state for more than a decade.Organisations monitoring violence say most of the victims of these groups are Muslim because most attacks happen in the majority Muslim north of the country.In the centre of Nigeria, there are also frequently deadly attacks between herders - who are mostly Muslim - on farmers, who are largely Christian.However, analysts say these are often motivated by competition for resources, such as water or land, rather than religion.The militant Islamist group Boko Haram took 276 girls from their school in the town of Chibok 2014.The incident courted international attention and sparked a global campaign seeking their return, which included an intervention from then-US First Lady Michelle Obama.Many have since either escaped or been freed - but as many as 100 still remain missing.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nigeria sees one of worst mass abductions as 315 taken from school",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ac15/live/18ee9de0-c78e-11f0-bca8-3f3db1bd72a1.png"
      ],
      "datePublished": "2025-11-22T11:32:39.000Z",
      "dateModified": "2025-11-22T11:32:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Steve Rosenberg: Putin uncompromising as leaked plan reaches Moscow",
    "url": "https://www.bbc.com/news/articles/c5y9k0mrm2ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0ab6/live/15f39120-c6f0-11f0-b222-8b5ed945ab17.jpg",
    "tag": "World",
    "date": "2025-11-21T18:21:53.000Z",
    "description": "18 hours agoSteve RosenbergRussia editorEPAIt was quite a contrast.On Thursday, a US Pentagon delegation was in Kyiv. They were talking to President Z",
    "body": "18 hours agoSteve RosenbergRussia editorEPAIt was quite a contrast.On Thursday, a US Pentagon delegation was in Kyiv. They were talking to President Zelensky about a draft plan to end the war in Ukraine.The same day, on Russian state TV, President Putin was in military fatigues. He was talking to his army chiefs about fighting on.\"We have our tasks, our goals,\" the Kremlin leader declared. \"The chief one is the unconditional achievement of the aims of the special military operation.\"The Izvestia newspaper called President Putin's visit to a command post \"a signal to America that he's prepared to negotiate on Ukraine, on Russia's terms\".Which brings us back to the peace plan.On Friday night, President Putin said he had seen the US settlement plan for Ukraine.Addressing a meeting of the Russian security council in Moscow, he described the American proposals as a \"modernised\" version of the plan discussed with Trump at the Alaska summit between the leaders in August.President Putin said he thought the plans could form the basis of final peace settlement.The 28-point proposal, which has been widely leaked and reported on, appeared after a visit to America by President Putin's envoy Kirill Dmitriev. He took part in three days of discussions in Miami with President Trump's special envoy Steve Witkoff.According to drafts of the peace proposal, Ukraine would cede to Russia parts of the Donbass still under Kyiv's control; the Ukrainian armed forces would be reduced in size and Ukraine would vow not to join Nato.\"The Russian military's effective work should convince Zelensky and his regime that it's better to strike a deal and do it now,\" President Putin's spokesman Dmitry Peskov previously told journalists on a Kremlin conference call.A peace proposal does not automatically mean peace. What if there's no agreement?Pro-Kremlin commentators insist that, deal or no deal, Russia will prevail.\"Everyone thought that the idea of a peace deal had sunk in a swamp,\" wrote Russian news outlet Moskovsky Komsomolets. \"But suddenly, a rocket has shot out of this bog with a new, or rather an 'old new' peace plan, with something of the Alaska summit about it. It shot out like a jack in the box.\"How long and how far will this missile fly? Will it crash, sabotaged by Europe and Kyiv? Even if the launch is a false start, it's unlikely to change the general trend. The balance of power is shifting in Russia's favour.\"But after nearly four years of war Russia is under pressure, too. Since its full-scale invasion of Ukraine, not only has Russian's army suffered huge losses on the battlefield, but back home the economy is faltering. Russia's budget deficit is growing, revenues from oil and gas falling.\"Russia's industry is somewhere between stagnation and decline,\" declared the broadsheet Nezavisimaya Gazeta this week.It's unclear, though, whether economic pressures will change President Putin's calculations and convince him that now is the moment to end his so-called special operation: even on terms that many believe benefit Moscow.Many. But not everyone.Some elements of the peace plan haven't gone down well in Russia. Some reports suggest that Ukraine could be offered security guarantees modelled on Nato's Article 5. That might commit Western allies to treat any future Russian attack on Ukraine as an attack on the transatlantic community as a whole and trigger a combined military response.\"This is, in effect, Ukraine in Nato,\" wrote Moskovsky Komsomolets, \"only without the deployment of bases and weapons on its territory.\"The full details of the peace plan have yet to be confirmed. We may be entering another period of intense diplomacy.For now, though, Russia's war on Ukraine continues.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Steve Rosenberg: Putin uncompromising as leaked plan reaches Moscow",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0ab6/live/15f39120-c6f0-11f0-b222-8b5ed945ab17.jpg"
      ],
      "datePublished": "2025-11-21T18:21:53.000Z",
      "dateModified": "2025-11-21T18:21:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mexico: Seven bodyguards arrested over mayor's murder",
    "url": "https://www.bbc.com/news/articles/cq60rpmq641o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/925a/live/3e4c9d90-c78d-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-22T10:33:57.000Z",
    "description": "Seven bodyguards have been arrested over their alleged involvement in the murder of a popular Mexican mayor, authorities have said.Carlos Manzo, the m",
    "body": "Seven bodyguards have been arrested over their alleged involvement in the murder of a popular Mexican mayor, authorities have said.Carlos Manzo, the mayor of Uruapan and an outspoken critic of cartel violence, was shot dead on 1 November at a public event marking the Day of the Dead.The office of the attorney general of Michoacán state said in a brief statement that the public servants had been detained \"for their probable participation in the crime of aggravated homicide, in commission by omission\" in relation to Manzo's killing.It follows the arrest on Wednesday of a man police described as the mastermind behind the murder, who officials said had links to a powerful cartel.The attorney general's office in Michoacán, to the west of the capital, Mexico City, said the seven guards had been arrested by both state and federal officials, including the National Guard.Troops and agents led the suspects out of a municipal building on Friday near where Manzo had been killed, according to the Associated Press.The 40-year-old mayor was attending a Day of the Dead ceremony - which honours deceased family and friends - alongside his relatives when he was shot seven times, sending bystanders running for cover.Manzo's assassination triggered mass protests and questions have been raised about why his security detail failed to stop the lone gunman. The suspect was later restrained and shot by Manzo's bodyguards. Manzo had been outspoken about how avocado growers in the region were being extorted and threatened by criminal groups, and had also demanded that Mexico's federal government do more to rein in the cartels.The Jalisco New Generation Cartel (CJNG), which Mexico's security minister blamed for Manzo's slaying, engages in drug trafficking, as well as kidnapping for ransom and extortion.It is also infamous for targeting public officials who refuse to do its bidding.Mexican officials arrested the supposed mastermind of the assassination, named only by his forenames Jorge Amando, on Wednesday.While the CJNG is thought to be the most powerful of the criminal gangs operating in Michoacán, there are many others and their fights for control of drug, arms and fuel smuggling routes often result in deadly confrontations.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mexico: Seven bodyguards arrested over mayor's murder",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/925a/live/3e4c9d90-c78d-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-22T10:33:57.000Z",
      "dateModified": "2025-11-22T10:33:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Marjorie Taylor Greene to quit Congress after Trump feud",
    "url": "https://www.bbc.com/news/articles/cj4qx1lenvjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6f27/live/b0083d80-c770-11f0-a882-55e7f9e7585f.jpg",
    "tag": "World",
    "date": "2025-11-22T12:06:02.000Z",
    "description": "16 minutes agoKwasi Gyamfi Asiedu,in Washington, and Anthony Zurcher,North America correspondent, in WashingtonKey moments from Trump and Greene's pub",
    "body": "16 minutes agoKwasi Gyamfi Asiedu,in Washington, and Anthony Zurcher,North America correspondent, in WashingtonKey moments from Trump and Greene's public falloutMarjorie Taylor Greene has announced she will resign from office, an unexpected turn for the high-profile Republican.One of Donald Trump's Maga superstars and staunchest defenders, the Georgia congresswoman's relentless calls for releasing files related to late paedophile Jeffrey Epstein and recent criticism of some of his policies led to a bitter public feud.After the US president labelled her a \"traitor\", she said in a video announcing her departure: \"I refuse to be a 'battered wife' hoping it all goes away and gets better.\"Trump, who had threatened to support a Republican challenger to unseat Greene, called her resignation \"great news for the country\" in an interview with ABC News.\"For some reason, primarily that I refused to return her never ending barrage of phone calls, Marjorie went BAD,\" he later wrote on Truth Social. \"Nevertheless, I will always appreciate Marjorie, and thank her for her service to our Country!\"Greene said in her video statement, posted on social media, that she would leave the US Congress on 5 January 2026.She said that she did \"not want my sweet district to have to endure a hurtful and hateful primary against me by the president we all fought for, only to fight and win my election while Republicans will likely lose the midterms\". She had been one of the loudest demanding the release of documents related to Epstein, an issue that once united Trump and his base but has since become divisive.Trump had spent months arguing that the issue was a distraction concocted by his political detractors to divert attention from his administration's achievements.\"Standing up for American women who were raped at 14, trafficked and used by rich powerful men, should not result in me being called a traitor and threatened by the President of the United States, whom I fought for,\" Greene said in her resignation letter.Watch: Marjorie Taylor Greene announces resignation in video messageOver the last few months, she has gone on a number of high-profile news shows and was critical of Trump and fellow Republicans. She took issue with the president not doing enough to bring down living costs for voters and criticised his policy of introducing tariffs on imports. But above all, she criticised his administration for not releasing documents related to Epstein.Trump responded last week in a series of social media posts, calling Greene a \"traitor\" and \"wacky\". He said she should be unseated and vowed to back a challenger for her place in Congress.Days after their feud boiled over, with a growing number of Republicans calling for their release, Trump reversed course and said he would support their publication. He signed a bill this week that forces the US Justice Department to release the documents within 30 days. Greene was elected to Congress in 2020 amid a backdrop of headlines over her support and promotion of QAnon conspiracies, including claiming school shootings and the 9/11 terror attacks were staged. She has since apologised and sought to distance herself from those comments.In the video announcing her resignation, Greene ticked off a list of political achievements. She noted in her resignation letter that the comments from Trump were \"hurtful\". AFP via Getty ImagesGreene and Trump on the campaign trail in 2024While she announced her departure from the House of Representatives, US media reports have indicated Greene has shown an interest in running for state office - either as Georgia governor or for a Senate seat. The president has commented publicly about those ambitions, writing on Truth Social during their public feud that he had previously told her that she shouldn't run for either of those offices due to poor public polling. Greene has since said she did not plan to run for either of those offices. Before their public falling out, Trump and Greene had been close allies in championing the \"America First\" agenda. She joined him on the campaign trail and was one of the Republicans most vocal about Trump's false claims that he'd won the 2020 presidential election against Joe Biden. Her departure will further close the gap in the Republican-led House of Representatives, where the party only holds a handful of seats more than Democrats. Control of the chamber will be up for grabs in the 2026 midterm elections next November. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Marjorie Taylor Greene to quit Congress after Trump feud",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6f27/live/b0083d80-c770-11f0-a882-55e7f9e7585f.jpg"
      ],
      "datePublished": "2025-11-22T12:06:02.000Z",
      "dateModified": "2025-11-22T12:06:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Canadian man loses legal battle to reclaim C$1.2m-dollar stash",
    "url": "https://www.bbc.com/news/articles/c20kl7x3ylyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2b64/live/56add2c0-c6c3-11f0-82b1-6148fee2770d.jpg",
    "tag": "World",
    "date": "2025-11-21T12:37:03.000Z",
    "description": "A Canadian man has lost a 16-year legal battle to reclaim more than C$1.2m (£651,000) in cash seized from his home.Police found the large amount of mo",
    "body": "A Canadian man has lost a 16-year legal battle to reclaim more than C$1.2m (£651,000) in cash seized from his home.Police found the large amount of money stashed in various places around Marcel Breton's north-western Ontario home during a search for an illegal firearm in 2009, as well as a variety of drugs.Breton was convicted of various offences but was acquitted at a retrial after arguing the search of his property had not been lawful.But earlier this week, an Ontario appeals court upheld a 2023 ruling that decided most of the seized money should go to the Canadian government, putting an end to his chances of recouping it.The trial judge had concluded that Breton did not lawfully possess the cash found around his property.Police recovered C$1,235,620 buried under his garage, C$32,000 stored elsewhere in the garage, and bundles of money totalling $15,000 in the under-floor heating ducts of the living room.In particular, the trial judge noted that it was \"unusual for an average person to have such a large amount of money buried in tubs underneath their property\", that the most common denomination was C$20 - an amount an expert said was commonly associated with the drug trade - and that the cash was found near drugs and drug paraphernalia.Breton also did not report any income to the revenue agency between 2001 and 2008, the judge said.But the appeals court upheld the decision for the $15,000 found inside the vents of his home to be returned to him, as the judge could not rule out that it had been obtained lawfully as it was not bundled in consistent denominations like the cash found in the garage.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Canadian man loses legal battle to reclaim C$1.2m-dollar stash",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2b64/live/56add2c0-c6c3-11f0-82b1-6148fee2770d.jpg"
      ],
      "datePublished": "2025-11-21T12:37:03.000Z",
      "dateModified": "2025-11-21T12:37:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Grizzly bear on loose after attacking school group in Canada, injuring 11",
    "url": "https://www.bbc.com/news/articles/cz68x1n5qd6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f7c5/live/7f3df530-c6e6-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-21T21:05:30.000Z",
    "description": "A grizzly bear is on the loose after attacking a school group in Canada, leaving 11 people injured, two of them critically.The incident happened on Th",
    "body": "A grizzly bear is on the loose after attacking a school group in Canada, leaving 11 people injured, two of them critically.The incident happened on Thursday afternoon on a walking trail in the town of Bella Coola, in the province of British Columbia (BC). Residents have been warned to remain indoors while armed officers try to track down the animal. Four of the injured remained in hospital as of Friday afternoon, BC's Health Services Authority has said.A male teacher \"got the whole brunt of it\" and some children were hit with bear spray as the adults tried to fend off the animal, Veronica Schooner, a parent, told the Canadian Press.Ms Schooner said her 10-year-old son was part of the school group, though he was not attacked. \"He said that bear ran so close to him, but it was going after somebody else,\" she said, adding that \"he even felt its fur\".British Columbia Emergency Health Services told the BBC in a statement that two people were critically injured in the attack, two more were seriously hurt, while seven others were treated at the scene.Patients had to be transported to a nearby airport so they could be airlifted to the closest hospital, officials said. The group were from Acwsalcta School, which is run by the Indigenous Nuxalk Nation in the remote town 700km (435 miles) north-west of Vancouver. \"Officers are armed\" the Nation wrote on Facebook. \"Remain indoors and off the highway.\" It added: \"It's hard to know what to say during this very difficult time. We are so grateful for our team and our students.\" The Nation's officials have temporarily shut the school and are offering counselling services.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Grizzly bear on loose after attacking school group in Canada, injuring 11",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f7c5/live/7f3df530-c6e6-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-21T21:05:30.000Z",
      "dateModified": "2025-11-21T21:05:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Niger state kidnapping: More than 200 pupils abducted from catholic school",
    "url": "https://www.bbc.com/news/articles/cj4qxvy74qyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d5c1/live/5f061350-c6fb-11f0-a863-434ee92aa5e3.png",
    "tag": "World",
    "date": "2025-11-22T01:50:11.000Z",
    "description": "Gunmen abduct more than 200 pupils from Nigerian Catholic school11 hours agoChris Ewokor,BBC Africa, in Abuja, and Wycliffe MuiaBBCSt Mary's School wa",
    "body": "Gunmen abduct more than 200 pupils from Nigerian Catholic school11 hours agoChris Ewokor,BBC Africa, in Abuja, and Wycliffe MuiaBBCSt Mary's School was attacked in the early hours of Friday More than 200 pupils were kidnapped by gunmen from a Catholic school in central Nigeria on Friday, the second mass school kidnapping this week. The latest attack targeted St Mary's School in Papiri, Niger state, where authorities had already ordered the temporary closure of all boarding schools due to rising security threats.The Christian Association of Nigeria said 215 students and 12 members of staff were taken during the early morning raid.Nigeria has faced a renewed wave of attacks by armed groups in recent days, including the kidnapping on Monday of more than 20 schoolgirls, who the BBC has been told are Muslim, from a boarding school in neighbouring Kebbi state.A church was also attacked further south, in Kwara state, with two people killed and 38 abducted while the service was being broadcast online.President Bola Tinubu has postponed his foreign trips - including this weekend's G20 summit in South Africa - in order to address these security issues.Police said armed men - locally known as bandits - stormed St Mary's School on Friday at about 02:00 local time (01:00 GMT) and abducted students from their hostel. Fear and uncertainty have gripped the area as families wait for news.\"Everybody is weak... it took everybody by surprise,\" local resident Dominic Adamu told the BBC.Mr Adamu, whose daughters attend St Mary's School but were not abducted, added: \"People are complaining about the state of security in our country.\"One distressed woman tearfully told the BBC that her nieces, aged six and 13 were kidnapped.\"I just want them to come home,\" she said.The authorities in Niger state said the school, attended by both girls and boys, had disregarded an order to close all boarding facilities following intelligence warnings of a heightened risk of attacks.\"Regrettably, St Mary's School proceeded to reopen and resume academic activities without notifying or seeking clearance from the state government, thereby exposing pupils and the staff to avoidable risk,\" they said in a statement.The school has not commented on that claim.The police said that security agencies were \"combing the forests with a view to rescue the abducted students\".The attack follows claims by US President Donald Trump that Christians are being persecuted in Nigeria, an allegation dismissed by the Nigerian government.Earlier this month, Trump said he would send troops into Nigeria \"guns a-blazing\" if its government \"continues to allow the killing of Christians\".And on Thursday, in a meeting with Nigeria's national security advisor, US Defence Secretary Pete Hegseth called on Nigeria to take \"urgent and enduring action to stop violence against Christians\", a statement from the Pentagon said.Hegseth also conveyed the US' will to \"work by, with, and through Nigeria to deter and degrade terrorists that threaten the United States\".The Nigerian government denies that Christians are being persecuted, saying that is \"a gross misrepresentation of reality\".An official said that \"terrorists attack all who reject their murderous ideology - Muslims, Christians and those of no faith alike\".Nigeria is currently grappling with multiple overlapping security crises.The country's 220 million people are roughly evenly split between followers of the two religions, with Muslims in the majority in the north.The kidnapping of people for ransom by criminal gangs, known locally as bandits, has become a major problem in many parts of the country.Africa Independent Television via ReutersArmed men exchanged fire with police officers before abducting girls from this school in Maga, Kebbi state, earlier this weekIn the north-east, jihadist groups have been battling the state for more than a decade. Organisations monitoring violence say most of the victims of these groups are Muslim because most attacks happen in the north.In the centre of the country, there are also frequently deadly attacks between herders, who are mostly Muslim, on farmers, who are largely Christian. However, analysts say these are often motivated by competition for resources such as water or land, rather than religion.Local media report that the kidnappers have demanded a ransom for those abducted from the church in Eruku, Kwara state.The payment of ransoms has been outlawed in an attempt to cut the supply of money to the criminal gangs but to little effect.Two of the schoolgirls abducted on Monday in Maga, Kebbi state have managed to escape, while 23 are still missing. Two people were killed in that attack. They were both Muslim.Additional reporting by Abayomi Adisa in Lagos & Wedaeli Chibelushi in LondonMore about Nigeria from the BBC:Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Niger state kidnapping: More than 200 pupils abducted from catholic school",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d5c1/live/5f061350-c6fb-11f0-a863-434ee92aa5e3.png"
      ],
      "datePublished": "2025-11-22T01:50:11.000Z",
      "dateModified": "2025-11-22T01:50:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "COP30: India's delayed action plan raises eyebrows at UN climate summit",
    "url": "https://www.bbc.com/news/articles/cy8v8k8mlego?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f972/live/ba929fd0-c675-11f0-a674-cf008e1f5535.jpg",
    "tag": "World",
    "date": "2025-11-21T01:17:06.000Z",
    "description": "1 day agoNavin Singh KhadkaEnvironment Correspondent, BBC World ServiceGetty ImagesIndia is the world's third-largest carbon emitterAt this year's UN ",
    "body": "1 day agoNavin Singh KhadkaEnvironment Correspondent, BBC World ServiceGetty ImagesIndia is the world's third-largest carbon emitterAt this year's UN climate summit (COP30), under way in Brazil's Belem city, all eyes are on India - the world's third largest carbon emitter.India has not yet submitted a key climate plan that countries are required to do every five years, even as international assessments have deemed India's climate action as being \"worryingly inadequate\". Delhi has argued otherwise.Known as Nationally Determined Contributions (NDCs), the updated plan from each member country to the UN Framework Climate Convention (UNFCC) is expected to have more ambitious carbon reduction targets as the world has failed to make the required level of cuts to avoid dangerous global warming.So far, around 120 of the 196 member countries of the UNFCCC have submitted their updated plans and India is among the remaining ones.The Paris climate agreement signed in 2015 has the goal of limiting average global temperature rise to well below 2C and to strive for 1.5C to avert drastic climate change.The United Nations Environment Programme (UNEP) says that by 2035, annual emissions will have to be reduced by 35% and 55%, compared with 2019, to align with the goals of the Paris agreement.But emissions have continued to rise almost every year since then, and the climate plans submitted to the UNFCCC until 10 November show that there will be emissions reduction of only around 12% by 2035 – that too if countries fully implement their policies.UNEP warns that current emission policies put the world on track for 2.8C of warming this century, underscoring the need for far more ambitious carbon-cutting targets.The first deadline for the updated climate plan (NDC3) was February, but it was extended until September as more than 90% of member countries failed to meet it.All eyes were on top emitters like China, India and the European Union, also because US President Donald Trump once again announced his country's exit from the Paris agreement, leaving the world wondering if other major emitters would offer to plug the gap.But many countries missed the September deadline too. While some began to submit their plans before COP30, there were expectations that the remaining would do so during the climate meet in Belem.Some have done so, but India kept the world guessing until environment minister Bhupender Yadav, who led the country's delegation in Belem, told the media this week that Delhi would submit its plan only by the end of December.So, why has India delayed submitting its climate plan, even though it could mean inviting negative press during COP30?Getty ImagesThis year's UN's climate summit - COP30 - is being held at Brazil's Belem city Though it has not explained its stance, Delhi appears keen to highlight a view shared by many developing nations: that rich countries bear historic responsibility to slash emissions and provide far greater financial support to the developing world.A week before COP30 kicked off, Yadav wrote an opinion piece in the Economic Times newspaper where he argued that \"global climate progress can't come from endless discussions alone\". \"For too long, the world has been caught in a cycle of negotiations, while the planet's distress signal grows louder. While dialogue is important, action is imperative,\" he wrote.While delivering India's statement at COP30, Yadav seemed to expand on this argument.\"Developed countries must reach net zero far earlier than current target dates and deliver new, additional and concessional climate finance at a scale of trillions, not billions,\" he said.Indian officials, like many negotiators from the developing world, argue that their updated climate plans with more ambitious carbon reduction targets will mean nothing if they do not receive financial and technological support from developed countries.The Paris climate agreement requires developed countries to provide financial support to the developing world, but it has remained a contentious issue.The last COP in Baku, Azerbaijan, saw angry reactions from the developing world when developed countries said they would provide $300bn (£229bn) annually as climate finance by 2035, while poor countries were demanding more than $1tn.Developing countries also say there has been no clarity and transparency on how the $300bn will be provided, and that developed countries are pushing for private finance which will burden poor countries with loans.Meanwhile, some developed countries have argued that fast-emerging economies like China and India should also contribute to the global climate finance pot.\"The best way to make sure that Europe can sustain that [the climate finance it has been providing] is by inviting others who have the ability to do so… to chip in,\" Wopke Hoekstra, climate commissioner at the European Commission, told a press conference at COP30.Without naming any country, he said in many cases (such other countries) have far higher GDP per capita than a vast majority of European member states.Getty ImagesSome estimates suggest that coal's share in India's total electricity generation remains at 75%India says it shouldn't be pressed for a more ambitious climate plan as it has already met a key pledge - to have 50% of its installed electricity capacity from non-fossil fuel sources - years ahead of the 2030 deadline.Global assessments praise this but also flag other challenges.Climate Action Tracker - an independent scientific project that tracks government climate action and measures it against the globally agreed Paris agreement - has rated India's climate targets and actions as \"highly insufficient\".It has pointed out that coal's share in India's total electricity generation continues to be around 75%, while it must drop to at least 19% to align the country's climate action with the global goal of limiting temperature rise to 1.5C.Another report released at COP30 has also underscored India's over-dependence on coal.In the Climate Change Performance Index, published by environmental think-tank GermanWatch, India slipped 13 spots over the past year to rank 23rd on the list of 63 countries and the EU.\"India's national pathway is still anchored in coal and there is no national coal exit timeline and new coal blocks continue to be auctioned,\" a report by the think-tank noted.According to the recent UN emissions gap report, India saw the highest increase in greenhouse gas emissions in 2024 compared to the previous year, followed by China and Indonesia.But the world's largest carbon emitter China, usually India's ally at climate negotiations to counter developed countries, has already submitted its updated climate plan.And now COP30 is also discussing whether there should be an announcement of a roadmap for the world to transition away from fossil fuels.It remains to be seen if criticism around India's dependence on coal will influence its updated climate plan, which it has committed to submit before this year ends.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "COP30: India's delayed action plan raises eyebrows at UN climate summit",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f972/live/ba929fd0-c675-11f0-a674-cf008e1f5535.jpg"
      ],
      "datePublished": "2025-11-21T01:17:06.000Z",
      "dateModified": "2025-11-21T01:17:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "G20: Will Trump’s no-show eclipse South Africa’s moment?",
    "url": "https://www.bbc.com/news/articles/c20508y7w5yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a101/live/6a31af10-c6fa-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-22T00:09:48.000Z",
    "description": "12 hours agoMayeni JonesAfrica correspondent, JohannesburgGallo Images via Getty ImagesSouth Africa held a \"social summit\" ahead of the main event, in",
    "body": "12 hours agoMayeni JonesAfrica correspondent, JohannesburgGallo Images via Getty ImagesSouth Africa held a \"social summit\" ahead of the main event, in a bid to involve civil society voices in the G20's decisionsWhen it assumed the presidency of the G20 last year, South Africa hoped that as the first African country to host the gathering of world leaders, it could champion issues that mattered the most to developing nations.For instance, it wanted the 20 heads of state from the world's biggest economies to consider arguments that borrowing should be cheaper for developing countries, which pay two to four times more in interest on debts than more advanced economies.Other themes of this weekend's summit include securing climate change financing, increasing the participation of African countries in multilateral forums and ensuring that they get the best value out of their critical minerals.But so far, discourse surrounding the meeting has been dominated by Donald Trump's very public decision not to attend.The US president said he would not go due to the widely discredited claim that South Africa's white minority is the victim of large-scale killings and land grabs. The relationship between the two countries has become increasingly fraught over the past year - the US expelled the South African ambassador to Washington, cut some of its aid funding and slapped South Africa with tariffs of 30% (the highest rate in sub-Saharan Africa).And finally, after initially saying he would send Vice-President JD Vance to the G20 summit, Trump abruptly announced two weeks ago that no US representatives would attend.The government in South Africa's capital, Pretoria, has tried to maintain a defiant but diplomatic tone. It has firmly denied claims of a white genocide and insisted that the summit would proceed with or without the US.In a sudden about face, and with less than 48 hours to go before the G20 conference, the US announced that it would be sending a small team of its in-country diplomats to the handover ceremony, but that it wouldn't take part in any discussions.As tension between the two nations shows no sign of letting up, there are concerns that South African diplomats may be frozen out of meetings when the US takes over the G20 presidency next year.South Africa's Finance Minister, Enoch Godongwana, told reporters earlier this week that there's only one way they would not attend next year's meetings.\"We are members of the G20, we're not an invited country. So we don't need an invitation from anybody,\" he said.\"If the United States do not want us to participate, the only way they can do it is to decline us visas.\"Bloomberg via Getty ImagesAt a meeting earlier this year, Donald Trump ambushed Cyril Ramaphosa, South Africa's president, with widely discredited claims that white South Africans were being persecutedSo will South Africa manage to reach its aims without the presence of the world's wealthiest nation? Professor Richard Calland, from the Cambridge Institute for Sustainability Leadership, thinks it can.\"I think that people who are serious-minded in their analysis will not attach much weight to [the US' absence],\" he says.\"Ironically, the absence of President Trump may create more space for real consensus, because people won't be constantly looking over their shoulder at him and trying to anticipate or navigate his conduct and his positioning.\"Prof Calland adds that the absence of the US may enable middle powers to step up and push for the reforms they want by issuing a joint declaration.Answering reporters' questions at the summit's venue in Johannesburg on Monday, South African Foreign Minister Ronald Lamola echoed this sentiment.\"[The United States] are absent, so in their absence, the countries that are present must make a decision. \"We are forging ahead to persuade the countries that are present that we must adopt a leaders' declaration because the institution cannot be bogged down by someone who's absent,\" he said.The leaders' declaration is a culmination of work done throughout the year to build consensus on issues affecting the global economy, including trade barriers, technological advancements and climate change. It outlines what decisions the members have agreed to act on moving forward.President Trump isn't the only head of state who will not be attending. China's Xi Jinping is sending his Premier Li Qiang, who has represented the president in a number of meetings this year.Russian leader Vladimir Putin will also be absent due to the International Criminal Court's warrant against him.Mexico's Claudia Sheinbaum is another leader who will not be attending.And Argentinian President and Trump ally, Javier Milei, is skipping the summit in solidarity with Washington.However, unlike the US, all of these countries are sending senior delegations to represent their countries' interests.Mr Lamola was keen to downplay the significance of these absences, saying sometimes heads of state are not able to attend major events, and it is \"nothing abnormal\" for them to send a replacement.Other global powers have expressed their support of South Africa's presidency of the G20, including France, the UK and the European Union, which signed a deal with South Africa on Thursday agreeing to boost the extraction and, more importantly, the domestic processing, of critical minerals.African countries have long argued that processing minerals in their countries before exporting them would boost their economies by providing much-needed development, jobs and income.These are the types of initiatives that Pretoria has spent the year lobbying for across various working groups and ministerial meetings.South Africa is the last G20 country to take over the presidency in this current cycle. It's also the last country in the global south to host the gathering. Indonesia, India and Brazil have led the summit over the past three years.As such, the South African government says it wants to use its presidency to bridge the developmental divide between the global north and south. It wants to push for equity, sustainability and shared prosperity.Although building consensus through multilateral institutions like the G20 is becoming increasingly fraught in a divided world, Prof Calland argues that it is needed more than ever.\"Human life on Earth is facing an existential set of challenges, whether it's climate change, demographic shifts, technological revolution and so on.\"All of these are hugely difficult pressure points for human society. And you can't deal with them unless there is international collaboration and cooperation,\" he says.President Trump and his supporters argue that multilateral organisations do little to change real people's lives, preferring instead bilateral deals done directly between two countries.But South Africa and other developing countries argue that issues like reducing the cost of borrowing for poorer countries require the input of international institutions like the IMF and cannot be done through one-on-one deals.In many ways, South Africa's presidency of the G20 is part of a wider debate around multilateralism and its effectiveness. If South Africa is able to convince other G20 members to issue a joint declaration on Sunday, it might have succeeded in proving that consensus can be reached without the participation of the world's most powerful country.More BBC stories about South Africa:Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "G20: Will Trump’s no-show eclipse South Africa’s moment?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a101/live/6a31af10-c6fa-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-22T00:09:48.000Z",
      "dateModified": "2025-11-22T00:09:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South Africa declares gender violence a national disaster after protests",
    "url": "https://www.bbc.com/news/articles/cn979g302l9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/060c/live/3968e490-c6f8-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-21T15:20:30.000Z",
    "description": "21 hours agoKhanyisile Ngcobo, Nomsa Maseko,BBC Africa, Johannesburg and Danai Nesta KupembaSouth Africa has classified violence against women a natio",
    "body": "21 hours agoKhanyisile Ngcobo, Nomsa Maseko,BBC Africa, Johannesburg and Danai Nesta KupembaSouth Africa has classified violence against women a national disaster following an online campaign culminating in countrywide protests on Friday.Women were urged to \"withdraw from the economy for one day\", and lie down for 15 minutes at 12:00 local time (10:00 GMT) in honour of the 15 females who are murdered in the country every day.The state had refused to make the categorisation but changed tack after \"evaluating the persistent and immediate life-safety risks posed by ongoing acts of violence\".South Africa experiences some of the world's highest levels of gender-based violence (GBV), with the rate at which women are killed five times higher than the global average, according to UN Women.The National Disaster Management Centre (NDMC) has classified GBV and femicide a disaster following \"a thorough reassessment of previous reports and updated submissions from organs of state as well as civil organisations\", said Cooperative Governance and Traditional Affairs Minister Velenkosini Hlabisa.The NDMC had earlier said calls to make the categorisation did not meet legal requirements.Warning: This report contains descriptions of sexual assaultFridays \"lie downs\" happened in 15 locations across South Africa, including major cities such as Cape Town, Durban and Johannesburg.Allies in Eswatini, Kenya and Namibia have also expressed their support for the protest and say they joined in.The demonstrators wore black as a sign of \"mourning and resistance\".The protest, dubbed the G20 Women's Shutdown, has been organised by Women for Change, which has also been spearheading the online campaign that has seen many people, including celebrities, change their social media profile pictures to purple – a colour often linked to GBV awareness.There has also been an online petition, signed by over one million people. On Thursday, President Cyril Ramaphosa told the G20 Social Summit that South Africa had \"declared gender-based violence and femicide a national crisis\" in 2019. Shortly afterwards, Mr Hlabisa confirmed it had been upgraded to a national disaster and that an announcement would be made on Friday, according to Women for Change.The organisation shared a statement on its Instagram page on Thursday welcoming the news and telling its followers \"we have won\" and that their \"persistence has been recognised\".\"We have written history together [and] we have finally forced the country to confront the truth,\" it said.The categorisation allows government departments to use their allocated budgets to \"implement every measure possible\" to reduce the scourge, the cooperative governance ministry told the BBC.If these measures fail to bring change, the government can then declare a national state of disaster which would allow for the issue to be treated with even more urgency.Before the announcement, Women for Change spokesperson Cameron Kasambala told the BBC that \"so many beautiful acts and legislations\" had been followed by \"lack of implementation and transparency\" on the government's part.\"We've integrated violence… into our culture [and] into our social norms,\" she said.\"Once the government truly reacts to this issue, I feel like we'll already be able to see a reaction on the ground. Because they set the precedent and the tone for how the country responds.\"Grammy-award winning singer Tyla is among the thousands of celebrities and citizens who have rallied behind the call and changed their social media profiles. Some have gone further, posting pictures of purple hearts, nail polish and even clothing in what has since been dubbed the \"purple movement\".A South African professor who asked to remain anonymous told the BBC she had taken leave so she could travel to Johannesburg from Free State province to take part in the silent protest.It's important for her because she said she had second thoughts about simple things like jogging and hopes that the protest will \"slow the scourge\" of GBV.However, some women have faced a backlash from employers for wanting to participate in the protest. One product designer who works for a major cooperation said they were strongly advised against taking part. Some women who feel the government is not doing enough have taken matters into their own hands. Lynette Oxeley founded Girls on Fire to help women protect themselves through gun ownership.  It is legal to own a firearm in South Africa for self-defence if a person has a valid licence. Most of the women in her group have been raped, attacked, robbed, or experienced some level of violence.A growing number of women in South Africa are learning to use guns to protect themselvesPrudence joined the group after she was raped in 2022. \"I said: 'No'. I screamed, I cried but he didn't take no for an answer,\" she told the BBC. Trying to find justice was an \"uphill battle\" as her case was withdrawn because her rape kit - the DNA they take after the crime - was lost. It isn't a \"police problem, it is a nation problem,\" she said. Although the women are trained to shoot firearms, Ms Oxeley said using a gun was a \"last resort\". \"It's not about actually defending yourself with a firearm. I want ladies to change what they think about themselves. Stop being silent,\" she said. \"Even if you do not win the fight, at least you are fighting back.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South Africa declares gender violence a national disaster after protests",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/060c/live/3968e490-c6f8-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-21T15:20:30.000Z",
      "dateModified": "2025-11-21T15:20:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Christian converts are among the Iranians being sent home from US",
    "url": "https://www.bbc.com/news/articles/cdege0k962do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3c3d/live/fc7a6410-c73c-11f0-8c06-f5d460985095.png",
    "tag": "World",
    "date": "2025-11-22T03:32:39.000Z",
    "description": "The Christian converts the US is deporting back to Iran9 hours agoLeyla KhodabakhshiGetty ImagesPastor Ara Torosian says Iranian Christians fear what ",
    "body": "The Christian converts the US is deporting back to Iran9 hours agoLeyla KhodabakhshiGetty ImagesPastor Ara Torosian says Iranian Christians fear what will happen to them if deported back to IranOne Monday in mid-October, after a year in US immigration detention, officers arrived unannounced at Majid's cell in Texas.They told him simply to \"pack up\" - that he was being moved - even though an immigration judge had already granted him protection from removal five months ago. Shackled at the wrists, waist and ankles, he was driven through the night to a military airfield in Louisiana.Majid - not his real name - had fled Iran for the US in October 2024, after repeated detentions and alleged torture, first because of his involvement in the Mahsa Amini protests, and later because of his conversion to Christianity.When US officials forced him to board a plane carrying more than 150 deportees heading to Managua, Nicaragua, he remembers being the only non–Latin American on the plane. Hours later, the flight landed and officials handcuffed him, denied his request for asylum and directed him onto an itinerary routing him through Venezuela and Turkey toward Iran - a journey he understood as a forced return.Majid later was able to go into hiding in Istanbul, terrified of what awaited him back in Iran. He is one of several Iranian Christian converts who spoke to the BBC - most anonymously out of fear for relatives back home - whose asylum claims have been rejected in the past year. Their accounts point to inconsistencies in how US authorities assess the risks facing Iranian returnees and how sensitive religious information in asylum files is handled.Their experiences also run contrast to other elements of US foreign policy, as President Trump publicly laments the plight of Christian persecutions abroad, threatening to send troops into Nigeria \"guns a-blazing\" if its government \"continues to allow the killing of Christians\".Are Christians being persecuted in Nigeria as Trump claims?A White House official told the BBC that all individuals deported have had their asylum claims fully adjudicated before removal. The official said that recent deportations to Iran involved people with final orders of removal or those who had requested voluntary departure. They added that strict confidentiality rules prevent officials from disclosing whether someone applied for asylum and was denied.A rare deportation flightAs the US continues its crackdown on illegal immigration, it has made unprecedented changes to its policy towards Iranian asylum seekers. In late September, authorities arranged a chartered flight to Iran via Qatar - the first of its kind in decades, given the absence of diplomatic ties and Iran's human-rights record. The flight represented an unusual example of cooperation between Iran and the US.Dozens of Iranians were placed on the flight, reportedly in shackles. One deportee, Sina, later described armed guards escorting passengers on the Qatar–Tehran leg. On arrival, they were questioned about their time in the US and their religious activities but were not immediately arrested, he said in a video, which was posted on a Farsi-language YouTube channel.Among the passengers was the wife of Ali, an Iranian Christian convert now living in the US. She has since been contacted and summoned by Iranian intelligence.\"They deported my wife back to Iran even though she is a Christian,\" Ali says - the BBC has given him a pseudonym to protect the identity of him and his wife. \"Now Iranian intelligence is after her and me.\"For Ali's wife and others, the danger was heightened by what their lawyers say was a critical mistake.Attorney Ali Herischi, who represents Ali, his wife, and another deportee from the September flight says several clients reported that sensitive information - including statements about religious conversion, political activity and the reasons they sought asylum - was not removed before deportation.US deporting 120 Iranians after deal struck with Tehran, Iran saysDetained in immigration raids, Maga mom still has faith in Trump's mass deportation planWhy returning is dangerous for Christian convertsConverts from Islam make up a significant share of Iran's 800, 000 Christian population, says Steve Dew-Jones of Article 18, a UK-based advocacy group that monitors violations against Christians in the country.With officially recognised churches tightly restricted, house churches have begun to emerge across the country. But practitioners continue to face persecution, Dew-Jones says.Converting from Islam is treated as apostasy, and converts face arrest, interrogation and prison terms.Iran: The Christians celebrating Easter in secretArrests have increased sixfold between 2023 and 2024, the Center for Human Rights in Iran reports. \"Since the recent Iran–Israel clashes, we've seen the authorities use the term 'Zionist Christianity' even more aggressively. By branding converts as agents of Israel, the state frames ordinary religious practice as a national-security threat,\" Dew-Jones adds.Some Iranians seeking asylum abroad cite conversion as part of their claim, while Iranian officials accuse them of exaggerating or fabricating conversions to strengthen their cases.But it is unclear how many US asylum cases may be exaggerated, versus real fear of persecution.\"It's impossible to judge the sincerity of someone's faith - there's no window into people's souls,\" Dew-Jones says. \"Yes, the system can be abused, but we also see many legitimate converts whose testimonies and church records aren't taken seriously by asylum courts.\"Life on hold for those left behindAsylum outcomes can diverge sharply even within a single household, Iranian asylum seekers and legal experts say.In late June, ICE officers arrived at Marjan and Reza's house in Los Angeles. In video filmed by their pastor, Marjan is seen collapsed outside as agents detain her husband. Moments earlier she had called him pleading for help. The couple - both Christian converts from Iran who had applied for asylum in the US - were taken to separate detention centres. Weeks later, their cases diverged: Marjan was granted asylum in California, while Reza, held in New Mexico, was ordered to be removed to a third country.After their June arrest, the Department of Homeland Security said on its X account that \"during a targeted enforcement operation in Los Angeles, Border Patrol agent apprehended two Iranian nationals unlawfully present in the US - both flagged as subjects of national security interest.\"Submitted photoA screenshot of the video filmed by Pastor Ara, showing Reza and Marjan being detained by immigration enforcementPastor Ara Torosian, who filmed their arrest, disputes the Department of Homeland Security's claim that the couple were unlawfully present in the US.He says they entered legally through a humanitarian programme and had work authorisations. \"How can it be dangerous for the wife but not for the husband?\" asks pastor, Ara Torosian, who himself fled Iran in 2010 after being detained for smuggling Bibles.Majid, who managed to slip through the airport in Turkey, has been living in limbo since, while his lawyer follows up on his case. His wife, whose asylum case is still pending, now lives in Los Angeles with their 1.5-year-old daughter - a child who has never met her father.In the US, Ali is living with a friend from his church, and hoping his own asylum claim will be more successful than that of his wife, who was deported to Iran this year.\"If they grant me asylum, how can I stay here when my wife is in Iran? If they deport me, I could go to prison the moment I land.\"Unable to work legally or open a bank account. He first stayed with a distant relative \"just until my wife's case was resolved,\" but she was never released and, after nearly a year in detention, was deported. A small church later offered him temporary shelter.\"Anytime they ask me to leave, I have to sleep in parks,\" he says.He is awaiting an immigration hearing but sees no good outcome. His wife has received another summons from Iranian intelligence.\"If they arrest her and demand I return,\" he says quietly, \"I'll have no choice.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Christian converts are among the Iranians being sent home from US",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3c3d/live/fc7a6410-c73c-11f0-8c06-f5d460985095.png"
      ],
      "datePublished": "2025-11-22T03:32:39.000Z",
      "dateModified": "2025-11-22T03:32:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Russian envoy Kirill Dmitriev: Putin propagandist or key to peace with Ukraine?",
    "url": "https://www.bbc.com/news/articles/c3rjr2r72gpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/35db/live/f425bf50-c63b-11f0-8c98-11fe43704bb5.jpg",
    "tag": "World",
    "date": "2025-11-21T07:15:00.000Z",
    "description": "1 day agoPaul Kirby,Europe digital editor and BBC MonitoringBloomberg via Getty ImagesKirill Dmitriev has played a prominent role in Russia's return f",
    "body": "1 day agoPaul Kirby,Europe digital editor and BBC MonitoringBloomberg via Getty ImagesKirill Dmitriev has played a prominent role in Russia's return from diplomatic isolation in 2025Kirill Dmitriev is a rare breed of Russian diplomat.At 50 he is relatively young and he has a deep understanding of the US, having studied and worked there for several years.He is also a man of commerce, as head of the Russian Direct Investment Fund, and a good fit for his opposite number in the Trump administration, special envoy Steve Witkoff.Dmitriev now finds himself under the spotlight over a draft peace plan that emerged after he spent three days with Witkoff in Miami.His team has refused to comment on its proposals, which read like a Putin wishlist, requiring Ukraine to cede territory under its control and slash the size of its military.Ukraine's Volodymyr Zelensky has been careful not to reject its terms, but says any deal must bring a \"dignified peace, with terms that respect our independence, our sovereignty\".  VYACHESLAV PROKOFYEV/POOL/AFPWitkoff (R) and Dmitriev have struck up a close diplomatic rapportPutin's special envoy understands modern Ukraine better than most in Moscow. He was brought up in Ukraine, and a friend claims that as a 15-year-old Dmitriev took part in pro-democracy protests in Kyiv before the fall of the Soviet Union.He has been a fixture of US-Russian diplomatic initiatives pretty much since the start of Trump's second presidency - and Steve Witkoff has been a regular counterpart.\"We are sure we are on the road to peace, and as peacemakers we need to make it happen,\" Dmitriev told a conference in Saudi Arabia in late October.The pair appear to have first crossed paths in February 2025 when Putin's envoy played a role in securing the release of an American teacher from a Russian jail.\"There's a gentleman from Russia, his name is Kirill, and he had a lot to do with this. He was important. He was an important interlocutor bridging the two sides,\" Witkoff told reporters.Days later, when US and Russian diplomats met in Saudi Arabia, in effect bringing an end to Russia's diplomatic isolation in the West, Dmitriev took part in talks on economic relations and Witkoff was there too.Dmitriev's direct approach to Trump officials has not always paid off. When Trump announced sanctions on Russia's top two oil firms last month, US Treasury Secretary Scott Bessent labelled him a \"Russian propagandist\" for suggesting it would mean higher US fuel prices at the pump.Unlike the majority of Putin's entourage, the Russian leader's envoy is comfortable in a US TV studio. He is careful to praise Trump's diplomatic skills while giving Western viewers the Russian government narrative in their own language.\"I'm not a military guy… but the position of [the] Russian military is they only hit military targets,\" he told CNN's Jake Tapper recently, days after a kindergarten was bombed in the Ukrainian city of Kharkiv. \"I'm just working to have dialogue and make sure that the conflict is ended as soon as possible.\"Dmitriev certainly is not a military guy, he's a private investment specialist with an eye for a deal.Getty ImagesWhen Putin travelled to the UAE in August, Dmitriev was there in the backgroundWitkoff may rate him, but in 2022 during Joe Biden's presidency, the US Treasury called him a \"known Putin ally\"  and imposed sanctions on the Russian Direct Investment Fund (RDIF) which he has run since 2011.\"While officially a sovereign wealth fund, RDIF is widely considered a slush fund for President Vladimir Putin and is emblematic of Russia's broader kleptocracy,\" it said.Dmitriev's attitude to the Biden years is pretty clear: under Biden there was no attempt to understand the Russian position, he argues, while Trump's team stopped World War Three.OLGA MALTSEVA/AFPDmitriev's wife is a friend of Katerina Tikhonova, a daughter of Vladimir PutinIt is claimed that Dmitriev has accumulated a real estate fortune with his wife, TV presenter Natalia Popova.Popova is a friend and colleague of Vladimir Putin's daughter, Katerina Tikhonova - and deputy head of Tikhonova's tech firm Innopraktika. Dmitriev is also widely seen as part of Tikhonova's circle.His rise to the top in Moscow is a far cry from his childhood in Kyiv, as the son of two scientists. Dmitriev's father is a well known cell biologist in Ukraine and his mother a geneticist.That scientific background may have influenced his move to use his Russian sovereign wealth fund to finance Russia's Covid vaccine Sputnik V.Dmitriev is believed to have first met Russia's long-time leader at the start of his presidency in 2000, but he has not always agreed with his views.While Putin saw the collapse of the Soviet Union as the \"biggest geopolitical catastrophe of the century\", a friend claims Dmitriev joined an anti-Soviet student protest in Kyiv at the age of 15.His relationship with the US began the same year, in 1990, when he took part in a student exchange programme in New Hampshire, where a local newspaper quoted him highlighting Ukraine's national identity: \"Ukraine had a long history as an independent nation before it became part of the Russian empire.\"He later returned to the US as a college student and wrote a thesis on privatisation in Ukraine while at Stanford University. In his thesis proposal he suggested the research would \"prepare me better for making a contribution to the reform process in Ukraine\".After earning an MBA at Harvard, he worked for McKinsey in Los Angeles, Prague and Moscow, and then joined the US-Russia Investment Fund, set up by the US to ease Russia's transition to a market economy.Dmitriev appeared critical of Putin's crackdown on Russia's oligarchs in 2003 in a column for the Vedomosti business paper. \"The world is shrewd enough to know the difference between following the letter of the law and using the law as a tool of influence,\" he wrote.By 2007 he was back in Ukraine, in charge of Icon Private Equity, an investment fund with offices in Kyiv and Moscow.Increasingly he lamented Ukraine's political \"instability\" and suggested Russia was better placed to respond to the global financial crisis.He was a regular guest on TV talk shows and in 2010 he warned Ukraine would face an \"economic Holodomor\"  if it pursued a policy of isolation from Russia: a reference to the Ukrainian famine of the1930s brought on by the policies of Soviet dictator Joseph Stalin.In 2011 he moved back to Russia to take charge of the newly-launched Russian Direct Investment Fund and remains there to this day.His overtures to the Trump administration have not come out of the blue.The Mueller report into the Trump campaign's ties to Russia during the 2016 US presidential election refers to Dmitriev meeting campaign supporters after the vote. But it was from February 2025 that contacts with the US were stepped up.Much of his work has been on diplomacy, but he has always had an eye on commercial opportunity. He proposed joint energy projects in the Arctic, and suggested partnering Russia's sovereign wealth fund with US companies in developing rare earth deposits.He has also spoken of Russia offering Elon Musk \"a small-sized nuclear power plant for a mission to Mars\" and even an $8bn (£6bn) \"Putin-Trump\" rail tunnel linking their two countries beneath the Bering Strait.Dmitriev's stock may be rising in Russia, but his reputation has taken a dive in Ukraine, where sanctions have been imposed on him for alleged crimes against Ukraine and Ukrainians.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Russian envoy Kirill Dmitriev: Putin propagandist or key to peace with Ukraine?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/35db/live/f425bf50-c63b-11f0-8c98-11fe43704bb5.jpg"
      ],
      "datePublished": "2025-11-21T07:15:00.000Z",
      "dateModified": "2025-11-21T07:15:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]