[
  {
    "title": "Two dead in 50-vehicle pile up on Japan highway",
    "url": "https://www.bbc.com/news/articles/c157e9dddwwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d101/live/685fca30-e312-11f0-b67b-690eb873de1b.jpg",
    "tag": "World",
    "date": "2025-12-27T12:03:20.000Z",
    "description": "17 hours agoTinshui YeungJapan motorway crash involving 56 cars leaves one person deadA pile-up involving at least 50 vehicles on a highway in central",
    "body": "17 hours agoTinshui YeungJapan motorway crash involving 56 cars leaves one person deadA pile-up involving at least 50 vehicles on a highway in central Japan has left two people dead and 26 injured, according to police.The incident was caused by a crash between two trucks, sparking a chain reaction that set at least 10 vehicles on fire, local police said.A 77-year-old woman from Tokyo was killed, and another body was discovered in the driver's seat of a burnt-out truck. Five people were seriously injured and 21 suffered minor injuries, police said.There was a heavy snow warning in place at the time of the crash. Police believe icy surfaces likely caused the trucks to skid on the roads.The crash happened on the Kan-etsu Expressway in Minakami, Gunma prefecture, about 160km (100 miles) north-west of Tokyo, at about 19:30 local time (10:30 GMT) on 26 December.It took about seven and a half hours to put out the fire, police said. Following the incident, a section of the highway was closed, with a long line of vehicles, many charred beyond recognition, stuck in the outbound lane. Work is under way to tow them away.A man in his 60s, whose vehicle was involved in the accident, told local media outlet NHK he heard a loud explosion from the far end of the pile-up and saw fire during the crash. The blaze then spread to other vehicles, he said.He said he was evacuated to a nearby toll gate with about 50 other people and spent the night in the hallway there.Nexco, which operates the road, said checks were needed to see if the surface was damaged by the fire.The company is warning travellers not to use the highway.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two dead in 50-vehicle pile up on Japan highway",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d101/live/685fca30-e312-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-27T12:03:20.000Z",
      "dateModified": "2025-12-27T12:03:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nine arrested in Italy for allegedly raising millions for Hamas",
    "url": "https://www.bbc.com/news/articles/cqxq59np394o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e9b1/live/e3b9d560-e324-11f0-9cea-f1ab704c03ad.jpg",
    "tag": "World",
    "date": "2025-12-27T15:25:18.000Z",
    "description": "Italian police have arrested nine people accused of raising around €7m (£6m) for Hamas over more than two years.The money was ostensibly collected as ",
    "body": "Italian police have arrested nine people accused of raising around €7m (£6m) for Hamas over more than two years.The money was ostensibly collected as humanitarian aid for Palestinian civilians, a police statement said, but was instead sent to the militant group via a \"complex fundraising system\".Alongside the arrests, police say they have seized more than €8m (£7m) in assets as part of the investigation. Police say the suspects are \"specifically accused of carrying out financing operations believed to have contributed to terrorist activities\".The arrests were made as part of a joint initiative between Italy's counter-terror police and financial police.The investigation began after the 7 October 2023 Hamas attack in southern Israel. Police say they analysed \"a series of reports of suspicious financial transactions\" involving some of the suspects in the lead up to the attack.Investigators uncovered a \"complex\" system of fundraising, which was headquartered in Genoa with branches in Milan, the statement adds.\"The suspects collected donations intended for the civilian population of Gaza, however, it emerged that over 71% of these funds were diverted to Hamas's coffers to finance its military wing and support the families of suicide bombers or those detained for terrorism,\" the police statement says.Interior Minister Matteo Piantedosi said the most well-known of the arrested suspects was Mohammad Hannoun, the president of the Palestinian Association in Italy.Mr Hannoun has previously described allegations he is a financier of Hamas as a \"lie\". Piantedosi thanked police for their work in a post on X, but also noted that \"the presumption of innocence... must always be recognised at this stage\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nine arrested in Italy for allegedly raising millions for Hamas",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e9b1/live/e3b9d560-e324-11f0-9cea-f1ab704c03ad.jpg"
      ],
      "datePublished": "2025-12-27T15:25:18.000Z",
      "dateModified": "2025-12-27T15:25:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Homs: Deadly explosion during Friday prayers inside Syrian mosque",
    "url": "https://www.bbc.com/news/articles/cx25387dj8no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0e75/live/1ca8ab90-e25c-11f0-9cc8-5f4006175918.jpg",
    "tag": "World",
    "date": "2025-12-26T15:01:16.000Z",
    "description": "An explosion has killed at least eight people and injured 18 others during Friday prayers inside a mosque in the Syrian city of Homs, the health minis",
    "body": "An explosion has killed at least eight people and injured 18 others during Friday prayers inside a mosque in the Syrian city of Homs, the health ministry has said.Pictures from Syria's state-run news agency, Sana, show the inside of the Imam Ali ibn Abi Talib Mosque with black, scorched walls, smashed windows and blood on the carpet.Officials believe that an explosive was detonated inside the building, Sana reports, citing a security source. While authorities are still searching for the perpetrators, jihadist group Saraya Ansar al-Sunnah said it was behind the explosion.The mosque is in the Wadi al-Dhahab neighbourhood, where most people are part of the Alawite ethnoreligious group. Syria's Foreign Ministry condemned the \"terrorist crime\", writing in a statement on X that the \"cowardly act is a blatant assault on human and moral values\" designed to \"undermine the security and stability\" of the country.Saraya Ansar al-Sunnah, a Sunni extremist group, has said it carried out the attack in collaboration with another unidentified group, using explosives planted at the site.The group's vague origins and opaque affiliations, which came to prominence in June when it said it was behind a deadly church bombing in Damascus, have raised questions about its true links and authenticity. Some observers have speculated that it could be a front for Islamic State group (IS) given the similarity in their messaging and type of targets.The latest claim follows a months-long lull in Saraya Ansar al-Sunnah's claimed attacks, which have largely taken the form of alleged targeted killings of minorities and what the group describes as \"remnants\" of the former Syrian government of Bashar al-Assad.The blast comes a year after Syrian rebel forces overthrew Assad, who is Alawite. The sect is an offshoot of Shia Islam whose members make up one of the country's biggest religious minorities.Since then, Syria has seen several waves of sectarian violence, with Alawites fearing reprisals and being subject to crackdowns. Assad fled to Russia, an ally of his regime, where he and his family have been given asylum.In March, security forces were accused of killing dozens of Alawites in the coastal province of Latakia, war monitoring group Syrian Observatory for Human Rights (SOHR) reported.Additional reporting by BBC Monitoring ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Homs: Deadly explosion during Friday prayers inside Syrian mosque",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0e75/live/1ca8ab90-e25c-11f0-9cc8-5f4006175918.jpg"
      ],
      "datePublished": "2025-12-26T15:01:16.000Z",
      "dateModified": "2025-12-26T15:01:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New York snowstorm sparks travel chaos",
    "url": "https://www.bbc.com/news/articles/c0je0l55zq3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dc20/live/6cca9200-e34c-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "World",
    "date": "2025-12-28T01:54:10.000Z",
    "description": "New York blanketed in snow, sparking travel chaos3 hours agoKwasi Gyamfi AsieduNew York CityAFP via Getty ImagesSome 4.3in of snow was recorded in Cen",
    "body": "New York blanketed in snow, sparking travel chaos3 hours agoKwasi Gyamfi AsieduNew York CityAFP via Getty ImagesSome 4.3in of snow was recorded in Central ParkNew York has woken up to its heaviest snowfall in nearly four years after a winter storm blanketed parts of the US north-east.New York City's Central Park recorded 4.3in (11cm) of snow, its highest since January 2022, while other parts of the state saw up to 7.5in of snow, said the US National Weather Service (NWS).New York Governor Kathy Hochul declared a state of emergency for more than half of counties in the state ahead of the storm. On Saturday, more than 900 flights were cancelled, mostly in the New York area, while more than 8,000 were delayed nationwide, according to tracking website FlightAware.ReutersA Central Park skierBy early Saturday, about 6-10in of snow had fallen from Syracuse in central New York to Long Island in the south-east of the state.High snowfall was recorded in neighbouring New Jersey, where a state of emergency was also declared, and in Connecticut, where 9.1in of snow fell in Fairfield County.AFP via Getty ImagesThe New York City borough of Brooklyn on SaturdayThe worst of the storm was over by Saturday morning, but temperatures were below freezing and road conditions hazardous. The NWS warned melting snow could lead to black ice forming on roads and bridges.The state activated a \"code blue\" to bring homeless people inside from the cold.Getty ImagesChildren sled in the snow in Brooklyn after an overnight stormGetty ImagesA snowman stands near a park benchWatch: Powerful storm batters southern California",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New York snowstorm sparks travel chaos",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dc20/live/6cca9200-e34c-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-28T01:54:10.000Z",
      "dateModified": "2025-12-28T01:54:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Two killed in suspected Palestinian ramming and knife attack in Israel",
    "url": "https://www.bbc.com/news/articles/c9d9znp22pyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9531/live/c40b2e50-e255-11f0-b67b-690eb873de1b.jpg",
    "tag": "World",
    "date": "2025-12-26T23:49:29.000Z",
    "description": "1 day agoRaffi BergMagen David AdomThe attacker drove into people and then carried out a stabbing several miles away, police sayTwo people have been k",
    "body": "1 day agoRaffi BergMagen David AdomThe attacker drove into people and then carried out a stabbing several miles away, police sayTwo people have been killed in what police say was a \"rolling terror attack\" in northern Israel.Police said the attacker ran over a pedestrian in the eastern city of Beit Shean, then drove on before stabbing a woman near Ein Harod, about 8 miles (12.5km) to the west. The suspect was eventually shot and wounded by a civilian outside the city of Afula, according to police.Shimshon Mordechai, a 68-year-old man, was killed and a 16-year-old boy was hurt in Friday's ramming, officials said, while the stabbing victim was Aviv Maor, aged 18.A day before the attack, an Israeli reservist was fired after video emerged of him ramming a praying Palestinian with a quad bike. The suspect in the attack came from the village of Qabatiya, in the northern occupied West Bank, Israeli Defence Minister Israel Katz said.Following the incident, the Israel Defense Forces (IDF) said it was preparing to carry out an operation in the Qabatiya area. Katz said he had instructed the IDF to act \"forcefully and immediately\". The IDF said the suspect had \"infiltrated into Israeli territory several days ago\".Israel's Kan News public broadcaster said the 37-year-old man had been working illegally in Israel and had used his employer's vehicle in the attack.Prime Minister Benjamin Netanyahu expressed \"deepest condolences\" to the victims' families.In a post on X, he also praised \"the heroic citizen who neutralised the terrorist\".The incident comes a day after the army reservist drove a quad bike into a Palestinian man who was praying on a roadside in the West Bank.Video shows the man, dressed in civilian clothes but with a firearm, ramming the victim with the vehicle. Reports say the victim was unhurt. The Israeli military said the soldier - who had earlier opened fire in a nearby village - had been fired and his weapon confiscated.Attacks by Israeli settlers on Palestinians have surged in the West Bank in recent years, according to the United Nations, with more than a thousand killed since the Hamas attacks on Israel of 7 October 2023 in which about 1,200 people were killed and 251 abducted into Gaza.More than 70,600 people have been killed in Israeli attacks in Gaza since then, according to the territory's Hamas-run health ministry.Additional reporting by Tom McArthur",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two killed in suspected Palestinian ramming and knife attack in Israel",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9531/live/c40b2e50-e255-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-26T23:49:29.000Z",
      "dateModified": "2025-12-26T23:49:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thailand-Cambodia ceasefire begins after weeks of deadly clashes",
    "url": "https://www.bbc.com/news/articles/c0q5je8048xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/adf5/live/55b0f7b0-e308-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "World",
    "date": "2025-12-27T13:55:22.000Z",
    "description": "15 hours agoJonathan Head,South East Asia correspondentandTabby WilsonA ceasefire between Thailand and Cambodia has come into effect along the border,",
    "body": "15 hours agoJonathan Head,South East Asia correspondentandTabby WilsonA ceasefire between Thailand and Cambodia has come into effect along the border, where almost three weeks of deadly clashes have forced nearly one million people from their homes.In a joint statement, the defence ministers of the two countries agreed to freeze the front lines where they are now, ban reinforcements and allow civilians living in border areas to return as soon as possible.The ceasefire took effect at noon local time (05:00 GMT) on Saturday. Once it has been in place for 72 hours, 18 Cambodian soldiers held by Thailand since July will be released, the statement said.The breakthrough came after days of talks between the two countries, with diplomatic encouragement from China and the US.The agreement prioritises getting the displaced back to their homes, and also includes an agreement to remove landmines.Thailand's Defence Minister Natthaphon Narkphanit described the ceasefire as a test for the \"other party's sincerity\".\"Should the ceasefire fail to materialise or be violated, Thailand retains its legitimate right to self-defence under international law,\" he told reporters.UN human rights chief Volker Türk said he hopes the ceasefire will \"pave the way\" for peace, while an EU spokesperson urged \"good faith\" in its implementation.Thailand had been reluctant to accept the ceasefire, saying the last one was not properly implemented. They also resented what they saw as Cambodia's efforts to internationalise the conflict.Unlike the last ceasefire in July, US President Donald Trump was conspicuously absent from this one, although the US State Department was involved.That ceasefire agreement collapsed earlier this month, when fresh clashes erupted. Both sides blamed each other for the breakdown of the truce.The Thai army said its troops had responded to Cambodian fire in Thailand's Si Sa Ket province, in which two Thai soldiers were injured.Cambodia's defence ministry said it was Thai forces that had attacked first, in Preah Vihear province, and insisted that Cambodia did not retaliate.Clashes have continued throughout December. On Friday, Thailand carried out more air strikes inside Cambodia.The Thai Air Force said it had hit a Cambodian \"fortified military position\" after civilians had left the area. Cambodia's defence ministry said the strikes were \"indiscriminate attacks\" against civilian houses.How well the ceasefire holds this time depends to a large extent on political will. Nationalist sentiment has been inflamed in both countries.Cambodia, in particular, has lost many soldiers and a lot of its military equipment. It has been driven back from positions it held on the border, and suffered extensive damage from the Thai air strikes, grievances which could make a lasting peace harder to achieve.Disagreement over the border dates back more than a century, but tension increased early this year after a group of Cambodian women sang patriotic songs in a disputed temple.A Cambodian soldier was killed in a clash in May, and two months later, in July, there were five days of intense fighting along the border, which left dozens of soldiers and civilians dead. Thousands more civilians were displaced.Following intervention by Malaysia and President Trump, a fragile ceasefire was negotiated between the two countries, and signed in late October.Trump dubbed the agreement the \"Kuala Lumpur Peace Accords\". It mandated both sides to withdraw their heavy weapons from the disputed region, and to establish an interim observer team to monitor it.However, the agreement was suspended by Thailand in November after Thai soldiers were injured by landmines, with Thai Prime Minister Anutin Charnvirakul announcing that the security threat had \"not actually decreased\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thailand-Cambodia ceasefire begins after weeks of deadly clashes",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/adf5/live/55b0f7b0-e308-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-27T13:55:22.000Z",
      "dateModified": "2025-12-27T13:55:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Four hikers found dead after avalanche in central Greece",
    "url": "https://www.bbc.com/news/articles/c23ejnge95jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/355c/live/11f463d0-e33b-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "World",
    "date": "2025-12-27T12:36:09.000Z",
    "description": "Four hikers who went missing on Christmas Day have been found dead after being buried by an avalanche in the Vardousia Mountains in central Greece.The",
    "body": "Four hikers who went missing on Christmas Day have been found dead after being buried by an avalanche in the Vardousia Mountains in central Greece.The bodies of three men and a woman were found on Friday evening after a large-scale search in the mountainous region of Fokida, according to Greek state broadcaster ERT.Fire authorities located the bodies partially covered by snow on a steep and inaccessible slope near the summit of Korakas peak, at an altitude of about 2,000m (6,561ft). Rescue officials said the group was swept away by an avalanche.Authorities said the hikers had begun their ascent in favourable weather, but conditions quickly worsened due to the altitude and the area's terrain.Vasilis Vathrakogiannis, a spokesperson for the Hellenic Fire Service, told the BBC the alarm was raised by a friend of the three men after they failed to return at the expected time.\"Weather conditions were extremely difficult, with low temperatures and poor visibility,\" he said, adding this made it hard for both drones and a helicopter to detect anything.He said a fire service ground team later found the bodies of the three men and a woman, who was confirmed to be a friend of one of them and had not been expected to take part in the climb.Recovery efforts were under way on Saturday, in what officials described as an extremely challenging operation. One of the bodies was successfully airlifted by helicopter. Efforts continue to move the remaining three to a nearby plateau so they can be recovered using a winch. Haris Asariotakis, head of the Hellenic Rescue Team mission at the scene, said the location was particularly difficult.\"It is about three hours from the village of Athanasios Diakos, at an altitude of 2,000m,\" he said. \"If the helicopter is unable to reach the area, we will descend on foot together with firefighters and mountain guides.\"Additional reporting by Kostas Koukoumakas",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Four hikers found dead after avalanche in central Greece",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/355c/live/11f463d0-e33b-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-27T12:36:09.000Z",
      "dateModified": "2025-12-27T12:36:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "1MDB: Ex-Malaysia PM Najib Razak given 15-year jail term over state funds scandal",
    "url": "https://www.bbc.com/news/articles/crk7y27vp1eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c5b4/live/ff6f0410-e1f8-11f0-8273-0be0c7acd73f.jpg",
    "tag": "World",
    "date": "2025-12-26T14:15:36.000Z",
    "description": "Former Malaysian Prime Minister Najib Razak has been jailed for 15 years for abuse of power and money laundering, in his second major trial for a mult",
    "body": "Former Malaysian Prime Minister Najib Razak has been jailed for 15 years for abuse of power and money laundering, in his second major trial for a multi-billion-dollar state funds scandal.Najib, 72, was accused of misappropriating nearly 2.3 billion Malaysian ringgit ($569m; £422m) from the nation's sovereign wealth fund 1Malaysia Development Berhad (1MDB).On Friday afternoon a judge found him guilty in four charges of abuse of power and  21 charges of money laundering. The former PM is already in jail after he was convicted years ago in another case related to 1MDB.Friday's verdict comes after seven years of legal proceedings, which saw 76 witnesses called to the stand.The verdict, delivered in Malaysia's administrative capital Putrajaya, is the second blow in the same week to the embattled former leader, who has been imprisoned since 2022.He was handed four 15-year sentences on abuse of power charges, as well as five years each on 21 money laundering charges. The jail terms run concurrently under Malaysian law. On Monday, the court rejected his application to serve the remainder of his sentence under house arrest. But the former prime minister retains a loyal base of supporters, who claim that he's a victim of unfair rulings and who have showed up at his trials calling for his release.On Friday, dozens of people gathered outside the court in Putrajaya in support of Najib.The 1MDB scandal made headlines across the world when it came to light a decade ago, embroiling prominent figures from Malaysia to Goldman Sachs and Hollywood.Investigators estimated that $4.5bn was siphoned from the state-owned wealth fund into private pockets, including Najib's.Najib's lawyers claim that he had been misled by his advisers - in particular the financier Jho Low, who has maintained his innocence but remains at large.But the argument has not convinced Malaysia's courts, which previously found Najib guilty of embezzlement in 2020.That year, Najib was convicted of abuse of power, money laundering and breach of trust over 42 million ringgit ($10m; £7.7m) transferred from SRC International - a former unit of 1MDB - into his private accounts.He was sentenced to 12 years in prison, but saw his jail term halved last year.The latest case concerns a larger sum of money, also tied to 1MDB, received by his personal bank account in 2013. Najib said he had believed the money was a donation from the late Saudi King Abdullah - a claim rejected by the judge on Friday.Separately Najib's wife, Rosmah Mansor, was sentenced to ten years in jail in 2022 for bribery. She is free on bail pending an appeal against her conviction.The scandal has had profound repercussions on Malaysian politics. In 2018 it led to a historic election loss for Najib's Barisan Nasional coalition, which had governed the country since its independence in 1957.Now, the recent verdicts has highlighted fissures in Malaysia's ruling coalition, which includes Najib's party United Malays National Organisation (UMNO).Najib's failed house arrest bid on Monday was met with disappointment from his allies but celebrated by his critics within the same coalition.Malaysia's Prime Minister Anwar Ibrahim called for politicians on all sides to respect the court's decisions.Former Malaysian lawmaker Tony Pua told the BBC's Newsday programme that the verdict would \"send a message\" to the country's leaders, that \"you can get caught for corruption even if you're number one in the country like the prime minister\".But Cynthia Gabriel,  founding director of Malaysia's Center to Combat Corruption and Cronyism, argued that the country has made little headway in anti-corruption efforts despite the years of reckoning after the 1MDB scandal.Public institutions have not been strengthened enough to reassure Malaysians that \"the politicians they put into power would actually serve their interests\" instead of \"their own pockets\", she told Newsday.\"Grand corruption continues in different forms\", she added. \"We don't know at all if another 1MDB could occur, or may have already occurred.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "1MDB: Ex-Malaysia PM Najib Razak given 15-year jail term over state funds scandal",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c5b4/live/ff6f0410-e1f8-11f0-8273-0be0c7acd73f.jpg"
      ],
      "datePublished": "2025-12-26T14:15:36.000Z",
      "dateModified": "2025-12-26T14:15:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US launches strikes against Islamic State in Nigeria",
    "url": "https://www.bbc.com/news/articles/cj69j8l918do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4bf4/live/41eb4620-e27e-11f0-ad77-b944aa312773.jpg",
    "tag": "World",
    "date": "2025-12-27T16:54:19.000Z",
    "description": "12 hours agoJaroslav LukivandMakuochi OkaforBBCOne strike hit a field near a village in Sokoto stateThe US has launched \"powerful and deadly\" strikes ",
    "body": "12 hours agoJaroslav LukivandMakuochi OkaforBBCOne strike hit a field near a village in Sokoto stateThe US has launched \"powerful and deadly\" strikes against militants linked to the Islamic State group (IS) in north-western Nigeria, where militants have sought to establish a foothold, President Donald Trump said. Trump told Politico he ordered the 25 December strikes as \"a Christmas present\" - contradicting a statement by Nigerian officials.Camps run by the group in Sokoto state were hit near the border with Niger, the US military said. Casualty numbers are unclear, but both US and Nigerian officials say militants were killed.Nigerian Foreign Minister Yusuf Maitama Tuggar told the BBC it was a \"joint operation\" and had \"nothing to do with a particular religion\".Tuggar said the strikes had been planned \"for quite some time\" using intelligence provided by Nigeria. He did not rule out further strikes. Referring to the timing of strikes - which took place late on Thursday - he said they did not have \"anything to do with Christmas\".But Trump told Politico otherwise in an interview. \"They were going to do it earlier,\" Trump said of the airstrikes. \"And I said, 'nope, let's give a Christmas present.'\"They didn't think that was coming, but we hit them hard. Every camp got decimated.\"The US military said an \"initial assessment\" suggested \"multiple\" fatalities in Sokoto state.A local official in the Tangaza area of Sokoto state, Isa Salihu Bashir, told the BBC the strikes had \"hit some Lakurawa terrorist camps\". He said many fighters had been killed but the death toll was unclear.The BBC has been unable to independently confirm casualty figures.Bashir added that border patrols on the Niger side reported seeing Lakurawa fighters fleeing the targeted areas.The Nigerian government has long been fighting an array of jihadist groups, including Boko Haram and IS-linked factions, but largely in the north-east. But in recent years a smaller group - known locally as Lakurawa - has sought to establish a base in north-western Sokoto state.Nigerian authorities say the group has links to jihadist networks in Mali and Niger. They add that its members have settled in border communities, recruited young people, and imposed harsh controls.Tangaza is made up of remote villages, whose residents are mostly moderate Muslims. In a statement late on Friday, Nigeria's information ministry said \"precision strike operations\" had been carried with the \"explicit approval\" of President Bola Tinubu and with \"the full involvement of the armed forces of Nigeria\".It also said that during the operation debris from munitions fell in two communities – the village of Jabo, also in Sokoto state, and Offa in Kwara state, about 600km (370 miles) to the south. No civilian casualties were reported in either location.Umar Jabo, an eyewitness in Jabo, told the BBC: \"Something that looked like a plane flashed and crashed... in fields.\" He said there was no issue with IS in the area: \"We live peacefully, and there is no conflict between us and Christians.\"The Trump administration has previously accused the Nigerian government of failing to protect Christians from jihadist attacks and has claimed a \"genocide\" is being perpetrated.Trump has labelled Nigeria a \"country of particular concern\", a designation used by the US state department that provides for sanctions against countries \"engaged in severe violations of religious freedom\".The US military was ordered to prepare to intervene in Nigeria in November.US Department of DefenseThe US defence department posted a short video that appears to show a missile being launched from a military vesselIn a social media post late on Christmas Day confirming the strikes, Trump said that he would \"not allow Radical Islamic Terrorism to prosper\".US Defence Secretary Pete Hegseth said on Thursday that he was \"grateful for Nigerian government support & cooperation\". The Pentagon later posted a short video that appeared to show a missile being launched from a ship.Militants allied to IS have sought to establish a presence in two north-western states, while a separate IS-linked group has a stronghold in north-eastern BornoNigeria is Africa's most populous country, with about 220 million people, divided roughly evenly between Christians and Muslims.Jihadist groups such as Boko Haram and IS-linked offshoots have wrought havoc in north-eastern Nigeria for more than a decade, killing thousands of people.Most victims have been Muslims, according to Acled, a group that analyses political violence around the world.The strikes are the second major US intervention targeting IS in recent weeks.Last week, the US said it had carried out a \"massive strike\" against IS in Syria.US Central Command (Centcom) said fighter jets, attack helicopters and artillery had struck more than 70 targets. Aircraft from Jordan were also involved.Those strikes were launched in retaliation for the killing of three Americans - two soldiers and a civilian interpreter - in an ambush. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US launches strikes against Islamic State in Nigeria",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4bf4/live/41eb4620-e27e-11f0-ad77-b944aa312773.jpg"
      ],
      "datePublished": "2025-12-27T16:54:19.000Z",
      "dateModified": "2025-12-27T16:54:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israel recognises Somaliland as independent state, Netanyahu says",
    "url": "https://www.bbc.com/news/articles/c4g417md05go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a3a3/live/3a29ec90-e281-11f0-ad77-b944aa312773.jpg",
    "tag": "World",
    "date": "2025-12-26T21:44:42.000Z",
    "description": "1 day agoTom McArthurandAbdirahman Ali DhimbilGetty ImagesSomaliland's president Abdirahman Mohamed Abdullahi called the declaration \"historic\"Israel ",
    "body": "1 day agoTom McArthurandAbdirahman Ali DhimbilGetty ImagesSomaliland's president Abdirahman Mohamed Abdullahi called the declaration \"historic\"Israel has become the first country to formally recognise Somalia's breakaway region of Somaliland as an independent nation.Prime Minister Benjamin Netanyahu, said Israel intended to immediately expand cooperation in agriculture, health, and technology. Somaliland's president, Abdirahman Mohamed Abdullahi, called the development \"a historic moment\".Recognition by Israel could encourage other nations to follow suit, increasing the region's diplomatic credentials and access to international markets.Somalia's prime minister, Hamza Abdi Barre, said his country categorically and unequivocally rejected what he called a deliberate attack by Israel on its sovereignty.Abdullahi said in a statement that Somaliland would join the Abraham Accords, in what he called a step toward regional and global peace.Somaliland was committed to building partnerships, boosting mutual prosperity and promoting stability across the Middle East and Africa, he added.The decision has been condemned by the foreign ministers of Somalia, Egypt, Turkey and Djibouti, who in a statement affirmed their \"total rejection\" of Israel's announcement.The two countries had agreed to establish \"full diplomatic ties, which will include the appointment of ambassadors and the opening of embassies\", Israeli Foreign Minister Gideon Saar said in a statement on X.\"I have instructed my ministry to act immediately to institutionalise ties between the two countries across a wide range of fields,\" he said.Meanwhile, Egypt's foreign minister held separate phone calls with his counterparts in Somalia, Turkey and Djibouti to discuss issues including Israel's declaration.In a statement, Egypt's foreign ministry said the four countries reaffirmed their support for Somalia's unity, sovereignty and territorial integrity, and warned against unilateral steps that could undermine stability or create what they called \"parallel entities\" to Somalia's state institutions.They also argued that recognising the independence of parts of sovereign states would set a dangerous precedent under international law and the United Nations Charter. The statement added that the ministers reiterated their rejection of any plans to displace Palestinians outside their homeland.Israel has for years been trying to bolster relations with countries in the Middle East and Africa, but recent wars including in Gaza and against Iran have been seen as a hindrance to democracy.Historic deals struck late in Trump's first term in 2020, known as the Abraham Accords, saw several countries including Muslim-majority United Arab Emirates and Morocco normalise relations with Israel, with other countries joining later. Somaliland has a strategic position on the Gulf of Aden, and has its own money, passports and police force. Born in 1991 after a war of independence against former dictator General Siad Barre, it has grappled with decades of isolation ever since.With a population of almost six million, the self-proclaimed republic has recently been at the centre of several regional disputes involving Somalia, Ethiopia and Egypt.Last year, an agreement between landlocked Ethiopia and Somaliland to lease a stretch of coastline for a port and military base angered Somalia.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israel recognises Somaliland as independent state, Netanyahu says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a3a3/live/3a29ec90-e281-11f0-ad77-b944aa312773.jpg"
      ],
      "datePublished": "2025-12-26T21:44:42.000Z",
      "dateModified": "2025-12-26T21:44:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Solar energy: India's renewable energy boom faces a hidden waste problem",
    "url": "https://www.bbc.com/news/articles/cd6x75x4j02o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/69d0/live/12bfde50-d64f-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-12-25T23:11:20.000Z",
    "description": "2 days agoNikita Yadav AFP via Getty ImagesIndia gets plenty of sunlight throughout the year, which makes solar power highly efficientIndia's rapid so",
    "body": "2 days agoNikita Yadav AFP via Getty ImagesIndia gets plenty of sunlight throughout the year, which makes solar power highly efficientIndia's rapid solar energy expansion is widely hailed as a success. But without a plan to manage the waste it will generate, how clean is the transition?In just over a decade, India has become the world's third-largest solar producer, with renewables now central to its climate strategy. Solar panels are everywhere - from vast solar parks to blue rooftops across cities, towns and villages.Alongside large solar parks, millions of rooftop systems now feed power into the electricity grid. Government data show nearly 2.4 million households have adopted solar under a subsidy scheme.Solar growth has cut India's reliance on coal. Though thermal and other non-renewables still supply over half of installed capacity, solar now contributes more than 20%. Yet the achievement carries a challenge: while clean in use, solar panels can pose environmental risks if not properly managed.Solar panels are mostly recyclable, made of glass, aluminium, silver, and polymers - but trace toxic metals like lead and cadmium can pollute soil and water if mishandled.Solar panels typically last about 25 years, after which they are removed and discarded. India currently has no dedicated budget for solar-waste recycling and only a few small facilities to process old panels.Bloomberg via Getty ImagesThermal power plants continue to dominate India's energy generation capacityIndia has no official data on solar waste, but a study estimated around 100,000 tonnes by 2023, rising to 600,000 tonnes by 2030. For now, the volume is small, but experts warn the bulk is yet to come - and without rapid recycling investment, India could face a growing waste crisis.A new study by the Council on Energy, Environment and Water (CEEW) estimates that India could generate more than 11 million tonnes of solar waste by 2047. Managing this would require almost 300 dedicated recycling facilities and an investment of $478 (£362m) over the next two decades.\"Most of India's large solar parks were built in the mid-2010s, so the real wave of waste is coming in 10 to 15 years,\" says Rohit Pahwa of energy company Targray.India's solar-waste projections mirror global patterns: the US may generate 170,000–1 million tonnes and China nearly one million tonnes by 2030, following rapid solar expansion in the 2010s.The policy landscape, however, differs significantly.In the US, solar-panel recycling is mostly market-driven under a patchwork of state rules. China's system, like India's, is still developing and lacks a dedicated regulatory framework.In 2022, India brought solar panels under e-waste rules, making manufacturers responsible for collecting, storing, dismantling and recycling them at end of life.Experts say enforcement is uneven, especially for home and small-scale panels, which make up 5–10% of installations. Though modest, these panels can still generate substantial waste, as they are harder to track, collect, and recycle.Damaged or discarded panels often end up in landfills or with unauthorised recyclers, where unsafe methods can release toxic materials. The BBC has contacted India's renewable energy ministry for comment.Hindustan Times via Getty ImagesDamaged and ageing rooftop panels are rarely recycled\"Solar power gives an illusion of clean energy for two decades, but without a serious plan for recycling panels it risks leaving behind a graveyard of modules and not much of a legacy,\" says environment expert Sai Bhaskar Reddy Nakka.Despite the challenges, experts say the problem is not without opportunities.  \"As waste rises, so will the demand for companies that know how to process it,\" Mr Pahwa says. Efficient recycling could reclaim 38% of materials for new panels by 2047 and prevent 37 million tonnes of carbon emissions from mining, says CEEW.India already has markets for glass and aluminium, and metals found in solar cells - silicon, silver, and copper - can be recovered for new panels or other industries, says Akansha Tyagi, co-author of the study.Currently, most solar waste is processed with basic methods that recover only low-value materials like glass and aluminium, while precious metals are lost, damaged or extracted in tiny amounts.Experts say the next decade will be decisive for India's solar goals. The country must act fast - building a regulated, self-sustaining recycling system, raising household awareness, and integrating waste collection into solar business models.Companies that profit from solar power should also be responsible for what happens to panels once they stop working, says Mr Nakka. \"Without proper recycling, clean energy today could mean more waste tomorrow,\" he warned.Follow BBC News India on Instagram, YouTube, X and Facebook.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Solar energy: India's renewable energy boom faces a hidden waste problem",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/69d0/live/12bfde50-d64f-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-25T23:11:20.000Z",
      "dateModified": "2025-12-25T23:11:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Attack on Kyiv shows 'Russia doesn't want peace', Zelensky says",
    "url": "https://www.bbc.com/news/articles/c1dzvpg1341o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/256f/live/2e8fdce0-e359-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "World",
    "date": "2025-12-27T21:17:32.000Z",
    "description": "7 hours agoRachel Muller-HeyndykandAdam GoldsmithThe sound of gunfire and blasts can be heard overnight and into the morning in KyivAn intense Russian",
    "body": "7 hours agoRachel Muller-HeyndykandAdam GoldsmithThe sound of gunfire and blasts can be heard overnight and into the morning in KyivAn intense Russian attack on Kyiv overnight shows Moscow \"doesn't want peace\", Ukrainian President Volodymyr Zelensky said on Saturday as he prepared for a fresh round of peace talks. Zelensky made the comments en route to Florida, where he will meet US President Donald Trump on Sunday to discuss a new 20-point peace plan agreed by American and Ukrainian envoys.The 10-hour missile and drone barrage directed at Ukraine's capital killed two people and left 32 injured, local authorities said.Damage to energy infrastructure left 40% of residential buildings in Kyiv and nearby districts without heating, according to Ukraine's minister for development Oleksiy Kuleba.Russia's ministry of defence said long-range precision weapons were used to target energy facilities, which it claimed were being used \"in the interests of the Ukrainian Armed Forces and enterprises of the Ukrainian military-industrial complex\".Writing on Telegram Zelensky said that Russia directed almost 500 drones and 40 missiles towards Kyiv, targeting energy and civilian infrastructure.Pictures showed gaping holes in apartment buildings and homes on fire following the strikes.The apartment block of BBC journalist Anastasiya Gribanova was struck, leaving some homes on the higher levels of the high-rise building in flames. Gribanova, who was in the building's elevator at the time, was unharmed.ReutersA house in Kyiv was also hit, Ukraine's emergency services saidUkraine's State Emergency Service said that 68 people were evacuated from a retirement home in the eastern Darnytskyi district.\"Russian representatives are having long conversations, but in reality the Daggers [missiles] and Shaheds [drones] are speaking for them,\" Zelensky wrote on Telegram, adding that Russian President Vladimir Putin does not want to end the war.\"This sick activity can only be responded to with really strong steps. America has this opportunity, Europe has this opportunity, many of our partners have this opportunity,\" he wrote, urging allies to show strength against Russian aggression.The attack saw Poland, which shares a 530km-long (320 miles) border with western Ukraine, ready its fighter jets, ground-based air defence systems and radar reconnaissance.Later on Saturday morning, it concluded that there had been no violation of the country's airspace.Russia's Defence Ministry said its air defence systems had intercepted and destroyed almost 200 Ukrainian drones over several Russian regions, including eight over Moscow.Zelensky briefly met with Canadian Prime Minister Mark Carney on Saturday, ahead of his Florida meeting with Trump.Speaking in Nova Scotia, Zelensky said the latest bombardment of Kyiv was \"Russia's answer [to] our peace efforts and this really shows that Putin doesn't want peace\".Carney pledged $2.5bn CAD (£1.35bn) in economic assistance to Ukraine, but agreed that \"lasting peace\" would require \"a willing Russia\". Zelensky then took a call with European leaders to discuss diplomatic \"priorities\"  ahead of his meeting with Trump, adding that \"strong positions are needed\" to move forward with the plan.Security guarantees and territorial concessions for Ukraine are likely to return to the table, issues on which Russia has previously been unwilling to compromise.Also on Saturday, Russian President Vladimir Putin visited a command and control overseeing Moscow's war, according to Russian news agency TASS. Wearing army fatigues, Putin said if Kyiv did not want to resolve the conflict peacefully, Russia would accomplish its objectives militarily, according to comments in state media. ReutersThe aftermath of the damage in KyivThe new 20-point draft is a revised version of an earlier 28-point plan which was drafted by US special envoy Steve Witkoff, but widely seen as being too favourable to Russia.The Ukrainian president has voiced optimism around the new draft, describing it as \"a foundational document on ending the war\", but Trump warned that Zelensky \"doesn't have anything until I approve it\" in an interview with Politico.The draft reportedly includes security guarantees from the US, Nato and European allies for a co-ordinated military response if Russia were to invade Ukraine again.Control of Ukraine's eastern Donbas has been a sticking point in talks so far, but now Zelensky has said a \"free economic zone\" could be an option. Trump told Politico that he was expecting to see the new draft on Sunday.\"I think it's going to go good with him. I think it's going to go good with [Vladimir] Putin,\" Trump said in the interview, adding that he expects to speak with Russia's president \"soon\". ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Attack on Kyiv shows 'Russia doesn't want peace', Zelensky says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/256f/live/2e8fdce0-e359-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-27T21:17:32.000Z",
      "dateModified": "2025-12-27T21:17:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guinea and Central African Republic elections: Leaders aim to consolidate power at  in two polls in Africa",
    "url": "https://www.bbc.com/news/articles/cpwk9grv290o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4ab0/live/ba593010-e02e-11f0-a8dc-93c15fe68710.jpg",
    "tag": "World",
    "date": "2025-12-27T00:57:52.000Z",
    "description": "One general, one mathematician: The men competing for power in two African elections1 day agoPaul MellyWest Africa analystAFP via Getty ImagesVoters i",
    "body": "One general, one mathematician: The men competing for power in two African elections1 day agoPaul MellyWest Africa analystAFP via Getty ImagesVoters in Guinea and the Central African Republic will get to vote for president On Sunday, citizens of Guinea and the Central African Republic (CAR) will go to the polls to elect their presidents for terms of office of seven years.Both contests could, in theory, go on to run-off ballots. Yet in both, the incumbents are strong favourites, with observers predicting they will clinch victory outright in the first round with more than 50% of the vote.But that's where the similarities end.The CAR, vast and landlocked, is one of Africa's poorest countries, marred by chronic instability for decades, with a succession of armed groups motivated by a variety of local grievances, opportunities for racketeering or political ambitions.From 2013 to 2016 it was only the intervention of African, French and then UN peacekeepers that averted a slide into deeper inter-communal violence.The national government in Bangui, the riverside capital on the southern border, just across the water from the Democratic Republic of Congo, has often struggled to assert its authority in the distant outer-lying regions of the north or far east.Despite these enduring fragilities, multi-party politics has mostly survived, with a fair degree of tolerance for opposition and protest.There is a sense of national identity and this year has seen two of the most significant rebel groups drawn back into the peace process and starting to disarm and demobilise.The country has a pioneering special court for trying human-rights crimes, staffed with a blend of national and international judges.AFP via Getty ImagesPresident Faustin-Archange Touadéra is hoping for a third term in officePresident Faustin-Archange Touadéra is a mathematician and former university vice-chancellor. He entered politics as prime minister under the putschist-turned elected head of state, François Bozizé. Later, after a chaotic interlude of rebel rule and an uncertain transition, he was elected head of state as a post-conflict and consensual civil-society figure.Today, approaching the end of his second term, Touadéra is seen as a far more political and partisan figure. He bulldozed through constitutional reform to scrap term limits, allowing him to stand again. This has provoked a boycott by much, though not all, of the opposition.Yet, contrary to widespread expectations, his most prominent electoral rival, Anicet-Georges Dologuélé, has been allowed to take part in the electoral race.This contrasts with the situation in Guinea, on Africa's west coast, where Gen Mamadi Doumbouya, leader of the September 2021 coup that deposed the 83-year old civilian President Alpha Condé, is now preparing to convert himself into a constitutionally elected ruler.Although Doumbouya will face eight challengers at the ballot box, he has dominated the campaign, with his image plastered all over the streets of Conakry, Guinea's capital city. The most prominent opposition figure of the past 10 years, Cellou Dalein Diallo, with a big personal following among the large Peul community who account for about 40% of the electorate, has been excluded from the contest.Despite these constraints on the political choice presented to voters, the return of an elected government will come as a great relief to the Economic Community of West African States (Ecowas), a regional bloc that promotes economic integration, democracy, and military cooperation among its members.Almost a year ago, it suffered a blow with the withdrawal of Mali, Burkina Faso and Niger after the military regimes that had seized power in a wave of coups between 2020 and 2023 refused to comply with the bloc's demands to commit to clear timeframes for the restoration of civilian rule.AFP via Getty ImagesFrom 2021 (L) to today (R) - Mamadi Doumbouya now wants to be a civilian presidentDoumbouya made a different choice.Although he kept good relations with the junta in neighbouring Mali, he has pursued a methodical constitutional review, which has laid the ground for Sunday's vote, even if this has been delayed for longer than Ecowas originally wanted.His approach to international relations also contrasts starkly with neighbouring regimes, who have cultivated close security ties with Russia and repudiated their previous close partnerships with France.Doumbouya has maintained good relations with Western governments, particularly Paris. Officials in Conakry praise the French Development Agency as one of their most supportive partners.Indeed, from the outset, the Doumbouya regime has been treated rather gently by both France and the West generally, and by Ecowas, despite a troubling human rights record.His overthrow of Condé - who had staged a dubious constitutional referendum to allow himself the chance to stand for a third term and had overseen frequent bouts of security force brutality - was celebrated on the streets of Conakry and barely criticised abroad.AFP via Getty ImagesGen Mamadi Doumbouya has dominated the build-up to the electionDoumbouya earned international goodwill when he pressed quickly ahead with the long-delayed trial of those accused of a notorious 2009 stadium massacre when about 150 opposition supporters were killed and many women raped.And even though his own rule saw youth protesters shot, and leading civil society activists Billo Bah and Foniké Mengué detained and never heard from since, regional and international reactions were muted.West Africa has been shaken by coups and the breakaway of Burkina Faso, Mali and Niger from Ecowas, as well as this month's attempted putsch in Benin. Guinea's decision to stay in the bloc and restore elected government - even if it breaches Doumbouya's earlier promise that no member of his junta would stand in the polls - has been greeted with quiet relief by many regional leaders and European governments, as a step towards reconsolidating normality.With jihadist groups now disrupting daily life and trade across the south of Mali and Burkina Faso, the gradual progress towards constitutional stability in Guinea, despite persistent civil-rights concerns, has been welcomed.The same goes for Touadéra's bid for a third term in the CAR, a country slowly emerging from years of insecurity. The UN peacekeeping force, Minusca, is helping the government to gradually restore basic administration and services, even to distant provincial towns.The CAR still significantly relies on Russian military advice, but the president has taken time to rebuild good relations with France and maintain a close partnership with the EU and the UN.With war-ravaged Sudan just over the north-eastern border, and deep fragilities still persistent at home, international partners are minded to support rather than criticise, despite the frustrations of those opponents who feel that a Touadéra third term would be illegitimate.You may also be interested in:Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guinea and Central African Republic elections: Leaders aim to consolidate power at  in two polls in Africa",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4ab0/live/ba593010-e02e-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-27T00:57:52.000Z",
      "dateModified": "2025-12-27T00:57:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Christmas around the world: Waterskiing Santas and giant cuts of meat",
    "url": "https://www.bbc.com/news/articles/ce8nep787pyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6bb2/live/dc53f350-e1a8-11f0-b67b-690eb873de1b.jpg",
    "tag": "World",
    "date": "2025-12-25T15:01:32.000Z",
    "description": "3 days agoGetty ImagesWorkers sell off cuts of meat during the traditional Christmas Eve auction at Smithfield meat market in London, UKFrom skiing Sa",
    "body": "3 days agoGetty ImagesWorkers sell off cuts of meat during the traditional Christmas Eve auction at Smithfield meat market in London, UKFrom skiing Santas in the US and Mass with Pope Leo XIV at the Vatican, to giant cuts of meat being thrown into crowds in London, Christmas celebrations have been held around the world.Worshippers in Ukraine, China and Pakistan gathered for Christmas Eve services at their local churches.While most Christians mark Christmas on 25 December, many Orthodox Christians do not celebrate until 7 January. Here are some of the best images of the holiday cheer around the world.ReutersPope Leo XIV delivers the traditional Christmas Day Urbi et Orbi speech to the city and the world from the main balcony of St Peter's Basilica at the VaticanGetty ImagesTwo women take a photo in front of the Christmas tree in Nativity Square in Bethlehem, held to be the birthplace of Jesus Christ, in the occupied West BankGetty ImagesA woman lights a candle with her son during a Christmas Eve service in Kyiv, UkraineGetty ImagesWorshippers attend a Christmas Eve mass at the Church of the Saviour in Beijing, ChinaGetty ImagesChristians attend midnight Mass at Central Brooks Memorial Church in Karachi, PakistanGetty ImagesA man decorates a Christmas tree during Christmas Eve celebrations in Islamabad, PakistanGetty ImagesGirls stand alongside a Christmas nativity scene at St Mary's Church in the village of Uswetakeiyawa, Sri LankaReutersWomen hold candles as they attend a Christmas Eve mass in Nairobi, KenyaGetty ImagesThe Chartres cathedral in France is illuminated in bright colours ahead of midnight MassGetty ImagesA skiing Santa delights crowds during an annual Waterskiing Santa event in Alexandria, Virginia, in the US on Christmas EveGetty ImagesPeople wearing Santa costumes walk along the sand of Bondi Beach in Sydney, AustraliaGetty ImagesPolice officers dressed in festive gear deliver gifts on Christmas Eve in Lima, PeruGetty ImagesFishermen dressed as Santa and the Grinch on a boat in Valparaiso Bay, ChileGetty ImagesTwo men dressed as Santas take a selfie in the snow in Gulmarg in Indian-administered Kashmir",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Christmas around the world: Waterskiing Santas and giant cuts of meat",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6bb2/live/dc53f350-e1a8-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-25T15:01:32.000Z",
      "dateModified": "2025-12-25T15:01:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meteor lights up sky over Japan's Mount Fuji",
    "url": "https://www.bbc.com/news/videos/cn4dexwzejeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/80f7/live/17a92fe0-e309-11f0-a8dc-93c15fe68710.jpg",
    "tag": "World",
    "date": "2025-12-27T10:01:44.000Z",
    "description": "CCTV footage from Japan's Hiratsuka City Museum captured the moment a meteor soared through the night sky over Japan's Mount Fuji on Friday.While most",
    "body": "CCTV footage from Japan's Hiratsuka City Museum captured the moment a meteor soared through the night sky over Japan's Mount Fuji on Friday.While most meteors appear white, some can glow green, yellow, red, or blue, depending on the elements in the material as it burns up in Earth's atmosphere.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meteor lights up sky over Japan's Mount Fuji",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/80f7/live/17a92fe0-e309-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-27T10:01:44.000Z",
      "dateModified": "2025-12-27T10:01:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]