[
  {
    "title": "As we return to a pre-WW2 order, the middle powers face a challenge",
    "url": "https://www.bbc.com/news/articles/c99kkerr93ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d952/live/ae60d9d0-f86a-11f0-b385-5f48925de19a.jpg",
    "tag": "World",
    "date": "2026-01-25T00:25:51.000Z",
    "description": "As the world inches back to a pre-WW2 order, the 'middle powers' face a grave new challenge20 hours agoAllan LittleSenior correspondentBBCI had been a",
    "body": "As the world inches back to a pre-WW2 order, the 'middle powers' face a grave new challenge20 hours agoAllan LittleSenior correspondentBBCI had been asked to give a keynote speech at a conference at Columbia University's Journalism School. It was January 2002. Two planes had been flown into the twin towers of the World Trade Center months earlier and you could still feel how wounded the city felt. You could read it in the faces of New Yorkers you spoke to.In my speech I made a few opening remarks about what the United States had meant to me. \"I was born 15 years after the Second World War,\" I said, \"in a world America made. The peace and security and increasing prosperity of the Western Europe that I was born into was in large part an American achievement.\"American military might had won the war in the West, I continued. It had stopped the further westward expansion of Soviet power.I talked briefly about the transformational effect of the Marshall Plan, through which the US had given Europe the means to rebuild its shattered economies, and to re-establish the institutions of democracy.AFP via Getty Images'I was born 15 years after the Second World War in a world America made,' Allan Little told an audience. 'The peace and security and increasing prosperity of the Western Europe that I was born into was in large part an American achievement'I told the audience, composed mostly of students of journalism, that as a young reporter I had myself witnessed the inspiring culmination of all this in 1989 when I'd stood in Wenceslas Square in Prague. Back then I'd watched, awestruck, as Czechs and Slovaks demanded an end to Soviet occupation, and to a hated Communist dictatorship, so that they too could be part of the community of nations that we called, simply, \"the West\", bound together by shared values, at the head of which sat the the United States of America.I looked up from my notes at the faces of the audience. Near the front of the lecture hall sat a young man. He looked about 20. Tears were running down his face and he was quietly trying to suppress a sob.At a drinks reception afterwards he approached me. \"I'm sorry I lost it in there,\" he said. \"Your words: right now we are feeling raw and vulnerable. America needs to hear this stuff from its foreign friends.\"In that moment I thought how lucky my generation - and his - had been, to be alive in an era in which the international system was regulated by rules - a world that had turned its back on the unconstrained power of the Great Powers.Getty ImagesDonald Trump believes the free world has been freeloading on American largesse for too longBut it was the words of one of his classmates that come back to me now. He had arrived in New York just a few days before 9/11 from his native Pakistan to study at Columbia. He likened the US to Imperial Rome.\"If you are lucky enough to live within the walls of the imperial citadel, which is to say here in the US, you experience American power as something benign. It protects you and your property. It bestows freedom by upholding the rule of law. It is accountable to the people through democratic institutions.\"But if, like me, you live on the barbarian fringes of Empire, you experience American power as something quite different. It can do anything to you, with impunity... And you can't stop it or hold it to account.\"His words made me consider the much heralded rules-based international order from another angle: from the point of view of much of the Global South. And how its benefits have never been universally distributed, something that the Canadian Prime Minister Mark Carney reminded an audience at the World Economic Forum at Davos, Switzerland, last week.ReutersCanada's Prime Minister Mark Carney's speech in Davos called for 'the middle powers' to act together\"We knew the story of the international rules-based order was partially false,\" that young Pakistani student admitted all those years ago. \"That the strongest would exempt themselves when convenient. That trade rules were enforced asymmetrically. And we knew that international law applied with varying rigour depending on the identity of the accused or victim.\"\"Don't you find it interesting,\" he asked, \"that the US, the country that came into existence in a revolt against the arbitrary exercise of [British] power is, in our day, the most powerful exponent of arbitrary power?\"A new world order or back to the future?Donald Trump came to Davos last week clearly determined to bend the Europeans to his will over Greenland. He wanted ownership, he said.He declared that Denmark had only \"added one more dog sled\" to defend the territory. That speaks volumes to the undisguised contempt with which he and many in his inner circle appear to hold certain European allies.\"I fully share your loathing of European freeloading,\" Defence Secretary Pete Hegseth told a group on messaging app Signal that included Vice-President JD Vance last year, adding \"PATHETIC\". (He hadn't realised that the Editor of The Atlantic magazine had apparently been added to the group chat.)Then President Trump himself told Fox News recently that, during the war in Afghanistan, Nato had sent \"some troops\" but that they had \"stayed a little back, a little off the front lines\".The comments provoked anger among UK politicians and veterans' families. The UK Prime Minister Sir Keir Starmer branded Trump's remarks \"insulting and frankly appalling\".The UK prime minister spoke to Trump on Saturday, after which the US president used his Truth Social platform to praise UK troops as being \"among the greatest of all warriors\".Carl Court - Pool/Getty ImagesSir Keir Starmer said US President Donald Trump's remarks about Nato troops in Afghanistan were 'insulting and frankly appalling'We know from the White House's National Security Strategy, published in December, that in his second term, Trump intends to unshackle the US from the system of transnational bodies created, in part by Washington, to regulate international affairs. That document spells out the means by which the US will put \"America First\" at the heart of US security strategy by using whatever powers they have - ranging from economic sanctions and trade tariffs to military intervention - to bend smaller and weaker nations into alignment with US interests.It is a strategy which privileges strength - a return to a world in which the Great Powers carve out spheres of influence.The danger in this for what Canada's prime minister called \"the middle powers\" is clear. \"If you're not at the table,\" he said, \"you're on the menu.\"Re-interpretation of the Monroe DoctrineIn Davos last week, America's allies, especially Canada and Europe, were laying to rest what is now commonly called the rules-based intentional order, and in some cases mourning its demise.But, as the young Pakistani student at Columbia journalism school argued all those years ago, to large parts of the rest of the world it has not seemed, in the last 80 years, that the US, and on occasions some of its friends, felt restrained by rules.More from InDepth\"After World War Two, we saw, under the so-called rules-based international order multiple interventions by the United States in Latin America,\" says Dr Christopher Sabatini, Senior Research Fellow for Latin America at Chatham House think tank in London.\"It's not new. There are patterns of intervention that go all the way back to 1823. There's a term I use for American policymakers who advocate for unilateral US intervention. I call them \"backyard-istas\" - those who see Latin America as their backyard.\"In 1953, the CIA, assisted by the British Secret Intelligence Services, orchestrated a coup that overthrew the government of Mohammad Mossadeq in Iran. He had wanted to audit the books of the Anglo-Iranian Oil Company (later part of BP), and when it refused to co-operate, Mossadeq threatened to nationalise it.For posing a threat to British economic interests, he was overthrown and Britain and the US threw their weight behind the increasingly dictatorial shah.Universal Images Group via Getty ImagesThe CIA played a key role in the 1953 coup which ousted Iran's democratically elected Prime Minister, Mohammad MossadeqAt the same time, the US was conspiring to overthrow the elected government of Guatemala, which had implemented an ambitious programme of land reform that threatened to harm the profitability of the American United Fruit Company. Again with active CIA collusion, the left-wing President Jacobo Arbenz was toppled and replaced by a series of US-backed authoritarian rulers.In 1983 the US invaded the Caribbean island of Grenada, after a Marxist coup. This was a country of which the late Queen, Elizabeth II, was head of state.And the US invaded Panama in 1989, and arrested the military leader Manuel Noriega. He spent all but the last few months of his life in prison.These interventions were all functions of the Monroe Doctrine, first promulgated by President James Monroe in 1823. It asserted America's right to dominate the Western hemisphere and keep European powers from trying to meddle in the newly independent states of Latin America. The post-war rules-based international order did not deter the US from imposing its will on weaker neighbours.Getty Images / CorbisPanama's leader Manuel Noriega was forcibly removed by US troops in 1989 and spent almost all of the rest of his life in jailWhen it was announced by the fifth president of the US, James Monroe, the doctrine that bears his name was widely seen as an expression of US solidarity with its neighbours, a strategy to protect them from attempts by the European great powers to recolonise them. The US, after all, shared with them a set of republican values and a history of anti-colonial struggle.But the doctrine quickly became an assertion of Washington's right to dominate its neighbours and use any means, up to and including military intervention, to bend their policies into alignment with American interests. President Theodore Roosevelt, in 1904, said it gave the US \"international police power\" to intervene in countries where there was \"wrongdoing\".So could it be that President Trump's re-interpretation of the Monroe Doctrine is simply part of a continuum in US foreign policy?Getty ImagesThe Monroe Doctrine was first promulgated by US President James Monroe (pictured) in 1823\"The Guatemala coup, in 1954 - that was entirely owned by the US. They orchestrated the entire takeover of the country,\" says Christopher Sabatini.The 1973 coup in Chile against left-wing Prime Minister Salvador Allende \"wasn't orchestrated by the CIA but the United States said it would accept a coup\", he added.During the Cold War, the main motivation for intervention was the perception that Soviet-backed parties were gaining ground domestically, representing Communist advances into the Western hemisphere. In our own day, the perceived enemy is no longer Communism, but drug-trafficking and migration.That difference aside, President Trump's reassertion of the Monroe Doctrine \"absolutely is 'back to the future',\" says the historian Jay Sexton, author of The Monroe Doctrine: Empire and Nation in Nineteenth Century America.Getty ImagesGuatamalan President Jacobo Arbenz was overthrown by a US-backed coup in 1954\"The other thing that gives Trump's United States a 19th-Century feel is his unpredictability, his volatility. Observers could never really predict what the US would do next.\"We don't know what the future holds but we do known from even a cursory look at modern history, from 1815 onwards [the end of the Napoleonic wars], that Great Power rivalries are really destabilising. They lead to conflict.\"Cohesion among the alliesAmerican unilateralism may not be new. What is new is that this time, it is America's friends and allies that find themselves on the receiving end of American power.Suddenly, Europeans and Canadians are getting a taste of something long familiar to other parts of the world - that arbitrary exercise of US power that the young Pakistani journalism student articulated so clearly to me in the weeks after 9/11.For the first year of his second term, European leaders used flattery in their approach to Trump. Starmer, for example, had King Charles invite him to make a second state visit to the UK, an honour no other US president in history has been granted. The Secretary-General of Nato, Mark Rutte, referred to him, bizarrely, as \"daddy\".Getty ImagesKing Charles invited Donald Trump to make a second state visit to the UK - an honour no other US president has received (photo from first state visit in 2019)But Trump's approach towards Europe brought him clear success. Previous presidents, including Barack Obama and Joe Biden, also believed European allies were not pulling their weight in Nato - the collective trans-Atlantic defence alliance - and wanted them to spend more on their own security. Only Trump succeeded in making them act. In response to his threats, they agreed to raise their defence spending from around 2% of GDP to 5%, something unthinkable even a year ago.Greenland, however, seems to have been a game-changer. When Trump threatened Danish sovereignty in Greenland, the allies began to cohere around a new-found defiance, and resolved not, this time, to bend.Canada's prime minister gave voice to this moment. In his pivotal speech in Davos Mark Carney said this was a moment of \"rupture\" with the old rules-based international order - in the new world of Great Power politics, \"the middle powers\" needed to act together.Getty ImagesPrevious US presidents had also believed the European allies should spend more on their own security - only Trump succeeded in making them actIt is rare, at Davos, for an audience to rise to its feet and award a speaker with a standing ovation. But they did it for Carney, and you felt, in that moment, a cohesion forming among the allies.And in an instant, the threat of tariffs lifted. Trump has gained nothing over Greenland that the US hasn't already had for decades - the right, with Denmark's blessing, to build military bases, stage unlimited personnel there, and even to mineral exploitation.The challenge facing 'middle powers' todayThere is no doubt that Trump's America-First strategy is popular with his Maga base. They share his view that the free world has been freeloading on American largesse for too long. And European leaders, in agreeing to increase their defence spending, have accepted that President Trump was right: that the imbalance was no longer fair or sustainable.ReutersIn June 2004 I reported on the celebrations to mark the 60th anniversary of D-Day in Normandy. There were still many living World War Two veterans and thousands of those who had crossed the Channel 60 years earlier came back to the beaches that day - many of them from the US.They wanted no talk of the heroism or courage of their youth. We watched them go one by one or in little groups to the cemeteries to find the graves of the young men they'd known and whom they'd left behind in the soil of liberated France.We watched the allied heads of government pay tribute to those old men. But I found myself thinking not so much of the battles they'd fought and the bravery and sacrifices of their younger selves, but of the peace that they'd gone home to build when the fighting was over.The world they bequeathed to us was immeasurably better than the world they'd inherited from their parents. For they were born into a world of Great Power rivalries, in which, in Mark Carney's words, \"the strong can do what they can, and the weak must suffer what they must\".This was the generation that went home to build the rules-based international order, because they had learned the hard way what a system without rules, without laws, can lead to. They wanted no going back to that.ShutterstockThe world the veterans bequeathed to us was immeasurably better than the world they'd inherited from their parents, writes Allan LittleThose born in the decades after the war may have made the mistake of believing that the world could never go back to that.And 24 years ago, as I gave my talk in a New York City still traumatised by 9/11, did I, too, make the mistake of thinking the post-World War Two order, underpinned, as it was, by American might, was the new permanent normal? I think I did.For we did not foresee then a world in which trust in traditional sources of news and information would be corroded by a rising cynicism, turbo-charged by social media and, increasingly now, artificial intelligence.In any age of economic stagnation and extremes of inequality, popular trust in democratic institutions corrodes. It has been corroding not just in the US but across the Western world for decades now. As such Trump may be a symptom, not a cause, of Carney's \"rupture\" with the post-World War Two order.Watching those old men making their way through the Normandy cemeteries was a graphic and poignant reminder that democracy, the rule of law, accountable government are not naturally occurring phenomena.  They are not even, historically speaking, normal. They have to be fought for, built, sustained, defended.And that is the challenge from here facing what Mark Carney called \"the middle powers\".Top picture credit: AFP/ReutersBBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. Emma Barnett and John Simpson bring their pick of the most thought-provoking deep reads and analysis, every Saturday. Sign up for the newsletter here",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "As we return to a pre-WW2 order, the middle powers face a challenge",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d952/live/ae60d9d0-f86a-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-25T00:25:51.000Z",
      "dateModified": "2026-01-25T00:25:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Venezuela frees dozens of political prisoners, human rights group says",
    "url": "https://www.bbc.com/news/articles/clymr3pz2kxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/612b/live/8a6f54c0-fa13-11f0-b12c-a199f4d4d58c.png",
    "tag": "World",
    "date": "2026-01-25T18:29:57.000Z",
    "description": "2 hours agoThomas MackintoshEPASince 8 January families have been spending the night outside the El Rodeo jail in ZamoraA leading Venezuelan human rig",
    "body": "2 hours agoThomas MackintoshEPASince 8 January families have been spending the night outside the El Rodeo jail in ZamoraA leading Venezuelan human rights group says at least 80 political prisoners have been released under pressure from the US.Alfredo Romero, head of Foro Penal, said his group was verifying the identities of those freed from prisons across the country on Saturday - and more releases were likely to take place.It is the latest batch of detainees released since the US seized Venezuelan President Nicolás Maduro in a raid, and took him to New York to stand trial on drug-trafficking charges earlier this month.On Friday Venezuela's interim President Delcy Rodriguez said more than 600 prisoners had been freed - but Foro Penal says this figure has been inflated.Romero announced the releases on social media. He also posted an image of Foro Penal colleague Kennedy Tejeda who he said had been held in Tocorón prison, west of the capital caracas since August 2024.In a post on X, Foro Penal lawyer Gonzalo Himiob said the number of releases could rise above 80 \"as we proceed with verification\".Previously, Foro Penal said that many of those freed in recent weeks have not had the charges against them dropped.This has left them in legal limbo and they have been barred from speaking in public, the group said.Before this weekend's developments, the group had confirmed the release of just 156 political prisoners since 8 January.Some domestic opposition figures and at least five Spanish nationals are among those confirmed to have been freed so far.Separately, Rodriguez said she was due to have a call on Monday with the United Nations High Commissioner for Human Rights, Volker Turk, to ask the UN to verify the lists of those released so far.Human rights groups and activists have long accused the government of using detentions to muzzle critics. The Venezuelan government has denied holding political prisoners, insisting they were arrested for criminal activity.Many were detained after the 2024 presidential election, when Maduro claimed victory despite opponents and many countries disputing the results.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Venezuela frees dozens of political prisoners, human rights group says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/612b/live/8a6f54c0-fa13-11f0-b12c-a199f4d4d58c.png"
      ],
      "datePublished": "2026-01-25T18:29:57.000Z",
      "dateModified": "2026-01-25T18:29:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Germany arrests suspected Hamas member over alleged attack plot",
    "url": "https://www.bbc.com/news/articles/c8rm14lkkvzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9759/live/98f3f5b0-f945-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-24T18:57:09.000Z",
    "description": "German police have arrested a Lebanese national on suspicion of being a member of Hamas and planning attacks in Europe.The man, named as \"Mohammad S\",",
    "body": "German police have arrested a Lebanese national on suspicion of being a member of Hamas and planning attacks in Europe.The man, named as \"Mohammad S\", was stopped at Berlin's Brandenburg Airport after arriving from Beirut on Friday evening.Federal prosecutors said that in August 2025 he helped procure 300 rounds of ammunition and was involved in an alleged plot to attack Jewish and Israeli institutions.He is due to be brought before a federal judge who will decide on a pretrial detention.Hamas, which controlled Gaza but has been severely weakened by Israeli operations in the territory, is considered a terrorist organisation by the US, UK, Israel and many other countries.The militant Palestinian group carried out the attacks on Israel in October 2023, in which about 1,200 people were killed and more than 250 people taken hostage.Since then, according to Gaza's Hamas-run health ministry, more than 70,000 Palestinians have been killed in Israeli military action.German authorities say \"Mohammad S\" colluded with \"Abed Al G\", one of three alleged Hamas members arrested last October over planned attacks on Jewish and Israeli institutions.The three were reportedly arrested while meeting for a weapons handover in Berlin. Two of them are Germany nationals, another is from Lebanon.Around the time of the arrests, police searches also took place in the German cities of Leipzig and Oberhausen, Der Spiegel reported.Separately, in November, German authorities arrested another suspected member of Hamas - also a Lebanese national - near the border with the Czech Republic.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Germany arrests suspected Hamas member over alleged attack plot",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9759/live/98f3f5b0-f945-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-24T18:57:09.000Z",
      "dateModified": "2026-01-24T18:57:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China places highest-ranking general under investigation",
    "url": "https://www.bbc.com/news/articles/c701kr5zqdqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0dbc/live/c9bfcd40-f922-11f0-8e3c-b79a1b327384.jpg",
    "tag": "World",
    "date": "2026-01-24T14:14:44.000Z",
    "description": "1 day agoReutersZhang Youxia was widely seen as President Xi's closest military allyChina's defence ministry says it has opened an investigation into ",
    "body": "1 day agoReutersZhang Youxia was widely seen as President Xi's closest military allyChina's defence ministry says it has opened an investigation into the country's highest-ranking general over \"grave violations of discipline and the law\".The ministry gave no further details about accusations against General Zhang Youxia, who has widely been seen as President Xi Jinping's closest military ally. However in China the accusation of wrongdoing is usually a euphemism for corruption.In its announcement, the ministry said another senior military officer, General Liu Zhenli, was also under investigation.Their removal follows the expulsion of nine top generals in October - one of the largest public crackdowns on the military in decades. Zhang, 75, is a vice-chairman of the Central Military Commission (CMC) - the Communist Party group headed by President Xi which controls the armed forces.Zhang also sits on the party's top decision-making body, the 24-person Politburo.His father was one of the founding generals of the Chinese Communist Party.Zhang joined the army in 1968 and is one of only a few senior leaders with combat experience. He was kept in office beyond the customary retirement age for China's military, suggesting President Xi's confidence in him until now.The announcement comes days after rumours appeared that Zhang and Liu could be facing an investigation as they were not present at a high-level party event in December.ReutersPresident Xi has been accused of using corruption investigations to purge political rivalsSince coming to power, President Xi has launched waves of anti-corruption drives through various departments and this campaign has recently focused heavily on the military.He has called corruption \"the biggest threat\" to the Communist Party and said the fight against it  \"remains grave and complex\".Advocates say the policy promotes good governance, but others believe it has been used as a tool to purge political rivals.With the probe into Zhang and Liu, the CMC is now down from the original seven members to just two: Xi, who is the chairman, and Zhang Shengmin, who is responsible for the military's disciplinary affairs.More from the BBC",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China places highest-ranking general under investigation",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0dbc/live/c9bfcd40-f922-11f0-8e3c-b79a1b327384.jpg"
      ],
      "datePublished": "2026-01-24T14:14:44.000Z",
      "dateModified": "2026-01-24T14:14:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump threatens Canada with 100% tariffs if it 'makes a deal with China'",
    "url": "https://www.bbc.com/news/articles/cy4qww3w72lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ef43/live/2a5f94f0-f937-11f0-814e-71ff186d4f46.jpg",
    "tag": "World",
    "date": "2026-01-24T22:10:33.000Z",
    "description": "22 hours agoSakshi VenkatramanUS reporterUS President Donald Trump has threatened to slap a 100% tariff on Canadian goods if the country strikes a tra",
    "body": "22 hours agoSakshi VenkatramanUS reporterUS President Donald Trump has threatened to slap a 100% tariff on Canadian goods if the country strikes a trade deal with China. \"If Canada makes a deal with China, it will immediately be hit with a 100% Tariff against all Canadian goods and products coming into the U.S.A.,\" Trump said on Truth Social. It is unclear what deal Trump is referring to in his social media post. Last week, Canada's Prime Minister Carney announced a \"strategic partnership\" with China, and agreed to reduce tariffs. At the time, Trump called the move \"a good thing\". But tensions between the US and Canada have grown in recent days, after Carney said in a speech in Davos that the US-led world order had been ruptured.Carney also urged other \"middle powers\" to band together in the face of economic coercion by \"greater powers\", though he did not mention Trump by name.Trump responded to the remarks in his own speech the next day, saying: \"Canada lives because of the United States.\"The US president also withdrew an invitation for Canada to join his new Board of Peace.On Saturday, Trump said in his social media post that if Carney \"thinks he is going to make Canada a 'Drop Off Port' for China to send goods and products into the United States, he is sorely mistaken\". The BBC has contacted the White House and Carney's office for comment.Canada's US trade minister Dominic LeBlanc said in a statement: \"There is no pursuit of a free trade deal with China.\"\"What was achieved was resolution on several important tariff issues.\"LeBlanc said the government was focused on building a stronger Canadian economy and strengthening trade partnerships \"throughout the world\".Canada has been seeking to diversify trade away from the US, its largest trade partner, following the uncertainty caused by Trump's on-again-off-again tariffs.Under the agreement reached between Carney and Chinese President Xi Jinping last week, China will lower levies on Canadian canola oil from 85% to 15% by March, while Canada will  tax Chinese EVs at the most-favoured-nation rate, 6.1% – down from 100%.The deal was seen as a breakthrough after years of strained ties and tit-for-tat tariffs, and could see more Chinese investments in Canada.Carney said the progress made with China sets Canada up \"well for the new world order\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump threatens Canada with 100% tariffs if it 'makes a deal with China'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ef43/live/2a5f94f0-f937-11f0-814e-71ff186d4f46.jpg"
      ],
      "datePublished": "2026-01-24T22:10:33.000Z",
      "dateModified": "2026-01-24T22:10:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Party backed by generals set for landslide in 'sham' Myanmar election",
    "url": "https://www.bbc.com/news/articles/cx2l6wg0p8eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1203/live/ff7eff80-f9e7-11f0-bfcb-015a25c825bf.jpg",
    "tag": "World",
    "date": "2026-01-25T13:05:23.000Z",
    "description": "7 hours agoJonathan Head,South East Asia correspondent, Nyaungshwe, Shan state andJosh CheethamPolls in Myanmar have closed after a third and final st",
    "body": "7 hours agoJonathan Head,South East Asia correspondent, Nyaungshwe, Shan state andJosh CheethamPolls in Myanmar have closed after a third and final stage of voting in what are widely viewed as sham elections.Many popular parties are banned from standing and voting has not been possible in large areas of the country because of a five-year-long civil war.The dominant party backed by the ruling military junta is expected to win a landslide victory.The current regime has rejected international criticism of the election, maintaining that it is free and fair.Around one-fifth of the country's 330 townships, including the cities of Yangon and Mandalay, voted in the last stage. Six parties, including the military-backed Union Solidarity and Development Party (USDP), fielded candidates nationwide, while another 51 parties and independent candidates decided to contest state and regional levels.Two previous rounds were held on 28 December and 11 January - giving overwhelming victories to the USDP.The party won only 6% of parliamentary seats in the last free election in 2020.As in previous rounds of this strange, month-long election, voting was orderly and peaceful at the polling station in Nyaungshwe, Shan State, which a BBC team observed. Set in a large school, shaded by huge rain trees, there were ample volunteers an officials to guide voters where to go, and how to make their choice using the new, locally-made electronic voting machines. You could be forgiven for believing this was a normal democratic exercise, not the sham its critics say it is.However polling day was preceded by a campaigning period marked by fear, intimidation and a pervasive sense that little will change after the inevitable victory by the USDP. Everywhere the BBC team travelled in southern Shan State, we were followed and closely monitored by dozens of police and military officials, always polite but very persistent. It proved nearly impossible to get people to say anything about the vote, so nervous were they of possible repercussions.The next steps after final results are announced are laid down in the military-drafted constitution. Parliament will meet within the next two months to choose a new president, and everyone expects that to be the coup leader Gen Min Aung Hlaing. It will be the same regime with civilian clothes. But he will then have to relinquish his command of the armed forces. His replacement is certain to be a loyalist, but his hold over the ranks of the military will inevitably be less secure, and it is no secret that many other senior officers do not believe he has made a good job of leading the country. With many more voices in politics, there is the possibility of wider debate inside government over which direction Myanmar should now take, and the possibility - distant for now - of the first steps towards ending the civil war.The military junta took control of Myanmar in a 2021 coup, ousting an elected civilian government led by Nobel Peace Prize Winner Aung San Suu Kyi.She remains in detention and, like many other opposition groups, her National League for Democracy has been formally dissolved.The military has been fighting against both armed resistance groups which oppose the coup and ethnic armies that have their own militias. It lost control of large parts of the country in a series of major setbacks, but clawed back territory this year enabled by support from China and Russia.The civil war has killed thousands of people, displaced millions more, destroyed the economy and left a humanitarian vacuum. A devastating earthquake in March and international funding cuts have made the situation far worse.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Party backed by generals set for landslide in 'sham' Myanmar election",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1203/live/ff7eff80-f9e7-11f0-bfcb-015a25c825bf.jpg"
      ],
      "datePublished": "2026-01-25T13:05:23.000Z",
      "dateModified": "2026-01-25T13:05:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "How Soviet urban planning is helping Russia freeze Ukraine",
    "url": "https://www.bbc.com/news/articles/c338jpk8r1vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d9fc/live/93740900-f93a-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-24T13:56:13.000Z",
    "description": "1 day agoVitaliy ShevchenkoRussia editor, BBC MonitoringUkraine is now living through its most difficult winter in recent memory. With January tempera",
    "body": "1 day agoVitaliy ShevchenkoRussia editor, BBC MonitoringUkraine is now living through its most difficult winter in recent memory. With January temperatures plummeting below -15C, Russia has been attacking energy infrastructure, leaving about a million Ukrainians without heating.The capital, Kyiv, is the main target of such attacks. Following the latest Russian bombardment overnight into 24 January, almost 6,000 apartment blocks were left without heating, according to mayor Vitaly Klitschko.This is the third such Russian attack targeting Kyiv's heating infrastructure in little more than two weeks, after strikes on 9 and 20 January also left hundreds of thousands freezing in their flats.\"Living in Kyiv is a bit of a gamble these days,\" one resident of the Ukrainian capital, Rita, told the BBC. \"If you have heating and gas, there is no electricity and water. If you have electricity and water, there is no heating. \"Coming home is like playing a guessing game every day - will I be able to shower or have hot tea, or neither? And of course missiles and drones come on top of all that.\" She says she has to go to bed wearing a hat and several layers of clothing.What is making things much worse for Ukraine and easier for Russia is the widespread prevalence of apartment blocks that rely on communal central heating - where water is heated up elsewhere and then pumped into their radiators.Heating plants in Ukraine are huge and many thousands of people are affected when they are targeted by Russian forces. Ukraine says that all such power plants have now been hit.Such attacks also disrupt electricity supplies, but while a generator or battery pack might help in this situation, heating is less straightforward - especially when there is also no electricity to power your heater.Kyivteploenergo, the monopoly supplying heating and hot water in the Ukrainian capital, told the BBC \"the absolute majority\" of houses in Kyiv rely on its services. It said it could not share the exact number for security reasons.In Zaporizhzhia, a frontline city home to 750,000 people, almost three-quarters of residents rely on central heating, according to Maksym Rohalsky, the head of the local association of apartment block dwellers.Before Russia's full-scale invasion of 2022, about 11 million households in Ukraine relied on central heating, compared to seven million autonomously heated households, Ukrainian energy expert Yuriy Korolchuk said. Cities across the Soviet Union, including in Ukraine, were the focus of huge construction programmes launched in the 1950s to mass produce cheap housing.The landscapes of cities in the former USSR are dominated by ubiquitous nine-storey residential buildings made from pre-fabricated concrete panels, known as \"panelki\", or smaller five-storey blocks of flats known as \"khrushchevki\", after Soviet leader Nikita Khrushchev, who oversaw their construction in the 1950s and 1960s.Heating to such houses is supplied by large plants known as TETs - an acronym that stands for \"heat and electricity centrals\" in Ukrainian as they generate electricity as well as heat.Detached houses occupied by a single family, known as \"private houses\" in Ukraine, are normally found in rural areas and are rare in cities.\"Ukraine inherited the Soviet heating system and it hasn't changed anything, it stays predominantly centralised,\" Korolchuk told the BBC. \"These heating plants were not designed to be attacked with missiles or drones, that's why these vulnerabilities came to the fore during the war.\"According to him, this is a new tactic used by Russia.\"During the previous winters, there were no such strikes against the heating system. They happened only occasionally, and they didn't directly target heating plants,\" he added.Referring to ongoing talks to end the war, he says \"the factor of negotiations is now possibly playing a role, it's a form of pressure\".Large centralised installations bring about efficiencies of scale, but should they be targeted by bombs or drones, the consequences can be devastating for hundreds of thousands of people.The Ukrainian government is acutely aware of this vulnerability, and is planning to reduce it by making individual heating points mandatory at apartment blocks.However, undoing decades of Soviet urban planning will not be quick or easy.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "How Soviet urban planning is helping Russia freeze Ukraine",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d9fc/live/93740900-f93a-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-24T13:56:13.000Z",
      "dateModified": "2026-01-24T13:56:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Captain of suspected Russian shadow tanker into French custody",
    "url": "https://www.bbc.com/news/articles/c62vke5dly2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/68ad/live/5bd25b00-f9fd-11f0-a24b-df29ade509fc.png",
    "tag": "World",
    "date": "2026-01-25T15:25:52.000Z",
    "description": "5 hours agoThomas MackintoshReutersThe Grinch was intercepted by the French navy on ThursdayFrench officials have taken the Indian captain of a suspec",
    "body": "5 hours agoThomas MackintoshReutersThe Grinch was intercepted by the French navy on ThursdayFrench officials have taken the Indian captain of a suspected Russian shadow fleet tanker into custody days after the oil tanker was seized.On Thursday, the French navy intercepted the tanker - named the Grinch - which President Emmanuel Macron said was \"subject to international sanctions and suspected of flying a false flag\".The Grinch had been travelling through the Mediterranean Sea from the Russian Arctic port of Murmansk. It is now moored, under guard, at a southern French port near Marseille.Although Moscow is yet to comment, Macron said on Thursday that the shadow fleet helped to \"finance Russia's war of aggression against Ukraine\".The office of the Marseille prosecutor office said the rest of the ship's crew members - all also Indians - were being \"kept on board\" while the 58-year-old captain was taken into custody.\"The investigation aims to verify the validity of the flag used by the tanker,\" prosecutors said. French media report say it was sailing under a Comoros Islands flag.  Nautical and air exclusion zones have been established around the anchorage site, officials say.French Joint Staff of the Armed ForcesSoldiers searched the vessel after it was seized in the MediterraneanAnnouncing the seizure on Thursday, Macron said: \"We are determined to uphold international law and to ensure the effective enforcement of sanctions.\"Many Western countries imposed sanctions on Russian energy following Russia's full-scale invasion of Ukraine in 2022.Earlier in January, British armed forces supported a US operation to seize a Russian-flagged tanker in the Atlantic that US officials said had broken sanctions by carrying oil for Venezuela and Russia.Last October, France seized another sanctioned tanker, the Boracay, off its west coast before releasing it a few days later.Shadow fleets are becoming increasingly common, with Venezuela, Iran and Russia all accused of using them to avoid sanctions on oil.Financial intelligence firm S&P Global estimates that one in five oil tankers worldwide are used to smuggle oil from sanctioned countries.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Captain of suspected Russian shadow tanker into French custody",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/68ad/live/5bd25b00-f9fd-11f0-a24b-df29ade509fc.png"
      ],
      "datePublished": "2026-01-25T15:25:52.000Z",
      "dateModified": "2026-01-25T15:25:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alex Honnold completes live Netflix free solo climb of Taipei 101 without safety gear",
    "url": "https://www.bbc.com/news/articles/c4gl0njzxjdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7e80/live/be958110-f9d3-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "World",
    "date": "2026-01-25T14:56:24.000Z",
    "description": "Climber Alex Honnold scales 101-floor skyscraper without safety gear5 hours agoOttilie MitchellWatch: Climber Alex Honnold scales 101-floor skyscraper",
    "body": "Climber Alex Honnold scales 101-floor skyscraper without safety gear5 hours agoOttilie MitchellWatch: Climber Alex Honnold scales 101-floor skyscraper without safety gearAmerican climber Alex Honnold has successfully scaled a Taiwan skyscraper without a rope, harness or safety equipment. The building, named Taipei 101 for the number of its floors, is 508m (1,667ft) tall, made of steel, glass and concrete and is designed to resemble a stick of bamboo.Honnold is renowned for being the first person to climb El Capitan without ropes or safety gear. The 915m (3,000 foot) granite cliff is in California's Yosemite national park.The climb was originally set to take place on Saturday but was delayed by wet weather. His ascent in Taiwan's capital was streamed live on Netflix, which said there was a delay on the live feed should the worst happen. \"We'll cut away,\" Netflix executive Jeff Gaspin told Variety magazine in the run-up to the event. \"Nobody expects or wants to see anything like that to happen.\"Honnold completed the climb in one hour and 31 minutes on Sunday - and celebrated the achievement with one word: \"Sick.\"His time more than halves the record of the only other person to scale the tower. Alain Robert, a Frenchman who called himself \"Spiderman\", made it to the top of Taipei 101 - at the time the world's tallest building - in four hours. He did so with ropes and a harness.RITCHIE B TONGO/EPA/ShutterstockGetty ImagesTaiwan's Vice-President Hsiao Bi-khim congratulated Honnold, writing on X: \"I admit I would probably feel sick, too, barely able to watch.\" Honnold was greeted at the top of the building by his wife, who expressed concern for the wind and heat as he climbed.But there was another distraction during his ascent. As Honnold reached the 89th floor, fans cheered and waved, face to face but for the window with the man clinging to the building.Video of the moment was shared by Honnold and Netflix on Instagram, showing the climber continuing undeterred.Honnold has made many extreme climbs during his career. A documentary about his ascent of El Capitan, titled Free Solo, won an Academy Award.Getty ImagesGetty ImagesPeople is Taipei watched Honnold climb the buildingGetty ImagesReutersThe building, named Taipei 101 for the number of its floors, stands at 508m (1,667ft)",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alex Honnold completes live Netflix free solo climb of Taipei 101 without safety gear",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7e80/live/be958110-f9d3-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-25T14:56:24.000Z",
      "dateModified": "2026-01-25T14:56:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who was Alex Pretti, the intensive care nurse shot dead in Minneapolis?",
    "url": "https://www.bbc.com/news/articles/c62r4g590wqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1751/live/9fd14180-f9ea-11f0-811c-ad0579c12ce2.jpg",
    "tag": "World",
    "date": "2026-01-25T12:24:31.000Z",
    "description": "8 hours agoJacob PhillipsFamily handoutAlex Pretti was killed in Minneapolis on SaturdayA man who was shot dead by federal agents in Minneapolis has b",
    "body": "8 hours agoJacob PhillipsFamily handoutAlex Pretti was killed in Minneapolis on SaturdayA man who was shot dead by federal agents in Minneapolis has been identified by his family as 37-year-old intensive care nurse Alex Pretti.He has been described as an avid outdoorsman who loved mountain biking and is understood to have joined protests after Renee Good, also 37, was shot dead by an Immigration and Customs Enforcement (ICE) agent in her car earlier this month.Conflicting accounts have emerged about the moments leading up to his death.The Department of Homeland Security (DHS) said an agent fired in self-defence after Pretti, who they claim had a handgun, resisted attempts to disarm him. Some eyewitnesses and officials, as well as Pretti's family, have challenged that account.Videos show no evidence to support the claim he used any armed force to threaten agents.Pretti worked as an ICU nurse at the Minneapolis Veterans Affairs hospital, his family said in a statement. They told the Associated Press news agency (AP) that he was upset by US President Donald Trump's crackdown on immigration in the city. Pretti's mother also said her son cared immensely about the Trump administration's rollback of environmental regulations.\"He hated that, you know, people were just trashing the land,\" Susan Pretti told AP. She added: \"He was an outdoorsman. He took his dog everywhere he went. You know, he loved this country, but he hated what people were doing to it.\"Pretti had no interactions with law enforcement beyond traffic tickets, family sayPretti loved adventures with his beloved Catahoula Leopard dog Joule, who died around a year ago, AP reported. His family said he had no interaction with law enforcement beyond a handful of traffic tickets. According to AP, court records show he had no criminal record.Pretti's parents, who live in Wisconsin, said they had also recently told their son to be careful while protesting.\"We had this discussion with him two weeks ago or so, you know, that go ahead and protest, but do not engage, do not do anything stupid, basically,\" his father Michael Pretti told AP. \"And he said he knows that. He knew that.\"Pretti's family also explained he owned a handgun and had a permit to carry a concealed handgun in Minnesota - but they had never known him to carry it.Minneapolis Police Chief Brian O'Hara also said police believed he was a lawful gun owner with a permit to carry, the BBC's US partner CBS reported. 'Please get the truth out about our son'After seeing videos suggesting their son was a \"domestic terrorist,\" Pretti's family issued a statement saying \"the sickening lies told about our son by the administration are reprehensible and disgusting\".They claimed videos showed Pretti was not holding a gun when he was tackled by federal agents. \"Please get the truth out about our son. He was a good man,\" they urged in their statement.Pretti was a Democratic voter and had taken part in the wave of street protests after George Floyd was killed by a Minneapolis police officer in 2020, his ex-wife told AP.She said that he was someone who may shout at law enforcement officers at a protest but had never known him to be physically confrontational.ReutersA woman cries as people gather around a makeshift memorial close to where Alex Pretti was shotA US citizen born in Illinois, Pretti grew up in Green Bay, Wisconsin, where he played football, baseball and ran track for Preble High School. He was a Boy Scout and sang in the Green Bay Boy Choir. He went to the University of Minnesota, graduating in 2011 with a bachelor's degree in biology, society and the environment, according to his family.He worked as a research scientist before returning to education to qualify as a registered nurse.His parents said their last conversation with their son was a couple of days before he was shot dead when they spoke about repairs he had done to the garage door at his home, AP reported. A Latino man had completed the work and Pretti's parents said with all that was happening in Minneapolis he gave the man a $100 (£74) tip.Doctor Dmitri Drekonja, who worked with Pretti, told ABC News the pair had bonded over their interest in mountain biking and would compare notes on which trails to ride.\"He was the type of person you enjoyed being around and the notion that this helpful, smiling joking guy was being labelled a terrorist? It's galling,\" he said.ReutersPeople gather around a makeshift memorial close to where Alex Pretti was fatally shotNeighbours described Pretti as quiet and warmhearted.\"He's a wonderful person,\" Sue Gitar told AP, who lived downstairs from the nurse and said he moved into the building about three years ago. \"He has a great heart.\"Pretti lived alone and worked long hours as a nurse, but he was not a loner, his neighbours said.\"I never thought of him as a person who carried a gun,\" said Gitar.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who was Alex Pretti, the intensive care nurse shot dead in Minneapolis?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1751/live/9fd14180-f9ea-11f0-811c-ad0579c12ce2.jpg"
      ],
      "datePublished": "2026-01-25T12:24:31.000Z",
      "dateModified": "2026-01-25T12:24:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tour Down Under 2026: Jay Vine wins despite crash with kangaroo ",
    "url": "https://www.bbc.com/sport/cycling/articles/cgez09jl05wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a808/live/014610a0-f9f8-11f0-b385-5f48925de19a.jpg",
    "tag": "World",
    "date": "2026-01-25T14:16:37.000Z",
    "description": "Australian Jay Vine won the Tour Down Under - despite being knocked off his bike in a crash caused by a kangaroo.Britain's Matthew Brennan took the fi",
    "body": "Australian Jay Vine won the Tour Down Under - despite being knocked off his bike in a crash caused by a kangaroo.Britain's Matthew Brennan took the fifth and final stage of the race in Australia, on a day dominated by drama in the peloton.The kangaroo ran across the road with under 100km of the race to go and launched itself into the peloton, knocking several riders to the ground before tumbling into more who were trying to avoid it.Vine, having been knocked down, used a team-mate's bike to claim the overall winner's ochre jersey by one minute three seconds for UAE Team Emirates-XRG.Visma-Lease A Bike rider Brennan beat New Zealand's Finn Fisher-Black of Red Bull-Bora Hansgrohe to the line for the stage victory after a powerful acceleration on the uphill sprint finish.Brennan's team-mate Menno Huising of the Netherlands was one of the riders forced to abandon the race, having been injured in the kangaroo incident.Tobias Lund Andresen of Decathlon-CMA CGM took third on the 169.8km stage around the Stirling near Adelaide.Switzerland's Mauro Schmid of Jayco-AlUla was second overall and Australia's Harry Sweeney third for EF Education-EasyPost. Lund Andresen took the blue points jersey, with Norway's Martin Urianstad Bugge winning the mint-green king of the mountains jersey for Uno X Mobility.Brennan ranks highly among several young talented British riders competing on the UCI World Tour this year.He won 12 races in his debut elite-level season in 2025.The win caps a good week for British riders at the first World Tour race of the year following Ethan Vernon's sprint victory on Saturday's stage four for NSN - the new team co-owned by World Cup winner Andres Iniesta.That stage had been shortened to account for temperatures of up to 43C.UK road champion Sam Watson won the opening prologue of the race for Ineos Grenadiers.Many of the riders will now take on the one-day Cadel Evans Great Ocean Road Race in Melbourne, with Brennan a strong favourite for victory.Brennan is particularly powerful on rolling one-day courses, and is set to compete in several of the sport's biggest races this year, including the one-day Milan-San Remo in March, as well as the Tour of Flanders and Paris-Roubaix in April.  ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tour Down Under 2026: Jay Vine wins despite crash with kangaroo ",
      "image": [
        "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a808/live/014610a0-f9f8-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-25T14:16:37.000Z",
      "dateModified": "2026-01-25T14:16:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Winter storm grips US as millions face power outages and disruption",
    "url": "https://www.bbc.com/news/videos/cpqyxlqwqqlo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a968/live/f92aeb60-fa07-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-25T16:22:56.000Z",
    "description": "A severe winter storm has brought heavy snow, and freezing temperatures to Americans across the United States.The National Weather Service has warned ",
    "body": "A severe winter storm has brought heavy snow, and freezing temperatures to Americans across the United States.The National Weather Service has warned of dangerously cold wind chills with night-time temperatures falling below -20C in some cities.Calling the storms \"historic,\" President Donald Trump on Saturday approved federal emergency disaster declarations in South Carolina, Virginia, Tennessee, Georgia, North Carolina, Maryland, Arkansas, Kentucky, Louisiana, Mississippi, Indiana, and West Virginia.More on this story.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Winter storm grips US as millions face power outages and disruption",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a968/live/f92aeb60-fa07-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-25T16:22:56.000Z",
      "dateModified": "2026-01-25T16:22:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Could trilateral talks yield a breakthrough in Ukraine-Russia war?",
    "url": "https://www.bbc.com/news/videos/c20dlr9kn37o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d410/live/613d6240-f86a-11f0-b385-5f48925de19a.jpg",
    "tag": "World",
    "date": "2026-01-23T14:54:36.000Z",
    "description": "Russian, Ukrainian and US negotiators are meeting in Abu Dhabi today for the first trilateral talks since Russia's full-scale invasion in February 202",
    "body": "Russian, Ukrainian and US negotiators are meeting in Abu Dhabi today for the first trilateral talks since Russia's full-scale invasion in February 2022.But there are hurdles to overcome before any peace deal can be agreed, as the BBC's Joe Inwood explains.2 days agoWar in UkraineRussiaUnited StatesUkraineMorocco celebrates Afcon win: 'Today is about couscous not jollof'Moroccan fans celebrated through the night as their beloved Atlas Lions beat Nigeria to make it to the Afcon final.WorldWhat message do Greenlanders have for Trump?The BBC's Europe editor Katya Adler hears from Greenlanders, whose island is embroiled in a geopolitical storm.World'Now there's the threat of executions' in IranAn Iranian security official says 2,000 people have been killed so far after a crackdown on weeks of anti-government protests.WorldWatch: How could Trump respond to Iran crackdown?The US president and his administration have threatened \"very strong options\" to intervene in Iran, including military action.WorldWhat we know about Iran's protests and the crackdownThe BBC's diplomatic correspondent, Caroline Hawley, looks into the latest events unfolding in Iran.\nWorld'He's crazy': BBC speaks to Greenlanders about Trump's threatsThe BBC's Europe Editor Katya Adler visits the Arctic island to ask what people think of the US president's plans.WorldWatch: 'I want a president who's involved'- Michiganders weigh in on Maduro's seizureThe BBC speaks to people in the Detroit area about their views on US removing Venezuela's Nicolas Maduro from power.WorldWatch: US seizes oil tanker in Caribbean seaThe US Coast Guard boarded two \"ghost fleet\" tanker ships in a \"meticulously coordinated\" operation, Homeland Security Secretary Kristi Noem said.WorldWatch: Trump says Maduro copied his dancing. Did he?The US president on Tuesday claimed the ousted Venezuelan leader imitated his moves. Here's a side-by-side look at both men's dancing.WorldTrump supporters across US react to Venezuela operationTrump supporters react after US forces seized Venezuela’s Nicolas Maduro with some welcoming the move and others expressing caution about what it means going forward.WorldBBC Verify examines claims Venezuela 'stole' US oilThe US government has made it clear that getting access to Venezuelan oil is an important motivation for its actions in the country.WorldWatch: What it was like in the courtroom at Maduro's hearingThe BBC's Madeline Halpert was inside the room as the former Venezuelan president addressed the judge. WorldWatch: Nicolás Maduro and Cilia Flores's journey to New York courtThe deposed Venezuelan president and his wife appeared in handcuffs as they were escorted by armed officers.WorldBBC Mundo reports from a quiet Venezuela-Colombia border after Maduro's arrestA once-busy commercial district at the Venezuela-Colombia border falls silent as many Venezuelans wait to see what happens next to their country.WorldWatch: 'I'm so happy' - Venezuelans in the US react to Maduro's captureThe BBC's Bernd Debusmann reports from Doral Florida, where the Venezuelan-American community has gathered to celebrate the US attack.WorldTrump on Venezuela: 'We are going to run the country'President Donald Trump announced that the US will run Venezuela until a 'proper transition can take place.'WorldExplosions and smoke at La Guaira portVenezuela has declared a national emergency, denouncing \"extremely serious military aggression\"WorldReporter in Caracas describes hearing loud bangs and planesAna Vanessa Herrero is in Caracas and says she began hearing planes at 02:00 local time.\nWorldWatch: Earthquake interrupts Mexico's president during news conferenceThe 6.5 magnitude trembler shook buildings and set off the country's earthquake alert system. WorldFireworks, drums and light shows: How the world is welcoming 2026Countries around the world celebrated the new year with colourful shows and long-held traditions.World",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Could trilateral talks yield a breakthrough in Ukraine-Russia war?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d410/live/613d6240-f86a-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-23T14:54:36.000Z",
      "dateModified": "2026-01-23T14:54:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Watch: BBC at protests near scene where Alex Pretti was shot dead",
    "url": "https://www.bbc.com/news/videos/c6206p2zyyqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/14ed/live/53afe460-f9ad-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-25T05:45:44.000Z",
    "description": "Crowds gathered in freezing temperatures in Minneapolis, near the scene where a man was shot dead during an altercation with federal agents on Saturda",
    "body": "Crowds gathered in freezing temperatures in Minneapolis, near the scene where a man was shot dead during an altercation with federal agents on Saturday.People who gathered to lay flowers and light candles chanted Alex Pretti's name, and there were also angry scenes as protesters voiced their anger.The 37-year-old ICU nurse was killed less than three weeks after Renee Good was shot dead by an immigration agent in the city.The BBC's Tom Bateman is in Minneapolis.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Watch: BBC at protests near scene where Alex Pretti was shot dead",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/14ed/live/53afe460-f9ad-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-25T05:45:44.000Z",
      "dateModified": "2026-01-25T05:45:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sir Mark Tully, the BBC's 'voice of India', dies aged 90 ",
    "url": "https://www.bbc.com/news/articles/c4nnp4d064do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4121/live/0ed9ada0-1c21-11ef-80aa-699d54c46324.jpg",
    "tag": "World",
    "date": "2026-01-25T12:12:08.000Z",
    "description": "8 hours agoAndrew WhiteheadGetty ImagesSir Mark spent much of his journalistic career covering IndiaThe broadcaster and journalist Sir Mark Tully - fo",
    "body": "8 hours agoAndrew WhiteheadGetty ImagesSir Mark spent much of his journalistic career covering IndiaThe broadcaster and journalist Sir Mark Tully - for many years known as the BBC's \"voice of India\" - has died at the age of 90.For decades, the rich, warm tones of Sir Mark were familiar to BBC audiences in Britain and around the world - a much-admired foreign correspondent and respected reporter and commentator on India. He covered war, famine, riots and assassinations, the Bhopal gas tragedy and the Indian army's storming of the Sikh Golden Temple.In the small north Indian city of Ayodhya in 1992, he faced a moment of real peril. He witnessed a huge crowd of Hindu hardliners tear down an ancient mosque. Some of the mob - suspicious of the BBC - threatened him, chanting \"Death to Mark Tully\". He was locked in a room for several hours before a local official and a Hindu priest came to his aid.How the Babri mosque destruction shaped IndiaWill English kill off India's languages?The demolition provoked the worst religious violence in India for many decades - it was, he said years later, the \"gravest setback\" to secularism since the country's independence from Britain in 1947.\"We are sad to hear the passing of Sir Mark Tully,\" Jonathan Munro, Interim CEO of BBC News and Current Affairs, said in a statement. \"As one of the pioneers of foreign correspondents, Sir Mark opened India to the world through his reporting, bringing the vibrancy and diversity of the country to audiences in the UK and around the world.\"His public service commitments and dedication to journalism saw him work as a bureau chief in Delhi, and report for outlets across the BBC. Widely respected in both India and the UK, he was a joy to speak with and will be greatly missed.\"India was where Sir Mark was born - in what was then Calcutta (now Kolkata) in 1935. He was a child of the British Raj. His father was a businessman. His mother had been born in Bengal - her family had worked in India as traders and administrators for generations.He was brought up with an English nanny who once chided him for learning to count by copying the family's driver: \"that's the servants' language, not yours\", he was told. He eventually became fluent in Hindi, a rare achievement in Delhi's foreign press corps and one which endeared him to many Indians for whom he was always \"Tully sahib\". His good cheer and evident affection for India won him the friendship and trust of many of the top rank of the country's politicians, editors and social activists.Sir Mark, seen here with members of India's armed forces, arrived in India as an administrative assistant at the BBC in 1965Throughout his life, he performed a balancing act: English, without doubt; but not - he insisted - an expat who was passing through India. He had roots there; it was his home. It's where he lived for three-quarters of his life.Immediately after World War Two, at the age of nine, Sir Mark came to Britain for his education. He studied history and theology at Cambridge and then headed to theological college with the aim of being ordained as a clergyman before he - and the church - had second thoughts.He was sent to India for the BBC in 1965 - at first as an administrative assistant, but in time he began to take on a reporting role. His broadcasting style was idiosyncratic, but his strength of character and his insight into India shone through.Some critics said he was too indulgent of India's poverty and caste-based inequality; others admired his clearly expressed commitment to the religious tolerance upon which independent India was anchored. It's \"really important to treasure the secular culture of this country, allowing every religion to flourish,\" he told an Indian newspaper in 2016. \"... we must not endanger this by insisting on Hindu majoritarianism\".Getty ImagesSir Mark's was a familiar voice for BBC listeners in the UK and around the worldSir Mark was never an armchair correspondent. He travelled relentlessly across India and neighbouring countries, by train when he could. He gave voice to the hopes and fears, trials and tribulations, of ordinary Indians as well as the country's elite. He was as comfortable wearing an Indian kurta as in a shirt and tie.He was expelled from India at 24 hours' notice in 1975 after the then prime minister, Indira Gandhi, ordered a state of emergency. But he headed back 18 months later and had been based in Delhi ever since. He spent more than 20 years as the BBC's head of bureau in Delhi, leading the reporting not simply of India but of South Asia, including the birth of Bangladesh, periods of military rule in Pakistan, the Tamil Tigers' rebellion in Sri Lanka and the Soviet invasion of Afghanistan.Over time, he became increasingly out of step with the BBC's corporate priorities, and in 1993 he made a much-publicised speech accusing the then director general, John Birt, of running the corporation by \"fear\". It marked a parting of the ways. Sir Mark resigned from the BBC the following year. But he continued to broadcast on BBC airwaves notably as presenter of Radio 4's Something Understood, turning back to issues of faith and spirituality which had engaged him as a student.Getty ImagesSir Mark stayed on in Delhi after he left the BBCUnusually for a foreign national, Sir Mark was accorded two of India's top civilian honours: the Padma Shri and the Padma Bhushan. Britain too gave him recognition. He was knighted for services to broadcasting and journalism in the 2002 New Year's honours list. He described the award as \"an honour to India\".He continued to write books about India - essays, analyses, short stories too, sometimes in collaboration with his partner, Gillian Wright. He lived un-ostentatiously in south Delhi.Sir Mark never gave up his British nationality but was proud also to become late in life an Overseas Citizen of India. That made him, he said, \"a citizen of the two countries I feel I belong to, India and Britain\".Read more on the story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sir Mark Tully, the BBC's 'voice of India', dies aged 90 ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4121/live/0ed9ada0-1c21-11ef-80aa-699d54c46324.jpg"
      ],
      "datePublished": "2026-01-25T12:12:08.000Z",
      "dateModified": "2026-01-25T12:12:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]