[
  {
    "title": "French 'Doctor Death' who poisoned patients jailed for life",
    "url": "https://www.bbc.com/news/articles/c2epv08xwz7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1119/live/b556e450-dbf0-11f0-8af2-2d39028f98bc.jpg",
    "tag": "World",
    "date": "2025-12-18T13:24:41.000Z",
    "description": "15 hours agoHugh Schofield,ParisandLaura GozziA former anaesthetist has been jailed for life for intentionally poisoning 30 patients, 12 of them fatal",
    "body": "15 hours agoHugh Schofield,ParisandLaura GozziA former anaesthetist has been jailed for life for intentionally poisoning 30 patients, 12 of them fatally.Frédéric Péchier, 53,  was convicted Friday at the end of a four-month trial in the eastern city of Besançon.In one of France's biggest ever medical malpractice cases, Péchier was found to have introduced chemicals like potassium chloride or adrenaline into the infusion bags of patients. His youngest victim, a four-year-old child, survived two cardiac arrests during a routine tonsil surgery in 2016. The oldest victim was 89.\"You are Doctor Death, a poisoner, a murderer. You bring shame on all doctors,\" said prosecutors last week. \"You have turned this clinic into a graveyard.\"The chemicals Péchier added triggered cardiac arrest or haemorrhaging in patients, which required emergency intervention in the operating theatre.This was often provided by Péchier himself, who was then able to pose as the patient's saviour.But in 12 cases he was unable to intervene, or it was too late, and the patient died.The prosecution argued that Péchier acted in order to discredit fellow anaesthetists against whom he bore a grudge.In most of the operations, he was not the primary anaesthetist. It was alleged he came in early to the clinic to tamper with the infusion bags.Then, when things went wrong, he was able to step in after diagnosing the problem and ordering an antidote.Péchier was first placed under investigation eight years ago, when he was suspected of poisoning patients at two clinics in Besançon between 2008 and 2017. The alert was raised in 2017 after a surfeit of potassium chloride was found in the infusion bag of a woman who had a heart attack while being operated on for a back complaint.Investigators found a pattern of \"serious adverse events\" at the Saint-Vincent private clinic in Besançon. While the national average for fatal heart attacks under anaesthetic was 1 in 100,000, at the clinic it was more than six times that.And in most cases nationally, an explanation for the heart attack was subsequently found, whereas at Saint-Vincent the cause remained a mystery.It was also found that the \"serious adverse events\" ceased when Péchier left for a short period to work at another clinic, which itself then saw an uptick. Then when he returned to Saint-Vincent, the emergencies resumed there. When he was disbarred from practising in 2017, the anomaly stopped.Péchier's first known victim, Sandra Simard, was 36 when she experienced a sudden cardiac arrest in the middle of spine surgery. She survived thanks to intervention by Péchier, although she went into a coma. Tests on her infusion bags showed concentrations of potassium 100 times the expected dose and the alarm was sounded with local prosecutors. During the 15 weeks of the trial, Péchier sometimes acknowledged that some of the patients who fell ill or died may have been poisoned but he denied any wrongdoing. \"I have said it before and I'll say it again: I am not a poisoner... I have always upheld the Hippocratic oath,\" he stated. Péchier will now spend a minimum of 22 years behind bars, having been at liberty throughout the trial.He has 10 days to lodge an appeal, which would entail a second trial within a year.According to the trial prosecutor: \"His colleagues said he always seemed to have the answer. That he made himself out to be the best, that he created this character of the saviour, so that colleagues would instinctively turn to him.\"Péchier denied the charges and his lawyers argued that there was no hard proof linking him to the crimes. But his own testimony varied in the trial, and he ended up admitting there must have been a poisoner at large in the clinic, but it was not him.The son of two parents in the medical profession, Péchier was described by a court psychologist as having a Dr Jekyll and Mr Hyde personality – one side respectable, the other side capable of doing great harm. In 2014 and again in 2021 he made attempts to kill himself.A divorced father of three children, he told the court before the verdict that his sole concern was to protect his family. His children wept as the sentence was read but he remained impassive.\"It's the end of a nightmare,\" said survivor Sandra Simard. Another patient who survived, Jean-Claude Gandon, said: \"We can have an easier Christmas now.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "French 'Doctor Death' who poisoned patients jailed for life",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1119/live/b556e450-dbf0-11f0-8af2-2d39028f98bc.jpg"
      ],
      "datePublished": "2025-12-18T13:24:41.000Z",
      "dateModified": "2025-12-18T13:24:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "EU leaders to loan €90bn to Ukraine - but fail to agree on using Russian assets ",
    "url": "https://www.bbc.com/news/articles/c3e025vyppeo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c01b/live/b40edb10-dc8c-11f0-b67b-690eb873de1b.jpg",
    "tag": "World",
    "date": "2025-12-19T03:55:45.000Z",
    "description": "European Union leaders have struck a deal to give Ukraine a €90bn (£79bn; $105bn) loan after failing to agree on using frozen Russian assets.The agree",
    "body": "European Union leaders have struck a deal to give Ukraine a €90bn (£79bn; $105bn) loan after failing to agree on using frozen Russian assets.The agreement, which leaders said would meet Ukraine's military and economic needs for the next two years, came after more than a day of talks at a summit in Brussels. \"We committed, we delivered,\" EU chief Antonio Costa wrote on X as he announced the deal to provide a loan backed by the bloc's common budget. Ukrainian President Volodymyr Zelensky had urged leaders to use €200 billion of frozen Russian assets but Belgium, where the vast bulk of the cash is held, demanded guarantees on sharing liability that proved too much for other countries.In another development, French President Emmanuel Macron said he believed it would be \"useful\" for Europe to re-engage with Russian President Vladimir Putin.\"I believe that it's in our interest as Europeans and Ukrainians to find the right framework to re-engage this discussion,\" he said, adding that Europeans should find the means to do so \"in coming weeks\".EU ⁠leaders avoided \"chaos ‍and ‍division\" ​with ‌their decision to provide Ukraine with a loan through borrowing cash rather than ​use frozen Russian assets, Belgian Prime Minister Bart De ​Wever said early on Friday.\"We remained united,\" De ‌Wever added. Ukraine is months from running out of cash and Zelensky said without an injection by spring Ukraine would \"have to reduce production of drones\".The EU estimates Ukraine needs an extra €135 billion to stay afloat over the next two years, with the cash crunch set to start in April.German Chancellor Friedrich Merz, who had pushed for the asset plan, said the final decision on the loan \"sends a clear signal\" to Putin.Russia had warned EU leaders not to use its money, but Polish Prime Minister Donald Tusk said they had to \"rise to this occasion\".The agreement offers Kyiv a desperately needed lifeline amid a flurry of diplomacy as US President Donald Trump pushes for a quick deal to end Russia's war.US and Russian officials are due to meet in Miami this weekend for further talks on a peace plan, a White House official has told AFP news agency. It is thought Kremlin envoy Kirill Dmitriev will talk to Trump envoys Steve Witkoff and Jared Kushner in Miami.Meanwhile, Zelensky announced Ukrainian and US delegations would hold new talks on Friday and Saturday in the United States.He said he wanted Washington to give more details on the guarantees it could offer to protect Ukraine from another invasion.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "EU leaders to loan €90bn to Ukraine - but fail to agree on using Russian assets ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c01b/live/b40edb10-dc8c-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-19T03:55:45.000Z",
      "dateModified": "2025-12-19T03:55:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Australia announced gun buyback scheme in wake of Bondi attack",
    "url": "https://www.bbc.com/news/articles/cn09p4kjj4wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/65ac/live/62777320-dc82-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "World",
    "date": "2025-12-19T02:30:21.000Z",
    "description": "The Australian government has announced a gun buyback scheme in the wake of the Bondi Beach attack - its deadliest mass shooting in decades.The scheme",
    "body": "The Australian government has announced a gun buyback scheme in the wake of the Bondi Beach attack - its deadliest mass shooting in decades.The scheme is the largest since the Port Arthur massacre in 1996, which left 35 people dead and prompted Australia to introduce world-leading gun control measures.Fifteen people were killed and dozens injured on Sunday when two gunmen, believed to have been motivated by \"Islamic State ideology\", opened fire on a Jewish festival at the country's most iconic beach.On Friday, police also said there was no ongoing reason to detain a group of men who were arrested in Sydney over their \"extremist Islamic ideology\".Police allege Sunday's attack, which they have declared a terrorist incident, was committed by a father-son duo. Naveed Akram, 24, has been charged with 59 offences, including 15 counts of murder and one of committing a terrorist act. His father Sajid was killed during the attack.The day after the shooting, national cabinet - which includes representatives from the federal government and leaders from all states and territories - agreed to tighten gun controls.Speaking to media on Friday, Prime Minister Anthony Albanese said there are now more than 4 million firearms in Australia - more than at the time of the Port Arthur massacre.\"We know that one of these terrorists held a firearm licence and had six guns, in spite of living in the middle of Sydney's suburbs... There's no reason why someone in that situation needed that many guns. \"If you're going to reduce the number of guns, then a buyback scheme has to be a piece of that puzzle,\" Australian Federal Police Commissioner Krissy Barrett added.The new scheme will purchase surplus, newly banned and illegal firearms, and will be funded on a 50-50 basis with the states and territories. Hundreds of thousands of firearms will be collected and destroyed, the government estimates.National cabinet has also agreed to impose limits on the number of firearms held by any one individual, restrict open-ended firearms licensing and the types of guns that are legal and make Australian citizenship a condition of holding a firearm licence. Work on a national firearms register will be accelerated and firearm regulators will have better access to criminal intelligence.On Friday, New South Wales Police said they were preparing to release seven men with extremist ideology, but that they would continue to be monitored.Tactical officers swarmed on the group, who had travelled from Victoria and were known to police there, in dramatic scenes in the suburb of Liverpool on Thursday. Officers found a knife, but no guns or other weapons.NSW Police Commissioner Mal Lanyon told a press conference there is \"no confirmed link\" between the alleged terrorists and the detained group, but that Bondi Beach was one of several locations the latter was intending to visit.\"Whilst this specific threat posed by the males is unknown, I can say that the potential [for] a violent offence being committed was such that we were not prepared to tolerate the risk,\" Commissioner Lanyon said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australia announced gun buyback scheme in wake of Bondi attack",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/65ac/live/62777320-dc82-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-19T02:30:21.000Z",
      "dateModified": "2025-12-19T02:30:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump Media to merge with fusion energy firm in $6bn deal",
    "url": "https://www.bbc.com/news/articles/cp9kv9lld38o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/039a/live/2429bec0-dc2d-11f0-baba-317f14ba3c9d.jpg",
    "tag": "World",
    "date": "2025-12-18T17:32:16.000Z",
    "description": "11 hours agoPritti MistryBusiness reporterThe firm behind President Donald Trump's Truth Social platform is merging with a Google-backed energy compan",
    "body": "11 hours agoPritti MistryBusiness reporterThe firm behind President Donald Trump's Truth Social platform is merging with a Google-backed energy company in a deal valued at more than $6bn (£4.4bn).Trump Media & Technology Group (TMTG) and TAE Technologies announced the plans on Thursday in a joint statement, which said the move would \"create one of the world's first publicly traded fusion companies\".Fusion power is a method of generating energy from heat released by nuclear fusion reactions. It could release vast amounts of energy with little associated radioactivity.The statement said the combined company planned to begin constructing the \"world's first utility-scale fusion power plant\" next year, with further plants to follow.Under the merger both firms will have an equal 50% share in ownership after the deal is completed, which is expected by mid-2026 pending regulatory and shareholder approvals.The combined company will have a nine-member board including Trump Media's current chief executive Devin Nunes, who will be co-chief executive of the new firm, and the president's son Donald Trump Jr.TAE Technologies provides technology for energy storage and power delivery systems for batteries and electric vehicles. Its umbrella organisation, TAE Life Sciences, develops technologies and drugs for treating cancer patients.The tie-up with the firm signals a bold and surprising shift for Trump Media, as it moves from social media and financial offerings into the energy sector. Mr Nunes said his firm was \"taking a big step forward toward a revolutionary technology that will cement America's global energy dominance for generations\". Calling fusion power the \"most dramatic energy breakthrough\" since the 1950s, he said Trump Media would bring \"the capital and public market access\" to help make TAE's technology commercial viable. As part of the agreement, Trump Media is to provide up to $200m (£149m) of cash to TAE Technologies when completion of the deal is signed. An additional $100m (£74.7m) will be available once the transaction has been registered.Surging electricity demand for AI data centers has revived interest in cleaner and reliable nuclear power, including restarting shuttered reactors, expanding existing ones and signing contracts for future small modular reactors.The joint statement said TAE Technologies had raised more than $1.3bn of funding from other investors including Google and Goldman Sachs.Trump Media, which mainly generates revenue from advertising on the Truth Social platform, has consistently clocked losses since it began. It posted a decline in revenue and a loss of $54.8m (£40.9m) in the third quarter ending September.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump Media to merge with fusion energy firm in $6bn deal",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/039a/live/2429bec0-dc2d-11f0-baba-317f14ba3c9d.jpg"
      ],
      "datePublished": "2025-12-18T17:32:16.000Z",
      "dateModified": "2025-12-18T17:32:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dan Bongino stepping down as FBI deputy director",
    "url": "https://www.bbc.com/news/articles/cvgj0p5yl92o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a7e1/live/658e5420-db92-11f0-88ca-0b2596ca1cee.jpg",
    "tag": "World",
    "date": "2025-12-18T10:35:30.000Z",
    "description": "Dan Bongino has said he will leave his role as the FBI's deputy director in January.In a post on X, he thanked President Donald Trump, as well as the ",
    "body": "Dan Bongino has said he will leave his role as the FBI's deputy director in January.In a post on X, he thanked President Donald Trump, as well as the director of the FBI and the US attorney general \"for the opportunity to serve with purpose\". Bongino did not say in his post why he was stepping down.Earlier on Wednesday, Trump said the former podcast host \"did a great job\" in office, and \"wants to go back to his show\".Bongino, who was appointed to the role by Trump in February, built a large following through his podcast and other media appearances. He was previously a New York City police officer and a US Secret Service agent assigned to protect Barack Obama, the former president.Bongino, a staunch Trump ally, was considered a surprise pick for the role –  which had previously been held by career agents – because he had no prior experience with the agency.The FBI Agents Association, which represents around 14,000 current and former agents, had opposed his appointment to the position.Announcing his decision to step down in Wednesday's social media post, Bongino wrote: \"I will be leaving my position with the FBI in January. I want to thank President Trump, AG [Pam] Bondi, and Director [Kash] Patel for the opportunity to serve with purpose.\"Most importantly, I want to thank you, my fellow Americans, for the privilege to serve you. God bless America, and all those who defend Her.\"Before joining the agency, Bongino had echoed disinformation and conspiracy theories about Trump's false claim that he won the 2020 election, and about the 6 January 2021 pipe bomb investigation. Bongino had previously called the pipe bomb case an \"inside job\". After taking office he pushed to make the investigation, which Attorney General Bondi said had \"languished\", a priority for the FBI.Earlier this month, a man with no known ties to the government was arrested, nearly six years after the pipe bombs were discovered outside the national headquarters for the Republican and Democratic parties. FBI Director Patel, in a social media post on Wednesday praising Bongino's tenure, said he had \"served as the people's voice for transparency, and delivered major breakthroughs in long unsolved cases like the pipe bomb investigation\".\"He not only completed his mission - he far exceeded it,\" Patel wrote.Bongino also appeared to change his mind about the death of sex offender Jeffrey Epstein once he became a leader at the FBI.As a commentator, he had questioned whether Epstein took his own life in a New York prison cell in 2019 while awaiting trial. Then, in May, Bongino said: \"I have seen the whole file. He killed himself\".In July, the US justice department and FBI released a memo that said Epstein did take his own life, and did not have a \"client list\".The memo frustrated many of Trump's supporters, who echoed the Epstein conspiracy theories and rejected the justice department's findings.According to the BBC's media partner CBS News, the memo led to a contentious meeting between him and Bondi.Bondi, who oversees the FBI, wrote in a brief post on X on Wednesday that \"Americans are safer\" because of Bongino's FBI service.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dan Bongino stepping down as FBI deputy director",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a7e1/live/658e5420-db92-11f0-88ca-0b2596ca1cee.jpg"
      ],
      "datePublished": "2025-12-18T10:35:30.000Z",
      "dateModified": "2025-12-18T10:35:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thailand bombs near Poipet casino hub on Cambodian border",
    "url": "https://www.bbc.com/news/articles/czxgrl4937yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c186/live/ac25afa0-dc0a-11f0-b67b-690eb873de1b.jpg",
    "tag": "World",
    "date": "2025-12-18T13:08:10.000Z",
    "description": "Thailand says it has bombed a \"logistics centre\" near the Cambodian town of Poipet, known for being a major casino hub and the biggest land crossing b",
    "body": "Thailand says it has bombed a \"logistics centre\" near the Cambodian town of Poipet, known for being a major casino hub and the biggest land crossing between the two countries.The bombings come as renewed border clashes show no sign of abating. Cambodia's defence ministry said Thai forces dropped two bombs, while the Thai side said that they targeted a facility storing rocket systems.The renewed fighting this month has killed at least 21 people in Thailand and 17 in Cambodia, while displacing around 800,000, officials say.In a statement, the Cambodian defence ministry said Thai forces dropped two bombs in the area of Poipet municipality at around 11:00 am (0400 GMT) Thursday.Shortly after, Thai Air Force spokesman Air Marshal Jackkrit Thammavichai said that the Thai military had attacked the centre outside Poipet that had been used to store BM-21 rockets and that no civilians were harmed.BM-21 rockets are weapons that are typically fired in volleys from the back of an armoured vehicle.The bombings appear to be the first on Poipet, which is known for casinos popular with Thai gamblers and its international border checkpoint.On Tuesday, Thailand said Tuesday that between 5,000 and 6,000 Thai nationals remained stranded in Poipet after Cambodia closed its land border crossings between the two countries.Cambodia's interior ministry said the border closures were a \"necessary measure\" to reduce risks to civilians, adding that air travel remained an option for those seeking to leave.The century-old border dispute between the South East Asian neighbours dramatically escalated on 24 July with a Cambodian rocket barrage into Thailand, followed by Thai air strikes. That set off five days of intense fighting, which left dozens of soldiers and civilians dead. The two countries later agreed to an \"immediate and unconditional ceasefire\" brokered by Malaysian Prime Minister Anwar Ibrahim and US President Donald Trump - who at the time threatened to stop tariff negotiations until the hostilities stopped.But that ceasefire fell apart again last week, with both sides blaming each other for re-igniting the fighting, which has seen air strikes and exchanges of artillery fire.Trump claimed last week that he could stop the fighting between Thai and Cambodian forces that broke out by just picking up the phone, but it has continued.Earlier this week, Cambodia accused Thai forces of bombing Siem Reap province, home to the ancient Angkor temples - the country's top tourist draw - for the first time in the latest round of clashes.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thailand bombs near Poipet casino hub on Cambodian border",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c186/live/ac25afa0-dc0a-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-18T13:08:10.000Z",
      "dateModified": "2025-12-18T13:08:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pope Leo names Ronald Hicks next archbishop of New York",
    "url": "https://www.bbc.com/news/articles/c8983vzg79go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f06a/live/4d3faaa0-dc5e-11f0-b1b4-f15065f62c2f.jpg",
    "tag": "World",
    "date": "2025-12-18T23:43:52.000Z",
    "description": "Pope Leo has named Bishop Aldon Ronald Hicks who, like the pope, is from the Chicago area and served in Latin America, as the next archbishop of New Y",
    "body": "Pope Leo has named Bishop Aldon Ronald Hicks who, like the pope, is from the Chicago area and served in Latin America, as the next archbishop of New York.Bishop Hicks, 58, will lead one of the Roman Catholic Church's most populous and important postings in the US.He replaces retiring Cardinal Timothy Dolan, 75, who was seen as a conservative with close ties to President Donald Trump. Hicks said he accepted his appointment, which was announced on Thursday, with \"an open heart\" and Dolan called it \"an early Christmas gift\" for New Yorkers.Last month, Hicks joined other bishops to condemn the Trump administration's large scale immigration-related arrests as part of its mass deportation agenda.Hicks' early life and pastoral career closely mirror Pope Leo's. He grew up in South Holland, a short distance from Leo's Dolton neighbourhood in the suburb of Chicago. While Pope Leo spent two decades as a missionary in Peru, Hicks worked at an orphanage in El Salvador from 2005 to 2010, according to a biography released by the New York archdiocese. Hicks was appointed bishop of Joliet by Pope Francis in 2020.Like the pope, Hicks has been outspoken about his concerns for immigrants. \"Deeply rooted in our Gospel tradition of loving our neighbor, this letter affirms our solidarity with all our brothers and sisters as it expresses our concerns, opposition, and hopes with clarity and conviction,\" he said, in response to a joint-letter written by US bishops expressing concerns about the situation immigrants in the United States face.\"It is grounded in the Church's enduring commitment to the Catholic social teaching of human dignity and a call for meaningful immigration reform,\" he saidThe Trump administration has carried out large scale immigration arrests in the Chicago area, leading to clashes between federal agents and residents protesting their presence.The bishops' letter comes as churches grapple with how to respond to immigration activity that affects their members. The majority of people at risk of deportation are Christians, with 61% of the at-risk group being Catholics, according to a report by the US Catholic Bishops Conference.Hicks will now leave his position as bishop of Joliet for the ornate sanctuary at St Patrick's Cathedral in Manhattan, where he will lead 2.5 million Catholics in the nation's largest city. He will officially be installed at the cathedral on 6 February 2026.His appointment comes a week after Cardinal Dolan, who has served in New York City for about 16 years, announced the archdiocese will set up a $300 million fund to settle claims of clergy sex abuse.\"As a church, we can never rest in our efforts to prevent abuse, to protect children and to care for survivors,\" the incoming archbishop said at a news conference. \"While this work is challenging, it's difficult, it's painful, I hope it will continue to help in the areas of accountability, transparency and healing.\"Cardinal Dolan, of Missouri, announced his resignation in February, as required by church law when bishops turn 75. He was named head of the church in New York by Pope Benedict XVI in 2009, who later made him cardinal.He participated in two conclaves, one that elected Pope Francis in 2013 and the second that elected Leo XIV last May. The cardinal led prayers at both of Trump's inaugurations, and was appointed by the president to the new Religious Liberty Commission earlier this year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pope Leo names Ronald Hicks next archbishop of New York",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f06a/live/4d3faaa0-dc5e-11f0-b1b4-f15065f62c2f.jpg"
      ],
      "datePublished": "2025-12-18T23:43:52.000Z",
      "dateModified": "2025-12-18T23:43:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nigeria Foreign Minister Yusuf Tuggar apologises over Burkina Faso military flight",
    "url": "https://www.bbc.com/news/articles/c74xvp00wj3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a3c3/live/d15bebc0-dbf8-11f0-a030-476ae6d8c14a.jpg",
    "tag": "World",
    "date": "2025-12-18T11:42:23.000Z",
    "description": "Nigeria apologises over Burkina Faso military flight that saw 11 servicemen detained17 hours agoMakuochi OkaforBBC AfricaNigeria's Foreign Minister Yu",
    "body": "Nigeria apologises over Burkina Faso military flight that saw 11 servicemen detained17 hours agoMakuochi OkaforBBC AfricaNigeria's Foreign Minister Yusuf Tuggar has formally apologised to Burkina Faso for the unauthorised entry of a Nigerian military jet into Burkinabè airspace, an incident that led to the detention of 11 Nigerian servicemen.Tuggar's spokesperson told the BBC that the detained personnel had been released and were due to return to Nigeria, without saying when.The plane was flying to Portugal when it developed a technical problem and had to land in Burkina Faso, according to the Nigerian Air Force.The unauthorised landing sparked a diplomatic row with the Alliance of Sahel States (AES) made up of Burkina Faso and its neighbours, Mali, and Niger.In a statement, AES characterised it as an \"unfriendly act\" and said member states‘ respective air forces had been put on maximum alert and authorised to \"neutralise any aircraft\" found to violate the confederation's airspace.The three AES states, all run by the military, have withdrawn from the West African regional bloc, Ecowas, and moved closer to Russia, while most Ecowas members remain allied to the West.Tuggar led a delegation to the Burkinabè capital, Ouagadougou, on Wednesday, to discuss the incident with military leader Captain Ibrahim Traoré.\"There were irregularities concerning the overflight authorisations, which was regrettable, and we apologise for this unfortunate incident,\" Tuggar said on national TV.It remains unclear when the military personnel, said to be in \"high spirits\", and the aircraft will return to Nigeria.According to Nigeria's foreign ministry, both sides agreed to \"sustain regular consultations and pursue practical measures to deepen bilateral cooperation and regional integration\". ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nigeria Foreign Minister Yusuf Tuggar apologises over Burkina Faso military flight",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a3c3/live/d15bebc0-dbf8-11f0-a030-476ae6d8c14a.jpg"
      ],
      "datePublished": "2025-12-18T11:42:23.000Z",
      "dateModified": "2025-12-18T11:42:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Wiz Khalifa sentenced to nine months jail in Romania",
    "url": "https://www.bbc.com/news/articles/c93wxp2p05xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/54d3/live/810c8c30-dc46-11f0-a1ce-39295e57b193.jpg",
    "tag": "World",
    "date": "2025-12-18T20:00:55.000Z",
    "description": "Wiz Khalifa sentenced to nine months jail in Romania for smoking cannabis on stage8 hours agoMircea Barbu,BucharestandAndré Rhoden-PaulGetty ImagesA R",
    "body": "Wiz Khalifa sentenced to nine months jail in Romania for smoking cannabis on stage8 hours agoMircea Barbu,BucharestandAndré Rhoden-PaulGetty ImagesA Romanian court has sentenced Wiz Khalifa to nine months in prison for smoking cannabis on stage.The American rapper, real name Thomaz Cameron Jibril, admitted to smoking a joint during his performance at the Beach, Please! festival last year in Costinesti.A Romanian appeals court overturned an earlier fine of 3,600 Romanian lei (£619; $829) for drug possession and ruled the rapper must serve the sentence in custody. However he was sentenced in absentia. Earlier this week he was seen on stage performing with Gunna in California, and on Thursday he posted pictures and clips from his home on streaming platform Twitch and social media.The BBC has approached the ten-time Grammy-nominated artist for comment. Police briefly held and questioned Jibril after the concert on 13 July 2024, and prosecutors later charged him with possession of \"risk drugs\" for personal use.  Romanian investigators said he was in possession of more than 18 grams of cannabis and consumed an additional amount on stage. In a written decision, the Constanța Court of Appeal judges said they overturned the original fine because the artist had sent \"a message of normalisation of illegal conduct\" and thereby encouraged \"drug use among young people\".Calling it an \"ostentatious act\", the judges said the rapper was \"a music performer, on the stage of a music festival well known among young people\" who \"possessed and consumed, in front of a large audience predominantly made up of very young people, an artisanal cigarette\".Jabril said in a post on X a day after the incident that he did not mean to offend the country. \"They [the authorities] were very respectful and let me go. I'll be back soon. But without a big ass joint next time.\" Romanian criminologist Vlad Zaha told BBC News that there was little-to-no chance of the US extraditing Jibril, and described the sentence as \"unusually harsh\". \"Given the defendant's wealth and connections, Romania's lack of real negotiating power on extradition, and the legal and political status of cannabis in the US, it is highly unlikely that Wiz Khalifa will be sent to serve a prison sentence in Constanța, even though a formal judicial request will be submitted to the United States,\" Mr Zaha said. The  artist, known for songs like Black and Yellow, See You Again and Young, Wild & Free, is often pictured smoking on his social media and founded his own marijuana brand in 2016. Cannabis is legal recreational and medical use in some US states, but remains illegal under federal law.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Wiz Khalifa sentenced to nine months jail in Romania",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/54d3/live/810c8c30-dc46-11f0-a1ce-39295e57b193.jpg"
      ],
      "datePublished": "2025-12-18T20:00:55.000Z",
      "dateModified": "2025-12-18T20:00:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Peter Arnett, Pulitzer-winning war reporter, dies aged 91",
    "url": "https://www.bbc.com/news/articles/ce86j7n6d3do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/30e9/live/f66d1d70-dc17-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "World",
    "date": "2025-12-18T14:07:44.000Z",
    "description": "14 hours agoSofia Ferreira SantosAP Photo/FileArnett reported on the Vietnam and Gulf Wars during his career (pictured here in Saigon, Vietnam, in 196",
    "body": "14 hours agoSofia Ferreira SantosAP Photo/FileArnett reported on the Vietnam and Gulf Wars during his career (pictured here in Saigon, Vietnam, in 1963) Pulitzer Prize-winning journalist and war correspondent Peter Arnett has died at the age of 91, US media has reported.Arnett won the international reporting prize in 1996 for his Vietnam War coverage at the Associated Press (AP). But he was also well known for his work at CNN, having become a household name while reporting on the first Gulf War.His career spanned decades and covered several conflicts in countries including Iraq, Vietnam and El Salvador.The New Zealand-born journalist died on Wednesday surrounded by family and friends in California, his son told reporters. He was receiving hospice care for prostate cancer.AP Photo/Peter Arnett/FileArnett also took photographs while on assignment with troops - like this one from Vietnam in 1965Arnett first worked for AP as a wire-service correspondent in Vietnam, from 1962 until the war's end in 1975, often accompanying troops on missions.At a talk in 2013, he recalled the moment he witnessed a soldier being shot in Vietnam as he paused to read a map.\"As the colonel peered at it, I heard four loud shots as bullets tore through the map and into his chest, a few inches from my face,\" Arnett told the American Library Association.\"He sank to the ground at my feet.\"AP Photo/Peter Arnett/FileHis reporting and photographs, including this one of workers in Ho Chi Minh City in 1972, showed the reality on the groundThe journalist left AP in 1981 to join US outlet CNN, where he later became known for his work on the first Gulf War.He was one of the few Western reporters to stay in Baghdad, according to AP, with one of his first broadcasts from the city being interrupted by the sounds of missiles and air-raid sirens.\"There was an explosion right near me, you may have heard,\" he once exclaimed live on-air.While in Iraq, he interviewed then-president Saddam Hussein. Writing about the experience in the Roanoke Times, Arnett said he had decided to be \"as tough in my questioning as the situation would allow\".He continued: \"I was not intimidated by the prospect of encountering the man many had called 'The Butcher of Baghdad'. I figured he could do no worse to me than the constant bombing of Baghdad was threatening to do.\"AP Photo/Peter Arnett/FileArnett visited Pyongyang, North Korea, in 1979, taking this photograph of children performing for then-UN Secretary General Kurt WaldheimIn 1997, Arnett became the first Western journalist to interview Osama Bin Laden at a secret hideout in Afghanistan, a few years before the 11 September 2001 attacks on the US.According to several US media reports, when asked about his plans, Bin Laden told Arnett: \"You'll see them and hear about them in the media, God willing.\"Arnett later worked for NBC and was famously sacked by the broadcaster after giving an interview on Iraqi state television, in which he was seen as critical of US military strategy.He was hired by the Daily Mirror hours later and said he was \"in shock\" at his dismissal.\"I report the truth of what is happening here in Baghdad and will not apologise for it,\" he wrote in the UK paper.AP Photo/Peter Arnett/FileArnett provided an inside-look of what was happening in Vietnam throughout his careerBorn in 1934 in Riverton, New Zealand, Arnett later naturalised as an American citizen and had lived in southern California since 2014.Edith Lederer, a former colleague who still works at AP, told the agency: \"Peter Arnett was one of the greatest war correspondents of his generation - intrepid, fearless, and a beautiful writer and storyteller.\"His reporting in print and on camera will remain a legacy for aspiring journalists and historians for generations to come.\"Meanwhile, Nick Ut, a retired photographer who worked with Arnett in Vietnam, said he was \"like a brother\".\"His death will leave a big hole in my life,\" he told AP.Arnett is survived by his wife Nina Nguyen and their children, Andrew and Elsa.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Peter Arnett, Pulitzer-winning war reporter, dies aged 91",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/30e9/live/f66d1d70-dc17-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-18T14:07:44.000Z",
      "dateModified": "2025-12-18T14:07:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Democrats release latest batch of photos as Epstein deadline looms",
    "url": "https://www.bbc.com/news/articles/cy472pygwljo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a62c/live/d00dc7a0-dc4a-11f0-83b4-4b97b1cc3247.jpg",
    "tag": "World",
    "date": "2025-12-18T20:29:19.000Z",
    "description": "8 hours agoGrace Eliza GoodwinHouse Oversight CommitteeThe House Oversight Committee has released a batch of around 70 photos from the estate of late ",
    "body": "8 hours agoGrace Eliza GoodwinHouse Oversight CommitteeThe House Oversight Committee has released a batch of around 70 photos from the estate of late convicted sex offender Jeffrey Epstein. It's the third such release from a tranche of over 95,000 photos the committee has acquired from Epstein's estate. It includes images of quotes from the book Lolita written across a woman's body, and redacted images of women's foreign passports. It comes hours before the 19 December deadline for the Department of Justice to release all files related to its investigation into Epstein. \"These new images raise more questions about what exactly the Department of Justice has in its possession,\" said ranking member of the committee, Robert Garcia.What's in the images releasedSome of the photos released on Thursday show Epstein speaking with professor and activist Noam Chomsky aboard a private plane; Bill Gates standing beside a woman whose face is redacted; Steve Bannon sitting at a desk across from Epstein, and former Alphabet president Sergey Brin at a dinner event. The BBC has attempted to contact each for comment.These are the latest wealthy, powerful men to be seen in Epstein estate photos released by the House Oversight Committee - previously released photos also show US President Donald Trump and former president Bill Clinton, as well as film director Woody Allen, former US treasury secretary Larry Summers, attorney Alan Dershowitz, former prince Andrew Mountbatton-Windsor, and others. Appearing in the photos is not evidence of any wrongdoing, and many of the pictured men have said they were never involved in Epstein's illegal activity. House Oversight CommitteeIn a statement accompanying the photo release, Democrats on the US House Oversight Committee said the Epstein estate did not provide context or timings for the pictures. \"Photos were selected to provide the public with transparency into a representative sample of the photos received from the estate, and to provide insights into Epstein's network and his extremely disturbing activities,\" the statement says.The release also includes several photos of quotes from the Vladimir Nabokov novel Lolita written in black ink across different parts of a woman's body, like her chest, foot, hipbone, and back. Lolita tells the story of a young girl who was groomed by a middle-aged literature professor.One quote from the book written across a woman's chest reads, \"Lo-lee-ta: the tip of the tongue taking a trip of three steps down the palate to tap, at three, on the teeth\". House Oversight CommitteeThere are also a number of photos of female passports and identification documents from countries around the world, including Lithuania, Russia, the Czech Republic, and Ukraine.  Most of the information on the documents, like names and birth dates, is redacted but the House Oversight Committee said in a press release that the passports belong to \"women whom Jeffrey Epstein and his conspirators were engaging\".Another photo shows Epstein sitting at a desk closely surrounded by three female figures whose faces have been redacted - one has her hand on Epstein's chest under his shirt, and another is crouching to look at a nearby laptop. Epstein appears to be helping the third put on a bracelet. House Oversight CommitteeAnother image released is a screenshot of text messages from an unknown person who says they have been sent \"some girls\" and are asking for \"$1000 per girl\". House Oversight CommitteePhoto release comes ahead of DOJ deadlineThe committee has thousands of images in its possession from the Epstein estate, which are \"both graphic and mundane\", its statement on Thursday explained. The House Oversight Committee first subpoenaed the estate of Epstein, who died in a New York prison in 2019 while awaiting trial on allegations of sex trafficking, in August. The photos and files the Epstein estate gave to the committee are separate from what is largely referred to as \"the Epstein files\". Those are documents within the justice department's possession related to its own investigation into Epstein. Under the Epstein Files Transparency Act, which President Trump signed into law last month, the DOJ has until 19 December to release its files. The extent of what's contained in the DOJ's files is unknown, and it's likely that much of the content will be heavily redacted, similar to House Oversight Committee materials. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Democrats release latest batch of photos as Epstein deadline looms",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a62c/live/d00dc7a0-dc4a-11f0-83b4-4b97b1cc3247.jpg"
      ],
      "datePublished": "2025-12-18T20:29:19.000Z",
      "dateModified": "2025-12-18T20:29:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "TikTok owner signs join venture agreements to avoid US  ban",
    "url": "https://www.bbc.com/news/articles/cgexp1q8wn1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/72e6/live/4fa6afd0-dc6f-11f0-97eb-cbacd394b696.jpg",
    "tag": "World",
    "date": "2025-12-19T03:46:02.000Z",
    "description": "43 minutes agoPeter Hoskins,Business reporterandLily Jamali,North America technology correspondentWatch: TikTok owner signs agreements to avoid US ban",
    "body": "43 minutes agoPeter Hoskins,Business reporterandLily Jamali,North America technology correspondentWatch: TikTok owner signs agreements to avoid US banTikTok's Chinese owner ByteDance has signed binding agreements with US and global investors for the majority of its  business in America, TikTok's boss told employees on Thursday.Half of the joint venture will be owned by a group of investors, including Oracle, Silver Lake and the Emirati investment firm MGX, according to a memo sent by chief executive Shou Zi Chew.The deal, which is set to close on 22 January, would end years of efforts by Washington to force ByteDance to sell its US operations over national security concerns.It is in ​line with a deal unveiled in September, when US President Donald Trump delayed the enforcement of a law that would ban the app unless it was sold.In the memo, TikTok said the deal will enable \"over 170 million Americans to continue discovering a world of endless possibilities as part of a vital global community\".Under the agreement, ByteDance will retain 19.9% of the business, while Oracle, Silver Lake and Abu Dhabi-based MGX will hold 15% each.Another 30.1% will be held by affiliates of existing ByteDance investors, according to the memo.The White House previously said that Oracle, which was co-founded by Trump supporter Larry Ellison, will license TikTok's recommendation algorithm as part of the deal.The deal comes after a series of delays.In April 2024, during President Joe Biden's administration, the US Congress passed a law to ban the app over national security concerns, unless it was sold.The law was set to go into effect on 20 January 2025 but was pushed back multiple times by Trump, while his administration worked out a deal to transfer ownership.Trump said in September that he had spoken on the phone to China's President Xi Jinping, who he said had given the deal the go ahead.The platform's future remained unclear after the leaders met face to face in October.The app's fate was clouded by ongoing tensions between the two nations on trade and other matters.\"TikTok has become a bargaining chip in the wider US-China relationship,\" said Alvin Graylin, a lecturer at the Massachusetts Institute of Technology.\"With recent softening tensions, Beijing's sign off on the structure and algorithm licensing now looks less like capitulation and more like calibrated de-escalation, letting both capitals claim a win at home.\" NurPhoto via Getty ImagesThe White House referred the BBC to TikTok when contacted for comment.Oracle and Silver Lake declined to comment. The BBC has contacted MGX for comment.The deal drew critiques from Senate Democrat Ron Wyden of Oregon, who said it wouldn't do \"a thing to protect the privacy of American user\".Under the terms, TikTok's recommendation algorithm is set to be retrained on American user data to ensure feeds are free from outside manipulation.\"It's unclear that it will even put TikTok's algorithm in safer hands,\" said Sen Wyden.He opposed the 2024 law, and was among the US lawmakers who lobbied to extend the TikTok deadline in January in a bid to give Congress more time to mitigate threats from China.Some users also expressed caution at the prospect of new investors.Small business owner Tiffany Cianci, who has more than 300,000 followers and nearly four million likes on the platform, said she hopes the incoming investors will maintain the same user experience for entrepreneurs like her.\"I hope small business owners are protected,\" Ms Cianci said.TikTok has said that more than seven million small businesses market their products and services on TikTok in the US.\"I reserve judgement on whether or not we have saved the app for those small business,\" she added.Ms Cianci said she chose TikTok for promotion because the platform offers profit-sharing on terms that are more favourable than what competitors like Meta offer.Over the last year, Ms Cianci has been active in organising protests in Washington and on TikTok aimed at saving the app.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "TikTok owner signs join venture agreements to avoid US  ban",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/72e6/live/4fa6afd0-dc6f-11f0-97eb-cbacd394b696.jpg"
      ],
      "datePublished": "2025-12-19T03:46:02.000Z",
      "dateModified": "2025-12-19T03:46:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Greg Biffle: Ex-Nascar driver and family among seven killed in plane crash ",
    "url": "https://www.bbc.com/news/articles/c741r9ve3z7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3999/live/abd47730-dc5e-11f0-b1b4-f15065f62c2f.jpg",
    "tag": "World",
    "date": "2025-12-18T23:46:06.000Z",
    "description": "A former Nascar driver and his family were among the seven people killed in a plane crash at a regional airport in North Carolina, the car-racing orga",
    "body": "A former Nascar driver and his family were among the seven people killed in a plane crash at a regional airport in North Carolina, the car-racing organisation has said.A highway patrol spokesman said people on the ground confirmed that Greg Biffle was among those who boarded the plane.The Cessna C550 crashed while landing at Statesville Regional Airport around 10:20 local time (15:20GMT), officials investigating the incident told reporters.\"Greg was more than a champion driver, he was a beloved member of the NASCAR community, a fierce competitor, and a friend to so many,\" Nascar said in a statement where it confirmed Biffle had died along with his wife, daughter, son, and three others.\"His passion for racing, his integrity, and his commitment to fans and fellow competitors alike made a lasting impact on the sport,\" the company added.Beyond the racetrack, Biffle was remembered for helping in North Carolina in the aftermath of last year's Hurricane Helene, when he used his personal helicopter to rescue stranded residents and deliver supplies.Tributes to the former racer poured in on Thursday. \"Heartbreaking news out of Statesville,\" North Carolina Governor Josh Stein posted on X. \"Beyond his success as a NASCAR driver, Greg Biffle lived a life of courage and compassion and stepped up for western North Carolina after Hurricane Helene.\" Motorsport YouTuber Garrett Mitchell wrote on Facebook that Biffle and his family were on their way to spend the afternoon with him.\"Unfortunately, I can confirm Greg Biffle, his wife Cristina, daughter Emma, and son Ryder were on that plane… because they were on their way to spend the afternoon with us,\" he wrote on Facebook.  \"We are devastated. I'm so sorry to share this.\"Statesville Airport Director John Ferguson described the aircraft as a corporate jet and said it was already engulfed in flames when he arrived on the scene.The Cessna C550 aircraft is owned by a private company associated with Biffle, CBS, the BBC's US partner, reported.The jet took off around 10:06 local time and was in the air briefly before it crashed on the east end of the runway. Authorities are investigating the cause of the crash.Statesville Airport will remain closed until further notice as crews clear debris off the runway, Mr Ferguson told reporters.Officials did not provide any information about deaths or people aboard the aircraft during their first media conference.The National Transportation Safety Board, which is leading the investigation has sent in a team to investigate the fatal crash. The Statesville Regional Airport (KSVH) is owned by the City of Statesville, which is about 45 minutes north of Charlotte. It also provides aviation facilities for Fortune 500 companies and several Nascar racing teams. Biffle, whose racing career spanned two decades, was named one of Nascar's 75 Greatest Drivers in 2023. The 55-year-old won 19 Cup Series races in the Xfinity Series and Craftsman Truck Series. Known as The Biff, the Vancouver, Washington, native received national notice in 1995 during that year's Nascar Winter Heat Series, according to his Nascar profile.He made a name for himself in the Craftsman Truck Series, winning the 1998 Rookie of Year award and the 2000 series championship.He went on to be named 2001 Rookie of the Year in the Xfinity Series and to win the 2002 championship, becoming the first driver with championships in both the Xfinity Series and the Truck Series.He also co-founded the organisation's Sand Outlaws Series. Although he scaled back on racing after 2016, he seemingly came out of retirement in 2019 for a one-off race at Texas Motor Speedway, which he won.\"Racing is racing,\" he told Nascar.com in 2021. \"It's that adrenaline, you want to be better than the competition, you want to build a better piece and have a faster car. I just enjoy the competition.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Greg Biffle: Ex-Nascar driver and family among seven killed in plane crash ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3999/live/abd47730-dc5e-11f0-b1b4-f15065f62c2f.jpg"
      ],
      "datePublished": "2025-12-18T23:46:06.000Z",
      "dateModified": "2025-12-18T23:46:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Anthony Albanese announces hate speech crackdown after Bondi shooting",
    "url": "https://www.bbc.com/news/articles/cgmneem1e89o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/13eb/live/a536d960-dbee-11f0-b67b-690eb873de1b.jpg",
    "tag": "World",
    "date": "2025-12-18T23:54:36.000Z",
    "description": "Australian Prime Minister Anthony Albanese says his government will crack down on hate speech following Sunday's deadly shooting at Bondi Beach that t",
    "body": "Australian Prime Minister Anthony Albanese says his government will crack down on hate speech following Sunday's deadly shooting at Bondi Beach that targeted a Jewish festival.Fifteen people were killed when two gunmen opened fire at an event to mark the first day of Hanukkah.New laws will target \"those who spread hate, division and radicalisation\", Albanese told reporters in Canberra. The home affairs minister will also be given new powers to cancel or refuse visas for those who spread hate and a new taskforce will be set up to ensure the education system \"prevents, tackles and properly responds to antisemitism\".The new laws will also include penalties for preachers and leaders who promote violence, a new federal offence of \"aggravated hate speech\", and the introduction of \"hate\" as an aggravating factor in sentencing crimes for online threats and harassment.\"Every Jewish Australian has the right to feel safe, valued and respected for the contribution that they make to our great nation,\" Albanese said.\"The terrorists, inspired by ISIS... sought to turn Australians against each other. Australians have responded to that act of hatred with love and sympathy for those in mourning.\"Daniel Aghion, the President of the Executive Council of Australian Jewry, the peak body representing Australian Jews, said he would \"need to see the details before making an assessment as to whether the measures are likely to live up to their billing.\"\"We warned of the risk of not dealing with antisemitism in this country promptly and effectively after 7 October. It is an absolute tragedy that it has taken a massacre of Jewish and other Australians for that step to be taken.\"David Ossip, president of NSW Jewish Board of Deputies, welcomed the changes. \"For too long, Australian Jews have been targeted through social media, hate preachers and university campus activities. It was conveniently ignored until it was too late. The gaslighting and dismissal must end,\" he was quoted by the Sydney Morning Herald as saying.Tensions have been high in the country since the shooting, with police detaining seven men in southwest Sydney on Thursday after receiving a tip that a \"violent act was possibly being planned\", New South Wales Police said in a statement.Police said they did not identify \"any connection\" to their investigation into Sunday's attack in Bondi. Two cars were \"intercepted\" at George Street, police said. In videos shared by local media sites, armed officers appeared to detain people on the street just hours after Albanese made his speech.Antisemitism envoy Jillian Segal, who also spoke at the press conference, said the country was \"at a very important moment not only for our community, but for fighting antisemitism around the world.\" Albanese said his government would be \"fully supporting and adopting\" the  recommendations Segal put forward in July in a report.Her report was criticised by some upon its release in July due to its implications for free speech, including plans to monitor universities and arts organisations and withhold funding if they were deemed to have failed to act against antisemitism. There were concerns for instance, that the funding could be used to silence pro-Palestinian protests.The Jewish Council of Australia said it supported Albanese's commitment to act, including his focus on gun reform and online hate.But, it said it was \"concerned that elements of today's announcement resemble long-standing proposals from the pro-Israel lobby which have nothing to do with addressing violent extremism.\"\"If education initiatives like university scorecards become a form of ideological policing - particularly where they are used to limit legitimate criticism of Israel - they will only make Jews less safe, and do the opposite of combating antisemitism,\" Jewish Council of Australia executive officer Dr Max Kaiser said.Meanwhile, Albanese acknowledged accusations from the Jewish community that his government had not done enough to prevent antisemitism since the 7 October attack on Israel by Hamas, and said more could have been done. \"I accept my responsibility for the part in that as prime minister of Australia,\" he said. \"But what I also do is accept my responsibility to lead the nation and unite the nation. Because what people are looking for at this time isn't more division.\"Home Affairs Minister Tony Burke said the government was \"shifting the threshold\" on hate speech.\"There have been individuals who have managed to exploit a nation that had different principles of freedom of speech and have gone right to the limits of language that is clearly dehumanising, unacceptable, having no place in Australia, but have not quite crossed the threshold to violence,\" he said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Anthony Albanese announces hate speech crackdown after Bondi shooting",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/13eb/live/a536d960-dbee-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-18T23:54:36.000Z",
      "dateModified": "2025-12-18T23:54:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brown University shooting suspect found dead",
    "url": "https://www.bbc.com/news/articles/cx2e14z2j9jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fba6/live/386b7030-dc8d-11f0-b67b-690eb873de1b.jpg",
    "tag": "World",
    "date": "2025-12-19T04:23:33.000Z",
    "description": "Just nowNadine Yousif,Max MatzaandTabby WilsonFBIThe suspect ‍in ​last week's ‌mass shooting at Brown University has been found dead in a storage faci",
    "body": "Just nowNadine Yousif,Max MatzaandTabby WilsonFBIThe suspect ‍in ​last week's ‌mass shooting at Brown University has been found dead in a storage facility in Salem, New Hampshire, following a six-day multi-state manhunt, police say. They identified the suspect as Claudio Neves Valente, 48, a Portuguese national who studied at the university in Providence, Rhode Island, about 25 years ago. Providence police chief Oscar Perez said video evidence and tips from the public led investigators to a car-rental location where they found the suspect's name and matched him to their person of interest.Officials said they also believe Valente killed a Massachusetts Institute of Technology professor two days after the 13 December shooting at Brown.Rhode Island Attorney General Peter  said Valente was found dead with a satchel, two firearms.  Evidence in a car nearby matched to the scene of the shooting at Brown University in Providence.Initial findings suggest Valente died of a self-inflicted gunshot wound, and police were unable to comment on how long he might have been inside the storage unit.\"Even though the suspect was found dead tonight our work is not done. There are many questions that need to be answered,\"  FBI Special Agent-in-Charge Ted Docks said, adding that the agency had deployed approximately 500 agents to assist local authorities in the investigation.ReutersImages of Claudio Neves Valente were displayed during the Thursday press conferenceBrown University President Christina Paxson said that Valente was enrolled at the Ivy League school from the autumn of 2000 to spring 2001, and was studying for a PhD in physics. He had \"no current active affiliation\" to Brown, she said. Officials said they believe Valente shot and killed MIT professor Nuno F Gomes Loureiro, 47,  on Monday at his home in Brookline, which is about 50 miles (80km) from Providence.Both the victim and the suspect had studied at the same university in Portugal in the late 1990s, police said.Officials said the cases were linked when the suspect's vehicle was identified via CCTV footage and a witness at Brown University.The same car was spotted nearby to the scene of the professor's shooting in Brookline, Massachusetts.\"He was using a phone that was obfuscated the ability to track it,\" said Leah B Foley, the US state attorney representing Massachusetts.\"\"He was sophisticated in hiding his tracks.\"Authorities have not provided any suspected motive for either attack.For days, members of the public had expressed frustration at the investigation into the shooting at Brown University last Saturday, after it appeared to yield little progress almost a week after the attack. A gunman burst into Brown University's Barus & Holley engineering building and opened fire during final exams. Two students were killed and a further nine injured. Six remain in hospital. Authorities identified the two dead victims as Ella Cook, 19, a sophomore from Alabama, and Mukhammad Aziz Umurzokov, 18, an Uzbek-American freshman student. Police  had asked for patience from Rhode Islanders and on Wednesday released new footage of a person of interest, where a man was seen walking around the university campus with a black mask over his mouth. The FBI also offered a $50,000 (£37,350) reward for information leading to the identification, arrest and conviction of the person responsible for the attack.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brown University shooting suspect found dead",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fba6/live/386b7030-dc8d-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-19T04:23:33.000Z",
      "dateModified": "2025-12-19T04:23:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]