[
  {
    "title": "Gaddafi's youngest son released after 10 years in Lebanese detention",
    "url": "https://www.bbc.com/news/articles/czxnq6d71y9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/35f3/live/578fe450-be7e-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "World",
    "date": "2025-11-10T22:25:19.000Z",
    "description": "18 hours agoDoug FaulknerReutersHannibal Gaddafi, now 49, pictured in 2010Hannibal Gaddafi, the youngest son of the deposed Libyan dictator Muammar Ga",
    "body": "18 hours agoDoug FaulknerReutersHannibal Gaddafi, now 49, pictured in 2010Hannibal Gaddafi, the youngest son of the deposed Libyan dictator Muammar Gaddafi, has been released by Lebanon after nearly 10 years in detention without trial.The Lebanese authorities seized Mr Gaddafi, now 49, in 2015, accusing him of concealing information about the fate of a Lebanese Shia cleric who disappeared in Libya in 1978, when he was just two. Human rights groups had denounced the accusations.His lawyer told the AFP news agency his $900,000 (£682,938) bail had been paid.Laurent Bayon said: \"It's the end of a nightmare for him that lasted 10 years.\"In October, a judge set a $11m bail against Gaddafi's release but this was reduced last week after an appeal by his defence team, according to AFP.Mr Bayon said his client would leave Lebanon for a \"confidential\" destination.\"If Gaddafi was able to be arbitrarily detained in Lebanon for 10 years, it's because the justice system was not independent,\" Bayon said, according to AFP.In 2015, Mr Gaddafi was briefly abducted by an armed group in Lebanon before being freed. He was later detained by Lebanese authorities.After his father was overthrown by rebels and killed in 2011, he fled to Syria and then had lived under house arrest in Oman with his wife Aline Skaf.Before the fall of his father's regime Mr Gaddafi was known for his lavish lifestyle. The disappearance of Shia cleric Musa al-Sadr in Libya in 1978 has been a source of tension between Libya and Lebanon for decades.Hannibal Gaddafi was only two at the time and held no senior position in Libya as an adult.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gaddafi's youngest son released after 10 years in Lebanese detention",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/35f3/live/578fe450-be7e-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-10T22:25:19.000Z",
      "dateModified": "2025-11-10T22:25:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Government sets out plan to phase out animal experiments ",
    "url": "https://www.bbc.com/news/articles/cm2lpekjeg9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d273/live/6c5d1150-be38-11f0-9e99-d1007b558636.jpg",
    "tag": "World",
    "date": "2025-11-11T08:34:24.000Z",
    "description": "8 hours agoPallab GhoshScience CorrespondentGettyDrug tests on rabbits could end by the end of the yearThe government has detailed for the first time ",
    "body": "8 hours agoPallab GhoshScience CorrespondentGettyDrug tests on rabbits could end by the end of the yearThe government has detailed for the first time how it aims to fulfil its manifesto pledge to work toward phasing out animal testing.The new plans include replacing animal testing for some major safety tests by the end of this year and cutting the use of dogs and non-human primates in tests for human medicines by at least 35% by 2030. The Labour Party said in its manifesto that it would \"partner with scientists, industry, and civil society as we work towards the phasing out of animal testing\".Science Minister Lord Vallance told BBC News that he could imagine a day where the use of animals in science was almost completely phased out but acknowledged that it would take time.Animal experiments in the UK peaked at 4.14 million in 2015 driven mainly by a big increase then in genetic modification experiments – mostly on mice and fishBy 2020, the number had fallen sharply to 2.88 million as alternative methods were developed. But since then that decline has plateaued. Lord Vallance told BBC News that he wants to re-ignite the fast downward trend by replacing animal testing with experiments on animal tissues grown from stem cells, AI, and computer simulations.Asked by BBC News if he could envisage a world where animal tests were \"near zero\", he said: \"I think that is possible, it's not possible anytime soon, the idea that we can eliminate animal use in the foreseeable future, I don't think is there.\"Can we get very close to it? I think we can. Can we push faster than we have been? I think we can. Should we? We absolutely should.\"\"This is a moment to really grasp that and drive these alternative approaches,\" he said.According to the government's newly detailed plans, by the end of 2025, scientists will stop using animals for some major safety tests and switch to newer lab methods that use human cells instead.As a former government chief scientific advisor and former head of research for a major pharmaceutical company, he will know that many scientists believe reaching \"near zero\" tests on animals will be extremely difficult, even in the longer term. That includes those who are the greatest advocates of non-animal methods.\"I very strongly believe that that is not possible for reasons of safety,\" said Prof Frances Balkwill, of Barts Cancer Institute, Queen Mary University of London.Prof Balkwill is working on finding ways stop ovarian cancer recurring, using mice as well as non-animal approaches, of which she is a huge fan.\"These non-animal methods will never replace the complexity that we can see when we have a tumour growing in a whole organism, such as a mouse,\" she said.Kevin Church/BBC NewsThis organ on a chip can hold small amounts of human cells from different organs and be used in place of animals for some types of experimentsOne of the world's leading centres for developing alternatives to animal testing is the Centre for Predictive in vitro Models (CPM) at Queen Mary University of London.Researchers here are developing the extraordinarily sounding \"organ-on-a-chip\" technology, conjuring up alarming images of throbbing brains and beating hearts sitting on top of electronic circuits.The reality, though, is far less sci-fi.Some small pieces of glassware containing tiny samples of human cells from different organs from the body, such as the liver or brain, are connected to electrodes which send information to a computer. What is amazing, said the CPM's co-director, Prof Hazel Screen, is that cells from various parts of the body can be connected together to mimic how different organs work together.\"In theory, you can build any organ on a chip. Then I can use it to test a new drug,\" she said.\"And because we're taking human cells, we should be able to do better quality science.\"The safety tests that the government says will no longer use animals by the end of this year include the practice of giving rabbits a small dose of a new drug – called the pyrogen test. It says this will be replaced by a test using human immune cells in a dish.All tests that used animals to check for dangerous germs in medicine will also be done with cell and gene technologies, the government says.Between 2026 and 2035, the government plans to speed up the use of non-animal techniques, including the organ-on-a-chip devices and artificial intelligence.The proposals group animal tests into two main groups: those which could be immediately replaced because safe and effective alternatives already exist and simply need laws or guidelines to be updated; and others, where alternatives exist, but still need work to prove that they are reliable enough to be widely used.To speed up the latter, the government plans to set up a Centre for the Validation of Alternative Methods. Ministers also promise to give an unspecified increase in funding and investment for developing new alternatives, including £30m for a research hub and more grants to support innovative methods and training.The RSPCA has cautiously welcomed the plan, describing it as a \"significant step forward\",  but has urged the government to deliver.Some scientists working with animal experiments, such as Prof Robin Lovell-Badge, are deeply concerned about what they fear may be a premature push toward alternatives, and its potential negative consequences for science and medicine.\"How about the brain and behaviour? How can you study behaviour in a petri dish? You just can't,\" he says.\"With complex areas of biology where no current non-animal model gets anything close to the real biology, how is forcibly pushing this strategy going to help?\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Government sets out plan to phase out animal experiments ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d273/live/6c5d1150-be38-11f0-9e99-d1007b558636.jpg"
      ],
      "datePublished": "2025-11-11T08:34:24.000Z",
      "dateModified": "2025-11-11T08:34:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "O Yeong-Su: Squid Game star acquitted of sexual misconduct charge",
    "url": "https://www.bbc.com/news/articles/c0qpy1y09qwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ea0e/live/964b3cb0-bed5-11f0-be2d-cdcc797438e5.jpg",
    "tag": "World",
    "date": "2025-11-11T09:17:18.000Z",
    "description": "7 hours agoYvette Tan,Singapore and Hosu Lee,SeoulSquid Game star O Yeong-Su has been acquitted of sexual misconduct charges by a court in South Korea",
    "body": "7 hours agoYvette Tan,Singapore and Hosu Lee,SeoulSquid Game star O Yeong-Su has been acquitted of sexual misconduct charges by a court in South Korea. The 81-year-old was charged in 2022 with sexually assaulting a woman twice.  The allegations said that he hugged the woman and kissed her on the cheek against her will.Mr O was found guilty in 2024 and given an eight-month suspended prison sentence, but said he would appeal against the verdict. On Tuesday, a court overturned his sentence, saying he had undergone classes on sexual violence and suggesting that the alleged victim's memory may have been \"distorted\", considering how long ago the incident occurred. The alleged assaults took place in 2017 when Mr O was staying in a rural area for a theatre performance. The alleged victim filed a complaint against Mr O in 2021, but the case was closed in April the same year. The prosecution later reopened the investigation \"at the request of the victim\", according to Yonhap agency. In a statement reported by local media outlets, the Suwon District Court said there was \"doubt\" as to whether Mr O had committed the assault. \"There is a possibility that the victim's memory has been distorted over time, and when there is doubt... the defendant must be given the benefit of the doubt\".However, the statement also went on to say that it was possible Mr O had committed assault, as he had apologised to the victim.The alleged victim later spoke out against the verdict, saying it would not \"invalidate the truth or erase the pain I have suffered\".\"Despite today's ruling, I will continue to speak the truth to the very end,\" she said in a statement released through women's rights organisation Womenlink. Womenlink also criticised the ruling, saying they were \"outraged by a ruling that once again conceals sexual violence in the theatre world\". It is not yet clear if the prosecution will appeal.Speaking to local media outlets after the court ruling, Mr O said he had \"gratitude to the court for its wise judgement\".Mr O rose to international fame after starring in Squid Game, a dystopian drama which sees people competing in deadly versions of traditional children's games.In 2022, he became the first South Korean actor to win a Golden Globe award for best supporting actor in a series, after his performance in the first season of the chart-topping Netflix thriller.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "O Yeong-Su: Squid Game star acquitted of sexual misconduct charge",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ea0e/live/964b3cb0-bed5-11f0-be2d-cdcc797438e5.jpg"
      ],
      "datePublished": "2025-11-11T09:17:18.000Z",
      "dateModified": "2025-11-11T09:17:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New 'Lucifer' bee with devil-like horns found in Australia",
    "url": "https://www.bbc.com/news/articles/c051yjv90dmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4ee0/live/f2655e60-beab-11f0-9d0e-d55ceea13692.jpg",
    "tag": "World",
    "date": "2025-11-11T02:29:59.000Z",
    "description": "Australian scientists have discovered a new native bee species with tiny horns - and given it a suitably devilish name. Researchers found the Megachil",
    "body": "Australian scientists have discovered a new native bee species with tiny horns - and given it a suitably devilish name. Researchers found the Megachile Lucifer while observing a rare wildflower that only grows in the Bremer Ranges in Western Australia's Goldfields region, 470km (292 miles) east of Perth.The \"highly distinctive, prominent horns\" are only on the female bee and may be used as a defence mechanism, to gather pollen or nectar, or to collect materials such as resin for nests.The study's lead scientist said she was inspired to use the name Lucifer as she was watching the Netflix show of the same name at the time. She adds it is the first new member of this bee group in 20 years. \"The female had these incredible little horns on her face,\" said Dr Kit Prendergast from Curtin University .\"When writing up the new species description I was watching the Netflix show Lucifer at the time, and the name just fit perfectly. I am also a huge fan of the Netflix character Lucifer so it was a no-brainer.\"Lucifer - which means \"light bringer\" in Latin - is also a reference to shining light on the need for better conservation of native bee species and greater understanding of how endangered plants are pollinated, she said. The report, which was published in the Journal of Hymenoptera Research, also called for the area in and around where the new bee species and rare wildflowers were found to be \"formally protected and gazetted as conservation land that cannot be cleared\".\"Because the new species was found in the same small area as the endangered wildflower, both could be at risk from habitat disturbance and other threatening processes like climate change,\" she said, adding that many mining companies do not include native bees when assessing the environmental impact of their operations.\"So we may be missing undescribed species, including those that play crucial roles in supporting threatened plants and ecosystems.\"Without knowing which native bees exist and what plants they depend on, we risk losing both before we even realise they're there.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New 'Lucifer' bee with devil-like horns found in Australia",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4ee0/live/f2655e60-beab-11f0-9d0e-d55ceea13692.jpg"
      ],
      "datePublished": "2025-11-11T02:29:59.000Z",
      "dateModified": "2025-11-11T02:29:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Suicide bombing in Islamabad kills 12, says Pakistan's interior minister",
    "url": "https://www.bbc.com/news/articles/cp3x6102p3ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7e22/live/ba59cfa0-beed-11f0-8456-eff94716b162.jpg",
    "tag": "World",
    "date": "2025-11-11T15:39:34.000Z",
    "description": "36 minutes agoCaroline Davies,Pakistan correspondent, Islamabad and Dearbail JordanPakistan: Suicide attack outside Islamabad court kills 12A suicide ",
    "body": "36 minutes agoCaroline Davies,Pakistan correspondent, Islamabad and Dearbail JordanPakistan: Suicide attack outside Islamabad court kills 12A suicide attack outside a court in Pakistan's capital Islamabad has killed 12 people and injured at least 27 more, the country's interior minister said.Mohsin Naqvi said a bomber was planning to attack the district courthouse but was unable to get inside.Naqvi said authorities would prioritise identifying the bomber, and that those involved would be brought to justice.Jumaat Ul Ahrar, a splinter group of the Pakistani Taliban (TTP), has claimed responsibility. But two local journalists have told the BBC that the TTP's central leadership has sent messages to them saying it has no link to the explosion.Suicide blasts in Islamabad have been rare in recent years. Footage from the scene on Tuesday showed the remains of a burnt-out car and a police cordon in place.The 27 people injured are receiving medical treatment, Naqvi said.He added that the attacker detonated the bomb close to a police car after waiting for up to 15 minutes. Footage of the aftermath showed plumes of smoke rising from a charred vehicle behind a security barrier. The incident occurred at 12:39 local time (07:39 GMT).Pakistani President Asif Ali Zardari said he \"strongly condemned the suicide blast\". A lawyer who said he was parking his car outside the court at the time described hearing a \"loud bang\".Rustam Malik told AFP news agency \"it was complete chaos\".\"Lawyers and people were running inside the complex,\" he added. \"I saw two dead bodies lying on the gate and several cars were on fire.\"Police cordoned off an area close to a district court in Islamabad after the blastPrior to the Jumaat Ul Ahrar statement claiming responsibility, Pakistani Prime Minister Shehbaz Sharif alleged that extremist groups \"actively backed by India\" were involved.In a statement, he said that \"terrorist attacks on unarmed citizens of Pakistan by India's terrorist proxies are condemnable\".Delhi has not responded to the accusations. It has previously denied such claims.In a separate incident on Monday, a car exploded in India's capital Delhi, killing eight people and injuring a number of others. The Indian government has not called the incident a terror attack, although the case has been referred to the country's anti-terror body.Indian Prime Minister Narendra Modi said following the attack: \"The conspirators behind this heinous act will not be spared. All those responsible will be brought to justice, no matter how deep the conspiracy runs.\"There is, however, no official word yet on what led to the blast.The last time Pakistan's capital was targeted by a suicide bombing was three years ago when a police officer was killed and several others injured.There have been suicide attacks in other parts of the country in the years since but not in Islamabad. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Suicide bombing in Islamabad kills 12, says Pakistan's interior minister",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7e22/live/ba59cfa0-beed-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-11T15:39:34.000Z",
      "dateModified": "2025-11-11T15:39:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Biologist bitten in head by shark hopes to meet animal again",
    "url": "https://www.bbc.com/news/articles/cj0ep00g3ydo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e817/live/298cd6d0-befb-11f0-a970-eb79eb0c7376.jpg",
    "tag": "World",
    "date": "2025-11-11T15:56:32.000Z",
    "description": "'This animal spared my life': Biologist bitten in head by shark hopes to meet it again20 minutes agoRafael AbuchaibeBBC News MundoMauricio HoyosMauric",
    "body": "'This animal spared my life': Biologist bitten in head by shark hopes to meet it again20 minutes agoRafael AbuchaibeBBC News MundoMauricio HoyosMauricio Hoyos has spent 30 years studying the behaviour of different shark speciesMauricio Hoyos still remembers the pressure that the jaws of a female Galapagos shark, over 3m (10ft) in length, exerted on his skull.The animal had lunged at him with astonishing speed, giving him barely enough time to duck his head in a last ditch effort to protect his jugular vein.\"When it closed its jaw, I felt the pressure of the bite, and then, after what I think was a second, it opened it again and it let me go,\" Hoyos told BBC Mundo from his home in Baja California, Mexico, a little over month after surviving the incident.Hoyos, a marine biologist with over 30 years of experience studying sharks in their natural habitat, was on a research trip in Costa Rica when he was attacked by the shark in September.Less than two months on, and still bearing the scars from the attack on his face, he describes his recovery as \"incredible\" - and says he even hopes to encounter his assailant again.Hoyos calls the shark bite \"a battle scar that looks like gills\"For Hoyos, what happened to him that day in the waters off Cocos Island is the result of normal animal behaviour when confronted with a perceived threat. \"In this case, this bite was like a dog's,\" he says.\"Have you ever seen how dogs, when another dog gets too close, throw a quick bite? It doesn't hurt it, but it calms the other dog down.\"Hoyos - who along with his colleagues attaches acoustic tags to sharks to help pinpoint their mating and spawning grounds as part of his work - was alerted to the shark's presence in the water by tourists.It was at a depth of 40m, and Hoyos told the captain of the boat he was on that he would be there \"for a maximum of five minutes\".He then entered the water and began his slow descent.Getty ImagesGalapagos sharks can grow 3m in lengthHoyos recalls encountering the shark: \"This giant female, measuring between 3 and 3.5m (11.5ft), swam by and headed toward the bottom, and I positioned myself to tag her at the base of her dorsal fin.\"But Hoyos, who has tagged many kinds of sharks in his decades-long career, says this animal reacted differently to others.\"Obviously the tip - the metal tip attached to the cable hanging from the probe - goes in, and unlike the other sharks I've tagged that immediately flee, she turns around and stares at me,\" he recalls.\"I saw her little eye looking at me, and I saw her very calmly turning around.\"Hoyos and his colleagues tag sharks with probes like this oneHoyos says he held the shark's gaze as it swam away - but then, suddenly, out of nowhere, it lunged at him.\"I lowered my head, and what I felt was its lower jaw digging into my cheek and its upper jaw into my head. I was there, I imagine for a second, no more, inside its jaw, and then it simply opened it again.\"\"When it closed it, I felt the pressure of the bite, and then it just let me go,\" he marvels.The Galapagos shark's 29 serrated teeth not only left Hoyos with deep wounds to his face and head, but also severed the air line of his diving apparatus.He had survived the shark attack but was still in mortal danger.In addition, one of the teeth had torn his diving mask, and the blood-tinged water was further blurring his already limited visibility.\"When I realised that no air was coming out of the hose, I grabbed a second one we have, which we call an octopus, that is used to give air to someone else if they need it,\" he tells BBC Mundo. \"But then I realised that the regulator wasn't working and was blowing air instead of regulating it, so I had to remember my training and start regulating it with my lips.\"Bleeding, blinded, and with the air escaping, Hoyos calculated that he had less than a minute to reach the surface.\"Since I couldn't see anything, what I did was look for the light that I knew was the surface. I started swimming upwards, in a very coordinated manner, because I wanted to avoid erratic movements that would attract the shark.\"Mauricio HoyosHoyos had to use all the lessons he had learned during years of diving to survive the attackAfter Hoyos reached the surface, a young man pulled him aboard the boat, and when the captain saw his condition, he called the park ranger station to report the incident.Hoyos explained that he didn't feel the pain of his injuries until much later.\"Obviously, I had adrenaline in my system, but the bite didn't hurt that much. What hurt the most was the impact: when the shark bit me - an animal 3m long and at that speed - it was like being hit by a car. In fact, I ended up with a huge bruise all over my jaw; I thought it was broken.\"When they docked, a team of paramedics was ready to provide him with emergency care.Hoyos was lucky: as well as surviving the attack and the subsequent ascent, none of his wounds became infected, and the healing process took less time than anyone could have imagined.\"The doctors told me it was amazing: the attack happened on 27 [September], I had a 34-hour trip, they performed a surgical debridement [removing damaged tissue], and two days later they were already evaluating whether they could perform reconstructive surgery.\"It could have been far worse for Hoyos. According to the doctors, a young man who survived a Galapagos shark attack in the same area in 2017 had to remain in a hyperbaric chamber for almost a month because his wounds weren't healing properly.\"They told me my recovery had been incredible. After the surgery, the doctors confessed how worried they had been about an infection, because being on my face, it was a direct path to the brain.\"Mauricio HoyosSmiling broadly, Hoyos adds that he is already planning to get back into the water and has a diving trip booked for 14 November.And he says that after having survived an attack of this magnitude he has even more respect for the animals he studies.\"Many people think the oceans would be better off without sharks, but they really say that because they don't understand the crucial role sharks play in maintaining their delicate balance.\"Pointing to the large scar on his cheek, he says: \"This is the proof that this female spared my life; I can't put it any other way. And this will allow me to continue speaking well of sharks and advocating for their conservation in the future.\"Meanwhile, the Galapagos shark that had Hoyos in its jaws continues its natural life in the depths, and he hopes to see it again. And since he was able to mark it before it attacked him, that possibility exists.\"In January I'm going to Cocos Island, we have a trip from the 20 to 27. And obviously I'm going to Roca Sucia [where the attack happened], I'm going to dive down there,\" he says, undeterred.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Biologist bitten in head by shark hopes to meet animal again",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e817/live/298cd6d0-befb-11f0-a970-eb79eb0c7376.jpg"
      ],
      "datePublished": "2025-11-11T15:56:32.000Z",
      "dateModified": "2025-11-11T15:56:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kate and Queen lay Armistice Day wreaths as nation pays tribute",
    "url": "https://www.bbc.com/news/articles/cj41g5w0vgno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/842f/live/9cf37ac0-bef6-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "World",
    "date": "2025-11-11T12:18:04.000Z",
    "description": "The Princess of Wales and the Queen have joined services to mark Armistice Day in the UK as events took place around the world.Catherine stood at the ",
    "body": "The Princess of Wales and the Queen have joined services to mark Armistice Day in the UK as events took place around the world.Catherine stood at the ceremony at the National Memorial Arboretum in Staffordshire, where the Last Post signalled the start of a national two-minute silence at 11:00 GMT to mark the end of World War One.Queen Camilla was at Paddington Station in London for the wreath-laying ceremony, having travelled by train.The Prince of Wales has also delivered a video message to young people, sharing his views on the importance of wearing a red poppy and to say that \"remembrance is for everyone\".It was the first time Catherine had attended the service at the National Memorial Arboretum.She laid a wreath in the centre of the armed forces memorial, watched by a crowd which included veterans and their families.Catherine appeared to take a moment of reflection before returning to her seat where she bowed her head as the crowd prayed for those who had been affected by conflict.The Prince of Wales' message was a virtual event for children between nine and 14 in the UK.In it he says: \"When we remember, we connect with service in a personal way.\"We learn from the courage of others, and we carry their stories forward, so they are not forgotten.\"It's not just about the past - it's about shaping who we become in the future.\"Remembrance teaches us empathy, resilience and responsibility.\"And when we wear a red poppy or take a moment of silence, we are saying, 'Thank you. We have not forgotten, and we will not forget'.\"Meanwhile, the service in Staffordshire featured the reading of a specially- commissioned poem by the arboretum's poet in residence, Arji Manuelpillai.\"A Sonnet For Us All captures the stories etched into the hundreds of memorials within the National Memorial Arboretum, it invites people to listen, reflect and consider the emotion that was the inspiration for these sculptures,\" Mr Manuelpillai said.\"These human connections, and the gentle responsibility to carry love forward, are themes that resonate not only with me, but also with HRH The Princess of Wales, for whom the importance of service and compassion lies especially close to the heart.\"Queen Camilla joined commuters on the 09:28 train from Chippenham in Wiltshire to Paddington where a service was held for service personnel and their families.Later on Tuesday, William will join the King and Queen at Windsor Castle where a reception will honour veterans who served in the Pacific during the Second World War.The event, which the Duke of Edinburgh and the Duchess of Gloucester will also attend, continues the commemorations for the 80th anniversary of VJ Day - or Victory over Japan Day.Elsewhere around the world French President Emmanuel Macron attended a wreath-laying ceremony in the Champs-Elysees in Paris to mark the signing of the armistice at the 11th hour of the 11th day of the 11th month.Meanwhile the Princess Royal is in Australia, visiting Brisbane's Galipolli Barracks where she laid a wreath.Along with her husband, Sir Timothy Laurence, Princess Anne also met current and former armed forces and their families.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kate and Queen lay Armistice Day wreaths as nation pays tribute",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/842f/live/9cf37ac0-bef6-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-11T12:18:04.000Z",
      "dateModified": "2025-11-11T12:18:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Turkey demands more than 2,000 years' jail for popular Istanbul mayor Imamoglu",
    "url": "https://www.bbc.com/news/articles/cj6ng120pggo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6168/live/fa0aaa30-bf05-11f0-ae79-17128ffcf575.jpg",
    "tag": "World",
    "date": "2025-11-11T14:12:47.000Z",
    "description": "2 hours agoPaul KirbyEurope digital editorThe prosecutor in Turkey's biggest city has accused popular mayor Ekrem Imamoglu of 142 corruption offences ",
    "body": "2 hours agoPaul KirbyEurope digital editorThe prosecutor in Turkey's biggest city has accused popular mayor Ekrem Imamoglu of 142 corruption offences that command jail terms ranging from 828 to 2,352 years.Imamoglu, considered the main political rival to President Recep Tayyip Erdogan, has been in pre-trial custody since March on suspicion of corruption.The Istanbul mayor and his opposition Republican People's Party (CHP) deny any wrongdoing and accuse the president and his allies of launching a crackdown in response to Erdogan's decline in popularity.However, the city's chief prosecutor has targeted not just Imamoglu but 401 others, with allegations of running a criminal corruption network with the mayor as its \"founder and leader\".After an eight-month inquiry, prosecutor Akin Gürlek said the suspects, of whom 105 were in detention, had formed an enormous criminal organisation that had been engaged in taking and receiving bribes as well as money laundering.The cost in losses to the Turkish state amounted to 160bn lira (£2,9bn; $3.8bn), he said.Imamoglu, who is the secular CHP's candidate for presidential elections in 2028, has been cited on 12 counts of bribery, seven counts of money laundering from criminal proceeds and a further seven counts of fraud against public institutions and organisations.Anadolu news agency estimated the charges would carry a prison sentence of 2,430 years.The mayor's detention in March triggered widespread protests, hundreds of arrests and a police crackdown. Ever since, he has been held in Marmara prison on the outskirts of Istanbul. Apart from the corruption case, prosecutors have accused him of a raft of other offences including espionage and forging his university diploma, a qualification that has since been annulled.Turkish authorities deny the mayor's allegation that the judiciary is being used as a political tool. However, without a university diploma he cannot stand for the presidency in 2028.As the prosecutor gave details of the corruption allegations, party leader Özgür Özel told a meeting of the CHP's parliamentary group as that no-one else in their party would run for the presidency as the Istanbul mayor had been nominated by millions of Turks. \"His crime is to run for the next presidency of this country. He has no other crime!\"Imamoglu, 54, was first elected mayor in 2019 and he was re-elected in April 2024, defeating the governing AK Party candidate by almost a million votes.He has already appealed against a July jail term of a year and eight months for insulting and threatening the Istanbul prosecutor. He is also appealing against an earlier jail sentence for criticising election officials.The espionage case, launched two weeks ago, alleges that Imamoglu handed over data of Istanbul residents in return for international funding.Imamoglu has warned Turks to \"forget this espionage nonsense\".Party leader Özgür Özel has accused authorities of trying to invent offences to prevent the mayor's release from prison.\"Could he have committed electoral fraud, had a fake diploma, been a thief, a terrorist and a spy at the same time?\" he asked his parliamentary colleagues on Tuesday.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Turkey demands more than 2,000 years' jail for popular Istanbul mayor Imamoglu",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6168/live/fa0aaa30-bf05-11f0-ae79-17128ffcf575.jpg"
      ],
      "datePublished": "2025-11-11T14:12:47.000Z",
      "dateModified": "2025-11-11T14:12:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sami Hamdi to be freed from US immigration detention",
    "url": "https://www.bbc.com/news/articles/cg51381pnyqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/aa08/live/9aebdfd0-be86-11f0-94bf-c16d6772b1f4.jpg",
    "tag": "World",
    "date": "2025-11-11T00:09:54.000Z",
    "description": "British journalist Sami Hamdi is set to be released from US custody two weeks after he was detained by immigration enforcement, his family said on Mon",
    "body": "British journalist Sami Hamdi is set to be released from US custody two weeks after he was detained by immigration enforcement, his family said on Monday.US Immigration and Customs Enforcement (ICE) arrested Hamdi, a media commentator and outspoken critic of Israel, last month while he was on a speaking tour in the US.The State Department and the Department of Homeland Security (DHS) alleged at the time that Hamdi supports terrorism and poses a threat to national security, while his lawyers have argued he was targeted for criticising Israel and its war in Gaza.Hamdi will be released from ICE detention in the next few days and return to the UK, his representatives say.Hamdi was visiting the US to speak at events for the Council on American-Islamic Relations (CAIR), a Muslim advocacy group, when ICE officers arrested him at the San Francisco International Airport on 26 October. His detainment came after the US government revoked Hamdi's visa and criticism from far-right political activist and Trump ally Laura Loomer, who accused him of supporting terrorists. \"We've said it before, we'll say it again: The United States has no obligation to host foreigners who support terrorism and actively undermine the safety of Americans\", the State Department said of Hamdi at the time he was detained. The BBC has reached out to the US State Department, ICE, and DHS for comment and confirmation of the agreement to release Hamdi.Lawyers for Hamdi and the California chapter of CAIR said in a Monday statement that they welcome an agreement allowing Hamdi to voluntarily return to the UK instead of facing deportation. They said he was targeted for speaking against \"Israel's war crimes against Palestinians\". CAIR said that the immigration charging document filed in Hamdi's case only accuses him of overstaying his visa, which the government revoked without notifying him first. The organisation said the charging document does not identify \"any criminal conduct or security grounds\", which it said was proof that Hamdi was never a danger to the community or to national security.\"It is this simple: Sami never should have spent a single night in an ICE cell. His only real 'offense' was speaking clearly about Israel's genocidal war crimes against Palestinians,\" Hussam Ayloush, the CEO of California's CAIR chapter, said in the news release. When reached for comment, the UK's Foreign, Commonwealth and Development Office (FCDO) did not confirm details of Hamdi's detainment or release but told the BBC that it was providing consular assistance to a \"British man detained in the USA\". The office said it has also been in touch with the man's family and with local US authorities.\"This decision brings joy to me, his mother, his wife, our entire family, and all of Sami's supporters around the world,\" Hamdi's father, Dr Mohamed Elhachmi Hamdi, wrote on X.\"However, it does not erase the bitterness and shock we all feel over what happened to him in the United States — his arrest and the defamation of his reputation and character by US government-affiliated accounts without any legitimate reason whatsoever.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sami Hamdi to be freed from US immigration detention",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/aa08/live/9aebdfd0-be86-11f0-94bf-c16d6772b1f4.jpg"
      ],
      "datePublished": "2025-11-11T00:09:54.000Z",
      "dateModified": "2025-11-11T00:09:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Fung-wong: Six dead after second typhoon in a week hits the Philippines",
    "url": "https://www.bbc.com/news/articles/c3rjyxv9472o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5f75/live/7df53250-beb3-11f0-8456-eff94716b162.jpg",
    "tag": "World",
    "date": "2025-11-11T04:05:40.000Z",
    "description": "12 hours agoKelly Ng,Singapore, Jonathan Head,South East Asia correspondent and Lulu Luo,Cabanatuan, PhilippinesAt least six people have died after a ",
    "body": "12 hours agoKelly Ng,Singapore, Jonathan Head,South East Asia correspondent and Lulu Luo,Cabanatuan, PhilippinesAt least six people have died after a super typhoon barrelled through the Philippines, mere days after an earlier storm left more than 200 people dead.Super typhoon Fung-wong brought floods and landslides, which caused most of the deaths. It also cut power across entire provinces. It later weakened into a typhoon. More than 1.4 million people were evacuated ahead of it making landfall in the Philippines. It is now heading for Taiwan, where more than 3,000 people have been evacuated.Fung-wong was the 21st typhoon to hit the South East Asian nation this year, at a time where many residents are still struggling to recover from back-to-back natural disasters.Fung-wong, known locally as Uwan, slammed into Aurora province on Luzon Sunday night with sustained winds of around 185 km/h (115mph) and gusts of 230km/h.The Philippines' meteorological service had earlier warned of destructive winds and \"high-risk of life-threatening\" storm surges from the \"very intense\" typhoon.In Cabanatuan, one of the worst-hit cities, the BBC saw residents rushing into their homes to pull out furniture and pets on Monday, desperate to salvage as many of their possessions possible as water levels rose.Although its wind speeds did not come up to par with some of the strongest storms in the Philippines' history, Fung-wong dumped large amounts of rain on the country, leaving some 4,100 houses either totally destroyed or partially damaged.Cabanatuan resident Mercidita Adriano and her family had trimmed trees near their home last week to prepare for the storm.When the winds and rain intensified, ten of them crowded into a small room, praying throughout the day that the typhoon would spare their house, she told the BBC. Part of their roof was torn off by the heavy rain.Large parts of the country are still under water although the levels have gone down as of Tuesday morning. It comes just days after typhoon Kalmaegi ripped through the same region, leaving tens of thousands of people reeling. And in September, a magnitude 6.9 earthquake hit the province of Cebu.While the Philippines is prone to natural disasters, this series of catastrophes is \"not routine\", the International Federation of Red Cross and Red Crescent Societies said in a statement on Sunday.\"It is a stark reminder of the escalating climate and seismic risks faced by vulnerable nations. Urgent support is needed to scale up relief efforts, prevent further loss of life and support the country as it recovers from this latest disaster,\" it said. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Fung-wong: Six dead after second typhoon in a week hits the Philippines",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5f75/live/7df53250-beb3-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-11T04:05:40.000Z",
      "dateModified": "2025-11-11T04:05:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Delhi blast: The night that shook India's capital city",
    "url": "https://www.bbc.com/news/articles/clyl7n4q3qyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/db6c/live/e4049530-bee1-11f0-8456-eff94716b162.jpg",
    "tag": "World",
    "date": "2025-11-11T07:49:17.000Z",
    "description": "'There was blood everywhere': Delhi residents recount horror of huge car explosion8 hours agoVikas Pandey and Antriksha PathaniaBBC News, DelhiBBCMoha",
    "body": "'There was blood everywhere': Delhi residents recount horror of huge car explosion8 hours agoVikas Pandey and Antriksha PathaniaBBC News, DelhiBBCMohammed Azghar says that his brother has been missing since the blastMonday evening was busy as usual near the Red Fort metro station in India's capital Delhi when the sound of a loud blast broke through the cacophony on the streets.An explosion in a car killed at least eight people and injured more than 20. It was so powerful that several vehicles nearby almost melted, and people could hear the blast from kilometres away.The police are still investigating what caused the blast but the fact that it happened in one of the most secure and busy areas of Delhi has shocked people.On one side is Chandni Chowk - a busy trading and clothing hub that is busier than usual at this time of the year due to the peak wedding season.And on the other side is the 17th Century Red Fort which attracts thousands of tourists every day.Sandwiched between the two is the road where the explosion took place. Within minutes, confusion and alarm spread from the scene to the rest of the city.Some readers may find the details below disturbingMohamed Hafiz, who lives less than 200m from the spot, said his house shook and he and others ran out thinking it was an earthquake.What he saw on the street terrified him: people were running in all directions, cars were on fire, and bodies lay on the road. Some locals were trying to help the injured.\"There was blood everywhere. People were in shock. The scene was too disturbing - I could even see body parts,\" he said.As local media broke the news, fear and panic swept through the city. Police declared a high alert, and neighbouring states quickly followed suit.ReutersA member from the forensic team investigates the area where the blast took placeAs we entered Delhi from the neighbouring suburb of Noida, we could see a long queue of vehicles at the border as policemen searched them one by one.Everyone - the people in the vehicles and the policemen - looked tense as they all appeared to be in disbelief that something like this had happened in their city for the first time in more than a decade.Beyond the crossing, most roads were deserted as we drove to Lok Nayak Hospital, where the injured had been taken. Outside, a large crowd had gathered behind police cordons. Confusion hung in the air as people searched for answers, and fellow journalists speculated about what might have caused the explosion.Onlookers were mystified and even scared. Rajesh Kumar, who works at a tea shop near the hospital, said he always believed the capital was the safest city in the country.He said that though the blast had shaken him, he still believed that the security forces would soon find out what caused it.\"My family in Uttar Pradesh [state] told me to leave, they panic easily. I am a little worried and shocked but I don't think Delhi has suddenly become unsafe,\" he said.Among the crowd were also several people who were looking for missing family members.One of them was Mohammed Azghar, whose brother was in the area where the blast took place.\"My brother has been missing since the explosion. We haven't had any contact with him,\" he said.\"We've searched around Red Fort, Chandni Chowk, everywhere but we can't find him.\"Mr Azghar said his brother used to drive an electric rickshaw. \"The police have confiscated the vehicle, which is fine, we don't mind that. But at least help us find my brother.\"I just want some news - good or bad.\"The injured were taken to Lok Nayak Hospital in DelhiAfter visiting the hospital, we drove to the site of the blast. It was jarring to see the roads empty here, as the area is usually teeming with people late into the night.There were only security personnel or journalists around. Officials had relaxed restrictions and journalists could go closer to the site.The scene there told the story of the blast. There were mangled remains of cars, rickshaws and tuk-tuks. Blood stains could still be seen on the road. Some of the vehicles were charred beyond recognition.Some locals had also gathered around. They looked visibly shaken and worried about their immediate future.Ram Singh, who drives a small vehicle to ferry goods from stockrooms to shops in the area, is worried about business being affected.\"I earn daily and I am worried how I might feed my family. I hope a sense of security soon returns. I hope the police will be able to restore trust fairly quickly,\" he said.\"And I hope this never happens in our city ever again. We are shaken but we should overcome this.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Delhi blast: The night that shook India's capital city",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/db6c/live/e4049530-bee1-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-11T07:49:17.000Z",
      "dateModified": "2025-11-11T07:49:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Catherine Connolly's becomes tenth president of Ireland",
    "url": "https://www.bbc.com/news/articles/cnveplv3lzmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5399/live/6958deb0-bf0c-11f0-b5c8-ada6ff68298b.jpg",
    "tag": "World",
    "date": "2025-11-11T14:45:28.000Z",
    "description": "2 hours agoGabija GataveckaiteBBC NI News Dublin Correspondent , Dublin Castle PA MediaCatherine Connolly was elected as the Republic of Ireland's 10t",
    "body": "2 hours agoGabija GataveckaiteBBC NI News Dublin Correspondent , Dublin Castle PA MediaCatherine Connolly was elected as the Republic of Ireland's 10th president in a landslide vote at the end of OctoberCatherine Connolly has said she will make sure all voices are nurtured and heard during her presidency.Speaking at Dublin Castle where she was inaugurated as the 10th president of the Republic of Ireland she said the country has been undergoing \"seismic changes\" since the end of the Cold War.She said she was looking forward to her first visit to Northern Ireland as president and that she would foster an inclusive dialogue across the island.Connolly was elected in a landslide vote at the end of October - defeating Fine Gael candidate Heather Humphreys.The 68-year-old takes over the role from Michael D Higgins, whose 14-year term ended at midnight.The inauguration ceremony was attended by politicians, judges and other invited guests took place at Dublin Castle.\"We can and should take real pride in the success of the Good Friday Agreement model of peaceful resolution of conflict,\" she said.Taoiseach Micheál Martin congratulated Connolly on assuming office saying it was a \"happy and momentous\" day for her and her family.The Republic of Ireland's president is the country's head of state, however it is a non-executive role.On Tuesday morning, she travelled from Farmleigh at Phoenix Park to Dublin Castle with her husband, Brian McEnery, in a ceremonial motorcade.She was sworn into office in St Patrick's Hall by the chief justice.A service of prayer and reflection took place during the ceremony. Connolly was presented with the Presidential Seal and made a speech.Who attended the inauguration?PACEMAKERNorthern Ireland's First Minister Michelle O'Neill has arrived at Dublin Castle to attend the ceremonyAs well as the Taoiseach (Irish prime minister) Micheál Martin, Tánaiste (Irish deputy prime minister) Simon Harris, senior Irish government ministers and judges attended the inauguration.Northern Ireland's First Minister Michelle O'Neill also attended the ceremony and was accompanied by Sinn Féin president Mary Lou McDonald.Deputy First Minister Emma Little-Pengelly did not attended the inauguration.Little-Pengelly said she has a number of commitments in Belfast and Windsor for Remembrance Day on Tuesday.She wished the new president well and said she was hoping to have a phone call with her.PA MediaTaoiseach Micheál Martin and his wife Mary O'Shea at Dublin CastleIn the absence of Little-Pengelly, the Democratic Unionist Party (DUP) is not sending a representative to attend the inauguration, with party leader Gavin Robinson insisting it is not a \"snub\".He said the party would be \"pleased\" to meet Connolly when she visits Northern Ireland in the future in her formal capacity.Ulster Unionist Party MLA Steve Aiken is the only unionist politician who attended the inauguration in Dublin.He confirmed he would be attending in place of party leader Mike Nesbitt who has other commitments.He said it is not a bad look that he is the only unionist attending the event.\"I actually understand the reasons why some of them weren't able to make it, because obviously [Deputy First Minister] Emma Little Pengelly would be here in other circumstances. But today is Armistice Day. And it's very important for her to be in Belfast and also to be with our Head of State, the King, in Windsor Castle.\"There's no snub, or no snub are intended, and that's why I am here,\" he told BBC News NI.\"I am here, I am a unionist, and we have a substantial part of the vote. So we are here and we are showing the respect due to the president.\"He said he had no issue with the deputy first minister missing the inauguration but the First Minister Michelle O'Neill attending.PA MediaMichael D Higgins and his wife Sabina arriving at Dublin CastleAfter the ceremony, the newly inaugurated president will then travel to Áras an Uachtaráin, the official home of the Irish president, via motorcade.A state reception will take place on Tuesday evening in Dublin Castle.Connolly has served as a TD (member of Irish parliament) since 2016 and her election as president will trigger a by-election in Galway West.She previously worked as a barrister and psychologist.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Catherine Connolly's becomes tenth president of Ireland",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5399/live/6958deb0-bf0c-11f0-b5c8-ada6ff68298b.jpg"
      ],
      "datePublished": "2025-11-11T14:45:28.000Z",
      "dateModified": "2025-11-11T14:45:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Syria to join coalition to defeat IS group after Trump meeting",
    "url": "https://www.bbc.com/news/articles/cvgvz6316zwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9eb9/live/2cf58fa0-be7f-11f0-a909-015ca360c829.jpg",
    "tag": "World",
    "date": "2025-11-11T01:07:21.000Z",
    "description": "15 hours agoBernd Debusmann Jr at the White House & Raffi BergWatch: 'If you didn't have a rough past, you wouldn't have a chance', says Trump on al-S",
    "body": "15 hours agoBernd Debusmann Jr at the White House & Raffi BergWatch: 'If you didn't have a rough past, you wouldn't have a chance', says Trump on al-SharaaSyria will join the international coalition to combat the Islamic State group, marking a shift in US foreign policy in the Middle East, a senior Trump administration official has confirmed. The announcement came as President Donald Trump met Syrian President Ahmed al-Sharaa at the White House - the first such visit from a Syrian leader in the country's history.In an interview with Special Report on Fox News, al-Sharaa said the visit was part of a \"new era\" in which the country would co-operate with the US. Trump has expressed his support for al-Sharaa, who until recently was designated a terrorist by the US government.Syria will now be the 90th country to join the global coalition, which is aimed at eliminating remaining elements of the so-called Islamic State and stemming the flow of foreign militants to the Middle East. Following the meeting, a senior administration official also confirmed that the US Treasury Department, along with the departments of state and commerce, will announce new measures to lift economic restrictions on Syria and provide \"compliance clarity for investors\".As part of the measures, the administration is also issuing an 180-day suspension of the Caesar Act, which since 2019 had sanctioned the former Syrian government.Speaking to reporters in the Oval Office several hours after the meeting, Trump said that \"we want to see Syria become a country that's very successful.\" \"And I think this leader can do it,\" he added. \"I really do.\" Diplomatic relations between Syria and the US have been suspended since 2012, although the US will now allow Syria to re-open its embassy in Washington. This is the third meeting between the two leaders, following one in May on the sidelines of the Gulf Cooperation Council and a dinner during the UN General Assembly in September. Al-Sharaa's visit to the White House caps a remarkable re-branding for the former jihadist. Not long ago, he led a branch of Al-Qaeda - the group behind the 9/11 attacks and many others - before breaking off ties. Even until this year, he was the leader of Hayat Tahrir al-Sham, an armed Islamist group which the US officially considered a terrorist organisation until four months ago, with a $10m bounty on his head. The Treasury Department removed al-Sharaa from its \"specially designated global terrorist list\" just last week.But since becoming interim Syrian president, al-Sharaa has worked to soften his public image as he tries to rebuild Syria, with foreign support, following 13 years of war. \"He has had a rough past,\" Trump said on Monday. \"And I think, frankly, if you didn't have a rough past, you wouldn't have a chance.\" In his interview, al-Sharaa said that he and Trump had not discussed his past, but instead focused on the \"present and the future\" of Syria in which it was a \"geopolitical\" and economic partner of Washington. Al-Sharaa's rule, however, has been marred by killings of members of Syria's Alawite minority, as well as by deadly violence between Sunni Bedouin fighters and Druze militias.He has vowed to root out members of his security forces that have committed human rights violations. Trump, for his part, has repeatedly expressed support for al-Sharaa, referring to him as a \"young, attractive guy\" and a \"fighter\". In June, President Trump signed an executive order lifting sanctions against Syria, which the White House said would help support the country's \"path to stability and peace\". At the time, the administration said it would monitor the new Syrian government's actions, including \"taking steps toward normalising ties with Israel\" and addressing \"foreign terrorists\" and militant groups operating in the country. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Syria to join coalition to defeat IS group after Trump meeting",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9eb9/live/2cf58fa0-be7f-11f0-a909-015ca360c829.jpg"
      ],
      "datePublished": "2025-11-11T01:07:21.000Z",
      "dateModified": "2025-11-11T01:07:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israel bill proposing death penalty for those it deems terrorists passes first reading",
    "url": "https://www.bbc.com/news/articles/cpv13rxpgk9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8840/live/f0889830-bee4-11f0-8456-eff94716b162.jpg",
    "tag": "World",
    "date": "2025-11-11T14:41:00.000Z",
    "description": "2 hours agoYolande KnellMiddle East correspondent, JerusalemEPAFar-right National Security Minister Itamar Ben-Gvir handed out sweets after the bill's",
    "body": "2 hours agoYolande KnellMiddle East correspondent, JerusalemEPAFar-right National Security Minister Itamar Ben-Gvir handed out sweets after the bill's first reading was approvedIsrael's parliament has passed the first reading of a bill proposing the death penalty for those it deems to be terrorists acting against the state - a requirement which means it is likely to be used only against Palestinians convicted of deadly attacks on Israelis.The far-right National Security Minister, Itamar Ben-Gvir - whose Jewish Power party brought the vote - celebrated late on Monday by handing out sweets after the bill was approved in the 120-seat Knesset by 39 votes to 16.\"After the law is finally passed - terrorists will only be released to hell,\" he said. The bill must pass two more readings before becoming law.In the same session, the Knesset also approved the first reading of another controversial bill allowing the Israeli government to close a foreign media outlet without court approval. That vote was 50 in favour and 41 against.The legislation aims to turn a temporary order that allowed the closure of Qatari-owned Al Jazeera in May 2024, into a permanent law. It has been opposed by the government's legal advisers.While the death penalty does exist for a small number of crimes in Israel it has only been used twice since 1948 when the state was created. The last time was when the Nazi war criminal, Adolf Eichmann, was hanged in 1962, after a public trial.An amendment to the penal code was demanded by the Jewish Power party and signed off by the Knesset's National Security Committee, which said in a statement that its purpose was to \"nip terrorism in the bud and create a weighty deterrent\".The statement read: \"It is proposed that a terrorist convicted of murder motivated by racism or hatred towards the public, and under circumstances where the act was committed with the intent to harm the State of Israel and the rebirth of the Jewish nation in its homeland will be sentenced to the death penalty - mandatory.\"The clause about harming Israel makes it likely that Palestinians convicted of deadly attacks, but not Jewish Israelis, will be sentenced to death.The foreign ministry of the Palestinian Authority - which governs parts of the occupied West Bank - called the proposed law a \"new form of escalating Israeli extremism and criminality against the Palestinian people\".ReutersIsrael released almost 2,000 Palestinian prisoners and detainees from Gaza a month ago in exchange for 20 living Israeli hostages held by HamasBen-Gvir had long pushed for the death penalty bill to be brought to a Knesset vote, but such a move was previously opposed by Israeli political and security leaders who argued it could complicate efforts to free living Israeli hostages held by Hamas in Gaza.That is no longer a concern since their return after the start of the Gaza ceasefire last month.Ben-Gvir was one of just a few Israeli ministers who voted against the Gaza ceasefire deal which aimed to end the war. This saw 20 living hostages sent home in exchange for some 2,000 Palestinian prisoners, including about 250 serving life sentences, many convicted of killing Israelis.\"A dead terrorist does not get released alive,\" commented Limor Son Har-Melech, a member of Jewish Power, and sponsor of the bill.In 2003, during the Second Intifada, or Palestinian uprising, a then-pregnant Har-Melech and her husband - who lived in a settlement in the occupied West Bank - were attacked by Palestinian gunmen while in their car. Her husband was killed and she was injured, leading her to give birth by an emergency caesarean section.She told the Knesset one of her husband's killers went on to be released in a previous exchange deal to bring home an Israeli soldier held captive in Gaza. She said he went on to command a deadly attack on another Israeli and take part in the Hamas-led attacks on 7 October 2023, before he was killed during the Gaza war.Responding to the draft bill, Palestinian human rights organisations said its \"most alarming aspect\" would be that if it became law, it could be used to apply retroactively.They suggested its intent was \"executing collective death sentences that could target hundreds of Palestinian detainees from the Al-Qassam Brigades' elite forces who were arrested on or after 7 October\", referring to Hamas's military wing.Israel's justice minister has already said he is seeking Knesset legislation to set up a special criminal tribunal to try Gazans accused of involvement in the attacks of 7 October 2023, in a process that could result in death sentences being handed down to those convicted.Some 1,200 people were killed two years ago in the cross-border attack on southern Israel by several thousand armed Hamas fighters. In the war that it triggered, the Hamas-run health ministry said more than 69,000 people were killed in Gaza.ReutersIsraeli troops raided and shut down Al Jazeera's offices in Ramallah in September 2024The push by Israeli lawmakers to formalise what has become known as the \"Al Jazeera Law\" also follows on from the Gaza ceasefire.During the war, a ban imposed by Israel's ministry of communications forced Al Jazeera to close its office at a hotel in occupied East Jerusalem. The Israeli military then ordered the closure of the network's office in the West Bank city of Ramallah, claiming it was a threat to national security.Israel accused Al Jazeera of anti-Israel bias and of supporting Hamas in its news coverage. Al Jazeera has repeatedly denied such accusations and condemned Israel's actions.The new international media legislation would give the government permanent powers to stop foreign broadcasters in Israel, even outside times of war or national emergency and would remove the need for judicial oversight.Last year, when petitioning the High Court of Justice against the temporary order allowing sanctions on foreign broadcasters, the Association for Civil Rights in Israel (ACRI) argued that \"the law violates freedom of expression, the right to information and freedom of the press, and blocks citizens and residents from receiving a variety of information that does not fit the Israeli narrative or is not broadcast on Israeli media channels.\"The two controversial bills are expected to be prepared for second and third parliamentary readings.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israel bill proposing death penalty for those it deems terrorists passes first reading",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8840/live/f0889830-bee4-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-11T14:41:00.000Z",
      "dateModified": "2025-11-11T14:41:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Verified videos show aftermath of explosion in Delhi",
    "url": "https://www.bbc.com/news/videos/cly2pknvjvlo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b96b/live/292471f0-be54-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "World",
    "date": "2025-11-10T16:54:03.000Z",
    "description": "Police have said that eight people have been killed after an explosion near the historic Red Fort in Delhi, India.Delhi Police Commissioner Satish Gol",
    "body": "Police have said that eight people have been killed after an explosion near the historic Red Fort in Delhi, India.Delhi Police Commissioner Satish Golcha told reporters that the incident happened at around 18:52 local time (13:52 GMT), when a slow moving vehicle stopped at a red light before it exploded.Police said they have not yet determined what caused the blast but are investigating.Thousands of tourists visit the 17th Century Red Fort every day, which lies just a few metres from a busy trading hub.Read more here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Verified videos show aftermath of explosion in Delhi",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b96b/live/292471f0-be54-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-10T16:54:03.000Z",
      "dateModified": "2025-11-10T16:54:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]