[
  {
    "title": "BBC Verify: Does the US have the right to take over Greenland?",
    "url": "https://www.bbc.com/news/videos/cq6vg2j6pndo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/images/ic/1024xn/ichef.bbci.co.uk/images/ic/$widthxn/p0msf851.jpg",
    "tag": "World",
    "date": "2026-01-06T17:48:59.000Z",
    "description": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationHealthCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch L",
    "body": "Skip to contentWatch LiveBritish Broadcasting CorporationHomeNewsSportBusinessInnovationHealthCultureArtsTravelEarthAudioVideoLiveDocumentariesWatch LiveMore on this story.1 day agoGreenlandDenmarkDonald Trump",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC Verify: Does the US have the right to take over Greenland?",
      "image": [
        "https://ichef.bbci.co.uk/images/ic/1024xn/ichef.bbci.co.uk/images/ic/$widthxn/p0msf851.jpg"
      ],
      "datePublished": "2026-01-06T17:48:59.000Z",
      "dateModified": "2026-01-06T17:48:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Heatwave hits Australia as officials warn of 'catastrophic' fire risk",
    "url": "https://www.bbc.com/news/articles/cy4q898dkwxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4b4f/live/5e4083b0-ec3a-11f0-93c9-f1aa9128d86a.jpg",
    "tag": "World",
    "date": "2026-01-08T04:08:38.000Z",
    "description": "Parts of Australia will face catastrophic fire conditions on Friday, as heatwaves hit most of the country, creating the most \"significant\" conditions ",
    "body": "Parts of Australia will face catastrophic fire conditions on Friday, as heatwaves hit most of the country, creating the most \"significant\" conditions since the Black Summer bushfires.Severe to extreme heatwaves have been declared in every state and territory in Australia, except for Queensland, with high temperatures forecast for days.The state of Victoria has declared a total fire ban for Friday with northern areas shutting 450 schools and childcare centres as well as parks, as the fire danger level for the region will be set at \"catastrophic\" - the highest level.  One meteorologist told the BBC that the combination of heatwaves and an elevated fire danger pose a risk not seen in years.On Thursday, firefighters battled several fires in Victoria and New South Wales (NSW), with a dozen planes carrying water called in to tackle a large blaze near Wodonga city, according to the ABC.Melbourne experienced its hottest day in six years on Wednesday with a high of 40.9C (105.6F), while some coastal towns in Western Australia hit 49C.In NSW, the heatwave is expected to peak on Saturday with Sydney facing a high of 42C while areas of South Australia and Western Australia will see temperatures over 40C in the coming days. Friday will be the \"real peak of the current burst of heat,\" Angus Hines from Bureau of Meteorology told the BBC.\"It will be a very hot day for almost all of South Australia, Victoria, most of New South Wales, parts of Tasmania\".Wednesday was the first significant heatwave for Melbourne and Adelaide, where millions of people live, with fire conditions set to worsen on Friday, he said.\"Firstly, the winds are strengthening across Victoria tomorrow,\" Hines said, adding that coupled with possible thunderstorms with little rain and dry lightning strikes, the fire danger will hit catastrophic levels for the northern parts of Victoria.\"This looks like the most significant event at a multi-day level for inland south-east Australia since 2019-2020,\" Hines said.That period six years ago saw Australia's most severe fire season on record, the so-called \"Black Summer\" of 2019-20 where dozens of people died and thousands of hectares of land was burnt. In Victoria, authorities on Thursday warned that a catastrophic fire danger rating means potential blazes can be \"unpredictable and uncontrollable\".\"We need the community to play their role alongside our emergency services to protect lives and property,\" said Victoria's Emergency Management Commissioner Tim Wiebusch.\"Prepare now and enact your bushfire survival plan. If you are in an area of forecast catastrophic fire danger, leave early to an area with a lower fire risk.\"Australia's fire danger ratings scale has four levels, with catastrophic being the highest level, followed by extreme, high and low.A heatwave is declared when the minimum and maximum temperatures are expected to be unusually high for three days of more.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Heatwave hits Australia as officials warn of 'catastrophic' fire risk",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4b4f/live/5e4083b0-ec3a-11f0-93c9-f1aa9128d86a.jpg"
      ],
      "datePublished": "2026-01-08T04:08:38.000Z",
      "dateModified": "2026-01-08T04:08:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Families shocked Swiss ski bar was not inspected for years before deadly fire",
    "url": "https://www.bbc.com/news/articles/c74wexkd598o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3ac7/live/2f966e60-ebd3-11f0-b385-5f48925de19a.jpg",
    "tag": "World",
    "date": "2026-01-07T10:54:33.000Z",
    "description": "17 hours agoPaulin KolaReutersEmotions are still raw outside the barFamilies of the victims of a fire at a Swiss bar on New Year's Eve have expressed ",
    "body": "17 hours agoPaulin KolaReutersEmotions are still raw outside the barFamilies of the victims of a fire at a Swiss bar on New Year's Eve have expressed shock after officials admitted the venue had not undergone safety checks for five years.Romain Jordan, who represents some of the families, said the \"staggering number of breaches and shortcomings in the inspections raises the question of whether the municipality should be investigated with even greater urgency\".Other lawyers also urged officials to take responsibility for the disaster at Le Constellation bar in Crans-Montana in which 40 people died and 116 were injured. Prosecutors believe the fire started when champagne bottles with sparklers attached set light to sound-insulating foam on the ceiling. The two bar managers have been placed under criminal investigation, but not in custody. French couple Jacques and Jessica Moretti are suspected of manslaughter by negligence, bodily harm by negligence and arson by negligence.In their first statement since the fire, they said they were \"devastated\" and pledged \"full co-operation\" with the investigation.Venues like Le Constellation should have been checked annually, but the mayor of Crans-Montana, Nicolas Feraud, said on Tuesday he could not explain why it hadn't been checked in so long. \"We regret that - we owe it to the families and we will accept the responsibility,\" he said.He added that sparklers would be banned in local venues.ReutersRicardo Minghetti, whose funeral was held on Wednesday, was one of eight victims under the age of 16More on this storyMost of the victims of the fire were young - eight under the age of 16.Many of the injured have severe burns and are being treated in Switzerland and other European countries.The funerals of some of those who died have been taking place.Watch: Ski bar not checked for five years and sparklers now banned, mayor saysUnder Switzerland's political system, power is distributed among three levels of the confederation, 26 cantons and then about 2,131 municipalities.While safety regulations are set by cantons, they need to be implemented by local authorities. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Families shocked Swiss ski bar was not inspected for years before deadly fire",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3ac7/live/2f966e60-ebd3-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-07T10:54:33.000Z",
      "dateModified": "2026-01-07T10:54:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Spencer Pratt: Reality TV star announces run for LA mayor",
    "url": "https://www.bbc.com/news/articles/c9dv5zdl7ydo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/042e/live/b172d5c0-ec2a-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-08T01:00:08.000Z",
    "description": "3 hours agoSamantha GranvilleLos AngelesReality television star Spencer Pratt has launched a campaign for mayor of Los Angeles, vowing to \"expose the ",
    "body": "3 hours agoSamantha GranvilleLos AngelesReality television star Spencer Pratt has launched a campaign for mayor of Los Angeles, vowing to \"expose the system\".His longshot bid for city hall comes on the anniversary of a wildfire that destroyed his home and became one of California's most destructive blazes on record. Pratt, 42, made the announcement while speaking at a \"They Let Us Burn\" rally organised by residents who lost houses in the Palisades Fire. The protest marked a year since the fire ignited in the Pacific Palisades on 7 January 2025, tearing through the wealthy coastal community tucked between the Santa Monica Mountains and the Pacific Ocean.Another blaze, the Eaton Fire, sparked hours later on the other side of the city. In total, 31 people were killed and more than 16,000 homes and businesses were destroyed.Pratt posted photos on his Instagram page showing him signing what appears to be official campaign paperwork, although his filing was not yet official.\"Business as usual is a death sentence for Los Angeles,\" he told Wednesday's demonstration, \"and I'm done waiting for someone to take real action. That's why I am running for mayor.\"But let me be clear, this just isn't a campaign. This is a mission, and we are going to expose the system. \"We are going into every dark corner of LA politics and disinfecting the city with our light.\"He and his wife, former reality TV star Heidi Montag, lost their Pacific Palisades home in the fire.Pratt has since emerged as a vocal critic of Los Angeles Mayor Karen Bass and California Governor Gavin Newsom over their handling of the disaster.Pratt rose to fame in the mid-2000s as a cast member on MTV's Laguna Beach spin-off The Hills, where his relationship with Montag became a central storyline. The couple wed in 2008 and have two children. They later appeared on I'm a Celebrity…Get Me Out of Here and the UK edition of Celebrity Big Brother.Despite his fame, Pratt is a first-time candidate who faces long odds in a crowded field for June's non-partisan mayoral primary.Bass, who won the mayoralty in 2022 after defeating real estate developer Rick Caruso, is seeking re-election.More than a dozen other candidates have entered the race.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Spencer Pratt: Reality TV star announces run for LA mayor",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/042e/live/b172d5c0-ec2a-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-08T01:00:08.000Z",
      "dateModified": "2026-01-08T01:00:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump calls for US military spending to rise more than 50% to $1.5tn",
    "url": "https://www.bbc.com/news/articles/cy59kxl2xwzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3b72/live/79f72460-ec3f-11f0-8de8-290398e098ee.jpg",
    "tag": "World",
    "date": "2026-01-08T02:15:51.000Z",
    "description": "2 hours agoOsmond ChiaBusiness reporterPresident Donald Trump has called for US defence spending to be increased to $1.5tn (£1.1tn) in 2027 for what h",
    "body": "2 hours agoOsmond ChiaBusiness reporterPresident Donald Trump has called for US defence spending to be increased to $1.5tn (£1.1tn) in 2027 for what he called \"these very troubled and dangerous times\".That would be more than 50% higher than this year's $901bn budget, which was approved by Congress in December.\"This will allow us to build the \"Dream Military\" that we have long been entitled to and, more importantly, that will keep us SAFE and SECURE, regardless of foe,\" Trump said on social media on Wednesday.In separate posts, the president said he would crack down on payouts to bosses and shareholders of major US defence contractors unless the firms speed up deliveries of armaments and build new manufacturing plants.Shares in major US defence equipment makers Lockheed Martin, Northrop Grumman and Raytheon rose by more than 5% in extended trading in New York trade after Trump made the announcements.Economists have previously warned that the gap between US spending and its income has reached unsustainable levels.But Trump said Washington can \"easily hit\" his proposed $1.5tn defence budget thanks to money being brought in by tariffs.Trump has been pushing for higher defence spending by the US and its allies since his first term in the White House.He said in another post on Wednesday that military equipment is not being made quickly enough and urged companies to build new and modern plants.Defence companies are issuing \"massive\" payouts to shareholders and stock buybacks at the expense of investing into production, Trump said. He also criticised the \"exorbitant\" pay packages of executives at arms manufacturers.\"No Executive should be allowed to make in excess of $5 Million Dollars which, as high as it sounds, is a mere fraction of what they are making now.\"In a separate post, Trump singled out Raytheon, saying it was the \"least responsive\" to America's defence needs and the slowest to increase production.\"Either Raytheon steps up and starts investing in more upfront Investment like Plants and Equipment, or they will no longer be doing business with the Department of War,\" Trump wrote in a separate post.The BBC has contacted Raytheon for comment.Trump's call for much higher defence spending comes as geo-political tensions have increased around the world.On Wednesday, the US military captured a Russian-flagged oil tanker suspected to have violated US sanctions.It came after US forces seized Venezuelan leader Nicolás Maduro at the weekend and took him to America to face drug trafficking charges.In December, China held military drills around Taiwan simulating the seizure and blockade of the island's key areas, as a warning against \"separatist forces\".Taiwan's push to ramp up its defence this year has also angered Beijing, which claims the self-ruled island as its territory.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump calls for US military spending to rise more than 50% to $1.5tn",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3b72/live/79f72460-ec3f-11f0-8de8-290398e098ee.jpg"
      ],
      "datePublished": "2026-01-08T02:15:51.000Z",
      "dateModified": "2026-01-08T02:15:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Crowds line Saint-Tropez streets for Brigitte Bardot funeral",
    "url": "https://www.bbc.com/news/articles/c74weknjzzno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1b86/live/c6daa960-ec16-11f0-b385-5f48925de19a.jpg",
    "tag": "World",
    "date": "2026-01-07T22:27:25.000Z",
    "description": "Crowds lined the streets of Saint-Tropez for the funeral of French film legend Brigitte Bardot on Wednesday.Some of those gathered were seen applaudin",
    "body": "Crowds lined the streets of Saint-Tropez for the funeral of French film legend Brigitte Bardot on Wednesday.Some of those gathered were seen applauding as her coffin was driven through the French Riviera town after a service in a local church.Among the guests at the service were far-right politician Marine le Pen and Equality Minister Aurore Bergé, who like Bardot, is a defender of animal rights. The actress was later buried at a hillside cemetery overlooking the Mediterranean.Bardot, who revolutionised 1950s French cinema and became a symbol of sexual liberation, died of cancer aged 91 three days after Christmas.Bardot had left instructions that her funeral be conducted without fanfare or ostentation - but the people of Saint-Tropez wanted to pay her a proper adieu on Wednesday.Screens were set up in the small fishing town that was transformed by Bardot's fame into a playground for the jet set.Bardot's only son Nicolas-Jacques Charrier was among those carrying the coffin to the cemetery where the actress' parents and first husband Roger Vadim are buried. After her death, French President Emmanuel Macron said the nation was mourning \"a legend of the century\", while the Brigitte Bardot Foundation remembered her as a \"world-renowned actress\". The cinema icon - \"BB\" as she was known in her home country - acted in almost 50 films, including And God Created Woman, but retired in 1973 to devote her life to animal welfare.Later in life, Bardot's reputation was damaged after she made homophobic slurs and was fined multiple times for inciting racial hatred.Her right-wing views alienated her from many in the political establishment.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Crowds line Saint-Tropez streets for Brigitte Bardot funeral",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1b86/live/c6daa960-ec16-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-07T22:27:25.000Z",
      "dateModified": "2026-01-07T22:27:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nick Reiner's lawyer removes himself from murder case ",
    "url": "https://www.bbc.com/news/articles/c0ke5lx6kyno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c5e3/live/822f73c0-ec1d-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "World",
    "date": "2026-01-07T23:11:35.000Z",
    "description": "A high-powered lawyer for Nick Reiner, who is charged with murdering his Hollywood director father Rob Reiner and mother Michele, has withdrawn from t",
    "body": "A high-powered lawyer for Nick Reiner, who is charged with murdering his Hollywood director father Rob Reiner and mother Michele, has withdrawn from the case.It emerged that Alan Jackson would no longer represent Nick Reiner during a court hearing, though the attorney said afterwards that he believed his now-former client was innocent.Reiner, 32, did not enter a plea to charges of first-degree murder of his parents during a brief appearance at Los Angeles Superior Court.The Reiners were found dead with stab wounds on 14 December in the bedroom of their home in Brentwood, Los Angeles.Jackson said outside court after Wednesday's hearing that he had left the case.\"Circumstances beyond my control, but more importantly circumstances beyond Nick's control, have made it impossible for us to continue our representation,\" he told reporters.\"I'm legally and ethically prohibited from explaining the reasons why.\"The lawyer, who has previously represented Harvey Weinstein and Kevin Spacey, added that Reiner was not guilty of murder.But LA County District Attorney Nathan Hochman said otherwise outside court.\"We are fully confident that a jury will convict Nick Reiner beyond a reasonable doubt of the brutal murder of his parents - Rob Reiner and Michele Singer Reiner,\" said the prosecutor.The accused will now be represented in court by a public defender.To qualify for a publicly funded attorney, defendants must show they lack the means to fund their legal case.Rob Reiner's net worth was estimated at $200m (£150m) and it is unclear who was paying the retainer for his son's high-powered attorney. The accused has a brother and sister.When asked by the judge if he understood that he was waiving his right to enter a plea on Wednesday, Reiner said: \"Yeah, I agree with it.\"The defendant smiled a few times during the hearing as he spoke to sheriffs' deputies.His new lawyer, public defender Kimberly Greene, met Reiner and asked for time to prepare for the case before her new client entered a plea.The next hearing is set for 23 February.Rob Reiner, 78, directed a handful of iconic films in a variety of genres, including This is Spinal Tap, Misery and A Few Good Men.Michele Singer Reiner, 70, was an actress, photographer and producer.Watch: \"I'm learning about being a parent\" - Rob Reiner talks to the BBC's Tim Sebastian in 1998",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nick Reiner's lawyer removes himself from murder case ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c5e3/live/822f73c0-ec1d-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-07T23:11:35.000Z",
      "dateModified": "2026-01-07T23:11:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Russian attacks leave two regions with widespread blackouts, Ukraine says",
    "url": "https://www.bbc.com/news/articles/cgk8jv4r8nmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4108/live/f5ca2990-ec24-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-08T01:13:14.000Z",
    "description": "Russian attacks left Ukraine's southeastern regions of Dnipropetrovsk and Zaporizhzhia almost entirely without power, the country's energy ministry sa",
    "body": "Russian attacks left Ukraine's southeastern regions of Dnipropetrovsk and Zaporizhzhia almost entirely without power, the country's energy ministry said on Wednesday night. Critical infrastructure was \"operating on reserve power\", it said in a statement on Telegram, while officials said water supplies and the internet were also disrupted. Russia has recently intensified attacks on Ukraine's energy infrastructure, aimed at paralysing power supplies during a harsh winter.\"Ukraine's energy system is under enemy attacks every day, and energy workers are operating in extremely difficult conditions to provide people with light and heat,\" Ukraine's Prime Minister Yulia Svyrydenko wrote on Telegram.\"Deteriorating weather conditions put additional strain on critical infrastructure,\" she said.The disruptions to power and heating have come as temperatures plunge. \"Emergency restoration work in the regions affected by the attack will begin immediately as soon as the security situation allows,\" state energy company Ukrenergo said on Telegram. It added: \"The primary task of energy workers is to restore critical infrastructure.\"Dnipro city Mayor Borys Filatov said on Telegram all city hospitals had been completely switched to generators. \"There are the necessary water supplies, the treatment process does not stop. Water drainage in houses is also supported by alternative power sources,\" Filatov said.School holidays had been extended until 9 January because of the power cuts, he added. The head of the Zaporizhzhia regional administration, Ivan Fedorov, said everything possible was being done to restore power.\"At this time, water utility workers have almost restored water to our homes, despite the fact that there is a complete blackout in the region,\" Fedorov said in a video message published on Telegram.DTEK, Ukraine's biggest private energy provider, is living in permanent crisis mode because of Russian attacks on the grid, its chief executive told the BBC last month, with most of Ukraine suffering from lengthy power cuts during winter.Maxim Timchenko, CEO of DTEK, which provides power for 5.6 million Ukrainians, said the intensity of strikes had been so frequent \"we just don't have time to recover\".As the fourth anniversary of Russia's full-scale invasion approaches, Timchenko said Russia had repeatedly targeted DTEK's energy grid with \"waves of drones, cruise and ballistic missiles\" and his company had found it difficult to cope.The attacks come as Ukrainian President Volodymyr Zelensky said European allies have not given him sound guarantees that they will protect his country in the event of new Russian aggression.Following talks in Paris on Tuesday, the UK and France signed a declaration of intent on deploying troops in Ukraine if a peace deal is made with Russia.Moscow has repeatedly warned that any foreign troops in Ukraine would be a \"legitimate target\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Russian attacks leave two regions with widespread blackouts, Ukraine says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4108/live/f5ca2990-ec24-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-08T01:13:14.000Z",
      "dateModified": "2026-01-08T01:13:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Aleppo: Thousands flee clashes between Syrian government and Kurdish fighters",
    "url": "https://www.bbc.com/news/articles/cn0y1pnq00qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f2bf/live/7b75d0f0-ec46-11f0-b385-5f48925de19a.jpg",
    "tag": "World",
    "date": "2026-01-07T20:33:22.000Z",
    "description": "8 hours agoGabriela PomeroyWatch: Thousands flee Aleppo in Syria amid clashesAt least 12 people have reportedly been killed during two days of intense",
    "body": "8 hours agoGabriela PomeroyWatch: Thousands flee Aleppo in Syria amid clashesAt least 12 people have reportedly been killed during two days of intense clashes between Syrian government and Kurdish fighters in the northern city of Aleppo.Tens of thousands of civilians have also fled the Kurdish majority neighbourhoods of Sheikh Maqsoud and Ashrafieh, which the Syrian army shelled on Wednesday afternoon after designating them as \"closed military areas\".The government said the operation was a response to attacks by armed groups in the areas and was \"solely aimed at preserving security\".The Kurdish-led Syrian Democratic Forces (SDF) militia alliance - which insists it has no military presence in Aleppo - called it a \"criminal attempt\" to forcibly displace residents.One Aleppo resident told the BBC on Wednesday that the situation was \"terrible and awful\".\"All my friends have left for other towns. Sometimes it is calm and suddenly war starts again,\" they said.A displaced man from Ashrafieh, Samer Issa, told Reuters news agency that he was sleeping in a mosque which had been turned into a shelter with his young children. \"The shelling intensified. We left because our children could no longer endure the hits and the shelling,\" he said, describing the situation as \"heartbreaking\".Getty ImagesSyrian government forces deployed near Sheikh Maqsoud and Ashrafieh The violence underscores the challenges facing the government of President Ahmad al-Sharaa in a country that remains deeply divided a year after he led the rebel offensive that overthrew Bashar al-Assad.In March 2025, the Kurdish-led SDF, which controls much of Syria's north-east and has tens of thousands of fighters, signed a deal to integrate all military and civilian institutions into the Syrian state.But that has not happened yet, with both sides accusing each other of trying to derail the agreement. The SDF remains reluctant to give up the autonomy it won during the country's 13-year civil war, when it helped US-led forces defeat the Islamic State (IS) group. The stand-off in Aleppo also risks dragging in Turkey, which backs the government and considers the Kurdish militia that dominates the SDF as a terrorist organisation.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Aleppo: Thousands flee clashes between Syrian government and Kurdish fighters",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f2bf/live/7b75d0f0-ec46-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-07T20:33:22.000Z",
      "dateModified": "2026-01-07T20:33:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hundreds of flights cancelled as big freeze grips western Europe",
    "url": "https://www.bbc.com/news/articles/cy59k13e7eqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ceb7/live/1d0eee70-ebd3-11f0-b6c6-77a0b21e55ee.jpg",
    "tag": "World",
    "date": "2026-01-07T15:50:02.000Z",
    "description": "A spell of freezing weather bringing heavy snowfall and ice has caused transport disruption across western Europe.Hundreds of flights have been cancel",
    "body": "A spell of freezing weather bringing heavy snowfall and ice has caused transport disruption across western Europe.Hundreds of flights have been cancelled at several airports, while Eurostar services and haulage have also been affected.More than 700 flights were cancelled at Schiphol Airport in Amsterdam, a major regional transport hub, on Wednesday. Meanwhile, France's civil aviation authority has asked airlines to cut 40% of flights scheduled for the main international airport in Paris.At least six people have died in weather-related incidents across Europe this week -five in France and one in Bosnia.Dutch national airline KLM warned Schiphol Airport was close to running out of de-icing fluid after days of freezing conditions.Spokesperson Stephan Donker told news agency Reuters that it was an \"exceptional situation\" at the Dutch airport, where more than 1,000 travellers spent the night.A few hundred beds have been set up there before and after security checks with food and drinks also provided, he said.Donker warned of knock-on effects from the disruption, with further delays and cancellations possible in coming days.In Paris, more than 100 flights were cancelled at Charles de Gaulle airport and 40 more at Orly.Dozens of fllights have been delayed or cancelled in and out of Heathrow and Brussels.Some Eurostar rail services between London and Paris were delayed or cancelled on Wednesday. Almost half of mainland France was on alert for heavy snow and black ice, with lorries banned from the roads in some areas.\"It's better to be here than stuck on the road,\" driver Carle Bruno told news agency AFP at a roadside service station in the northern port of Le Havre.Five people died in two separate regions of France earlier this week as a result of treacherous driving conditions, authorities said, while a woman was also killed in Bosnia's capital, Sarajevo, after 40cm (16in) of snow fell on the city.In Paris, Guinean teenager Boubacar Camara, sleeping in a tent on the outskirts of the city, told AFP he had \"no choice but to keep on going\".\"You just have to stay strong [and] make sure you don't die,\" the 19-year-old said. \"We can't do anything about the cold. I'm not used to this at all.\"The rare sight of the French capital covered in snow drew residents and tourists out to ski down the slopes of Montmartre and along the Champs de Mars gardens below the Eiffel Tower.\"It's exceptional, it's incredible,\" said Pierre, a Parisian. \"It's magnificent and we're enjoying it. We also came across a lot of tourists and they look so happy.\" ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hundreds of flights cancelled as big freeze grips western Europe",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ceb7/live/1d0eee70-ebd3-11f0-b6c6-77a0b21e55ee.jpg"
      ],
      "datePublished": "2026-01-07T15:50:02.000Z",
      "dateModified": "2026-01-07T15:50:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump to meet Colombian president at White House in 'near future'",
    "url": "https://www.bbc.com/news/articles/c98py70npj9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ab6e/live/9b69f640-ec35-11f0-8f94-210a5bc89de2.jpg",
    "tag": "World",
    "date": "2026-01-08T03:54:30.000Z",
    "description": "US President Donald Trump has said he will meet his Colombian counterpart Gustavo Petro at the White House in the \"near future\", just days after sayin",
    "body": "US President Donald Trump has said he will meet his Colombian counterpart Gustavo Petro at the White House in the \"near future\", just days after saying an operation targeting Colombia \"sounds good\". The US seized the president of neighbouring Venezuela, Nicolás Maduro, in a raid on Caracas on Saturday night.Venezuelan Interior Minister Diosdado Cabello said on Wednesday the death toll in the raid was substantially higher than initially reported, with more than 100 people killed.Local media had previously reported that 23 Venezuelan and 32 Cuban soldiers died when US forces stormed Maduro's compound. During a call with Trump, Petro explained \"the situation of drugs and other disagreements\", the US president said, adding he appreciated the Colombian president's \"tone\". Earlier this week, Trump had issued a warning to Petro, telling him to \"watch his ass\".Colombia is a key hub for the region's drug trade - most notably cocaine - as well as having substantial oil reserves. It is also a major producer of gold, silver, emeralds, platinum and coal. The US has said it will control sales of Venezuelan oil \"indefinitely\" as it prepares to roll back restrictions on the country's crude in global markets, according to the White House.Speaking aboard Air Force One following the operation in Venezuela, Trump described Petro as a \"sick man who likes making cocaine and selling it to the United States\". Trump added: \"He's not going to be doing it for very long.\"In response, Petro warned that Colombia would \"take up arms\" if the US launched any military action against his country.\"If you detain a president whom much of my people want and respect, you will unleash the people's jaguar,\" Petro wrote on X.But writing on his Truth Social platform late on Wednesday, Trump described his conversation with Petro as a \"Great Honor\", and said US Secretary of State Marco Rubio and his Colombian counterpart would make arrangements for Petro to travel to Washington.The US imposed sanctions on Petro in October, saying he was failing to curb drug trafficking and was allowing cartels to \"flourish\".At the time, US Treasury Secretary Scott Bessent said that since Petro came to power in 2022, cocaine production in Colombia had \"exploded to the highest rate in decades, flooding the United States and poisoning Americans\".Petro responded he had been fighting drug trafficking \"for decades\" and that his administration had stemmed the growth of coca crops.Like Venezuela, Colombia is home to substantial oil reserves.Meanwhile, Venezuela's interim president Delcy Rodríguez said the US action to depose Maduro was a \"stain on our relations such as had never occurred in our history\". But she added: \"Venezuela is open to energy relations where all parties benefit.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump to meet Colombian president at White House in 'near future'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ab6e/live/9b69f640-ec35-11f0-8f94-210a5bc89de2.jpg"
      ],
      "datePublished": "2026-01-08T03:54:30.000Z",
      "dateModified": "2026-01-08T03:54:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Berlin outage highlights German vulnerability to sabotage",
    "url": "https://www.bbc.com/news/articles/cvgrpzn6gz4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5326/live/242f1540-ebec-11f0-8608-ef259671aea9.jpg",
    "tag": "World",
    "date": "2026-01-07T17:17:34.000Z",
    "description": "11 hours agoJessica ParkerBerlin correspondentBBCLena's family have been cooking on a camping stovePower is being restored to the last homes hit by a ",
    "body": "11 hours agoJessica ParkerBerlin correspondentBBCLena's family have been cooking on a camping stovePower is being restored to the last homes hit by a five-day blackout in Germany's snow-covered capital, Berlin.The outage was caused by a suspected arson attack and came as temperatures dipped below freezing.It is reportedly the longest blackout in the capital's post-war history. A far-left militant group has claimed it was behind the outage.This week's images of residents - young and old - living through a prolonged blackout in the country's capital has reignited a debate about Germany's vulnerability to sabotage attacks, whether by domestic or foreign actors.Schools, hospitals and care homes are among the tens of thousands of properties that were affected in south-west Berlin.In Berlin's Steglitz-Zehlendorf district, on Mexikoplatz, a police van drove around announcing the imminent return of power over a tannoy.Residents regularly approached a group of emergency service workers for the latest information.Lena said her family had felt \"lost\" - relying on a battery-powered radio for updates.They have been cooking on a camping stove at home while trying to make sure their water pipes didn't freeze.Reinhold, 79, was still without power on Wednesday morning and going to his daughter's house to get warm.\"But I always came back to sleep here even in the cold weather with a bobble hat on and sweater and a woollen blanket.\"The retired architect said that he was used to hardship having been born in post-war Germany.\"I was born in 1947. When my mother and I came from the hospital... it was -20C in our shack.\"My parents took turns every hour to see whether my hands were tucked in under the cover so my fingers wouldn't freeze off.\"Reinhold has been sleeping in a woolly hat to keep warm at nightRestoring electricity was happening on a \"step-by-step basis\", said fire service spokesman Adrian Wentzel.Resources have been pulled in from across Germany, he told the BBC, with an estimated 100,000 people affected.Hospitals have had to rely on emergency generators while some schools have had to close.It was early on Saturday when several cables on a bridge were spotted burning near the Lichterfelde gas-fired power plant.Subsequently, the far-left Vulkangruppe - or Volcano Group - appeared to claim responsibility, saying its target was the fossil energy industry.\"We apologise to the less wealthy people in the south-west of Berlin,\" a lengthy statement read.\"With the many owners of villas in these districts, our sympathy is limited,\" it added, likely referring to the fact that Steglitz-Zehlendorf is one of Berlin's wealthiest neighbourhoods.However, a different statement was later published online on the Indymedia site - purportedly from Vulkangruppe's founders.\"We expressly distance ourselves from all actions of recent years,\" it said.AFP via Getty ImagesTraffic lights were cut off, tooAnother recent high-profile incident saw activists admit being behind a suspected arson attack that halted production at the huge Tesla factory just outside Berlin in 2024.The exact structure and workings of Vulkangruppe is unclear, but German authorities describe them as left-wing extremists and say attacks have happened at irregular intervals since 2011 in Berlin and the surrounding state of Brandenburg.Domestic intelligence state that the group's aim is to disrupt \"the day-to-day functions in order to harm the hated capitalist system\".Federal prosecutors are investigating the latest incident as a terrorism offence, with possible charges including \"membership in a terrorist organisation, sabotage, arson and disruption of public services\".This week's outage was larger and lasted longer than a similar incident in September.Plans for a federal law to protect critical infrastructure have been in the works for years but were only presented to the German parliament in November.The \"Kritis\" bill sets out plans to identify key critical infrastructure transport as well as introduce minimum protection standards.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Berlin outage highlights German vulnerability to sabotage",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5326/live/242f1540-ebec-11f0-8608-ef259671aea9.jpg"
      ],
      "datePublished": "2026-01-07T17:17:34.000Z",
      "dateModified": "2026-01-07T17:17:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zelensky says Ukraine does not have clear security pledge from allies",
    "url": "https://www.bbc.com/news/articles/cgm4yeexmg2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7841/live/db5d25e0-ebdd-11f0-b385-5f48925de19a.jpg",
    "tag": "World",
    "date": "2026-01-07T16:06:28.000Z",
    "description": "12 hours agoPaulin KolaReutersThe war in Ukraine is nearing its fourth anniversaryUkrainian President Volodymyr Zelensky says European allies have not",
    "body": "12 hours agoPaulin KolaReutersThe war in Ukraine is nearing its fourth anniversaryUkrainian President Volodymyr Zelensky says European allies have not given him sound guarantees that they will protect his country in the case of a new Russian aggression.\"I am asking this very question to all our partners and I have not received a clear, unambiguous answer yet,\" he told reporters on Wednesday.His comments come a day after the UK and France signed a declaration of intent on deploying troops in Ukraine if a peace deal to end the war with Russia is agreed.But full security guarantees have not been agreed. The US, which has been leading efforts to end the invasion, reportedly did not sign such a pledge at talks in Paris on Tuesday.After the Paris talks, which included some 30 countries that form the so-called Coalition of the Willing, UK Prime Minister Sir Keir Starmer said the UK and France would \"establish military hubs across Ukraine\" to deter future invasion, while French President Emmanuel Macron later said thousands of troops may be deployed.Allies proposed that the US would take the lead in monitoring a truce. But the key issue of territorial concessions that Ukraine is being asked to grant to Russia as part of the peace proposals are still being discussed.Moscow has not yet commented on the announcement made in the French capital.Russian President Vladimir Putin launched a full-scale invasion of Ukraine in February 2022, and Moscow currently controls about 20% of Ukrainian territory.Sir Keir described the joint statement as \"a vital part of our commitment to stand with Ukraine for the long-term\".He added: \"It paves the way for the legal framework under which British, French and partner forces could operate on Ukrainian soil, securing Ukraine's skies and seas, and regenerating Ukraine's armed forces for the future.\"Zelensky hailed that agreement as a \"huge step forward\".A day later, however, he appeared less optimistic.\"I see the will, the political will, and that the partners are ready, and the partners are ready to give us strong sanctions, strong security guarantees,\" he said when asked if European countries would defend Ukraine.\"But as long as we don't have such security guarantees - legally binding, supported by parliaments, supported by the United States Congress - this question cannot be answered. And even if they do, you still have to rely primarily on your own strength.\"The Paris talks were also notable owing to the presence of US President Donald Trump's peace envoys, Steve Witkoff and Jared Kushner.Witkoff said the allies \"largely finished\" their work on agreeing security protocols.EPA/ShutterstockRussia continues to strike Ukrainian cities and critical infrastructure across the country on a daily basisLast week, Zelensky said a peace deal was \"90% ready\". Territorial concessions and security guarantees have been at the forefront of unresolved issues for negotiators.Putin has repeatedly warned that Ukrainian troops must withdraw from all of Ukraine's eastern Donbas or Russia will seize it, rejecting any compromise over how to end the war.Zelensky has so far ruled out ceding any territory, but has suggested that Ukraine could withdraw its troops to an agreed point - but only if Russia did the same.Moscow currently controls about 75% of the Donetsk region, and some 99% of the neighbouring Luhansk. The two regions form the industrial Donbas region.It has been intensifying attacks against Ukrainian cities - particularly targeting energy infrastructure. Russia has also made slow progress in capturing more Ukrainian territory.Ukraine has hit back at Russian targets with drones, albeit with more limited success.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zelensky says Ukraine does not have clear security pledge from allies",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7841/live/db5d25e0-ebdd-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-07T16:06:28.000Z",
      "dateModified": "2026-01-07T16:06:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rare mountain gorilla twins born in DR Congo's Virunga National Park",
    "url": "https://www.bbc.com/news/articles/c86v3y45pyyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cdef/live/fa2e8c30-ebc3-11f0-b385-5f48925de19a.jpg",
    "tag": "World",
    "date": "2026-01-07T14:53:32.000Z",
    "description": "A pair of twin mountain gorillas has been born in the eastern Democratic Republic of Congo - a rare occurrence for the endangered primates, conservati",
    "body": "A pair of twin mountain gorillas has been born in the eastern Democratic Republic of Congo - a rare occurrence for the endangered primates, conservationists at Virunga National Park say.The community trackers, who discovered 22-year-old Mafuko hugging her newborns on Saturday, said the mother and her two baby sons all appeared to be well and healthy. Twin births are thought to account for about 1% of all mountain gorilla births, though exact data is not widely available.Virunga, situated in a conflict-prone part of DR Congo, is Africa's oldest and largest national park and was set up 100 years ago to protect mountain gorillas of which there are fewer than 1,100 left in the wild.They are only found in the Virunga and in national parks over the border in Rwanda and Uganda, according to the International Union for the Conservation of Nature (IUCN), which compiles a Red List of threatened species.The last birth of mountain gorilla twins in Virunga National Park was in September 2020.Mafuko herself gave birth to twins in 2016, but they both died within a week.Young gorillas rely entirely on their mothers for care and transport - and are extremely vulnerable in what can be a dangerous environment where poachers and many armed groups operate.The authorities at the park say additional monitoring and protection measures have been put in place to ensure the twins' survival during this critical period. Rangers would closely observe the young family and provide support if needed, they said.A gorilla's pregnancy lasts for about eight-and-a-half months, and females usually give birth to one infant every four years. According to Virunga conservationists, Mafuko has had a remarkable history of survival herself.Born in 2003 into the Kabirizi family, she lost her mother to armed attackers when she was four years old. She joined the Bageni family when she was 10 - and to date has been pregnant and given birth five times.Conservationists at Virunga, which is a Unesco World Heritage Site, say her latest offspring represent a significant boost for efforts to protect the endangered species.Thanks to anti-poaching patrols and community programmes - supported by the European Union and Unesco - mountain gorilla numbers in Virunga have slowly increased over the past decade.This success, which is documented by the IUCN and other partners, led to their status being upgraded from \"critically endangered\" to \"endangered\" in 2018.Virunga spans 7,800 sq km (3,000 sq miles) and is home to an astonishingly diverse landscape - from active volcanoes and vast lakes to rainforest and mountains.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rare mountain gorilla twins born in DR Congo's Virunga National Park",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cdef/live/fa2e8c30-ebc3-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-07T14:53:32.000Z",
      "dateModified": "2026-01-07T14:53:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump actively discussing potentially buying Greenland, White House says",
    "url": "https://www.bbc.com/news/articles/cly39pgmvrzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3eaa/live/60583660-ec09-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-07T19:39:42.000Z",
    "description": "US President Donald Trump and his officials are \"actively\" discussing a potential offer to buy the Danish territory of Greenland, the White House has ",
    "body": "US President Donald Trump and his officials are \"actively\" discussing a potential offer to buy the Danish territory of Greenland, the White House has confirmed.It is \"something that's currently being actively discussed by the president and his national security team\", White House spokeswoman Karoline Leavitt told reporters on Wednesday.Both Greenland and Denmark have repeatedly stressed the island was not for sale.Asked why the Trump administration had previously said it was not ruling out using military force to acquire Greenland, Leavitt replied that all options were always on the table but Trump's \"first option always has been diplomacy\".Concerns over the future of the territory resurfaced after Trump's unilateral use of military force against Venezuela on Saturday to seize its President Nicolás Maduro. Denmark, a fellow Nato ally, says an attack on its territory would end the military alliance. The Trump administration says Greenland is vital to US security. Despite being the most sparsely populated territory, its location between North America and the Arctic makes it well placed for early warning systems in the event of missile attacks, and for monitoring vessels in the region.Pituffik Space Base, formerly known as Thule Air Base, has been operated by the US since World War 2.In recent years, there has also been increased interest in Greenland's natural resources, including rare earth minerals, uranium and iron that are becoming easier to access as its ice melts due to climate change. Scientists think it could also have significant oil and gas reserves.US Secretary of State Marco Rubio said on Wednesday that he will hold talks with Denmark next week.Trump previously made an offer to buy the island in 2019, during his first presidential term, only to be told it was not for sale.\"The acquisition of Greenland by the United States is not a new idea,\" Leavitt said.\"The president has been very open and clear with all of you and with the world, that he views it in the best interest of the United States to deter Russian and Chinese aggression in the Arctic region, and so that's why his team is currently talking about what a potential purchase would look like.\"The White House said earlier this week that Trump had been discussing a range of options to acquire Greenland, including using military force.\"All options are always on the table for President Trump as he examines what's in the best interests of the United States,\" Leavitt said.Earlier in the day, French Foreign Minister Jean-Noël Barrot said Rubio had \"ruled out the possibility of an invasion\" of Greenland in a phone call with him.Barrot is due to discuss the Arctic island with his German and Polish counterparts later on Wednesday.On Tuesday, European leaders issued a joint statement rallying behind Denmark.\"Greenland belongs to its people, and only Denmark and Greenland can decide on matters concerning their relations,\" the leaders of France, the UK, Germany, Italy, Poland, Spain and Denmark said in a joint statement.Stressing they were as keen as the US on Arctic security, the European signatories said this must be achieved by Nato allies, including the US, \"collectively\".They also called for \"upholding the principles of the UN Charter, including sovereignty, territorial integrity and the inviolability of borders\".A day after the US military action in Venezuela, Katie Miller, the wife of one of Trump's senior aides, posted a map on social media of Greenland in the colours of the US flag, alongside the word \"SOON\".On Monday, her husband, Stephen Miller, said it was \"the formal position of the US government that Greenland should be part of the US\".Aaja Chemnitz, one of two MPs in the Danish parliament representing Greenland, told the BBC that the comments from the Trump administration were \"a clear threat\".\"It's completely disrespectful from the US side to not rule out annexing our country and to annex another Nato ally,\" she said.But Chemnitz said she saw this as unlikely - instead, \"what we are going to see is that they will put pressure on us in order to make sure that they will take over Greenland over time\".Aleqatsiaq Peary, a 42-year-old Inuit hunter living in Greenland's remote northerly town of Qaanaaq, appeared indifferent to the potential of US ownership.\"It would be switching from one master to another, from one occupier to another,\" he told the BBC. \"We are a colony under Denmark. We are already losing a lot from being under the Danish government.\"Saying that he did not have \"time for Trump\", he added that people were \"in need\". Hunters like him, he explained, hunted with dogs on the sea ice and fish \"but the sea ice is melting and hunters cannot make a living anymore\".Additional reporting by Adrienne Murray in Copenhagen",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump actively discussing potentially buying Greenland, White House says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3eaa/live/60583660-ec09-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-07T19:39:42.000Z",
      "dateModified": "2026-01-07T19:39:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]