[
  {
    "title": "German nurse jailed for murder may face inquiry into 100 more deaths",
    "url": "https://www.bbc.com/news/articles/ckgjjy55x2mo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/10c1/live/28fe61f0-f7b0-11f0-b385-5f48925de19a.jpg",
    "tag": "World",
    "date": "2026-01-22T18:12:14.000Z",
    "description": "10 hours agoBethany BellandRachel HaganAn ex-nurse convicted of murdering 10 patients in western Germany may be linked to more than 100 additional dea",
    "body": "10 hours agoBethany BellandRachel HaganAn ex-nurse convicted of murdering 10 patients in western Germany may be linked to more than 100 additional deaths, an official has said.The chief public prosecutor in Aachen, Katja Schlenkermann-Pitts, told the BBC  that there was \"a correspondingly high number of suspicious cases\" under review.She cautioned that the cases represented preliminary suspicions and that some could be dismissed following forensic examination.In November last year, a regional court in Aachen convicted the former palliative care nurse, who has not been publicly named, of 10 counts of murder and 27 counts of attempted murder, sentencing him to life imprisonment.The court found that during night shifts at a hospital in Würselen, the man had administered excessive doses of sedatives and painkillers to seriously ill patients without medical justification.Prosecutors said the drugs were sometimes given repeatedly and that the defendant was aware of the potentially fatal consequences. Judges concluded that the actions were driven by personal unease and a desire to impose order during night shifts.The defendant denied the charges during the trial in Aachen, stating that he had intended to help patients sleep and had not believed the medication posed a lethal risk given their underlying illnesses. But prosecutors told the court that he showed \"irritation\" and a lack of empathy to patients who required a higher level of care, and accused him of playing \"master of life and death\".The offences examined in the initial trial occurred between December 2023 and May 2024 at the Rhein-Maas hospital in Würselen, where the nurse had worked since 2020.The newly identified suspected cases relate largely to earlier periods.As part of the expanded inquiry, investigators have ordered around 60 exhumations. Twenty seven have already been carried out, with roughly 30 more pending.Schlenkermann-Pitts said autopsy results were still outstanding in many cases and would determine whether further charges could be brought.\"Of course, they may still be dropped,\" she cautioned.Prosecutors in Cologne are also examining deaths linked to hospitals where the nurse worked before his transfer to Würselen, 65km (40 miles) away.Two exhumations have taken place so far, including the remains of a 94 year old woman who died in 2018, and a 78 year old patient who died in 2015. Further exhumations have been ordered.Prosecutors in both Aachen and Cologne said preparations for potential new charges were under way, but officials said that any further proceedings were unlikely to begin before 2027.The case bears similarity to that of former nurse Niels Högel, who was handed a life sentence in 2019 after he was convicted of murdering 85 patients at two hospitals in northern Germany.Högel is believed to be the most prolific killer in Germany's modern history.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "German nurse jailed for murder may face inquiry into 100 more deaths",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/10c1/live/28fe61f0-f7b0-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-22T18:12:14.000Z",
      "dateModified": "2026-01-22T18:12:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US optimistic on end to war as Zelensky says Ukraine to talk to US and Russia",
    "url": "https://www.bbc.com/news/articles/c4g44r22j5jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/278e/live/4fd79780-f7d1-11f0-96f6-e58e07ac2c27.jpg",
    "tag": "World",
    "date": "2026-01-22T17:37:26.000Z",
    "description": "'It's all about the land': Zelensky says Ukraine to talk to US and Russia11 hours agoPaul KirbyEurope digital editorEPAPresident Volodymyr Zelensky sa",
    "body": "'It's all about the land': Zelensky says Ukraine to talk to US and Russia11 hours agoPaul KirbyEurope digital editorEPAPresident Volodymyr Zelensky says trilateral talks on ending the war in Ukraine are to take place with Russia and the US in the United Arab Emirates, after he met  President Donald Trump in Davos.As the diplomatic pace appeared to intensify, Trump said his meeting with Zelensky was good, and US envoy Steve Witkoff headed to Moscow for talks with Russia's Vladimir Putin.Witkoff, who was travelling to Moscow with Trump's son-in-law Jared Kushner, said he was optimistic about a deal.\"I think we've got it down to one issue and we have discussed iterations of that issue, and that means it's solvable,\" he said before leaving the Swiss resort.Trump's envoy gave no details about the remaining sticking point, but Zelensky later clarified that the future status of eastern Ukraine remained the unsolved issue.He made clear that the planned talks in the Emirates would involve Russia as well as the US and Ukraine, adding that \"the Russians have to be ready for compromises, not only Ukraine\".\"It's all about the land. This is the issue which is not solved yet,\" Zelensky told reporters at the World Economic Forum in Davos, Switzerland - adding that trilateral talks might provide the two sides with \"variants\".The US proposal for Ukraine's industrial heartland in Donbas is for a demilitarised and free economic zone in exchange for security guarantees for Kyiv.\"If both sides want to solve this, we're going to get it solved,\" Witkoff said, explaining that he would be heading to Abu Dhabi after Moscow, where working groups would be covering military issues as well as economic prosperity.Zelensky also told reporters that he had reached an agreement with Trump on future US security guarantees for Ukraine in the event of a deal. He gave no details but said it would need to go before the US Congress and Ukrainian parliament before signing.Although he said the \"Coalition of the Willing\", led by the UK and France, had committed forces on the ground to monitor the deal, he was adamant a Trump backstop would be necessary too: \"No security guarantees work without the US.\"Earlier he used his Davos speech to criticise his European allies for a lack of \"political will\" to take action against Russia.\"There are endless internal arguments and things left unsaid that stop Europe from uniting and speaking honestly enough to find real solutions,\" he said, drawing a contrast with the US under Trump.\"President Trump loves who he is, and he says he loves Europe, but he will not listen to this kind of Europe,\" he said.The Ukrainian president had travelled through the night to get to Davos.He had initially called off his trip to deal with the aftermath of Russian strikes on Kyiv's power infrastructure, which have left large areas of the capital without heating, water or power during the harshest winter so far in almost four years of Russia's full-scale war. Thousands of apartment blocks remain without heating.Zelensky said last month that a 20-point US plan to end the war was 90% ready and that Ukraine's position on Donbas, in eastern Ukraine, was different to Russia's.As part of the US 20-point plan, Zelensky has offered to withdraw troops by up to 40km (25 miles) from the 25% of the Donetsk region that Ukraine still controls in order to create an economic zone in Donbas, if Russia does the same. Kremlin spokesman Dmitry Peskov said on Thursday that discussions with the American envoys would continue \"on the Ukrainian issue and other related topics\" and refused to say whether he shared Witkoff's optimism on achieving a deal.Putin is known to covet control of the entire region, and Russian forces have advanced slowly in the east in the past year.Another big sticking point that Zelensky highlighted last month was future control of Ukraine's enormous Zaporizhzhia nuclear plant, seized by Russia in March 2022.Zelensky joked that he hoped the Emirates knew about the planned meeting, but in a measure of the seriousness of the talks he named some his most senior officials in the Ukrainian team taking part.The head of the country's national security and defence council, Rustem Umerov, was already talking to US officials in Davos, along with Kyrylo Budanov, the head of Zelensky's office, and negotiator David Arakhamia. They will be joined the chief of the general staff, Andrii Hnatov.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US optimistic on end to war as Zelensky says Ukraine to talk to US and Russia",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/278e/live/4fd79780-f7d1-11f0-96f6-e58e07ac2c27.jpg"
      ],
      "datePublished": "2026-01-22T17:37:26.000Z",
      "dateModified": "2026-01-22T17:37:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "France seizes suspected Russian 'shadow fleet' tanker in the Mediterranean",
    "url": "https://www.bbc.com/news/articles/cdexxr2y907o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fd99/live/53aae470-f7c2-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "World",
    "date": "2026-01-22T18:32:32.000Z",
    "description": "France says it has seized an oil tanker in the Mediterranean suspected of being part of Russia's sanction-busting \"shadow fleet\".French President Emma",
    "body": "France says it has seized an oil tanker in the Mediterranean suspected of being part of Russia's sanction-busting \"shadow fleet\".French President Emmanuel Macron said the tanker, named the Grinch, was \"subject to international sanctions and suspected of flying a false flag\".The French navy, with the assistance of allies including the UK, boarded the vessel on Thursday morning between Spain and Morocco. French maritime authorities said that a search of the vessel had \"confirmed the doubts as to the regularity of the flag\".Russia's embassy in Paris said it had not been informed of the seizure.Moscow's so-called shadow fleet is a clandestine network of tankers used to evade Western sanctions on Russian oil exports by shipping the oil on aged tankers with obscure ownership or insurance.The Grinch was travelling from the Arctic port of Murmansk in northern Russia when it was intercepted, French authorities said. The vessel had been flying a Comoros flag, according to ship tracking websites marinetraffic and vesselfinder.Announcing the seizure on X, Macron said: \"We are determined to uphold international law and to ensure the effective enforcement of sanctions.\"The activities of the \"shadow fleet\" contribute to financing the war of aggression against Ukraine,\" he said, adding that the vessel had been \"diverted\".Defence Secretary John Healy said the UK navy had provided \"tracking and monitoring\" support, with HMS Dagger monitoring the tanker through the Straits of Gibraltar.He added: \"Alongside our allies, we are stepping up our response to shadow vessels to choke off the funds that fuel Putin's illegal invasion of Ukraine.\"The UK has imposed sanctions on 544 Russian shadow fleet vessels. Ukrainian President Volodymyr Zelensky welcomed the action, saying it was \"exactly the kind of resolve needed to ensure that Russian oil no longer finances Russia's war\".\"Vessels must be apprehended. And wouldn't it be fair to confiscate and sell the oil carried by these tankers?\" he said on X.Speaking at Davos earlier, Zelensky exhorted Europe to do more to ensure its own security, saying: \"Europe loves to discuss the future but avoids taking action\".Many Western countries imposed sanctions on Russian energy following Russia's full-scale invasion of Ukraine in 2022.Earlier in January, British armed forces supported a US operation to seize a Russian-flagged tanker in the Atlantic that US officials said had broken sanctions by carrying oil for Venezuela and Russia. Moscow denounced the move, saying no state had the right to use force against vessels properly registered in other states' jurisdictions.Last October, France seized another sanctioned tanker, the Boracay, off its west coast before releasing it a few days later.Shadow fleets are becoming increasingly common, with Venezuela, Iran and Russia all accused of using them to avoid sanctions on oil.Financial intelligence firm S&P Global estimates that one in five oil tankers worldwide are used to smuggle oil from sanctioned countries. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "France seizes suspected Russian 'shadow fleet' tanker in the Mediterranean",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fd99/live/53aae470-f7c2-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-22T18:32:32.000Z",
      "dateModified": "2026-01-22T18:32:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UN to take over al-Hol camp for IS families in Syria after unrest ",
    "url": "https://www.bbc.com/news/articles/clyzzzd2y7do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/dcfc/live/072ac1b0-f7d6-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-22T22:46:15.000Z",
    "description": "The United Nations (UN) says it will take over management of a camp in north-eastern Syria holding holding thousands of people with alleged links to t",
    "body": "The United Nations (UN) says it will take over management of a camp in north-eastern Syria holding holding thousands of people with alleged links to the jihadist group Islamic State (IS).It comes after Kurdish-led forces that had been running the camp withdrew in the face of an advance by Syrian government forces, triggering unrest that forced aid agencies to suspend operations.Residents were reported to have rushed camp perimeters in an apparent attempt to escape, prompting unrest and looting.A ceasefire agreement has brought much of Syria's north-east under the control of Damascus, ending years of autonomous Kurdish rule.Briefing the UN Security Council on Thursday, UN official Edem Wosornu said the UN refugee agency UNHCR had \"taken over camp management responsibilities\" at al-Hol and was working with Syrian authorities to restore humanitarian access. Syrian forces, she said, had established a security perimeter around the camp.However, UN spokesman Stéphane Dujarric cautioned that conditions inside  remained \"tense and volatile\", with humanitarian operations still suspended following the violence.Meanwhile, the US has launched a parallel effort to remove high-risk detainees from the region altogether. US Central Command said on Wednesday that it had begun transferring up to 7,000 suspected IS fighters from prisons in northeast Syria to Iraq, confirming that 150 detainees had already been moved to a \"secure location\" across the border.Iraqi authorities said all transferred detainees would be prosecuted under Iraqi law. \"This is a measure aimed at protecting regional and international security from an imminent threat. Nevertheless, we stress that this issue should not be left to become a long-term strategic burden on Iraq alone,\" Iraq's deputy UN ambassador, Mohammed Sahib Mejid Marzooq, said. Syria's UN ambassador Ibrahim Olabi said the Syrian government welcomed the US operation to transfer IS detainees out of Syrian territory and was ready to offer support.Rights groups have warned that the transfers could expose detainees to serious abuses.The Reprieve charity said it believed up to ten British men could be among those transferred, along with juvenile detainees and urged the UK government to intervene urgently. Around 55 to 60 British nationals, most of them children, remain detained across camps and prisons in the region, it said.\"The prisoners transferred face being tortured, sentenced to death and executed, without being granted any meaningful opportunity to contest the allegations against them\", Katherine Cornett, Reprieve's deputy director told the BBC.The Kurdish-led Syrian Democratic Forces (SDF), US and UN have long called for the repatriation of foreign IS suspects and their families from north-eastern Syria, citing the political instability and dire conditions in the prisons and camps, but many countries have refused to take them.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UN to take over al-Hol camp for IS families in Syria after unrest ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/dcfc/live/072ac1b0-f7d6-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-22T22:46:15.000Z",
      "dateModified": "2026-01-22T22:46:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Australia: Three dead in New South Wales shooting",
    "url": "https://www.bbc.com/news/articles/c4g00mv29j5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4c24/live/c926a360-f7d6-11f0-96f6-e58e07ac2c27.jpg",
    "tag": "World",
    "date": "2026-01-22T22:38:48.000Z",
    "description": "6 hours agoTessa WongandAlicia CurryThree people have been killed and another injured after a shooting in a small town in New South Wales (NSW), Austr",
    "body": "6 hours agoTessa WongandAlicia CurryThree people have been killed and another injured after a shooting in a small town in New South Wales (NSW), Australia.Emergency services were called to a residential area in Lake Cargelligo at about 16:40 local time (05:40 GMT) on Thursday.Police are searching for Julian Ingram, 37, in connection with the killings.A man and woman were found shot dead in a vehicle, and a second shooting soon afterwards killed a woman and left a man in a \"critical condition\" in hospital, police said.Australian newspaper The Sydney Morning Herald reported that the incident was a suspected domestic violence attack and that one of the victims is believed to be Ingram's former partner.Andrew Holland, NSW police assistant commissioner, declined to comment on the relationship between the gunman and the victims.The public was urged to remain indoors and multiple crime scenes have been established, he told reporters.NSW police later released a photograph of Ingram and urged the public to get in contact with any information on his whereabouts.\"Any death in a small country town is confronting, but again, a scene where you have people shot by firearms is obviously going to make people very, very tense and very concerned,\" Holland said.\"The scene faced by the emergency services officers at that time would have been horrendous.\"Lake Cargelligo is located in the centre of New South Wales and has a population of about 1,500 people.The incident comes after last month's mass shooting at Sydney's Bondi Beach which killed 15 people.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australia: Three dead in New South Wales shooting",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4c24/live/c926a360-f7d6-11f0-96f6-e58e07ac2c27.jpg"
      ],
      "datePublished": "2026-01-22T22:38:48.000Z",
      "dateModified": "2026-01-22T22:38:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Japan suspends world's largest nuclear plant hours after restart",
    "url": "https://www.bbc.com/news/articles/cx2yy8z91n4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/90c0/live/b8085d90-f76c-11f0-b7ec-55c1cb544783.jpg",
    "tag": "World",
    "date": "2026-01-22T13:13:24.000Z",
    "description": "Japan has suspended operations at the world's largest nuclear power plant, hours after its restart, its operator has said.An alarm sounded \"during rea",
    "body": "Japan has suspended operations at the world's largest nuclear power plant, hours after its restart, its operator has said.An alarm sounded \"during reactor-start-up procedures\" at Kashiwazaki-Kariwa north-west of Tokyo but the reactor remained \"stable\", Tokyo Electric Power Company (Tepco) spokesperson Takashi Kobayashi said.Reactor number six restarted on Wednesday a day later than planned due to an alarm malfunction - the first at the plant to be turned on since the 2011 Fukushima disaster.Japan shut down all of its 54 reactors after a 9.0 magnitude earthquake triggered a meltdown at its Fukushima plant 15 years ago, causing one of the worst nuclear disasters in history.At the time, radiation leakage from the plant forced more than 150,000 people to evacuate their homes. Many have not returned despite assurances it is now safe.Following the suspension of reactor number six on Thursday, Kobayashi said it was \"stable and there is no radioactive impact outside\".The reactor was initially set to start on Tuesday, but was pushed back due to a technical issue. It is due to begin operating commercially next month.Kobayashi said Tepco was \"currently investigating the cause\" of the incident and did not say when operations would resume. The seventh reactor at Kashiwazaki-Kariwa is not expected to be turned back on until 2030, while the other five could be decommissioned.This would leave the plant with far less capacity than it once had when all seven reactors were operational.Reactor number six was given the green light to restart despite safety concerns from local residents.A small crowd of people gathered outside Tepco's headquarters to protest last week, while hundreds gathered outside the Niigata prefectural assembly in December.Japan was an early adopter of nuclear power - before 2011, nuclear accounted for nearly 30% of its electricity and the country planned to get that up to 50% by 2030.After it was forced to shut them all down in the wake of the Fukushima disaster, it has spent the past decade attempting to revive the plants as part of its goal to reach net zero emissions by 2050.Since 2015, Japan has restarted 15 out of its 33 operable reactors.An earlier version of this story said the Kashiwazaki-Kariwa nuclear plant was in Tokyo and has been corrected to say it is north-west of Tokyo.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Japan suspends world's largest nuclear plant hours after restart",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/90c0/live/b8085d90-f76c-11f0-b7ec-55c1cb544783.jpg"
      ],
      "datePublished": "2026-01-22T13:13:24.000Z",
      "dateModified": "2026-01-22T13:13:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Noida: Outrage over Yuvraj Mehta's death in dug-up pit after begging for help for hours",
    "url": "https://www.bbc.com/news/articles/c620l5e2q1vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0d87/live/cb9594e0-f744-11f0-b16c-8b86831c9765.jpg",
    "tag": "World",
    "date": "2026-01-22T06:49:44.000Z",
    "description": "Outrage after Indian man drowns in open pit after begging for help for hours22 hours agoCherylann MollanMumbaiBBCYuvraj Mehta's body was recovered hou",
    "body": "Outrage after Indian man drowns in open pit after begging for help for hours22 hours agoCherylann MollanMumbaiBBCYuvraj Mehta's body was recovered hours after he fell into a waterlogged pit in NoidaThe death of a 27-year-old Indian IT professional after his car fell into an unmarked construction pit has raised questions around urban planning and road safety in India.Last Friday, at around midnight, Yuvraj Mehta was driving home in Noida, a suburb of the capital Delhi, through dense winter fog when his car reportedly hit a low boundary wall and plunged into the deep pit full of water. The site had reportedly been dug up a few years ago before work was stalled.Mehta, who didn't know how to swim, climbed on to the roof of his car as it began to sink and rang his father who rushed to the scene and alerted the emergency services. His father told reporters that Mehta remained there for close to two hours, flashing the torch on his phone and shouting for help.Then, his cries stopped. By the time authorities recovered his body, almost five hours had passed since the accident, local media reported.Mehta's tragic death has made national headlines, and the fact that it happened so close to the capital city has shocked and angered residents. Protests have been held at the accident site, with demonstrators accusing authorities of negligence and demanding accountability.His death has also fuelled larger questions about the state of Indian roads and urban planning.\"Noida techie's [Mehta's] death is essentially a murder. Dreams shattered. Hard work gone in vain. Father's hopes buried. All because of a failed system,\" one user wrote on X.\"This tragedy raises deeper questions about the quality of infrastructure in even big cities like Noida,\" said another.Some users shared their own experiences of accidents because of bad roads, lack of adequate signage and poor lighting after dark. Some also complained about open drains and construction sites on roads close to their homes becoming death traps, especially for children and the elderly.ANIAfter the accident, police have erected barricades near the construction pitSince the accident, police in Noida have registered two cases against the real estate developers of the construction site where the pit was located following a complaint from Mehta's family.On Sunday, the government of Uttar Pradesh state, where Noida is located, removed a senior official from the township's governing authority and ordered an investigation into the circumstances surrounding the rescue operation and site safety.Since then, police have arrested Abhay Kumar, one of the owners of the construction site, for alleged culpable homicide due to negligence under India's criminal code. Kumar is in custody and has not commented on the allegations.Police have said that further investigations are under way and that more arrests are likely in the coming days.In media interviews, Mehta's father Rajkumar has said that he received a call from his son soon after the accident happened. He rushed to the spot but said that the site was pitch dark and shrouded in fog, and that his son was barely visible in the murky waters.He alerted the police and the fire brigade and said that rescue teams arrived at the site shortly after. But he alleged that his son remained stranded for hours because they did not have the resources to pull him out. He added that his son's life could have been saved if trained divers were sent to retrieve him, but that did not happen. \"He was constantly saying, 'Papa mujhe bacha lo' [Papa save me] during his last hours,\" Rajkumar Mehta told NDTV news channel.Getty ImagesMany roads in India are in a bad shapeMoninder, who goes by one name and is a delivery worker for an e-commerce platform, was passing by and reportedly made a brave attempt to save Mehta. He tied a rope around his waist and jumped into the freezing water to pull him out, he told Hindustan Times newspaper..He added that he searched for Mehta for 30-40 minutes but couldn't locate him. He also alleged that emergency responders weren't willing to step inside the water, saying that it was too cold and that there were iron rods inside the pit.Noida's additional commissioner of police Rajeev Narain Mishra told the media that the incident was \"unfortunate\" but denied negligence.\"Police and fire department teams made efforts to save the youth. A fire department crane, ladder, makeshift boat and searchlights were used, but there was zero visibility at the time,\" he told Times of India newspaper and added that further investigation was under way.Hemant Upadhyay, assistant commissioner of police for Noida, told British newspaper The Independent that no-one was sent into the pit because officers were concerned about further casualties if untrained personnel were sent in.\"The water was very deep, visibility was poor and there were concerns about submerged debris,\" he said.Follow BBC News India on Instagram, YouTube, Twitter and Facebook.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Noida: Outrage over Yuvraj Mehta's death in dug-up pit after begging for help for hours",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0d87/live/cb9594e0-f744-11f0-b16c-8b86831c9765.jpg"
      ],
      "datePublished": "2026-01-22T06:49:44.000Z",
      "dateModified": "2026-01-22T06:49:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ubisoft cancels six games including Prince of Persia and closes studios",
    "url": "https://www.bbc.com/news/articles/c6200g826d2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d4a3/live/c839a060-f78b-11f0-901d-31b29a84f7aa.png",
    "tag": "World",
    "date": "2026-01-22T12:20:32.000Z",
    "description": "16 hours agoLiv McMahonTechnology reporterUbisoft has cancelled six video games - including its long-awaited Prince of Persia: The Sands of Time remak",
    "body": "16 hours agoLiv McMahonTechnology reporterUbisoft has cancelled six video games - including its long-awaited Prince of Persia: The Sands of Time remake - as part of a \"major reset\" of its operations.The French developer and publisher, known for popular games such as Assassin's Creed, Far Cry and Just Dance, has closed two studios and delayed seven titles as part of its changes.Ubisoft boss Yves Guillemot said the move would \"create the conditions for a return to sustainable growth\".The firm's shares plunged by 33% on Thursday morning following the announcement.The move comes at a time when studios are increasingly turning to video game remakes and remasters, with new versions of Super Mario Galaxy, Oblivion and Metal Gear Solid 3 proving popular in 2025.So the decision to bin the remake of Sands of Time - which sold millions of copies in 2003 - has left many fans scratching their heads.Ubisoft has not specified which titles it has discontinued alongside the Prince of Persia remake.But it says among them are four unannounced titles, including three based on new intellectual property, and a mobile game.Ubisoft has closed its studios in Stockholm, Sweden and Halifax, Canada as part of the move, which will include restructuring three others.The developers were working on a new intellectual property (IP) and mobile titles for Assassin's Creed, respectively.The closure of Ubisoft Halifax was previously announced in January - the same week the studio formed a union.  \"While these decisions are difficult, they are necessary for us to build a more focused, efficient and sustainable organisation over the long term,\" Guillemot said.\"Taken together, these measures mark a decisive turning point for Ubisoft and reflect our determination to confront challenges head-on to reshape the Group for the long term\".Gaming industry analyst Piers Harding-Rolls told the BBC the move indicated the firm was trying to mitigate risk.\"It's less risky to maintain scale by investing in existing big franchises such as Assassin's Creed and Rainbow Six than launch entirely new IPs and that's reflected in the cancellation of a number of games based on new IPs,\" he said.It is the second restructure from Ubisoft in subsequent years, after the firm cut 185 jobs across Europe in 2025.In the UK, it closed its office in Leamington and restructured another in Newcastle-upon-Tyne.Guillemot said the new move was in part due to a competitive market for triple-A games - blockbuster titles which cost millions to develop and dominate large studios' offerings.\"On the one hand, the triple-A industry has become persistently more selective and competitive with rising development costs and greater challenges in creating brands,\" he said in a statement on Wednesday.Such big offerings are increasingly facing delays - with Grand Theft Auto VI pushed back for a second time to November 2026.But Guillemot said despite these hurdles, successful blockbuster games could bring \"more financial potential than ever\".\"In this context, today we are announcing a major reset built to create the conditions for a return to sustainable growth over time,\" he said.Ubisoft will now focus on developing open world adventure games - which let players freely navigate vast environments - and live service games which seek regular payments from players.The firm said its subsidiary Vantage Studios, created after a €1.25bn ($1.25bn; £1bn) investment from Chinese tech giant Tencent, would aim to turn Assassin's Creed, Far Cry and Rainbow Six \"into annual billionaire brands\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ubisoft cancels six games including Prince of Persia and closes studios",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d4a3/live/c839a060-f78b-11f0-901d-31b29a84f7aa.png"
      ],
      "datePublished": "2026-01-22T12:20:32.000Z",
      "dateModified": "2026-01-22T12:20:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Son-in-law of Venezuelan opposition candidate freed from jail, wife says",
    "url": "https://www.bbc.com/news/articles/cq5yywx39e7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ec87/live/1cd4fb80-f780-11f0-a454-dd9f56c864fe.jpg",
    "tag": "World",
    "date": "2026-01-22T11:35:20.000Z",
    "description": "17 hours agoVanessa BuschschlüterLatin America editor, BBC News OnlineRafael Tudares, the son-in-law of Venezuelan opposition candidate Edmundo Gonzál",
    "body": "17 hours agoVanessa BuschschlüterLatin America editor, BBC News OnlineRafael Tudares, the son-in-law of Venezuelan opposition candidate Edmundo González, has been released from prison, his wife has said, more than a year after he was detained as part of a crackdown on Maduro government critics and their relatives.Mariana González said her husband had returned home after \"380 days of unjust and arbitrary detention\".Tudares is one of more than 150 detainees who have been released since the US military seized Venezuelan leader, Nicolás Maduro, in a nighttime raid and took him to New York to stand trial on drug-trafficking charges.An NGO lobbying for the release of Venezuelan political prisoners warns that 777 still remain behind bars.Tension within the country remains high with Maduro's former vice-president, Delcy Rodríguez, now in power having been sworn in as the acting president.Her interim government has received the backing of US President Donald Trump, who has praised Rodríguez for agreeing to \"turn over\" up to 50 million barrels of Venezuelan oil to the US.The release of political prisoners had been among the first things the Trump administration had pushed Venezuela's interim government to do.Just five days after the US raid, the head of Venezuela's National Assembly announced that \"an important number of people\" would be freed as \"a gesture of peace\".However, rights groups have denounced the slow pace of the releases and the fact that the number given by officials - 400 - falls far short of what they have been able to confirm. The NGO Foro Penal says it has so far only been able to verify the release of 151 political prisoners since 8 January, when the head of Venezuela's National Assembly announced that \"an important number of people\" would be freed as \"a gesture of peace\" following the US operation.Foro Penal has also said that many those released have not had the charges against them dropped, leaving them in legal limbo, and have been barred from speaking in public. Tudares's imprisonment was one of the emblematic cases of the repression which followed in the wake of Venezuela's 2024 presidential election.His father-in-law, González, became the main challenger of the incumbent Maduro after the well-known opposition leader María Corina Machado was barred from running.Fearing the Maduro government would resort to fraud to rig the result, González and Machado mobilised hundreds of people to act as observers at the polling stations and collect the tallies from the electronic voting machines. The electoral council, dominated by government loyalists, declared Maduro the winner but never provided the detailed voting tallies to back up its claim.The voting tallies collected by the observers deployed by the opposition and independently verified by the Carter Center, however, suggested that González had won by a landslide. Nevertheless, Maduro - who was firmly in control of the state institutions, including the armed forces and the police - was sworn in for another term in January 2025.In the run-up to his inauguration, many opposition leaders and activists were seized by the security forces in an attempt to stifle any dissent.Fearing arrest, González had sought refuge in the Dutch embassy as early as September 2024 and gone in to exile in Spain shortly afterwards.Three days before Maduro's inauguration, González's 46-year-old son-in-law - a lawyer who was not involved in politics - was seized by hooded men as he was taking his young children to see their ailing grandmother. For months, his family did not know where he was being held or on what grounds he had been seized.Last month, his wife said she had learned that he had been sentenced to 30 years in prison for \"terrorism and conspiracy\". She said her access was not allowed to choose a lawyer and had only been allowed to read the charges levelled against him on the day of his \"only hearing\".Mariana González told El Pais newspaper that she had been approached on at least three occasions by middlemen who told her that her husband would only be allowed to return to his family if her father renounced his cause. \"This has nothing to do with justice,\" she said at the time. \"Being the son-in-law of Edmundo González is not a crime,\" she added.Mariana González took to X to thank all of the people who had supported her in her fight for her husband's release. But she also reminded readers that there were still many families waiting for the release of their loved ones who, she said, had been \"forcibly disappeared, arbitrarily detained and unjustly locked up.Many of them have been holding vigils outside the main prisons in Venezuela in the hope that their relatives will be among those released in the wake of the US military raid.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Son-in-law of Venezuelan opposition candidate freed from jail, wife says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ec87/live/1cd4fb80-f780-11f0-a454-dd9f56c864fe.jpg"
      ],
      "datePublished": "2026-01-22T11:35:20.000Z",
      "dateModified": "2026-01-22T11:35:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Muwanga Kivumbi: Ugandan MP and Bobi Wine ally arrested over election violence",
    "url": "https://www.bbc.com/news/articles/cq844z9y4q9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a251/live/20cfee80-f78e-11f0-8415-2b8404a6e040.jpg",
    "tag": "World",
    "date": "2026-01-22T13:14:04.000Z",
    "description": "Ugandan police have detained a lawmaker, and close ally of opposition leader Bobi Wine, for his alleged role in election-related violence last week.Mu",
    "body": "Ugandan police have detained a lawmaker, and close ally of opposition leader Bobi Wine, for his alleged role in election-related violence last week.Muwanga Kivumbi, a deputy leader of Wine's National Unity Platform (NUP), is accused of organising attacks on a police station and a vote-tallying centre after their electoral loss, which the party denies.The police have said that seven people were killed in the incident, but the politician has given a different account, saying that 10 people were killed at his home as they waited for parliamentary election results.The Uganda Police Force said in a post on X on Thursday that Kivumbi would be \"arraigned before court in due course\".\"His arrest is in connection with recent incidents of political violence,\" it added.Kivumbi's arrest follows tensions after last week's elections in which President Yoweri Museveni was re-elected for a seventh term.During his victory speech over the weekend, Museveni warned opposition figures including Kivumbi of coordinated plans to attack polling stations.He said seven people were shot dead by police after groups of alleged opposition supporters, armed with machetes, attempted to carry out violent attacks in Butambala district outside the capital, Kampala.Wine, Museveni's closest challenger and who is in hiding after fleeing a raid on his house after the elections, has denounced the results as \"fake\", citing electoral fraud.He has also alleged that there was \"silent massacre\" under way and a crackdown targeting political activists.On Tuesday, he posted on social media that more than 100 people had been killed in election violence, without stating evidence.This came after Uganda's army chief Gen Muhoozi Kainerugaba, who is also Museveni's son and his potential successor, said the security forces had killed 22 opposition supporters during poll-related violence.Since the election, Ugandan authorities have reportedly arrested dozens of youths on various charges linked to election-related incidents in Kampala.Museveni first came to power as a rebel leader in 1986. He will have served for 45 years when the next term ends in 2031.Uganda has not witnessed a peaceful transfer of presidential power since independence.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Muwanga Kivumbi: Ugandan MP and Bobi Wine ally arrested over election violence",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a251/live/20cfee80-f78e-11f0-8415-2b8404a6e040.jpg"
      ],
      "datePublished": "2026-01-22T13:14:04.000Z",
      "dateModified": "2026-01-22T13:14:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump sparks anger with claim Nato troops avoided Afghanistan front line",
    "url": "https://www.bbc.com/news/articles/czr444j671vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/856e/live/26d1cf40-f803-11f0-abbc-b5531d9ce926.jpg",
    "tag": "World",
    "date": "2026-01-23T01:34:42.000Z",
    "description": "3 hours agoMaia DaviesWatch: Labour and Conservative MPs criticise Trump Afghanistan remarksDonald Trump has sparked fresh outrage in the UK after say",
    "body": "3 hours agoMaia DaviesWatch: Labour and Conservative MPs criticise Trump Afghanistan remarksDonald Trump has sparked fresh outrage in the UK after saying Nato troops stayed \"a little off the front lines\" during the war in Afghanistan.Labour MP Emily Thornberry, the chair of the foreign affairs committee, called it an \"absolute insult\" to the 457 British service personnel killed in the conflict, while Liberal Democrat leader Sir Ed Davey said: \"How dare he question their sacrifice?\"Conservative MP Ben Obese-Jecty, who served in Afghanistan, said it was \"sad to see our nation's sacrifice, and that of our Nato partners, held so cheaply\".The UK was among several allies to join the US in Afghanistan from 2001, after it invoked Nato's collective security clause following the 9/11 terror attacks.The US president told Fox News on Thursday that he was \"not sure\" the military alliance would be there for America \"if we ever needed them\".\"We've never needed them,\" he said, adding: \"We have never really asked anything of them.\"\"They'll say they sent some troops to Afghanistan,\" he said, \"and they did, they stayed a little back, a little off the front lines\".He said the US had \"been very good to Europe and to many other countries\", adding: \"It has to be a two-way street.\"Getty ImagesThornberry told the BBC's Question Time that the remarks were \"much more than a mistake\".\"It's an absolute insult... How dare he say we weren't on the front line, how dare he?\"We have always been there whenever the Americans have wanted us,\" she said, calling Trump \"a man who has never seen any action\" but was now \"commander in chief and knows nothing about how it is that America has been defended\".She said the US was the UK's \"friend\" but its leader had \"behaved in a way that is bullying, rude, that has deliberately been trying to undermine us, which has been trying to undermine Nato.\"On the same programme, Conservative shadow cabinet member Stuart Andrew also called the comments \"disgraceful\" and \"appalling\".\"There are many people in this country who served both in Iraq and Afghanistan, many of whom lost their lives, but also many more who came back with life-changing injuries and we should say thank you to them.\"He added that the UK-US special relationship was important for both defence and security, and that in recent weeks Trump had directed conversation to the security of the Arctic - where he said there was a \"very serious threat\".PA Media457 British service personnel were killed in the conflict in AfghanistanSir Ed wrote on social media that Trump had \"avoided military service\", adding: \"How dare he question their sacrifice?\"Speaking to BBC's Newsnight programme, Dutch foreign minister David van Weel rejected Trump's remarks as \"false\", saying \"Europeans shed blood\" in support of US troops in Afghanistan.He said Nato Secretary General Mark Rutte had rebuffed similar comments Trump made earlier, during a joint press conference the pair held at Davos on Thursday.Asked about the US president repeating the claim, van Weel, said: \"We should speak out for the truth as Mark Rutte did. And if he repeated it, we need to repeat it again because that's not how history went.\"Meanwhile, former British Army officer Obese-Jecty said it was \"sad to see our nation's sacrifice, and that of our Nato partners, held so cheaply by the president of the United States\".\"I saw first hand the sacrifices made by British soldiers,\" he wrote on X.\"I don't believe US military personnel share the view of President Trump; his words do them a disservice as our closest military allies.\"Calvin Bailey, a Labour MP and former RAF officer who served alongside US special operations units in Afghanistan, said the president's claim bore \"no resemblance to the reality experienced by those of us who served there\".\"As I reminded the US Forces I served with on 4 July 2008, we were there because of a shared belief, articulated at America's founding, that free people have inalienable rights and should not live under tyranny,\" he told the PA news agency.\"That belief underpinned the response to 9/11, and it is worth reflecting on now.\"The BBC approached the Ministry of Defence for comment. A spokesperson pointed to comments made by Defence Secretary John Healey while visiting Nato ally Denmark on Wednesday - before Trump's comments.He said: \"In Afghanistan, our forces trained together, they fought together, and on some occasions, they died together, making the ultimate sacrifice.\"The US invaded in October 2001 to oust the Taliban, whom they said were harbouring Osama Bin Laden and other al-Qaeda figures linked to the 9/11 attacks. Nato nations contributed troops and military equipment to the US-led war.More than 3,500 coalition soldiers had died as of 2021, when the US withdrew from the country - about two-thirds of them Americans.The UK suffered the second highest number of military deaths in the conflict behind the US, which saw 2,461 deaths.The US is the only country to have invoked the collective security provisions of Nato's Article 5, which states that \"an armed attack against one Nato member shall be considered an attack against them all\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump sparks anger with claim Nato troops avoided Afghanistan front line",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/856e/live/26d1cf40-f803-11f0-abbc-b5531d9ce926.jpg"
      ],
      "datePublished": "2026-01-23T01:34:42.000Z",
      "dateModified": "2026-01-23T01:34:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "ICE detains five-year-old and father in Minnesota, lawyer says",
    "url": "https://www.bbc.com/news/articles/cwyrrqwxpz7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e0a4/live/f1221070-f7b8-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "World",
    "date": "2026-01-22T23:54:22.000Z",
    "description": "US Immigration and Customs Enforcement (ICE) officers detained a five-year-old boy on Tuesday during an immigration enforcement operation, Minnesota s",
    "body": "US Immigration and Customs Enforcement (ICE) officers detained a five-year-old boy on Tuesday during an immigration enforcement operation, Minnesota school officials and the family's lawyer have said.Pre-schooler Liam Ramos was with his father - named by the Department of Homeland Security (DHS) as Adrian Alexander Conejo Arias - when Conejo Arias was approached by agents on his driveway. In a statement posted on X, the DHS said \"ICE did NOT target a child\", but was conducting an operation against his father, an \"illegal alien\" who \"abandoned\" his son when approached.Zena Stenvik, the Columbia Heights Public Schools superintendent, asked: \"Why detain a five-year-old? \"You can't tell me that this child is going to be classified as a violent criminal.\"In a post on X, ICE denied the child had been detained.\"A criminal illegal alien ABANDONED his child as he fled from ICE officers, and our officers ensured the child was kept SAFE in the bitter cold,\" the agency said. \"ICE made multiple attempts to get the family inside the house to take custody of the child. \"They refused to accept custody of the child. The father told officers he wanted the child to remain with him.\"DHS did not immediately respond to the BBC's request for comment.Photos provided to the BBC by the school district show a boy, identified as Liam Ramos, wearing a bunny-shaped winter hat, standing outside as an officer holds on to his backpack.The Columbia Heights Public Schools authority described these as bystander photos. The district did not identify the individuals who took the pictures, referring to them as \"known and confirmed community members\".Marc Prokosch, a lawyer representing the family, told a press conference on Thursday that Liam and his father were being held at a detention centre in San Antonio, Texas, and attorneys were trying to contact them. Prokosch said the boy and his father had come to the US in 2024 from Ecuador to seek asylum. \"This family was not eluding ICE in any way,\" he said. \"They were following all the established protocols.\"School officials said an agent asked the child to knock on the door of the home to see if anyone else was there.The boy had just arrived home from pre-school at the time, Stenvik told the press conference.She said another adult living in the home asked to take the young boy inside, but was refused. School board member Mary Granlund said she was on the scene and told immigration officials she could take Liam Ramos, but they still detained him. US Vice-President JD Vance, who visited Minnesota on Thursday amid ongoing protests against immigration enforcement, told reporters ICE had no choice because \"the father ran\". \"What are they supposed to do?\" he said of ICE agents. \"Are they supposed to let a five-year-old child freeze to death? \"Are they not supposed to arrest an illegal alien in the United States of America?\"He added: \"If the argument is that you can't arrest people who have violated laws because they have children. . . that doesn't make any sense.\"Watch: Father and 5-year-old \"did everything right\" in asylum process, says family attorneyStenvik said that ICE had recently detained a total of four students in her school district, including a 10-year-old, and two 17-year-olds.\"The onslaught of ICE activity in our community is inducing trauma,\" Stenvik told reporters. The DHS maintains it is arresting the \"worst of the worst criminal illegal aliens\" in an effort to restore public safety in Minnesota.At a DHS press conference on Tuesday, Gregory Bovino of the US Border Patrol said: \"Our operations are lawful, are targeted, and are focused on individuals who pose a serious threat to this community.\"The immigration enforcement initiative, dubbed Operation Metro Surge, has sparked outcry from residents in Minneapolis, St Paul and other cities in the state.On 7 January, a federal officer fatally shot a woman named Renee Good in Minneapolis, sparking protests and condemnation from local and state officials.The Trump administration alleged the 37-year-old was using her vehicle as a weapon and the officer acted in self-defence.Also on Thursday, seven Democrats in the US House of Representatives voted with Republicans to narrowly pass $1.2tn (£900bn) in funding for government agencies, including ICE. The measure - which would allocate $64.4bn to DHS, including $10bn for ICE - was approved 220-207. It must still pass the Senate.Democrats who voted in favour said they did so to fund the Transportation Security Administration and Federal Emergency Management Agency, both under DHS. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ICE detains five-year-old and father in Minnesota, lawyer says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e0a4/live/f1221070-f7b8-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-22T23:54:22.000Z",
      "dateModified": "2026-01-22T23:54:22.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South Africa gang violence: Firoz Cachalia says police not able to defeat gangsters",
    "url": "https://www.bbc.com/news/articles/cx2ll9wr562o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/93b0/live/7416edf0-f766-11f0-9ea1-2582126020d7.jpg",
    "tag": "World",
    "date": "2026-01-22T08:23:36.000Z",
    "description": "South Africa's Police Minister Firoz Cachalia has said that the security forces are not yet able to defeat deadly criminal gangs, in a stark admission",
    "body": "South Africa's Police Minister Firoz Cachalia has said that the security forces are not yet able to defeat deadly criminal gangs, in a stark admission that underscores the scale of the country's crime crisis. Gang violence, alongside robberies, accounts for many murders in South Africa, which has one of the world's highest homicide rates.Cachalia said gang violence had become increasingly complex, especially in the Eastern Cape and Western Cape provinces, requiring new strategies beyond traditional policing.\"I do not believe that we are currently in a position to defeat these gangs,\" the minister told journalists on Wednesday. South Africa, the continent's most industrialised nation, has long struggled with entrenched organised crime. Many people in South Africa own licensed firearms for personal protection, but there are many more illegal guns in circulation.Police data shows that an average of 63 people were killed each day between April and September last year.Speaking after his visit to crime-infested Nelson Mandela Bay in Eastern Cape, Cachalia said criminal gangs were on a \"killing spree\" in the two provinces. \"We had a discussion about the problem of organised crime in the Eastern Cape, including extortion rackets, gang violence and related issues,\" said the minister.  \"I indicated that this is a grave problem throughout the country, that these cartels wield significant wealth and power, and that this is deeply concerning,\" he added. Despite the creation of an anti-gang unit in 2019, Cachalia said gangsters seemed to be winning the war.\"Establishing gang units from time to time is an ad hoc response to a growing problem. I really don't think that we should be approaching this matter in a point-scoring way.\"He said South African police were doing their best to fight the violence \"but the problem is a growing one. That is my view\". His visit comes months after Nelson Mandela Bay was hit by a wave of killings.A deadly spike in violence hit the area in the latter half of last year, leaving 118 people dead between August and December, a local prevention group said.The violence has continued into the new year, with around 40 people killed across the region in January, local media reported. There are about three million legally held firearms in South Africa, but there are at least the same number of unlicensed weapons in circulation in the country, which has a population of 63 million, according to statistics cited by Gideon Joubert from the South African Gunowners' Association.Last month, 11 people were killed in a mass shooting linked to illegal mining turf wars near Johannesburg. The shooting occurred just two weeks after another attack at the Saulsville Hostel in the capital Pretoria, where 11 people, including a three-year-old child, were killed.In another incident last May, gunmen killed eight customers at a tavern in the south-eastern city of Durban.President Cyril Ramaphosa has promised stronger law enforcement action and increased police deployment to tackle the gang violence in the country. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South Africa gang violence: Firoz Cachalia says police not able to defeat gangsters",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/93b0/live/7416edf0-f766-11f0-9ea1-2582126020d7.jpg"
      ],
      "datePublished": "2026-01-22T08:23:36.000Z",
      "dateModified": "2026-01-22T08:23:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israeli strike in Gaza kills three journalists, first responders say",
    "url": "https://www.bbc.com/news/articles/c98pnzp50nqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f3f8/live/33576850-f6e7-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-21T20:44:23.000Z",
    "description": "1 day agoDavid GrittenandDan Johnson,JerusalemThree Palestinian journalists have been killed in an Israeli strike in central Gaza, first responders sa",
    "body": "1 day agoDavid GrittenandDan Johnson,JerusalemThree Palestinian journalists have been killed in an Israeli strike in central Gaza, first responders say.Gaza's Hamas-run Civil Defence agency said their car was hit in the al-Zahra area and named them as Mohammed Salah Qashta, Anas Ghneim and Abdul Raouf Shaat. They are understood to have been working for an Egyptian relief organisation.The Israeli military said it struck \"several suspects who operated a drone affiliated with Hamas... in a manner that posed a threat\" to its troops. It added that the incident was under examination.Another eight people, two of them children, were killed by Israeli artillery and gunfire across Gaza on Wednesday, the Hamas-run health ministry said.Medics said three people, including a 10-year-old boy, were killed by Israeli tank fire elsewhere in central Gaza, and that a 13-year-old boy and a woman were killed by Israeli gunfire in the southern Khan Younis area, according to Reuters news agency.The Israeli military said on Wednesday morning that its troops had killed a \"terrorist who crossed the Yellow Line and approached\" them, without mentioning a location. The Yellow Line demarcates territory in Gaza still under Israeli control under the ceasefire deal.At least 466 Palestinians have been killed in Gaza since a ceasefire between Israel and Hamas began on 10 October, according to the health ministry.The Israeli military has said three of its soldiers have been killed in attacks by Palestinian armed groups over the same period.The three photojournalists killed on Wednesday were reportedly working for the Egyptian Relief Committee in the Gaza Strip to film its camps for displaced people.A spokesperson for the humanitarian organisation said the car that was struck was marked with its logo and that it was \"targeted during a humanitarian mission, resulting in the martyrdom of three individuals\".Hamas called the strike a \"dangerous escalation of the flagrant violations of the ceasefire agreement\".The Palestinian Journalists Syndicate said it constituted a war crime and evidence of what it called \"a systematic Israeli policy aimed at silencing the Palestinian voice, obstructing the transmission of facts, and concealing crimes committed against civilians\", according to Palestinian news agency Wafa.Abdul Raouf Shaat was a regular contributor to French news agency AFP, which expressed \"immense sadness\" at his death and demanded a \"full and transparent investigation\".The Committee to Protect Journalists (CPJ) also said it was \"appalled\".\"Israel, which possesses advanced technology capable of identifying its targets, has an obligation under international law to protect journalists,\" regional director Sara Qudah said.The CPJ has documented the killing of at least 206 journalists and media workers by Israeli fire in Gaza since the start of the war - the deadliest conflict for journalists ever documented.Before Wednesday, two journalists had been killed in Israeli strikes during the ceasefire, and a third had been killed by members of a Palestinian armed group, according to the US-based organisation's data.International news outlets, including the BBC, rely on local journalists in Gaza, as Israel does not allow them to send foreign journalists into the territory independently. Some journalists are taken into Gaza by the Israeli military under controlled access.The war was triggered by the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.Israel responded to the attack by launching a military campaign in Gaza, during which more than 71,550 people have been killed, according to the territory's health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israeli strike in Gaza kills three journalists, first responders say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f3f8/live/33576850-f6e7-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-21T20:44:23.000Z",
      "dateModified": "2026-01-21T20:44:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "EU suspends approval of US trade deal ",
    "url": "https://www.bbc.com/news/articles/c4gwp2me3gzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2c49/live/5fb08400-f6e6-11f0-895d-e36f1af03bf3.jpg",
    "tag": "World",
    "date": "2026-01-21T23:41:10.000Z",
    "description": "1 day agoJonathan Josephs,Adam HancockandArchie Mitchell,Business reportersGetty ImagesThe European Parliament has suspended the approval of a key US ",
    "body": "1 day agoJonathan Josephs,Adam HancockandArchie Mitchell,Business reportersGetty ImagesThe European Parliament has suspended the approval of a key US trade deal agreed in July in protest against Donald Trump's demand to take over Greenland.The suspension was announced in Strasbourg, France, on Wednesday, as the US president addressed the World Economic Forum in Davos.The move followed renewed trade tensions between the US and Europe sparked by Trump's bid to acquire Greenland, which had rattled financial markets, reviving talk of a trade war and the possibility of retaliation against the US. Hours later, Trump said on social media he had reached a \"framework\" deal on Greenland's future and would not carry out threats to put new tariffs on eight Nato members.Trade tensions between the US and Europe had eased since the two sides struck a deal at Trump's Turnberry golf course in Scotland in July.That agreement set US levies on most European goods at 15%, down from the 30% Trump had initially threatened as part of his \"Liberation Day\" wave of tariffs in April. In exchange, Europe had agreed to invest in the US and make changes on the continent expected to boost US exports. The deal would have still required approval from the European Parliament to become official. But on Wednesday, days after Trump threatened fresh US tariffs over Greenland, Bernd Lange, chair of the European Parliament's International Trade Committee, said it was \"left with no alternative but to suspend work on the two Turnberry legislative proposals\". He said work to implement the trade plans would be on hold \"until the US decides to re-engage on a path of cooperation rather than confrontation, and before any further steps are taken\". The move renewed the possibility that the EU might move forward with tariffs on a possible €93bn ($109bn, £81bn) worth of American goods it announced last year in response to Trump's \"Liberation Day\" tariffs.It had put those plans on hold while the trade deal was being finalised but those levies would now come into force on 7 February unless the bloc moves to extend the pause or approves the new deal. Lange, speaking before Trump announced the \"framework deal\" and backed off the tariff threat,  said there would be \"no possibility for compromise\" until Trump's threats ended. He also raised the prospect of the use of the \"anti-coercion instrument\" of retaliatory measures, nicknamed a \"trade bazooka\", an idea also backed by French President Emmanuel Macron.In an interview with the BBC after Trump's announcement, Lange declined to say whether it could salvage the trade deal, adding that it would take \"some time\" to understand its implications. \"We have to look what this so-called solution would mean,\" he said.There seems to be a sense in Brussels that Trump's climbdown was inevitable. When BBC News asked one well placed EU source for a response to President Trump saying he wouldn't go ahead with the tariffs, the response was simply an eye-rolling emoji.Over the last year, financial markets have batted away concerns over the impact of the US president's policy announcements, taking comfort in the TACO acronym, Trump Always Chickens Out.It seems the sense of him not following through on threats has also taken hold in some corridors of power.In his Davos speech, Trump repeated his interest in the US acquiring Greenland from Denmark, but said \"I don't have to use force, I don't want to use force, I won't use force\". He called for \"immediate negotiations\" with the country about how he could take over the island, which he has argued is crucial for US and global security, announcing the \"framework\" of a future deal a few hours later.Trump's speech helped to calm financial markets on both sides of the Atlantic, which had sunk in previous days. Shares in the US gained further on the deal announcement, with the Dow Jones, S&P 500 and the Nasdaq, rising more than 1% in afternoon trading on Wednesday, while the FTSE 100 closed slightly higher.The price of gold continued to make gains as it rose above $4,842 (£3,604) an ounce for the first time. The price of silver remained slightly lower than Monday's record high of $95 an ounce, hovering around $94.Precious metals are seen as safer assets to hold in times of uncertainty, and the prices of both gold and silver have soared over the past year.The US and the 27-nation European Union are each others' single biggest trade partners, with more than €1.6tn ($1.9tn, £1.4tn) in goods and services exchanged in 2024, according to European figures. That represents nearly a third of all global trade.When Trump started announcing tariffs last year, it prompted threats of retaliation from many political leaders, including in Europe. In the end, however, many, opted to negotiate instead. Only China and Canada stuck by their threats to hit American goods with tariffs, with Canada quietly withdrawing most of those measures in September, concerned they were damaging the Canadian economy.In a speech in Davos on Tuesday, Canadian Prime Minister Mark Carney urged \"middle powers\" to unite to push back against the might-makes-right world of great power rivalry that he warned was emerging. \"When we only negotiate bilaterally with a hegemon, we negotiate from weakness. We accept what is offered. We compete with each other to be the most accommodating,\" he warned. \"This is not sovereignty. It is the performance of sovereignty while accepting subordination.\"The US has previously expressed impatience with European progress toward approval of the deal amid ongoing disagreements over tech and metals tariffs. But ahead of Trump's arrival in Davos, US Treasury Secretary Scott Bessent said European leaders should not jump to retaliate, urging them to \"have an open mind\".\"I tell everyone, sit back. Take a deep breath. Do not retaliate,\" he said.Looming in the background of the trade tensions is a pending Supreme Court decision over whether many of the tariffs Trump announced last year are legal. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "EU suspends approval of US trade deal ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2c49/live/5fb08400-f6e6-11f0-895d-e36f1af03bf3.jpg"
      ],
      "datePublished": "2026-01-21T23:41:10.000Z",
      "dateModified": "2026-01-21T23:41:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]