[
  {
    "title": "Cryptology firm cancels elections after losing encryption key ",
    "url": "https://www.bbc.com/news/articles/c62vl05rz0ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7476/live/72c3b5f0-c9f3-11f0-bd31-8fd3ec515046.jpg",
    "tag": "World",
    "date": "2025-11-25T12:26:43.000Z",
    "description": "13 hours agoLaura CressTechnology reporterGetty ImagesA firm considered one of the leading global voices in encryption has cancelled the announcement ",
    "body": "13 hours agoLaura CressTechnology reporterGetty ImagesA firm considered one of the leading global voices in encryption has cancelled the announcement of its leadership election results after an official lost the encrypted key needed to unlock them. The International Association for Cryptologic Research (IACR) uses an electronic voting system which needs three members, each with part of an encrypted key, to access the results. In a statement, the scientific organisation said one of the trustees had lost their key in \"an honest but unfortunate human mistake\", making it impossible for them to decrypt - and uncover - the final results.The IACR said it would rerun the election, adding \"new safeguards\" to stop similar mistakes happening again.The IACR is a global non-profit organisation which was founded in 1982 with the aim to \"further research\" in cryptology, the science of secure communication.It opened votes for three Director and four Officer positions on 17 October, with the process closing on 16 November.The Association used an open source electronic voting system called Helios for the process. The browser-based system uses cryptography to encrypt votes, or keep them secret.Three members of the association were chosen as independent trustees to each be given a third of the encrypted material, which when shared together would give the verdict.Whilst two of the trustees uploaded their share of the encrypted material online, a third never did.'Irretrievably' lostThe IACR said in a statement that the lack of results was due to one of the trustees \"irretrievably\" losing their private key, leaving it \"technically impossible\" for the firm to know the final verdict. It said it was therefore left with no choice but to cancel the election.The association added it was \"deeply sorry\" for the mistake, which it took \"very seriously\". American cryptographer Bruce Schneier told the BBC that failures in cryptographic systems often lie in the fact that \"to provide any actual security\" they have to be \"operated by humans\".\"Whether it's forgetting keys, improperly sharing keys, or making some other mistake,\" he said, \"cryptographic systems often fail for very human reasons\".Voting for the IACR positions has been renewed and will run until 20 December. The association said that it had replaced the initial trustee who lost the encrypted information and will now adopt a \"2-out-of-3\" threshold mechanism for the management of private keys, with a clear written procedure for trustees to follow.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cryptology firm cancels elections after losing encryption key ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7476/live/72c3b5f0-c9f3-11f0-bd31-8fd3ec515046.jpg"
      ],
      "datePublished": "2025-11-25T12:26:43.000Z",
      "dateModified": "2025-11-25T12:26:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thai woman's cremation stopped as knocking on coffin heard, temple staff say",
    "url": "https://www.bbc.com/news/articles/cvgq0jzw5n2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1552/live/fdc23140-c9f8-11f0-becd-0b69a712fd65.jpg",
    "tag": "World",
    "date": "2025-11-25T14:12:24.000Z",
    "description": "A woman thought to be dead, who was about to be cremated at a Buddhist temple in the outskirts of Bangkok, Thailand, has been found alive by staff.Pai",
    "body": "A woman thought to be dead, who was about to be cremated at a Buddhist temple in the outskirts of Bangkok, Thailand, has been found alive by staff.Pairat Soodthoop, general manager of the Wat Rat Prakhong Tham temple, was \"startled\" to hear a faint knock from the coffin, he told the Associated Press news agency. Mr Soodthoop said he asked for the coffin to be opened and saw the woman \"opening her eyes slightly and knocking on the side of the coffin\". \"She must have been knocking for quite some time,\" he added. The brother of the 65-year-old woman said local officials told him his sister had died. However, the temple's manager said the brother did not have a death certificate.As Mr Soodthoop tried to explain to the brother how to obtain a death certificate, the temple's staff heard a faint knock coming from inside the coffin.Once it became clear the woman was alive, the temple's abbot (head of a Buddhist monastery) said the woman should be taken to hospital immediately. A doctor later confirmed that the woman had been experiencing severe hypoglycaemia - a condition where blood sugar levels get critically low, local reports said.The doctor ruled out the possibility that she had suffered respiratory failure or cardiac arrest, according to the reports.The brother said his sibling had been bedridden for the last two years and, as her health deteriorated, she appeared to have stopped breathing on Saturday, according to the temple's manager.The family had travelled nearly 500km (311 mile) from the province of Phitsanulok in Thailand for the cremation ceremony. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thai woman's cremation stopped as knocking on coffin heard, temple staff say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1552/live/fdc23140-c9f8-11f0-becd-0b69a712fd65.jpg"
      ],
      "datePublished": "2025-11-25T14:12:24.000Z",
      "dateModified": "2025-11-25T14:12:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israel receives coffin that Hamas says contains Gaza hostage's body",
    "url": "https://www.bbc.com/news/articles/c17x0xjqj21o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/230c/live/910d9160-ca08-11f0-88a5-11238e952b75.jpg",
    "tag": "World",
    "date": "2025-11-25T17:32:46.000Z",
    "description": "Israel has received, via the Red Cross, a coffin that Hamas and Palestinian Islamic Jihad (PIJ) say contains the body of one of the last three decease",
    "body": "Israel has received, via the Red Cross, a coffin that Hamas and Palestinian Islamic Jihad (PIJ) say contains the body of one of the last three deceased hostages still in Gaza, according to the Israeli prime minister's office.Israeli forces will now transfer the body to Israel's National Centre of Forensic Medicine in Tel Aviv for identification.Earlier, PIJ and Hamas announced that the body of an Israeli hostage had been found in central Gaza on Monday.Prime Minister Benjamin Netanyahu's office warned that it viewed \"with severity the delay in the immediate transfer\" of the body, saying it constituted a \"further violation\" of the six-week-old Gaza ceasefire agreement.Following the handover in central Gaza on Tuesday afternoon, the office announced that the families of the three dead hostages had been updated accordingly.\"Our hearts are with them in this difficult hour,\" it added. \"The effort to return our hostages is ongoing and will not cease until the last hostage is returned.\"Under the first phase of the US-brokered ceasefire deal, which took effect on 10 October, Hamas agreed to return the 20 living Israeli hostages and the bodies of the 28 dead Israeli and foreign hostages still in Gaza within 72 hours.All the living hostages were released on 13 October in exchange for 250 Palestinian prisoners and 1,718 detainees from Gaza.So far, the remains of 22 dead Israeli hostages have been handed over, along with those of three foreign hostages – one of them Thai, one Nepalese and one Tanzanian.In exchange, Israel has handed over the bodies of 330 Palestinians killed during the war.Two of the three remaining dead hostages are Israelis - Ran Gvili, 24, and Dror Or, 48 - and one is Thai - Suthisak Rintalak, 43.Israel has accused Hamas of deliberately delaying the recovery of the bodies, while Hamas has insisted it is struggling to find them under rubble.The slow progress has meant there has been no advance on the second phase of President Donald Trump's Gaza peace plan. This includes plans for the governance of Gaza, the withdrawal of Israeli troops, the disarmament of Hamas and reconstruction.The dead hostages still in Gaza were among the 251 people abducted during the Hamas-led attack on Israel on 7 October 2023, during which about 1,200 other people were killed.Israel responded by launching a military campaign in Gaza, during which more than 69,770 people have been killed, according to the territory's Hamas-run health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israel receives coffin that Hamas says contains Gaza hostage's body",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/230c/live/910d9160-ca08-11f0-88a5-11238e952b75.jpg"
      ],
      "datePublished": "2025-11-25T17:32:46.000Z",
      "dateModified": "2025-11-25T17:32:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brazil: Bolsonaro ordered to start serving 27-year prison sentence for coup plot",
    "url": "https://www.bbc.com/news/articles/cr4dl19npv5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0fc1/live/e5525120-ca35-11f0-8799-efcbfb167d39.png",
    "tag": "World",
    "date": "2025-11-25T22:29:15.000Z",
    "description": "Brazil's Supreme Court has ordered that right-wing former president Jair Bolsonaro begin serving his prison sentence of 27 years and three months for ",
    "body": "Brazil's Supreme Court has ordered that right-wing former president Jair Bolsonaro begin serving his prison sentence of 27 years and three months for plotting a coup after he lost the last election.Justice Alexandre de Moraes on Tuesday ruled that the case had reached its final judgement and that no further appeals were possible. Bolsonaro, 70, was found guilty of leading a conspiracy aimed at keeping him in power after he lost the 2022 election to his left-wing rival, Luiz Inácio Lula da Silva.He will begin serving his sentence in a federal police jail cell in the capital, Brasilia, where he has been detained since Saturday after being deemed a flight risk and removed from home detention. At a hearing on Sunday, Bolsonaro admitted trying to open his ankle monitor with a soldering iron until he \"came to his senses\", court documents show. He said he had had no intention of fleeing and blamed medicine-induced \"paranoia\" for damage he caused to the monitor. Justice Moraes on Tuesday mandated that full-time medical care be given to Bolsonaro, whose medical team has previously said he is suffering from worsening health.Supreme Court justices said in September, when Bolsonaro was found guilty of plotting a coup, that he had known of plans to assassinate Lula and his vice-presidential running mate, Geraldo Alckmin, and to arrest and execute Moraes, who has been overseeing Bolsonaro's trial.The conspiracy failed to get the backing of the army and air force commanders. Lula was sworn in without incident on 1 January 2023.But a week later, on 8 January, thousands of Bolsonaro supporters stormed government buildings in Brasília. The security forces intervened and about 1,500 people were arrested.The justices found that the rioters had been incited by Bolsonaro, whose plan, they said, was for the military to step in and return him to power.Bolsonaro was also barred from running for public office until 2060 - eight years after the end of his sentence.The former president called the trial a \"witch hunt\" designed to prevent him running in the 2026 presidential election.Justice Moraes also ordered on Tuesday that others found guilty of being Bolsonaro's co-conspirators must begin their sentences.They include Gen Augusto Heleno, former minister for institutional security, and Gen Paulo Sérgio Nogueira de Oliveira, former defence minister.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brazil: Bolsonaro ordered to start serving 27-year prison sentence for coup plot",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0fc1/live/e5525120-ca35-11f0-8799-efcbfb167d39.png"
      ],
      "datePublished": "2025-11-25T22:29:15.000Z",
      "dateModified": "2025-11-25T22:29:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "German 'hammer gang' trial for seven accused of extreme-left violence",
    "url": "https://www.bbc.com/news/articles/cn091g7dreyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d1df/live/342991d0-c9f7-11f0-becd-0b69a712fd65.jpg",
    "tag": "World",
    "date": "2025-11-25T13:15:05.000Z",
    "description": "12 hours agoBethany BellViennaMATTHIAS RIETSCHEL/POOL/AFPOne of the seven suspects, Johann G (R), is accused of being one of the group's ringleadersSe",
    "body": "12 hours agoBethany BellViennaMATTHIAS RIETSCHEL/POOL/AFPOne of the seven suspects, Johann G (R), is accused of being one of the group's ringleadersSeven people have gone on trial in Dresden, eastern Germany, charged with being members or supporters of a militant, criminal left-wing extremist group, Antifa Ost - also known as the \"hammer gang\".Earlier this month the United States designated Antifa Ost as a terrorist organisation, along with several other far-left European groups.German prosecutors say the group, founded in late 2017 or early 2018, carried out violent attacks on people they considered to be part of the right-wing scene. The attacks took place in Germany and in the Hungarian capital Budapest.The six men and one woman who are on trial face charges of attempted murder, aggravated assault, and property damage.They have been named only as Henry A, Tobias E, Johann G, Thomas J, Melissa K, Paul M and Julian W, in line with German privacy laws.According to prosecutors, the attacks, which went on for several years, were prepared for \"intensively\" and included, for example, spying on the targets in advance. In several cases victims were severely injured with blows from a hammer and batons.One of the seven defendants, Johann G, is charged with having a prominent role in the group. He is accused of having planned the attacks and recruited members. Prosecutors say that another defendant, Paul M, organised combat training for the group.In one attack, in January 2019, Johann G, Tobias E and others are alleged to have attacked four people at Germany's Dessau-Rosslau train station who were on their way back from a rally in Magdeburg, marking the anniversary of the World War Two bombing of the city.The defendants are accused of striking the victims on the head with heavy tools, including a hammer and an iron bar. Prosecutors say they continued to inflict life-threatening blows and kicks, even after their victims had been knocked to the ground.Johann G and Paul M are also accused of having taken part in attacks in Budapest in February 2023.At that time, right-wing extremists from all over Europe had gathered in Budapest for a so-called \"Day of Honour\" to commemorate the attempted breakout of the German Wehrmacht, the Waffen-SS, and their Hungarian collaborators from the city besieged by the Red Army.Johann G and Paul M are charged with taking part in several attacks, hitting and beating right-wing activists with batons, pepper spray and a hammer. One of the victims received at least 15 blows, mainly to the head.Antifa Ost was designated as a terrorist group in the US earlier this month, as part of President Donald Trump's crackdown on extreme-left activists.The designation makes group members ineligible to enter the US, freezes any assets they may have in the world's largest economy and makes it a crime to provide material support to them.The move was welcomed by the far-right Alternative for Germany (AfD) party.Stephan Brandner from the AfD said the German government should follow suit.\"Antifa is a terrorist organisation, and it would be easy for the German state to take action against it. It's just that those in power don't want to,\" he said.\"The US government is showing the way forward; something that is long overdue in Germany. All forms of extremism must be combated, and all terrorist organisations must be fought and banned.\"The German foreign ministry said it had taken note of the US decision.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "German 'hammer gang' trial for seven accused of extreme-left violence",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d1df/live/342991d0-c9f7-11f0-becd-0b69a712fd65.jpg"
      ],
      "datePublished": "2025-11-25T13:15:05.000Z",
      "dateModified": "2025-11-25T13:15:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Court seals records in case of teen's body found in singer D4vd's Tesla",
    "url": "https://www.bbc.com/news/articles/cwyxg429yr9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9ad7/live/01911a60-c716-11f0-9197-a502c623b7e9.jpg",
    "tag": "World",
    "date": "2025-11-25T01:45:43.000Z",
    "description": "23 hours agoNardine Saadin Los Angeles Records about the death of Celeste Rivas Hernandez, a 15-year-old girl whose body was found in singer D4vd's ca",
    "body": "23 hours agoNardine Saadin Los Angeles Records about the death of Celeste Rivas Hernandez, a 15-year-old girl whose body was found in singer D4vd's car, have been barred from public release, officials said. The Los Angeles County medical examiner's office said it received a court order imposing a security hold on the case, and that no details about Ms Rivas Hernandez's death can be released or posted on its website.The police department said it requested the order to ensure officers \"receive information from the Medical Examiner before the public\".Chief Medical Examiner Dr Odey Ukpo said the practice of security holds is \"virtually unheard of in other counties\" and \"has not been proven to improve outcomes in the legal system\". \"We are dedicated to serving our community with full transparency; however, the law precludes us from doing so while the court order remains in this case,\" Dr Ukpo added.Police discovered Rivas Hernandez's remains inside the boot of the impounded Tesla on 8 September, after responding to reports of a foul odour at a Hollywood tow yard. Rivas Hernandez, from Lake Elsinore in California, had been missing and was last seen in April 2024, according to a missing person flyer cited by CBS, the BBC's US news partner.The car, registered to D4vd, had been towed from the Hollywood Hills neighbourhood five days after it had been abandoned. D4vd, 20, whose real name is David Anthony Burke, released his debut album in April and was on tour when the remains were discovered. He has not commented on the case, but his representatives previously said he was cooperating with police.A police spokesperson said the case was being investigated by its robbery-homicide division. No arrests have been made. The county's medical examiner previously said Ms Rivas Hernandez's body was \"severely decomposed\" when it was found in September and deferred making a ruling on how she died pending the death investigation.When her remains were found in a bag in D4vd's car on 8 September, the medical examiner said that she was wearing a tube top, size small black leggings and jewellery, including a yellow metal stud earring and a yellow metal chain bracelet.She also had a tattoo that read \"Shhh…\" on her index finger - a marking nearly identical to that on the pop singer's own index finger.The decomposition of her body indicated that she had already been \"deceased for several weeks\", investigators said.The girl, who lived about 75 miles away from where her body was discovered - had run away from her home repeatedly.Neighbours recognised the first-generation daughter of immigrant parents from El Salvador, as a girl who would visit the corner store almost daily to buy candy and soda, according to the Los Angeles Times.Her family, who described her as a beloved daughter, sister, cousin and friend, said they were \"heartbroken and devastated by this tragic loss\". They solicited money on a crowdfunding website to pay for her funeral, which took place in October.The case has also derailed the aspiring career of the viral hitmaker.His world tour was cancelled within days of the discovery, and Sony Music Publishing reportedly suspended promotion of his second album.Los Angeles police soon raided the posh Hollywood Hills mansion where the singer was living, just blocks from where his Tesla had been towed.US retailer Hollister and footwear giant Crocs dropped D4vd from marketing campaigns and Telepatía singer Kali Uchis announced she was taking down their collaboration, Crashing.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Court seals records in case of teen's body found in singer D4vd's Tesla",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9ad7/live/01911a60-c716-11f0-9197-a502c623b7e9.jpg"
      ],
      "datePublished": "2025-11-25T01:45:43.000Z",
      "dateModified": "2025-11-25T01:45:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lee Soon-jae: South Korea's 'TV dad' dies at 91",
    "url": "https://www.bbc.com/news/articles/cg4nlv0pn3zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5523/live/47355a90-c9c3-11f0-a001-47048321ca07.jpg",
    "tag": "World",
    "date": "2025-11-25T05:58:48.000Z",
    "description": "19 hours agoJake KwonandLeehyun Choi,SeoulLee Soon-jae, one of South Korea's most beloved actors, died on Tuesday at the age of 91, his agency announc",
    "body": "19 hours agoJake KwonandLeehyun Choi,SeoulLee Soon-jae, one of South Korea's most beloved actors, died on Tuesday at the age of 91, his agency announced.In a career spanning more than 70 years across films, television and the stage, Lee was fondly known as the \"national TV dad\" for his many roles as a wise, older man. This included two of his best-known performances - as a strict father in the 1991 soap What on Earth is Love, and a silly but lovable grandpa in the popular sitcom High Kick! which aired from 2006 to 2012.News of his death has sparked an outpouring of tributes from young celebrities, including K-pop singers, speaking of his warmth and kindness, to President Lee Jae Myung.\"From theatre to film and television, he brought us laughter, emotion, comfort and courage,\" the president wrote on Facebook.Lee was acting until last year, when he won the grand prize at the KBS Drama Awards for his lead role in the comedy series, Dog Knows Everything. He was the oldest South Korean actor to ever win the honour. \"You become old when you sit down and expect to be waited on,\" he told fellow senior actors on the travel show Grandpas over Flowers. The 2013 show, which revolves around senior stars making strenuous journeys abroad, became a cultural phenomenon.Born in 1934 in Hoeryeong, a county now in North Korea, Lee was just four years old when his family moved south to Seoul.He was working in his grandparents' shop in the capital's Namdaemun market when Korea was liberated from Japanese rule in 1945.Lee studied philosophy at the prestigious Seoul National University but ventured into theatre and, eventually, TV and films. He said he was inspired to act after watching Sir Laurence Olivier play the title role in Hamlet.Lee appeared in some 140 TV shows through his career and continued to act on stage until October 2024, when he withdrew halfway through the run of the play Waiting for Godot because of an illness. He reappeared in public at the awards in December. He also had a brief foray into politics. In 1992, he was elected as a member of parliament for the conservative Democratic Liberal Party, but at the end of his four-year-term he did not run again. Lee's prolific career meant he has remained a household name for a decades, just as familiar to younger audiences and at a time when Korean entertainment is one of the country's biggest exports.His celebrity has even spilled onto the internet where scenes of him from High Kick! have resurfaced as memes on TikTok in recent years.Actor Yoo Yeon-seok, who studied under Lee, said he \"exemplified acting\"  and Lee Soon-jae's High Kick! co-star Jeong Bo-seok described Lee not just as a mentor in the industry, but a \"true mentor in my life\". He wrote on Instagram: \"Teacher, thank you so much for everything. I learned and felt so much from you - not only about acting, but also about life and the attitude of an actor.\" Additional reporting by Rachel Lee",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lee Soon-jae: South Korea's 'TV dad' dies at 91",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5523/live/47355a90-c9c3-11f0-a001-47048321ca07.jpg"
      ],
      "datePublished": "2025-11-25T05:58:48.000Z",
      "dateModified": "2025-11-25T05:58:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ex-wife of Dubai royal says she fears arrest as custody battle escalates",
    "url": "https://www.bbc.com/news/articles/cj01j710rmmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8004/live/74cbb160-c9e7-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "World",
    "date": "2025-11-25T17:40:57.000Z",
    "description": "7 hours agoSebastian UsherGlobal affairs reporterBBCZeynab Javadli divorced Sheikh Saeed bin Maktoum bin Rashid Al Maktoum in 2019The former wife of a",
    "body": "7 hours agoSebastian UsherGlobal affairs reporterBBCZeynab Javadli divorced Sheikh Saeed bin Maktoum bin Rashid Al Maktoum in 2019The former wife of a member of Dubai's ruling family has expressed concern that she could be arrested as her ex-husband has lodged a criminal complaint with local police, accusing her of kidnapping their three young daughters.Since their divorce in 2019, Zeynab Javadli has been involved in a bitter custody battle with her ex-husband Sheikh Saeed bin Maktoum bin Rashid Al Maktoum, who is the nephew of the ruler of Dubai.It has come to a head in recent weeks as the children have changed hands between the parents several times, with each accusing the other of kidnapping them.Ms Javadli also potentially faces arrest for e-crimes - online offences - after she livestreamed the latest showdown.In going public, she says she realised that she was taking a big risk.\"I knew that it was the last chance to be with my children as they would never let me see them again.  I genuinely believed that it was my last chance, so I just opened a livestream and called for help,\" she said in a video message to her British lawyer, David Haigh.Ms Javadli was speaking from her house in Dubai, where she claims that she and her three daughters have essentially once again been isolated since she took them back with her after they'd been with their father for several weeks. Up until then, Ms Javadli had had effective custody of the children under a deal she says was agreed with the ruler of Dubai, Sheikh Mohammed bin Rashid Al Maktoum, in 2022. That agreement, she says, guaranteed her custody of the children until they were 18 years old, as well as a house and other assistance. Their schooling has been paid for by their father.In return, David Haigh says she had to sign papers saying that she would - among other things - not speak to the media again about her situation, nor would she do any more livestreaming.A subsequent court ruling granted custody to Sheikh Saeed, but Ms Javadli says she received assurances from those involved in her case that the deal with Dubai's ruler would not be affected.That remained the situation until two months ago.That was when - during one of the regular visitations of the children with Sheikh Saeed - that Ms Javadli says she received a message from him through Dubai police telling her there was no need to wait as they would not be returned to her that day.She heard nothing from them for several weeks. She was finally granted a visitation for three hours at a child protection centre and headed there with her driver on 8 November. She says that when she entered the centre, her children were not there. As she was coming out of the building, she saw them. She says they rushed towards her.She says they were shouting \"Mama, take us from here!\" She told her driver to lock the doors and drive them home.But she claims their way was blocked by cars belonging to people working for her ex-husband. That was when she decided to open a livestream and plead for help. In doing so, she knew that she risked breaking the deal she had signed with the authorities in the UAE and that she could face arrest for doing so, but she insists that it was her only recourse.She has been at home with her children since then and says she does not dare to go out for fear of arrest. The three girls - aged nine, seven and six - have not been going to school.The BBC has contacted a number of officials in the UAE, who are involved in the case, for comment, but has received no reply so far. However, the perspective of Sheikh Saeed is clear from court depositions.The most recent gives a very different version of what happened on 8 November, accusing Ms Javadli of forcibly placing the children into her car with the help of her driver and then kidnapping them. It also accuses Ms Javadli of posting videos on social media in which \"she insulted and slandered\" her former husband as well as defaming the state and violating state laws.Previously, lawyers acting for Sheikh Saeed had claimed in court that Ms Javadli was an unfit mother, who had failed to send her daughters to school, was living in a place unsuitable for the children when she was in a hotel, and that she had put the health of the youngest girl at risk.Ms Javadli rejected the accusations and her Emirati legal team submitted evidence to the contrary in court.David Haigh says that there've been other similar cases involving former wives of members of Dubai's royal family or other female members of the family. He himself has been involved in campaigning for several of the women. None of these cases involve Sheikh Saeed.Princess Haya - the ex-wife of Sheikh Mohammed bin Rashid Al Maktoum - fled the UAE in 2019, saying that she feared for her life. Three years later, the princess won a custody battle that played out in the highest court in the UK, which gave her sole custody of their two children.The most sensational saga was that of one of the daughters of Dubai's ruler, Princess Latifa, who mounted a bid for freedom in 2018 from what at the time she claimed was her family's coercive control.The boat on which she was making her escape was intercepted in the Indian Ocean and she was forcibly returned to Dubai. She then claimed that she was being held captive in secret videos. She has since re-emerged to a limited extent in public, saying that she was well and living as she wished.Ms Javadli and David Haigh say that Dubai portrays itself as promoting women's rights and encouraging women - whether from the UAE or from outside - to lead fulfilling lives, both professionally and personally. For many, this is no doubt the case.But they claim that Ms Javadli's case shows that beneath the glittering surface of Dubai, for some women the situation can be more complicated and more uncomfortable.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ex-wife of Dubai royal says she fears arrest as custody battle escalates",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8004/live/74cbb160-c9e7-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-25T17:40:57.000Z",
      "dateModified": "2025-11-25T17:40:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "COP30 fire: BBC at the scene of 'intense' blaze",
    "url": "https://www.bbc.com/news/videos/cn5159k1krzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f1e6/live/d697fe90-c63f-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-20T21:58:46.000Z",
    "description": "The UN climate talks COP30 have been evacuated due to a fire breaking out inside the venue in Belém, Brazil.BBC journalists including Climate Editor J",
    "body": "The UN climate talks COP30 have been evacuated due to a fire breaking out inside the venue in Belém, Brazil.BBC journalists including Climate Editor Justin Rowlatt saw flames and smoke in the pavilion area before they were rushed outside.The UN said the fire was extinguished after six minutes and 13 people were treated for smoke inhalation. It is not yet known what caused the blaze.More on this story.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "COP30 fire: BBC at the scene of 'intense' blaze",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f1e6/live/d697fe90-c63f-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-20T21:58:46.000Z",
      "dateModified": "2025-11-20T21:58:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ukraine-Russia war: Ukraine says 'understanding' reached with US on peace plan, as Trump says his envoy will meet Putin in Moscow",
    "url": "https://www.bbc.com/news/articles/cy95jvw57v2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7194/live/eefed080-ca40-11f0-86f6-7b854e603852.jpg",
    "tag": "World",
    "date": "2025-11-25T22:46:23.000Z",
    "description": "2 hours agoLaura GozziReutersPresident Zelensky's team are hoping to arrange a meeting with President Trump in November (file picture)Ukraine has said",
    "body": "2 hours agoLaura GozziReutersPresident Zelensky's team are hoping to arrange a meeting with President Trump in November (file picture)Ukraine has said a \"common understanding\" has been reached with the US on a peace deal aimed at ending the war with Russia.The proposal is based on a 28-point plan presented to Kyiv by the US last week, which American and Ukrainian officials worked on during weekend talks in Geneva.In a post on social media, US President Donald Trump said the original plan \"has been fine-tuned, with additional input from both sides\".He added: \"I have directed my Special Envoy Steve Witkoff to meet with President Putin in Moscow and, at the same time, Secretary of the Army Dan Driscoll will be meeting with the Ukrainians.\"President Zelensky's chief of staff said he expects Driscoll to visit Kyiv this week.The Kremlin previously said that Russia had not yet been consulted on the new draft deal – warning it may not accept amendments to last week's plan.Russian Foreign Minister Sergei Lavrov warned that while Moscow had been in favour of the initial US framework, the situation would be \"fundamentally different\" if it had undergone substantial changes.As of Tuesday morning the Kremlin had not received a copy of the new plan, Lavrov said, accusing Europe of undermining US peace efforts.American officials did not publicly address Russia's concerns, although US Army Secretary Dan Driscoll and Russian representatives held meetings on Monday and Tuesday in Abu Dhabi.Some of the issues which Russia and Ukraine are still deeply at odds over have reportedly remained unaddressed so far – including security guarantees for Kyiv and control of several embattled regions in Ukraine's east. Zelensky said on Tuesday that he was ready to meet Trump to discuss \"sensitive points\", with his administration aiming for a meeting before the end of the month.\"I am counting on further active cooperation with the American side and with President (Donald) Trump. Much depends on America, because Russia pays the greatest attention to American strength,\" he said.The White House has not commented on the prospect of bilateral talks, but Trump wrote on social media that he looked forward to meeting with presidents Zelensky and Putin \"soon, but ONLY when the deal to end this War is FINAL or, in its final stages\".Despite the White House's relative optimism, European leaders seemed doubtful that, after almost four years of war, peace could be within reach. France's Emmanuel Macron said he saw \"no Russian will for a ceasefire\", while Downing Street warned there was \"a long way to go – a tough road ahead.\" Watch: Explosions rock Kyiv after overnight Russian strikesUkraine's European allies, the \"Coalition of the Willing\", held a virtual meeting chaired by Macron and UK Prime Minister Sir Keir Starmer on Tuesday. During the call – which was also joined by US Secretary of State Marco Rubio – the leaders agreed to set up a task force with the US to \"accelerate\" work on the security guarantees that will be offered to Ukraine in the event of a peace deal.The issue of security guarantees is only one of the areas on which Moscow and Kyiv are at odds. On Monday, Zelensky said the \"main problem\" blocking peace was Putin's demand for legal recognition of the territory Russia had seized.Moscow has consistently demanded full Ukrainian withdrawal from the whole of the eastern Donbas, made up of the Donetsk and Luhansk regions. Russian forces also control the Crimean peninsula and large parts of two other regions, Kherson and Zaporizhzhia.Meanwhile, the fighting continues. Both Russia and Ukraine said strikes had been carried out on Tuesday night in Zaporizhzhia. Ukraine's regional head there, Ivan Federov, said at least seven people had been injured, while Yevgeny Balitsky, the Kremlin-installed governor, reported that Kyiv had hit energy grids in areas it controls, leaving up to 40,000 people without electricity.Tens of thousands of soldiers and thousands of civilians have been killed or injured, and millions of people have fled their homes since Russia's full-scale invasion of Ukraine began in February 2022.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ukraine-Russia war: Ukraine says 'understanding' reached with US on peace plan, as Trump says his envoy will meet Putin in Moscow",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7194/live/eefed080-ca40-11f0-86f6-7b854e603852.jpg"
      ],
      "datePublished": "2025-11-25T22:46:23.000Z",
      "dateModified": "2025-11-25T22:46:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Four more arrests made following Louvre jewellery heist",
    "url": "https://www.bbc.com/news/articles/cr5zm7n8ngpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f11c/live/6b6ad270-ca07-11f0-88a5-11238e952b75.jpg",
    "tag": "World",
    "date": "2025-11-25T15:52:33.000Z",
    "description": "9 hours agoAmy WalkerandPaul PradierFour more people have been arrested as part of the investigation into last month's theft of precious jewellery at ",
    "body": "9 hours agoAmy WalkerandPaul PradierFour more people have been arrested as part of the investigation into last month's theft of precious jewellery at the Louvre Museum, the Paris prosecutor's office says.Two men, aged 38 and 39, and two women, aged 31 and 40, were arrested on Tuesday. They are all from the Paris region.Among them is thought to be the last member of a four-man gang that allegedly carried out the daylight heist, according to French media. The other three suspected thieves have already been arrested and charged, officials say. Police now have up to 96 hours to question them. No trace has so far been found of the stolen jewels - worth  €88m (£76m; $102m) - which were taken on 19 October.Four people have already charged over the heist - three men and a woman, who also live in the Paris region. A 38-year-old woman was charged earlier this month with complicity in organised theft and criminal conspiracy with a view to committing a crime.Separately, a man, aged 37, was charged with theft and criminal conspiracy.These two suspects, who have not been named publicly, have denied any involvement.Ms Beccuau previously told French news agency Franceinfo said the two were in a relationship and had children together, without giving any further details. Louvre MuseumLouvre MuseumThe Marie-Louise necklace and a pair of earrings were among the eight items stolen A tiara worn by the Empress Eugenie, wife of Napoleon III, was takenMeanwhile, two men were charged with theft and criminal conspiracy in October after officials said they had \"partially recognised\" their involvement in the heist.The heist happened when the group of four men used a stolen vehicle-mounted mechanical lift to gain access to the Galerie d'Apollon (Gallery of Apollo) via a balcony close to the River Seine, Beccuau has previously said. The men used a disc cutter to crack open display cases housing the jewellery.The thieves were inside for four minutes and made their escape on two scooters waiting outside at 09:38, before switching to cars.One of the stolen items - a crown - was dropped during the escape but eight other items of jewellery - including an emerald-and-diamond necklace that Napoleon I gave his second wife, Empress Marie-Louise - were taken. Beccuau has said the heist was carried out by petty criminals rather than organised crime professionals.Shortly after the theft, it was revealed by the Louvre's director that the only camera monitoring the Galerie d'Apollon was pointing away from a balcony the thieves climbed over to break in.The president of the Louvre, Laurence des Cars, has since admitted the museum had failed in its responsibilities, but denied that security had been overlooked - saying that from the time she took office in 2021 she had been warning constantly of the need for more investment.Since the incident, security measures have been tightened around France's cultural institutions.The Louvre has transferred some of its most precious jewels to the Bank of France following the heist.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Four more arrests made following Louvre jewellery heist",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f11c/live/6b6ad270-ca07-11f0-88a5-11238e952b75.jpg"
      ],
      "datePublished": "2025-11-25T15:52:33.000Z",
      "dateModified": "2025-11-25T15:52:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dan Driscoll: Who is Trump's 'drone guy' taking central role in Ukraine peace talks?",
    "url": "https://www.bbc.com/news/articles/c17x0x2qrejo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/181d/live/154bdb00-ca07-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "World",
    "date": "2025-11-25T20:11:12.000Z",
    "description": "5 hours agoLisa LambertPA MediaUkrainian President Volodymyr Zelensky shakes hands with Dan Driscoll in KyivWhen talks to end the Russia-Ukraine war t",
    "body": "5 hours agoLisa LambertPA MediaUkrainian President Volodymyr Zelensky shakes hands with Dan Driscoll in KyivWhen talks to end the Russia-Ukraine war took an unexpected turn last week, with the leak of a peace plan said to come from the US, the Trump administration dispatched an unlikely figure to attend a flurry of overseas meetings. The youngest-ever army secretary, 39-year-old Dan Driscoll, is often referred to as President Donald Trump's \"drone guy\" for his embrace of emerging battlefield technologies. Until recently, he was mostly known for discussions of budgets, supplies and staff issues in the military's largest branch. Driscoll does not appear have a long history of dealing with Russian and Ukraine, or experience in international diplomacy, and has never held public office.So, who is this increasingly prominent figure within the administration?Close ally of Vice-President JD VanceIt is Driscoll's relationship with the now-vice president, JD Vance, that brought him into Trump's orbit.Like his friend Vance, Driscoll attended a public university before joining the US Army, and then earned his law degree at the prestigious Yale University. Both men also worked in finance after graduating. During his military career, Driscoll became an officer in 2007, led a cavalry platoon and deployed to Iraq for several months in 2009. He has told the story of meeting Vance through a veterans' student group at law school, during which Vance reassured new students that they would at first feel as if they did not belong, but would excel at classes after a few months. Soon, Vance became Driscoll's friend and mentor.Driscoll was on holiday with his family in Switzerland in the summer of 2024 when Vance called to tell him he was going to be Trump's running mate and asked him to join the campaign.The next day, Driscoll flew back to the US, bought a suit at an outlet mall, and took an Uber to the Republican National Convention, he told the alumni magazine for the University of North Carolina, Chapel Hill - the institution where he was an undergraduate.Once Trump returned to office, Driscoll was swiftly approved as army secretary in his Senate confirmation vote. His sphere of influence expanded after he became a key figure in Trump's deployment of the National Guard to US cities. Afterwards, he also took over the role of acting director of the Bureau of Alcohol, Tobacco, Firearms and Explosives.Getty ImagesDriscoll at his confirmation hearing in JanuaryUnannounced visit to UkraineDriscoll has often spoken about the war in Ukraine - pointing to Ukrainian drones as a relatively cheap, mass-produced technology that is good for fighting. But after being nominated for the army secretary job, he did not initially appear to be involved in negotiations to end the war. Trump was instead relying on his special envoy, Steve Witkoff, to work on a plan for a ceasefire. When details of a 28-point plan drafted by the US and Russia were leaked last week, Ukraine immediately voiced concern at some of its key points - and its European allies followed suit. Driscoll then made an unannounced visit to Ukraine along with other high-ranking Pentagon figures, the most senior military group to travel to Kyiv since Trump took office in January. The purpose, according to a US Army spokesman, was to meet Ukrainian officials and discuss efforts to end the war.Driscoll met Zelensky and was then, according to Politico, feted at a reception at the US ambassador's residence.In subsequent days, Driscoll participated in more discussions with Ukrainian officials in Geneva alongside Secretary of State Marco Rubio, Witkoff and Trump's son-in-law Jared Kushner, and helped draw up an \"updated and refined peace framework\". He went on to hold talks with Russian officials in Abu Dhabi, according to the BBC's US partner, CBS News.In a social media post on Tuesday, Trump said in an effort to finalise the peace plan, he had directed his envoy Steve Witkoff to meet with Russian President Vladimir Putin in Moscow. He said Driscoll would meet with the Ukrainian side.A future envoy... or defence secretary?Getty ImagesDriscoll with National Guard troops in WashingtonIn nominating Driscoll as his army secretary, Trump wrote he had a \"powerful combination of experiences to serve as a disruptor and change agent\".Some in Washington are wondering if those qualities and his recent appearance on the world stage mean that Driscoll could one day replace Pete Hegseth, if Hegseth ever steps down as defence secretary.While he has never held public office, Driscoll worked in Congress as an intern for the Senate's veteran affairs committee, and in 2020 he made an unsuccessful bid for a House seat in North Carolina. A former professor has suggested Driscoll aimed \"to serve in the military, go to law school and be in politics\".There is also the possibility Driscoll could step officially into the role of negotiating with Ukraine when Trump's special envoy to the country, Keith Kellogg, leaves in January. Or he could stay as the head of hundreds of thousands of troops in the US Army. Driscoll has previously highlighted that his father and grandfather served in the military before him, and he often speaks about his vision of transforming the Army. Days before heading to Ukraine, Driscoll described to The Conversation podcast how he imagined the near future, when \"every infantryman...will carry a drone into battle\" and soldiers would rely on artificial intelligence because human brains will not be able to \"keep up\" with the pace of action. \"Our window to change is right now,\" he said in a speech in October. \"And we will win with silicon and software, not our soldiers' blood and bodies.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dan Driscoll: Who is Trump's 'drone guy' taking central role in Ukraine peace talks?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/181d/live/154bdb00-ca07-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-25T20:11:12.000Z",
      "dateModified": "2025-11-25T20:11:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sudan war: Donald Trump's envoy denies bias as the US pushes for peace plan",
    "url": "https://www.bbc.com/news/articles/c1lrgr741z3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7347/live/cc7b6080-ca1f-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-25T18:26:34.000Z",
    "description": "President Donald Trump's senior Africa envoy, Massad Boulos, has rejected criticism that the US's latest proposal to end the Sudan civil war is \"biase",
    "body": "President Donald Trump's senior Africa envoy, Massad Boulos, has rejected criticism that the US's latest proposal to end the Sudan civil war is \"biased\".The US, Saudi Arabia, Egypt and the United Arab Emirates (UAE) have been attempting to mediate between Sudan's army and the paramilitary Rapid Support Forces (RSF), which have been fighting for more than two years.On Sunday, Sudan's army chief Abdel Fattah al-Burhan said the latest ceasefire proposal was unacceptable and future ones would also be one-sided as long as the UAE was involved in the negotiations.The Gulf state denies it is offering support to the RSF and on Tuesday Mr Boulos said the bias Burhan spoke of was non-existent.\"He was making reference to something that does not exist, that has never been presented by us. So we have no idea what he is talking about,\" the AFP news agency reports Mr Boulos as saying while at a media briefing with UAE presidential adviser Anwar Gargash.In a video address on Sunday, Burhan said the latest peace plan proposal was \"the worst ever\" because it sidelines the army and \"allows the Rapid Support Forces to remain\".He accused Trump's adviser of attempting to impose conditions.\"We are not advocates of war, nor do we reject peace, but no-one can threaten us or impose conditions on us,\" he said.\"We fear that Massad Boulos may become an obstacle to the peace sought by all Sudanese.\"The US, Saudi Arabia, Egypt and UAE - collectively known as \"the Quad\" - proposed a three-month humanitarian truce to the two sides in September. They said the agreement should be followed by a permanent ceasefire and a transition to civilian rule.The army at the time rejected \"foreign interference\" - which observers say is a reference to the UAE - and any attempts that equated it with a \"racist terrorist militia that relies on foreign mercenaries\".The Sudanese army has repeatedly alleged that the UAE has been supplying the RSF with weapons and foreign fighters.UN experts say accusations of such military support are credible, but the Gulf nation has denied all involvement with the RSF.On Monday, the RSF announced a unilateral three-month ceasefire \"in response to international efforts, chiefly that of His Excellency US President Donald Trump\", to end the war.However, the army said on Tuesday that the RSF had attacked the town of Babanusa, the army's last stronghold in West Kordofan state. Earlier in November, Sudan's capital, Khartoum - which is held by the army - was hit by a drone attack the day after the RSF agreed to an earlier humanitarian ceasefire.The RSF's ceasefire declaration \"seems to be largely a political ploy\", Sudanese analyst Kholood Khair told the BBC's Newsday programme.\"The army has been so intransigent about the prospect of a truce and effectively it's a way of getting a political win in the eyes of the Quad, in particular the United States,\" Ms Khair the founder of Confluence Advisory think-tank said.Last week, Trump said he would intervene to help end the war, which has forced 12 million people from their homes and caused what the UN has called the world's worst humanitarian crisis.There has been no systematic recording of the number of people killed but in May 2024, then US special envoy for Sudan Tom Perriello pointed to estimates of up to 150,000.In recent weeks, reports of atrocities in the Sudanese city of el-Fasher have sparked international condemnation. The RSF has been accused of committing mass killings, ethnic cleansing and sexual violence after last month's seizure of the city, the last major location that remained outside of their control in the vast western region of Darfur.The paramilitary group, once an ally of the army, has repeatedly denied the abuses, though last month the militia's leader, Gen Mohamed Hamdan Dagalo, declared an investigation into \"violations\" committed by his soldiers.Both sides have been accused of war crimes during the conflict that erupted in April 2023.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sudan war: Donald Trump's envoy denies bias as the US pushes for peace plan",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7347/live/cc7b6080-ca1f-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-25T18:26:34.000Z",
      "dateModified": "2025-11-25T18:26:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US immigration: Families face separation as Haiti TPS scheme ends",
    "url": "https://www.bbc.com/news/articles/cly481gxwr8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/895f/live/a9b3c8e0-c0b9-11f0-8a6c-bdcd4bb2f081.jpg",
    "tag": "World",
    "date": "2025-11-25T02:40:30.000Z",
    "description": "Family reunited after a decade – now a Trump clampdown could tear them apart22 hours agoLiam Weir/BBCMarven says his life feels \"more complete\" now he",
    "body": "Family reunited after a decade – now a Trump clampdown could tear them apart22 hours agoLiam Weir/BBCMarven says his life feels \"more complete\" now he has got to know Rochelle and GuerlineNawal al-Maghafi and Jasmin DyerBBC World Service, FloridaIn a waterside house in the town of Lakeland, Florida, Marven laughs with two women he loves dearly - his sister Rochelle and their biological mother, Guerline.The warmth between them is unmistakable as they celebrate his 16th birthday, even though they spent a decade apart. Now they fear being separated again.Also celebrating is Stacey Nageli Angulo, who adopted Marven when he was three years old, from Haiti, in the wake of a devastating earthquake in 2010.She helped Guerline and Rochelle come to the US three years ago, reuniting the family, as spreading gang violence triggered a fresh humanitarian crisis in the Caribbean island nation.The two Haitian women, whose names we have changed for their safety, live and work legally in the US under a scheme called Temporary Protected Status (TPS). It provides protection for people already in the US who are from countries hit by war or natural disaster.But TPS is due to end for 350,000 Haitians in February, as part of US President Donald Trump's sweeping changes to immigration policies.Liam Weir/BBCMarven turned 16 recently, about three years after being reunited with his biological mother and sisterRochelle, now aged 21, cheers, as Marven blows out his candles, but Guerline's smile falters. In just a few months, the two women could be deported.After the earthquake, Guerline lived in Haiti's capital Port-au-Prince, struggling to provide for her children. She says offering Marven for adoption \"scarred\" her, but she \"wanted a better life for him\".Stacey, who now renovates properties after a career in the corporate world, says she felt compelled to adopt a child from Haiti in the aftermath of the disaster and raised Marven alongside her two biological children.More recently, hearing about the violence, she began researching legal routes to the US for Rochelle and Guerline. When a humanitarian scheme opened in 2023, they applied immediately. \"Three weeks later they were approved and on an airplane and here with us,\" she says.The two Haitian women moved into a caravan on Stacey's driveway, before renting an apartment locally. Guerline now works in a hotel. Rochelle has jobs at a supermarket and a nursery, and dreams of becoming a nurse.Marven often sleeps over at their apartment and loves the Haitian food Guerline cooks. He says his life now \"feels more complete\".But Rochelle and Guerline are terrified of returning to Haiti. The gang violence has displaced a tenth of the population, according to the UN, with kidnappings and killings rising sharply. Rape and arson are rampant.Getty ImagesGangs control much of Haiti's capital - Jimmy \"Barbecue\" Cherizier (centre), seen here in 2024, leads one of them Rochelle, now 21, says her biggest fear in Port-au-Prince was being kidnapped. \"I was at school and I've seen young girls like me get kidnapped,\" she says. \"They asked a ransom for them and then they didn't get them back,\" she says, adding that she believes some girls who are taken are either raped or killed.She says she receives harrowing videos from friends and relatives in Haiti every day, including bodies being burned and gang shootouts: \"There's gun fighting all the time. You can't really go out.\"Stacey voted for President Trump in the past three presidential elections but is now horrified that  Rochelle and Guerline could be sent back.\"Do we want open borders? Absolutely not. Do we want criminals deported? Absolutely,\" she says. \"But to rip families apart like ours and deport people to countries where it's absolutely unsafe… is unthinkable and unconscionable.\"ReutersMany of Haiti's 1.4m displaced people have moved into temporary shelters in schools and other buildingsTPS for Haitians has been extended repeatedly since it was first designated in 2010.But now the US Department for Homeland Security (DHS) says \"the environmental situation in Haiti has improved enough that it is safe for Haitian citizens to return home\".The US government, however, advises its citizens not to travel there, because of \"kidnapping, crime, terrorist activity, civil unrest\".The US immigration service says continuing the scheme for Haitians is not in US interests, citing difficulties vetting migrants and obtaining information from Haitian law enforcement agencies, coupled with the \"serious threat posed by Haitian gangs\".A spokesman for the DHS also told the BBC in September that TPS had been abused and exploited.The US administration says those whose TPS ends can leave voluntarily or pursue other immigration options. Lawyers say few will qualify to stay, and many will go underground.In Miami, another Haitian woman, who we are calling Monique, tells us she has lived in the US for more than 16 years. Her small home is lined with photos of her husband, son and daughter. She is the only one of them facing deportation - her husband is a permanent resident, her daughter is a US citizen and her son has a green card application in progress.Monique, who now works as a bus driver, came legally under a humanitarian programme before moving on to TPS in 2010.\"Yes, it's called Temporary Protected Status,\" she says. \"But it's temporary if your home is safe. Haiti is not safe.\"She wipes away tears, convinced she will lose everything and possibly die if she returns: \"Don't send us to Haiti… just kill us.\"Liam Weir/BBCStacey says she felt compelled to adopt a child in the aftermath of the 2010 earthquake in Haiti Over a million people hold TPS in the US, with people from 20 countries granted the protection since 1990.This year, the US has ended it for six countries - Afghanistan, Cameroon, Honduras, Nepal, Nicaragua and Venezuela. There have been multiple legal challenges, including one which delayed the end of TPS for Haitians.In Florida, where 56% of voters backed Donald Trump, many Republican supporters, like Stacey, told us they wanted to see immigration law enforced but were concerned about the human cost of current policies.She feels the Republican Party is \"completely out of touch\" with its voter base on immigration.Local businessman Sam Romain, who is the chair of Polk County Republicans, however,  is less sympathetic: \"You knew that it was temporary, you built your life on a temporary status and now… you're upset it's expiring. We knew what the rules were.\"When pressed on the situation in Haiti, he says he is not qualified to assess whether it is safe enough to return to, but believes the decision is made by qualified officials and he trusts their judgement.CLARENS SIFFROY/AFP via Getty ImagesWhole neighbourhoods have been attacked and destroyed in Port-au-PrinceMr Romain says he believes in America as \"a nation of law and order\" and adds that immigration reform \"does need to happen\".For Rochelle and Guerline, the future is filled with uncertainty.\"We were told America is the land of freedom and safety,\" says Rochelle. \"Now I don't know where we belong.\"\"I love my sister very much,\" says Marven. \"I don't know what I'd do if anything happened to her.\"The three pose together for a photograph - mother, son, and daughter. But in a few months' time, two of them could be gone.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US immigration: Families face separation as Haiti TPS scheme ends",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/895f/live/a9b3c8e0-c0b9-11f0-8a6c-bdcd4bb2f081.jpg"
      ],
      "datePublished": "2025-11-25T02:40:30.000Z",
      "dateModified": "2025-11-25T02:40:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nithari: Indian parents ask who killed their children as Surinder Koli freed in 'house of horrors' murders",
    "url": "https://www.bbc.com/news/articles/cvg42g3vp1vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1114/live/a70f6d30-c535-11f0-b4db-7fe51d77cd43.jpg",
    "tag": "World",
    "date": "2025-11-26T00:01:18.000Z",
    "description": "Who killed our children? Indian parents ask as 'house of horrors' convict acquitted1 hour agoGeeta PandeyNoida, Uttar PradeshGetty ImagesParents hold ",
    "body": "Who killed our children? Indian parents ask as 'house of horrors' convict acquitted1 hour agoGeeta PandeyNoida, Uttar PradeshGetty ImagesParents hold up photographs of the missing children of Nithari Nearly 20 years after police found the bodies of 19 women and children near a  bungalow dubbed India's \"house of horrors\", the case is back in the spotlight -  because Surinder Koli, the last of the two men convicted, has walked free.On 12 November, the Supreme Court acquitted him in the final case pending against him, accepting his claim that his confession - which included admissions of cannibalism and necrophilia - had been extracted under torture.The case dates back to December 2006, when police identified a bungalow in Noida, a suburb of the capital Delhi, as the site where women and children were killed and dismembered, and some allegedly raped. Businessman Moninder Singh Pandher and Surinder Koli, his servant, were arrested after body parts were found near their home.The revelations triggered national outrage. Parents accused police of ignoring complaints that children had been going missing for more than two years. The case also exposed India's deep social divides: this occurred in an affluent enclave, while the victims were mostly from the neighbouring slums of Nithari, home to poor migrant families.The two men were convicted of rape and murder and spent years on death row. Moninder Singh Pandher was freed in 2023, with the court eventually finding there to be a lack of evidence. Now his servant is out of jail too, bringing to an end the long judicial process in one of India's most disturbing criminal cases.Getty ImagesSurinder Koli walked free this month after the Supreme Court overturned his convictionThe BBC visited Nithari a few days after the judgement, and found that most of the victims' families no longer lived there. Two, who remain in the neighbourhood, said they were trying to come to terms with the court order and wondering - \"if Pandher and Koli didn't, then who killed our children?\"In interviews since his release, Moninder Singh Pandher has said he was innocent. Surinder Koli has not been seen in public since leaving prison and has not said anything, but his lawyer Yug Mohit Chaudhry said \"all the evidence against him was fabricated\".\"After 19 years, in the 13 cases in which he had been sentenced to death, he had already been proven innocent in 12 of them. One case was left, in which five courts had declared him guilty and gave the death sentence.\"Today, the Supreme Court has overturned those earlier four or five judgments in that case as well… These were extremely serious charges, but all the evidence was fabricated,\" Mr Chaudhry told PTI news agency.\"This poor man was framed to protect some powerful person. Every bit of evidence was fake, not a single piece could justify a conviction… You should ask this question to the CBI [the federal Central Bureau of Investigation], because it is clear that the CBI, despite knowing who the real culprit was, created false evidence against these innocent people and trapped them. Ask these questions to the CBI,\" he added. The CBI has not commented on the acquittal. The BBC has sent detailed questions to police in Uttar Pradesh state, where Noida is located, but hasn't received a response yet. Many in Nithari are finding it very difficult to come to terms with the verdict.\"If they are innocent, then how come they were in prison for 18 years?\" asks Sunita Kanaujia, tears rolling down her cheeks. Her 10-year-old daughter Jyoti went missing in the summer of 2005. DNA tests later confirmed that she was among the victims. \"God will not forgive those who killed her,\" she says.Sunita's husband Jhabbu Lal Kanaujia, who was instrumental in unearthing the serial killings, says he felt utter despair after hearing of Surinder Koli's acquittal and burned all the papers related to the case he had collected over the years.For years, he worked as a \"press-wallah\" - ironing clothes of the locality's affluent residents - right outside Moninder Singh Pandher's house.For 15 months after his daughter went missing, he visited the police station regularly.\"When someone goes missing, there's no closure. It becomes a wound. It festers. You always wonder where they are, in what condition?\" he says.On a cold December day in 2006, he was one of the people who climbed down into a sewer to dig out skulls, bones and limbs. The number of skulls, he says, was \"many times higher\" than the 19 cases that went to court.Today, the questions he keeps asking repeatedly are: \"If they are not guilty, then who is? And what happened to our children then?\"The acquittal of the two men has snatched away his sense of closure and opened old wounds. But, he says, he's no longer certain that he has any fight left in him. \"I'm an old man, I'm a broken man,\" he says.Getty ImagesJhabbu Lal Kanaujia and his wife Sunita want to know who killed their 10-year-old daughterIn its order, the top court said that \"the offences in Nithari were heinous, and the suffering of the families is beyond measure\".The judges acquitted Surinder Koli, saying courts had earlier mainly relied on his confession while convicting him, but they said they did not believe it had been voluntary. They noted it was recorded after he had been in custody for 60 days and \"it appeared he was being tutored\". The presence of the police investigator near him raised serious questions, the judges said.The court criticised the police and investigating agencies for carrying out a flawed investigation, marked by \"negligence and delay\" because of which \"the true offender\" had not been identified.It said the investigators had \"opted for the easy course by implicating a poor servant of the house and demonising him\".The order also pointed out that the investigators \"did not look into leads, including the organ-trade angle flagged by a governmental committee\" of the Ministry of Women and Child Development. Reports at the time had suggested that the bodies had been cut with surgical precision.Jhabbu Lal says \"unless the erring policemen are arrested, we won't get justice\".The anger against police in Nithari is not new. When parents of missing children approached police, their standard response - particularly to parents of girls - was that they had eloped with a lover, says Pappu Lal, whose daughter Rachna was among the victims.She went missing on 10 April 2006 after she went to visit her grandparents who lived two houses away from the bungalow number D5. After searching for her in the neighbourhood, the family went to the police who told them that their eight-year-old had most likely eloped with a lover. Police did not respond to BBC questions on this.Courtesy Pappu LalPappu Lal says when Rachna, eight, disappeared in April 2006, police told him she had eloped with a loverPappu Lal says he travelled to other cities and states to look for Rachna. His search ended eight months later in the lane behind D5 where Rachna's clothes and slippers were found.After the first set of skulls and bones were discovered, the residents stormed the house and attacked the police. Two senior officials were transferred and six policemen suspended.The case was then handed over to the federal investigators.\"If the police had taken action on time, Rachna could have been saved. Many children could have been saved,\" says Pappu Lal.\"It's a sad state of affairs,\" says Aruna Arora, who was the president of the Residents' Welfare Association for the area in 2006. \"How can anyone have faith in the criminal justice system any more?\"Ms Arora says she was deeply disturbed by reports of children disappearing in her area and went to meet senior police officials and the district magistrate.\"But these children were all from poor families so no-one took it seriously. It was only after bones and skulls and body parts were found that the authorities got into the action,\" she says. Police did not respond to a request for comment.Pappu Lal takes us around the neighbourhood to point out the different spots that figure prominently in the murders.Geeta Pandey/BBC NewsPappu Lal's daughter Rachna's remains were among those found near bungalow D5D5 -  the squat bungalow - now sits derelict, out of place among a row of plush, well-kept homes. Abandoned for years, it is scarred by soot from a 2014 fire that gutted parts of the structure. Its entrance is sealed with a crude brick-and-mud wall, and an overgrown bougainvillea, bright with pink blooms, spills over the front boundary. In the open sewer outside, plastic bags and bottles drift through charcoal-grey sludge, its stench thick in the air.We then walk to the rear of the house where Pappu Lal points out the area where body parts and victims' belongings were found.\"I still cannot forget the horrors of those days,\" he says, voice choking with emotion. But he is determined to not give up. \"I will go to the police and lodge a fresh complaint. They have to find out who killed our children.\"He now wants to meet Prime Minister Narendra Modi and the state Chief Minister Yogi Adityanath to seek their help in getting justice.\"Our fight now is with the government. They also have some responsibility to ensure that criminals are punished. Aren't our children India's children?\" he asks.Anupam Nagolia of Better World Foundation charity that helped Pappu Lal and other victims by arranging lawyers for them, however, says that it seems to be the end of the road for the victims' families.\"The judgement was given by the highest bench in the highest court in the country. I don't see any other forum where they can appeal now.\"So what should they do? \"Now the only option for the victims' families is to cry, be unhappy and grieve,\" Mr Nagolia says.Some legal experts say the families do have one final option - they can petition the Supreme Court to order a reinvestigation.Retired Supreme Court Justice Madan Lokur says it's unlikely to yield any result. \"Because such a lot of time has elapsed, the evidence would have disappeared and the possibility of a reinvestigation is impossible.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nithari: Indian parents ask who killed their children as Surinder Koli freed in 'house of horrors' murders",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1114/live/a70f6d30-c535-11f0-b4db-7fe51d77cd43.jpg"
      ],
      "datePublished": "2025-11-26T00:01:18.000Z",
      "dateModified": "2025-11-26T00:01:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]