[
  {
    "title": "New Zealand police recovers $19k Fabergé egg swallowed by suspected thief",
    "url": "https://www.bbc.com/news/articles/cj4qedglzpwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3e76/live/9853e860-d175-11f0-871c-7976d9132d31.jpg",
    "tag": "World",
    "date": "2025-12-05T01:13:09.000Z",
    "description": "A diamond-studded locket swallowed by a New Zealand man who tried to steal it has been \"recovered\", police say.The Fabergé egg locket, valued at NZ$33",
    "body": "A diamond-studded locket swallowed by a New Zealand man who tried to steal it has been \"recovered\", police say.The Fabergé egg locket, valued at NZ$33,585 ($19,300; £14,600), was recovered in a \"natural\" manner. \"Medical intervention [was] not required,\" they told the BBC.This comes about a week after police arrested the 32-year-old man at Partridge Jewellers in central Auckland, minutes after he allegedly ate the locket.The ingested loot is set with 60 white diamonds and 15 blue sapphires, according to the jeweller's website, and opens to reveal an 18-carat gold miniature octopus.The man has been charged with theft.Earlier this week, New Zealand police said the man had undergone a medical assessment and is constantly being monitored.\"Given this man is in police custody, we have a duty of care to continue monitoring him given the circumstances of what has occurred,\" police said then.The Octopussy egg, as it is named, was inspired by the 1983 James Bond film of the same name, which centres on an elaborate Fabergé egg heist.Fabergé is a world-renowned jeweller founded in Russia more than two centuries ago, famous for its eggs made of gems and precious metals.Partridge Jewellers said the locket will be returned to Fabergé, Radio NZ reported.The suspect is due to appear in court again on 8 December.According to charge sheets seen by the BBC, he has also been charged with allegedly stealing an iPad from the same jewellery store on 12 November and making away with cat litter and flea control products worth NZ$100 from a private address a day after.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New Zealand police recovers $19k Fabergé egg swallowed by suspected thief",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3e76/live/9853e860-d175-11f0-871c-7976d9132d31.jpg"
      ],
      "datePublished": "2025-12-05T01:13:09.000Z",
      "dateModified": "2025-12-05T01:13:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Meghan reaches out to estranged father Thomas after amputation reports, spokesman says",
    "url": "https://www.bbc.com/news/articles/c0je4v8j0vzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4f01/live/36e37940-d21c-11f0-be90-7bfb24e8b1c8.jpg",
    "tag": "World",
    "date": "2025-12-05T21:29:42.000Z",
    "description": "15 hours agoDaniela Relph,Royal correspondentandAmy WalkerThe Duchess of Sussex has attempted to contact her estranged father, Thomas Markle, who is r",
    "body": "15 hours agoDaniela Relph,Royal correspondentandAmy WalkerThe Duchess of Sussex has attempted to contact her estranged father, Thomas Markle, who is reported to be seriously ill in hospital in the Philippines.A spokesman for Meghan said: \"I can confirm she has reached out to her father.\"Mr Markle is reported to have had his leg amputated during surgery. The BBC understands that Meghan tried to contact him earlier today, but it is not clear whether the attempt was successful. The relationship between Meghan and her father broke down in the run-up to her wedding to Prince Harry in 2018.During the couple's engagement, the media interest in Thomas Markle and his family was intense. Mr Markle was found to have colluded with photographers who paid him for photos appearing to show the father of the bride preparing for the wedding.The fallout saw him pull out of his daughter's wedding just days before the ceremony in Windsor, citing health problems.King Charles III - who was then the Prince of Wales - walked Meghan down the aisle instead.It is not clear if Meghan ever resumed any proper relationship with her father following her marriage. Thomas Markle is not believed to have met Harry and Meghan's children, Prince Archie and Princess Lilibet.He was critical of his daughter and son-in-law's decision to step back from public duty in the UK and criticise the royal family. In one media interview he said: \"I think they're both turning into lost souls at this point.\"\"I don't know what they're looking for,\" he added. \"I don't think they know what they're looking for.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Meghan reaches out to estranged father Thomas after amputation reports, spokesman says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4f01/live/36e37940-d21c-11f0-be90-7bfb24e8b1c8.jpg"
      ],
      "datePublished": "2025-12-05T21:29:42.000Z",
      "dateModified": "2025-12-05T21:29:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Woman wanted by Interpol for trafficking tiger parts arrested in India ",
    "url": "https://www.bbc.com/news/articles/c4gp8vjwll2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c6c0/live/d3eaf250-d1f8-11f0-a732-cbe19f3047f2.jpg",
    "tag": "World",
    "date": "2025-12-05T18:13:48.000Z",
    "description": "18 hours agoAnbarasan EthirajanGlobal affairs reporterGetty ImagesFile picture of a Royal Bengal tiger in Assam State ZooA woman accused of being one ",
    "body": "18 hours agoAnbarasan EthirajanGlobal affairs reporterGetty ImagesFile picture of a Royal Bengal tiger in Assam State ZooA woman accused of being one of the world's most wanted traffickers of tiger body parts has been arrested in India, officials have said. Yangchen Lachungpa, who was detained earlier this week, is accused of playing a critical role in building trafficking corridors leading out of the country to smuggle  tiger parts out of the country. Lachungpa had been on Interpol's most-wanted list, and her bail plea was rejected during a court appearance on Thursday. Wildlife officials said that Ms Yangchen's arrest was a major breakthrough in the battle against poaching in India. It is rare for a woman to be arrested in connection with the illegal trade of animal body parts. Police had been looking for Lachungpa for several years. She was arrested following a co-ordinated operation between the Madhya Pradesh State Tiger Strike Force and the Wildlife Crime Control Bureau, the environment ministry said on Friday.  It added that Lachungpa was a key member of an organised trafficking network which has links to Nepal, Tibet and Bhutan, as well having operations in several Indian cities including Delhi.Lachungpa had been arrested in 2017but disappeared after being granted bail.Another man accused at the time, Jai Tamang, and who was arrested in 2015, told police that he had given Lachungpa wildlife contraband in exchange for shelter. Tiger parts are in demand in China where they have been used in traditional medicine.The International Fund for Animal Welfare says that there were 26 documented cases of tiger poaching in 2024, with 56 cases the proceeding year. But it adds that there were likely \"many more\" tigers were likely poached as many are found dead without evidence of poaching. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Woman wanted by Interpol for trafficking tiger parts arrested in India ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c6c0/live/d3eaf250-d1f8-11f0-a732-cbe19f3047f2.jpg"
      ],
      "datePublished": "2025-12-05T18:13:48.000Z",
      "dateModified": "2025-12-05T18:13:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "At least 11 killed in South Africa mass shooting",
    "url": "https://www.bbc.com/news/articles/cwyvkrkl2jlo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9281/live/dee9c030-d290-11f0-ad8c-41f43adb6496.png",
    "tag": "World",
    "date": "2025-12-06T10:51:32.000Z",
    "description": "At least 11 people have been killed in a mass shooting at a hostel in South Africa.Fourteen others were wounded when gunmen stormed the venue in Sauls",
    "body": "At least 11 people have been killed in a mass shooting at a hostel in South Africa.Fourteen others were wounded when gunmen stormed the venue in Saulsville township, west of the capital Pretoria, early on Saturday. A three-year-old is among the dead.\"At least three unknown gunmen entered this hostel where a group of people were drinking and they started randomly shooting,\" police spokesperson Brigadier Athlenda Mathe said.The motive of the shooting is unknown and no arrests have been made. It is the latest in a string of mass shootings that have rocked the crime-ridden country in recent years.The gunmen reportedly entered the premise at 04:30 local time (14:30 GMT) and opened fire on a group of men who were drinking. A 12-year-old boy and a 16-year-old girl were among those killed in the attack.\"I can confirm that a total of 25 people were shot,\" Mathe said. Describing the hostel as an \"illegal shebeen\", she added: \"We are having a serious challenge when it comes to these illegal and unlicensed liquor premises,\" where she said the majority of mass shootings occur.\"Innocent people also get caught up in the crossfire,\" she told public broadcaster SABC.South Africa has one of the highest murder rates in the world, at 45 people per 100,000 according to 2023-24 figures from the United Nations Office on Drugs and Crime.Some 63 people were killed every day between April and September, according to police data.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "At least 11 killed in South Africa mass shooting",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9281/live/dee9c030-d290-11f0-ad8c-41f43adb6496.png"
      ],
      "datePublished": "2025-12-06T10:51:32.000Z",
      "dateModified": "2025-12-06T10:51:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shinzo Abe: Man who killed ex-Japan PM apologises to his family",
    "url": "https://www.bbc.com/news/articles/cy0pwgrdlnjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/24d0/live/41db5e40-d180-11f0-906e-43a4773aef1d.jpg",
    "tag": "World",
    "date": "2025-12-05T02:25:07.000Z",
    "description": "The man accused of assassinating former Japanese prime minister Shinzo Abe has apologised to the ex-leader's family for the first time.Tetsuya Yamagam",
    "body": "The man accused of assassinating former Japanese prime minister Shinzo Abe has apologised to the ex-leader's family for the first time.Tetsuya Yamagami, who earlier pleaded guilty to murder, told the court on Thursday that he felt \"deeply sorry\" towards Abe's widow, Akie.Yamagami used a homemade gun to shoot Abe during a political campaign event in the western city of Nara on 8 July 2022. He died in the hospital on the same day.Abe's death sent shockwaves around the world. He was known for his hawkish foreign policy and a signature economic strategy that popularly came to be known as \"Abenomics\".\"I have caused [the family] three and a half years of suffering... I have no excuse,\" Yamagami told the court on Thursday, according to local media.He reportedly told investigators he attacked Abe because he blamed the ex-prime minister for allegedly promoting the Unification Church, which Yamagami said had bankrupted his mother and the wider family.Yamagami's allegations prompted investigations into the Unification Church, which started in South Korea and is known for its mass weddings.In March this year, a Tokyo court ordered the church to disband - a ruling that the church said it would \"fight to the end\".The Unification Church has drawn controversy even before Abe's assassination, for teaching that marriage is central to spiritual salvation.Abe's grandfather Nobusuke Kishi, who was also Japan's prime minister, was known to have been close to the Unification Church because of its anti-communist nature. Abe himself had spoken at events related to the group.During a hearing last month, prosecutors read out a statement from Abe's widow in which she wrote: \"The sorrow of losing a husband will not be relieved.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shinzo Abe: Man who killed ex-Japan PM apologises to his family",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/24d0/live/41db5e40-d180-11f0-906e-43a4773aef1d.jpg"
      ],
      "datePublished": "2025-12-05T02:25:07.000Z",
      "dateModified": "2025-12-05T02:25:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "IndiGO: Travel chaos worsens in India with hundreds of flights cancelled",
    "url": "https://www.bbc.com/news/articles/clyz18z1gk0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4fe0/live/a27df300-d1be-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-12-05T09:15:16.000Z",
    "description": "India's travel chaos has worsened after the country's largest airline IndiGo cancelled hundreds of scheduled flights on Friday after three days of wid",
    "body": "India's travel chaos has worsened after the country's largest airline IndiGo cancelled hundreds of scheduled flights on Friday after three days of widespread disruption across its network.The carrier, which has a 60% market share in India and flies more than 2,000 flights a day, has been facing pilot shortages after it failed to adapt to new crew rostering rules.Thousands of passengers are stranded across India in what's a busy travel season, with all IndiGo flights from the capital Delhi cancelled.IndiGo has said operations will return to full normalcy only by 10 February, and has sought temporary relief on the new rules that call for more rest hours and restricted night-duty.The airline has also said it will reduce its flight operations to minimise disruptions from 8 December. The government has said it is closely monitoring the situation with the federal aviation minister expressing \"clear displeasure\" with how the airline had handled the situation. In a separate statement, India's aviation regulator said the disruptions were primarily on account of \"misjudgment and planning gaps\" in implementing the new flight duty time limitation rules. The regulator has directed IndiGo to submit a detailed plan on crew recruitment,  training, roster restructuring, safety-risk assessments and other mitigation measures with immediate effect.Local media reports say IndiGo has been granted a waiver from the new pilot rest rules, and the ban on combining pilot leave with weekly rest has been eased to stabilise operations. The BBC has not been able to independently verify this.But the airline has attracted sharp criticism from the Airline Pilots Association of India, which said any relief granted to the airline on duty timings undermines the spirit of the new regulations and \"gravely\" compromises the safety of the flying public. Under the new rules pilots are given more rest, with one of the major changes mandating pilots to make two night-time landings per week, down from six under the old rules.December is a busy travel month in India, when school holidays and the peak wedding season gets under way. IndiGo has said it will waive off all cancellation/reschedule requests for travel between 5 and 15 December. It is also arranging for hotel rooms and food for passengers whose travel has been disrupted. But several passengers have taken to social media, expressing anger about not being given up-to-date information and remaining stranded at the airport without food. Singapore's High Commissioner to India Simon Wong said he was \"lost for words\" as he joined the thousands stranded at the airport, having to miss the wedding of his young staff member. Major airports in Delhi, Mumbai and other cities have issued advisories asking passengers to check the status of their flights before heading to the airport. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "IndiGO: Travel chaos worsens in India with hundreds of flights cancelled",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4fe0/live/a27df300-d1be-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-12-05T09:15:16.000Z",
      "dateModified": "2025-12-05T09:15:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New clashes break out between Pakistan and Afghanistan",
    "url": "https://www.bbc.com/news/articles/cn09zp87pz8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c186/live/8b28ec90-d25a-11f0-a3ed-031197c916c2.jpg",
    "tag": "World",
    "date": "2025-12-06T08:23:37.000Z",
    "description": "Border clashes have erupted again between Pakistan and Afghanistan's Taliban forces, with each sides accusing the other of breaking a fragile ceasefir",
    "body": "Border clashes have erupted again between Pakistan and Afghanistan's Taliban forces, with each sides accusing the other of breaking a fragile ceasefire.Residents fled the Afghan city of Spin Boldak overnight, which lies along the 1,600-mile (2,600 km) border between the two countries.A medical worker in the nearby city of Kandahar told BBC Pashto that four bodies had been brought to a local hospital. Four other people were wounded. Three were reportedly wounded in Pakistan.There has been sporadic fighting between the two countries in recent months, while Afghanistan's Taliban government has also accused Pakistan of carrying out air strikes inside the country.Both sides have confirmed they exchanged fire overnight but each blamed the other for initiating the four hours of fighting. Mosharraf Zaidi, a spokesperson for Pakistan's Prime Minister Shehbaz Sharif, accused the Taliban of \"unprovoked firing\".The statement continued: \"An immediate, befitting & intense response has been given by our armed forces. Pakistan remains fully alert & committed to ensuring its territorial integrity & the safety our citizens.\"Meanwhile, a Taliban spokesperson said Pakistan had \"once again initiated attacks\" and said it was \"forced to respond\".Residents on the Afghan side of the border said the exchange of fire started at around 22:30 (18:00 GMT) on Friday.Footage from the area showed a large number of Afghans fleeing on foot and in vehicles. Ali Mohammed Haqmal, head of Kandahar's information department, said Pakistan's forces had attacked with \"light and heavy artillery\" and civilian homes had been hit by mortar fire.The latest clashes came less than two months after both sides agreed to a ceasefire mediated by Qatar and Turkey.It ended more than a week of fighting in which dozens were killed - the worst clashes between Pakistan and the Taliban since the group returned to power in 2021 - though tensions have remained high.The government in Islamabad has long accused Afghanistan's ruling Taliban of giving shelter to armed groups which carry out attacks in Pakistan.The Taliban government denies the accusation and has accused Pakistan of blaming others for their \"own security failures\".The Pakistan Taliban have carried out at least 600 attacks on Pakistani forces over the past year, according to the Armed Conflict Location & Event Data Project.Last week delegations from both sides met in Saudi Arabia for a fourth round of negotiations on a wider peace settlement, but did not reach an agreement.Sources familiar with the talks told BBC News that both sides had agreed to continue with the ceasefire.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New clashes break out between Pakistan and Afghanistan",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c186/live/8b28ec90-d25a-11f0-a3ed-031197c916c2.jpg"
      ],
      "datePublished": "2025-12-06T08:23:37.000Z",
      "dateModified": "2025-12-06T08:23:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jeffrey Epstein: US judge orders unsealing of grand jury records from abandoned case",
    "url": "https://www.bbc.com/news/articles/c4ge8p0n0zko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/66e9/live/f42e0d10-d20a-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-12-05T19:44:24.000Z",
    "description": "A US judge has ordered the unsealing of grand jury transcripts from the 2005 and 2007 investigation into convicted paedophile Jeffrey Epstein. The Flo",
    "body": "A US judge has ordered the unsealing of grand jury transcripts from the 2005 and 2007 investigation into convicted paedophile Jeffrey Epstein. The Florida judge granted the justice department's request for the material following Congress' passage last month of a bill ordering the release of all files on the disgraced financier. The law \"applies to unclassified records, documents, communications, and investigative materials\" that relate to Epstein and his accomplice-girlfriend Ghislaine Maxwell, the court order said.A similar Department of Justice request was rejected in August because it violated a federal rule on grand jury materials, which the newly signed law overrides.US District Judge Rodney Smith granted the government's expedited motion to unseal the typically secret grand jury transcripts and modify a protective order that previously barred the release of the materials. In Friday's order, reviewed by the BBC, Judge Smith noted \"the later-enacted and specific language of the Act trumps prohibition on disclosure\".The justice department is also requesting the unsealing of documents in New York from Epstein's 2019 sex-trafficking case and Maxwell's 2021 sex-trafficking case.The documents relate to a case investigating whether Epstein abused underage girls. It ended without any federal charges being filed against the late financier. Epstein's struck a controversial non-prosecution agreement in 2008 and pleaded guilty to lesser state prostitution charges.Questions have swirled ever since about how Epstein was allowed to avoid federal sex-trafficking charges.US President Donald Trump signed the Epstein Files Transparency Act into law last month after previously rejecting calls to release the files, which have dogged him during his second term in office. The law compels the justice department, FBI and federal prosecutors by 19 December to disclose the tranche of materials amassed during investigations into Epstein, who died in jail in 2019 while awaiting trial.Maxwell, who is serving a 20-year sentence for sex trafficking, was moved from a Florida prison to a new minimum-security facility in Texas in August. On Wednesday, Maxwell's attorney filed a letter in Manhattan federal court asking to be released early. While the transparency law gives the justice department 30 days to release the files, it also allows it to withhold material related to an active criminal investigation, identify victims of Epstein's abuse or invade their privacy, or contain images of physical and child sex abuse, death, or injury.Material that could jeopardize an active federal investigation, is classified or that pertains to national defence or foreign policy is typically not made public, per justice department policy.Earlier this week, Democrats on the House Oversight Committee released images of Epstein's infamous island.The photos showed several bedrooms in the US Virgin Islands home, as well as a room with masks on a wall and a phone with names written on speed-dial buttons.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jeffrey Epstein: US judge orders unsealing of grand jury records from abandoned case",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/66e9/live/f42e0d10-d20a-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-05T19:44:24.000Z",
      "dateModified": "2025-12-05T19:44:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Russia bombards Ukraine as US says progress made in talks with Kyiv",
    "url": "https://www.bbc.com/news/articles/clydxj7my84o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/014f/live/554cde70-d290-11f0-ad8c-41f43adb6496.jpg",
    "tag": "World",
    "date": "2025-12-06T11:34:21.000Z",
    "description": "50 minutes agoNardine SaadandHarry SekulichReutersRussia targeted a railway depot in the town of Fastiv outside KyivRussia has launched a major aerial",
    "body": "50 minutes agoNardine SaadandHarry SekulichReutersRussia targeted a railway depot in the town of Fastiv outside KyivRussia has launched a major aerial bombardment against Ukrainian infrastructure targets as talks between the US and Ukraine in Florida are set to enter a third day.Overnight Russia launched 653 drones and 51 missiles, most of which were downed, authorities said. One strike hit a railway hub at the town of Fastiv outside Kyiv, destroying the main station building and damaging rolling stock.President Volodymyr Zelensky said the attack had been \"meaningless from a military point of view, and the Russians could not have been unaware of this\".Earlier US and Ukrainian negotiators urged Russia to show a \"serious commitment to long-term peace\" after talks in Moscow failed to produce a breakthrough.Moscow has intensified attacks on Ukraine's energy sector and infrastructure in recent weeks. On Saturday Ukraine's energy ministry said Russian attacks had hit energy facilities in eight regions, causing blackouts. Meanwhile the UN's nuclear watchdog said the Zaporizhzhia nuclear power plant temporarily lost all external power overnight - the 11th time this has happened since Russia's full-scale invasion of its neighbour.The Russian defence ministry said it had launched a \"massive strike\" in response to what it called Ukrainian attacks on civilian targets.\"Russia continues to disregard any peace efforts and instead strikes critical civilian infrastructure,\" Ukrainian Foreign Minister Andrii Sybiha said.\"This shows that no decisions to strengthen Ukraine and raise pressure on Russia can be delayed. And especially not under the pretext of peace process,\" he added.In Florida, a statement posted by US special envoy Steve Witkoff said two days of talks with Rustem Umerov, secretary of Ukraine's national security council, had been \"constructive\".Witkoff and Umerov \"agreed on the framework of security arrangements\" that could such an agreement and \"discussed necessary deterrence capabilities to sustain a lasting peace\", their statement said without giving details.The prospect of ending the war depended on Russia's readiness to take \"steps towards de-escalation and cessation of killing\", the statement added.The negotiations, which are also attended by US President Donald Trump's son-in-law Jared Kushner, will continue for a third day on Saturday. The Florida talks saw Ukraine's team briefed on a recent meeting between Witkoff, Trump's most senior overseas envoy, and Russian President Vladimir Putin.ReutersThe strike in Fastiv damaged locomotivesWitkoff spent almost five hours with Putin in Moscow on Tuesday, after which the Kremlin said \"no compromise\" had been reached on a draft US peace plan. The Kremlin said Putin was ready to continue meeting the Americans \"as many times as needed\", but Ukraine and its allies in Europe have called into question the Russian leader's commitment to ending the war.On Friday, Ukrainian President Volodymyr Zelensky said he wanted to \"obtain full information about what was said in Moscow and what other pretexts Putin has come up with to drag out the war\".Kyiv pushed for revisions to the initial US peace plan, which was widely seen as favourable to Moscow when an initial version leaked to the media. An updated version has not been shared publicly.Major points of contention remain between the two sides, including security guarantees for Ukraine post-war and territorial concessions. Russia currently controls roughly one-fifth of Ukraine's territory, including swathes of the Donbas area in the east – made up of the Donetsk and Luhansk regions. In an interview with India Today on Friday, Putin warned Ukrainian troops to withdraw fully from the region this week, saying Russia would otherwise \"liberate these [Donbas] territories by force\".Kyiv and its European allies believe the most effective way to deter Russia from attacking again in the future would be to grant Ukraine membership of Nato, or to provide comprehensive security guarantees. Russia is staunchly opposed, while Trump too has repeatedly signalled he has no intention of letting Ukraine join the military alliance.The prospect of Ukraine joining Nato was a \"key question\" that was tackled in Moscow, the Kremlin said on Wednesday.Trump said those talks were \"reasonably good\", but it was too soon to say what would happen as \"it does take two to tango\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Russia bombards Ukraine as US says progress made in talks with Kyiv",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/014f/live/554cde70-d290-11f0-ad8c-41f43adb6496.jpg"
      ],
      "datePublished": "2025-12-06T11:34:21.000Z",
      "dateModified": "2025-12-06T11:34:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US Supreme Court agrees to hear case challenging birthright citizenship",
    "url": "https://www.bbc.com/news/articles/c208j0wrzrvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/12a7/live/f7be8d50-c937-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-12-05T21:54:01.000Z",
    "description": "15 hours agoBrandon Drenon,Washington DC andMadeline HalpertThe US Supreme Court has agreed to hear a case on whether some children born in the US hav",
    "body": "15 hours agoBrandon Drenon,Washington DC andMadeline HalpertThe US Supreme Court has agreed to hear a case on whether some children born in the US have a constitutional right to citizenship.On his first day in office in January, President Donald Trump signed an order to end birthright citizenship for those born to parents who are in the country illegally, but the move was blocked by multiple lower courts.No date has been set yet for the Supreme Court arguments, and a ruling is months away.Whatever the court decides could have major implications for Trump's immigration crackdown and for what it means to be an American citizen.For nearly 160 years, the 14th Amendment of the US Constitution has established the principle that anyone born in the country is a US citizen, with exceptions for children born to diplomats and foreign military forces.The language of the amendment states: \"All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States.\"Trump's executive order seeks to deny citizenship to the children of people who are either in the US illegally or are in the country on temporary visas. It is part of the Trump administration's broader effort to reform the nation's immigration system and combat what they have called \"significant threats to national security and public safety\".The administration has argued the 14th Amendment clause \"subject to the jurisdiction thereof\" means the amendment excludes children of people who are not in the country permanently or lawfully.Cecillia Wang, national legal director of the American Civil Liberties Union, which is representing the plaintiffs in the case, told the BBC's news partner CBS that no president can change the 14th Amendment's fundamental promise of citizenship.\"For over 150 years, it has been the law and our national tradition that everyone born on U.S. soil is a citizen from birth,\"  Ms Wang said in a statement. \"We look forward to putting this issue to rest once and for all in the Supreme Court this term,\" she added.The US is one of about 30 countries - mostly in the Americas - that grant automatic citizenship to anyone born within their borders.After legal challenges were brought to Trump's executive order, several federal  court judges ruled that it violated the Constitution, while two federal circuit courts of appeals upheld injunctions blocking the order from going into effect.Trump then went to the Supreme Court to fight the injunctions. In a win for Trump, the court ruled in June that the injunctions issued by the lower courts exceeded their authority, though it did not address the issue of birthright citizenship itself. The 14th Amendment was passed in the wake of the US Civil War in order to settle the question of the citizenship of freed, American-born former slaves.US Solicitor General D John Sauer has argued that the amendment was adopted \"to confer citizenship on the newly freed slaves and their children, not on the children of aliens temporarily visiting the United States or of illegal aliens\".He has said it's a \"mistaken view\" that birth on US soil confers citizenship and has argued that that understanding has had \"destructive consequences\"About 250,000 babies were born to unauthorised immigrant parents in the US in 2016 - a 36% decrease from a peak in 2007, according to The Pew Research Center.By 2022, the latest year that data is available, there were 1.2 million US citizens born to unauthorised immigrant parents, Pew found.A study published in May by the thinktank Migration Policy Institute and Pennsylvania State University's Population Research Institute suggested that repealing birthright citizenship could increase the size of the unauthorized population in the US by an additional 2.7 million by 2045 and by 5.4 million by 2075.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US Supreme Court agrees to hear case challenging birthright citizenship",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/12a7/live/f7be8d50-c937-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-12-05T21:54:01.000Z",
      "dateModified": "2025-12-05T21:54:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Putin in India: Russia ready to provide 'uninterrupted' fuel supplies",
    "url": "https://www.bbc.com/news/articles/c4g482m3yyzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3c5c/live/b75f4f30-d1c3-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-12-05T12:50:31.000Z",
    "description": "24 hours agoVikas Pandey,DelhiandRuth ComerfordRussian President Vladimir Putin has said Moscow is ready to provide \"uninterrupted shipments\" of fuel ",
    "body": "24 hours agoVikas Pandey,DelhiandRuth ComerfordRussian President Vladimir Putin has said Moscow is ready to provide \"uninterrupted shipments\" of fuel to India, as Delhi faces pressure from the US to stop buying Russian oil.Putin, speaking alongside Indian Prime Minister Narendra Modi in Delhi, questioned earlier why India should be punished for buying oil when the US itself buys nuclear fuel from Moscow.President Donald Trump has imposed 50% tariffs on most Indian products, arguing that Delhi's continued purchases of Russian oil helped fund the war in Ukraine - an accusation India denies.Putin's visit comes as the US holds a series of talks with Russia and Ukraine in an attempt to broker a peace deal to end the war. On Thursday, Putin told India Today that Russia was working on a \"peaceful solution\" to ending the war - warning that Ukraine must withdraw from the Donbas or Russia would seize it.\"Either we liberate these territories by force, or Ukrainian troops will leave these territories,\" he said. Modi repeated India's stance that it was not neutral on the war in Ukraine and stood on \"the side of peace\", welcoming efforts to find a \"lasting\" solution to end the war. He highlighted that increasing the \"connectivity\" of Russia and India was a \"major priority\" for India.In recent months, India-US ties have hit an all-time low as the two countries have failed to resolve the tariff deadlock. Trump initially imposed a 25% tariff on India, but announced an additional 25% later as a penalty for Delhi's purchase of Russian oil - a move the Indian government called \"unfair, unjustified and unreasonable\" at the time.  In his interview with India Today, Putin commented on the US tariffs on India for buying Russian oil, and said that India should have the same opportunities available as the US.\"The United States itself still buys nuclear fuel from us for its own nuclear power plants. If the US has the right to buy our fuel, why shouldn't India have the same privilege?,\" he asked.Russia remained the US' top supplier of nuclear reactor fuel last year, Bloomberg reported in September - citing data from the Department of Energy. A ban on enriched uranium imports from the country was enshrined into law in May.  The two leaders exchanged memorandums during Friday's briefing, outlining mutual objectives in areas including trade and agriculture.Modi announced two new 30-day visa schemes for Russian tourists visiting India, and said that two new Indian consulates had opened in Russia.Russia Today, a Kremlin-funded, state-controlled TV network, would also be launched in India, the prime minister said.No major defence deals were announced, but the two men said there were agreements signed on shipbuilding, investments in civil nuclear energy and critical minerals.India and Russia also agreed on an economic programme valid until 2030, the leaders said, spanning jobs, shipping and the health industry.Putin said he was confident about increasing current bilateral trade from $60bn to $100bn in the coming years.Modi said that \"energy security has been a strong and important pillar of the India-Russia partnership\", but made no specific reference to oil.India - the world's third largest consumer of crude oil - has been buying large volumes from Russia since the Kremlin's full-scale invasion of Ukraine in 2022.But some Indian firms have already started reducing oil imports from Russia to comply with US sanctions.Putin also referenced a \"flagship project\": building India's largest nuclear power plant, that he said Moscow would help with.In a joint statement released after their meeting, the leaders said their partnership was being \"reoriented toward joint research and development, as well as the production of advanced defence platforms\".Putin added that he and Modi were cooperating on foreign policy, with their coalition of Brics countries promoting a \"more just\" and \"multi-polar\" world. Brics is an informal alliance of several major developing countries - including India, Russia, China, Brazil and South Africa - which formed in 2006, broadly to challenge the political and economic power of North America and Western European nations.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Putin in India: Russia ready to provide 'uninterrupted' fuel supplies",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3c5c/live/b75f4f30-d1c3-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-05T12:50:31.000Z",
      "dateModified": "2025-12-05T12:50:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Streamer Awards host QTCinderella on dark side of streaming",
    "url": "https://www.bbc.com/news/articles/c3v1dd01x65o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/61bd/live/58caa050-d1dc-11f0-9267-ab26a8fe8cc2.jpg",
    "tag": "World",
    "date": "2025-12-05T22:32:29.000Z",
    "description": "Twitch star QTCinderella says she wishes she never started streaming14 hours agoLaura CressTechnology reporterBBCThe popular Twitch streamer QTCindere",
    "body": "Twitch star QTCinderella says she wishes she never started streaming14 hours agoLaura CressTechnology reporterBBCThe popular Twitch streamer QTCinderella says she would be a \"happier person\" if she could go back and tell her younger self to choose a different career.The 31-year-old, real name Blaire (she does not make her second name public), became famous for playing video games and cooking meals in live videos for her 1.2 million followers online.In 2021 she created the annual Streamer Awards, which will be streamed online on Saturday.But she told the BBC while she felt \"incredibly lucky\" to be in her position, the negatives of the role - ranging from being under constant scrutiny to at times being concerned for her safety - makes it difficult to enjoy.\"If I could go back and never experience some of the things I've experienced because of this job, I do think I would be a happier person overall,\" she said.\"The biggest thing I wish I could do, if I went back and was able to whisper in my ear, I would say, don't do it.\"Getty ImagesQTCinderella at the Streamer Awards in 2024Throughout 2025, several female content creators have spoken out about concerns of their safety, particularly when attending public events.In March, three US Twitch streamers, Cinna, Valkyrae and Emiru, were taking part in a week-long marathon stream when a man threatened to kill them.Then, at the annual streamer event TwitchCon in October, a man from the crowd grabbed Emiru and tried to kiss her without her consent.While her personal security were able to intervene, she accused the on-site security team of not detaining him until hours after the event - something Twitch refuted in a statement.Harassment - or the threat of it - is an issue which Blaire says she has also had to face since her rise in popularity online.\"I could open my Instagram DMs right now and read you 100 horrible things about why or how I could be harmed by people,\" she said.In 2021, Blaire said she spent over $2,000 (£1,500) every month to have heavily edited photos of her removed from the internet.Then in January 2023, she discovered a deepfake website was using a likeness of her in pornographic material, alongside other popular female streamers.Now, she said despite opening a craft shop in Los Angeles earlier this year, it's rare she ever visits - because of men turning up to the shop and asking for her.\"I thought it'd be fun,\" she said.\"Unfortunately, it's gotten to the point where I can't go there because we've had men show up looking for me.\"I don't want it to be unsafe for my employees.\"From drama to positivityBlaire said she thought security at the Streamer Awards would be \"aggressive\" in comparison to other events, as she hopes to help the attendees from the streaming world feel as safe as possible.The ceremony recognises top creators across various categories like Gamer of the Year and Best Community, while this year's Streamer of the Year nominees includes the most-followed Twitch streamer with 20 million followers, Kai Cenat.A mix of 70% fan votes and 30% industry panellists decide the winners.In November, Blaire faced accusations from viewers claiming certain popular streamers were blocked from particular categories for being too \"problematic\" - which she denied.Clips of the streamer tearfully replying to criticisms of the event soon spread online.\"I think I need to respond less\", she said.\"But as a human, you just want to be understood\".The constant ebb and flow of streamer \"drama\" which many content creators like Blaire experience is one of the reasons she finds the job tough - but she said it was also why she started the awards.\"For me, it's really important to bring people together, because I do think there's lots of toxicity on the internet,\" she said. \"And if people were just able to have a dinner together or reach across the board, it makes a big difference.\"For one night of the year, the negativity is silent\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Streamer Awards host QTCinderella on dark side of streaming",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/61bd/live/58caa050-d1dc-11f0-9267-ab26a8fe8cc2.jpg"
      ],
      "datePublished": "2025-12-05T22:32:29.000Z",
      "dateModified": "2025-12-05T22:32:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "What latest Ukraine talks reveal about Putin's state of mind",
    "url": "https://www.bbc.com/news/articles/cpq4e21nr5vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a3a9/live/085d6ac0-d0c5-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-12-03T15:40:06.000Z",
    "description": "3 days agoSteve RosenbergBBC Russia editorWhat does the latest round of diplomacy on Ukraine tell us about Russian President Vladimir Putin's mood and",
    "body": "3 days agoSteve RosenbergBBC Russia editorWhat does the latest round of diplomacy on Ukraine tell us about Russian President Vladimir Putin's mood and intentions?For starters, that he's not ready to sign a peace deal. At least, not right now.And certainly not the deal (or deals) on the table.\"No compromise version has yet been found,\" commented Kremlin foreign policy aide Yuri Ushakov after five hours of talks in Moscow involving Putin, US envoy Steve Witkoff, and Donald Trump's adviser and son-in-law Jared Kushner.No compromise is no real surprise, considering the Kremlin leader's uncompromising comments in recent days. In various statements he has condemned the Ukrainian leadership as a \"thieving junta\", accused European leaders of trying to sabotage peace efforts, and insisted that Russia holds the initiative on the battlefield.On a couple of recent occasions Russian TV showed Putin in military fatigues, studying maps of the front line and trumpeting military gains, many of which Ukraine and international observers have denied.After nearly four years of Russia's full-scale invasion of Ukraine, despite the heavy losses Russia has suffered on the battlefield and the damage to the Russian economy, President Putin seems convinced that he is winning this war and that now is not the moment to stop.At least, that is what he would like the West to believe: that nothing can stop him now from achieving his goals.I've said before that, in many ways, Vladimir Putin reminds me of a car with no brakes, no steering wheel and no reverse gear; a vehicle careering full speed down the motorway.Nearly four years after the full-scale invasion of Ukraine there is still no sign of the \"Putinmobile\" turning off, turning back, or coming to a halt.He certainly wants his opponents to think that nothing or no one can force him to change direction: neither European leaders, nor the Trump administration, nor President Zelensky.But cars need fuel (a constant supply).And, to fight a war, countries need money (a constant supply).For now, despite international sanctions, Russia's government is still able to finance the \"special military operation\" - its war on Ukraine. But economic pressures are building: revenues from oil and gas have been falling, the budget deficit growing.Even Putin admits there are problems, referring to \"imbalances\" in the economy.\"In several sectors, production output not only failed to increase this year but actually decreased,\" Putin said this week. \"Are we satisfied with such trends? No.\"The big unknown: at what point, if at all, will economic concerns start to influence the Kremlin's calculations on the battlefield?",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "What latest Ukraine talks reveal about Putin's state of mind",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a3a9/live/085d6ac0-d0c5-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-03T15:40:06.000Z",
      "dateModified": "2025-12-03T15:40:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US vaccine panel votes to end universal hepatitis B vaccination for newborns",
    "url": "https://www.bbc.com/news/articles/cwypwznx9kqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/28bb/live/08bf9300-d1f9-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-12-06T02:57:36.000Z",
    "description": "A US panel of vaccine advisers has voted to end the longstanding recommendation for vaccinations against the hepatitis B virus (HBV) right after birth",
    "body": "A US panel of vaccine advisers has voted to end the longstanding recommendation for vaccinations against the hepatitis B virus (HBV) right after birth. The Advisory Committee on Immunization Practices (Acip) voted 8-3 to back \"individual-based decision-making\" on whether to vaccinate babies born to mothers who have tested negative for the liver infection.  In June, Health Secretary Robert F Kennedy Jr, a vaccine sceptic, fired all the members of the Acip and replaced them with others who are critical of vaccines.The US has recommended vaccinating newborns against hepatitis B since 1991, and data suggests that since then, the shots have prevented an estimated 90,000 deaths.Hours after the decision, President Donald Trump ordered his top health officials to review all childhood vaccination recommendations in the US. In a White House memo, he requested that they \"review best practices from peer, developed countries for core childhood vaccination recommendations\".  If they find other countries' practices are superior, then Trump directs them to change the US schedule.He noted in the memo that some other countries recommend fewer immunisations for children.Trump also praised the advisory committee for their Friday decision, calling it \"very good\" in a social media post. The Acip is responsible for making recommendations to the US Centers for Disease Control and Prevention (CDC) on when and who should be vaccinated. The acting director of the CDC has the final sign-off on the recommendation. The new guidance also suggests that babies who do not receive a birth dose of the vaccine should get their initial dose of the shot \"no earlier than two months of age\", a recommendation that several members of the group opposed. Public health experts worry the vote could raise unfounded safety concerns about the vaccine and encourage some people to opt out, leading to more sickness.The concern was shared by some members of the Acip panel.\"The hepatitis B vaccine recommendation is very well established,\" Dr Cody Meissner said before voting no. \"We know it's safe and we know it's very effective. And to make the changes that are being proposed, we will see more children and adolescents and adults infected with hepatitis B.\"The panel continues to recommend that babies born to mothers who have tested positive for hepatitis B be given a birth dose of the vaccine. The move is not expected to affect insurance coverage of the shot. Hepatitis B is a liver infection that spreads through direct contact with bodily fluids, and can lead to dangerous liver conditions including cancer, liver failure and cirrhosis. Pregnant people who have hepatitis B also can transmit the virus to newborns during delivery, which can lead to chronic infections that can damage the liver.People infected with HBV do not always have symptoms, meaning they may not even be aware they are carrying the virus and can spread it while caring for children and infants.Friday's decision came after a tense two-day meeting on the issue, after the Acip decided to postpone a vote on the hepatitis B shots two times.  On Friday, several members of the panel voiced their objections to the new guidelines, and in particular, that shots be recommended no sooner than two months of age. The voting choices are \"incredibly problematic\", Dr Joseph Hibbeln said, while Dr Meissner said members were acting on \"baseless sceptisicm\".One committee member in favour of the change, Retsef Levi, said the US hepatitis B vaccine policy was \"misaligned\" with other countries around the world.The World Health Organization recommends vaccinating children against HBV at zero, one and six-months old. In the UK, vaccines are recommended at eight weeks, 12 weeks and 16 weeks old, unless a mother has tested positive for the virus.During hours of meetings on Thursday and Friday, the committee heard from several physicians, including many who criticised the panel for considering ending universal vaccination recommendations.Committee members who voted in favour of the new recommendations argued that the risk of catching the virus was low and that vaccines should be tailored to individual patients.Critics of the birth dose have argued that babies should only be vaccinated as newborns if their mother tests positive for the virus. But doctors say this leaves some babies at risk, because not all pregnant people have reliable access to testing, while others could receive a false negative test for hepatitis B.Kennedy and his allies have questioned the safety of the hepatitis B vaccine and have argued it is primarily spread through sexual contact and sharing needles.Research has shown, however, that it can also spread through indirect contact such as shared toothbrushes and razors.Since taking office, Kennedy has made a number of changes to US vaccine policy. The Acip's decision to revisit the vaccine recommendations sparked anger from Republican Senator Bill Cassidy, a physician who cast a deciding vote in confirming Kennedy as health secretary despite worries about his previous stances on vaccines.\"As a liver doctor who has treated patients with hepatitis B for decades, this change to the vaccine schedule is a mistake,\" Cassidy said in a statement. \"The hepatitis B vaccine is safe and effective. The birth dose is a recommendation, NOT a mandate.\"In response to the committee's vote, Maryland's state health department issued an issued an advisory on Friday, citing a recommendation by the American Academy of Pediatrics, urging health care providers and hospitals to continue to offer the hep B vaccines at birth and said it was working to secure access to the vaccine for all infants and children in the state.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US vaccine panel votes to end universal hepatitis B vaccination for newborns",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/28bb/live/08bf9300-d1f9-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-12-06T02:57:36.000Z",
      "dateModified": "2025-12-06T02:57:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Frank Gehry's most iconic work - in pictures",
    "url": "https://www.bbc.com/news/articles/c0qlgx275jqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fd99/live/ffc28a10-d288-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-12-05T20:26:35.000Z",
    "description": "From leaning glass tower to golden fish sculpture - Frank Gehry's most iconic work16 hours agoFrank Gehry, a provocative and creative force in archite",
    "body": "From leaning glass tower to golden fish sculpture - Frank Gehry's most iconic work16 hours agoFrank Gehry, a provocative and creative force in architecture who has died aged 96, was behind some of the world's most intriguing buildings.Tim Graham/Getty ImagesThe unmistakable curves of the Guggenheim Museum, BilbaoInsights/Universal Images Group via Getty ImagesA leaning glass tower at the Dancing House, PragueTim Graham/Getty ImagesStriking purple tones on the Hotel Marques de Riscal Bodega, SpainTim Graham/Getty ImagesTitanium and glass at the Guggenheim in BilbaoMichael Jacobs/Art in All of Us/Corbis via Getty ImagesThe oversized canopy of the Louis Vuitton Foundation in ParisPetr Svarc/UCG/Universal Images Group via Getty ImagesGehry's El Peix d'Or - or golden fish sculpture - is a must-see for visitors in BarcelonaView Pictures/Universal Images Group via Getty ImagesA golden-hour glow drenches the Walt Disney Concert Hall in CaliforniaJOKER/Walter G. Allgöwer/ullstein bild via Getty ImagesAn air of whimsy at Der Neue Zollhof in DüsseldorfView Pictures/Universal Images Group via Getty ImagesThe Walt Disney Concert Hall holds its own beside the imposing skyscrapers of central LAView Pictures/Universal Images Group via Getty ImagesLight floods into the curved form within Bilbao's GuggenheimNatalie Naccache/Bloomberg via Getty ImagesGehry's Guggenheim in Abu Dhabi while under construction in 2023Jay L. Clendenin / Los Angeles Times via Getty ImagesFrank Gehry, seen in 2022, was known for his unpredictable architectural style",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Frank Gehry's most iconic work - in pictures",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fd99/live/ffc28a10-d288-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-12-05T20:26:35.000Z",
      "dateModified": "2025-12-05T20:26:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]