[
  {
    "title": "Gopichand Hinduja, the head of UK's richest family, dies aged 85",
    "url": "https://www.bbc.com/news/articles/cdx4jy9qp27o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0850/live/c0957c90-b9a5-11f0-91b3-9fadee0808a6.jpg",
    "tag": "World",
    "date": "2025-11-04T18:32:54.000Z",
    "description": "The head of Britain's richest family, Gopichand Hinduja, has died aged 85.Known as GP, Mr Hinduja and his family made their fortune from the Indian co",
    "body": "The head of Britain's richest family, Gopichand Hinduja, has died aged 85.Known as GP, Mr Hinduja and his family made their fortune from the Indian conglomerate Hinduja Group, which operates in 11 sectors including finance, media and entertainment, and oil.It has about 200,000 staff around the world.The family said in a statement: \"He will leave a deep hole at the heart of our family.\"They added that he would be \"remembered for his formidable work\".Mr Hinduja helped transform his father's modest textile and trading businesses into a global conglomerate and one of India's largest companies.Lord Karan Bilimoria, founder of Cobra Beer, said he would be remembered as someone who \"personified\" the links between India and the UK.\"Whether it was in banking, whether it was in manufacturing, whether it was in property, they were always putting the UK and India together\"GP was not only a famous and respected individual in the UK and India but a great champion for our two countries. We shall miss him greatly.\"Mr Hinduja and his family topped the most recent Sunday Times Rich List with a net worth of £35.3bn. They also ranked 11th on the Forbes list of India's 100 richest businesspeople in 2024.Mr Hinduja was the second eldest of four brothers who controlled the business for decades.The oldest of the four, Srichand, died in 2023 at 87.It is not known who will now take over the leadership of the conglomerate. The youngest brother, Ashok, runs its operations across India including truck maker Ashok Leyland.The Hinduja conglomerate operates in 48 countries.The family also own significant real estate in London, including a number of large homes near to St James's Park and Winston Churchill's Old War Office in Whitehall, which has recently been refurbished to include a hotel.Mr Hinduja largely kept out of the public eye but was involved in the controversial \"Hinduja affair\" in 2001.Mr Hinduja had written to Mandelson about his brother Prakash obtaining British citizenship, after the family's charity had donated £1m to the Millennium Dome, for which Mandelson was responsible.Mandelson resigned as a minister as a result, but was later cleared of wrongdoing after an inquiry. Prakash, his wife, their son and his wife were jailed by a Swiss court last year for exploiting domestic staff in their Geneva mansion.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gopichand Hinduja, the head of UK's richest family, dies aged 85",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0850/live/c0957c90-b9a5-11f0-91b3-9fadee0808a6.jpg"
      ],
      "datePublished": "2025-11-04T18:32:54.000Z",
      "dateModified": "2025-11-04T18:32:54.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": " Nepal: Seven climbers dead after Himalayan avalanche",
    "url": "https://www.bbc.com/news/articles/c2kp42y5y81o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4581/live/79770770-b8c4-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "World",
    "date": "2025-11-04T12:59:53.000Z",
    "description": "12 hours agoGetty ImagesA search and rescue operation continues for the rest of the group, which includes other foreign nationals and local guidesDiwa",
    "body": "12 hours agoGetty ImagesA search and rescue operation continues for the rest of the group, which includes other foreign nationals and local guidesDiwakar Pyakurel & Phanindra Dahal,BBC Nepali in Kathmandu and Kathryn ArmstrongAt least seven climbers, including five foreigners and two Nepalis, have died after being hit by an avalanche on a Himalayan peak in north-eastern Nepal, expedition agency Seven Summit Treks said.The incident happened at 09:00 local time (03:15 GMT) on Monday near the base camp of the Yalung Ri mountain in Dolakha district. Rescuers located two bodies, and are still searching for the remaining five, who are believed to have been buried by snow. Eight others have been rescued and are in the capital Kathmandu getting treatment for their injuries.All these climbers were part of a group that set out over an hour before the avalanche hit, the district police chief told BBC Nepali. The bodies of the other five deceased climbers \"may be 10-15 feet below the snow\", said Mingma Sherpa, chairman of Seven Summit Treks. \"It will take time to find them.\"Those killed include two Italians, a Canadian, a German, a French national, and two Nepalis who served as guides. Local deputy superintendent of Police Gyan Kumar Mahato told the BBC on Monday that a rescue helicopter had landed in the Na Gaun area of Dolakha - a five-hour walk from the Yalung Ri base camp.One of the injured climbers told The Kathmandu Post that they had repeatedly called for help, to no avail. \"Had the rescue arrived on time, more lives could have been saved,\" he told the newspaper.Mr Mahato told reporters that rescue efforts were hampered by poor weather and logistical issues, which made it hard to fly helicopters or reach the site on foot.The Kathmandu Post reported that the group were preparing to climb the nearby Dolma Khang peak, which has an elevation of 6,332m (20,774ft). They had planned to climb the 5,630m Yalung Ri as part of their acclimatisation schedule.Separately, the bodies of two Italian climbers who went missing while attempting to scale another mountain in Nepal have been recovered, officials have confirmed.Stefano Farronato and Alessandro Caputo were part of a three-man group that became stranded along with three local guides last week on the Panbari mountain in western Nepal. The third member of the group, named in media reports as Velter Perlino, 65, was able to be rescued, along with one sherpa.The group had been granted permission to climb the 6,887m peak, but were reported missing when they lost contact with the base camp following heavy snowfall on 28 October.\"When a helicopter was sent yesterday [Monday] to the Panbari peak for rescue operations, it could not find them, but rescued one Italian team leader and a sherpa from the base camp,\" Himal Gautam, department of tourism director, said. Their bodies were recovered on Tuesday and have been flown to Kathmandu.Autumn is a popular season for trekkers and mountaineers in Nepal as weather conditions and visibility have tended to be better. However, the risk of severe weather and avalanches remains. Last week, Cyclone Montha triggered heavy rain and snowfall across Nepal, stranding people in the Himalayas. Two British and one Irish woman were among a group that had to be rescued after being trapped for several days in the western Mustang region. Severe weather also left hundreds of hikers stranded near Mount Everest in October. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": " Nepal: Seven climbers dead after Himalayan avalanche",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4581/live/79770770-b8c4-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-11-04T12:59:53.000Z",
      "dateModified": "2025-11-04T12:59:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israel receives coffin Hamas says contains Gaza hostage's body",
    "url": "https://www.bbc.com/news/articles/c1wlz8j8lr4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/22a8/live/7d392ec0-b9a4-11f0-ba75-093eca1ac29b.jpg",
    "tag": "World",
    "date": "2025-11-04T19:56:46.000Z",
    "description": "Israel has received via the Red Cross in Gaza a coffin which the Palestinian armed group Hamas says contains the body of a deceased hostage, according",
    "body": "Israel has received via the Red Cross in Gaza a coffin which the Palestinian armed group Hamas says contains the body of a deceased hostage, according to the Israeli prime minister's office.Israeli forces will now transfer the remains to the National Centre of Forensic Medicine in Tel Aviv for identification.Earlier, Hamas's military wing said it had recovered the body of an Israeli soldier in the eastern Shejaiya neighbourhood of Gaza City.Israel had allowed members of the group and Red Cross staff to search for the remains in the area, which is inside territory still controlled by Israeli forces.The Israeli government has accused Hamas of deliberately delaying the recovery of the dead hostages since a US-brokered ceasefire deal took effect on 10 October.Hamas has insisted it is difficult to locate the bodies under rubble.Under the ceasefire deal, Hamas agreed to return the 20 living and 28 dead hostages it was still holding within 72 hours.All the living Israeli hostages were released on 13 October in exchange for 250 Palestinian prisoners and 1,718 detainees from Gaza.Israel has handed over the bodies of 270 Palestinians in exchange for the bodies of the 18 Israeli hostages returned by Hamas before Tuesday, along with those of two foreign hostages - one of them Thai and the other Nepalese.Six of the eight dead hostages still in Gaza before Tuesday were Israelis, one was Tanzanian, and one was Thai.All but one of the dead hostages still in Gaza were among the 251 people abducted during the Hamas-led attack on southern Israel on 7 October 2023, during which about 1,200 other people were killed.Israel responded by launching a military campaign in Gaza, during which more than 68,800 people have been killed, according to the territory's Hamas-run health ministry.Earlier on Tuesday, a hospital official in Gaza City said a man was killed by Israeli fire in the Jabalia area of northern Gaza.The Israeli military said its troops killed a \"terrorist\" who had crossed the \"Yellow Line\", which demarcates Israeli-controlled territory, and posed a threat to them.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israel receives coffin Hamas says contains Gaza hostage's body",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/22a8/live/7d392ec0-b9a4-11f0-ba75-093eca1ac29b.jpg"
      ],
      "datePublished": "2025-11-04T19:56:46.000Z",
      "dateModified": "2025-11-04T19:56:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Iran releases two French nationals from detention",
    "url": "https://www.bbc.com/news/articles/cj0en7ljzjpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/074c/live/3e333200-b9bf-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-11-04T21:12:02.000Z",
    "description": "Iran has released two French nationals who were detained there for more than three years, French President Emmanuel Macron has said.Cécile Kohler, 41 ",
    "body": "Iran has released two French nationals who were detained there for more than three years, French President Emmanuel Macron has said.Cécile Kohler, 41 and her partner Jacques Paris, 72, have been released from Evin prison, Macron said on Tuesday, with France's foreign minister later confirming they were \"safe\" at the embassy in Tehran \"ahead of their final release\".\"I welcome this first step. The dialogue continues to allow for their return to France as quickly as possible,\" Macron said.The pair, who were arrested in May 2022 during a tourist trip, are believed to be the last French nationals held in Iran.Last month, they were found guilty of spying on behalf of both France and Israel, and were handed lengthy prison sentences, according to Iranian state media reports.A number of Europeans have been held by Iran in recent years. France has accused Iran of state hostage-taking and keeping its nationals in conditions akin to torture, something Tehran has denied. In a statement to the AFP news agency on Tuesday, the pair's Paris-based legal team said the release of Kohler and Paris had \"ended their arbitrary detention which lasted 1,277 days\". AFP said their families have insisted they are wholly innocent.Their freeing comes more than a month after Iranian Foreign Minister Abbas Araghchi said a deal to exchange French detainees for an Iranian woman held in France was nearly complete. Iran had said Kohler and Paris could be released as part of that agreement.Mahdieh Esfandiari, who has been held in France since February on charges of promoting terrorism on social media, was released conditionally by French authorities last month.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iran releases two French nationals from detention",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/074c/live/3e333200-b9bf-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-11-04T21:12:02.000Z",
      "dateModified": "2025-11-04T21:12:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Portugal: Narco-sub carrying 1.7 tonnes of cocaine seized in Atlantic",
    "url": "https://www.bbc.com/news/articles/cm274lmg7m1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7681/live/bc6794e0-b9a6-11f0-bdab-7f106e3b3da3.jpg",
    "tag": "World",
    "date": "2025-11-04T18:52:17.000Z",
    "description": "6 hours agoJames GregoryPortuguese Judiciary PoliceThe sub was located 1,000 nautical miles off the coast of LisbonFour people have been detained afte",
    "body": "6 hours agoJames GregoryPortuguese Judiciary PoliceThe sub was located 1,000 nautical miles off the coast of LisbonFour people have been detained after Portuguese authorities intercepted a narco-sub carrying more than 1.7 tonnes of cocaine in the mid-Atlantic.The semi-submersible vessel was bound for the Iberian peninsula and was seized in recent days, according to officials.Footage shows the police and navy surrounding the vessel before boarding, seizing the Class A substance and arresting four crew members, who are said to be from South America.The suspects, including two Ecuadorians, a Venezuelan and a Colombian, were remanded in pre-trial custody after their court appearance in the Azores on Tuesday, said police.Vítor Ananias, head of Portugal's police unit to combat drug trafficking, told a press conference that their different nationalities showed the organisation behind them was not just based in one country.The Lisbon-based Maritime Analysis and Operations Centre (MAOC) said it had received information in recent days indicating that a criminal organisation was in the process of dispatching a submersible loaded with cocaine destined for Europe.A few days later, a Portuguese ship successfully located the submersible approximately 1,000 nautical miles (1,852km) off the coast of Lisbon, in an operation backed by the UK's National Crime Agency and the US Drug Enforcement Administration.Having seized the vessel, the navy said it could not be towed back to shore due to poor weather and its fragile construction, and it later sank in the open sea.Portuguese navyThe Portuguese navy said the narcosub was too fragile  to be towed to port and ended up sinking in the seaVítor Ananias told reporters that \"between the heat, the vessel's fumes and high waves, with difficult weather conditions, even one day is tricky [for the four men on board]. By the end of 15 or 20 days all you want is to get out\".Such incidents like these had been a \"recurring situation in recent years\", he added, in remarks quoted by Lusa news agency.In March this year, a similar vessel carrying 6.5 tonnes of cocaine was seized about 1,200 nautical miles from Lisbon. It also comes as the Trump administration ramps up its attacks on vessels it says  are being used to smuggle drugs into the US. Three men were killed last week in a US strike on an alleged drug vessel in the Caribbean, US Defence Secretary Pete Hegseth said on Sunday.Experts have questioned the legality of such strikes under international law and they have drawn strong criticism from Latin American leaders whose citizens have been targeted.Watch: Moment Portuguese police enter narco-sub carrying 1.7 tonnes of cocaine in Atlantic",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Portugal: Narco-sub carrying 1.7 tonnes of cocaine seized in Atlantic",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7681/live/bc6794e0-b9a6-11f0-bdab-7f106e3b3da3.jpg"
      ],
      "datePublished": "2025-11-04T18:52:17.000Z",
      "dateModified": "2025-11-04T18:52:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Suspected drone sightings disrupt flights at Belgium airports",
    "url": "https://www.bbc.com/news/articles/clyk9k399lyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ecf8/live/af7375b0-b9c9-11f0-aa1d-d15856dba687.jpg",
    "tag": "World",
    "date": "2025-11-04T22:42:27.000Z",
    "description": "Suspected drone sightings have disrupted flights at airports across Belgium on Tuesday, with no flights departing or arriving at Brussels Airport - th",
    "body": "Suspected drone sightings have disrupted flights at airports across Belgium on Tuesday, with no flights departing or arriving at Brussels Airport - the country's busiest. Air traffic there was suspended around 20:00 local time (19:00 GMT) after a drone sighting. An hour later it briefly reopened, before closing again shortly after.Liege Airport has also been affected and it is not clear when flights will resume. Local media also reported drone sightings at the Kleine-Brogel and Florennes military airbases, local media reports.It is the latest in a string of suspected drone sightings causing disruption at European airports - including in Munich, Copenhagen and Oslo.A statement on the Brussels Airport website on Tuesday evening read: \"There are currently no departing or arriving flights at Brussels Airport due to drone sightings around the airport.\"We monitor the situation closely and will provide updates as soon as we have more information.\"Pictures taken inside the airport show what appear to be camp beds being readied for passengers.Officials at Brussels's second-largest airport, Charleroi, said air traffic was briefly halted there as a precaution too.Local media reports flights had initially been diverted to Liege - before that also closed due to suspected drone sightings.It adds that flights have since been diverted to nearby airports - including Ostend and Charleroi in Belgium, and Eindhoven and Maastricht in the Netherlands.Tuesday was the fourth night in a row that the Belgian authorities reported drone sightings over Kleine-Brogel, a major military base near the Dutch border. Belgium's defence minister, Theo Francken, said on Monday that an investigation was under way, calling it \"a clear mission targeting Kleine Broge\".Drones were also seen close to Ostend and Antwerp's Deurne airports over the weekend, according to Belgian news site VRT. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Suspected drone sightings disrupt flights at Belgium airports",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ecf8/live/af7375b0-b9c9-11f0-aa1d-d15856dba687.jpg"
      ],
      "datePublished": "2025-11-04T22:42:27.000Z",
      "dateModified": "2025-11-04T22:42:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China sentences infamous Myanmar scam mafia members to death",
    "url": "https://www.bbc.com/news/articles/cy9pyljl009o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e19b/live/055e9910-b960-11f0-8d7d-b7b55eb4a3c5.jpg",
    "tag": "World",
    "date": "2025-11-04T11:54:24.000Z",
    "description": "A Chinese court has sentenced five top members of an infamous Myanmar mafia to death as Beijing continues its crackdown on scam operations in South Ea",
    "body": "A Chinese court has sentenced five top members of an infamous Myanmar mafia to death as Beijing continues its crackdown on scam operations in South East Asia.In all 21 Bai family members and associates were convicted of fraud, homicide, injury and other crimes, said a state media report published on the court website.The family is among a handful of mafias that rose to power in the 2000s and transformed the impoverished backwater town of Laukkaing into a lucrative hub of casinos and red-light districts.In recent years they pivoted to scams in which thousands of trafficked workers, many of them Chinese, are trapped, abused and forced to defraud others in criminal operations worth billions.Mafia boss Bai Suocheng and his son Bai Yingcang were among the five men sentenced to death by the Shenzhen Intermediate People's Court. Yang Liqiang, Hu Xiaojiang and Chen Guangyi were the other three.Two members of the Bai family mafia were handed suspended death sentences. Five were sentenced to life imprisonment, while nine others were handed jail sentences ranging from three to 20 years.The Bais, who controlled their own militia, established 41 compounds to house their cyberscam activities and casinos, authorities said.These criminal activities involved more than 29 billion Chinese yuan ($4.1bn; £3.1bn). They also led to the deaths of six Chinese citizens, the suicide of one and multiple injuries, state media reported.The harsh penalties handed down by the court are part of China's campaign to eradicate the vast scam networks in South East Asia - and send a stern warning to other criminal syndicates.In September a Chinese court sentenced 11 members of the Ming family - another prominent Laukkaing clan - to death.These families rose to power in the 2000s with the help of Min Aung Hlaing - who now leads Myanmar's military government. He had wanted to prop up allies in Laukkaing after ousting its former warlord.Among the clans, the Bais were \"absolutely number one\", Bai Yingcang previously told state media.\"At that time, our Bai family was the most powerful in both the political and military circles,\" he said in a documentary about the Bai family, aired on Chinese state media in July.In the same documentary, a worker at one of their scam centres recalled the abuse he had endured there: besides being beaten, he had his fingernails yanked out with pliers and two of his fingers severed with a kitchen knife.Bai Yingcang is among those who were sentenced to death this week. He has also been separately convicted of conspiring to traffic and manufacture 11 tonnes of methamphetamine, state media reported.The families' fall came in 2023 as political winds changed.For years Beijing has pressed the Myanmar junta to rein in scam operations in Laukkaing.In 2023, the Chinese police issued arrest warrants for the most prominent members of these families. Bai Suocheng, the Bai family's patriarch, was among the warlords who were handed to Beijing from Myanmar in early 2024.\"Why is the Chinese government making so much effort to go after the four families?\" a Chinese investigator said in the July documentary.\"It's to warn other people, no matter who you are, where you are, as long as you commit such heinous crimes against the Chinese people, you will pay the price.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China sentences infamous Myanmar scam mafia members to death",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e19b/live/055e9910-b960-11f0-8d7d-b7b55eb4a3c5.jpg"
      ],
      "datePublished": "2025-11-04T11:54:24.000Z",
      "dateModified": "2025-11-04T11:54:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Carney's federal budget plans billions in new spending in response to US tariff shocks ",
    "url": "https://www.bbc.com/news/articles/cd04yde70jmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/286b/live/5096dfd0-b9cb-11f0-aa1d-d15856dba687.jpg",
    "tag": "World",
    "date": "2025-11-05T00:17:44.000Z",
    "description": "45 minutes agoNadine YousifSenior Canada reporter, OttawaCanada's Prime Minister Mark Carney has put forward his first federal budget, which lays out ",
    "body": "45 minutes agoNadine YousifSenior Canada reporter, OttawaCanada's Prime Minister Mark Carney has put forward his first federal budget, which lays out an ambitious plan to transform Canada's economy and deal with the challenge of US tariffs.Billed an \"investment budget\" by the government, the fiscal plan increases Canada's deficit to C$78bn ($55.3bn; £42.47bn), the second largest in history. The spending is offset by plans to attract C$1tn of investment into Canada over the next five years, with the federal government arguing more restrained spending would eliminate \"vital social programmes\" and funding for Canada's future. The budget does outline cuts, however, including slashing the size of the federal workforce by some 10% in the coming years. The budget was presented by Canada's finance minister, François-Philippe Champagne, in the House of Commons late on Tuesday afternoon. In his budget speech, Champagne warned that Canada is facing \"a time of profound change\" and that \"bold and swift action is needed\" to ensure the country prospers.Peppered throughout the budget are references to uncertainty and the need for protectionist measures as a result of US tariffs on Canada. President Donald Trump has placed a broad 35% levy on Canadian goods not covered by an existing free trade agreement, and has tariffed specific sectors like steel, aluminium and automobiles. These levies, enacted earlier this year, have already led to Canadian job losses in those sectors, and business leaders have warned of a chill on investment in Canada due to trade uncertainty. To counter this, the budget proposes spending of C$280bn over the next five years \"to strengthen Canada's productivity, competitiveness, and resilience\". These include updating ports and other trade infrastructure with the goal of doubling Canadian exports to non-US markets over the next decade, as well as direct financing to support firms impacted by tariffs.The fiscal update also outlines a plan to boost Canada's competitiveness, with the goal of making Canada a more attractive place to do business than the US.Rebekah Young, the head of inclusion and resilience economics at Scotiabank, said the budget lays out a plan to reduce timelines and smooth regulatory hurdles with the hopes that it will boost private investment in Canada over the years.But she cautioned that parts of the budget might be a hard sell for Canadians struggling immediately with the cost of living.\"They're going to open this budget and not see any new (supports),\" she said. And while the budget delivers on its promise of generational spending, Ms Young said it remains to be seen if it will be as \"transformational\" as Carney hopes.\"We want to unlock a trillion dollars based on this investment here. A lot has to happen to get to that trillion,\" she said. On defence, the budget pledges nearly C$82bn over five years—the largest funding in decades—putting Canada in line with its Nato commitment to spend 2% of its gross domestic product (GDP) on its military by this year.The Carney government is also betting big on AI, proposing nearly C$1bn to boost integration and use of the rapidly growing technology, including in government operations.Carney warned Canadians ahead of the budget of \"sacrifices\". Among them is a reduction of the size of the federal government that would result in 40,000 job losses by 2029. International aid is also slated to be cut to pre-pandemic levels. Immigration targets have been lowered slightly over the next three years to \"stabilise\" new admissions to the country, including a significant cut to student visas.The budget will need to be passed by Canada's parliament before it's implemented. Carney's Liberal government is just shy of a majority, meaning it will need the support of other parties to enact its fiscal plan. Failure to pass the budget could risk a federal election. One Conservative MP, Chris d'Entremont, said in a statement released by the Liberals on Tuesday night that he had resigned from the Conservative caucus and will be crossing the floor to Carney’s party.In the statement, the MP said that the  budget “hits the priorities I have heard most in my riding“.​​This narrows Carney's razor-thin minority at a critical time.Meanwhile, Conservative opposition MPs have criticised the budget for increasing Canada's deficit while doing little to address affordability for Canadians. Yves-Francois Blanchet, the leader of the separatist Bloc Québécois party, said his caucus does not see how they could support the budget. Members of the left-leaning New Democratic Party said they will take the time to study it, but have criticised planned public sector cuts. With the projected larger deficit, Carney's fiscal plan maintains that Canada's still has the lowest deficit-to-GDP ratio in the G7, behind only Japan.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Carney's federal budget plans billions in new spending in response to US tariff shocks ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/286b/live/5096dfd0-b9cb-11f0-aa1d-d15856dba687.jpg"
      ],
      "datePublished": "2025-11-05T00:17:44.000Z",
      "dateModified": "2025-11-05T00:17:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Reddit added to Australia's teen social media ban due to start next month",
    "url": "https://www.bbc.com/news/articles/cn0gkg7x59go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/05ef/live/b26ea490-b9da-11f0-958b-652a5da36b19.jpg",
    "tag": "World",
    "date": "2025-11-05T00:44:42.000Z",
    "description": "20 minutes agoLana LamSydneyGetty ImagesReddit is one of the latest platforms to be added to Australia's social media banPopular forum site Reddit has",
    "body": "20 minutes agoLana LamSydneyGetty ImagesReddit is one of the latest platforms to be added to Australia's social media banPopular forum site Reddit has been added to Australia's world-first social media ban for children under 16 that starts next month.Live-streaming platform Kick will also be included, bringing the number of sites targeted in the ban to nine. They include Facebook, X, Snapchat, TikTok, YouTube, Instagram and Threads.From 10 December, tech companies can be fined up to A$50m ($32.5m; £25.7m) if they do not take \"reasonable steps\" to deactivate existing accounts for under-16s and prohibit new ones.Each banned platform was chosen as their \"sole or a significant purpose is to enable online social interaction,\" the government said, and more sites may be added given the \"fast-changing\" nature of technology.\"Delaying children's access to social media accounts gives them valuable time to learn and grow, free of the powerful, unseen forces of harmful and deceptive design features such as opaque algorithms and endless scroll,\" said Australia's eSafety Commissioner Julie Inman Grant.Messaging services Discord and WhatsApp and gaming platforms Lego Play and Roblox will not be included, nor will Google Classroom and YouTube Kids.Federal Communications Minister Anika Wells said the online platforms can target children with \"chilling control\" and the ban was about protecting children.\"We aren't chasing perfection, we are chasing a meaningful difference,\" she said.It is unclear how companies will implement the ban - which is being closely watched by global leaders - but some of the potential methods include using official ID documents, parental approval and facial recognition technology. Critics have raised concerns over data privacy and the accuracy of age verification software, with a recent report showing the proposed methods all have risks or shortcomings. Most Australian adults support the ban, according to polls, but some mental health advocates say it may cut kids off from connection, and others say it could push youngsters to even-less-regulated corners of the internet.Instead, they say, the government should focus on better policing of harmful content on social media platforms and prepare children for the reality of life on the web.An Australian influencer family who have millions of YouTube follower recently announced their decision to move to the UK to avoid the upcoming ban, namely so their 14-year-old daughter can continue to create online content.YouTube was initially exempt from the ban but in July, the government reversed its decision, saying the video sharing site was \"the most frequently cited platform\" where children aged 10 to 15 years saw \"harmful content\".Teens under 16 will still be able to view YouTube videos but will not be permitted to have an account, which is required for uploading content or interacting on the platform.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Reddit added to Australia's teen social media ban due to start next month",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/05ef/live/b26ea490-b9da-11f0-958b-652a5da36b19.jpg"
      ],
      "datePublished": "2025-11-05T00:44:42.000Z",
      "dateModified": "2025-11-05T00:44:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Peru-Mexico: Lima cuts off diplomatic ties with Mexico over ex-PM's asylum",
    "url": "https://www.bbc.com/news/articles/czdrg9zqnljo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f1c4/live/b6df6710-b928-11f0-b1d0-6bf014947edc.jpg",
    "tag": "World",
    "date": "2025-11-04T06:56:45.000Z",
    "description": "Peru has announced it is breaking off diplomatic relations with Mexico after its government granted asylum to a former Peruvian prime minister facing ",
    "body": "Peru has announced it is breaking off diplomatic relations with Mexico after its government granted asylum to a former Peruvian prime minister facing charges for a 2022 coup attempt.Peruvian Foreign Minister Hugo de Zela expressed his \"surprise and deep regret\" after learning Betssy Chávez was being given refuge at the Mexican embassy in Peru.\"Given this unfriendly act... the Peruvian government has decided to sever diplomatic relations with Mexico today,\" Zela said.In response, Mexico's foreign affairs ministry \"rejected Peru's unilateral decision as excessive and disproportionate\".Chávez had been imprisoned in June 2023 over her alleged role in ousted Peruvian president Pedro Castillos's plan to dissolve congress. She was released by a judge on bail in September and had denied the charges against her.Peru also accused Mexico of \"repeated instances in which the current and former presidents of that country have interfered in Peru's internal affairs\".\"The truth is, they have tried to portray the authors of the coup attempt as victims, when in reality, Peruvians live and want to continue living in democracy, as recognised by all countries in the world, with the sole and lonely exception of Mexico,\" Zela added.Prosecutors are seeking a 25-year sentence for Chávez's alleged role in Castillo's plan to dissolve congress.Castillo was arrested in December 2022 on charges of rebellion, after he attempted to dissolve congress and install an emergency government. Hours after the attempt, Castillo was impeached. He has been in preventative custody ever since. Prosecutors are seeking a 34-year jail term for Castillo, who previously said he never took up arms against the state because the military refused his orders.Peru's decision to sever diplomatic ties with Mexico adds to ongoing tensions between the two governments since Castillo's ousting.In 2022, Lima expelled Mexico's ambassador following its decision to grant asylum to Castillo's wife and children following his arrest.A year later, Peru also recalled its ambassador to Mexico after then-president Andrés Manuel López Obrador expressed his support for Castillo, saying he had been \"illegally ousted\".A former primary school teacher, farmer and union activist, Castillo was dubbed Peru's \"first poor president\".With no previous political experience, he took office as a government outsider, vowing to transform Peru's deteriorating economy and support the poor.But Castillo's presidency came to an infamous end after his attempt to seize power was declared unconstitutional, with government officials and the country's armed forces refusing to support him.Casillo's successor, former president Dina Boluarte, was removed from office last month by an overwhelming majority in Peru's congress, after mass protests against political scandals and soaring crime. Congress leader José Jeri was then sworn in as interim president.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Peru-Mexico: Lima cuts off diplomatic ties with Mexico over ex-PM's asylum",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f1c4/live/b6df6710-b928-11f0-b1d0-6bf014947edc.jpg"
      ],
      "datePublished": "2025-11-04T06:56:45.000Z",
      "dateModified": "2025-11-04T06:56:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sudan war: RSF blamed for drone strike that hits funeral near el-Obeid killing many mourners",
    "url": "https://www.bbc.com/news/articles/c0rp4z0rgleo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2b4f/live/5e8ba6f0-b978-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-11-04T12:34:46.000Z",
    "description": "12 hours agoLucy Fleming and Richard KagoeAt least 40 people in Sudan have been killed in a drone strike that targeted a funeral that was taking place",
    "body": "12 hours agoLucy Fleming and Richard KagoeAt least 40 people in Sudan have been killed in a drone strike that targeted a funeral that was taking place outside the army-held city of el-Obeid in North Kordofan state, officials and activists say.They blamed the paramilitary Rapid Support Forces (RSF) for Monday's attack on al-Luweib village as mourners had gathered in a tent. The RSF has not yet commented.Many reportedly died before getting to hospital in el-Obeid, a strategic city that connects the capital, Khartoum, to the western region of Darfur.Fighting has intensified in this oil-rich Kordofan area and around 20,000 people fled to el-Obeid last week after the RSF captured Bara town, 30km (18 miles) north of the city.The town fell at the same time as the city of el-Fasher, which had been the army's last stronghold in Darfur.There have since been reports of mass killings, sexual violence, abductions and widespread looting in el-Fasher by RSF fighters.The UN said summary executions of civilians by RSF fighters had also also been reported in Bara.Such atrocities could amount to war crimes and crimes against humanity, the International Criminal Court (ICC) has warned.The RSF leader has promised to investigate \"violations\" but his paramilitary group has denied widespread allegations that the killings in el-Fasher are ethnically motivated and follow a pattern of the Arab paramilitaries targeting non-Arab populations.The ICC's statement came as a global group of food security experts confirmed on Monday that el-Fasher residents were suffering from famine following the RSF's 18-month siege of the city.The UN-accredited Integrated Food Security Phase network (IPC) also said the city of Kadugli in South Kordofan state was in the most catastrophic stage of hunger.The city, nearly 300km south of el-Obeid, has been also surrounded and starved of supplies by the RSF.UN chief António Guterres has called for an immediate halt to the violence in Sudan, warning that the humanitarian crisis is rapidly worsening.\"The horrifying crisis in Sudan... is spiralling out of control,\" he said on the side-lines of a summit in Doha.\"El-Fasher and the surrounding areas... have been an epicentre of suffering, hunger, violence and displacement - and since the Rapid Support Forces entered el-Fasher last weekend, the situation is growing worse by the day,\" AFP news agency quotes him as saying.Guterres urged the army and the RSF to come to the negotiating table and \"bring an end to this nightmare of violence\".A Sudanese government source has told AFP that the authorities are considering a US proposal for a truce.Washington - along with other states - has been pushing for a ceasefire and a roadmap to end the conflict.There have been several rounds of peace talks in Saudi Arabia and Bahrain - but they have failed - and both sides have shown an unwillingness to agree to a ceasefire.The North Kordofan Resistance Committee, a volunteer aid group, said the attack on the village, which is 15km east of el-Obeidz, happened on Monday.Mohamed Ismail, North Kordofan's humanitarian aid commissioner, told the Sudan Tribune new website: \"Drones belonging to the Rapid Support Forces militia attacked citizens who were at a funeral, resulting in the death of 40 people and the injury of dozens.\"Last week, the UN said el-Obeid was already struggling to cope with the influx of those fleeing from Bara.Since the civil war erupted between the army and RSF in April 2023, more than 150,000 people have died about 12 million have fled their homes in what the UN has called the world's largest humanitarian crisis.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sudan war: RSF blamed for drone strike that hits funeral near el-Obeid killing many mourners",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2b4f/live/5e8ba6f0-b978-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-11-04T12:34:46.000Z",
      "dateModified": "2025-11-04T12:34:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Typhoon Kalmaegi: At least 40 killed in the Philippines as storm wreaks havoc",
    "url": "https://www.bbc.com/news/articles/cgmx4yjkzj4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d69a/live/11696280-b965-11f0-8ece-6904e2149bdb.jpg",
    "tag": "World",
    "date": "2025-11-04T17:54:58.000Z",
    "description": "7 hours agoGeorge Wright,in London and Virma Rivera,in ManilaAt least 40 people have been killed and hundreds of thousands forced to flee their homes ",
    "body": "7 hours agoGeorge Wright,in London and Virma Rivera,in ManilaAt least 40 people have been killed and hundreds of thousands forced to flee their homes as one of strongest typhoons this year ripped through the central Philippines, officials say.Typhoon Kalmaegi has flooded large areas, including entire towns on the most populated central island of Cebu, where most fatalities occurred. Reports suggest casualties will rise.Videos show people sheltering on rooftops, while cars and shipping containers have been swept through the streets.A military helicopter deployed to assist relief efforts crashed in northern Mindanao island killing six crew members on board, the Philippine Air Force (PAF) said. It went down near Agusan del Sur on Mindanao island and was one of four sent to help.\"Communication with the helicopter was lost, which immediately prompted the launch of a search and rescue operation,\" the PAF said. Later, a spokeswoman said six bodies had been recovered, believed to be of the pilot and crew.The typhoon, locally named Tino, has weakened since making landfall early on Tuesday, but has continued to bring winds of more than 80mph (130km/h).It is forecast to move across the Visayas islands region and out over the South China Sea by Wednesday.\"The situation in Cebu is really unprecedented,\" provincial governor Pamela Baricuatro said in a Facebook post.\"We were expecting the winds to be the dangerous part, but... the water is what's truly putting our people at risk,\" she said. \"The floodwaters are just devastating.\"Most of the deaths were due to drowning, reports said. The storm has been sending torrents of muddy water down hillsides and into towns and cities.Damage to residential areas on Cebu was extensive, with many small buildings swept away and a thick carpet of mud left by the retreating floodwaters. Rescue teams took to boats to free people who were trapped inside their houses.Don del Rosario, 28, was among those in Cebu City who sought refuge on an upper floor as the storm raged.\"I've been here for 28 years, and this is by far the worst we've experienced,\" he told the AFP news agency.In total, almost 400,000 people were moved from the typhoon's path, Rafaelito Alejandro, deputy administrator at the Office of Civil Defence, told a news conference.The Philippines is hit by an average of 20 storms and typhoons each year.The latest comes barely a month after back-to-back typhoons killed over a dozen people and wrought damage to infrastructure and crops.Super Typhoon Ragasa, known locally as Nando, struck in late September, followed swiftly by Typhoon Bualoi, known locally as Opong.In the months before, an extraordinarily wet monsoon season caused widespread flooding, sparking anger and protests over unfinished and sub-standard flood control systems that have been blamed on corruption.On 30 September, dozens were killed and injured after a powerful 6.9 magnitude earthquake struck the central Philippines, with Cebu bearing the brunt of the damage.Typhoon Kalmaegi is forecast to move on to Vietnam, which is already seeing record-breaking rainfall.With additional reporting by Jonathan Head, South East Asia correspondent",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Typhoon Kalmaegi: At least 40 killed in the Philippines as storm wreaks havoc",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d69a/live/11696280-b965-11f0-8ece-6904e2149bdb.jpg"
      ],
      "datePublished": "2025-11-04T17:54:58.000Z",
      "dateModified": "2025-11-04T17:54:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ukraine: Zelensky visits troops near embattled front line town of Pokrovsk",
    "url": "https://www.bbc.com/news/articles/c0mxk9yw3n4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/80e3/live/b326f5b0-b9a6-11f0-b2a1-6f537f66f9aa.png",
    "tag": "World",
    "date": "2025-11-04T19:01:32.000Z",
    "description": "Ukrainian President Volodymyr Zelensky says he has visited troops near the town of Pokrovsk, where the fiercest front line battle between Russia and U",
    "body": "Ukrainian President Volodymyr Zelensky says he has visited troops near the town of Pokrovsk, where the fiercest front line battle between Russia and Ukraine is currently taking place.Zelensky posted photos showing him meeting personnel at a command post in the Dobropillya sector, some 20km (12 miles) north of Pokrovsk in the Donetsk region.Kyiv's top military commander, Oleksandr Syrskiy, said on Monday that Ukraine was increasing pressure on the Dobropillya front to \"force the enemy to disperse its forces and make it impossible to concentrate their main efforts in the Pokrovsk area\".Russia has been trying to seize Pokrovsk - a strategic frontline town and logistic hub - for over a year.Although it has taken them months to approach the town's borders, Russian soldiers have now infiltrated it and on Friday, Zelensky said Russia had amassed 170,000 troops on its outskirts.Both Ukraine and Russia continue to issue claims and counter claims on the situation in and around Pokrovsk.    Capturing Pokrovsk could give Moscow access to the rest of Donetsk, including the towns Kramatorsk, Slovyansk, Kostyantynivka and Druzhkivka - the so-called \"fortress belt\". Gen Syrskiy, acknowledged his troops were withstanding the \"pressure of a multi-thousand enemy grouping\" but denied they were encircled. Meanwhile, Russian military bloggers claimed 90% of Pokrovsk was under Moscow's control. Unverified videos posted on social media show instances of close quarter combat, drone attacks and street battles there. The US-based Institute for the Study of War (ISW) said that Russian forces were operating with \"increasing comfort\" within the town, which once had a population of 60,000 but has now been almost entirely emptied of civilians and largely destroyed.Further east, Moscow's troops are also reportedly targeting the town of Myrnohrad, which would put Ukrainian soldiers at risk of encirclement. Intense drone activity has cut off many logistics routes, making evacuations and the supply of ammunition and vehicles near impossible.On Monday, Zelensky said Russia had had \"no success\" in Pokrovsk in recent days but acknowledged that \"things were not easy\" for Ukrainian forces in the area. He added that a third of all front line clashes were happening in Pokrovsk, and a half of all glide bombs used by the Russians were launched at the town. Earlier last week the Ukrainian president said that Moscow's troops in the area were outnumbering Kyiv's eight to one.Some Ukrainian commentators have criticised the government's efforts to continue to defend Pokrovsk, arguing that troops were being put at risk.In a post accompanying the pictures of his visit to Dobropillya, Zelensky on Tuesday wrote: \"This is our country, this is our East, and we will certainly do our utmost to keep it Ukrainian.\"Russia now controls 81% of the Donetsk region and 99% of neighbouring Luhansk, which collectively make up the Donbas.Moscow has never relented in its ambition to capture the entirety of the area, which Russia's President Vladimir Putin declared annexed in 2022 despite not being in full control of it.However, its progress along the front line has been grinding and occupying the heavily fortified towns in northern Donetsk could come at a huge cost of both manpower and resources.Away from the front line, Russia continues to pummel Ukrainian cities, targeting the country's energy facilities as winter draws in.A large-scale drone attack overnight Monday targeted the southern port of Odesa on the Black Sea, damaging industrial facilities, causing fires and affecting the local power supply. At least 15 civilians were killed and 44 injured in combined drone and missile attacks across the country at the weekend. Ukraine continues to hit back, mostly using drones to target industrial sites across Russia and border regions. On Tuesday, Kyiv said it had attacked a petrochemical plant in the Bashkortostan region and a refinery in the Nizhny Novgorod region, while earlier this week, a drone explosion killed a woman and injured three others in the Russian border region of Belgorod.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ukraine: Zelensky visits troops near embattled front line town of Pokrovsk",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/80e3/live/b326f5b0-b9a6-11f0-b2a1-6f537f66f9aa.png"
      ],
      "datePublished": "2025-11-04T19:01:32.000Z",
      "dateModified": "2025-11-04T19:01:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rybelsus, Mounjaro, Wegovy: India's weight-loss drug boom and the risks behind it",
    "url": "https://www.bbc.com/news/articles/c5yplj4j0l5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/682f/live/fa3433b0-b61c-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-11-04T00:49:25.000Z",
    "description": "Affluent Indians drive boom in weight-loss drugs. But concerns are rising too1 day agoSoutik BiswasIndia correspondentReutersIndia's anti-obesity drug",
    "body": "Affluent Indians drive boom in weight-loss drugs. But concerns are rising too1 day agoSoutik BiswasIndia correspondentReutersIndia's anti-obesity drug market has seen a sixfold jump in five yearsThe calls come thick and fast to Mumbai-based diabetologist Rahul Baxi - but not just from patients struggling to control blood sugar.Increasingly, it is young professionals asking the same thing: \"Doctor, can you start me on weight-loss drugs?\"Recently, a 23-year-old man came in, worried about the 10kg he'd gained after starting a demanding corporate job. \"One of my gym friends is on [weight loss] jabs,\" he said.Dr Baxi says he refused, asking him what he would do after losing 10kg on the drug.\"Stop, and the weight comes back. Keep going, and without exercise you'll start losing muscle instead. These medicines aren't a substitute for a proper diet or lifestyle change,\" he told him.Such conversations are becoming increasingly common as demand for weight-loss drugs explodes in urban India - a country with the world's second-largest number of overweight adults and more than 77 million people with Type 2 diabetes. Originally developed to treat diabetes, these drugs are now being hailed as game changers for weight loss, offering results that few previous treatments could match. Yet their growing popularity has also raised difficult questions - about the need for medical supervision, the risks of misuse and the blurred line between treatment and lifestyle enhancement.\"These are the most powerful weight-loss drugs we've ever seen. Many such drugs have come and gone, but nothing compares to these,\" says Anoop Misra, who heads Delhi's Fortis-C-DOC Centre of Excellence for Diabetes, Metabolic Diseases and Endocrinology.Two new drugs dominate India's fast-growing weight-loss market. One is semaglutide, sold by Danish pharmaceutical giant Novo Nordisk as Rybelsus (oral) and Wegovy (injectable) - while Ozempic (injectable) has been approved for diabetes in India but is not yet available for obesity. The other is tirzepatide, marketed by American drugmaker Eli Lilly as Mounjaro, primarily for diabetes but increasingly used for weight loss in India.Both belong to a class known as GLP-1 drugs, which mimic a natural hormone that regulates hunger. By slowing digestion and acting on the brain's appetite centres, they make people feel full faster and stay full longer. Taken once a week, most of these drugs are self-injected in the arm, thigh or stomach. They curb cravings - and in Mounjaro's case, also boost metabolism and energy balance. Getty ImagesThe new generation of weight-loss drugs is typically delivered through easy-to-use injectable pensTreatment starts with a low dose that's slowly raised to a maintenance level, and weight loss usually begins within weeks. Doctors warn that most users can regain weight within a year of stopping, as the body resists weight loss and old cravings return. Prolonged use without exercise or strength training can also strip away muscle along with fat.Also, not everyone responds to GLP-1 drugs, and most plateau after losing about 15% of their body weight. Side effects range from nausea and diarrhoea to rarer risks such as gallstones, pancreatitis and muscle loss. India's high-carb, low-protein diet already fuels sarcopenic obesity - the loss of muscle alongside fat gain - and weight loss without adequate protein or exercise can make it worse.\"With all the media hype and social media buzz, these drugs have become something of a craze among affluent Indians eager to shed a few kilos,\" says Dr Baxi.The frenzy, a Delhi-based physician recalls, was evident even at a recent medical conference.\"Three months after the launch of a new drug, I'd treated about a hundred patients. A colleague said he'd done over a thousand - most using imported jabs bought on the black market.\"India's anti-obesity drug market has surged from $16m in 2021 to nearly $100m today - a more than sixfold jump in five years, according to Pharmarack, a research firm. Novo Nordisk leads the market with its semaglutide brands, with Rybelsus alone accounting for nearly two-thirds of the market since its 2022 launch, according to the firm. Eli Lilly's tirzepatide (marketed as Mounjaro), launched earlier this year, had become India's second-bestselling branded drug by September, according to Pharmarack. Each monthly injectable pen - four weekly doses - of these drugs costs between 14,000-27,000 rupees ($157–300), steep for most Indians.Prashanth Vishwanathan/Bloomberg via Getty ImagesThere are more than 77 million people with Type 2 diabetes in IndiaWhat India has seen so far may just be the tip of the iceberg. Come March, the patent for semaglutide - the active ingredient in Ozempic and Wegovy - expires here, potentially unleashing a flood of cheaper generics and making them more accessible. Jefferies, an investment bank, calls it a \"magic pill moment\" for India, predicting the semaglutide market could reach $1bn with the right pricing, uptake, and government incentives.\"What we have heard is that nearly a dozen companies are already ready with generic versions of Rybelsus, the oral drug,\" says Sheetal Sapale, vice-president at Pharmarack. \"But as affordability improves, the risk of misuse rises too.\"Doctors tell stories of patients being put on high dosage of weight-loss drugs by gym trainers, dieticians and beauty clinics with no authority to prescribe them. Some online pharmacies are delivering drugs after a cursory phone consultation in the absence of a prescription. Beauticians offer \"bridal packages\" promising rapid slimming before the big day. There are fears of spurious medicines flooding the market. Federal minister Jitendra Singh has \"advised caution\" on the new drugs. \"One patient asked me if these new medicines could help his daughter lose seven kilos before her wedding - in three months,\" recalls Dr Bhaumik Kamdar, a Mumbai-based chest physician. \"He wanted to know if they really work.\"One challenge in India, doctors say, is the way people perceive obesity - and how that shapes attitudes toward weight loss.\"Most don't realise that obesity is a chronic, relapsing disease,\" says Dr Muffazal Lakhdawala, a Mumbai-based bariatric surgeon.  \"Many people with chronic obesity try crash diets, lose some weight, then regain even more.\"\"Here, if you're overweight, people assume you're well-fed and affluent. We've gone so far in avoiding the elephant in the room that we've normalised it.\"Obesity, doctors warn, is a gateway to a host of diseases. \"It's linked to at least 20 cancers, infertility, osteoarthritis and fatty liver - now one of the leading causes of cirrhosis,\" says Dr Lakhdawala. Yet, despite it affecting nearly one in eight people globally, there's still no universal consensus on how to define or classify obesity.\"The arrival of these drugs has changed the conversation - obesity is now being treated as a disease, not just a lifestyle issue.\"Doctors across specialities are now turning to weight-loss drugs for more than just obesity or diabetes.Getty ImagesDoctors warn prolonged use of weight-loss drugs without exercise can strip away muscle along with fat Endocrinologists, diabetologists, cardiologists, and nephrologists are increasingly prescribing them to overweight patients to improve heart and kidney outcomes -  for instance, those preparing for angioplasty or stenting.Orthopaedic surgeons now prescribe them to help patients lose weight before knee surgery, while chest physicians use them for those with sleep apnea, a disorder that blocks the airway during sleep.  \"For patients with sleep apnoea who avoid using Continuous Positive Airway Pressure (CPAP) machines, these drugs can help by reducing weight, which in turn improves their sleep,\" says Dr Kamdar.Even bariatric surgery is evolving with India's obesity boom. From just 200 procedures in 2004, the number soared to 40,000 in 2022 - a 200-fold rise.Surgeons like Dr Lakdawala now run multidisciplinary programmes where patients on weight-loss drugs are first guided by endocrinologists, nutritionists, and psychologists for three to six months. \"We don't hand out drugs casually,\" he says. \"Those who don't respond to the drugs or have severe obesity are then considered for surgery.\"His message to the growing number of urban Indians seeking quick fixes is blunt: \"Don't use the drugs for cosmetic weight loss - use it for life-threatening weight gain.\"And for those chasing quick fixes to shed just five or 10kg?He has simpler advice: \"Cut out sugar - it's the biggest evil. Without that, no weight loss will last. Add four days of exercise a week, and you'll lose those 5-7kg - no injections needed.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rybelsus, Mounjaro, Wegovy: India's weight-loss drug boom and the risks behind it",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/682f/live/fa3433b0-b61c-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-11-04T00:49:25.000Z",
      "dateModified": "2025-11-04T00:49:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Mamdani, Cuomo or Sliwa? New Yorkers on their choice for mayor",
    "url": "https://www.bbc.com/news/videos/c77z3p76v8ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e834/live/ea377150-b911-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-11-04T00:26:43.000Z",
    "description": "New York City is electing its next mayor on Tuesday in a closely-watched race with national implications. Zohran Mamdani, the state assembly member an",
    "body": "New York City is electing its next mayor on Tuesday in a closely-watched race with national implications. Zohran Mamdani, the state assembly member and Democratic candidate is the frontrunner. He is facing Republican Curtis Sliwa, and former governor Andrew Cuomo, who is attempting a comeback since he lost to Mamdani in the Democratic primary. The BBC asked New Yorkers what they're looking for in the candidates, and who they think could deliver it. Video by Meiying Wu",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Mamdani, Cuomo or Sliwa? New Yorkers on their choice for mayor",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e834/live/ea377150-b911-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-11-04T00:26:43.000Z",
      "dateModified": "2025-11-04T00:26:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]