[
  {
    "title": "Teenager dies from Swiss bar fire injuries, bringing death toll to 41",
    "url": "https://www.bbc.com/news/articles/c0lxr1ne52ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e3ac/live/89810a70-ff74-11f0-bce7-ab44a0df1622.jpg",
    "tag": "World",
    "date": "2026-02-01T14:04:04.000Z",
    "description": "18 hours agoGeorge WrightAFP via Getty ImagesMany are still being treated in hospital for severe burns sustained in the fire at Le Constellation barA ",
    "body": "18 hours agoGeorge WrightAFP via Getty ImagesMany are still being treated in hospital for severe burns sustained in the fire at Le Constellation barA teenager who was injured when a deadly bar fire broke out in a Swiss ski resort on New Year's Eve has died in hospital, taking the death toll to 41, the local public prosecutor announced.\"An 18-year-old Swiss national died at a hospital in Zurich on January 31,\" the Wallis canton's public prosecutor, Beatrice Pilloud, said in a statement.No further information would be released at this stage, she added.The fire at Le Constellation bar in Crans-Montana - a venue known to be popular with a younger crowd in the ski resort town, where the drinking age is 16 - also injured 116 people.Most of the victims of the fire were young - eight were under the age of 16 - and many are still being treated in hospital for severe burns.Switzerland's Federal Office for Civil Protection told the AFP news agency on Friday that, as of Monday, 44 patients were being treated abroad. They included 18 in France, 12 in Italy, eight in Germany and six in Belgium.The Wallis health ministry told the news agency that 37 patients were still in Swiss hospitals as of Monday.Initial findings from an investigation suggest the fire began as sparklers attached to champagne bottles ignited soundproof foam that lined the ceiling of the bar's basement.Authorities have acknowledged that the bar had not undergone safety checks for five years.The owners of the bar, Jacques and Jessica Moretti, have been accused by authorities of manslaughter by negligence, bodily harm by negligence and arson by negligence.Criminal proceedings have also been brought against the municipality's head of public safety and a former council fire safety inspector.A Swiss court has imposed a travel ban on Jessica Moretti as an alternative to pre-trial detention. She has had to surrender her passport and must report to police every day.She previously told reporters that she was sorry about the \"unthinkable tragedy\".Jacques Moretti is being held in custody for an initial period of 90 days.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Teenager dies from Swiss bar fire injuries, bringing death toll to 41",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e3ac/live/89810a70-ff74-11f0-bce7-ab44a0df1622.jpg"
      ],
      "datePublished": "2026-02-01T14:04:04.000Z",
      "dateModified": "2026-02-01T14:04:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Iran's supreme leader warns of regional war if US attacks",
    "url": "https://www.bbc.com/news/articles/cx20z5nv9jxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/106f/live/473c3c60-ff4d-11f0-861a-555f9d353c11.jpg",
    "tag": "World",
    "date": "2026-02-01T17:40:37.000Z",
    "description": "15 hours agoBarbara Plett Usher,in Doha, Qatar,andJack BurgessEPAIran is due to hold live fire naval drills in the Strait of HormuzIran's supreme lead",
    "body": "15 hours agoBarbara Plett Usher,in Doha, Qatar,andJack BurgessEPAIran is due to hold live fire naval drills in the Strait of HormuzIran's supreme leader Ayatollah Ali Khamenei has warned that any attack on his country would spark a regional conflict, as the US continues to build up its forces nearby.\"The Americans should know that if they start a war, this time it will be a regional war,\" Khamenei was quoted as saying by the semi-official Tasnim news agency.Donald Trump earlier said Iran was in \"serious discussions\" and he hoped they would lead to something \"acceptable\", while Iran's Foreign Minister Abbas Araghchi told CNN he was \"confident that we can achieve a deal\" on Tehran's nuclear programme.Araghchi said: \"Unfortunately, we have lost our trust [in] the US as a negotiating partner,\" but added the exchange of messages through friendly countries in the region was facilitating \"fruitful\" talks with Washington.Iran's top security official Ali Larijani had previously said a framework for negotiations was progressing.As part of its build up of forces, the US has sent its aircraft carrier the USS Abraham Lincoln to the region and late last week US Central Command said it was operating in the Arabian Sea.\"[Trump] regularly says that he brought ships... The Iranian nation shall not be scared by these things,\" added Khamenei.Iran had been expected to begin a two-day live-fire naval exercise on Sunday in the Strait of Hormuz - one of the world's most important shipping lanes and a key route for energy supplies. However on Sunday Reuters quoted an Iranian official as saying the Iranian Revolutionary Guards Corps (IRGC) navy had no plans for such an exercise.Around a fifth of the world's traded oil passes through the waterway, which is about 33km (21 miles) wide at its narrowest point between Iran and Oman. Iran has in the past threatened to close the strait if it were attacked. The US has warned Iran against any \"unsafe and unprofessional behaviour\" near its forces in the area.Araghchi responded by saying: \"The US military is now attempting to dictate how our Powerful Armed Forces should conduct target practice in their own turf.\"On Saturday, two explosions in Iran heightened anxiety in the country. Local authorities said a blast that killed one and hurt 14 at a building in the southern port city of Bandar Abbas was caused by a gas leak. Tasnim denied social media reports that a Revolutionary Guards Corps navy commander had been targeted in the blast.In the south-western city of Ahvaz, at least four people were killed in another explosion, with local authorities again blaming a gas leak, according to Iran's Tehran Times.On Thursday, Trump said he had told Iran that it had to do two things to avoid US military action: \"Number one, no nuclear. And number two, stop killing protesters.\"The US-based Human Rights Activists News Agency says it has confirmed the killing of more than 6,300 people since the unrest began in late December, and is investigating another 17,000 reported deaths.Another group, the Norway-based Iran Human Rights (IHR), has warned the final toll could exceed 25,000.In his remarks on Sunday, Khamenei accused protesters of attacking police, the IRGC and other facilities including banks and mosques.\"The coup was suppressed,\" Tasnim quoted him as saying.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iran's supreme leader warns of regional war if US attacks",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/106f/live/473c3c60-ff4d-11f0-861a-555f9d353c11.jpg"
      ],
      "datePublished": "2026-02-01T17:40:37.000Z",
      "dateModified": "2026-02-01T17:40:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Iranian protester Erfan Soltani released on bail, reports say",
    "url": "https://www.bbc.com/news/articles/ceqz8r2j24do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ea5/live/d65b2250-ff87-11f0-b5b6-6b2a047b2cea.jpg",
    "tag": "World",
    "date": "2026-02-01T19:00:01.000Z",
    "description": "13 hours agoGeorge WrightHengaw Organization for Human RightsErfan Soltani was arrested on 10 January in the city of FardisA 26-year-old Iranian man w",
    "body": "13 hours agoGeorge WrightHengaw Organization for Human RightsErfan Soltani was arrested on 10 January in the city of FardisA 26-year-old Iranian man who was reportedly sentenced to death in connection with anti-government protests last month has been released on bail, reports say.Erfan Soltani was arrested on 8 January in the city of Fardis, just west of Tehran, as protests swept across the country, prompting a deadly crackdown by Iranian authorities.Officials then informed his family that he had been scheduled to be executed within days, without giving any additional details, according to Norway-based Kurdish human rights group Hengaw.But Iran's judiciary denied that he was sentenced to death, saying he faced security-related charges carrying prison terms only.Soltani's lawyer, Amir Mousakhani, told news agency AFP that he had been released on bail on Saturday \"and received all of his belongings including his cellphone\".A bail of \"two billion tomans\" (around $12,600; £9,200)  was paid for his release, the lawyer added.Hengaw and Iranian media, including Isna, a semi-official Iranian news agency, also said Soltani had been bailed.The arrest of Soltani, a clothes shop owner, made headlines around the world when it was reported that he was allegedly due to be executed.At the time, one of Soltani's relatives told BBC Persian that a court had issued a death sentence \"in an extremely rapid process, within just two days\".In January, the Iranian government called reports by foreign media organisations that Soltani faced execution a \"blatant act of news fabrication\".Iranian Foreign Minister Abbas Araghchi also said in an interview with US television that there was \"no plan\" to hang people.Following the initial reports, Hengaw later said that, according to information obtained through relatives, Soltani's execution had been postponed.The US-based Human Rights Activists News Agency says it has confirmed the killing of more than 6,300 people since the unrest began in late December, and is investigating another 17,000 reported deaths.Another group, the Norway-based Iran Human Rights (IHR), has warned the final toll could exceed 25,000.In remarks on Sunday, Khamenei accused protesters of attacking police, the IRGC and other facilities including banks and mosques.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iranian protester Erfan Soltani released on bail, reports say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6ea5/live/d65b2250-ff87-11f0-b5b6-6b2a047b2cea.jpg"
      ],
      "datePublished": "2026-02-01T19:00:01.000Z",
      "dateModified": "2026-02-01T19:00:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gaza's key Rafah border crossing with Egypt reopens ",
    "url": "https://www.bbc.com/news/articles/c99kdjdj9l8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7b71/live/1b5c3eb0-0006-11f1-9387-1308f114c3c8.jpg",
    "tag": "World",
    "date": "2026-02-02T08:15:10.000Z",
    "description": "17 minutes agoHafsa KhalilEPAAn aid lorry passes by the Rafah crossing during a trial reopening on SundayPalestinians have started to re-enter the Raf",
    "body": "17 minutes agoHafsa KhalilEPAAn aid lorry passes by the Rafah crossing during a trial reopening on SundayPalestinians have started to re-enter the Rafah border crossing between the Gaza Strip and Egypt after it reopened for the movement of people.The crossing has largely been closed since May 2024, when the Palestinian side was captured by Israeli forces.The long-delayed reopening is a key part of the first stage of US President Donald Trump's ceasefire plan between Israel and Hamas, which began in October.Only dozens of people will be able to cross in both directions each day. Humanitarian aid and commercial goods will still not be allowed through.Around 20,000 sick and wounded Palestinians are waiting to leave Gaza for treatment.Israeli reports say only 50 patients - accompanied by two relatives - will be allowed to exit each day, and that 50 of the tens of thousands of people who left Gaza during the war will be allowed to return.The World Health Organization (WHO) will oversee the transfer of patients from territory under Hamas control, transporting them by bus through territory controlled by the Israeli military to the crossing, BBC News understands.Israeli Defence Minister Israel Katz warned that anyone who crossed the Yellow Line, which marks Israeli-controlled territory under the ceasefire deal, would be \"met with fire\".The Rafah crossing will be run by supervisors from the European Union and local Palestinian staff, while Israel will carry out remote security checks.On Sunday, Israeli authorities said a trial opening of the crossing was carried out and completed.One Palestinian official familiar with the arrangements for the trial run told the BBC around 30 Palestinian staff members had arrived at the Egyptian side of the crossing, ahead of the operational phase.Trump's 20-point Gaza peace plan says the reopening of the Rafah crossing in both directions will be subject to the same mechanism implemented under a previous ceasefire deal in January last year.Before being seized by Israel in 2024, the crossing was the main exit point for Palestinians allowed to leave during the conflict and a key entry point for humanitarian aid.In December, the Israeli government said the Rafah crossing would open to allow Palestinians to leave Gaza. But Egypt said the crossing would only be opened if movement was allowed in both directions, enabling the return of tens of thousands of Palestinians who fled Gaza.The crossing's opening was also delayed due to the Israeli government making it conditional on Hamas finding the body of the last dead Israeli hostage in Gaza.Last week, the Israeli military said it had retrieved the remains of police officer Master Sgt Ran Gvili at a cemetery in northern Gaza.He was one of the 251 people abducted by Hamas and its allies during their attack on Israel on 7 October 2023, which killed around 1,200 people.Israel's military campaign in Gaza, launched in response to the attack, has killed more than 71,790 Palestinians, according to the territory's Hamas-run health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gaza's key Rafah border crossing with Egypt reopens ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7b71/live/1b5c3eb0-0006-11f1-9387-1308f114c3c8.jpg"
      ],
      "datePublished": "2026-02-02T08:15:10.000Z",
      "dateModified": "2026-02-02T08:15:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Norway's PM agrees crown princess had 'poor judgement' over Epstein links",
    "url": "https://www.bbc.com/news/articles/c1508llzw4qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6a11/live/14ff73a0-0008-11f1-a8b8-bdd2c5f9bcad.jpg",
    "tag": "World",
    "date": "2026-02-01T23:26:04.000Z",
    "description": "9 hours agoPaul KirbyEurope digital editor in OsloCorbis via Getty ImagesCrown Princess Mette-Marit said she regretted having any contact with Epstein",
    "body": "9 hours agoPaul KirbyEurope digital editor in OsloCorbis via Getty ImagesCrown Princess Mette-Marit said she regretted having any contact with Epstein at allNorwegian Prime Minister Jonas Gahr Støre has said he agrees with Crown Princess Mette-Marit's admission of \"poor judgement\" after it emerged she had extensive contacts with the late sex offender Jeffrey Epstein.The princess features hundreds of times between 2011-14 in the latest files released by the US Department of Justice relating to Epstein.This latest embarrassment for the royal family comes on the eve of her son's seven-week trial in Oslo on 38 charges including rape and assault.Princess Mette-Marit married Norway's Crown Prince Haakon as a commoner when her son Marius Borg Høiby was four and is in line to become queen when her husband accedes to the throne.As the content of her email exchanges began to emerge, the princess released a statement on Saturday saying: \"I showed poor judgement and regret having any contact with Epstein at all. It is simply embarrassing.\" She went on to express her \"deep sympathy and solidarity with the victims of the abuses committed by Jeffrey Epstein\".Although the prime minister did not go further than agreeing with the princess's admission of poor judgement, his implicit criticism of her is considered unusual.  Støre said he also believed that ex-Prime Minister Thorbjørn Jagland had exercised \"poor judgement\", after it emerged that he had planned a family holiday on Epstein's private island, though he then cancelled it.The latest cache of Epstein files reveals that Princess Mette-Marit spent four days at Epstein's house in Palm Beach, Miami in January 2013 and, in one email from the HRH Crown Princess account, Epstein was asked whether a mother should suggest naked women carrying a surfboard for her son's wallpaper.US Department of JusticeThe warm nature of the correspondence has appalled commentators in Norway, with one message implying she was aware of his initial jail term in 2008.Norway's royal family has been buffeted by a succession of scandals of late, including the marriage of the crown prince's sister, Princess Märtha Louise to a self-styled American shaman.Now, as Norwegians prepare for the trial of Marius Borg Høiby, questions are being asked about his mother's failure to realise the toxic nature of maintaining contact with Epstein, and the role of her advisers.Her 29-year-old son, who is not part of the royal family, denies the most serious charges against him. One charge of rape involves intercourse while a woman was asleep. Three others allege sexual assault while women were incapacitated, which also counts as rape in Norway.If found guilty he could face at least 10 years in prison.No member of the royal family will attend the trial, which starts at Oslo district court on Tuesday. However, in an emotional statement to reporters last week, Crown Prince Haakon said \"our thoughts are with everyone who is affected by this case... we understand that this is a difficult time for many of you, and we sympathise\".Although his stepson was not a member of the royal family, he said: \"We care about him, and he is an important member of our family.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Norway's PM agrees crown princess had 'poor judgement' over Epstein links",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6a11/live/14ff73a0-0008-11f1-a8b8-bdd2c5f9bcad.jpg"
      ],
      "datePublished": "2026-02-01T23:26:04.000Z",
      "dateModified": "2026-02-01T23:26:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Venezuela releases human rights advocate Javier Tarazona",
    "url": "https://www.bbc.com/news/articles/cgqedv5elzpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3e2f/live/eeebdcd0-ff8a-11f0-b5b6-6b2a047b2cea.png",
    "tag": "World",
    "date": "2026-02-01T17:29:48.000Z",
    "description": "15 hours agoHenri AstierWikipedia CommonsJavier Tarazona was arrested in July 2021 - photo Juanjoseco123, Wikimedia Commons CC BY-SA 4.0Prominent Vene",
    "body": "15 hours agoHenri AstierWikipedia CommonsJavier Tarazona was arrested in July 2021 - photo Juanjoseco123, Wikimedia Commons CC BY-SA 4.0Prominent Venezuelan rights activist Javier Tarazona has been freed, in the latest prisoner release announced by the government amid US pressure for reforms.Tarazona, the head of human rights NGO Fundaredes, was arrested in 2021 and detained in the notorious El Helicoide prison in the capital Caracas. His release was announced on Sunday by Fundaredes.Foro Penal, another Venezuelan rights group, said it had verified the liberation of more than 300 political prisoners since 8 January.On Friday acting President, Delcy Rodríguez said the government would introduce an amnesty law that is expected to benefit hundreds of political prisoners. Under the bill, El Helicoide is also due to be closed.In its statement on Sunday, Fundaredes said Tarazona had been jailed \"for defending human rights, denouncing abuses, and speaking out\".It added that his release did not \"erase the injustice he suffered\", but represented \"a necessary step in a process marked by criminalisation, persecution, and a lack of due process\".Tarazona had alleged that government officials had links with guerrillas in Colombia, with which Venezuela has a 2,000km (1,200-mile) border. The government accused him of treason, terrorism and incitement to hatred.Maduro's dramatic capture by US special forces on 3 January has encouraged families of opposition and human rights figures arrested under Maduro and his predecessor Hugo Chávez to step up their campaign for releases.Venezuela has long denied holding political prisoners, but families and rights advocates have demanded charges against detainees be dropped. Opposition politicians, journalists, and activists have faced charges including terrorism and treason, which their families describe as arbitrary.The amnesty bill announced by Rodríguez is expected to be approved by the National Assembly in the coming days. Its aim, the acting president said, is to \"heal the wounds of political confrontation, violence, and extremism\".Foro Penal has said that many of those freed in recent weeks have not had the charges against them dropped.This has left them in legal limbo and they have been barred from speaking in public, the group added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Venezuela releases human rights advocate Javier Tarazona",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3e2f/live/eeebdcd0-ff8a-11f0-b5b6-6b2a047b2cea.png"
      ],
      "datePublished": "2026-02-01T17:29:48.000Z",
      "dateModified": "2026-02-01T17:29:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "French tech giant Capgemini to sell US subsidiary working for ICE",
    "url": "https://www.bbc.com/news/articles/cd9e4xw8vqqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f440/live/24087740-ff70-11f0-bce7-ab44a0df1622.jpg",
    "tag": "World",
    "date": "2026-02-01T14:23:30.000Z",
    "description": "18 hours agoJack BurgessGetty ImagesThe US immigration enforcement agency has faced increased criticism following the deaths of two US citizensFrench ",
    "body": "18 hours agoJack BurgessGetty ImagesThe US immigration enforcement agency has faced increased criticism following the deaths of two US citizensFrench technology giant Capgemini has announced it will sell its US subsidiary after its work locating people for immigration enforcement agency ICE sparked outrage.Capgemini has come under pressure from French lawmakers over a contract its subsidiary signed with ICE, amid international scrutiny over the methods used by the agency's agents in Minnesota.Capgemini Government Solutions has been under contract since 18 December to provide \"skip tracing services for enforcement and removal operations\", public records show.Skip tracing services locate individuals whose whereabouts are unknown. Capgemini Government Solutions is set to be paid more than $4.8m (£3.5m) for its work tracing people for ICE, which is due to continue until 15 March, US government listings show. It is one of 13 contracts the subsidiary holds with ICE.Capgemini, one of the largest listed companies in France, said in a statement that it had not been able \"to exercise appropriate control over certain aspects of this subsidiary's operations in order to ensure alignment with the Group's objectives\".It added that \"the divestiture process of this business will be initiated immediately\".Criticism of ICE practices has intensified in recent weeks since the shooting of 37-year-old Pretti, the second fatal shooting of a US citizen since immigration agents began surging several cities across the US, acting on the Trump administration's drive to increase deportations of illegal immigrants.The killing of Pretti involved Border Patrol, an immigration agency which works alongside ICE, while Good was shot by an ICE agent.ICE has detained thousands since US President Donald Trump returned to the White House with a pledge to increase deportations. ICE enforcement actions have regularly occurred in public places, leading to a number of clashes with protesters.Last week, Capgemini's CEO Aiman Ezzat wrote on LinkedIn that \"we were recently made aware, through public sources, of the nature of a contract awarded to Capgemini Government Solutions by DHS' Immigration and Customs Enforcement in December 2025\". \"The nature and scope of this work has raised questions compared to what we typically do as a business and technology firm,\" he said.The revelation provoked outrage amongst French politicians.French Finance Minister Roland Lescure called for the company \"to be transparent\" about the contracts it has with ICE.Meanwhile, left-wing opposition MP Hadrien Clouet called for sanctions to be imposed on French firms working with ICE, commenting: \"French private companies are collaborating with ICE. We do not accept this.\"Capgemini was founded in 1967 and currently functions as an IT services and consulting firm. It currently has more than 340,000 employees worldwide and is valued at €22bn (£19bn).",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "French tech giant Capgemini to sell US subsidiary working for ICE",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f440/live/24087740-ff70-11f0-bce7-ab44a0df1622.jpg"
      ],
      "datePublished": "2026-02-01T14:23:30.000Z",
      "dateModified": "2026-02-01T14:23:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kennedy Center to close for two years for renovations, Trump says",
    "url": "https://www.bbc.com/news/articles/c1ev53zyww2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b85e/live/ac72e680-ffff-11f0-b7e1-afb6d0884c18.jpg",
    "tag": "World",
    "date": "2026-02-02T01:13:12.000Z",
    "description": "7 hours agoMadeline HalpertWatch: President Trump's name added to facade of Kennedy CenterThe Kennedy Center in Washington DC will be closed for a two",
    "body": "7 hours agoMadeline HalpertWatch: President Trump's name added to facade of Kennedy CenterThe Kennedy Center in Washington DC will be closed for a two-year renovation beginning in July, US President Donald Trump has announced.Trump wrote on Truth Social on Sunday that the centre would close on 4 July this year \"in honour of the 250th Anniversary of our Country\". The move follows several artists cancelling performances at the storied institution after it was recently renamed as the Trump Kennedy Center.Shortly after taking office, the president fired several of the board members at the centre and replaced them with allies, who then voted to make Trump chairman of the board.The new board renamed the institution the Donald J Trump and the John F Kennedy Memorial Center for the Performing Arts in December. New signage appeared on the building's exterior the following day.Several musical acts, including Wicked composer Steven Schwartz and a group called Doug Varone and the Dancers, cancelled performances at the centre in the following weeks because of the name change. On Thursday, the venue hosted a premiere screening of a documentary about First Lady Melania Trump.The US president said there would be a \"scheduled grand reopening\" of the facility and that the renovations had already been financed. \"I have determined that The Trump Kennedy Center, if temporarily closed for construction, revitalisation, and complete rebuilding, can be, without question, the finest performing arts facility of its kind, anywhere in the world,\" he wrote.\"In other words, if we don't close, the quality of construction will not be nearly as good, and the time to completion, because of interruptions with Audiences from the many events using the facility, will be much longer.\"Trump had lambasted the physical state of the centre and had worked with the US Congress to allocate more than $250m (£182m) to rebuild it, one of many renovation projects he has taken on in his second term. Some US lawmakers and legal scholars have argued that, because the centre was named in a 1964 law, Congress must have a say on any name change.Last December, Democratic US Representative Joyce Beatty filed a lawsuit seeking to remove Trump's name for that reason. Some members of President John F Kennedy's family have also denounced the move. The centre was named in Kennedy's memory shortly after his assassination.Joe Kennedy III, a former US House of Representatives member and grandnephew of the late president, said the venue was \"a living memorial to a fallen president and named for President Kennedy by federal law\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kennedy Center to close for two years for renovations, Trump says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b85e/live/ac72e680-ffff-11f0-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-02T01:13:12.000Z",
      "dateModified": "2026-02-02T01:13:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Deadly gun and bomb attacks hit Pakistan's Balochistan province",
    "url": "https://www.bbc.com/news/articles/cn42nedxqyqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e4ff/live/85377580-ff56-11f0-b8ba-b50eb3939275.jpg",
    "tag": "World",
    "date": "2026-02-01T10:08:55.000Z",
    "description": "22 hours agoJaroslav LukivEPAAttackers struck cities across Balochistan including the provincial capital QuettaA series of gun and bomb attacks across",
    "body": "22 hours agoJaroslav LukivEPAAttackers struck cities across Balochistan including the provincial capital QuettaA series of gun and bomb attacks across Pakistan's south-western Balochistan province have killed 31 civilians and 17 security service personnel, the region's Chief Minister Sarfraz Bugti says.Security forces responding to the violence killed at least 145 attackers during a 40-hour gun battle, he said. The Balochistan Liberation Army (BLA) rebel group had earlier said it was behind the attacks, claiming dozens of soldiers were killed.It marks an escalation of violence in the impoverished but resource-rich province, where Pakistan's government has been battling an ethnic insurgency for decades.Pakistan accused India of supporting the BLA. Delhi has repeatedly denied such accusations.Grenade and gun attacks in the provincial capital Quetta and cities and towns across the province targeted hospitals, schools, banks and markets, Pakistan's junior interior minister Talal Chaudhry said.\"In each case, the attackers came in dressed as civilians and indiscriminately targeted ordinary people working in shops,\" he said, adding that the attackers had used civilians as human shields.Armed attackers also opened fire at security installations, attempted to carry out suicide bombings and briefly blocked roads in urban areas.Some key administrative buildings in Quetta and nearby roads were reported to have been sealed off during the day. Mobile phone services were jammed, and regional train services were suspended.Prime Minister Shehbaz Sharif later praised the military, pledging to \"continue the war against terrorism until its complete eradication\".The BLA said it had launched a coordinated operation dubbed Herof, or \"black storm\" against security forces, and claimed to have killed 84 members of the security forces and kidnapped a further 18. The claim has not been independently verified and the Pakistani military has not commented.The BLA accuses Pakistan's federal government of exploiting the rich mineral resources of its largest province without the local population benefiting. Local activists also blame Pakistani security forces for enforced disappearances, which Islamabad denies.Balochistan covers nearly 44% of the country's total land, sharing a volatile border with Iran and Afghanistan and covering part of the Arabian Sea coastline. It is home to about 5% of the country's more than 240 million people. The province is also the richest in terms of natural resources, including gas and minerals. The region derives its name from the Baloch tribe, which is the largest ethnic group there. Resistance against the Pakistani government and an insurgency advocating for an independent state for the Baloch people began in 1948, after Pakistan gained independence from the British Empire.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Deadly gun and bomb attacks hit Pakistan's Balochistan province",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e4ff/live/85377580-ff56-11f0-b8ba-b50eb3939275.jpg"
      ],
      "datePublished": "2026-02-01T10:08:55.000Z",
      "dateModified": "2026-02-01T10:08:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israel to ban MSF from working in Gaza over refusal to provide staff list",
    "url": "https://www.bbc.com/news/articles/cvg1ymmkpkro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/01c2/live/b6f92bb0-ff68-11f0-bce7-ab44a0df1622.jpg",
    "tag": "World",
    "date": "2026-02-01T13:20:38.000Z",
    "description": "19 hours agoGeorge WrightAFP via Getty ImagesIsrael says it will ban Médecins Sans Frontières (MSF) from working in Gaza after the medical charity ref",
    "body": "19 hours agoGeorge WrightAFP via Getty ImagesIsrael says it will ban Médecins Sans Frontières (MSF) from working in Gaza after the medical charity refused to hand over a list of its staff in the territory.The Israeli government had ordered 37 organisations to submit documents about their local and international workers in Gaza, claiming some in MSF had links to armed groups Hamas and Islamic Jihad. The charity has vehemently denied this.MSF announced on Friday that it would not share a list of its Palestinian and international staff with Israeli authorities as it had not secured \"assurances to ensure the safety of our staff\".In response, Israel said it was \"moving to terminate the activities\" of MSF in Gaza.The Israeli Ministry of Diaspora Affairs and Combating Antisemitism said the decision followed \"MSF's failure to submit lists of local employees, a requirement applicable to all humanitarian organisations operating in the region\".On 30 December, Israel announced that it was going to revoke the licences of 37 international non-governmental organisations working in Gaza and the occupied West Bank, saying they had failed to meet new registration requirements.At the time the diaspora ministry said the measure was needed to prevent \"the infiltration of terrorist operatives into humanitarian structures\".The groups - which include MSF, ActionAid and the Norwegian Refugee Council - were told their operations must end within 60 days.The move was condemned by 10 countries, including the UK, France and Canada, who said the rules would have a severe impact on access to essential services.MSF said in a statement on Friday that it had informed Israeli authorities that, as an \"exceptional measure\", it would share a list of names of its Palestinian and international staff, \"subject to clear parameters, with our staff safety at its core\". \"However, despite repeated efforts, it became evident in recent days that we were unable to build engagement with Israeli authorities on the concrete assurances required,\" it said.\"These included that any staff information would be used only for its stated administrative purpose and would not put colleagues at risk.\"On Sunday, it said the move was a \"pretext to obstruct humanitarian assistance\" to Gaza.\"Israeli authorities are forcing humanitarian organisations into an impossible choice between exposing staff to risk or interrupting critical medical care for people in desperate need,\" it said. Sam Rose, director of Gaza affairs for the UN's Palestinian refugee agency Unrwa, told the BBC that this will have \"major negative consequences on the ability of international organisations to provide healthcare inside Gaza\".He said MSF had its own reasons for not handing over staff lists \"given the large numbers of staff of medical organisations and international organisations that have been killed over the past two years\". A total of 1,700 healthcare staff have been killed in the war, including 15 MSF staff, the medical charity says.MSF says it currently provides at least 20% of hospital beds in Gaza and operates around 20 health centres. Last year, it carried out more than 800,000 medical consultations and more than 10,000 infant deliveries, while providing drinking water.The latest war in Gaza began after the Hamas-led attack on southern Israel on 7 October 2023, when about 1,200 other people were killed and 251 were taken hostage.Israel responded by launching a military campaign in Gaza, during which more than 71,660 people have been killed, according to the Hamas-run health ministry.It says at least 509 Palestinians have been killed since the ceasefire began on 10 October 2025. Four Israeli soldiers have also been killed.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israel to ban MSF from working in Gaza over refusal to provide staff list",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/01c2/live/b6f92bb0-ff68-11f0-bce7-ab44a0df1622.jpg"
      ],
      "datePublished": "2026-02-01T13:20:38.000Z",
      "dateModified": "2026-02-01T13:20:38.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China executes four more Myanmar mafia members",
    "url": "https://www.bbc.com/news/articles/cg4e9eqz4rxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8318/live/0cf9af20-ffec-11f0-a031-d51a6bff75dd.jpg",
    "tag": "World",
    "date": "2026-02-02T04:00:51.000Z",
    "description": "5 hours agoKoh EweCCTVA Guangdong court convicted more than 20 of the Bai family's members and associates of fraud, homicide and injuryChina has execu",
    "body": "5 hours agoKoh EweCCTVA Guangdong court convicted more than 20 of the Bai family's members and associates of fraud, homicide and injuryChina has executed four members of the Bai family mafia, one of the notorious dynasties that ran scam centres in Myanmar, state media report.They were among 21 of the family's members and associates who were convicted of fraud, homicide, injury and other crimes by a court in Guangdong province.Last November the court sentenced five of them to death including the clan's patriarch Bai Suocheng, who died of illness after his conviction, state media reported.For years, the Bais, Mings and several other families dominated Myanmar's border town of Laukkaing, where they ran casinos, red-light districts and cyberscam operations.Among the clans, the Bais were \"number one\", Bai Suocheng's son previously told state media after he was detained.The Bais, who controlled their own militia, established 41 compounds to house cyberscam activities and casinos, authorities said. Within the walls of those compounds was a culture of violence, where beatings and torture were routine. The Bai family's criminal activities led to the deaths of six Chinese citizens, the suicide of one person and multiple injuries, the court said.The Bais rose to power in Laukkaing in the early 2000s after the town's then warlord was ousted in a military operation led by Min Aung Hlaing - who now leads Myanmar's military government.The military leader had been looking for co-operative allies, and Bai Suocheng - then a deputy of the warlord - fitted the bill.But the families' empires crashed in 2023, when Beijing became frustrated by the Myanmar military's inaction on the scam operations and tacitly backed an offensive by ethnic insurgents in the area, which marked a turning point in Myanmar's civil war.That led to the capture of the scam mafias and their members were handed to Beijing. In China, they became subjects of state documentaries which emphasised Chinese authorities' resolve to eradicate the scam networks. With these recent executions Beijing appears to be sending a message of deterrence to would-be scammers. Hundreds of thousands of people have been trafficked to run online scams in Myanmar and elsewhere in South East Asia, according to estimates by the United Nations.Among them are thousands of Chinese people, and their victims who they swindle billions of dollars from are mainly Chinese as well.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China executes four more Myanmar mafia members",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8318/live/0cf9af20-ffec-11f0-a031-d51a6bff75dd.jpg"
      ],
      "datePublished": "2026-02-02T04:00:51.000Z",
      "dateModified": "2026-02-02T04:00:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Melania director Brett Ratner pictured cuddling woman in Epstein files",
    "url": "https://www.bbc.com/news/articles/c0mk3v2k3r0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fcc5/live/cb028b50-ff55-11f0-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-01T12:04:52.000Z",
    "description": "20 hours agoAleks PhillipsUS Department of JusticeThe director of the new documentary on US First Lady Melania Trump has appeared embracing a young wo",
    "body": "20 hours agoAleks PhillipsUS Department of JusticeThe director of the new documentary on US First Lady Melania Trump has appeared embracing a young woman in images released by the US Department of Justice on Friday.Brett Ratner, who also directed the Rush Hour films and X-Men: The Last Stand, can be seen sitting on a sofa beside the late sex offender Jeffrey Epstein and two women whose identities have been obscured.When the images were taken remains unclear, though they appear to have been taken in the same location as photos of Ratner and Epstein alongside the late French modelling agent Jean-Luc Brunel that were released in December.There is no indication of wrongdoing from the files. The BBC has contacted Ratner's representative for comment.The newly released images were part of a tranche of millions of files relating to the late sex offender, who died in custody in 2019 while awaiting trial on sex trafficking charges.A series of thumbnails of the picture collection shows Ratner, Epstein and Brunel smiling and relaxing with different women, all of whose identities have been concealed.The law that led to the files' release mandates that they be redacted to protect victims or ongoing investigations - though a lawyer representing many of them has said the identities of numerous survivors were disclosed in the drop.The files were released the same day as Melania: 20 Days to History, a behind-the-scenes look at the first lady's life in the days leading up to her husband's January 2025 inauguration.It is Ratner's first project since he was accused of sexual misconduct at the height of the #MeToo movement in 2017. Ratner has denied the allegations.He had been under investigation on suspicion of the rape of minors and trafficking of minors for sexual exploitation. Prosecutors suspected him of transporting young women for Epstein.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Melania director Brett Ratner pictured cuddling woman in Epstein files",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fcc5/live/cb028b50-ff55-11f0-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-01T12:04:52.000Z",
      "dateModified": "2026-02-01T12:04:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Five-year-old boy and father detained by ICE return to Minnesota",
    "url": "https://www.bbc.com/news/articles/cwynzw7jd4go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5369/live/62e82be0-ff98-11f0-b5b6-6b2a047b2cea.jpg",
    "tag": "World",
    "date": "2026-02-01T18:13:49.000Z",
    "description": "14 hours agoGrace Eliza GoodwinX / Congresswoman Ilan OmarFive-year-old Liam Conejo Ramos and his father Adrian Alexander Conejo Arias are back in Min",
    "body": "14 hours agoGrace Eliza GoodwinX / Congresswoman Ilan OmarFive-year-old Liam Conejo Ramos and his father Adrian Alexander Conejo Arias are back in MinnesotaA five-year-old boy and his father who were detained by Immigration and Customs Enforcement (ICE) in Minnesota have returned home, a US congressman has said.Texas Congressman Joaquin Castro, a Democrat, announced on Sunday that Liam Conejo Ramos and his father Adrian Alexander Conejo Arias had been released from a detention centre in Dilley, Texas and had travelled back to Minneapolis.\"Liam is now home. With his hat and his backpack,\" Castro said.The detainment of the pair sparked protests outside the detention facility where they were being held and led to a national outcry. The Department of Homeland Security (DHS) said in a statement: \"ICE did NOT target or arrest a child.\"Their return home came after US District Judge Fred Biery granted an emergency request from the family's lawyer and ordered their release on Saturday. The judge condemned their detention as driven by a \"perfidious lust for unbridled power\".\"The case has its genesis in the ill-conceived and incompetently implemented government pursuit of daily deportation quotas, apparently even if it requires traumatising children,\" Biery wrote in his ruling.Biery, an appointee of former US President Bill Clinton, said deportations through the US immigration system should occur in a more orderly and humane way than what was currently policy.While the father and son were still in the Texas detention centre, Castro had  written on social media that the young boy was not doing well being away from his family, classmates and home.  The DHS has said the pair entered the US illegally, while a lawyer for the family said they followed proper protocols to seek asylum.On Sunday, the DHS said in a statement to the BBC's US partner CBS News: \"The Trump administration is committed to restoring the rule of law and common sense to our immigration system, and will continue to fight for the arrest, detention, and removal of aliens who have no right to be in this country.\"Minnesota Congresswoman Ilhan Omar, a Democrat and outspoken critic of ICE, also posted on social media about the father and son's return to Minnesota. \"Liam is home now and we are grateful to [Joaquin Castro] for traveling to Minneapolis with him and his dad,\" she wrote. \"Welcome home Liam.\"There have been conflicting reports about what happened during the ICE operation in which Ramos was first approached by ICE agents.Officials at the school Ramos attended have said the boy had just arrived home from pre-school when an ICE agent asked the child to knock on the door of the home to see if anyone else was there.A school official said another adult living in the home asked to take the young boy inside, but was refused.School board member Mary Granlund said she was at the scene and told immigration officials she could take Ramos, but they still detained him.ICE denied the child had been detained in a post on X.\"A criminal illegal alien ABANDONED his child as he fled from ICE officers, and our officers ensured the child was kept SAFE in the bitter cold,\" the agency said.\"ICE made multiple attempts to get the family inside the house to take custody of the child. They refused to accept custody of the child. The father told officers he wanted the child to remain with him,\" the agency said.US Vice-President JD Vance told reporters that ICE had no choice because \"the father ran\".Marc Prokosch, a lawyer representing the family, said the father and son \"did everything right\" when they came into the country from Ecuador in 2024.They entered the US at a port of entry to seek asylum, they used the CBP One app, they made an appointment, they presented themselves to Customs and Border Protection, and they had shared all their information with the government, Prokosch said.\"This family was not eluding ICE in any way. They were following all the established protocols pursuing their claim for asylum, showing up for their court hearings and pose no safety, no flight risk, and never should have been detained,\" he added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Five-year-old boy and father detained by ICE return to Minnesota",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5369/live/62e82be0-ff98-11f0-b5b6-6b2a047b2cea.jpg"
      ],
      "datePublished": "2026-02-01T18:13:49.000Z",
      "dateModified": "2026-02-01T18:13:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Watch: Giant rat leads floating parade to kick off Venice Carnival 2026",
    "url": "https://www.bbc.com/news/videos/cly5l1yp72wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1e89/live/c33e6270-ffe3-11f0-a8b8-bdd2c5f9bcad.jpg",
    "tag": "World",
    "date": "2026-02-02T03:10:57.000Z",
    "description": "The grand opening to the Venice Carnival 2026 took place on Sunday, with a variety of boats and floats making their way through the city's canals.As i",
    "body": "The grand opening to the Venice Carnival 2026 took place on Sunday, with a variety of boats and floats making their way through the city's canals.As is tradition, a giant paper-mâché rat aboard a gondola lead the way; known as \"Pantegana\", it is a long-standing symbol of the carnival.The two-week festival attracts tourists from all over the globe, with dancers, costumes and music lighting up the city.It marks a period of opulence before the beginning of Lent, the Christian tradition of 40 days of fasting in the run up to Easter.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Watch: Giant rat leads floating parade to kick off Venice Carnival 2026",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1e89/live/c33e6270-ffe3-11f0-a8b8-bdd2c5f9bcad.jpg"
      ],
      "datePublished": "2026-02-02T03:10:57.000Z",
      "dateModified": "2026-02-02T03:10:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Twelve miners killed by Russian strike in Ukraine, officials say",
    "url": "https://www.bbc.com/news/articles/cdre7g2je63o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0388/live/14ae8430-ffaa-11f0-8271-fbc780087a4c.jpg",
    "tag": "World",
    "date": "2026-02-02T07:00:55.000Z",
    "description": "2 hours agoMaia DaviesArmed Forces of Ukraine/TelegramThe miners were travelling in a bus when it was hit by a drone, officials sayTwelve miners have ",
    "body": "2 hours agoMaia DaviesArmed Forces of Ukraine/TelegramThe miners were travelling in a bus when it was hit by a drone, officials sayTwelve miners have been killed by a Russian drone strike in eastern Ukraine, the country's largest private energy firm has said.DTEK said a bus carrying workers after a shift in the eastern Dnipropetrovsk region had been targeted in Sunday's attack. At least 15 people were injured, state emergency services said.Earlier, at least two others were killed and nine injured in separate Russian attacks overnight and on Sunday, including six people who were hurt when a drone hit a maternity hospital in Zaporizhzhia.The strikes come while Russia had agreed not to target population centres and energy infrastructure for the duration of a cold snap.Strikes have continued in regions of Ukraine near the front line but cities like the capital, Kyiv, have largely been untouched over the past few days.Moscow did not mention the cold weather when confirming the move, instead saying it was to facilitate peace negotiations due to be held in Abu Dhabi this week.Zaporizhzhia regional head Ivan Fedorov called the hit on the maternity hospital - which occurred as two women were giving birth - further \"proof of a war directed against life\" in a post on Telegram.BBC Verify confirmed the site was Maternity Hospital No.3 on Bocharova Street in the east of the city.Footage shared across social media carried the watermarks of national and local administrations and showed offices, rooms with beds for patients, and a children's room with the windows broken and covered in debris. Some footage showed degrees of fire damage, while two videos showed a fire still burning on the first storey. Another showed fire fighters breaking down interior doors and ferrying patients away.EPAA woman gathers her belongings from a room in the maternity hospital after the strikeReutersNo deaths were reported after the strike at the hospital on SundayUkrainian Foreign Minister Andriy Sybiha said the hospital attack showed Russian President Vladimir Putin was pursuing a \"war against civilians contrary to peace efforts\".Fedorov later reported three people had been injured by a separate strike in a residential area.After the strike on the DTEK bus in the town of Ternivka, the company said 15 miners had been killed. It later revised the death toll down to at least 12.Elsewhere, a man and a woman were killed by a drone strike in the central city of Dnipro, Ganzha said. He also reported that a 72-year-old man had been injured in Nikopol.Separately, a 59-year-old woman was seriously wounded by shelling in Kherson, while three others were injured in a strike in Kharkiv, officials said.Moscow launched a wave of targeted attacks on Ukraine's power grid in January, leaving millions without heating or electricity during an extraordinarily cold winter - with temperatures forecast to plunge below -20C in places.US President Donald Trump had said on Thursday that Putin had agreed to halt aerial attacks on towns and cities including Kyiv during the cold snap. The Kremlin later said the pause would expire on Sunday.Also on Sunday, Ukraine said it was working with Elon Musk's SpaceX to stop Moscow using the firm's Starlink satellite system for drone attacks.Kyiv's military relies on the system for internet connection, but said this week it had found Starlink terminals on long-range drones used by Russia.Musk said steps to stop the \"unauthorised\" use appeared to have worked, while Defence Minister Mykhailo Fedorov thanked him for being \"a true friend of the Ukrainian people\".Meanwhile, Ukrainian President Volodymyr Zelensky said a second round of three-way talks to end the fighting - nearly four years after Russia launched its full-scale invasion of Ukraine - would take place on Wednesday and Thursday, rather than Sunday as had been planned.He earlier said the talks in the United Arab Emirates between Russian, Ukrainian and US officials may have to be postponed due to ongoing tensions between the US and Iran.Negotiations on a peace plan have for months been mediated by the US, with a key sticking point being Ukraine ceding territory to Russia.Moscow currently controls around a fifth of Ukraine, including most of the eastern Donbas region. It wants Kyiv to hand over the areas of the Donbas it has not yet taken by force, while Ukraine reportedly wants Russia to hand back control of its largest nuclear power plant in Zaporizhzhia.Additional reporting by Richard Irvine-Brown, BBC Verify",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Twelve miners killed by Russian strike in Ukraine, officials say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0388/live/14ae8430-ffaa-11f0-8271-fbc780087a4c.jpg"
      ],
      "datePublished": "2026-02-02T07:00:55.000Z",
      "dateModified": "2026-02-02T07:00:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]