[
  {
    "title": "Robert Irwin wins Dancing with the Stars, a decade after sister's victory",
    "url": "https://www.bbc.com/news/articles/ckgl0jv7y61o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4954/live/a4b67ae0-ca8c-11f0-a89b-d31bfe85750c.jpg",
    "tag": "World",
    "date": "2025-11-26T06:02:00.000Z",
    "description": "19 hours agoLana LamSydneyGetty ImagesIrwin competed in the final despite having a rib injuryRobert Irwin, son of the late conservationist Steve Irwin",
    "body": "19 hours agoLana LamSydneyGetty ImagesIrwin competed in the final despite having a rib injuryRobert Irwin, son of the late conservationist Steve Irwin, has been crowned this year's winner of Dancing with the Stars, a decade after his older sister Bindi won the same title. The popular US dancing competition sees stars paired with professional dancers to perform in front of a panel of judges, with the audience also voting on their favourite couple.The 21-year-old was favoured to win, with strong performances over the show's 11 weeks, including a tribute to his father and a surprise appearance from his sister Bindi. With a legion of fans in the US, Irwin's finale had an Australian bent with one dance choreographed to a song by Australian rock band Jet.During the three-hour finale on Tuesday evening, local time, Irwin and his dance partner Witney Carson also performed to songs by Avicii and Sydney-born Sam Sparro.They then triumphed in the \"instant dance challenge\" – where Irwin and Carson were told the style and song minutes before taking to the stage.Irwin, who competed in the final despite having a rib injury, beat fellow finalists including influencer Alix Earle and Olympic gymnast Jordan Chiles.This came despite three contestants - not including Irwin - earning a perfect score of 30 for their first dances. However, Irwin got a perfect score not long after.Getty ImagesThe pair triumphed in the \"instant dance challenge\"He broke down in tears after his final performance, saying that said he wanted to make his father proud.\"I wish he could see it, I really wish he could be here,\" he said.Steve Irwin was famous for his TV wildlife shows which regularly saw him handling crocodiles and led to him being dubbed the \"Crocodile Hunter\".He was killed by a stingray during a diving expedition off the Australian coast in 2006, when Robert was just a baby. Following his father's love for wildlife, Robert Irwin has long been a keen photographer and recently became an Earthshot ambassador.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Robert Irwin wins Dancing with the Stars, a decade after sister's victory",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4954/live/a4b67ae0-ca8c-11f0-a89b-d31bfe85750c.jpg"
      ],
      "datePublished": "2025-11-26T06:02:00.000Z",
      "dateModified": "2025-11-26T06:02:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nicolas Sarkozy illegal campaign financing conviction upheld ",
    "url": "https://www.bbc.com/news/articles/c74x55epn34o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e10a/live/6f4d87d0-caec-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-26T15:11:59.000Z",
    "description": "France's highest court has upheld a sentence against former French President Nicolas Sarkozy over the illegal financing of his 2012 re-election campai",
    "body": "France's highest court has upheld a sentence against former French President Nicolas Sarkozy over the illegal financing of his 2012 re-election campaign.He was found guilty of overspending on his campaign, then hiring a PR firm named Bygmalion to cover it up.Sarkozy, 70, was handed the one-year sentence in 2024 of which six months were suspended, meaning they could be served by wearing an electronic tag instead of going to jail.He has always denied all allegations. Prosecutors in the case said Sarkozy's UMP party spent nearly double the €22.5m (£19.4m) cap on his campaign, splurging on lavish campaign rallies and events.To hide the costs, UMP then asked Bygmalion to invoice the party, rather than the campaign.Today's is the second definitive conviction for the former president, who was in power from 2007 to 2012.Last December the High Court of Appeal upheld a corruption conviction and Sarkozy had to wear an electronic monitoring bracelet for six months.Then, in September, he was sentenced to five years in jail after being found guilty of criminal conspiracy.He spent 20 days in jail before he was released earlier in November. An appeal trial will be held next year. Until then Sarkozy will be subject to strict judicial supervision and barred from leaving France.Days after his release, Sarkozy's team announced the former president was writing a book about his three weeks in jail, titled \"A prisoner's diary\". An excerpt from the book was published on social media: \"In prison there is nothing to see, and nothing to do. I forget the silence that does not exist at La Santé [prison], where there is much to listen to. Here, the noise is, unfortunately, constant. But - like in the desert - inner life strengthens in jail.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nicolas Sarkozy illegal campaign financing conviction upheld ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e10a/live/6f4d87d0-caec-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-26T15:11:59.000Z",
      "dateModified": "2025-11-26T15:11:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "New Zealand 'suitcase murders': Woman gets life in prison for killing her two children",
    "url": "https://www.bbc.com/news/articles/cp84xed0g18o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/05ea/live/feab4ec0-ca66-11f0-9a9f-5d4254b8128b.png",
    "tag": "World",
    "date": "2025-11-26T01:25:44.000Z",
    "description": "A mother in New Zealand who killed her two children and hid their bodies in suitcases has been sentenced to life in prison.Hakyung Lee, who was found ",
    "body": "A mother in New Zealand who killed her two children and hid their bodies in suitcases has been sentenced to life in prison.Hakyung Lee, who was found guilty in September of the shocking murders of eight-year-old Yuna Jo and six-year-old Minu Jo, has to spend at least 17 years behind bars before she is eligible for parole.Lee, 45, argued she was insane at the time of the killings in 2018, which happened soon after her husband died. High Court judge Geoffrey Venning said Lee's mental health played a part in the case, but that her actions were calculated.The children's remains were discovered only in 2022 by a couple who won an auction for the contents of an abandoned storage unit in Auckland.During a trial lasting more than two weeks, Hakyung Lee's defence lawyers told the court that her mental health deteriorated after Jo's death, and that she came to believe it was best if the rest of the family died together. Lee tried to kill herself and her children by giving them a dose of the antidepressant nortriptyline mixed in juice, but got the dose wrong and woke up to find her children were dead, her lawyers said.Prosecutors argued that Lee's was \"a selfish act to free herself from the burden of parenting alone\".After the killings, Lee changed her name and left New Zealand. She was arrested in South Korea - where she was born - in September 2022, and extradited back to New Zealand later that year.The court heard on Wednesday how the killings pained Lee's and her husband Ian Jo's families.In an emotional statement read out by prosecutors, Lee's mother Choon Ja Lee  said she regrets not taking her daughter to a counsellor, noting that Lee had \"no will to live\" after Jo died of cancer in November 2017.\"If she wanted to die, why didn't she die alone? Why did she take the innocent children with her?\" Choon Ja Lee wrote, according to New Zealand media reports.Jo's brother Jimmy said he \"never imagined such a profound tragedy would ever befall our family\".His own mother - Yuna's and Minu's other grandmother - still does not know they are dead, he said.\"It was my late brother's will that I protect them,\" said Jimmy Jo. \"This is an ongoing sentence from which I can never be paroled.\"Lee was likely suffering from an \"atypical depression\" and prolonged grief reaction at the time of the murders, according to a psychiatric assessment conducted before the sentencing, local broadcaster RNZ reported.Justice Venning ordered that Lee be treated as a \"special patient\" during her imprisonment, given her mental state.\"You could not cope when [your husband] became seriously unwell, and perhaps you could not bear to have the children around you as a constant reminder of your former happy life, which had been cruelly taken from you,\" the judge said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "New Zealand 'suitcase murders': Woman gets life in prison for killing her two children",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/05ea/live/feab4ec0-ca66-11f0-9a9f-5d4254b8128b.png"
      ],
      "datePublished": "2025-11-26T01:25:44.000Z",
      "dateModified": "2025-11-26T01:25:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chicago man accused of setting train passenger on fire had 72 prior arrests",
    "url": "https://www.bbc.com/news/articles/cr4drle9k12o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d991/live/700b27c0-cac6-11f0-b7d6-15745cdbcf61.jpg",
    "tag": "World",
    "date": "2025-11-26T13:54:36.000Z",
    "description": "A Chicago man who allegedly doused a woman in gasoline and lit her on fire on 17 November was a \"career criminal\", the White House has said. Lawrence ",
    "body": "A Chicago man who allegedly doused a woman in gasoline and lit her on fire on 17 November was a \"career criminal\", the White House has said. Lawrence Reed who was arrested for the crime had 72 prior arrests that include eight felony convictions and seven misdemeanours, according to the White House. The victim, 26-year-old Bethany MaGee, survived the attack but is \"now fighting for her life with horrific burns\", the White house said in a statement.In court on Monday, Mr Reed yelled three times in succession \"I'm guilty\", after the judge warned he could receive a life sentence for charges that include committing a terrorist attack, according to reports from inside the courtroom. The White House has sought to blame the incident on Democrats' policies on crime, casting them as \"soft\". Both the state of Illinois and the city of Chicago are led by Democrats, and President Donald Trump is currently seeking to withhold federal funds from Illinois over its elimination of \"cash bail\", where an arrested person posts a sum of money to be released from jail before trial.The suspect \"was walking free because of the radical, dangerous 'no cash bail' law proudly signed by Governor JB Pritzker and celebrated by Chicago's defund-the-police Mayor Brandon Johnson\", the White House said in a statement it released on Tuesday. Mayor Johnson said in a statement that the attack \"was a tragic incident, and the Mayor's prayers are with the victim and her family.\"Mr Reed, 50, has a history of mental illness and has been arrested 72 times since he turned 18, according to a Chicago affiliate of the BBC's partner CBS News.In August, he was charged with aggravated battery for allegedly hitting a social worker and after his arrest was released with electronic monitoring against prosecutors' objections. The attack against Ms MaGee happened while she was \"minding her own business and reading her phone\", prosecutors said. According to the criminal complaint, she was approached by Mr Reed arriving from the back of the train car who then doused her with gasoline before she ran.As he chased her, the complaint said, Mr Reed ignited the rest of the liquid in the bottle and set Ms MaGee on fire. Footage of the incident appeared to show Mr Reed watching Ms MaGee as she rolled on the floor engulfed in flames attempting to extinguish the fire. Last week,  Mayor Johnson said the attack \"should have never happened\", characterising it as \"an absolute failure of our criminal justice as well as our mental health institutions\". He said the suspect clearly faced mental health challenges and presented a danger to himself and the community.As a county commissioner, Johnson in 2020 introduced a nonbinding resolution to redirect funds from police and jails to other public services, but while running for mayor in 2023 he promised not to cut police spending.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chicago man accused of setting train passenger on fire had 72 prior arrests",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d991/live/700b27c0-cac6-11f0-b7d6-15745cdbcf61.jpg"
      ],
      "datePublished": "2025-11-26T13:54:36.000Z",
      "dateModified": "2025-11-26T13:54:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Parking inspector and wife arrested for €1m meter theft",
    "url": "https://www.bbc.com/news/articles/c997r8pyyz4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8c4a/live/130b7230-ca5a-11f0-96b0-df24c333db3c.jpg",
    "tag": "World",
    "date": "2025-11-26T02:01:07.000Z",
    "description": "A parking inspector and his wife have been arrested on suspicion of embezzling more than €1m (£878,000) from a small German town's parking meters.The ",
    "body": "A parking inspector and his wife have been arrested on suspicion of embezzling more than €1m (£878,000) from a small German town's parking meters.The unnamed municipal employee is thought to have taken coins out of parking meters in Kempten \"on numerous occasions\" and placed them in bank accounts that his wife had access to, local police said in a statement.A money laundering report by a credit institution alerted investigators to the suspected theft. The inspector faces charges relating to 720 alleged incidents of theft, while his wife faces charges of aiding and abetting theft, also in 720 cases.Kempten Mayor Thomas Kiechle said he was \"stunned and dismayed\" by the allegations. In October, the Kempten public prosecutor's office was informed that cash was repeatedly being deposited into several bank accounts, according to the German news agency DPA.Police then searched office premises in the early hours of 24 November, the same day that the 40-year-old man and 38-year old woman were arrested.They are now being held in separate detention facilities.It is not clear how long it might have taken the couple to accrue the sum.In response to the allegations, Kiechle announced the appointment of a commission to \"review past work processes, uncover potential weaknesses, and reliably remedy them for the future.\"Kiechle noted that the names of the couple could not currently be released due to the ongoing investigation and privacy concerns.In a written statement, Kiechle said: \"I naturally support the public prosecutor's office and the police in their thorough investigation of the allegations.\"\"Until the proceedings are concluded, the presumption of innocence applies,\" he added.Kempten is one of the oldest settlements in Germany. Located in the country's south, it sits under the hills of the Allgäu and has around 70,000 residents.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Parking inspector and wife arrested for €1m meter theft",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8c4a/live/130b7230-ca5a-11f0-96b0-df24c333db3c.jpg"
      ],
      "datePublished": "2025-11-26T02:01:07.000Z",
      "dateModified": "2025-11-26T02:01:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": " Australia social media ban: Teens challenge law before High Court",
    "url": "https://www.bbc.com/news/articles/c9d9l7w1g8yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5c30/live/8bdd6030-ca9e-11f0-a892-01d657345866.jpg",
    "tag": "World",
    "date": "2025-11-26T06:37:56.000Z",
    "description": "Australia's landmark social media ban for children is being challenged in the nation's highest court, with two teenagers alleging the law is unconstit",
    "body": "Australia's landmark social media ban for children is being challenged in the nation's highest court, with two teenagers alleging the law is unconstitutional as it robs them of their right to free communication.From 10 December, social media firms - including Meta, TikTok and YouTube - must ensure that Australians aged under 16 cannot hold accounts on their platforms.The law, which is being watched closely around the world, was justified by campaigners and the government as necessary to protect children from harmful content and algorithms. However, 15-year-olds Noah Jones and Macy Neyland - backed by a rights group - will argue the ban completely disregards the rights of children.\"We shouldn't be silenced. It's like Orwell's book 1984, and that scares me,\" Macy Neyland said in a statement.After news of the case broke, Communications Minister Anika Wells told parliament the government would not be swayed.\"We will not be intimidated by threats. We will not be intimidated by legal challenges. We will not be intimidated by big tech. On behalf of Australian parents, we will stand firm,\" she said.The Digital Freedom Project (DFP) announced the case had been filed in the High Court on Wednesday. Teenagers rely on social media for information and association, and a ban could hurt the nation's most vulnerable kids - young people with disability, First Nations youth, rural and remote kids and LGBTIQ+ teenagers - the most, the group said on their website.Led by a New South Wales parliamentarian, John Ruddick, DFP said their challenge would hinge on the ban's impact on political communication, and whether it was proportional to the law's aims.Other measures to improve online safety should be used instead, the group argued, pointing to digital literacy programmes, the forced introduction of age-appropriate features for platforms, and age assurance technologies which have greater privacy protections.Noah Jones argued the government's policy was \"lazy\". \"We are the true digital natives and we want to remain educated, robust, and savvy in our digital world... They should protect kids with safeguards, not silence.\"Australian media have previously reported that Google, which owns YouTube, has also been considering launching a constitutional challenge.Though opposed by the tech companies who will be charged with enforcing it, the ban is supported by most Australian adults, according to polls. However, some mental health advocates say it may cut kids off from connection, and others say it could push youngsters to even-less-regulated corners of the internet.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": " Australia social media ban: Teens challenge law before High Court",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5c30/live/8bdd6030-ca9e-11f0-a892-01d657345866.jpg"
      ],
      "datePublished": "2025-11-26T06:37:56.000Z",
      "dateModified": "2025-11-26T06:37:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "No real intent in Moscow to engage in peace talks, says von der Leyen",
    "url": "https://www.bbc.com/news/articles/c208wjpv4r9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c1b8/live/96bbc450-cab3-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-26T11:33:24.000Z",
    "description": "European Commission chief Ursula von der Leyen has described the situation surrounding the war in Ukraine as \"volatile\" and \"dangerous\" and accused Ru",
    "body": "European Commission chief Ursula von der Leyen has described the situation surrounding the war in Ukraine as \"volatile\" and \"dangerous\" and accused Russia of having no \"real intent\" of engaging in peace talks.Her comments came shortly before Kremlin spokesman Dmitry Peskov said it was \"premature\" to speak about striking a peace deal.Von der Leyen said Ukraine would need strong security guarantees capable of deterring any further attacks, arguing that Russia still upheld a post-World War Two mindset and saw the European continent as a \"sphere of influence\".She was addressing the European Parliament in Strasbourg as the US ramped up efforts to mediate a deal between Kyiv and Moscow.Talks this week in Geneva and then Abu Dhabi have resulted in Ukraine agreeing to the \"essence\" of a peace deal, after changes were made to an initial 28-point plan widely criticised as heavily slanted towards Russia.Zelensky said the new draft represented \"the right approach\" - but serious points of contention with Russia remain and the Kremlin has consistently played down suggestions of a compromise.In her speech to European Union lawmakers, von der Leyen said: \"I want to be clear from the very outset: Europe will stand with Ukraine and support Ukraine every step of the way.\"She also referenced the issue of €210bn (£185bn) worth of Russian frozen assets held in European financial institutions.Belgium is currently opposing the idea of diverting these assets to Ukraine, as it fears contravening international law and being made to foot the bill should Moscow mount a legal challenge.Other countries too are concerned the repayment of the frozen assets could eventually fall to European taxpayers – although von der Leyen sought to allay those fears, saying she could not picture such a scenario. An \"options paper\" and a legal text had been prepared by the Commission, she added. A decision on the frozen assets is expected to be agreed by EU leaders in late December.The last days of intense diplomacy have largely excluded the Europeans, who last week were blindsided by the US-Russia 28-point peace plan, which included proposals to hand territory to Russia still under Ukrainian control and limit the size of Ukraine's military.European leaders have since insisted they will need a seat at the table too, before any final agreement over how to end the war can be reached. On Tuesday a meeting of the so-called \"coalition of the willing\" chaired by France and the UK was convened to discuss security guarantees.\"Whatever the design of a future peace treaty, it is clear that much of the implementation will come down to the European Union and its Nato partners,\" von der Leyen told Parliament. \"Nothing about Ukraine without Ukraine. Nothing about Europe without Europe. Nothing about Nato without Nato,\" she said.German Chancellor Friedrich Merz also insisted Europe was \"not a pawn, but a sovereign actor, with its own interests and values.\"However, as it stands Europeans are not set to be included in the next round of talks and Russia has batted off involvement by European leaders. \"The Europeans meddling in all these affairs is, as I see it, completely unnecessary,\" Kremlin aide Yuri Ushakov said.Instead, US presidential envoy Steve Witkoff is set to travel to Moscow next week, while the US Secretary of the Army Dan Driscoll will go to Ukraine. The US has been engaging in \"shuttle diplomacy\" between Russia and Ukraine since the start of Trump's second term in office at the start of the year - but so far such efforts have failed to yield meaningful results. Zelensky said on Tuesday he wanted direct talks with Trump before the end of the month to discuss the main divergences between the Ukrainian and the Russian positions, such as sovereignty over Ukraine's eastern regions, membership of Nato and the size of its army.  Meanwhile, Trump posted a message on social media saying he would be ready to meet both Zelensky and Putin soon, but \"ONLY when the deal to end this war is FINAL or, in its final stages\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "No real intent in Moscow to engage in peace talks, says von der Leyen",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c1b8/live/96bbc450-cab3-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-26T11:33:24.000Z",
      "dateModified": "2025-11-26T11:33:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israel says Hamas and PIJ returned body of Gaza hostage Dror Or",
    "url": "https://www.bbc.com/news/articles/c17x0xjqj21o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4b5b/live/919739b0-a85c-11f0-92db-77261a15b9d2.jpg",
    "tag": "World",
    "date": "2025-11-26T08:04:46.000Z",
    "description": "Israel has confirmed that Hamas and Palestinian Islamic Jihad (PIJ) handed over the body of deceased Israeli hostage Dror Or on Tuesday.Israeli Prime ",
    "body": "Israel has confirmed that Hamas and Palestinian Islamic Jihad (PIJ) handed over the body of deceased Israeli hostage Dror Or on Tuesday.Israeli Prime Minister Benjamin Netanyahu's office said his government \"shares in the deep sorrow of the Or family\" following the completion of forensic testing overnight.It stressed that Israeli authorities were working \"tirelessly\" to bring home the last two dead hostages still in Gaza and demanded that Hamas uphold its commitments to hand over their remains under the six-week-old Gaza ceasefire agreement.Or's body was transferred via the Red Cross after PIJ and Hamas announced that it had been recovered in central Gaza on Monday.On Wednesday morning, the Israel Defense Forces (IDF) said its representatives had informed Or's family that his body was returned after experts at the National Centre of Forensic Medicine in Tel Aviv confirmed its identity.According to the IDF, the 48-year-old father of three was killed by PIJ at his home in Kibbutz Be'eri during the Hamas-led attack on southern Israel on 7 October 2023. His body was then abducted and taken to Gaza as a hostage.Mr Or's wife, Yonat, was also killed during the attack, while two of their children, Noam and Alma, were kidnapped alive. They were held hostage in Gaza until November 2023, when they were released as part of a week-long ceasefire deal.\"The IDF expresses deep condolences to the families, continues to make every effort to return all the deceased hostages, and is prepared for the continued implementation of the agreement,\" an IDF statement said.\"Hamas is required to fulfil its part of the agreement and make the necessary efforts to return all the hostages to their families and to a dignified burial.\"Under the first phase of the US-brokered ceasefire deal, which took effect on 10 October, Hamas agreed to return the 20 living Israeli hostages and the bodies of the 28 dead Israeli and foreign hostages still in Gaza within 72 hours.All the living hostages were released on 13 October in exchange for 250 Palestinian prisoners and 1,718 detainees from Gaza.So far, the remains of 23 dead Israeli hostages have been handed over, along with those of three foreign hostages – one of them Thai, one Nepalese and one Tanzanian.In exchange, Israel has handed over the bodies of 330 Palestinians killed during the war. It should hand over another 15 bodies in return for Mr Or's remains.One of the remaining dead hostages is Israeli - Ran Gvili, 24 - and the other is Thai - Suthisak Rintalak, 43.Israel has accused Hamas of deliberately delaying the recovery of the hostages' bodies, while Hamas has insisted it is struggling to find them under rubble.The slow progress has meant there has been no advance on the second phase of President Donald Trump's Gaza peace plan. This includes plans for the governance of Gaza, the withdrawal of Israeli troops, the disarmament of Hamas and reconstruction.The two dead hostages still in Gaza were among the 251 people abducted by Hamas and its allies on 7 October 2023, when about 1,200 other people were killed.Israel responded to the attack by launching a military campaign in Gaza, during which more than 69,770 people have been killed, according to the territory's Hamas-run health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israel says Hamas and PIJ returned body of Gaza hostage Dror Or",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4b5b/live/919739b0-a85c-11f0-92db-77261a15b9d2.jpg"
      ],
      "datePublished": "2025-11-26T08:04:46.000Z",
      "dateModified": "2025-11-26T08:04:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South East Asia floods: Scores killed and thousands evacuated from record rainfall",
    "url": "https://www.bbc.com/news/articles/ckg97wx144jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9254/live/7976c7d0-ca74-11f0-8dce-cdba4388e3a7.jpg",
    "tag": "World",
    "date": "2025-11-26T09:29:52.000Z",
    "description": "'Once in 300 years' rain hits Thai city as floods ravage South East Asia16 hours agoKelly NgWatch: People cling to floating debris during catastrophic",
    "body": "'Once in 300 years' rain hits Thai city as floods ravage South East Asia16 hours agoKelly NgWatch: People cling to floating debris during catastrophic floods in ThailandParts of Thailand are battling record floods, which have killed at least 33 people and prompted authorities to deploy military ships and helicopters to support relief efforts.The deluge has hit 10 provinces across the country's south over the past week, with the city of Hat Yai, a business hub bordering Malaysia, recording its heaviest rainfall in 300 years - 335mm in a single day.Photos show vehicles and houses submerged in the city, while desperate residents await rescue on their rooftops.Relentless rains have also ravaged neighbouring countries. In Vietnam, the death toll has risen to 98 in a week, while in Malaysia, more than 19,000 people have been forced from their homes.In Indonesia, at least 19 people have been killed and at least seven others remained buried under landslides in North Sumatra, according to the Indonesian National Search and Rescue Agency.More than 2 million people in Thailand have been affected by the floods, but just 13,000 have been moved to shelters. The vast majority are cut off and unable to get help, according to Reuters news agency.The Thai military, which has been put in charge of tackling the crisis, said it is preparing to dispatch an aircraft carrier and a flotilla of 14 boats loaded with relief supplies, along with field kitchens that are said to be able to deliver 3,000 meals a day.Medical teams on board the aircraft carrier will convert it into a \"floating hospital\" if required, the navy said.ReutersA drone view shows dozens of vehicles at least partially submerged in a carpark Hat YaiBoats, high-clearance trucks, and jet skis have also been deployed to evacuate residents, said the governor of Songkhla province, where Hat Yai is located.The cabinet on Tuesday declared Songkhla a disaster zone, freeing up funds for relief.However, many people remain stranded amid the rising waters. A volunteer rescue group, the Matchima Rescue Center, told Reuters it had been inundated with thousands of calls in the last three days, with people asking to be evacuated.People have also posted urgent calls for help on Matchima's Facebook page. \"Many people are trapped... Please help,\" one user wrote. \"It's very difficult right now. The water has reached the second floor, where there are children, the elderly, the sick, and the disabled!!!\" Another wrote that his household had been waiting for help for three days: \"Every second is crucial now... Please help share. My [phone's] battery is at 40%. Thank you everyone.\"Some also wrote about not having had any food and water for days.A clip that has gone viral on social media shows three young boys hanging from power lines, trying to inch their way to safety while brown murky waters continue to rise below them.In Malaysia, more than 19,000 people have been evacuated to safety, with 126 evacuation centres set up in the northern border areas.In the states of Kelantan and Perlis, rescue teams waded through knee-deep floodwaters to evacuate residents in areas where rising waters had cut off access to roads.Heavy seasonal rain is common around this time of year in South East Asia, but this year has seen exceptionally high levels of flooding in the region.ReutersThe Thai military said it is preparing to dispatch an aircraft carrier and a flotilla of 14 boats loaded with relief supplies",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South East Asia floods: Scores killed and thousands evacuated from record rainfall",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9254/live/7976c7d0-ca74-11f0-8dce-cdba4388e3a7.jpg"
      ],
      "datePublished": "2025-11-26T09:29:52.000Z",
      "dateModified": "2025-11-26T09:29:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brazil: Bolsonaro ordered to start serving 27-year prison sentence for coup plot",
    "url": "https://www.bbc.com/news/articles/cr4dl19npv5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0fc1/live/e5525120-ca35-11f0-8799-efcbfb167d39.png",
    "tag": "World",
    "date": "2025-11-26T10:54:39.000Z",
    "description": "Watch: Police share footage of prison cell for Brazil's former President BolsonaroBrazil's Supreme Court has ordered that right-wing former president ",
    "body": "Watch: Police share footage of prison cell for Brazil's former President BolsonaroBrazil's Supreme Court has ordered that right-wing former president Jair Bolsonaro begin serving his prison sentence of 27 years and three months for plotting a coup after he lost the last election.Justice Alexandre de Moraes on Tuesday ruled that the case had reached its final judgement and that no further appeals were possible. Bolsonaro, 70, was found guilty of leading a conspiracy aimed at keeping him in power after he lost the 2022 election to his left-wing rival, Luiz Inácio Lula da Silva.He will begin serving his sentence in a federal police jail cell in the capital, Brasilia, where he has been detained since Saturday after being deemed a flight risk and removed from home detention. At a hearing on Sunday, Bolsonaro admitted trying to open his ankle monitor with a soldering iron until he \"came to his senses\", court documents show. He said he had had no intention of fleeing and blamed medicine-induced \"paranoia\" for damage he caused to the monitor. Justice Moraes on Tuesday mandated that full-time medical care be given to Bolsonaro, whose medical team has previously said he is suffering from worsening health.Supreme Court justices said in September, when Bolsonaro was found guilty of plotting a coup, that he had known of plans to assassinate Lula and his vice-presidential running mate, Geraldo Alckmin, and to arrest and execute Moraes, who has been overseeing Bolsonaro's trial.The conspiracy failed to get the backing of the army and air force commanders. Lula was sworn in without incident on 1 January 2023.But a week later, on 8 January, thousands of Bolsonaro supporters stormed government buildings in Brasília. The security forces intervened and about 1,500 people were arrested.The justices found that the rioters had been incited by Bolsonaro, whose plan, they said, was for the military to step in and return him to power.Bolsonaro was also barred from running for public office until 2060 - eight years after the end of his sentence.The former president called the trial a \"witch hunt\" designed to prevent him running in the 2026 presidential election.Justice Moraes also ordered on Tuesday that others found guilty of being Bolsonaro's co-conspirators must begin their sentences.They include Gen Augusto Heleno, former minister for institutional security, and Gen Paulo Sérgio Nogueira de Oliveira, former defence minister.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brazil: Bolsonaro ordered to start serving 27-year prison sentence for coup plot",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0fc1/live/e5525120-ca35-11f0-8799-efcbfb167d39.png"
      ],
      "datePublished": "2025-11-26T10:54:39.000Z",
      "dateModified": "2025-11-26T10:54:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump defends Witkoff after leak appears to show envoy coaching Russias",
    "url": "https://www.bbc.com/news/articles/c3r7xr94ln8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a3a2/live/5d76f740-cabe-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-26T10:25:06.000Z",
    "description": "US President Donald Trump has defended special envoy Steve Witkoff as doing the \"standard thing\" after a leaked recording appeared to show him advisin",
    "body": "US President Donald Trump has defended special envoy Steve Witkoff as doing the \"standard thing\" after a leaked recording appeared to show him advising a Russian official on how to appeal to the president.Trump told reporters on Wednesday he had not heard the audio, but that Witkoff was doing \"what a dealmaker does\" to \"sell\" the peace plan to both Russia and Ukraine.The leaked call from last month emerged days after a 28-point draft peace plan presented by the US largely reflected Russian positions on its full-scale war in Ukraine.Witkoff has visited Moscow several times this year and will meet Russian President Vladimir Putin again next week.He has never gone to Kyiv in his role as special envoy, although other US officials have visited and US army secretary Dan Driscoll went to Kyiv this week and Trump says he will hold further talks with the Ukrainians.Diplomatic talks have continued after the initial draft plan was criticised by Ukrainian and European leaders as being too favourable to Russia. Among the proposals was a handover to Russia of Ukrainian-controlled territory in eastern Ukraine.The plan has since been revised to better reflect Ukraine's interests and the views of European allies. Ukrainian President Volodymyr Zelensky has said he is ready to meet Trump to discuss outstanding \"sensitive points\".In the leaked audio recording obtained and shared as a transcript by Bloomberg, Witkoff appeared to advise Yuri Ushakov, Putin's foreign policy adviser, on how to get on Trump's good side.BBC News has not independently verified the reported 14 October call, but Trump said it represented a \"very standard form of negotiations\". During the leaked conversation, the two men reportedly talked about ending the war, with Ushakov asking if it would be useful to get their bosses - Putin and Trump - to speak.Witkoff is quoted as saying that \"my guy is ready to do it\", before suggesting how to go about the call.\"Just reiterate that you congratulate the president [Trump] on this achievement... that you respect that he is a man of peace and you're just, you're really glad to have seen it happen,\" Witkoff is quoted as saying. \"I think from that it's going to be a really good call.\"\"I told the president that you - that the Russian Federation has always wanted a peace deal. That's my belief,\" Witkoff adds according to the transcript. \"The issue is is that we have two nations that are having a hard time coming to a compromise.\"\"I'm even thinking that maybe we set out like a 20-point peace proposal, just like we did in Gaza,\" Witkoff adds.The call ends with Witkoff telling Ushakov of an imminent Zelensky visit to the White House and that \"if possible\", Trump and Putin should talk before that meeting.What followed was a two-and-a-half hour phone call between the US and Russian presidents, news of which emerged as Zelensky was on his way to Washington last month.Before the Trump-Putin call, the US president had appeared to be running out of patience with his Russian counterpart and had suggested he might provide Ukraine with long-range Tomahawk missiles.By the time Zelensky entered the White House, the atmosphere appeared to have changed. Trump said giving Kyiv Tomahawks could escalate the conflict and he believed Putin \"wants to end the war\".Asked about the call being leaked, Yuri Ushakov told Russian state media that it was done to \"hinder, probably\" and that it was \"unlikely\" to be done to improve relations.He also confirmed that Witkoff would be visiting Moscow next week as per a \"preliminary agreement\".It was not clear who was behind the leak, but Bloomberg has also transcribed another reported call between Ushakov and Putin envoy Kirill Dmitriev, who spent days with Witkoff in Miami in late October weeks before the 28-point draft plan emerged.According to the transcript, Dmitriev tells his Russian colleague: \"We'll just make this paper from our position, and I'll informally pass it along, making it clear that it's all informal. And let them do like their own.\"Apparently angered by the report, Dmitriev complained of a \"well-funded, well-organised malicious media machine built to spread fake narratives, smear opponents and keep people confused\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump defends Witkoff after leak appears to show envoy coaching Russias",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a3a2/live/5d76f740-cabe-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-26T10:25:06.000Z",
      "dateModified": "2025-11-26T10:25:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Georgia judge drops 2020 election interference case against Trump",
    "url": "https://www.bbc.com/news/articles/czxpd8pv4gyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a257/live/ce7469f0-cae6-11f0-8c06-f5d460985095.jpg",
    "tag": "World",
    "date": "2025-11-26T20:35:59.000Z",
    "description": "4 hours agoKwasi Gyamfi AsieduandKayla EpsteinA Georgia judge has dismissed the sprawling 2020 election interference case against Donald Trump, ending",
    "body": "4 hours agoKwasi Gyamfi AsieduandKayla EpsteinA Georgia judge has dismissed the sprawling 2020 election interference case against Donald Trump, ending the final effort to prosecute the president for allegedly attempting to overturn his loss to Joe Biden.Peter Skandalakis, who took over the case after the initial prosecutor's removal, asked Judge Scott McAfee to dismiss the charges on Wednesday.Trump's lawyer Steve Sadow praised the decision to end the \"political persecution\" against the president.The dismissal concludes the last of Trump's four criminal cases, only one of which saw trial and resulted in a conviction.A Georgia appeals court removed Fulton County District Attorney Fani Willis from the case after it determined a romantic relationship with a special prosecutor created an \"appearance of impropriety\".Skandalakis, executive director of the nonpartisan agency Prosecuting Attorneys' Council of Georgia, appointed himself to the case after Willis' disqualification and when other state prosecutors declined to take the case.In Wednesday's motion to a Fulton County judge, he said he was discontinuing the case \"to serve the interests of justice and promote judicial finality\".\"As a former elected official who ran as both a Democrat and a Republican and now is the Executive Director of a non-partisan agency, this decision is not guided by a desire to advance an agenda but is based on my beliefs and understanding of the law,\" Skandalakis added.Around five million votes for president were cast in Georgia in 2020, with Biden winning the critical swing state by just under 12,000 votes.Trump and some of his allies refused to accept the result, and the state quickly became a focal point for efforts to overturn the election.In January 2021, The Washington Post published a recording of Trump speaking with Georgia's Republican Secretary of State Brad Raffensperger.\"I just want to find 11,780 votes, which is one more than we have. Because we won the state,\" Trump said in the recording.Willis began investigating Trump's activities soon after the report, convening a special grand jury to weigh the facts.Willis filed an indictment in August 2023 alleging that Trump conspired with 18 other defendants to interfere in the election result. The charges included racketeering and other state offences.The group \"refused to accept that Trump lost, and they knowingly and wilfully joined a conspiracy to unlawfully change the outcome of the election in favor of Trump\".Four co-defendants took plea deals with prosecutors that resulted mostly in fines, suspended sentences and community service, including attorneys Sidney Powell, Kenneth Cheseboro, and Jenna Ellis. Wednesday's dismissal also applies to the remaining co-defendants, including former New York mayor and Trump's former attorney Rudy Giuliani and Mark Meadows, chief of staff during Trump's first presidency.Mr Sadow, president Trump's lead attorney in the case, praised the decision to drop the charges.\"The political persecution of President Trump by disqualified DA Fani Willis is finally over,\" he said. \"This case should never have been brought. A fair and impartial prosecutor has put an end to this lawfare.\"The Georgia election interference case was once considered the most threatening of Trump's four criminal indictments, because he could not pardon himself from state-level charges if he returned to office. Prosecutors brought Trump to the Fulton County Jail, where they took his mugshot.Legal experts who closely followed the case were not surprised by its dismissal. A judge tossed out several of the charges in 2024, and Willis was disqualified a few months later.Willis' removal raised doubts about whether a replacement would take up such a complicated prosecution. Trump's 2024 election essentially put his case on hold until his term ends in 2029. \"It was incredibly unlikely it was going to go forward anyway, because the amount of financial resources and man hours necessary to take on this case didn't seem to be within the scope of what Peter Skandalakis had,\" said Anthony Michael Kreis, a professor at the Georgia State College of Law.However, Mr Kries was surprised by some of Skandalakis' reasoning for dropping the case.\"I think the report itself to me is a little more surprising because it seems to give the president and some of his allies a lot of benefit of the doubt, given what the evidence brought forth looked like,\" he said.Trump has also faced a series of other criminal proceedings. These include a 2024 conviction in a New York hush-money case, which he is appealing against. Two additional federal cases - one alleging he conspired to overturn the 2020 election and another accusing him of unlawfully retaining classified documents - were dropped following his return to the White House.He also faces several high-profile civil lawsuits which are progressing through the appeals courts.Earlier this month, Trump asked the US Supreme Court to review the $5m (£3.6m) civil case brought by writer E Jean Carroll, after a federal appeals court upheld the award and declined to rehear the matter. A jury found Trump liable for sexually abusing and defaming Ms Carroll, allegations he denied.In August, a New York appeals court threw out a $500m civil fraud penalty against Trump that resulted from a separate, civil fraud lawsuit brought by New York Attorney General Letitia James. The appeals panel upheld the lower court's finding that Trump and his businesses committed fraud, but found the enormous fine was excessive.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Georgia judge drops 2020 election interference case against Trump",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a257/live/ce7469f0-cae6-11f0-8c06-f5d460985095.jpg"
      ],
      "datePublished": "2025-11-26T20:35:59.000Z",
      "dateModified": "2025-11-26T20:35:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hong Kong residents react as deadly fire tears through housing estate",
    "url": "https://www.bbc.com/news/articles/cvgjnlx1g6yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/57a5/live/b7641ed0-caec-11f0-8c06-f5d460985095.png",
    "tag": "World",
    "date": "2025-11-26T22:12:59.000Z",
    "description": "'I am devastated': Hong Kong residents in disbelief after fire destroys blocks of flats3 hours agoPhoebe Kong & Koey Lee,BBC Chinese , Hong Kong,Danny",
    "body": "'I am devastated': Hong Kong residents in disbelief after fire destroys blocks of flats3 hours agoPhoebe Kong & Koey Lee,BBC Chinese , Hong Kong,Danny Vincent,Hong KongandKathryn Armstrong,LondonWatch: Deadly fire engulfs Hong Kong apartment blocks\"When you get closer the heat rises and you can feel it and the smoke is really heavy.\"Student Thomas Liu was one of many people drawn to the scene of a deadly fire that tore through much of the eight-block Wang Fuk Court housing complex in Hong Kong's Tai Po district.At least 44 people have died in Wednesday's devastating blaze so far, and with hundreds still missing it's expected this number will rise. The cause is not yet known. \"It's a disaster,\" Thomas said of the fire, telling the BBC he had seen a body being taken away. \"Many people sent us WhatsApp messages or called us, saying they still have relatives inside or can't find them,\" Mui Siu-fung, a councillor for the Tai Po district, told BBC Chinese. More than a thousand other people were forced to evacuate the estate as the flames spread, with some heading to centres that have been set up to house them. Police also moved people from nearby buildings. The fire is gradually being contained but officials say they do not know when it will be fully extinguished. Flames could be seen coming from individual apartments as many people watched on in silence.One woman said her friends live inside the building and she was waiting to hear if they managed to get out.ReutersHarry Cheung has lived in block two of the Wang Fuk Court complex for decadesHarry Cheung, who has lived in block two of the Wang Fuk Court complex for more than 40 years, told Reuters he heard \"a very loud noise\" and saw fire erupt in a nearby block.\"I immediately went back to pack up my things,\" the 66-year-old resident said.\"I don't even know how I feel right now. I'm just thinking about where I'm going to sleep tonight because I probably won't be able to go back home.\"A woman in her sixties, whose surname is Kam and who lives in the adjacent Kwong Fuk Estate, told the South China Morning Post (SCMP) that several of her friends living in Wang Fuk Court have been accounted for - but not all.One friend has daily afternoon naps and may have been sleeping when the fire broke out at 14:51 local time (06:51 GMT), Ms Kam said, adding that the woman's daughters have not yet been able to contact her. Another resident, 65-year-old Jason Kong, told Reuters that a neighbour called him and said he was still trapped inside one of the tower blocks. \"I am devastated. There are so many neighbours and friends. I do not know what is going on anymore. Look, all the apartments are just burning. I do not know what to do. I hope the government can help us to settle down after this.\"An elderly woman who lives in one of the affected blocks told the BBC she was not at home when the fire broke out but that she is worried about her apartment because it is not insured. \"I'm very upset that I have no home to go to now,\" she said. While the cause of the fire that engulfed the multiple high-rise blocks is unknown, the flames are believed to have spread quickly through the bamboo scaffolding that covered the buildings, which were undergoing renovations.Some people have expressed anger that such a massive fire could have happened and criticised the response.\"When there's a wildfire, they will deploy helicopters and drop water bombs, but why is there no such deployment and how can they leave other buildings burning?\" Ms Poon, another resident of Wang Fuk Court, who is in her sixties, asked.\"The community is so close to the fire station and we thought the fire could be put out soon, but now the fire has spread. I'm so disappointed,\" she told the SCMP. Ms Poon noted that she had been given no instructions from the government on where to seek help.The BBC spoke to some Tai Po residents who had brought supplies to the victims and affected residents - including dozens of blankets and heat packs.Hong Kong chief executive John Lee said government departments were assisting residents affected by the fire.When asked about their feelings about the fire, the residents said \"the government is incompetent\" and that they were \"immensely heartbroken\".  \"We don't want to see any more casualties,\" said one. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hong Kong residents react as deadly fire tears through housing estate",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/57a5/live/b7641ed0-caec-11f0-8c06-f5d460985095.png"
      ],
      "datePublished": "2025-11-26T22:12:59.000Z",
      "dateModified": "2025-11-26T22:12:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Guinea-Bissau coup: Soldiers seize power and detain President Umaro Sissoco Embaló",
    "url": "https://www.bbc.com/news/articles/c0edww3qgq2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/62f2/live/8831fae0-cadf-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "World",
    "date": "2025-11-26T20:00:57.000Z",
    "description": "5 hours agoNicolas Negoce,Paul Njie,BBC Africa reportersandWedaeli ChibelushiAFP via Getty ImagesThe soldiers gave an address on state TVA group of mi",
    "body": "5 hours agoNicolas Negoce,Paul Njie,BBC Africa reportersandWedaeli ChibelushiAFP via Getty ImagesThe soldiers gave an address on state TVA group of military officers say they have seized control of Guinea-Bissau amid reports that the president, Umaro Sissoco Embaló, has been arrested.Shortly after gunshots were heard in the capital, Bissau, government sources told the BBC that Embaló had been detained.The officers then appeared on state TV, saying they had suspended the electoral process, as the West African nation awaited the outcome of Sunday's presidential election. They said they were acting to thwart a plot by unnamed politicians who had \"the support of a well-known drug baron\" to destabilise the country, and announced the closure of its borders and imposed a night-time curfew.Sandwiched between Senegal and Guinea, the coup-prone country is  known as a notorious drug-trafficking hub where the military has been influential since independence from Portugal in 1974.The election results were expected on Thursday - both Embaló and his closest rival Fernando Dias had claimed victory.Dias was supported by former Prime Minister Domingos Pereira, who had been disqualified from running.Late on Wednesday afternoon, Embaló told France 24 in a phone call: \"I have been deposed.\"Government sources have since told the BBC that Dias, Pereira and Interior Minister Botché Candé have also been detained.The putschists have taken army chief Gen Biague Na Ntan and his deputy, Gen Mamadou Touré, into custody too, the sources say.Gunshots heard near presidential palace in the capital BissauWitnesses in Bissau heard gunfire earlier on, at around 13:00 GMT, but it was not immediately clear who was involved in the shooting or if there were any casualties.Hundreds of people on foot and in vehicles fled, seeking shelter as the shots rang out, the AFP news agency reported.Later on, General Denis N'Canha, head of the military household at the presidential palace, read out a statement declaring a takeover.He said officers had formed \"the High Military Command for the Restoration of Order\" and instructed the population to \"remain calm\".Checkpoints have been erected across Bissau and the streets were deserted ahead of the curfew, that was due to start at 19:00 GMT.Portugal has called for a return to constitutional order, with its foreign ministry urging \"all those involved to refrain from any act of institutional or civic violence\".The former Portuguese colony has witnessed at least nine coups or attempted coups over the last five decades.Corbis via Getty ImagesPresident Embaló was elected in December 2019Embaló has said he has survived multiple coup attempts during his time in office. However, his critics allege he has fabricated crises in order to crack down on dissent.The 53-year-old had wanted to make history as the country's only president to secure a second consecutive mandate in the last 30 years.He had initially said he would not seek a second term. Prior to the delayed polls, his legitimacy had been questioned, with the opposition saying his term should have officially ended in February 2025.Guinea-Bissau is one of the poorest countries in the world with a population of more than two million people.Its coastline has many uninhabited islands, making it ideal for drugs traffickers - with the UN dubbing it a \"narco-state\" as it has been a key transit point for cocaine coming from Latin America en route to Europe. Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Guinea-Bissau coup: Soldiers seize power and detain President Umaro Sissoco Embaló",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/62f2/live/8831fae0-cadf-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-26T20:00:57.000Z",
      "dateModified": "2025-11-26T20:00:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Holiday job seekers confront an 'incredibly stressful' market",
    "url": "https://www.bbc.com/news/articles/ce3kqw82j07o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/365b/live/eed38880-ca45-11f0-9fb5-5f3a3703a365.jpg",
    "tag": "World",
    "date": "2025-11-26T06:07:43.000Z",
    "description": "'This is the first year I can't find a holiday job'19 hours agoDanielle KayeBusiness reporterBloomberg via Getty ImagesNicholas Strahl has always been",
    "body": "'This is the first year I can't find a holiday job'19 hours agoDanielle KayeBusiness reporterBloomberg via Getty ImagesNicholas Strahl has always been able to find extra work around the holidays. But this year has been the exception.Mr Strahl, 41, works as a part-time retail sales associate at an office supplies store just outside Indianapolis, Indiana. While the pay is \"okay\", he said it \"never hurts to have a little bit more\".Finding seasonal holiday employment, for extra cash to pay his bills and buy holiday gifts for friends and family, has been a challenge. He started his search in early October and applied to CVS, Best Buy and a slew of other retailers - to no avail.\"I've never seen the job market like this - it's pretty crazy,\" he said. \"It doesn't really leave a lot of power for people who just want to get a job, or have a supplement in income.\"Seasonal hiring is poised to drop to its lowest level since the aftermath of the 2008 recession, according to the National Retail Federation. The pullback, a sign of caution among US businesses in the face of tariffs and consumer angst, comes as more people are looking for work in the cooling job market.Nicholas StrahlNicholas Strahl, who lives near Indianapolis, Indiana, said he has always been able to find extra work around the holidays - but this year has been the exceptionThe industry group expects retailers to hire between 265,000 and 365,000 seasonal workers, down from 442,000 last year.The outplacement firm Challenger, Gray & Christmas, which also predicted the weakest holiday season for retail hiring in more than 15 years, said tariffs, inflation and reliance on automation are dampening demand for seasonal hires.If Mr Strahl can't land a holiday job, he plans to cut down on holiday gifts and hold off on some car repairs. He will wait to replace his old laptop.\"At this point,\" he said, \"I'm willing to take anything I can get.\"Data from Indeed shows that while postings for seasonal work have largely held steady compared to last year, more people are seeking seasonal jobs.And in retail, traditionally one of the biggest hirers for the holidays, there are fewer opportunities.Getty ImagesThe labour market is \"frozen with frostbite\", said Allison Shrivastava, an economist with the Indeed Hiring Lab. The fact that seasonal job postings have held steady from last year is reflective of the labour market's paralysis, she said.\"You have a much bigger labour pool competing for a smaller number of jobs,\" she added.The government shutdown, which lasted more than one month before ending on 13 November, had delayed the release of official data on the labour market. But data for September, finally released last week, showed a surprising pick-up in hiring after a lacklustre summer.Employers added 119,000 jobs in September, more than double what many analysts had expected, but the unemployment rate ticked up from 4.3% to 4.4%.Data from Revelio Labs, a workforce intelligence firm, shows job openings in the retail sector in October were down 22% from last year. The drop signals less demand among retailers for holiday workers.\"We're just not seeing the usual pick-up in holiday hiring,\" said Lisa Simon, Revelio's chief economist.Holding patternSeveral leading retailers, including Target and Walmart, have refrained from saying how many additional workers they will bring onto their payrolls for the holidays.Walmart may hire on a store-by-store basis, but extra hours during the holidays will mostly be given to current employees, a company spokesperson said.The lack of specificity marks a divergence from previous years, when the firms have announced their seasonal hiring plans in advance.In contrast, Amazon says it will hire the same number of people in its fulfilment and transportation network as it has over the past two years. \"The cautious pace of announcements so far suggests that companies are not betting on a big seasonal surge,\" Andy Challenger, senior vice president of sales at Challenger, Gray & Christmas, said in a statement.It follows recent high-profile layoffs at big US companies, including in the retail sector.Some smaller retailers are also treading carefully as they head into the holidays, further limiting options for job hunters to find roles at local shops.Michael BreyMichael Brey, the president of Hobby Works, stands inside his toy store in Laurel, Maryland. This year, he delayed the store's usual timeline for hiring seasonal workersFor Hobby Works, a chain of two toy stores in Maryland, pressure from tariff costs and whiplash on economic policy this year has been compounded in recent weeks by the federal government shutdown.Located just outside Washington, the company, which employs 24 people, pushed back its usual timeline for hiring seasonal workers, president Michael Brey said.Concern about a pullback in spending among government workers, who found themselves without pay for more than a month before the shutdown ended, encouraged the store to cut costs by scaling back hiring, he said.\"Hanukkah always happens, Christmas always comes, so we try not to alter our hiring patterns too much,\" Mr Brey said.\"But this is the first year we're moving very slowly.\"Two years ago, Tanya Secord sailed her way through the application process to land a temporary job at Target, where she worked as a part-time cashier during the 2023 holiday season.This year, her job hunt has been marred by disappointment after disappointment.Ms Secord, 52, sent her resume to retailers including Costco and Target, hoping her experience working in retail would help. But each application was met with either radio silence or a rejection.\"It was incredibly stressful because the price of groceries has gone up, the cost of living in general is ridiculous,\" said Ms Secord, who finally landed a receptionist role in early November.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Holiday job seekers confront an 'incredibly stressful' market",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/365b/live/eed38880-ca45-11f0-9fb5-5f3a3703a365.jpg"
      ],
      "datePublished": "2025-11-26T06:07:43.000Z",
      "dateModified": "2025-11-26T06:07:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]