[
  {
    "title": "Teenage cricketer dies in Melbourne after being hit by ball  ",
    "url": "https://www.bbc.com/news/articles/c0rp0w5y0zko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/aa3d/live/28995570-b53f-11f0-9ad7-5dd473fc10b0.jpg",
    "tag": "World",
    "date": "2025-10-30T04:54:37.000Z",
    "description": "An Australian teenager has died after he was hit by a cricket ball during a practice session in Melbourne.Ben Austin, 17, was training - with a helmet",
    "body": "An Australian teenager has died after he was hit by a cricket ball during a practice session in Melbourne.Ben Austin, 17, was training - with a helmet but no neck guard - in cricket nets in Ferntree Gully on Tuesday when he was hit in the neck by a ball thrown using a handheld ball launcher. Emergency workers attended the scene around 17:00 local time (06:00 GMT) before Ben was rushed to hospital in critical condition. He was put on life support but died on Thursday.Ben's dad Jace Austin said the family was \"utterly devastated\" by the death of \"our beautiful Ben\" while Cricket Victoria said the cricketing community across the country would be mourning the teenager's death.In a statement, Jace Austin shared details of his family's loss. \"For Tracey and I, Ben was an adored son, deeply loved brother to Cooper and Zach and a shining light in the lives of our family and friends,\" he said. \"This tragedy has taken Ben from us, but we find some comfort that he was doing something he did for so many summers - going down to the nets with mates to play cricket.\"He loved cricket and it was one of the joys of his life.\"Mr Austin said the family was also supporting Ben's teammate who was bowling in the nets when the accident happened.\"This accident has impacted two young men and our thoughts are with he and his family as well,\" he said.He also thanked the local cricketing community for their support since the accident and praised the first responders and medical staff who helped his son. Cricket Victoria chief executive officer Nick Cummins said it was an \"extremely challenging time\" for all involved.\"The ball hit him in the neck in a similar accident that Phil Hughes suffered 10 years ago,\" Mr Cummins said, according to the Australian Broadcasting Corporation (ABC).In 2014, Australian cricketer Phillip Hughes died after being struck on the neck by a ball while batting in the Sheffield Shield.His death, for which a coroner ultimately found no-one was to blame, sparked improvements to safety equipment for those playing the sport.The ball that hit Ben was apparently launched by a thrower using a handheld device, commonly used to accelerate the speed of the ball and ease the strain of bowling on the shoulders.In a statement, Cummins said: \"The entire cricketing community in Victoria - and nationally - is mourning this loss and it will be something that will stay with us for a long time.\"He described Ben as a talented player, popular teammate and captain who was well- known in under-18 circles in Melbourne's south east.\"It is heartbreaking to see a young life cut so short, while Ben was doing something that he loved so much,\" Mr Cummins said. Ben played for the Ferntree Gully Cricket Club who, in a social media post, paid tribute to the youngster as someone who brought joy to many. The club also called on friends and supporters to \"put your bats out for Benny\", mirroring a similar gesture that was made for Hughes.The Waverley Park Hawks Junior Football Club, for which Ben played more than 100 games, said he was \"kind\", \"respectful\" and a \"fantastic footballer\".\"Our club and community have lost a truly great young person who was developing into a fine young adult and his loss will be felt keenly by our club for many years to come.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Teenage cricketer dies in Melbourne after being hit by ball  ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/aa3d/live/28995570-b53f-11f0-9ad7-5dd473fc10b0.jpg"
      ],
      "datePublished": "2025-10-30T04:54:37.000Z",
      "dateModified": "2025-10-30T04:54:37.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "NewJeans: K-pop group loses legal battle against agency",
    "url": "https://www.bbc.com/news/articles/cy5q0leq2lpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/84f3/live/0cc94b40-b538-11f0-8e27-6729950a59f0.jpg",
    "tag": "World",
    "date": "2025-10-30T06:37:13.000Z",
    "description": "K-pop group NewJeans has lost a legal battle to leave its record label Ador.A South Korean court on Tuesday ruled that the act's contract with the lab",
    "body": "K-pop group NewJeans has lost a legal battle to leave its record label Ador.A South Korean court on Tuesday ruled that the act's contract with the label, which runs until 2029, remains valid.The group's five members - Hanni, Hyein, Haerin, Danielle and Minji - announced last year that they were unilaterally leaving the agency, citing mistreatment and manipulation.The group has said it will appeal the ruling, according to local media reports.NewJeans said it is \"impossible to return to Ador\" and continue their activities as normal, the reports said.The Seoul Central Disctrict Court rejected NewJeans' argument that the dismissal of former Ador CEO Min Hee-jin, who was also the group's mentor, constituted a breach of contract. NewJeans alleged that her dismissal broke their trust with the agency.In a statement released after the ruling, Ador said it sincerely hopes that the judgment \"will serve as an opportunity for the artists to calmly reflect on this matter\". The label added that the it is ready for the members' upcoming activities, including the release of an album, and is now \"waiting\".The case stunned South Korea where record labels wield large amounts of power and tightly control their stars. It is highly unusual for artists to rebel against them. Formed in July 2022, NewJeans, whose members are aged from 17 to 21, had enjoyed rapid success before their dramatic fallout with the agency.Their first single Attention topped Korean charts right after their debut, while their hit song SuperShy made multiple \"best of the year\" lists at the end of 2023, including those compiled by Rolling Stone, NME and Billboard Magazine.Critics had called them a \"game-changer\" as their blend of 1990s R&B and sugar-coated pop melodies broke through a K-pop scene dominated by electronic beats. Tuesday's ruling follows a year-long standoff between the chart-topping group and its agency.The group's announcement to split from Ador, which was made in November last year during a press conference, came after a long and public spat between Min Hee-jin, and Ador, as well as its parent company, Hybe - South Korea's biggest music label, whose client list includes K-pop royalty such as BTS and Seventeen.Tensions between Min and Hybe started in April 2024, when Hybe launched audits into Ador, which was then managed by Min, while calling her to step down.Min rejected Hybe's allegations that she was plotting to go independent. In August, she was dismissed as the CEO of Ador.The band soon issued an ultimatum demanding that Min be reinstated. When Hybe refused, the members went public with a series of complaints against the label, including claims it had deliberately undermined their careers.One of the group's members, Hanni, also alleged that she suffered workplace harassment while working with the label.In December, Ador filed a lawsuit asking the court to confirm the validity of their contract with the group.As the disputes continued, the group's five members attemped to rebrand themselves as NJZ in February. They planned to release a new song, but the promotions were halted by a court order.The group still performed it at a show in Hong Kong, where they announced a hiatus.Back in March, after the court injunction was issued, the group described the court's decision as \"a shock\", but said the five of them would \"go through it\" together.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "NewJeans: K-pop group loses legal battle against agency",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/84f3/live/0cc94b40-b538-11f0-8e27-6729950a59f0.jpg"
      ],
      "datePublished": "2025-10-30T06:37:13.000Z",
      "dateModified": "2025-10-30T06:37:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israel receives coffins Hamas says contain two Gaza hostages' bodies",
    "url": "https://www.bbc.com/news/articles/c4gj90j2g8jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ddde/live/e21fbf70-b5a8-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-10-30T15:39:25.000Z",
    "description": "Israel has received via the Red Cross in Gaza two coffins which the Palestinian armed group Hamas says contain the bodies of deceased hostages, accord",
    "body": "Israel has received via the Red Cross in Gaza two coffins which the Palestinian armed group Hamas says contain the bodies of deceased hostages, according to the Israeli prime minister's office.Israeli forces will now transfer the bodies to the National Centre of Forensic Medicine in Tel Aviv for identification.Hamas's armed wing announced earlier that it had recovered the bodies of Israeli hostages Amiram Cooper and Sahar Baruch.On Tuesday, the Israeli government accused Hamas of violating the Gaza ceasefire deal after the group handed over a coffin containing human remains that did not belong to one of the 13 deceased Israeli and foreign hostages still in Gaza.It said forensic tests showed they belonged to Ofir Tzarfati, a hostage whose body had been recovered by Israeli forces in Gaza in late 2023.The Israeli military also released footage filmed by a drone that showed Hamas members removing a body bag containing the remains from a building in Gaza City, reburying it, and then staging the discovery in front of Red Cross staff.The Red Cross said its staff were unaware that the body bag had been moved before their arrival and that the staged recovery was \"unacceptable\".Hamas rejected what it called the \"baseless allegations\" and accused Israel of \"seeking to fabricate false pretexts in preparation for taking new aggressive steps\".Hours later, the Israeli government accused Hamas of another ceasefire violation, saying the group's fighters had killed an Israeli soldier in an attack in an area of southern Gaza.Hamas claimed it was not involved in the incident in the Rafah area, but Israel's prime minister ordered a wave of air strikes across Gaza on Tuesday night in response. The Israeli military said it attacked \"dozens of terror targets and terrorists\".Gaza's Hamas-run health ministry said 104 Palestinians were killed, including 46 children and 20 women, making it the deadliest day since the ceasefire took effect on 10 October.US President Donald Trump maintained \"nothing\" would jeopardise the ceasefire agreement, which his administration brokered along with Qatar, Egypt and Turkey, but he added that Israel should \"hit back\" when its soldiers were targeted.Under the deal, Hamas agreed to return the 20 living and 28 dead hostages it was holding within 72 hours.All the living Israeli hostages were released on 13 October in exchange for 250 Palestinian prisoners and 1,718 detainees from Gaza.Israel has also handed over the bodies of 195 Palestinians in exchange for the bodies of the 13 Israeli hostages so far returned by Hamas, along with those of two foreign hostages - one of them Thai and the other Nepalese.Eleven of the 13 dead hostages still in Gaza are Israelis, one is Tanzanian, and one is Thai.All but one of the dead hostages still in Gaza were among the 251 people abducted during the Hamas-led attack on southern Israel on 7 October 2023, during which about 1,200 other people were killed.Israel responded by launching a military campaign in Gaza, in which more than 68,600 people have been killed, including more than 200 since the ceasefire took effect, according to the territory's health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israel receives coffins Hamas says contain two Gaza hostages' bodies",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ddde/live/e21fbf70-b5a8-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-30T15:39:25.000Z",
      "dateModified": "2025-10-30T15:39:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israeli troops kill municipal worker during raid in south Lebanon",
    "url": "https://www.bbc.com/news/articles/cdrz6gkk5p3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d8f2/live/c54d3a30-b571-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "World",
    "date": "2025-10-30T11:09:21.000Z",
    "description": "5 hours agoHugo Bachega,Middle East correspondent  and Samantha Granville,BeirutReutersThe Israeli military said it was conducting an operation to \"di",
    "body": "5 hours agoHugo Bachega,Middle East correspondent  and Samantha Granville,BeirutReutersThe Israeli military said it was conducting an operation to \"dismantle Hezbollah infrastructure\" (file photo)Israeli troops carried out an incursion into a south Lebanese town overnight, killing a municipal employee, state media report, amid an escalation of Israeli attacks in Lebanon.The troops, accompanied by drones and light armoured vehicles, entered Blida and stormed the town hall, where the employee - named as Ibrahim Salameh - was sleeping, according to Lebanon's state-run National News Agency.The Israeli military said its troops were conducting an operation to \"dismantle Hezbollah infrastructure\", without providing evidence that the building was being used by the group.Israel's operation drew a furious response in Lebanon, where a ceasefire ended a war between them last November.Israel's military says troops encountered a \"suspect\" inside the building and opened fire when an \"immediate threat\" was identified, it added. It was not clear whether Salameh had been the target of the operation.Israel has stepped up its attacks on people and targets it says are linked to Hezbollah, a Shia Muslim group backed by Iran.The Lebanese President, Joseph Aoun, instructed the commander of the Lebanese army to confront any Israeli incursion into southern Lebanon.Prime Minister Nawaf Salam denounced the killing of Salameh and the incursion as a \"flagrant violation of Lebanese institutions and sovereignty\".He said Lebanon would continue pressing the United Nations and ceasefire guarantors \"to ensure a halt to the repeated violations and the implementation of a complete Israeli withdrawal from our lands\".Protests were held on Thursday morning in Blida and nearby towns, where residents blocked roads with burning tyres to denounce what they called a \"blatant aggression\" and the state's failure to protect civilians.AFPIsraeli aircraft carried out a strike on the outskirts of the southern Lebanese village of Jarmaq on ThursdayOver recent days, Israel intensified its strikes across Lebanon, saying it was targeting Hezbollah positions.A second Israeli operation was reported overnight in the nearby village of Adaisseh, where residents say troops blew up a religious ceremonial hall.Israeli warplanes also flew over parts of southern Lebanon and the Bekaa Valley on Thursday, while drones were again seen circling low above Beirut's southern suburbs.During a meeting of ceasefire monitors on Wednesday, US envoy Morgan Ortagus said Washington welcomed Lebanon's \"decision to bring all weapons under state control by the end of the year\", adding that the Lebanese army \"must now fully implement its plan\".Under the ceasefire agreement, Israeli troops were to withdraw from southern Lebanon, while Hezbollah was to move its fighters north of the Litani river and dismantle its military infrastructure there - a plan the group and its allies strongly oppose.Only the Lebanese army and the UN peacekeeping force, Unifil, are authorised to deploy armed personnel in the area south of the Litani, but Israel has maintained positions at several strategic border sites.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israeli troops kill municipal worker during raid in south Lebanon",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d8f2/live/c54d3a30-b571-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-30T11:09:21.000Z",
      "dateModified": "2025-10-30T11:09:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US troops on Nato's eastern flank to be reduced, Romania says",
    "url": "https://www.bbc.com/news/articles/c8670d9xq32o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5136/live/a1df0300-b4b6-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "World",
    "date": "2025-10-29T13:27:58.000Z",
    "description": "Romania's defence ministry has said the US intends to reduce some of its troops stationed on Nato's eastern flank.Between 900 and 1,000 American troop",
    "body": "Romania's defence ministry has said the US intends to reduce some of its troops stationed on Nato's eastern flank.Between 900 and 1,000 American troops will remain in Romania, Bucharest said - down from 1,700. The ministry said the decision was expected and that the \"resizing\" of US forces was a result of the new priorities of the Trump presidential administration.The Pentagon said the decision did not constitute a \"withdrawal from Europe or a signal of lessened commitment to Nato and Article 5\". Article 5 holds that Nato members will come to the defence of an ally which comes under attack, and has long been seen as the main deterrent against potential Russian aggression.Defence Minister Ionut Mosteanu stated that his US counterpart Pete Hegseth had recently conveyed to the Europeans that they needed to pay more attention to their own defence and that the US was shifting its attention towards the Indo-Pacific region.One US brigade at the Mihai Kogalniceanu airbase - set to be Nato's largest in Europe - would be rotated out and not replaced, Mosteanu said.The brigade has \"elements\" in Bulgaria, Romania, Slovakia and Hungary, Mosteanu said, although it was unclear whether US troops were going to be pulled out of these countries too.Polish Defence Minister Wladyslaw Kosiniak-Kamysz said on Wednesday that Warsaw had \"no information\" about a possible reduction of US troops on its territory. The presence of US troops at Romania's Deveselu and Campia Turzii bases would remain unchanged, Ionut Mosteanu added.Since taking office in January US President Donald Trump has made no secret of his wish to shift the focus of US military commitment from Europe to the Indo-Pacific region, and has repeatedly urged European Nato members to take more responsibility for the continent's defence.But the announcement of the US troop withdrawal from Romania will be concerning for Eastern European countries, many of which feel they have reason to fear a Russian attack in the future.Shortly after the announcement from Bucharest, a Nato official stressed that Washington's commitment to the Nato alliance remained \"clear\" and adjustments were \"not unusual\".\"Even with this adjustment, the US force posture in Europe remains larger than it has been for many years, with many more US forces on the continent than before 2022,\" the official said in a statement.The Pentagon also stressed that the US maintained a \"robust presence\" throughout Europe as well as \"the ability to array forces and capabilities to meet objectives... including President Trump's commitment to defend Nato allies\".The US has more than 100,000 military personnel deployed in Europe, according to figures from late last year.Last month Nato announced the creation of a mission dubbed Eastern Sentry, which it said would enhance the alliance's vigilance along the entire eastern flank. The decision came after a dozen Russian drones entered Polish airspace, in the most serious incident of its kind since the war began in February 2022. Days later,  Romania reported that a Russian drone had breached its airspace, and Estonia said Russian warplanes had violated its airspace too.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US troops on Nato's eastern flank to be reduced, Romania says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5136/live/a1df0300-b4b6-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-29T13:27:58.000Z",
      "dateModified": "2025-10-29T13:27:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Daughter criticises Australia cruise operator after mother dies on island",
    "url": "https://www.bbc.com/news/articles/cwyndvj3640o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4410/live/3dade5e0-b560-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-10-30T02:10:16.000Z",
    "description": "Cruise operator 'failed' woman who was left on island and died, family says14 hours agoLana LamSydneySuppliedSuzanne Rees was found dead hours after h",
    "body": "Cruise operator 'failed' woman who was left on island and died, family says14 hours agoLana LamSydneySuppliedSuzanne Rees was found dead hours after her cruise boat left Lizard IslandThe daughter of a woman who was left behind by a cruise ship on a remote island and later found dead has accused the operator of a \"failure of care and common sense\".The body of Suzanne Rees, 80, was found by rescue workers on Lizard Island on the Great Barrier Reef on Sunday. The day before, she had been hiking on the island with her fellow passengers but was not on the ship when it left hours later.Katherine Rees said she was \"shocked and saddened\" that the Coral Adventurer left \"without my mum\", whom she described as healthy, active, a keen gardener and bushwalker.\"From the little we have been told, it seems that there was a failure of care and common sense,\" she said on Thursday.It's understood that Suzanne Rees, from New South Wales, was on the first stop of a 60-day cruise around Australia, which had left Cairns earlier this week.Passengers, who pay tens of thousands of dollars to join the cruise, were transported to the exclusive island for a day trip with the option of hiking or snorkelling.Suzanne joined a group hike to the island's highest peak, Cook's Look, but broke away from the others as she needed to rest. \"We understand from the police that it was a very hot day, and mum fell ill on the hill climb,\" Katherine said. \"She was asked to head down, unescorted. Then the ship left, apparently without doing a passenger count.\"At some stage in that sequence, or shortly after, mum died, alone.\"Katherine said she hoped a coronial inquiry would \"find out what the company should have done that might have saved Mum's life\".The Australian Maritime Safety Authority (Amsa) said it was investigating the death and would meet the ship's crew when it is due to dock in Darwin later this week.A spokesperson for Amsa said it was first alerted to the missing woman at around 21:00 local time (10:00 GMT) on Saturday by the ship's captain.A search party returned to the island a few hours later but efforts to find Suzanne were called off in the early hours of Sunday before a helicopter returned in the morning and found her body. On Wednesday, the chief executive of Coral Expeditions said the company was \"deeply sorry\" for the death and were offering their support to the Rees family. \"We are working closely with Queensland Police and other authorities to support their investigation. We are unable to comment further while this process is under way,\" Mark Fifield said. The Coral Adventurer caters for up to 120 guests with 46 crew, according to the company's website. It was purpose-built to access remote areas of Australia's coast and is equipped with \"tenders\" - small boats used to take passengers on day excursions.Incidents like this are rare, and cruise ships have systems to record which passengers are embarking or disembarking, Harriet Mallinson, cruise editor of travel website Sailawaze told the BBC.\"Sneaking ashore or [back] onboard just isn't an option,\" she said.Cruise lines take these procedures very seriously and have \"clever tech in place to prevent such incidents from happening. This is most likely a shocking - and tragic - one-off,\" Ms Mallinson added.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Daughter criticises Australia cruise operator after mother dies on island",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4410/live/3dade5e0-b560-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-30T02:10:16.000Z",
      "dateModified": "2025-10-30T02:10:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Climate change intensified India's heatwaves in 2024 - Lancet study",
    "url": "https://www.bbc.com/news/articles/c5yp8r4ryvmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6739/live/e510cd10-b575-11f0-86b2-ed6a609e4a6c.jpg",
    "tag": "World",
    "date": "2025-10-30T11:03:40.000Z",
    "description": "5 hours agoNikita YadavBBC News, DelhiNurPhoto via Getty ImagesIndia has faced increasingly intense heatwaves in recent yearsAlmost one-third of the h",
    "body": "5 hours agoNikita YadavBBC News, DelhiNurPhoto via Getty ImagesIndia has faced increasingly intense heatwaves in recent yearsAlmost one-third of the heatwave days India experienced in 2024 were driven by climate change, according to a new report by the medical journal The Lancet.The report found that India recorded an average of 19.8 heatwave days last year, of which 6.6 days would not have occurred without human-induced climate change.It also estimated that heat exposure in 2024 resulted in the loss of 247 billion potential labour hours, mostly in the agriculture and construction sectors. amounting to an economic loss of about $194bn (£151bn).While heatwaves are not new to India, their frequency and intensity have been rising steadily over the past few decades because of global warming.Prolonged exposure to extreme heat has serious repercussions on health. It can overwhelm the body's ability to regulate temperature, increasing the risk of dehydration, heatstroke, cardiovascular stress, and even death - particularly among the elderly, infants and outdoor workers.And the 2025 Lancet Countdown report - which tracks the health impact of climate change and is widely regarded as a key scientific reference on the issue - warns that the health risks posed by rising global temperatures are now more severe than ever.\"Throughout last year,152 record-breaking extreme weather events were registered across 61 countries, and life-threatening, extreme heat events are becoming more intense than previously predicted,\" the report stated. \"The climate crisis is a health crisis. Every fraction of a degree of warming costs lives and livelihoods,\" said Jeremy Farrar, assistant director-general for Health Promotion and Disease Prevention and Care at the World Health Organization (WHO). The report found that heat-related mortality has increased by 23% worldwide since the 1990s, with an average of around 546,000 deaths each year.ReutersIndia is among the most polluted countries in the worldIt also found that the average person worldwide was exposed to 16 days of extreme heat last year that would not have occurred without climate change.\"This [report] paints a bleak and undeniable picture of the devastating health harms reaching all corners of the world,\" said Dr Marina Romanello, of University College London, who led the report's analysis. \"The destruction to lives and livelihoods will continue to escalate until we end our fossil fuel addiction,\" she added.Air QualityThe report also mentioned that India's air quality has worsened over the past few years. Every year as the winter sets in, the air quality in the Indo-Gangetic plains turns toxic. This year too, the air quality has remained between poor and very poor category - at times, reaching hazardous - for almost a month now. The report mentioned that 1.7 million deaths in 2022 were caused due to atmospheric pollution, particularly because of the tiny PM2.5 pollutants that can cause a host of serious health issues. Harmful emissions from burning fossil fuel led to 44% of these deaths. It also noted that the heavy reliance on biofuels such as wood, dung and crop residue for cooking continues to silently claim thousands of lives across the country - especially among women and children in rural areas.The report was released ahead of the COP30 summit, which is going to take place in Brazil next month. Follow BBC News India on Instagram, YouTube, X and Facebook.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Climate change intensified India's heatwaves in 2024 - Lancet study",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6739/live/e510cd10-b575-11f0-86b2-ed6a609e4a6c.jpg"
      ],
      "datePublished": "2025-10-30T11:03:40.000Z",
      "dateModified": "2025-10-30T11:03:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "France enshrines need for consent into rape law in wake of Gisèle Pelicot case",
    "url": "https://www.bbc.com/news/articles/ce9d3ldgg5vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e2cc/live/160d3e10-b4f1-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "World",
    "date": "2025-10-29T18:00:44.000Z",
    "description": "The French parliament has ratified an amendment to add consent to the legal definition of sexual assault and rape.Previously, rape or sexual abuse in ",
    "body": "The French parliament has ratified an amendment to add consent to the legal definition of sexual assault and rape.Previously, rape or sexual abuse in France had been defined as \"any form of sexual penetration committed with the use of violence, coercion, threat or surprise\".Now, the law will say that all sexual acts done to another without consent constitute rape.The change is the result of a cross-party, years-long debate which gained renewed urgency after last year's Pelicot rape trial, in which 50 men were found guilty of sexually assaulting or raping Gisèle Pelicot while she had been drugged unconscious by her husband Dominique.The defence of many of the accused hinged on the fact they could not be guilty of rape because they were unaware Ms Pelicot was not in a position to give her consent.Some defence lawyers in the Pelicot case had therefore argued that there could be no crime without the intention to commit it.The new bill will make this argument more tenuous, as it says that consent must be \"free and informed, specific, prior and revocable\".Consent will have to be evaluated according to the circumstances, the new law says, noting that it cannot be inferred from \"silence or lack of reaction\".\"There is no consent if the sexual act is committed through violence, coercion, threat or surprise, whatever their nature,\" it states.The two MPs who drafted the amendment - the Greens' Marie-Charlotte Garin and centrist Véronique Riotton - said a \"historic victory\" had been achieved and hailed \"a major step forward in the fight against sexual violence\".Some critics of the amendment had argued it would result in sexual relations turning into \"contracts\". Others were concerned that the changes could force victims of rape to prove they had not consented.But France's highest administrative court, the Council of State (Conseil d'État) said in March that it was backing the amendment, saying that it would \"clearly express... that sexual assaults infringe upon the fundamental principle of everyone's personal and sexual freedom\".An initial version was adopted by the National Assembly in April. Its progression was delayed by France's current political turmoil, but on Wednesday the Senate definitively adopted the bill, with 327 votes in favour and 15 abstentions. It then went back to parliament, which gave it final approval.Last year Greens senator Mélanie Vogel argued that while society had \"already accepted the fact that the difference between sex and rape is consent\" but that criminal law had not kept up.\"This is a historic step forward, following in the footsteps of several other European countries,\" Lola Schulmann, advocacy officer at Amnesty International France, told AFP on Wednesday.Sweden, Germany and Spain are among the European countries that already have consent-based rape laws.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "France enshrines need for consent into rape law in wake of Gisèle Pelicot case",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e2cc/live/160d3e10-b4f1-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-29T18:00:44.000Z",
      "dateModified": "2025-10-29T18:00:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Louvre: Five new suspects arrested over jewellery theft",
    "url": "https://www.bbc.com/news/articles/cz91jnyelq2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b4ae/live/6a3b8cd0-b564-11f0-b21a-99b56b1fa370.png",
    "tag": "World",
    "date": "2025-10-30T11:45:35.000Z",
    "description": "5 hours agoKathryn ArmstrongReutersPrecious crown jewels were taken during the theft earlier this monthFive more suspects have been arrested over thei",
    "body": "5 hours agoKathryn ArmstrongReutersPrecious crown jewels were taken during the theft earlier this monthFive more suspects have been arrested over their involvement in the Louvre heist, Paris' public prosecutor has said.They were detained on Wednesday night in the Paris region during coordinated raids, according to Laure Beccuau. One of the suspects is thought to be part of the four-man team that carried out the heist, who were seen on CCTV. Two of the other alleged thieves have already been arrested and have \"partially recognised\" their involvement in the brazen theft, while the fourth person has not yet been caught. It is not clear what role the other newly arrested people allegedly played in the theft, but Beccuau told French radio station RTL on Thursday that they \"may eventually inform us about how the incident took place\".Beccuau said the arrests had been made in areas in and around Paris, including the  suburb of Seine-Saint-Denis.Phones and other objects found on the suspects during the raid were allowing investigators to study encrypted messages, she added.Those arrested can be detained for up to four days before being charged or released.How Louvre gang carried out France's most shocking theftFrench investigators are not giving many more details away at this stage but Beccuau said that DNA from one of those arrested on Wednesday night could be linked to the crime scene. \"We had him in our sights,\" she said of the main suspect. She specified that the latest arrests were not related to statements made by the previously detained suspects but to \"other elements of the case\".The authorities have previously said that the gang involved in the heist could be bigger than those who physically stole the jewels.Items worth €88m (£76m; $102m) were taken from the Louvre - the world's most-visited museum - on 19 October, when four thieves broke into the building in broad daylight. The precious jewels have not been recovered yet.Louvre MuseumLouvre MuseumThe Marie-Louise necklace and a pair of earrings were among the eight items stolen A tiara worn by the Empress Eugenie, wife of Napoleon III, was takenThe first two people who were arrested over the heist - both men in their thirties with criminal records - are thought to be the pair who used power tools to enter the museum's  Galerie d'Apollon (Gallery of Apollo) and steal some of the French crown jewels.They were taken into custody late last week. Beccuau told a press conference on Wednesday that one of the men was arrested as he tried to board a one-way flight to Algeria, but that the other man had not been planning to leave France, contrary to earlier media reports.There was no evidence at this stage to suggest the theft was an inside job, she added, confirming no accomplices worked at the museum. On the day of the heist, the robbers arrived at 09:30, just after the museum opened to visitors, Beccuau said at a press conference on Wednesday.The suspects arrived with a stolen vehicle-mounted mechanical lift to gain access to the Gallery of Apollo via a balcony close to the River Seine. The men used a disc cutter to crack open display cases housing the jewellery.Beccuau said the thieves were inside for four minutes and made their escape on two scooters waiting outside at 09:38, before switching to cars and heading east. Nobody had been threatened during the raid. France's justice minister said security protocols in the Louvre - one of the world's most famous museums - \"failed\" in preventing the theft. It was later revealed by the Louvre's director that the only camera monitoring the Gallery of Apollo was pointing away from a balcony the thieves climbed over to break in. Since the incident, security measures have been tightened around France's cultural institutions.The Louvre has transferred some of its most precious jewels to the Bank of France following the heist. They will now be stored in the Bank's most secure vault, 26m (85ft) below the ground floor of its elegant headquarters in central Paris.Watch: Two people leave Louvre in lift mounted to vehicle",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Louvre: Five new suspects arrested over jewellery theft",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b4ae/live/6a3b8cd0-b564-11f0-b21a-99b56b1fa370.png"
      ],
      "datePublished": "2025-10-30T11:45:35.000Z",
      "dateModified": "2025-10-30T11:45:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says nuclear weapons testing to resume in US after more than 30 years",
    "url": "https://www.bbc.com/news/articles/c4gzq2p0yk4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f89f/live/41acb900-b538-11f0-8e27-6729950a59f0.jpg",
    "tag": "World",
    "date": "2025-10-30T11:54:13.000Z",
    "description": "Trump directs nuclear weapons testing to resume for first time in over 30 years4 hours agoMax MatzaTrump says he wants to resume testing US nuclear we",
    "body": "Trump directs nuclear weapons testing to resume for first time in over 30 years4 hours agoMax MatzaTrump says he wants to resume testing US nuclear weaponsPresident Donald Trump has called on US military leaders to resume testing nuclear weapons in order to keep pace with other countries such as Russia and China.\"Because of other countries testing programs, I have instructed the Department of War to start testing our Nuclear Weapons on an equal basis,\" he wrote on social media just before meeting with Chinese President Xi Jinping in South Korea.The US has more nuclear weapons than any other country, Trump said, with Russia second and China a \"distant third\". It has not conducted nuclear testing since 1992.It comes just days after Trump denounced Russia for testing a nuclear-powered missile. The Kremlin says its tests were \"not nuclear\".Getty ImagesLater, on Air Force One after the two leaders' meeting, Trump said the nuclear test sites would be determined later.\"With others doing testing, I think it's appropriate that we do also,\" Trump said on his way back to Washington.No country except North Korea has conducted a nuclear test explosion in this century, according to the Arms Control Association (ACA) - and even Pyongyang announced a moratorium in 2018. Trump's announcement did not make it clear whether he was referring to testing a nuclear explosion, or simply a weapon system that would be capable of delivering a nuclear weapon.His post on Wednesday night acknowledged the \"tremendous destructive power\" of nuclear weapons, but said he had \"no choice\" but to update and renovate the US arsenal during his first term in office.He also said that China's nuclear programme \"will be even within 5 years\".The announcement marks an apparent reversal of a long-standing US policy. The last US nuclear weapons test was in 1992, before former Republican President George HW Bush issued a moratorium as the Cold War ended.Russia announced over the weekend that it had successfully tested two new weapons capable of carrying nuclear warheads.These included a missile which the Kremlin said could penetrate US defence systems, and an underwater drone called Poseidon, capable of hitting the American west coast and triggering radioactive ocean swells. But those tests did not involve the detonation of nuclear weapons.On Thursday, Russia denied it had carried out nuclear tests.\"Regarding the tests of Poseidon and Burevestnik, we hope that the information was conveyed correctly to President Trump,\" Kremlin spokesman Dmitry Peskov told journalists. \"This cannot in any way be interpreted as a nuclear test.\" The Kremlin said the United States had not notified Russia of its intention to conduct nuclear weapons testing.\"The US is a sovereign country which has a right to make its sovereign decisions. But I want to recall President Putin's statement, which has been repeated many times: if someone departs from the moratorium, Russia will act accordingly,\" the spokesman said.China has also responded to Trump's announcement, saying it hoped the US would earnestly fulfil its obligations under the Comprehensive Nuclear-Test-Ban Treaty (CTBT) and honour its commitment to suspend nuclear testing.Who has the most nuclear weapons?Trump has said the US has more nuclear weapons than any other country.The exact number of warheads held by each country is kept secret in each case - but Russia is thought to have a total of about 5,459 warheads while the US has about 5,177, according to the Federation of American Scientists (FAS).The US-based ACA gives slightly higher estimates, saying America's nuclear stockpile sits at about 5,225 warheads, while Russia has approximately 5,580.China is the third largest nuclear power with about 600 warheads, France has 290, the United Kingdom 225, India 180, Pakistan 170, Israel 90 and North Korea 50, FAS reports.According to US think tank Center for Strategic and International Studies (CSIS), China has roughly doubled its nuclear arsenal in the past five years and is expected to exceed 1,000 weapons by 2030.Trump's statement about nuclear testing came about 100 days before the expiration of the New Strategic Arms Reduction Treaty (New Start) in February 2026 - the last remaining nuclear arms treaty between the US and Russia.The agreement limits each country to 1,550 warheads on deployed missiles capable of crossing continents.When and where was the last US test?The last time the US tested a nuclear bomb was 23 September 1992. The test took place at an underground facility in the western state of Nevada.The project, code named Divider,  was the 1,054th nuclear weapons test conducted by the US, according to the Los Alamos National Laboratory, which played a central role in helping develop the world's first atomic bomb.The Nevada Test Site, 65 miles (105km) north of Las Vegas, is still operated by the US government.\"If deemed necessary, the site could be authorised again for nuclear weapons testing,\" according to the National Museum of Nuclear Science and History, which is an affiliate of the Smithsonian Institution.But some experts note that it would take the US at least 36 months to restart underground nuclear tests at the former Nevada test site.\"Trump is misinformed and out of touch,\" Daryl G Kimball, executive director of the ACA, wrote on X. \"The US has no technical, military, or political justification for resuming nuclear explosive testing for the first time since 1992.\"\"Trump will trigger strong public opposition in Nevada, from all US allies, and it could trigger a chain reaction of nuclear testing by US adversaries, and blow apart the nuclear Nonproliferation Treaty, \" Mr Kimball added.Trump's announcement also drew negative reactions from a few opposition Democrats. Representative Dina Titus, from Nevada, wrote on X: \"I'll be introducing legislation to put a stop to this.\"The US first marched into the nuclear era with the Trinity test of the first atomic bomb in July 1945 in the desert at Alamogordo, New Mexico.It later became the only country in the world to use nuclear weapons in warfare after dropping two atomic bombs on the Japanese cities of Hiroshima and Nagasaki in August of the same year during World War Two.Approximately 140,000 people were killed in Hiroshima and 74,000 in Nagasaki, with many deaths occurring from immediate blast effects, burns, and later from radiation sickness.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says nuclear weapons testing to resume in US after more than 30 years",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f89f/live/41acb900-b538-11f0-8e27-6729950a59f0.jpg"
      ],
      "datePublished": "2025-10-30T11:54:13.000Z",
      "dateModified": "2025-10-30T11:54:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump hails 'amazing' meeting with Xi in South Korea",
    "url": "https://www.bbc.com/news/articles/crl25xl1gjpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9d31/live/da437390-b59a-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "World",
    "date": "2025-10-30T16:06:07.000Z",
    "description": "Trump hails 'amazing' meeting with China's Xi but no formal trade deal agreed 11 minutes agoLaura Bicker,China correspondent , Anthony Zurcher,North A",
    "body": "Trump hails 'amazing' meeting with China's Xi but no formal trade deal agreed 11 minutes agoLaura Bicker,China correspondent , Anthony Zurcher,North America correspondent and Flora DruryUS President Donald Trump and his Chinese counterpart, Xi Jinping, have met for the first time in six years - raising hopes for a de-escalation of tensions between the world's two biggest economies.Trump described the talks, held in South Korea, as \"amazing\", while Beijing said they had reached a consensus to resolve \"major trade issues\".Relations have been tense since Trump began imposing new tariffs on China, prompting retaliation from Beijing. The two agreed to a truce in May, but tensions remained high.Thursday's talks did not lead to a formal agreement but the announcements suggest they are closer to a deal - the details of which have long been subject to behind-the-scenes negotiations.Trade deals normally take years to negotiate. Countries around the world have been thrown into resolving differences with Trump within a matter of months, after he imposed sweeping tariffs - or import taxes - on some of his top trade partners. Some of those key trading partners are in Asia, where Trump has spent the last several days.Tariff 'truce' and movement on rare earthsChina has agreed to suspend export control measures it had placed on rare earths, crucial for the production of everything from smartphones to fighter jets. This has been seen as a key win for Trump from his meeting with Xi.A jubilant Trump told reporters on Air Force One that he had also got China to start immediately buying a \"tremendous amounts of soybeans and other farm products\". Retaliatory tariffs on American soybeans by Beijing had effectively halted imports from the US, harming US farmers - who constitute a key voting block for Trump.US Treasury Secretary Scott Bessent later told Fox Business that China had agreed to buy 12 million metric tonnes of soybeans this season, and would follow that up with a minimum of 25 million tonnes per year for the next three years.In the immediate aftermath of the meeting, the US also said it would drop part of the tariffs it has levied on Beijing over the flow of ingredients used in making fentanyl to the US. Trump has imposed severe tariffs on China, as well as Canada and Mexico, for their perceived failure to clamp down on the flow of that drug.Xi and Trump find temporary truce as China plays longer gameWhat tariffs has Trump announced and why?The president of the US-China Business Council welcomed the news on tariffs and rare earths, describing these as the most significant outcome of the talks.Sean Stein told the BBC: \"You could say that this is a truce, that we are now locked in place on tariffs and we don't have to worry every 90 days where other it's going to roll over\".Speaking to Business Today from Beijing, Mr Stein said this \"gives business plenty of time to work on the Chinese and the US administration to make sure that they're focused on some of the long-standing issues that have troubled the trade relationship between the two countries.\"However, it seems other tariffs, or taxes on imported goods, will remain in place, meaning that goods arriving in the US from China are still being taxed at a rate of over 40% for US importers.More positively for Beijing, it will now be able to speak to Jensen Huang, the head of US tech firm Nvidia - according to Trump. Nvidia is at the heart of the two countries' fight over AI chips: China wants high-end chips but the US wants to limit China's access, citing national security.Beijing has also extended an invitation to Trump to visit China in April - yet another sign of thawing relations.There was, however, no mention of a breakthrough on TikTok. The US has sought to take the video-sharing app's US operations away from Chinese parent company ByteDance for national security reasons. Beijing said afterwards it would continue to work to resolve the issues.China more measured, talking of 'good start'The meeting also showed the gulf between the two leaders' approaches.Xi was self-contained, and said only what he had prepared. He entered the meeting knowing he had a strong hand. China had learned from Trump's first term, leveraging its chokehold on rare earths, and diversifying its trade partners so it is less reliant on the US.Afterwards, he was far more measured in his language than Trump. The two sides would be working on delivering outcomes that will serve as a \"reassuring pill\" for both countries' economies, he said.Trump was - as always - more ad-lib. But the US president was also noticeably more tense than he had been for the rest of his whirlwind trip to South East Asia - a reflection of the high stakes in Thursday's meeting.The glamour and pageantry on show since he arrived at his first stop in Malaysia just five days ago was also absent.Gone were the gold-laden palaces of the sort he was welcomed to in Japan on Tuesday. Instead, a building at an airport, lying behind barbed wire and security checkpoints.The military bands which welcomed Trump to South Korea on Wednesday were nowhere to be seen.Instead, the only sign something important was going on inside was the heavy police and media presence.But despite the quieter public face, what was happening inside was arguably the most significant hour and 20 minutes of the trip.Henry Wang, a former adviser to China's State Council, told BBC Radio 4's Today programme that Trump and Xi's talks \"went very well\".It may not have been a trade deal, but a \"framework and structure has been laid\", he added - calling it \"a good start\".Additional reporting by Jonathan JosephsWatch: US and China's different reports of their trade meeting",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump hails 'amazing' meeting with Xi in South Korea",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9d31/live/da437390-b59a-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-30T16:06:07.000Z",
      "dateModified": "2025-10-30T16:06:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "At least 132 killed in Rio police raid, officials say",
    "url": "https://www.bbc.com/news/articles/c8x155engwpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6342/live/78c5b4c0-b4d2-11f0-b31a-d15d08f211be.jpg",
    "tag": "World",
    "date": "2025-10-29T16:41:35.000Z",
    "description": "24 hours agoVanessa BuschschlüterFootage shows gunfire and drones in Rio raidsThe number of people known to have been killed in a deadly police raid i",
    "body": "24 hours agoVanessa BuschschlüterFootage shows gunfire and drones in Rio raidsThe number of people known to have been killed in a deadly police raid in the Brazilian city of Rio de Janeiro on Tuesday has risen to 132, officials say.This is more than double the figure cited after the police operation in the favelas (poor neighbourhoods) of Alemão and Penha, in the north of Rio de Janeiro, on Tuesday.The public defender's office, which provides legal assistance to the poor, made the new death toll public after grieving residents lay dozens of bodies in a square  early on Wednesday.The police raid was the deadliest in the city, where authorities have for decades tried to contain the gangs which control many of its poorer neighbourhoods.ANTONIO LACERDA/EPA/ShutterstockPolice said that among those detained were key members of the Red Command gangAsked about the figure given by the public defender's office, Rio state Governor Cláudio Castro said that forensic work was still under way and that until it had concluded, the official figure which he had been given was of 58 dead, although it was \"certain to change\".Among those expressing shock about the death toll was Brazil's President, Luiz Inácio Lula da Silva. According to Brazil's justice minister, Lula was \"astonished\" and also expressed his surprise that the federal government had not been informed beforehand. Even before the number of dead had more than doubled, the United Nations Human Rights office had said it was \"horrified\" by the police operation.Early on Wednesday, residents took the bodies of those killed into a square in Penha, where they placed them next to each other in a long line to show the deadly nature of the raid.According to Brazilian media, estimates varied between at least 50 and more than 70 bodies. Many of the bodies had reportedly been retrieved from a nearby hillside, where police said most of the deadly clashes had unfolded. Challenged by journalists about earlier remarks he had made describing those killed as \"criminals\", Governor Castro replied: \"To be quite honest with you, the conflict wasn't in a built-up area, it was all in the woods. So I don't believe anyone was just strolling in the woods on a day of conflict. And that's why we can easily classify them.\"REUTERS/Aline MassucaResidents were distraught after the raid, in which at least 64 people were killedResidents described the scenes unfolding on Tuesday as \"war-like\", with shoot-outs between officers and armed men - with buses set on fire to create barricades.According to the police, gang members also used drones to drop explosives on the officers as they fanned out through the neighbourhoods, which are strongholds of the Red Command.\"This is how the Rio police are treated by criminals: with bombs dropped by drones. This is the scale of the challenge we face. This is not ordinary crime, but narco-terrorism,\" Governor Castro, said. Governor Castro said that the raid had been two months in the planning and was based on a thorough investigation. Among those arrested is a man accused of being a leading drug dealer for the Red Command. The governor also posted photos on social media of the four police officers who were killed in the operation.He praised the officers killed on what he called \"a historic day\" in which he said they \"confronted organised crime\".Rafael Soares, a Brazilian journalist covering crime in Rio, told BBC News Brasil that the Red Command had been on the offensive in Rio in recent years, reclaiming territory it had lost to its rivals, First Capital Command (PCC).Soares added that the police operation was part of Governor Castro's efforts to leave his mark and deal a decisive blow to crime in the city ahead of elections next year. The police raid also comes just days before the city is due to host the C40 World Mayors Summit - a meeting of nearly 100 mayors from the world's leading cities - and the Earthshot Prize - the environmental award which will be handed out by Prince William on 5 November.  Huge police raids are not unusual in Rio, but the number of fatalities in Tuesday's operation is.According to  Soares, police operations in which more than 20 people are killed are \"very rare\" across Brazil and those that do occur, have mainly happened in Rio. Rio de Janeiro's Minister for Public Security, Victor Santos, said that 280,000 people lived in the areas where the raids took place. Police footage showed heavily-armed officers patrolling the narrow, steep lanes of the densely populated hillside favelas.\"This is a war we are seeing in Rio de Janeiro. Decades of inaction by all the institutions - municipal, state and federal - have allowed crime to expand in our territory,\" Santos said.With additional reporting by BBC News Brazil's Marina Rossi and Mariana Alvim in São Paulo.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "At least 132 killed in Rio police raid, officials say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6342/live/78c5b4c0-b4d2-11f0-b31a-d15d08f211be.jpg"
      ],
      "datePublished": "2025-10-29T16:41:35.000Z",
      "dateModified": "2025-10-29T16:41:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Who is Rob Jetten, tipped to become youngest Dutch prime minister?",
    "url": "https://www.bbc.com/news/articles/cr7m0n890npo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/85cf/live/f3d37310-b544-11f0-981c-730b6d97cd1d.jpg",
    "tag": "World",
    "date": "2025-10-30T03:50:18.000Z",
    "description": "12 hours agoPaul KirbyEurope digital editorReutersRob Jetten became one of the youngest ministers in Dutch history under former PM Mark RutteRob Jette",
    "body": "12 hours agoPaul KirbyEurope digital editorReutersRob Jetten became one of the youngest ministers in Dutch history under former PM Mark RutteRob Jetten's achievement in dragging his socially liberal D66 party from fifth place to the top of Dutch politics in less than two years has been extraordinary. But politically, all the stars were perfectly aligned for the 38-year-old to do so.The result of Wednesday's election is too close to call, with Jetten vying with anti-Islam populist Geert Wilders for the most seats in parliament.No other political leader commanded as much screen time during the campaign as Jetten and his smile and cheerful message resonated with voters, while his rivals sometimes struggled.Hardly a night went by without him on TV. When Wilders cancelled an appearance because of security fears, Rob Jetten seized the moment and took his place. He even featured in a TV quiz show recorded months ago called The Smartest Person.And his D66 party was untarnished by involvement in Wilders' ill-fated 11-month coalition, largely because Jetten had fared so poorly in the last election in 2023. The government collapsed last June when Wilders' party quit following a row over migration.But perhaps more than anything else, he was able to convey a positive message summed up by the slogan Het kan wel - an optimistic phrase that borrows from Barack Obama's \"Yes, we can\".It contrasted strongly with Wilders, who he accused of \"sowing division\".If his party does come top, Rob Jetten could become the Netherlands' first openly gay prime minister.A self-confessed politics nerd as a child, the young Jetten grew up in a small town in the southern province of Brabant and came out when he was young.Jetten has not made his private life part of his political identity, but five years ago he posted a video in which he read out a long list of homophobic messages from his phone, to prove why an international day against homophobia was important.Jetten is now engaged to Argentine hockey player, Nicolás Keenan, and they are due to marry next year.EPAJetten led a highly polished campaign and outperformed rivals in TV debatesHe was an early supporter of the centrist D66, which describes itself as progressive and socially liberal party, and officials soon spotted his potential.After a few years working for Dutch rail network ProRail, Jetten was elected as an MP in 2017 and had a couple of early experiences as leader before he served under long-serving prime minister Mark Rutte as climate minister.But not everything has worked out smoothly in Jetten's career. A parliamentary colleague complained he was \"pushy\" on the climate, and his big ambitions as minister were cut short when Russia's full-scale invasion of Ukraine sent energy prices soaring.He led D66's disastrous campaign in 2023 when the party came away with only nine seats, two years after his predecessor Sigrid Kaag managed second place after Rutte.Jetten was not yet as fluent in front of the cameras. Some media appearances he gave were criticised as dull, and one critic labelled him \"Robot Jetten\".\"Robot Jetten is going to be prime minister!\" one reporter said to him incredulously as his success became clear on Wednesday night.\"Sometimes it can work out really crazy in politics,\" Jetten replied with a broad grin.EPAJetten fought a close race against anti-Islam populist Geert WildersSupporters see him as a kind of mini-Mark Rutte, who is now head of Nato. And that comparison will suit Jetten fine, as many Dutch now look back warmly on the stability of the Rutte years, after two years of relative turmoil.Both men always appear cheerful and pragmatic, and both are notorious for getting by on precious little sleep. However, party colleague Roy Kramer noticed a difference: \"Rutte is a chatterbox, Jetten is a bit quieter,\" he told Dutch newspaper Het Parool.The liberal leader has big ambitions, and few challenges are more pressing than tackling the Netherlands' housing crisis, with a shortage of some 400,000 homes.Jetten wants to build 10 cities and complains Dutch governments have not really achieved anything impressive for the past 10 to 15 years. He is making big promises and will come under pressure to deliver.For Jetten to succeed he will need some of Rutte's teflon political coating that saw him through four governments.He has already survived one awkward moment in the campaign, when a joke about Crown Princess Amalia fell flat in front of 2,000 students in Rotterdam.\"I think the best way of promoting work in the military is being able to end up training with the Crown Princess. I bet a few guys in this audience would be interested in that,\" he said.The debate moderator hit back saying: \"what kind of sexist remark is that?\"Jetten later admitted it was inappropriate, but it appears to have done him no harm. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Who is Rob Jetten, tipped to become youngest Dutch prime minister?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/85cf/live/f3d37310-b544-11f0-981c-730b6d97cd1d.jpg"
      ],
      "datePublished": "2025-10-30T03:50:18.000Z",
      "dateModified": "2025-10-30T03:50:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Hurricane Melissa leaves trail of destruction across Caribbean ",
    "url": "https://www.bbc.com/news/articles/c77zd1m8jz3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f0e8/live/9f12ab70-b599-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-10-30T14:23:21.000Z",
    "description": "2 hours agoNick Davis,Mandeville, Jamaica and Rachel Hagan & Gabriela PomeroyWatch: How Hurricane Melissa roared across the CaribbeanThe scale of deva",
    "body": "2 hours agoNick Davis,Mandeville, Jamaica and Rachel Hagan & Gabriela PomeroyWatch: How Hurricane Melissa roared across the CaribbeanThe scale of devastation left by Hurricane Melissa is becoming clear after the record-setting storm tore through Jamaica, Haiti and Cuba, leaving at least 34 people dead.Although downgraded from a category five to a category two storm, Melissa gathered speed as it swept through the Bahamas on Thursday and is expected to make landfall in Bermuda later.The strongest storm to strike the Caribbean island in modern history, the hurricane sustained winds of 298km/h (185 mph) at its peak - stronger than Hurricane Katrina, which devastated New Orleans in 2005, killing 1,392 people.The US National Hurricane Centre (NHC) reported sustained winds of 165km/h at 12:00 GMT on Thursday.Getty ImagesIn Jamaica, the impact was most severe in the south-western parish of St Elizabeth.It warned of possible coastal flooding as the storm accelerated north-eastward.Authorities in the Bahamas have since lifted hurricane warnings for the central and southern islands, as well as for the Turks and Caicos. The country's Minister of State for Disaster Risk Management, Leon Lundy, urged residents to remain vigilant, saying: \"Even a weakened hurricane retains the capacity to bring serious devastation.\"Nearly 1,500 people were evacuated from vulnerable areas in what officials described as one of the largest operations in Bahamian history. While flooding has disrupted parts of the archipelago, the ministry of tourism said the majority of the country - including Nassau, Freeport, Eleuthera and the Abacos - remained largely unaffected and open to visitors.Across the wider Caribbean, Melissa's powerful winds have torn apart homes and buildings, uprooted trees and left tens of thousands without power. In Cuba, residents of the country's second-largest city Santiago de Cuba worked with machetes to clear streets buried in debris. President Miguel Díaz-Canel said the hurricane had caused \"considerable damage\" but did not provide a casualty figure.In Jamaica, the impact was most severe in the southwestern parish of St Elizabeth, where knee-deep mud and washed-out bridges left towns such as Black River cut off. On the road west out of the capital Kingston we saw minimal damage - some structures torn down, trees strewn across roads and gardens.AFP via Getty ImagesCuba's second-largest city, Santiago de Cuba, was badly hitBut once we arrived in central Jamaica we started to see how severely the island had been hit. The town of Mandeville has been, for want of a better word, flattened. A petrol station lost its roof and most of its pumps.Dana Malcolm of the Jamaica Observer described \"very, very slow progress\" along roads still blocked by landslides when reaching St Elizabeth. She told the BBC: \"I was standing in what used to be main street yesterday and I was knee-deep in mud where the road should have been.\"Kabien, who runs a beauty business in the Santa Cruz area of St Elizabeth, said she is staying in her house with the roof blown off and flooding because the public shelter is too dangerous.She told the BBC on Thursday morning it was \"extremely traumatic especially for the kids.\" She continued: \"We are still at home now. Even though it is flooded and has no roof. We don't have any options. I'm trying to clean up. The shelters aren't safe for my kids. The beddings are too close to random men. There aren't separate areas for kids, men, women and adults.\"ReutersSatellite image along Montego Bay before Hurricane Melissa made landfall and the aftermathCommunication across Jamaica has been all but severed, with power lines and mobile networks down in much of the southwest. Many families have spent days unable to contact relatives in the hardest-hit parishes.In Black River, the New York Times reported, the relative of one victim walked 15 miles (24km) to the police station to report their loved one dead.Desmond McKenzie, the minister of local government, shared the news that \"amidst all this, a baby was safely delivered under emergency conditions. So there is... a baby Melissa\".Haiti, already mired in gang violence and humanitarian crisis, suffered at least 25 deaths - 10 of them children - largely due to flooding after days of relentless rain, despite the country avoiding a direct hit.The storm is also responsible for at least eight deaths in Jamaica and one in the Dominican Republic, officials have said.The NHC said floodwaters across the Bahamas were expected to subside by Thursday, though conditions in Cuba, Jamaica and Hispaniola would remain hazardous for several days.ReutersSt Elizabeth is covered in knee-deep mud and with flooded roads",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Hurricane Melissa leaves trail of destruction across Caribbean ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f0e8/live/9f12ab70-b599-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-30T14:23:21.000Z",
      "dateModified": "2025-10-30T14:23:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sudan war: New videos show executions after RSF militia takes key city",
    "url": "https://www.bbc.com/news/articles/cd9kjw515pyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4b96/live/2a1e7170-b4d4-11f0-aa13-0b0479f6f42a.png",
    "tag": "World",
    "date": "2025-10-29T15:10:05.000Z",
    "description": "1 day agoPeter Mwai, Merlyn Thomas and Matt MurphyBBC Verify    BBCWarning: This story contains graphic descriptions of executions.Fighters from the p",
    "body": "1 day agoPeter Mwai, Merlyn Thomas and Matt MurphyBBC Verify    BBCWarning: This story contains graphic descriptions of executions.Fighters from the paramilitary Rapid Support Forces (RSF) have executed a number of unarmed people after capturing the Sudanese city of el-Fasher, new videos analysed by BBC Verify show.The RSF, which has engaged in a brutal war with the Sudanese Armed Forces (SAF) for more than two years, seized a key military base in the city over the weekend after an extended siege.Several videos have since emerged showing men wearing military fatigues and some with what appear to be RSF patches carrying out extreme acts of violence around el-Fasher. The UN's Sudan coordinator said it had received \"credible reports of summary executions\" in the city during an interview with the BBC on Wednesday.BBC Verify has approached the RSF for comment. Imran Abdullah, an adviser to the paramilitary, denied the group's fighters were targeting civilians in an interview with the BBC on Monday.Sudan has been ravaged by war since the conflict broke out in 2023, prompted by the collapse of the SAF and the RSF's fragile ruling coalition. More than 150,000 people have died across the country and about 12 million have fled their homes since then.Speaking to BBC Radio 4's Today programme, Denise Brown - the UN's Sudan coordinator - said she had received reports of executions against \"unarmed men in particular\" since the RSF entered el-Fasher. Killings of unarmed civilians or surrendering combatants is a war crime under the Geneva Convention.Most of the clips reviewed by BBC Verify are in dusty and sandy rural locations, making it hard to say where exactly they took place. However, we did geolocate one video showing the summary shooting of an unarmed man at a university building in el-Fasher.The clip showed the unarmed man sitting amid dozens of dead bodies in a hallway. As the video progressed, he was seen turning towards the camera which followed an armed man who was descending the stairs. The fighter then raised his rifle and fired a single shot knocking the unarmed man to the ground, where he lay motionless.A number of similarly distressing clips are circulating online, but are difficult to geolocate as they are recorded outside the city itself where there are very few visible landmarks. But BBC Verify has managed to place one of the fighters who appeared in multiple execution videos in the area around el-Fasher in recent days.The fighter, who goes by the name of Abu Lulu, has long had his activities with the RSF documented on a social media profile viewed by BBC Verify.A video which first appeared online over the weekend showed him amidst dead bodies in an area north-west of the city. Working with the Centre for Information Resilience (CIR), BBC Verify has been able to confirm the location of this footage, but it's difficult to say whether the dead in the clip are civilians or SAF troops killed in fighting due to the quality of the video.But Abu Lulu has also appeared in at least two videos which show him participating in the execution of unarmed men who are kneeling and under armed guard. Reverse image searches show all the videos have appeared online since the weekend.In one video he was seen addressing an injured man lying on the ground, berating him for not sharing information before threatening to rape him. The RSF fighter then shot the captive several times using an automatic rifle.A separate video shows Abu Lulu standing alongside several RSF troops carrying AK-style assault rifles and guarding a group of at least nine unarmed captives. After addressing the men, Abu Lulu aimed his rifle at the group and opened fire. In the aftermath the other armed men raised their arms and cheered.In another clip the fighter was seen standing alongside several other armed men with dozens of dead bodies visible in the background. Some of the fighters were wearing RSF style uniforms, one of which has a circular patch with a black line running around the circumference - consistent with the paramilitary's insignia.Fighters involved in shootings were wearing patches consistent with RSF insigniaIn August the RSF said it would investigate Abu Lulu after he was accused of executing a captive. A statement said \"if it is proven that the perpetrator is indeed a member of our ranks, he will be held accountable without delay\".The videos come after US-based researchers said that satellite images taken of el-Fasher since the city fell appear to show the aftermath of mass killings carried out in the streets of the city itself.Analysts with the Yale Humanitarian Research Lab highlighted large \"clusters\" visible in the images, which they said were \"consistent with the size range of adult human bodies and are not present in previous imagery\".In the report issued on Monday, Yale said that its analysts' observations were \"consistent with reports of executions\" shared online and by the UN and human rights groups in recent days and also highlighted \"discoloration\" which the analysts said may be human blood.Without on-the-ground footage from that location, BBC Verify cannot independently confirm Yale's findings.Other satellite images viewed by BBC Verify appeared to show vehicles parked at each end of several streets. Yale analysts noted that their positioning appeared to suggest that the paramilitary was carrying out house-to-house clearance operations. In some areas, clusters that Yale identified as human bodies were seen near the vehicles.Sudan's military expels top UN food aid officials as conflict escalatesFear of mass killings as thousands trapped in besieged Sudan city taken by militia groupBBC smuggles in phones into el-Fasher to reveal hunger and fearMichael Jones, an analyst with the Royal United Services Institute (RUSI), said the RSF has a track record of carrying out ethnically-based summary killings which could be partially attributed to the paramilitary's \"decentralised composition\".\"The bulk of the group's manpower comes from a messy confederation of rented militia, local allies and economic opportunists, who are often motivated by interests or grievances that pre-date the April 2023 conflict,\" he told BBC Verify.\"Although likely playing out under the umbrella of RSF policy, the violence can sometimes be decentralised, with perpetrators settling personal or communal vendettas, seizing assets or land, and participating in ethnic cleansing to consolidate their own political power.\"In recent months the SAF has made several major gains against the RSF, including recapturing the capital Khartoum, so that the army now controls most of the north and the east of the country.By contrast the RSF controls almost all of Darfur in the west and much of the neighbouring Kordofan region - the traditional base of its predecessor, the Janjaweed paramilitary which carried out ethnic killings in Darfur between 2003 and 2005. Many of those who fought with the Janjaweed are believed to have joined the RSF.Until now el-Fasher was the last major urban centre in Darfur still held by government forces and its allies. The RSF has previously said that it hopes to form a rival government in the city when it had assumed control there.Both sides have been accused of war crimes since the conflict began and in the closing days of President Joe Biden's administration the US said the RSF had carried out acts of genocide. BBC Verify has previously documented mass killings carried out by the RSF following the defection of a senior commander.Additional reporting by Kumar Malhotra, Benedict Garman, Richard Irvine-Brown, Daniele Palumbo, Paul Myers and Thomas Copeland.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sudan war: New videos show executions after RSF militia takes key city",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4b96/live/2a1e7170-b4d4-11f0-aa13-0b0479f6f42a.png"
      ],
      "datePublished": "2025-10-29T15:10:05.000Z",
      "dateModified": "2025-10-29T15:10:05.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]