[
  {
    "title": "Two US Navy ships collide near South America",
    "url": "https://www.bbc.com/news/articles/c62090j5qqjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/88bc/live/8c41e130-0811-11f1-8fdd-d9a354700c27.jpg",
    "tag": "World",
    "date": "2026-02-12T13:42:30.000Z",
    "description": "7 hours agoBrandon DrenonGetty ImagesA US Navy warship collided into a Navy supply vessel during a refuel operation, the US military's Southern Comman",
    "body": "7 hours agoBrandon DrenonGetty ImagesA US Navy warship collided into a Navy supply vessel during a refuel operation, the US military's Southern Command confirmed to the BBC. Two people reported minor injuries during Wednesday's replenishment-at-sea operation, Southern Command said, and are in stable condition. The vessels - a guided missile destroyer and fast combat support ship - have both continued sailing safely from the site of the incident near South America.Southern Command did not say what caused the collision and said the incident was currently under investigation.The exact location of the crash between the Arleigh Burke-class destroyer USS Truxtun and the Supply-class fast combat support ship USNS Supply was not immediately clear.The USNS Supply ship has been operating in the Caribbean, according to the Wall Street Journal, which is part of Southern Command's area of responsibility. Southern Command is also responsible for parts of the South Atlantic and the South Pacific.US President Donald Trump has ordered a military buildup in the Caribbean the last few months as part of the administration's stated aim to target drug trafficking.Two people died on Thursday after the US military struck an alleged drug boat in the eastern Pacific, adding to a tally of least 38 lethal alleged drug boat strikes in the region since Trump has re-entered office. The US has also used its military presence in the region to enforce sanctions against Venezuelan oil, after arresting the country's president Nicolas Maduro in a middle-of-the-night raid in January.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two US Navy ships collide near South America",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/88bc/live/8c41e130-0811-11f1-8fdd-d9a354700c27.jpg"
      ],
      "datePublished": "2026-02-12T13:42:30.000Z",
      "dateModified": "2026-02-12T13:42:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dawson's Creek: The 90s teen drama that 'wore its heart on its sleeve'",
    "url": "https://www.bbc.com/news/articles/c5y5x230ve4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f030/live/d3845e50-081c-11f1-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-12T14:27:59.000Z",
    "description": "6 hours agoEmma SaundersCulture reporterJames Van Der Beek talks to BBC Radio 1 about Dawson's Creek coming to an end in 2003Full confession. Dawson's",
    "body": "6 hours agoEmma SaundersCulture reporterJames Van Der Beek talks to BBC Radio 1 about Dawson's Creek coming to an end in 2003Full confession. Dawson's Creek was my guilty pleasure in the late 90s. Truthfully, I was probably a little too old to watch it in my early 20s, but my friends and I would often find ourselves under the duvet on the sofa on a Sunday morning after a big night out, nursing our hangovers with a cuppa and a side of American teen drama.We might have giggled at the unrealistically articulate monologues, but secretly wished we'd also had that pitch-perfect snappy riposte to dole out to a disappointing boyfriend (or two).The hit show was created by Kevin Williamson, who was also behind the Scream franchise and I Know What You Did Last Summer, and has previously described working on the Dawson's Creek as \"a charmed experience\".It followed a group of teenage friends living in the fictional small town of Capeside, Massachusetts, navigating the ups and downs of adolescence.And Dawson Leery - played by James Van Der Beek, who has died aged 48 - was always at the centre of the series, which ran from 1998 to 2003.The aspiring floppy-haired filmmaker could be sensitive but manipulative, loveable yet irritating. And Van Der Beek made the role his own.Getty Images\"The show was built around him,\" Emily Longeretta, director of features at Variety,  told BBC News.\"The creator Kevin Williamson has said many times... that Dawson was based on him [Williamson] and he had to find the right person to do that, and James immediately stepped into that role,\" she added.\"He took this character that was not a jock or the cool kid in high school and... made him loveable, someone that people fall in love with, that was not afraid to be emotional, something that a lot of men on TV, especially young men... it's frowned upon. \"James Van Der Beek was able to do that with such eloquence, his emotional connection and authenticity really came through the screen.\"The show made stars of its key cast, including Dawson's childhood friend and love interest Joey (Katie Holmes), his friend Pacey (Joshua Jackson), new girl in town Jen (Michelle Williams) and Audrey (Busy Philipps).While the series had a very respectable if not huge audience in the US for the time - averaging about six million viewers throughout its run - it was also broadcast in 50 countries, including the UK and Australia, where it enjoyed a cult following. A world away from the glamour of other teen shows such as Beverly Hills 90210, it tackled real-life issues such as loss, grief, sexuality, mental health and heartbreak but in an accessible and gentle way that connected with young viewers.TV critic Scott Bryan told the BBC: \"The show was a breakthrough because it was one of the first that talked to teens like adults. \"It was a show that very much had its heart on its sleeve, with the characters openly talking to each other about their feelings (and their feelings for each other). It didn't look down on its audience, and it featured performances that were more fleshed out than its rivals.\"Indeed, parental figures were very much on the periphery. Joey's mother had died and her father was in prison; Dawson's parents become preoccupied with their divorce; Jen lived with her grandmother and Pacey had a difficult relationship with his alcoholic father.Getty ImagesThe teens were almost precociously self-aware, which admittedly made us roll our eyes at some of the dialogue on occasion.But with few grown-ups available to model emotional literacy, the kids had no choice but to attempt it themselves.The main focus of all the handwringing was, of course, the love triangle between Dawson, Joey and Pacey.Dawson ugly-crying as he \"sets Joey free\" to be with Pacey is still a hugely popular meme. We may have groaned, but, as Anita Singh wrote in the Telegraph on Wednesday: \"It's a testament to Van Der Beek that he maintained the character's popularity and his role at the heart of the series. Nobody wanted this hero to get the girl, but they did want him to be happy.\"Getty ImagesA cast reunion and cancer benefit took place last year; Van Der Beek was too ill to attend but sent a video messageDawson's Creek was also groundbreaking. It featured one of the first gay kisses on primetime US TV - certainly the first between two teenagers - when Jack McPhee (Kerr Smith) and Ethan (Adam Kaufman) locked lips in series three.Television in the 1990s and early Noughties wasn't exactly famed for LGBT inclusion, so the moment when Pacey defended his friend Jack after he was asked by a teacher to read aloud a personal poem he had written about coming out, felt seismic.\"I had taken that whole journey, and I wanted a character on the show to represent that journey and to represent that side of me.\"\"But I'm having a great time,\" he reflected. \"This is what I wanted to do.\"Additional reporting by Kate Moore.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dawson's Creek: The 90s teen drama that 'wore its heart on its sleeve'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f030/live/d3845e50-081c-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-12T14:27:59.000Z",
      "dateModified": "2026-02-12T14:27:59.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump revokes landmark ruling that greenhouse gases endanger public health",
    "url": "https://www.bbc.com/news/articles/cn0zdd7yl4vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/eb9f/live/604a8500-0848-11f1-b5e2-dd58fc65f0f6.jpg",
    "tag": "World",
    "date": "2026-02-12T19:15:27.000Z",
    "description": "1 hour agoMatt McGrathEnvironment correspondentTrump announces rollback of Obama-era greenhouse gas rulingUS President Donald Trump has reversed a key",
    "body": "1 hour agoMatt McGrathEnvironment correspondentTrump announces rollback of Obama-era greenhouse gas rulingUS President Donald Trump has reversed a key Obama-era scientific ruling that underpins all federal actions on curbing planet-warming gases.The so-called 2009 \"endangerment finding\" concluded that a range of greenhouse gases were a threat to public health. It's become the legal bedrock of federal efforts to rein in emissions, especially in vehicles.The White House called the reversal the \"largest deregulation in American history\", saying it would make cars cheaper, bringing down costs for automakers by $2,400 per vehicle.Environmental groups say the move is by far the most significant rollback on climate change yet attempted and are set to challenge it in the courts.John Kerry to BBC: Trump's climate change policy will 'cost lives'Speaking in the Oval Office on Thursday, Trump said the 2009 ruling  was \"a disastrous Obama era policy that severely damaged the American auto industry and massively drove up prices for American consumers\".\"This radical rule became the legal foundation for the Green New Scam, one of the greatest scams in history,\" added the Republican president, about the Democrats' climate agenda.The Environmental Protection Agency (EPA) first took a stance on the impacts of greenhouse gases in 2009, in the first year of President Barack Obama's first term.The agency decided that six key planet-warming greenhouse gases, including carbon dioxide and methane, were a danger to human health.With a divided Congress unable to agree on legislation to tackle rising global temperatures, the EPA finding became central to federal efforts to rein in emissions in the years that followed.\"The endangerment finding has really served as the lynchpin of US regulation of greenhouse gases,\" said Meghan Greenfield, a former EPA and Department of Justice attorney.\"So that includes motor vehicles, but it also includes power plants, the oil and gas sector, methane from landfills, even aircraft. So it really runs the gamut, all of the standards for each of the sectors is premised on this one thing.\"Administration officials are stressing that overturning the regulation will save more than $1tn and will help cut the price of energy and transport.Reversing the finding would reduce automobile manufacturers' spending by $2,400 per vehicle, White House press secretary Karoline Leavitt told reporters.Many environmentalists are sceptical of the potential cost savings being touted by the Trump team. \"It's going to force Americans to spend more money, around $1.4tn in additional fuel costs to power these less efficient and higher polluting vehicles,\" said Peter Zalzal from the Environmental Defense Fund.\"We've also analysed the health impacts and found that the action would result in up to 58,000 additional premature deaths, 37 million more asthma attacks,\" he said.For some in the US car industry there will be uncertainty about the rollback as manufacturing less fuel-efficient vehicles might limit their sales overseas.\"This rollback is sort of cementing things that have already been done, such as the relaxation of the fuel economy standards,\" said Michael Gerrard, a climate law expert from Columbia University.\"But it really does put the US automakers in a bind, because nobody else is going to want to buy American cars.\"ReutersWhile the reversal will help the White House to roll back climate change regulations, there are likely to be unintended consequences, according to some observers.While working on overturning the finding, the Trump administration also utilised the 2009 ruling to prevent states from passing laws that would be stricter on carbon emissions.The fact that the finding gave responsibility for regulating warming gases to a federal authority was also used to suppress what are termed \"nuisance\" lawsuits, brought by individuals or organisations on the climate question.\"The endangerment finding decision has blocked any number of lawsuits, and has been pretty powerful in keeping plaintiffs' claims out of court ,\" said Meghan Greenfield.\"I would expect states and non-profit groups to bring suits, probably primarily in our state courts, to try to figure out where the contours of this new law are.\"ReutersClimate change was linked to the conditions that lead to huge fires in Los Angeles in early 2025Challenging climate science One key argument about the reversal of the endangerment finding will be about the science on which it is based. The Department of Energy formed a panel of scientists to write a report last year challenging widely accepted science on the warming impact of greenhouse gases.That report underpinned the initial proposal to reverse the 2009 finding.But many climate experts complained that the panel behind the report was unrepresentative and filled with people who were sceptical of the human influence on warming, and that it was inaccurate and misleading.While it's not clear how much the Trump administration will rely on this report to face off any challenges, a federal judge recently ruled that the department had violated the law in the formation of the hand-picked team that wrote it.In fact, a challenge in court on the reversal of the endangerment finding may well be what the Trump administration is now looking for.Many legal experts believe that they want the proposal to be tested in the Supreme Court before Trump's term ends, believing that if they win, the endangerment finding will be consigned to history.\"This is really different as the EPA is exiting the space entirely and wants to do it on a permanent basis,\" said Meghan Greenfield.\"If they were to win that issue as they framed it before the Supreme Court, a new presidential administration could not change that position, in the absence of new legislation.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump revokes landmark ruling that greenhouse gases endanger public health",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/eb9f/live/604a8500-0848-11f1-b5e2-dd58fc65f0f6.jpg"
      ],
      "datePublished": "2026-02-12T19:15:27.000Z",
      "dateModified": "2026-02-12T19:15:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Judge blocks US military from demoting Mark Kelly over 'illegal orders' video",
    "url": "https://www.bbc.com/news/articles/cvgk4vl30vko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bd5e/live/19995920-0842-11f1-a418-9d2f92813770.jpg",
    "tag": "World",
    "date": "2026-02-12T20:17:29.000Z",
    "description": "8 minutes agoGrace Eliza GoodwinCQ-Roll Call, Inc via Getty ImagesA federal judge has blocked Secretary of Defence Pete Hegseth from lowering Senator ",
    "body": "8 minutes agoGrace Eliza GoodwinCQ-Roll Call, Inc via Getty ImagesA federal judge has blocked Secretary of Defence Pete Hegseth from lowering Senator Mark Kelly's rank in the military over his urging service members to refuse illegal orders. US District Judge Richard Leon wrote in a scathing ruling that Hegseth had unconstitutionally retaliated against Kelly in seeking to demote the retired Navy captain.In a post on social media, Hegseth said the judge's order would be \"immediately appealed\".It is another setback in the Trump administration's fight against Kelly and five other lawmakers who published a video encouraging troops to disobey orders they deemed illegal. A grand jury this week declined to bring charges of seditious conspiracy against them.Reducing Kelly's rank could lead to a major cut in his retirement pay.Kelly, who is also a former astronaut, sued the government in January, naming Hegseth as the defendant. He argued that Hegseth had illegally tried to demote him in retaliation for criticising the Trump administration. He asked the judge to block the demotion with a temporary injunction while his lawsuit proceeded.The federal government had argued Kelly should contest the case against him through a military process and not in a civilian court of law, but in Thursday's decision, Judge Leon wrote: \"I disagree.\"Leon wrote that while service members have more limited free speech protections than civilians under the US Constitution's first amendment, no court has ever extended those limits to retired service members.\"This Court has all it needs to conclude that Defendants have trampled on Senator Kelly's First Amendment freedoms and threatened the constitutional liberties of millions of military retirees,\" he wrote. \"To say the least, our retired veterans deserve more respect from their Government, and our Constitution demands they receive it!\"Soon after the judge issued the temporary injunction, Hegseth posted on X: \"This will be immediately appealed. Sedition is sedition, 'Captain.'\"In the video, the Democrats say: \"This administration is pitting our uniformed military and intelligence community professionals against American citizens.\"Kelly appears alongside Michigan Senator Elissa Slotkin and US Representatives Chris Deluzio, Maggie Goodlander, Chrissy Houlahan and Jason Crow, all of whom served in military or intelligence agencies.\"Our laws are clear,\" he says. \"You can refuse illegal orders.\"After the video was released, Trump posted on social media that the members of Congress should be arrested and put on trial. Labeling the video seditious behaviour, he posted: \"PUNISHABLE BY DEATH!\"Trump later clarified to Fox News: \"I'm not threatening death, but I think they're in serious trouble.\"Federal prosecutors then began criminal investigations into the lawmakers and sought to indict them on charges of seditious conspiracy. But a grand jury, which decides if a case can stand up on court, declined to approve the charges.Meanwhile, Hegseth announced he would open retirement-grade determination proceedings against Kelly and issue a formal letter of censure. He described Kelly's comments as \"seditious in nature\" and a violation of the Uniform Code of Military Justice.In his decision, which contained more exclamation marks than are typical in judicial writings, Leon wrote: \"Rather than trying to shrink the First Amendment liberties of retired servicemembers, Secretary Hegseth and his fellow Defendants might reflect and be grateful for the wisdom and expertise that retired servicemembers have brought to public discussions and debate on military matters in our Nation over the past 250 years.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Judge blocks US military from demoting Mark Kelly over 'illegal orders' video",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bd5e/live/19995920-0842-11f1-a418-9d2f92813770.jpg"
      ],
      "datePublished": "2026-02-12T20:17:29.000Z",
      "dateModified": "2026-02-12T20:17:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Norway's former PM Jagland charged with gross corruption over Epstein links",
    "url": "https://www.bbc.com/news/articles/c5yqr8eggvwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e2b4/live/e3f1b0d0-081c-11f1-8fdd-d9a354700c27.jpg",
    "tag": "World",
    "date": "2026-02-12T16:37:32.000Z",
    "description": "4 hours agoAlicia CurryNurPhoto via Getty ImagesThorbjørn Jagland's lawyer has previously said he denies criminal liability and is willing to cooperat",
    "body": "4 hours agoAlicia CurryNurPhoto via Getty ImagesThorbjørn Jagland's lawyer has previously said he denies criminal liability and is willing to cooperateFormer Norwegian Prime Minister Thorbjørn Jagland has been charged with \"gross corruption\" over his ties with the US sex offender Jeffrey Epstein, police have said.The charge was brought after the Council of Europe lifted Jagland's immunity, which he enjoyed because of his past diplomatic role. He denies criminal liability and is willing to cooperate, his lawyer says.Emails released by the US government are thought to show that Jagland planned solo and family visits to Epstein's homes in Paris, New York and Palm Beach after the billionaire was convicted of a child sex offence.Three of Jagland's properties were searched by Norwegian crime unit Økokrim and he is now expected to be questioned.As well as serving as prime minister from 1996 to 1997, Jagland is also a former head of the Norwegian Nobel Committee and spent a decade as secretary general of the Council of Europe.Jagland had diplomatic immunity from heading the Council, Europe's watchdog for democracy and human rights, for alleged acts carried out during his 2009 to 2019 tenure.The so-called Epstein files appear to show instances where the late financier covered the travel expenses to his properties for Jagland and his family.The former leader had planned a family trip to Epstein's private Caribbean island in 2014, but it was ultimately cancelled after Epstein fell ill. Jagland also faces allegations that he solicited Epstein's help in obtaining a bank loan in another exchange, although it is not clear whether this materialised, according to Norwegian broadcaster NRK. Police have not confirmed whether this allegation is part of the gross corruption charge.Mention in the Epstein files - which have been released by the US Department of Justice (DOJ) - does not indicate any wrongdoing. Jagland was seen walking out of his home alongside his lawyer in Oslo on Thursday, one of the properties - alongside two in Risør and Rauland - that Økokrim confirmed it had searched. Politicians, celebrities and royals have been caught up in the turmoil after the US DOJ published the latest tranche of files last month, containing millions of private emails, images and FBI reports into the late sex offender - who died in 2019 while awaiting trial for sex trafficking. The Nordic country has seen several public figures drawn into the widening scandal, including Crown Princess Mette-Marit, diplomats Mona Juul and Terje Rød-Larsen, and chief executive of the World Economic Forum (WEF), Borge Brende.Juul's lawyer has said she \"does not recognise the accusations made against her\" and Rød-Larsen's lawyer said he is confident the investigation will clarify \"there is no basis for criminal liability\".The WEF ordered an independent review into Brende - who also served as the Norwegian foreign minister - over his interactions with the paedophile.Brende has acknowledged dining with Epstein three times in 2018 and 2019 and communicating with him by email and text, but said he was \"completely unaware\" of his past criminal activity. He added that he welcomes the WEF's decision to launch a review.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Norway's former PM Jagland charged with gross corruption over Epstein links",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e2b4/live/e3f1b0d0-081c-11f1-8fdd-d9a354700c27.jpg"
      ],
      "datePublished": "2026-02-12T16:37:32.000Z",
      "dateModified": "2026-02-12T16:37:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kenya-Somalia border to re-open after nearly 15 years, William Ruto says",
    "url": "https://www.bbc.com/news/articles/c70k4yw049yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c1a4/live/f00d12b0-083a-11f1-a418-9d2f92813770.jpg",
    "tag": "World",
    "date": "2026-02-12T18:34:31.000Z",
    "description": "Kenya's border with Somalia set to re-open after almost 15 years2 hours agoRichard KagoeNairobiWashington Post via Getty ImagesPresident William Ruto ",
    "body": "Kenya's border with Somalia set to re-open after almost 15 years2 hours agoRichard KagoeNairobiWashington Post via Getty ImagesPresident William Ruto said that safety would not be compromised by the re-openingKenya's border with Somalia will re-open in April almost 15 years after it shut because of attacks by Islamist militant group al-Shabab, President William Ruto has announced.Based in Somalia, the group has masterminded a series of deadly assaults in Kenya including one on a shopping centre in the capital, Nairobi, killing 67 people in 2013 and one at a university in Garissa two years later killing 148.The plan has been announced before, in 2023, but further attacks postponed the arrangements.Ruto said the intention to re-open two crossings follows years of security assessments, adding that there will be a heavy deployment of security forces to ensure the move does not compromise safety. Kenya has also been concerned about illicit weapons and other contraband goods being smuggled across the border.The president announced the plan on a visit to the border town of Mandera, in Kenya's far north-east, which has a large population of ethnic Somalis.\"It is unacceptable that fellow Kenyans in Mandera remain cut off from their kin and neighbours in Somalia due to the prolonged closure of the Mandera Border Post,\" Ruto posted on X.He hoped that the re-opening would boost \"cross-border trade for the mutual prosperity of our people\".In a speech, he asked all residents of Mandera, which has been targeted several times, to \"join in the battle against al-Shabab. These al-Shabab are useless, I want to assure that Kenya will work together with you, just help us combat these criminals and terrorists.\"In addition to the attack on the Westgate mall and Garissa University, other major al-Shabab attacks in Kenya include the killing of 28 bus passengers in Mandera county in 2014 and an assault on a hotel in Nairobi five years later which left at least 21 people dead.In 2015, Kenya had embarked on building a perimeter barrier along the countries' 680km (423-mile) common border because of the militant threat but the project was suspended after nearly three years when only 10km (6 miles) of a wire fence had been built at a cost of $35m (£26m).You may also be interested in:Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kenya-Somalia border to re-open after nearly 15 years, William Ruto says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c1a4/live/f00d12b0-083a-11f1-a418-9d2f92813770.jpg"
      ],
      "datePublished": "2026-02-12T18:34:31.000Z",
      "dateModified": "2026-02-12T18:34:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Minneapolis immigration enforcement operation to 'conclude', officials say",
    "url": "https://www.bbc.com/news/articles/c2lr9w29zwyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b6e8/live/17a22a90-0822-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "World",
    "date": "2026-02-12T19:47:08.000Z",
    "description": "Minnesota immigration enforcement surge is ending, Trump border tsar says38 minutes agoBrandon DrenonUS border tsar: Minneapolis immigration enforceme",
    "body": "Minnesota immigration enforcement surge is ending, Trump border tsar says38 minutes agoBrandon DrenonUS border tsar: Minneapolis immigration enforcement surge endingThe US immigration enforcement surge in Minnesota will end, President Donald Trump's border tsar told reporters on Thursday.Tom Homan said Trump had approved his request to conclude the operation, adding he would stay in Minnesota \"a little longer to oversee the drawdown, to ensure its success\". Homan said Operation Metro Surge had resulted in many illegal immigrants who had committed violent crimes being detained for deportation. But the surge also sparked nationwide protests when two US citizens, Renee Good and Alex Pretti, were killed by immigration officers.After the news conference, top Minnesota and federal officials appeared at a Capitol Hill hearing on Trump's immigration crackdown.Officials in Minnesota have been able to \"greatly reduce the number of targets\" for immigration enforcement, Homan said, adding that Operation Metro Surge was a \"great success\".More than 4,000 undocumented immigrants had been arrested, according to Homan, including men he said were convicted of rape and other sexual misconduct. Homan said Immigration and Customs Enforcement (ICE) has always had a presence in Minnesota and will continue to have one. He said that the surge's end came after an unprecedented level of cooperation between federal agents and local law enforcement, with local officials increasing their crackdown on protesters he called public safety threats and local jails more willing to notify ICE of the release dates for individuals it was seeking.Minnesota Governor Tim Walz said at a news conference following Homan's announcement that he was \"cautiously optimistic\" about the drawdown of federal agents. \"The fact of the matter is they left us with deep damage, generational trauma,\" Walz said. \"They left us with economic ruin in some cases. They left us with many unanswered questions.\"The governor is expected to soon propose a $10m (£7m) emergency fund for small businesses who say they were financially hurt by the surge.Following the fatal shooting of Alex Pretti last month, President Donald Trump dispatched Homan to Minneapolis to oversee the surge, sidelining the operation's leader, Greg Bovino, who had faced intense criticism for ICE's use of force and what many in the city alleged were civil rights violations.Trump's immigration crackdown has faced resistance in Democrat-led cities like Minneapolis from activists in the streets and local officials and immigrants in the courts. The administration last month finished removing National Guard troops from Portland, Los Angeles and Chicago - places where there had been large protests against the presence of troops and immigration agents - according to US Northern Command.Some Republicans, too, had questioned the Minneapolis operation.Senator Rand Paul told a committee hearing with Department of Homeland Security (DHS) officials on Thursday that \"saying we're going to reduce this presence in the street is a good sign and a good step forward\".\"I'm glad that's happening,\" the Republican from Kentucky said. \"I think that is de-escalation.\"ICE Acting Director Todd Lyons said at the hearing that the agency is tracking roughly 1.6 million undocumented immigrants with deportation orders in the US, including roughly 800,000 who have criminal convictions.He also defended against accusations from lawmakers that the agency was not holding officers accountable, saying ICE had launched 37 open investigations for excessive use of force since January 2025.The fight over how immigration agents operate has now put the federal government at risk of a partial shutdown as Congress debates a funding measure for the DHS, which includes ICE. On Thursday, the US Senate failed to advance a bill on new funding for the department. Earlier this month, lawmakers approved DHS funding for two weeks and had planned to use that time to negotiate a substantive deal. But with no agreement in sight and the upper chamber set to go on break, DHS could lose its funding starting Saturday. That will affect a variety of services, including transportation security at US airports and responses to disasters and large-scale emergencies. Last year, lawmakers passed legislation creating a separate pool of funding that should allow ICE to continue to operate.Democrats are demanding changes in ICE - such as ending the wearing of masks - in exchange for support for the bill. They are also pushing for immigration agents in Minnesota and elsewhere to be required to reveal their identities and to end warrant-less searches.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Minneapolis immigration enforcement operation to 'conclude', officials say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b6e8/live/17a22a90-0822-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-12T19:47:08.000Z",
      "dateModified": "2026-02-12T19:47:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kim Ju Ae: North Korea leader Kim Jong Un chooses daughter as heir, Seoul says",
    "url": "https://www.bbc.com/news/articles/cn0e1g7kwglo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/067d/live/2e248500-0805-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "World",
    "date": "2026-02-12T11:10:55.000Z",
    "description": "9 hours agoJake KwonSeoul correspondentWatch: See Kim Ju Ae, the only known child of Kim Jong Un, attend events with her father over the yearsNorth Ko",
    "body": "9 hours agoJake KwonSeoul correspondentWatch: See Kim Ju Ae, the only known child of Kim Jong Un, attend events with her father over the yearsNorth Korean leader Kim Jong Un has selected his daughter as his heir, South Korea's spy agency told lawmakers on Thursday. Kim Ju Ae - who is believed to be 13 - has in recent months been pictured beside her father in high-profile events like a visit to Beijing in September, her first known trip abroad. The National Intelligence Service (NIS) said it took a \"range of circumstances\" into account including her increasingly prominent public presence at official events\" in making this assessment.The NIS also said it would keep close tabs on whether she will attend the North's party congress later this month - its largest political event that is held once every five years.The party Congress is where Pyongyang is expected to give more details about priorities like foreign policy, war planning and nuclear ambitions for the next five years.On Thursday lawmaker Lee Seong-kwen told reporters that Ju Ae, who was previously described by the NIS as being \"trained\" to be a successor, was now at the stage of \"successor designation\". \"As Kim Ju Ae has shown her presence at various events, including the founding anniversary of the Korean People's Army and her visit to the Kumsusan Palace of the Sun, and signs have been detected of her voicing her opinion on certain state policies, the NIS believes she has now entered the stage of being designated as successor,\" Lee said.Ju Ae is the only known child of Kim Jong Un and his wife, Ri Sol Ju. The NIS believes Kim Jong Un has an older son, but this son has never been acknowledged nor shown on North Korean media.News of Ju Ae's existence first emerged through an unlikely source: the American basketball player Dennis Rodman, who revealed to The Guardian newspaper back in 2013 that he \"held baby Ju Ae\" during a trip to the secretive state.Ju Ae made her first appearance on state television in 2022. She was shown inspecting North Korea's latest intercontinental ballistic missile while holding her father's hand. She has since made frequent appearances on state media, softening her father's image of a ruthless dictator.  She accompanied him to Beijing for China's largest-ever military parade, where she was seen stepping off his armoured train at Beijing Railway Station.She is often seen wearing her hair long, which is forbidden for her peers, and wearing designer clothes, which are out of reach for most in her country.Another lawmaker, Park Sun-won said the role Ju Ae had taken on during public events indicated that she has started to provide policy input and is being treated as the de facto second-highest leader. The North Korean power had passed down the three generations of the Kim family, and it is widely believed that Kim Jong Un will pass on the throne to Ju Ae.In recent months, she was shown standing taller than her father, walking beside him, rather than following him. In North Korea, where photos published by the state media are believed to carry a great symbolic weight, it is rare for individuals other than Kim Jong Un to be positioned equally prominently in the frame.EPAAlthough the South Korean spy agency now believes Ju Ae is the designated heir, it still raises questions.It is puzzling why Ju Ae, a daughter, would be selected as the heir above an older son in North Korea's deeply patriarchal society. Many defectors and analysts had previously dismissed the idea of a woman leading North Korea as an unlikely scenario, referring to the country's entrenched traditional gender roles. But Kim Jong Un's sister - Kim Yo Jong - does offer a precedent for female authority in the regime.Kim Yo Jong currently holds a senior position in the Central Committee of the Workers' Party of Korea, and is reported to have influence over her brother.However, it is also a mystery why Kim Jong Un, who is still young and appears relatively healthy, is already designating a 13-year-old child as his heir now.It is unclear what changes Ju Ae's succession may bring to North Korea. Many North Koreans hoped that Kim Jong Un, a Western-educated young man, would open their country up to the outside when he succeeded his father. Yet such hope was unfulfilled. Whatever plans this teenager may have for her country, she would likely have the singular power to shape it however she likes.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kim Ju Ae: North Korea leader Kim Jong Un chooses daughter as heir, Seoul says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/067d/live/2e248500-0805-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-12T11:10:55.000Z",
      "dateModified": "2026-02-12T11:10:55.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'It was terrifying': Tumbler Ridge's tight-knit community in shock after shooting",
    "url": "https://www.bbc.com/news/articles/cddn078mnn5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ccb8/live/f3461b10-07e1-11f1-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-11T18:39:23.000Z",
    "description": "1 day agoRobert GreenallandGabriela PomeroyWatch: How the Tumbler Ridge school shooting unfoldedPeople in the small Canadian town of Tumbler Ridge hav",
    "body": "1 day agoRobert GreenallandGabriela PomeroyWatch: How the Tumbler Ridge school shooting unfoldedPeople in the small Canadian town of Tumbler Ridge have reacted with shock and disbelief after nine people were killed and at least 25 wounded in a shooting at a local secondary school and home. Members of the remote community, 415 miles (667 km) northeast of the western city of Vancouver, spoke of their fear and uncertainty during the school lockdown, as no-one appeared to be aware of the magnitude of what was unfolding. They described how close the community of just 2500 people was, and how devastated it would be by what had happened.\"I will know every victim. I've been here 19 years, and we're a small community,\" town mayor Darryl Krakowka told Canadian broadcaster CBC.\"I don't call them residents. I call them family,\" he added. REUTERS/Jennifer GauthierMourners held a candlelit vigil for the victims of the shootingChris Norbury, a town councillor, was as close as anyone in Tumbler Ridge to the shooting. His wife teaches at the secondary school, his daughter attends the nearby elementary school and he works at the visitor centre just a block away.Speaking to the BBC World Service's Newsday programme, he explained how scared and anxious he felt as he waited for news of his wife.He first realised something was wrong when his daughter's school called him to say they were in lockdown. He was able to contact his wife, who was also under lockdown, but by the time he found out  - from an emergency alert - that there was an active shooter, he was unable to contact her again.\"We just had to speculate and jump into social media to see what was going on - there was a lot of speculation... but being who I am I just wanted to stay calm as best I could and wait for the facts,\" Norbury said.That proved far from easy, though.\"It was terrifying, it's hard to put into words the dread and the fear that you feel knowing that a loved one is in danger,\" he said.Meanwhile he was able to see emergency vehicles, including helicopters, coming and going from the school and a nearby medical centre.That feeling of helplessness and of not knowing what was happening was felt by those within the school too.Bryan Castellarin told the BBC his 15-year-old son Ashton was there while the shooting took place.Ashton and his friends were busy studying in their classroom when \"all of a sudden they heard gunshots going off,\" Castellarin said.\"They were huddled in a corner of the classroom for two to three hours. It felt a lot lot longer.Some of the students were \"really freaking out and crying,\" Bryan said. \"My son was trying to console them. He tried to stay as calm as he could, but he is pretty shaken up, and he is scared... He didn't know where the gunshots were coming from.\"Ashton told his dad it was a terrifying experience, and they didn't know what was going on. Luckily he was unharmed, but he is still waiting to hear information about some of his friends.\"I'm just so thankful that I didn't have to bury my kid,\" Bryan said.'Disturbing' photosDarian Quist, a grade 12 student at the school, was in a classroom with a teacher and about 15 students when the lockdown alarm sounded, though he believes he was in a different part of the school from the shooting. He and his classmates stayed there until the police escorted them out.\"For a while I didn't think anything was going on, but once everything was circulating and we realised something was wrong we got tables and barricaded the doors, and I believe we sat in there for two or two-and-a-half hours,\" he told CBC.He said everyone was tense and nervous. People sent him \"disturbing\" photos, he said, with \"blood and things like that\".\"I think that's when it all set in,\" he said.His mother Shelley Quist was working at the local hospital at the time. She said they only found out about the shooter half an hour after the lockdown - though she was on the phone with her son the whole time.\"It's just one of those things when you just think it's never going to happen,\" she said, adding: \"Panic was setting in until I laid eyes on [Darian].\"Norbury said that it wasn't until after 17:00 local time - three-and-a-half hours after the lockdown was first announced - that people started to be released from the school and he was able to find out that his wife was safe.Quist described the departure as \"organised chaos\". \"Professionalism definitely took hold,\" he said.But even then those involved did not know the full extent of what had happened until the casualty figures were revealed.\"A lot of people are shaken up right now, especially when we were told the true numbers,\" Darian Quist said.Though the names of the victims have not yet been released, it is clear the whole town has been deeply affected.Are you in Tumbler Ridge? Share your experiences hereNorbury said he believed he may have known some of the children involved.\"I was a children's librarian for 10 years, and knowing that these children that I likely knew, that I likely read to... these are our friends, our friends' children have been injured, lost their life, and we just have to think how to come together as a community and rely upon each other for support,\" he said.He added: \"Crime is incredibly low here, we've never had anything like this before. It's an incredible shock that anything like this could happen. We're such a tight-knit community, we're really like a family here.\"Norbury also reflected on the effect the shooting would have on the community in the future.\"How many people will be afraid to go to school? How many will this affect for the rest of their lives? And it absolutely will, that's my fear,\" he said. \"If I could talk to those people, I'd say, don't let this define you. Please get help when you need help. We are strong and we are resilient and we will get through this\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'It was terrifying': Tumbler Ridge's tight-knit community in shock after shooting",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ccb8/live/f3461b10-07e1-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-11T18:39:23.000Z",
      "dateModified": "2026-02-11T18:39:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Russia orders block on WhatsApp in messaging app crackdown",
    "url": "https://www.bbc.com/news/articles/clygd10pg5lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/19fb/live/1357d0f0-07c5-11f1-a698-917cc58bf039.jpg",
    "tag": "World",
    "date": "2026-02-12T10:15:47.000Z",
    "description": "10 hours agoOsmond Chia,Business reporterandBen Tavener,in MoscowGetty ImagesRussian regulators are pushing a state-developed app as an alternative to",
    "body": "10 hours agoOsmond Chia,Business reporterandBen Tavener,in MoscowGetty ImagesRussian regulators are pushing a state-developed app as an alternative to WhatsAppRussia has ordered a block on WhatsApp, as the Kremlin continues to tighten restrictions on messaging apps.Meta-owned WhatsApp said the move aimed to push more than 100 million of its app users in Russia to a \"state-owned surveillance app\".Kremlin spokesman Dmitry Peskov told the BBC that the decision had been made \"due to [Meta's] unwillingness to comply with the norms and the letter of Russian law\". He has said Meta could resume operations if it \"complies with [the law] and enters into dialogue\".Asked whether authorities were trying to force Russians to use the state-developed Max app, Peskov said the \"national messenger [is an] available alternative\" for Russians.Russian internet regulator Roskomnadzor said this week it was further curbing access to messaging app Telegram as well, citing a lack of security. Telegram is highly popular in Russia and said to be widely used by its forces in Ukraine.Pro-war bloggers have complained that the move was hampering communications on the ground.Even before the full-scale invasion of Ukraine in 2022, Russian authorities had begun work on creating a domestic alternative to the global internet. Those moves have gathered pace during the war, along with a push towards state-backed platform called Max.Critics have alleged Max could be used for surveillance by the Russian authorities, though state media have denied that. Max is now being promoted widely inside Russia, through TV advertisements and billboards, by local officials and by the media.Russia has argued that both WhatsApp and Telegram have refused to store Russian users' data in the country as required by law. Authorities in Moscow also allege that WhatsApp is one of the main services used to defraud and extort money from Russians - a reason they cite for people to migrate to the Max app.WhatsApp said it was doing everything it could to keep people connected. \"Trying to isolate over 100 million users from private and secure communication is a backwards step and can only lead to less safety for people in Russia,\" it said in a statement.State-run news agency Tass reported earlier this year that WhatsApp was expected to be permanently blocked in the country in 2026.\"Such harsh measures\" are \"absolutely justified\" since Russia has designated Meta as an extremist organisation, Andrei Svintsov, a Russian official, was quoted as saying.WhatsApp was previously Russia's most popular messaging service, but since Meta was labelled as extremist in 2022, its apps such as Instagram and Facebook have been blocked in Russia and are only accessible through virtual private networks (VPNs). Russians are not banned from using its products.Digital rights project Na Svyazi (In Touch) has reported that Russia has increasingly been removing websites from the state-run internet address directory, which is controlled by Roskomnadzor.It said that 13 popular resources were now missing from the National System of Domain Names (NSDI), including YouTube, Facebook, WhatsApp web, Instagram, the BBC and Deutsche Welle. Once an entry is removed, the site does not open without a virtual private network (VPN).The app has been likened to China's WeChat - a so-called \"super app\" that combines messaging and government services.Since 2025, the authorities have mandated that the Max app be pre-installed on all new devices sold in the country. There have been reports of public sector employees, teachers and students being increasingly required to use the platform.Telegram's chief executive, Russian-born businessman Pavel Durov, said the state was restricting access to its service in an attempt to force its people to use its own app for surveillance and political censorship.Iran has tried a similar strategy to ban Telegram and push its people to a state-run alternative, but citizens have found ways to work around this, he wrote online.\"Restricting citizens' freedom is never the right answer,\" said Durov.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Russia orders block on WhatsApp in messaging app crackdown",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/19fb/live/1357d0f0-07c5-11f1-a698-917cc58bf039.jpg"
      ],
      "datePublished": "2026-02-12T10:15:47.000Z",
      "dateModified": "2026-02-12T10:15:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bangladesh election: Polls close in first vote since Gen Z protests ousted former PM Sheikh Hasina",
    "url": "https://www.bbc.com/news/articles/cy7jdmvn3l0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0249/live/85b65510-07ff-11f1-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-12T13:15:35.000Z",
    "description": "7 hours agoSimon Fraser,Asia digital editor, LondonandYogita Limaye,South Asia and Afghanistan correspondent, DhakaReutersVotes are being counted in B",
    "body": "7 hours agoSimon Fraser,Asia digital editor, LondonandYogita Limaye,South Asia and Afghanistan correspondent, DhakaReutersVotes are being counted in Bangladesh after its first election since student-led protests ousted prime minister Sheikh Hasina in 2024.More than 2,000 candidates are vying for 350 seats in parliament, though none from the banned Awami League of Hasina, who fled after 15 years in power after a brutal security crackdown in which hundreds of protesters were killed.The election pits the centre-right Bangladesh Nationalist Party (BNP) against a coalition led by the Islamist Jamaat-e-Islami, which joined forces with a party born out of the student uprising.Results are expected on Friday and there's widespread hope among voters of a return to democracy. For the first time since 2008, the outcome of an election in Bangladesh cannot be predicted with certainty. The past few elections were widely condemned as systematically rigged in favour of Sheikh Hasina. Hasina is in exile in India from where she's rejected the charges against her and has questioned the legitimacy of the election.The ban on her Awami League contesting the polls casts a shadow over whether this election can be described as free and fair. But, for the first time in years, voters on the ground were telling the BBC they feel like they have a choice.More than 120 million people were eligible to vote, about four in 10 of them under 37. They were also casting their ballots in a referendum on constitutional change, which was proposed by the interim government that replaced Hasina and is aimed at fixing what it has called a completely broken political system.Speaking after voting, Bangladesh's interim leader - the Nobel Peace Price laureate Muhammad Yunus - said the country had \"ended the nightmare and begun a new dream\".Turnout had reached 49% by 14:00 local time (08:00 GMT), the Ministry of Information and Broadcasting told the BBC. Nearly a million police and soldiers have been deployed to maintain law and order.Yunus voted in the capital Dhaka, as did the two leading candidates, Tarique Rahman, 60, for the BNP, and Jamaat's leader Shafiqur Rahman, 67.Before casting his ballot, Rahman said he was feeling \"confident\" about how the election would play out. He told the BBC he'd been waiting \"more than a decade\" for this day. He has criticised Jamaat for using religious sentiment to win votes, and is promising economic and democratic reforms, as well as a \"rainbow nation\", where a new \"National Reconciliation Commission\" would help the country move past its divisions.Hardly any voters were seen at polling stations in the former Awami League stronghold of GopalganjThe son of the late Khaleda Zia, Bangladesh's first female prime minister, Rahman is a product of dynastic politics many reformers would like to change. Zia herself came to power after her husband, a former president, was assassinated in a military coup.Both the BNP - the Awami League's long-time rival - and Jamaat-e-Islami have a long history in Bangladesh, and both were crushed along with other opponents of Hasina under her long rule.Rahman, who lived in London during the Hasina years, may be tipped as front-runner for prime minister, but Jamaat is expected to mount a serious challenge.On two previous occasions - in the 1990s and the early 2000s - Jamaat has been a junior partner in a coalition led by the BNP in constitutionally-secular Bangladesh.But, with the Awami League absent, Jamaat is for the first time a major player on the ballot - though it's chances of winning are seen by most observers as slim. Shafiqur Rahman, a former political prisoner, and his party have run a well organised grassroots campaign on a platform of justice and ending corruption. They are also not associated with dynastic politics. Jamaat gained momentum of its own in the run-up to the vote, and many of its new supporters believe it has modernised. But many female voters feel sidelined, despite the fact women played a leading role in the uprising.Of the 30 candidates Jamaat is allowing the student-led National Citizen Party (NCP) to field, only two are women. Jamaat is fielding more than 200 candidates, all of them men. The BNP fielded 10 women out of more than 250 candidates.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bangladesh election: Polls close in first vote since Gen Z protests ousted former PM Sheikh Hasina",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0249/live/85b65510-07ff-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-12T13:15:35.000Z",
      "dateModified": "2026-02-12T13:15:35.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Watch: Three issues that matter to voters in the Bangladesh election",
    "url": "https://www.bbc.com/news/videos/c2047rm71npo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e222/live/e56f1360-07ab-11f1-b5e2-dd58fc65f0f6.jpg",
    "tag": "World",
    "date": "2026-02-12T01:04:51.000Z",
    "description": "BBC reports from outside court after Jimmy Lai sentencingThe pro-democracy media tycoon was sentenced to 20 years in jail by the Hong Kong High Court.",
    "body": "BBC reports from outside court after Jimmy Lai sentencingThe pro-democracy media tycoon was sentenced to 20 years in jail by the Hong Kong High Court.AsiaAt the scene of deadly Pakistan mosque explosion At least 31 people have been killed after a suicide bomber detonated a device at a Shia mosque, according to police.AsiaWatch: CCTV captures moment mayor hit in rocket launcher attack in the PhilippinesA mayor in the Philippines has survived a rocket launcher attack on his vehicle in broad daylight.Asia'Grim scene': BBC on site after crane collapses on train in ThailandCorrespondent Jonathan Head says the 'devastating' accident is an enormous setback for Thailand's efforts to modernise its infrastructure.AsiaWatch: BBC reports from scene of deadly Goa nightclub fireIndia Editor Vikas Pandey visits the Indian nightclub where 25 people were killed in a blaze.AsiaVideo shows speed fire spreads in Hong Kong tower blockFootage geolocated by BBC Verify show the blaze taking hold in Wang Cheong House.AsiaWatch: Indonesia's Semeru volcano spews giant ash clouds as it eruptsJava Island’s tallest mountain, a volcano called Mount Semeru, has spewed tall plumes of ash clouds that engulfed bridges and the surrounding countryside.AsiaPakistan: Suicide attack outside Islamabad court kills 12 At least 12 people have been killed after a suicide attack outside a court in Islamabad on TuesdayAsiaPhilippines typhoon aftermath: 'Water levels are rising fast'A weakened Typhoon Fung-wong is now passing over the South China Sea, after leaving two people dead in the Philippines.AsiaWaves smash Philippines coastline as typhoon hitsFootage from 9 November shows swells from Typhoon Fung-wong surging over houses and palm trees.AsiaShipping containers swept away in deadly Philippines floods At least three people have died, officials say. Residents sought shelter from high water on rooftops.AsiaWoman saved after slipping while boarding a moving trainVideo released by India’s Southern Railways shows the moment a woman nearly fell in between a moving train and a station platform.AsiaTrump imitates India's PM Narendra Modi in South KoreaTrump impersonated Modi while recalling his conversations from the May India-Pakistan conflictAsiaHas Trump's 'peace deal' solved the Thailand-Cambodia dispute?Donald Trump has claimed to have ended another war, this time between Thailand and Cambodia. But what does this latest agreement actually amount to?AsiaTrump in Malaysia: Dancing and a 'peace deal'US President Donald Trump in Malaysia: Dancing and a 'peace deal'AsiaMillions of Diwali lamps light up Indian town to set new world recordA record 2.6 million earthen lamps were lit on Sunday in Ayodhya, Uttar Pradesh.AsiaWatch: North Korea shows off huge missile at military paradeNamed the Hwasong-20, its size suggests that it could carry multiple nuclear warheads.AsiaHow South Korea is using a holographic cop to fight crime A life-sized holographic police officer has been installed in central Seoul in a bid to deter crime. The BBC took to the streets to ask people if they think it’ll work.AsiaWatch: Race to reach hikers stranded by Mount Everest blizzardChinese state media reports say around 350 people have been rescued and efforts are under way to reach more than 200 others.Asia'It's safe now': See students pulled from rubble of collapsed Indonesian schoolDramatic rescue footage shows the boys in Indonesia pulled to safety after their school collapsed.\nAsia",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Watch: Three issues that matter to voters in the Bangladesh election",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e222/live/e56f1360-07ab-11f1-b5e2-dd58fc65f0f6.jpg"
      ],
      "datePublished": "2026-02-12T01:04:51.000Z",
      "dateModified": "2026-02-12T01:04:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "North Korea: Who is Kim Ju Ae, the daughter who may succeed Kim Jong Un?",
    "url": "https://www.bbc.com/news/articles/cvgvgj7ejqdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/30dc/live/2b05ab20-8848-11f0-b391-6936825093bd.jpg",
    "tag": "World",
    "date": "2026-02-12T16:00:09.000Z",
    "description": "What do we know about Kim Jong Un's daughter - and expected successor?4 hours agoFlora DruryBBC NewsWatch: Moment Kim Jong Un's daughter arrives in Be",
    "body": "What do we know about Kim Jong Un's daughter - and expected successor?4 hours agoFlora DruryBBC NewsWatch: Moment Kim Jong Un's daughter arrives in Beijing in September 2025Kim Jong Un's arrival in China for his first ever multilateral meeting was always going to make headlines.But it was the smartly-dressed girl standing just behind him as he exited his armoured train last September which caught Korea watchers' attention: Kim Ju Ae, the North Korean leader's daughter.But details - including her exact age - are thin on the ground. So what exactly do we know?KCNAThe visit was Kim Ju Ae's first foreign trip with her father - she can be seen in the far right of this imageMiss Kim has, for a number of years, been believed to be the second of Kim Jong Un's and his wife, Ri Sol-Ju's, three children. The exact number, and their order, is by no means certain, however Kim is very secretive about his family, only introducing his wife to the public after they had been married for some time.Kim Ju Ae is their only child whose existence has been confirmed by the country's leadership. No other child has been seen in public.KCNAKim Ju Ae (seen here in 2023) has become a regular at military parades in North Korea in the last couple of yearsLittle was then heard about her until November 2022, when she appeared alongside her father at the launch of an intercontinental ballistic missile (ICBM).By February the next year, she was appearing on postage stamps and attending banquets for top officials - described as Kim Jong Un's \"respected\" daughter.The adjective \"respected\" is reserved for North Korea's most revered. In her father's case, he was referred to as \"respected comrade\" only after his status as future leader was cemented.KCNAKim Ju Ae appeared with her father at the opening of the Wonsan tourist resort last June South Korea's National Intelligence Service (NIS) provided lawmakers with a few extra details on the little girl at around the same time, according to news agency AP.They said she enjoyed horse riding, skiing and swimming, and was home-schooled in the capital Pyongyang. They suggested she was around 10 years old.By January 2024, the NIS had come to another conclusion: that the little girl was the \"most likely\" successor to Kim Jong Un - although they noted there were \"many variables\" still in play, not least because of her father's young age.Since then, she has appeared by her father's side on numerous occasions. Standing next to him at ICBM launches and military parades, she has taken centre stage and received military salutes from senior military commanders.But September 2025 marked the first time she was seen outside North Korea.The Kim family, who have ruled North Korea since 1948, tell citizens they hail from a sacred bloodline, meaning only they can lead the country.However, there is speculation that Kim has introduced his daughter at this point to try to overcome prejudice in the deeply patriarchal state, which has never been led by a woman.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "North Korea: Who is Kim Ju Ae, the daughter who may succeed Kim Jong Un?",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/30dc/live/2b05ab20-8848-11f0-b391-6936825093bd.jpg"
      ],
      "datePublished": "2026-02-12T16:00:09.000Z",
      "dateModified": "2026-02-12T16:00:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "James Van Der Beek: Dawson's Creek stars Katie Holmes and Busy Philipps lead tributes",
    "url": "https://www.bbc.com/news/articles/cewz2yr47dvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/49fa/live/0098f3e0-07f2-11f1-b5e2-dd58fc65f0f6.jpg",
    "tag": "World",
    "date": "2026-02-12T09:02:30.000Z",
    "description": "'One in a billion': Dawson's Creek stars lead tributes to James Van Der Beek11 hours agoNardine SaadReporting from Los AngelesGetty ImagesIn a hand-wr",
    "body": "'One in a billion': Dawson's Creek stars lead tributes to James Van Der Beek11 hours agoNardine SaadReporting from Los AngelesGetty ImagesIn a hand-written statement posted on Instagram, Katie Holmes remembered Van Der Beek and his \"bravery, compassion, selflessness and strength\", as well as the actor's \"appreciation for life\".Co-star Busy Philipps wrote: \"James Van Der Beek was one in a billion and he will be forever missed and I don't know what else to say. I am just so so sad.\"Other stars who reacted to Van Der Beek's death include Reese Witherspoon, an executive producer on Legally Blonde prequel Elle, in which Van Der Beek will posthumously star, who said she was \"devastated\" by his death.\"What an extraordinary, talented man who also showed great kindness and grace in every action,\" she wrote on Instagram. \"Praying all the angels watch over his family during this difficult time.\"Van Der Beek was diagnosed with cancer in the latter half of 2023 and revealed the news in November 2024.The star played Dawson Leery in the hit TV show, which ran from 1998 to 2003, as well as starring in other shows and films including Varsity Blues.In her tribute, Holmes, who played Joey Potter in Dawson's Creek, added: \"I mourn this loss with a heart holding the reality of his absence and deep gratitude for his imprint of it.\"Getty ImagesVan Der Beek starred in Dawson's Creek from 1998-2003Philipps, who played a university roommate of Joey, portrayed by Holmes, added: \"He was my friend and I loved him and I'm so grateful for our friendship all these years.\"She urged her 2.4 million followers to help his family through an online fundraiser to help with medical bills and other expenses. The GoFundMe page posted online on Wednesday solicited donations to assist Van Der Beek's widow Kimberley and their six children, whose ages range from four to 15. It had raised $1.2m (£865,000) by Thursday morning.\"I am profoundly heartbroken for his incredible wife Kimberly and their six magical children,\" Philipps said, sharing photos from their time on the teen drama.'Gracious warrior'Mary-Margaret Humes, who played Van Der Beek's mother on Dawson's Creek, shared an Instagram tribute in honour of her late co-star on Wednesday.\"Rarely am I at a loss for words... today would be the exception. James, my gracious warrior, you fought a hard battle against all odds with such quiet strength and dignity,\" she wrote alongside two photos of them together.\"I will always love and admire you for that. Our last conversations ... merely a few days ago ... are forever sitting softly in my heart for safe keeping. To our extended Dawson's Creek family of friends, please be respectful of our silences at the moment as Beautiful Kimberly and family have asked for peaceful privacy for now.\"Philipps and Van Der Beek reunited on screen in 2012 for an episode of ABC comedy Don't Trust the B---- in Apartment 23, in which Van Der Beek played a fictionalised version of himself. Actress Krysten Ritter, Van Der Beek's co-star in Don't Trust the B---- in Apartment 23, remembered him as a \"beautiful human inside and out\". Ritter wrote on Instagram: \"Smart, funny, empathic, kind, talented and just pure magic. I'm so grateful for our friendship and so heartbroken. All my love goes out to his amazing wife Kimberly and their children.\"\"Love you so much James and fake James,\" she added.'Time is sacred'While Van Der Beek was set to reunite with his Dawson's Creek co-stars - including Oscar nominee Michelle Williams, Holmes and Joshua Jackson last September - the actor could only make a video appearance due to his illness. Hamilton and In the Heights creator Lin-Manuel Miranda, who stepped in for Van Der Beek at the event, paid tribute to the actor on Instagram, writing that his \"whole heart\" was with Van Der Beek's family. Actor and TV presenter Alfonso Ribeiro shared on Instagram that he got to say goodbye to his \"true friend, brother and life guide\" over the weekend, writing that he will always cherish his role as godfather to Van Der Beek's daughter Gwen and now sees Van Der Beek as his guardian angel.\"I was with him through this horrible journey to beat cancer. His family and friends went on this roller coaster ride. The highs when it looked like he had it beat to the breaking lows of it coming back,\" the Fresh Prince of Bel-Air alum wrote. Retired wrestler and cheerleader Stacy Keibler shared a photo of herself and Van Der Beek taking in a sunset as the actor was seated in a wheelchair. She said that she to got to spend Van Der Beek's final days with him. \"When you know time is sacred, you don't waste a single breath. You don't rush. You don't scroll. You don't worry about tomorrow. You sit. You listen. You hold hands. You watch the sky change colors and you let it change you too.\"In these past days, you taught me more about being present than any book ever could. You showed me what it looks like to trust God's plan, even when it breaks your heart. Especially when it breaks your heart,\" she wrote.Getty ImagesVan Der Beek and his wife Kimberly at a charity event in 2018Actor Chad Michael Murray, who appeared in Dawson's Creek and One Tree Hill, described Van Der Beek as \"a giant\".\"His words, art and humanity inspired all of us - he inspired us to be better in all ways. God bless you guys,\" he wrote in the comments section of the family's Instagram post announcing his death. \"I'm so grateful for being able to call James a brother. I'll miss him deeply. Rest easy,\" added Kerr Smith, who starred alongside Van Der Beek in Dawson's Creek.\"James represented something to aspire to,\" wrote One Tree Hill actor Austin Nichols, who also appeared in Varsity Blues.\"As a friend, husband and father, I know he was even more powerful and inspiring. You will be missed,\" Nichols said.Commenting on the family's Instagram announcement, Buffy the Vampire Slayer star Sarah Michelle Gellar wrote that she is \"so sad for your beautiful family\".\"While James legacy will always live on, this is a huge loss to not just your family but the world,\" the actress wrote.Actress Jennifer Garner described Van Der Beek's death as a \"heartbreaking loss\" and sent love to his widow and children as they \"navigate this tender time\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "James Van Der Beek: Dawson's Creek stars Katie Holmes and Busy Philipps lead tributes",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/49fa/live/0098f3e0-07f2-11f1-b5e2-dd58fc65f0f6.jpg"
      ],
      "datePublished": "2026-02-12T09:02:30.000Z",
      "dateModified": "2026-02-12T09:02:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC in Tehran sees government's 'political reply' to protests",
    "url": "https://www.bbc.com/news/videos/cewz2lxq2gvo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/63c6/live/f3acbda0-0748-11f1-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-11T12:34:41.000Z",
    "description": "Authorities in Iran have put on a show of strength to mark the 47th anniversary of the Islamic revolution, weeks after they used unprecedented force t",
    "body": "Authorities in Iran have put on a show of strength to mark the 47th anniversary of the Islamic revolution, weeks after they used unprecedented force to put down anti-government protests. The BBC is visiting Tehran for the first time since the crackdown, during which at least 6,490 protesters were killed across the country, according to human rights activists. The BBC's chief international correspondent Lyse Doucet says the bunting lining the capital's streets and large crowds of government supporters embody the image of the nation the government wants to see on the streets: Iranians coming out to show their support for the Islamic Republic and the revolution. Our correspondent is reporting from Tehran on condition that none of her material is used on the BBC's Persian Service. These restrictions apply to all international media organisations operating in Iran.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC in Tehran sees government's 'political reply' to protests",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/63c6/live/f3acbda0-0748-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-11T12:34:41.000Z",
      "dateModified": "2026-02-11T12:34:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]