[
  {
    "title": "All 246 passengers rescued after South Korean ferry runs aground",
    "url": "https://www.bbc.com/news/articles/cx2p2l4j8vjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9231/live/b1715280-c543-11f0-88be-3bc2aea1a256.jpg",
    "tag": "World",
    "date": "2025-11-19T15:34:01.000Z",
    "description": "44 minutes agoGeorge WrightYonhap NewsAll 246 passengers of a South Korean passenger ferry have been rescued after it ran aground on rocks off the cou",
    "body": "44 minutes agoGeorge WrightYonhap NewsAll 246 passengers of a South Korean passenger ferry have been rescued after it ran aground on rocks off the country's south-east coast, according to the Coast Guard.Officials added that the Queen Jenuvia 2 is stuck on a reef and unable to move, but there is currently no risk of sinking or capsizing.The accident happened near Jangsan Island in Sinan County on Wednesday evening local time. The vessel ran aground on rocks near the uninhabited island of Jogdo.Local media reported that five people sustained minor injuries from the impact of the grounding, but there have been no other casualties.Some crew members are reportedly still on board in collaboration with the coast guard. It is unclear how many of the 21 ferry staff remain on the ferry.South Korean Prime Minister Kim Min-seok has ordered all available vessels to be mobilised to rescue the ferry.\"We have confirmed that there is currently no flooding. We are transferring passengers to patrol boats and moving them to a safe location,\" a Coast Guard official said, Chosun Ilbo newspaper reports.The Coast Guard plans to move the vessel ashore at high tide.The 26,000-tonne ferry was travelling to the port city of Mokpo after departing from the resort island of Jeju, officials said.The area is near the site of the sinking of the Sewol ferry in 2014 that killed more than 300 people, mostly school children heading for a school trip.The salvaged wreck of the Sewol ferry was brought to Mokpo nearly three years later.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "All 246 passengers rescued after South Korean ferry runs aground",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9231/live/b1715280-c543-11f0-88be-3bc2aea1a256.jpg"
      ],
      "datePublished": "2025-11-19T15:34:01.000Z",
      "dateModified": "2025-11-19T15:34:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lebanon says Israeli strike killed 13 people near Palestinian refugee camp",
    "url": "https://www.bbc.com/news/articles/c0l73j781y9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/aa4c/live/097590b0-c4c0-11f0-9c9c-e7c124d0f066.jpg",
    "tag": "World",
    "date": "2025-11-18T22:19:58.000Z",
    "description": "18 hours agoSam Hancock and Hugo Bachega,Middle East correspondent  ReutersAt least 13 people have been killed in an Israeli strike near a Palestinian",
    "body": "18 hours agoSam Hancock and Hugo Bachega,Middle East correspondent  ReutersAt least 13 people have been killed in an Israeli strike near a Palestinian refugee camp in southern Lebanon, the country's health ministry says.The Israeli military said it had targeted members of the Palestinian armed group Hamas \"operating in a training compound... in the Ein el-Hilweh area\". It said the location was used by Hamas to plan and carry out attacks against Israel, which Hamas rejected as \"fabrication and lies\".Israel has carried out regular air strikes on people and places in Lebanon since a deal to end the conflict with the Iran-backed armed group Hezbollah. Most strikes have targeted Hezbollah but Israel has also attacked Hamas in the country.As well as those killed, Lebanon's health ministry said at least four people had been injured in the strike.Images showed emergency workers at the entrance of Ein el-Hilweh, the largest Palestinian refugee camp in Lebanon.Footage online also showed ambulances rushing through the narrow streets of the crowded camp as a huge plume of smoke billowed from the location hit.Initial reports said the strike hit an area outside a mosque that is usually busy at night. Condemning the attack, Hamas said it had \"no military installations in the Palestinian camps in Lebanon\" and that the site targeted was an \"open sports field\".In its statement, the IDF said \"prior to the strike, measures were taken to reduce the chance of harm to civilians, including the use of precision munitions, aerial observations, and additional intelligence information\".Hamas attacked southern Israel from Gaza on 7 October 2023, killing about 1,200 people and taking 251 others as hostages. Israel's military response has killed at least 69,169 Palestinians in Gaza, according to the territory's Hamas-run health ministry.Fighting between Israel and Hezbollah escalated after the Lebanese group fired rockets at Israeli positions the day after 7 October 2023. Hezbollah said it was acting in solidarity with Palestinians in Gaza.Israel and Hezbollah fought an escalating conflict for 13 months that culminated in an intense Israeli bombing campaign and ground incursion into southern Lebanon in October 2024.Lebanese authorities said Israel's attacks killed about 4,000 people there - including many civilians - and led to the displacement of more than 1.2 million residents. Israeli authorities said more than 80 of its soldiers and 47 of its civilians were killed in the hostilities.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lebanon says Israeli strike killed 13 people near Palestinian refugee camp",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/aa4c/live/097590b0-c4c0-11f0-9c9c-e7c124d0f066.jpg"
      ],
      "datePublished": "2025-11-18T22:19:58.000Z",
      "dateModified": "2025-11-18T22:19:58.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Dadri lynching case: Mohammad Akhlaq's family says won't stop fight for justice",
    "url": "https://www.bbc.com/news/articles/cp3delkdjkqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8af7/live/202688b0-c505-11f0-8cf1-fdd4be8468bd.png",
    "tag": "World",
    "date": "2025-11-19T09:57:03.000Z",
    "description": "The family of a Muslim man, who was lynched by a Hindu mob in India's Uttar Pradesh state in 2015, say they will continue fighting for justice after a",
    "body": "The family of a Muslim man, who was lynched by a Hindu mob in India's Uttar Pradesh state in 2015, say they will continue fighting for justice after authorities recently moved to drop all charges against the accused. Mohammad Akhlaq, then 50, was beaten to death after rumours spread that he had stored and consumed beef, a claim his family continues to deny. Slaughter of cows is a sensitive issue in India as the animal is considered sacred by Hindus, who comprise 80% of the country's 1.2 billion people. Uttar Pradesh is among the 20 states with strict laws banning cow slaughter and the sale and consumption of beef.The attack, which took place in Dadri - 49km (31 miles) from the capital Delhi - was the first major and widely reported case of cow-related violence in India and sparked widespread protests. Akhlaq's family's lawyer told BBC Hindi that 18 people were charged for various offences, including murder and rioting. All of them are out on bail.Now the Bharatiya Janata Party (BJP)-led state government of Uttar Pradesh has asked a local court to drop the charges against the men. In an application filed last month, the public prosecutor argued there were \"inconsistencies\" in the witness testimonies in identifying the accused and asked the court to close the case. The court is expected to decide on whether it would accept the application on 12 December. The news has shocked Akhlaq's family, who say they are prepared to challenge the government's plea. \"We never thought that our fight of 10 years would be attempted to be closed off like this,\" his younger brother Jaan Mohammad told BBC Hindi. The family left the village shortly after the killing and has not returned.\"Now, we are scared for our safety even more,\" Mr Mohammad said. \"Will this [move to withdraw the case] not embolden the criminals?\" Mr Mohammad says he will never forget the night his brother was murdered. Akhlaq had been sleeping with his 22-year-old son Danish on 28 September 2015, when a mob wielding sticks, swords and cheap pistols barged into their home, accusing the family of having slaughtered a cow and eating it. The family said it later found out that the mob attacked him after an announcement was made from a Hindu temple that someone had slaughtered and eaten a cow. The accused men found some meat in the fridge that the family insists was mutton, and held it as proof. While Akhlaq died on the spot, his son was seriously injured in the attack.The case sparked widespread outrage. Although initial arrests came within a week, the chargesheet took three months to file.Many also criticised Prime Minister Narendra Modi for speaking about the incident days after Akhlaq's death, while some BJP members, then in power at the federal level, were accused of defending the attackers.One party leader had described the lynching as an \"accident\", while another said consuming beef was unacceptable. The police, in its first chargesheet, named 15 main accused, including a juvenile and a local BJP leader's son, along with 25 witnesses. Four more accused were later added, bringing the total to 19; one died in 2016.Last month, the Uttar Pradesh government argued that witnesses, including Akhlaq's family, had given conflicting statements during the investigation.It noted that Akhlaq's wife initially named 10 people in her complaint, while his daughter Shaista cited 16, and his son Danish 19.\"Despite both the parties living in the same village, the witnesses have changed the number of accused,\" the application says.Mohammad Yusuf Saifi, Akhlaq's family lawyer, said the \"chaos and confusion\" at the time of the incident made it understandable that not every witness saw all involved.\"The only thing to see is whether there is any evidence against the people who have been named,\" he said. The application also noted that police seized five sticks, iron rods and bricks from the accused, but found no firearms or swords, contrary to what Akhlaq's wife had stated in her complaint.It further stated that officials had recovered beef from the scene. In 2016, a  case was filed against Akhlaq's family under the cow slaughter law - and is still pending before a court in Uttar Pradesh. The family has however has repeatedly denied the allegation.Mr Saifi, alleged the case was meant to \"pressurise\" the family, noting that a local veterinary report identified the meat as goat, not cow. As the family anxiously waits for the court's verdict, they are holding out hope. \"I still have faith in the court,\" Akhlaq's brother, Mr Mohammad, said. \"I believe justice would be done one day.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Dadri lynching case: Mohammad Akhlaq's family says won't stop fight for justice",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8af7/live/202688b0-c505-11f0-8cf1-fdd4be8468bd.png"
      ],
      "datePublished": "2025-11-19T09:57:03.000Z",
      "dateModified": "2025-11-19T09:57:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Larry Summers resigns from OpenAI board after Epstein emails made public",
    "url": "https://www.bbc.com/news/articles/ce868dmz2mdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bda7/live/8d653c50-c546-11f0-88be-3bc2aea1a256.jpg",
    "tag": "World",
    "date": "2025-11-19T13:32:11.000Z",
    "description": "Former US treasury secretary Larry Summers is stepping down from the board at OpenAI, a week after a tranche of emails between him and late convicted ",
    "body": "Former US treasury secretary Larry Summers is stepping down from the board at OpenAI, a week after a tranche of emails between him and late convicted sex offender Jeffrey Epstein was released. Summers said in a statement to the BBC that he was \"grateful for the opportunity to have served, excited about the potential of the company, and look forward to following their progress\".Summers, who was also once the president of Harvard University, said on Monday that he would be stepping back from public commitments over his ties to Epstein. The recently released emails showed Summers communicated with Epstein until the day before Epstein's 2019 arrest for the alleged sex trafficking of minors.In a statement, the artificial intelligence company said it respected Summers' decision to resign. \"We appreciate his many contributions and the perspective he brought to the Board,\" OpenAI said. The news comes after both chambers of Congress agreed on Tuesday to pass a measure to require the US justice department to release its files on Epstein. The measure will then head to the desk of US President Donald Trump for approval. He has said he plans to sign the bill, after reversing his position on the issue following pushback from his supporters. A batch of Epstein-related emails released by the House Oversight Committee last week mentioned a number of high-profile figures in the financier's former circle, without indicating any legal wrongdoing by those figures.The emails indicated that Summers and Epstein dined together frequently, with Epstein often trying to connect Summers to prominent global figures. After the emails were shared with the public, Summers said he took \"full responsibility for my misguided decision to continue communicating with Mr Epstein\". He added that he wanted \"to rebuild trust and repair relationships with the people closest to me\".Summers held senior posts under two Democratic presidents; serving as treasury secretary under Bill Clinton, and as director of the National Economic Council under Barack Obama. He led Harvard from 2001 to 2006 and remains a professor there. When announcing his step-down from public commitments earlier on Monday, he said he would continue his teaching commitments.Following Summers' announcement on Monday, the Center for American Progress, a liberal think tank in Washington where Summers was a senior fellow, confirmed that Summers was no longer affiliated with the organisation.Summers joined the board of OpenAI, which makes ChatGPT, in 2023 - following a failed attempt to oust its chief executive Sam Altman. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Larry Summers resigns from OpenAI board after Epstein emails made public",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/bda7/live/8d653c50-c546-11f0-88be-3bc2aea1a256.jpg"
      ],
      "datePublished": "2025-11-19T13:32:11.000Z",
      "dateModified": "2025-11-19T13:32:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zelensky visits Turkey in a bid to 'intensify' peace talks",
    "url": "https://www.bbc.com/news/articles/c620p6jnynko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2975/live/2ef97cd0-c49c-11f0-9d93-43c068b4c1e4.jpg",
    "tag": "World",
    "date": "2025-11-19T10:20:41.000Z",
    "description": "Ukraine's Volodymyr Zelensky and Turkish President Recep Tayyip Erdogan are meeting in Ankara on Wednesday, as the Ukrainian president said he wanted ",
    "body": "Ukraine's Volodymyr Zelensky and Turkish President Recep Tayyip Erdogan are meeting in Ankara on Wednesday, as the Ukrainian president said he wanted to \"intensify\" peace negotiations.\"Bringing the end of the war closer with all our might is Ukraine's top priority,\" Zelensky said, adding that efforts would also focus on resuming prisoner exchanges.It was unclear whether representatives from the US would join. Special envoy Steve Witkoff was rumoured to take part in the talks, but hours before the meeting was meant to take place his attendance had not been confirmed. Turkey has maintained ties with both Kyiv and Moscow and has previously hosted talks between the two factions.But no Russian representative is set to join the meeting in Ankara, Kremlin spokesman Dmitry Peskov said on Tuesday.He added that while there were \"no concrete plans\" for Vladimir Putin to speak to either the Turkish side or to US special envoy Steve Witkoff, the Russian president was \"of course open to a conversation\".Ankara will be the fourth capital Zelensky visits in only a few days. In Athens he secured a gas deal, in Paris he signed an agreement to obtain up to 100 fighter jets and in Madrid he held talks on co-operation with Spanish arms manufacturers.The visits are part of Zelensky's mission to try to shore up European support for Ukraine while Russian attacks on the country intensify and Moscow's troops close in on the key city eastern city of Pokrovsk.Domestically, Zelensky is facing the most serious crisis in years. Several members of his closest circle are under investigation for co-organising a large-scale criminal scheme, and two ministers have resigned. The scandal threatens to widen still and some EU leaders – who in December will decide whether to unblock a €140bn (£121bn) loan for Kyiv based on frozen Russian state assets – have warned Zelensky needs to do more to tackle corruption. As the fourth anniversary of the start of Russia's full-scale invasion in February 2022 inches closer, Moscow and Kyiv remain fundamentally opposed in their views of how to end the war.Earlier in November Russian Foreign Minister Sergei Lavrov said that Russia's conditions for a peace deal had not changed since Putin laid them out in 2024.At the time, the Russian president demanded that Kyiv renounce any ambition to join Nato, as well as full Ukrainian withdrawal from the Donetsk, Luhansk, Zaporizhzhia and Kherson regions.Zelensky has repeatedly argued that withdrawing from Donetsk and Luhansk – together known as the Donbas – would leave the rest of the country vulnerable to future attacks.Following a long meeting with Putin in April, Witkoff - the US special envoy - appeared to suggest that a peace deal between Moscow and Kyiv hinged on the status of the contested Ukrainian regions as well as Crimea, which Russia illegally annexed in 2014. This stance led to tensions with Zelensky, who accused him of \"disseminating Russian narratives\". Zelensky and Witkoff have not met since early September. Although the summer saw a flurry of high-level talks and meetings - including between Trump and Putin - American efforts to bring a ceasefire between Russia and Ukraine closer have stalled.At one point, it appeared Trump and Putin were about to meet again in Budapest –but that summit was scrapped, apparently after the US side became aware that Moscow had no intention of budging from several demands that were unacceptable to Kyiv.But contact between US and Russian officials has continued, albeit under the radar. Putin's special envoy Kirill Dmitriev was reportedly in Washington for meetings with Witkoff in late October, only days after Trump imposed sanctions on Russia's two biggest oil companies.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zelensky visits Turkey in a bid to 'intensify' peace talks",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2975/live/2ef97cd0-c49c-11f0-9d93-43c068b4c1e4.jpg"
      ],
      "datePublished": "2025-11-19T10:20:41.000Z",
      "dateModified": "2025-11-19T10:20:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gustav Klimt painting becomes second most expensive artwork sold at auction",
    "url": "https://www.bbc.com/news/articles/cm2emm4737zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2512/live/c3b79e00-c533-11f0-9839-6584ec7afe70.jpg",
    "tag": "World",
    "date": "2025-11-19T09:55:50.000Z",
    "description": "A portrait by the Austrian artist Gustav Klimt was sold for $236.4m (£179m) in New York on Tuesday, making it the second most expensive piece ever sol",
    "body": "A portrait by the Austrian artist Gustav Klimt was sold for $236.4m (£179m) in New York on Tuesday, making it the second most expensive piece ever sold at auction. Six people took part in a 20-minute bidding battle for the Portrait of Elisabeth Lederer which was painted between 1914 and 1916. Auction house Sotheby's has not disclosed the buyer's identity.The portrait was looted by the Nazis and almost destroyed in a fire in World War Two, but was rescued in 1948. The artwork was returned to Lederer's brother, Erich, a friend and subject of Klimt's contemporary, Egon Schiele. The piece remained in Lederer's possession for most of his life, before he sold it in 1983, according to Sotheby's. The painting shows Lederer, an heiress and the daughter of one of Klimt's patrons, wearing a white robe and standing in front of a blue tapestry covered in Asian motifs. The Nazis, who annexed Austria in 1938, looted the Lederer art collection but left family portraits behind, says the National Gallery of Canada. Estée Lauder heir Leonard A Lauder made it part of his private collection in 1985, where it was displayed in his Fifth Avenue home in New York. Tuesday's sale shot past expectations, with the painting predicted to sell for  $150m before the auction. The second highest sale for a Klimt on record was Lady with a Fan, which sold for $108.8m in 2023 in London. Several other Klimt works in Lauder's collection were auctioned at the same event, including Flowering Meadow and Forest Slope at Unterach am Attersee, which fetched between $60m and $80m each. The most expensive artwork ever sold at auction was Salvator Mundi, attributed to  Leonardo da Vinci, which sold in 2017 for $450.3m.Tuesday also saw a sculpture of a fully functioning gold toilet by the conceptual artist Maurizio Cattelan picking up $12.1m just an hour after the record-breaking Klimt sale.The 101-kg toilet received just one bid. Sotheby's said that the buyer was a famous American brand.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gustav Klimt painting becomes second most expensive artwork sold at auction",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2512/live/c3b79e00-c533-11f0-9839-6584ec7afe70.jpg"
      ],
      "datePublished": "2025-11-19T09:55:50.000Z",
      "dateModified": "2025-11-19T09:55:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "At least 94 Palestinians died in Israeli prisons in two years, human rights group says",
    "url": "https://www.bbc.com/news/articles/crreg2l7kezo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/89c6/live/6a1ead00-c46d-11f0-8dd3-1d8726ceb49b.jpg",
    "tag": "World",
    "date": "2025-11-18T12:45:31.000Z",
    "description": "1 day agoJon DonnisonCorrespondent, JerusalemAt least 94 Palestinian prisoners and detainees have died in Israeli custody in less than two years, a we",
    "body": "1 day agoJon DonnisonCorrespondent, JerusalemAt least 94 Palestinian prisoners and detainees have died in Israeli custody in less than two years, a well-regarded Israeli human rights group says.A new report by Physicians for Human Rights Israel (PHRI) alleges a practice of \"systematic killings and cover-ups\".The report covers the period between 7 October 2023, when Hamas launched its deadly attack on Israel, sparking the latest conflict in Gaza, and 31 August 2025. It said fewer than 30 Palestinians died in Israeli custody in the 10 years prior.The Israel Prison Service (IPS) told the BBC it \"operates in accordance with the law and under the supervision of official oversight bodies\".It said it did not comment on figures or allegations from outside bodies.\"All inmates are held according to legal procedures, and their rights including access to medical care, hygiene, and adequate living conditions are upheld by professionally trained staff,\" the IPS added.Since 7 October 2023, thousands of Palestinians have been detained across Gaza and the West Bank, many without charge.PHRI said it had exposed a deeply concerning pattern of systematic human rights violations committed against Palestinians detained by Israel and classified as \"security prisoners\".It said this was carried out as part of an official policy implemented by Israeli authorities since the war began.Israeli authorities have stopped providing information about Palestinians in custody to the Red Cross and barred access to detention facilities.PHRI said its report is based on official records and data cross-referenced with forensic reports, information from other human rights groups and efforts to locate specific people, as well as testimony from detainees, their families and lawyers.Its authors say 52 of those who died were being held in military prisons while 42 died in civilian jails run by the IPS.PHRI says the deaths were caused by physical violence, medical neglect, or both.It singles out the policies of Itamar Ben-Gvir, Israel's right-wing national security minister and a key member of Prime Minister Benjamin Netanyahu's coalition government.PHRI said that, under Ben-Gvir's control, Israel's incarceration facilities holding Palestinians had \"effectively been transformed into sites of torture and abuse\".It added daily physical violence was widespread, and that the deprivation of human rights and systematic torture had resulted in the deaths of dozens of Palestinians.The highest number of deaths, 29, occurred at the Sde Teiman military prison in Southern Israel, near Gaza.Five Israeli reservist soldiers have been charged with aggravated abuse and causing serious bodily harm, after a Palestinian prisoner was allegedly beaten and stabbed in the rectum with a sharp object at Sde Teiman in July 2024.Footage emerged showing reserve soldiers taking a detainee aside and surrounding him with riot shields before he was allegedly attacked. The five reservists deny the charges and have not been named.The alleged assault has divided the nation, with some right-wing politicians criticising a military police investigation and even some \"right to rape\" protests outside the jail.The PHRI report accuses the Israeli authorities of trying to \"cover up\" and suppress investigations into Palestinian deaths and alleged abuses in custody.In said that, in many cases, detainees' family members were not notified that their relatives had died and access to post-mortems was denied.The report also said there had been a failure to prosecute Israeli prison staff and soldiers.It examined a policy of what it called \"forced disappearance\", through which thousands of Palestinians have been detained without their families being notified or told where their relatives are being held.PHRI said these \"grave violations of international law\" had made determining the full scope of Israel's prisoner policy and the fate of the many Palestinians taken into custody extremely difficult, if not impossible.The group estimates the actual number of Palestinians killed could be higher than the number it has been able to document.The IPS said \"the claims described do not reflect the conduct or procedures of the Israel Prison Service, and we are not aware of the incidents as presented\".It continued: \"Every death in IPS custody is examined in accordance with established procedures and referred to the competent authorities as required.\"For reasons of privacy, security, and legal limitations, the IPS does not provide personal or statistical details regarding inmates, nor does it comment on individual cases.\"The Israel Defense Forces (IDF) said it operates \"in accordance with Israeli and international law\", and \"detains individuals in Gaza when there is reasonable suspicion of their involvement in terrorist activities\".It said that, in some cases, criminal proceedings were then initiated, while in others \"preventive detention is enforced to remove individuals from the fighting, in full alignment with the Israeli law and the Geneva Conventions\". \"Detention orders and their duration are subject to judicial review as required by law,\" it added.The IDF said it was aware of incidents of detainees dying in custody, but that these included people detained with existing illness or injury, adding each death was investigated by military police.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "At least 94 Palestinians died in Israeli prisons in two years, human rights group says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/89c6/live/6a1ead00-c46d-11f0-8dd3-1d8726ceb49b.jpg"
      ],
      "datePublished": "2025-11-18T12:45:31.000Z",
      "dateModified": "2025-11-18T12:45:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Things happen' - Trump defends Saudi crown prince over Khashoggi killing",
    "url": "https://www.bbc.com/news/articles/cn0gdkwp2p9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/969e/live/55d3d520-c510-11f0-b288-51552c83ad58.jpg",
    "tag": "World",
    "date": "2025-11-19T04:55:27.000Z",
    "description": "11 hours agoBernd Debusmann Jrat the White HouseWatch: Trump says Saudi crown prince \"knew nothing\" about Jamal Khashoggi's murderUS President Donald ",
    "body": "11 hours agoBernd Debusmann Jrat the White HouseWatch: Trump says Saudi crown prince \"knew nothing\" about Jamal Khashoggi's murderUS President Donald Trump said Saudi Crown Prince Mohammed bin Salman \"knew nothing\" about the 2018 killing of journalist Jamal Khashoggi, as he welcomed the kingdom's de facto ruler to the White House.Trump's comments appeared to contradict a US intelligence assessment in 2021 which determined the crown prince had approved the operation that led to Khashoggi's death at the Saudi consulate in Istanbul in 2018. The crown prince, who has denied any wrongdoing, said at the White House that Saudi Arabia \"did all the right things\" to investigate Khashoggi's death, which he called \"painful\".It was his first US visit since the assassination, which sent shockwaves through the US-Saudi relationship. In the Oval Office on Tuesday, Trump shot back at a reporter who asked a question about the killing. \"You're mentioning someone that was extremely controversial,\" the US president said. \"A lot of people didn't like that gentleman that you're talking about. Whether you like him or didn't like him, things happen.\" \"But he [the Crown Prince] knew nothing about it,\" Trump added. \"You don't have to embarrass our guests.\"The crown prince added that Saudi Arabia \"did all the right steps\" to investigate the murder, which he called \"painful\" and a \"huge mistake\". A US intelligence report made public in 2021 - under President Joe Biden's administration - determined that the crown prince had approved of a plan to \"capture or kill\" Khashoggi in Istanbul. During his first administration, Trump White House officials declined to release the report. While dozens of Saudi officials faced sanctions in the wake of the assassination, none directly targeted the crown prince.Hanan Khashoggi, Jamal Khashoggi's widow, speaks to BBC after Trump defends Saudi crown princeReacting to Trump's comments, Khashoggi's widow, Hanan, told BBC Newsnight the US president's defence of the crown prince did not match up with bin Salman's own acknowledgment of responsibility for her husband's murder.\"The crown prince himself, in 2019 and 60 Minutes interview, he did take accountability about and hold responsibility about this horrible crime,\" she said.In a post on X, she also called for a meeting with the crown prince and an apology along with compensation for her husband's murder.Granted political asylum in the US, she lives in the Washington DC area.Tuesday's meeting between Trump and Mohammed bin Salman was expected to include deals on civilian nuclear power, artificial intelligence and Saudi investment in the US, which the crown prince said was being upped to $1tr (£761bn) from $600bn pledged earlier this year. Echoing Trump's own words, bin Salman said that the US was the \"hottest country on the planet\" and praised the US president for creating \"long-term opportunity\". The two men also discussed the potential sale of advanced F-35 fighter aircraft to the Saudis. Trump said that while export licences were still being announced, he expected a deal between the Saudis and US defence giant Lockheed Martin. The potential sale has caused alarm among some Israeli officials, who have said that it could potentially hurt the country's \"qualitative military edge\" in the Middle East, where it is so far the only nation to have F-35s. The US president said the model sold to the Saudis would be broadly similar to the one the Israelis operate.\"This [Saudi Arabia] is a great ally, and Israel is a great ally,\" Trump said. \"I know they'd like you to get planes of reduced calibre.\"But as far as I'm concerned, I think they are both at a level where they should get top of the line,\" he added. The crown prince's visit to Washington continues with a gala dinner on Tuesday night, followed by an investment summit on Wednesday. Portuguese footballer Cristiano Ronaldo - who plays in the Saudi professional league - was also present at the dinner. Biden did not host the crown prince and vowed to make Saudi Arabia a \"pariah\" over its human rights record. In 2022, however, Biden visited the kingdom to reach agreement on other issues. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Things happen' - Trump defends Saudi crown prince over Khashoggi killing",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/969e/live/55d3d520-c510-11f0-b288-51552c83ad58.jpg"
      ],
      "datePublished": "2025-11-19T04:55:27.000Z",
      "dateModified": "2025-11-19T04:55:27.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "GGCSS Maga: Two schoolgirls escape Nigeria kidnap ordeal, official says",
    "url": "https://www.bbc.com/news/articles/cq83lejgvdyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ca9f/live/46a04720-c48c-11f0-9b68-57906bffd3ed.jpg",
    "tag": "World",
    "date": "2025-11-18T17:12:28.000Z",
    "description": "23 hours agoMansur Abubakar,Abuja, Natasha Booty and Chris Ewokor,BBC Africa, AbujaTwo girls, who were among at least 25 children and a teacher kidnap",
    "body": "23 hours agoMansur Abubakar,Abuja, Natasha Booty and Chris Ewokor,BBC Africa, AbujaTwo girls, who were among at least 25 children and a teacher kidnapped from their boarding school in north-western Nigeria's Kebbi state on Monday, have managed to escape, a local official told the BBC.The pair ran away as their armed captors were leading them into the bushes and got away across farmland, Hussaini Aliyu of Danko Wasagu council said. He added that the girls were \"back and are safe\", but one of them needed medical treatment as she had hurt her leg while fleeing.The assault left two members of staff dead - a teacher was killed while trying to protect girls and a security guard later died in hospital from gunshot wounds.A team of soldiers, police and volunteers are combing forested areas in an attempt to rescue the captives seized by the gunmen.\"You must continue day and night fighting. We must find these children,\" Maj Gen Waidi Shaibu, Nigeria's army chief of staff, told troops sent to Kebbi state.Over the past decade, schools in northern Nigeria have become frequent targets for armed groups, who often carry out abductions to seek ransom payments or leverage deals with the government.Police say the gunmen, described locally as \"bandits\", invaded the Government Girls Comprehensive Secondary School in Maga town at about 04:00 (03:00 GMT) on Monday.Parents face an agonising wait. One inconsolable father, whose daughter is still being held captive, told BBC Hausa that his family had been crying non-stop and \"it's hard to go back home and look at their faces\".He said he had two daughters enrolled at the school one of whom had successfully hid from the attackers, but the other had not been so lucky.\"My two daughters hid in the toilet when the armed men invaded their hostel.\"When the [gunmen] ordered all those hiding to come out, or else they'll kill them, one of my daughters got scared and came out,\" the father said.He added that he had heard of the abductions after the Muslim early-morning prayer on Monday, and had rushed to the school and been there ever since.\"My daughter is a very bright and easy-going person,\" he said.Police say the attackers \"engaged police personnel on duty in a gun duel\" before climbing over the perimeter fence and taking the girls from their hostel.The security guard who died had a granddaughter and great-granddaughter at the same school and they are among those kidnapped.It has devastated his family.\"I found him in his pool of blood,\" the security guard's daughter told the BBC. \"Then they took my daughter and also my granddaughter.\"She said she had been unable to eat or sleep ever since.The attack highlights the persistent security crisis plaguing the region, leaving families in a state of fear. Nigeria's central government says it is \"deeply concerned\" by the abductions. In a statement on Monday, Information Minister Mohammed Idris Malagi said the authorities \"share in the pain\" of the affected families and were working urgently to rescue the girls.He added that President Bola Tinubu remained \"unwavering in his commitment to protect every Nigerian, especially schoolchildren\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "GGCSS Maga: Two schoolgirls escape Nigeria kidnap ordeal, official says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ca9f/live/46a04720-c48c-11f0-9b68-57906bffd3ed.jpg"
      ],
      "datePublished": "2025-11-18T17:12:28.000Z",
      "dateModified": "2025-11-18T17:12:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Two Miss Universe judges quit scandal-hit pageant, as one claims it's rigged",
    "url": "https://www.bbc.com/news/articles/crmxgymr8ewo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/02fb/live/8aa15d00-c528-11f0-ba4c-a176bf1fb76f.jpg",
    "tag": "World",
    "date": "2025-11-19T09:20:11.000Z",
    "description": "Two Miss Universe judges have resigned days before the annual beauty pageant, with one of them accusing organisers of rigging the selection process.Le",
    "body": "Two Miss Universe judges have resigned days before the annual beauty pageant, with one of them accusing organisers of rigging the selection process.Lebanese-French musician Omar Harfouch, who announced his resignation from the eight-member jury on Instagram, alleged that an \"impromptu jury\" had pre-selected finalists ahead of the competition, set to be held on Friday in Thailand.Hours later, French football manager Claude Makélélé also announced he'd pulled out, citing \"unforeseen personal reasons\".The resignations come two weeks after several Miss Universe contestants walked out of a pre-pageant event over controversial comments made by an official from host nation Thailand.\"An impromptu jury has been formed to select 30 finalists from among the 136 participating countries, without the presence of any of the real [eight] members of the jury, including me,\" Mr Harfouch wrote in an Instagram post on Tuesday, saying he had discovered this via social media.The unofficial jury comprises \"individuals with a significant potential conflict of interest due to some personal relationships with some of the Miss Universe contestants\", he claimed.Mr Harfouch did not elaborate on how this \"impromptu jury\" would function, or how it would override the official jury's decision.Watch: Miss Universe contestants stage walkout after organiser berates Miss MexicoThe Miss Universe Organisation on Tuesday put out a statement to rebuff Mr Harfouch's claims, saying that \"no external group has been authorised to evaluate delegates or select finalists\". It suggested that Mr Harfouch may have been referring to the Beyond the Crown programme: a \"social impact initiative\" that operates independently from the Miss Universe competition, and has a separate selection committee. The Miss Universe Organisation announced the Beyond the Crown selection committee on Monday. In its statement on Tuesday, the organisation said that Mr Harfouch's allegations had \"mischaracterised\" the programme.Mr Makélélé, who also announced his resignation via Instagram, described it as a \"difficult decision\". \"I hold Miss Universe in the highest regard. The platform represents empowerment, diversity, and excellence - values I have always championed throughout my career,\" he wrote.The beauty pageant drew backlash earlier this month after its Thailand director Nawat Itsaragrisil publicly berated Miss Mexico, Fatima Bosch, at a pre-pageant event for not posting promotional content on her social media platforms.In videos that have since gone viral, Ms Bosch and several other contestants could be seen walking out of the event, and some could be heard shouting at Mr Nawat.Mr Nawat later claimed that some of his words were misunderstood - but his conduct nevertheless prompted a stern rebuke from the Miss Universe Organisation, which has since sent a delegation of international executives to take over running the competition.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two Miss Universe judges quit scandal-hit pageant, as one claims it's rigged",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/02fb/live/8aa15d00-c528-11f0-ba4c-a176bf1fb76f.jpg"
      ],
      "datePublished": "2025-11-19T09:20:11.000Z",
      "dateModified": "2025-11-19T09:20:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Why India's poorest state continues to struggle with illegal alcohol sales",
    "url": "https://www.bbc.com/news/articles/cp3de4dqvk8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ef6b/live/876f79b0-c446-11f0-aa07-8f78e8344346.jpg",
    "tag": "World",
    "date": "2025-11-19T00:01:39.000Z",
    "description": "16 hours agoRaghvendra RaoBBC Hindi, BiharSeraj AliLalmunni Devi, who lost her husband to toxic liquor in 2022, says alcohol abuse upended her lifeNin",
    "body": "16 hours agoRaghvendra RaoBBC Hindi, BiharSeraj AliLalmunni Devi, who lost her husband to toxic liquor in 2022, says alcohol abuse upended her lifeNine years after imposing a statewide alcohol ban to curb addiction, domestic violence, and financial ruin among its poorest families, Bihar - India's poorest state - still struggles to gauge the policy's effectiveness.The gaps in implementation became glaring as the BBC shadowed Bihar officials in a misty October morning raid on bootleggers.Armed excise officers, with a sniffer dog, sped across the Ganges on a boat to raid an illegal distillery.On reaching the outskirts of the capital, Patna, the team found a ramshackle setup of a dozen metal drums - part of a makeshift apparatus fermenting jaggery, a type of cane sugar, into country liquor.Vapour rose from the drums embedded in the riverside mud, the surfaces still warm.The officers said the site was active minutes earlier, but the alcohol-makers had fled by the time they arrived. \"They often get tipped off before a raid,\" an officer who didn't wish to be named said. Despite these enforcement gaps, alcohol prohibition remains firmly in place in Bihar.Passed in 2016 by Chief Minister Nitish Kumar after persistent demands from women's groups, the law was among the factors that helped his Janata Dal (United) - Bharatiya Janata Party (BJP) alliance clinch a decisive state election victory earlier this month.State officials tout the policy's success by pointing to big numbers: since the law took effect, 1.1 million cases have been registered and 650,000 people convicted for violations. But the devil lies in the detail.More than 99% of these convictions are for consumption, rather than production, selling, or transport of illicit liquor. Moreover, alcohol remains widely available in the black market in Bihar. In the six weeks leading to the recently held election, illicit alcohol worth more than 522 million rupees ($6.26 million, £4.96 million) was seized from across the state. Seraj AliA makeshift setup of metal drums fermenting jaggery into country liquorSo why has Bihar been unable to enforce its ban more effectively?Local police, who did not want to come on record, say it is a combination of several factors - including staff shortages, increasingly sophisticated smuggling methods and possible collusion between liquor makers and authorities.\"There are laws that prescribe life imprisonment or even the death penalty for murder. But does that stop people from committing murder? No, it doesn't,\" said Ratnesh Sada, an outgoing minister whose department handled prohibition issues.Mr Sada, however, insisted that action has been taken against at least a hundred individuals engaged in illegal alcohol trade, with their properties seized.\"We destroy these setups, but within days they are up and running again,\" said Sunil Kumar, an excise official.Bihar's geography makes enforcement even harder. The landlocked state borders Uttar Pradesh, Jharkhand and West Bengal -  all of which allow alcohol and serve as major sources of smuggled liquor. It also shares a 726km (449 mile), largely porous border with Nepal, which officials say has become a key conduit for alcohol smuggling, further complicating enforcement.Seraj AliBihar has a thriving black market in locally-brewed alcoholDespite the challenges, many women in Bihar -  who still carry deep scars from their husbands' alcohol abuse -  want the ban to continue.In Chhapra district, Lalmunni Devi, who lost her husband after he consumed toxic liquor in 2022, said her life had been upended by alcohol abuse.\"I just hope no one else has to suffer the same fate,\" she said.Neetu Devi, another widow, broke down as she recalled her husband's death.\"If the government were to shut down all such factories entirely, it [liquor] would no longer be available. It continues to be produced, and that's why people keep consuming it,\" she said.Rajeev Kamal Kumar, an anthropologist at Patna's AN Sinha Institute of Social Sciences, who worked on a government study of prohibition, says both sides of the story are true.\"Many women and elders say prohibition has improved household finances, children's education, and nutrition. But it is undeniable that illegal trade continues,\" he said.Bihar is neither the first nor the only Indian state to impose prohibition; several others have tried it over the years. But such measures often trigger unintended consequences - from thriving black markets and deaths from illicit brews, to enforcement challenges that drain state resources.The financial cost has also been considerable, as alcohol taxes remain a key source of revenue for many state governments.Gujarat and Nagaland have had bans since 1960 and 1989, yet both still grapple with bootlegging.Mizoram imposed prohibition in 1997, lifted it in 2015, reinstated it in 2019, and then relaxed it again in 2022 to allow the manufacture, sale and export of wine made from local grapes.Some other states have rolled back prohibition after encountering economic and administrative challenges.For now, with the outgoing government slated to return to power, prohibition will remain in Bihar. But the policy remains a paradox - hailed as a social reform by some, criticised as ineffective by others.Whether it has succeeded or merely shifted the problem underground is a question that continues to haunt the state.Follow BBC News India on Instagram, YouTube, Twitter and Facebook.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Why India's poorest state continues to struggle with illegal alcohol sales",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ef6b/live/876f79b0-c446-11f0-aa07-8f78e8344346.jpg"
      ],
      "datePublished": "2025-11-19T00:01:39.000Z",
      "dateModified": "2025-11-19T00:01:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Russian attack on Ternopil kills 25 in one of deadliest strikes on western Ukraine",
    "url": "https://www.bbc.com/news/articles/cy0yere4k0zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a160/live/deab3670-c530-11f0-bf7b-db7c049674ab.jpg",
    "tag": "World",
    "date": "2025-11-19T15:56:28.000Z",
    "description": "20 minutes agoJonathan Beale,Defence correspondent in Kyiv and Mattea BubaloAt least 25 people have been killed including three children in a Russian ",
    "body": "20 minutes agoJonathan Beale,Defence correspondent in Kyiv and Mattea BubaloAt least 25 people have been killed including three children in a Russian missile and drone attack that hit two blocks of flats in the western city of Ternopil, Ukrainian officials say.They say another 73 people were wounded, 15 of them children, in the strike early on Wednesday - one of the deadliest in the region since Moscow launched its full-scale invasion in February 2022.Ukraine's air force later said Russian X-101 cruise missiles had hit the residential flats. The neighbouring Lviv and Ivano-Frankivsk regions were also struck, and a drone attack on three districts of the north-eastern city of Kharkiv wounded more than 30 people. Photos posted online showed buildings and cars ablaze. Ukraine's air force said it had shot down 442 of 476 drones and 41 of 48 missiles launched by Russia, including 10 missiles destroyed by F-16 and Mirage 2000 fighter jets supplied to Kyiv by its Western allies. But in a reference to how stretched Ukraine's air defences currently are, the air force pleaded for \"the uninterrupted and timely supply of aviation weapons from Western partners\".Ternopil, a city closer to the Polish border than the capital Kyiv, has rarely faced attacks since the full-scale invasion. Social media footage of this strike shows missiles shooting across the sky towards the city, though very little sign of air defences reacting from the ground.The devastation caused by the Russian strikes on Ternopil soon became clear. A video shared by Ukrainian President Volodymyr Zelensky showed one of the blocks of flats had completely caved in. Interior Minister Ihor Klymenko said it had been destroyed between the third and ninth floors.The attack had caused \"significant destruction\", said Zelensky, and many victims were reported to be in the rubble. Plumes of smoke poured from windows and small fires burned outside the tenement. A giant smoke cloud rose in the distance behind the Church of Our Lady of Perpetual Help in Ternopil, as sirens blared throughout the city. With limited defence systems, and a vast country to defend every night, no matter how effective Ukraine becomes at shooting down Russian missiles and drones, there is always a risk some will get through – to devastating effect, as happened in Ternopil.Energy facilities, transport and civil infrastructure were damaged elsewhere in western Ukraine.The energy sector came under attack in Ivano-Frankivsk region where two of the three people reported wounded were children. The head of Lviv region said an energy facility had been struck. Russia has recently upped its attacks on Ukraine's energy grid - as the fourth winter of the war approaches - hoping to damage morale as well as logistics and Ukraine's own defence industry.Electrical supplies are already being rationed and, after the latest attacks, the energy ministry announced more power cuts across the country.Russia's defence ministry said it had carried out its \"massive strike using long-range precision weapons\", claiming it had targeted Ukraine's \"military-industrial complex and energy sector\" in response to Ukrainian attacks on \"civilian targets\".Ukraine's military said on Tuesday it had fired US-supplied longer-range Atacms missiles at military targets inside Russia, the first time they had admitted using Atacms on Russian soil.Russia's defence ministry accused Ukraine of firing four of the missiles at the southern city of Voronezh but said they had all been shot down by air defences. Meanwhile, Zelensky has travelled to the Turkish capital Ankara, in an attempt to revive a US bid to end the war. He held talks with Turkish President Recep Tayyip Erdogan amid reports President Donald Trump's special envoy Steve Witkoff has been working on a plan with Russian counterpart Kirill Dmitriev.The Kremlin said no Russian representative would be joining the talks in Ankara. Spokesman Dmitry Peskov declined to comment on a media report that the US and Russia had been working on a peace plan for Ukraine.\"In this case, there is nothing new that we can inform you about,\" Peskov told journalists on Wednesday.His comments came as Zelensky was reportedly due to meet two top US army officials in Kyiv on Thursday. Army Secretary Dan Driscoll and Army Chief of Staff General Randy George are the most senior US military officials to visit the Ukrainian capital since President Donald Trump took office, Reuters reports. In a separate development, Romania's defence ministry said a Russian drone had flown about 8km (5 miles) through its airspace in the early hours of Wednesday. The drone then crossed into Ukraine and Moldova before returning to Romania, it said.Romanian and German air force planes were scrambled in response to the incursion and the defence ministry said it was unclear where the drone had come down.Poland also deployed jets early on Wednesday and temporarily closed two airports in the southeast in response to the strikes in western Ukraine.As the fourth anniversary of the start of Russia's full-scale invasion approaches next February, Moscow and Kyiv remain fundamentally opposed in their views of how to end the war.Ukraine and its Western allies, including the US, have called for an immediate ceasefire along the vast front line – but Russia has repeatedly ruled that out, repeating demands that Ukraine says amount to its de facto capitulation.Earlier this month, Russian Foreign Minister Sergei Lavrov said Moscow's pre-conditions for a peace deal - including tough curbs on the size of Ukraine's military and the country's neutrality - had not changed since Putin laid them out two months before the full-scale invasion.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Russian attack on Ternopil kills 25 in one of deadliest strikes on western Ukraine",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a160/live/deab3670-c530-11f0-bf7b-db7c049674ab.jpg"
      ],
      "datePublished": "2025-11-19T15:56:28.000Z",
      "dateModified": "2025-11-19T15:56:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "KPop Demon Hunters star on how her life mirrored main character Rumi's journey",
    "url": "https://www.bbc.com/news/articles/c17pj0gr75lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5b5a/live/171a1920-c466-11f0-8669-5560f5c90fbe.jpg",
    "tag": "World",
    "date": "2025-11-18T00:32:33.000Z",
    "description": "'I hated that I looked Asian': KPop Demon Hunters star on her struggle for acceptance2 days agoChi Chi Izundu & Rebecca ThornBBC Global WomenBBCArden ",
    "body": "'I hated that I looked Asian': KPop Demon Hunters star on her struggle for acceptance2 days agoChi Chi Izundu & Rebecca ThornBBC Global WomenBBCArden Cho stars as the voice of Rumi in KPop Demon Hunters, which topped Netflix charts in 93 countries\"I hated that I looked Asian, that I didn't have blue eyes and blonde hair, because that's what was beautiful at the time,\" says Arden Cho, the actress who voiced Rumi, star of Netflix's chart-topping animated film, KPop Demon Hunters.Speaking to the BBC World Service for the Global Women series, Cho, 40, is describing her childhood in Texas, as the eldest daughter of Korean immigrant parents and her struggle for acceptance in American society.In the film, which tells the story of a female K-Pop trio who must save the world from evil forces, Rumi has to come to terms with her identity as part human, part demon - and when Cho first read the script this resonated powerfully.\"Being born in America, feeling American but having people treat me like I'm not, trying to figure out my identity as an Asian-American, as a Korean-American, as a woman,\" she says.These were all elements of her early life that mirrored Rumi's journey.\"I can honestly say that at different points in my life, I hated a lot of myself and I wanted to be someone else.\"As kids, what you see shapes who you become and I feel like I just didn't see enough people that look like me.\"NetflixCho says the film has led to \"Korea being loved\" more than ever beforeWhen it launched on Netflix in June, KPop Demon Hunters registered 33 million views in just two weeks, and reached the top 10 of the Netflix charts in 93 countries. To star in the first Hollywood animated film set in Korea, with Korean leads, was for Cho \"a dream come true\" – but it has also made her a powerful role model for Asian-American children, of the kind that she lacked when she was young.Cho says many Korean-Americans have told her it's \"such a refreshing moment\", making them proud for the first time of their dual heritage and culture.\"I feel like K-Pop really, truly, has paved the way. K-beauty has had such a big impact on Korea being loved. But I feel like this movie is the one that tipped it over the edge of, everybody wants to go to Korea, now,\" Cho says.But the film's success was not guaranteed and Cho says she felt the team making it were \"sometimes facing an uphill battle\".\"I feel like it kind of sucks to say this, but any time there's an Asian-led project, people feel like it's a risk,\" she says.So, when she took on the role, she made an effort to meet everyone working on the film in person, she says.Getty ImagesJi-Young Yoo (left) and May Hong (right) are also voice actors in the filmThe film was released against the backdrop of increased immigration raids in the US as part of the Trump administration's mass deportation effort, targeting those who are in the country illegally, which sparked protests in many states.As an Asian-American living in the US \"it's heartbreaking and disappointing,\" says Cho. \"Immigrants have made America what it is.\"Korean news sources have estimated that up to 150,000 Korean immigrants without proper documentation, including adopted children, are among those who could be deported.Cho says that when she was younger, people didn't know what it meant to be Korean in the USAs an adult, Cho came to realise that the racism she had experienced when she was younger stemmed mainly from a lack of education, as people didn't know what it meant to be Korean or Asian.\"But now in this day and age, when I feel like the world and people should know better, it is beyond disappointing and sometimes I feel like we feel so hopeless,\" she says.Because of this, it feels very special, she says, that KPop Demon Hunters could bring \"hope and joy and love to all these different communities\".\"Maybe that's why it's sort of like this movie of the summer, because we just needed some hope and something to unite us all together.\"The growth of AI is a major concern for the film industry, raising the possibility that in future it could be used to make a film like KPop Demon Hunters.Cho says she is aware that AI is already being used to replicate actors' voices, but wants to \"have hope in humanity\" that people will still seek out art created by humans.\"Sure, I'm sure they're going to have AI actors and singers. I know they already exist. I know our voices are already being manipulated, but I hope people have some respect and want and love for something real.\"KPop Demon Hunters has also been dominating the global music charts, with seven tracks from its soundtrack featured on the Billboard Hot 100. It has its own fan art, and audiences around the world are demanding a sequel.Cho tells us she wishes she could answer the question of whether that will happen - but both she and fans will have to wait for Netflix or Sony Pictures Entertainment, which made the film, to give it the green light.\"I know there's lots of murmurs, I've heard wonderful things,\" she says. \"So we shall see, and I think everyone in the world would riot if there wasn't.\"Starting conversations, building connections and challenging misinformation through features, investigations, interviews and extraordinary stories",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "KPop Demon Hunters star on how her life mirrored main character Rumi's journey",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5b5a/live/171a1920-c466-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-18T00:32:33.000Z",
      "dateModified": "2025-11-18T00:32:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gen Z protests: Kenya authorities paid trolls to threaten activists, Amnesty says",
    "url": "https://www.bbc.com/news/articles/c3vngv60l0qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/06aa/live/24a2eda0-c548-11f0-b288-51552c83ad58.jpg",
    "tag": "World",
    "date": "2025-11-19T15:17:01.000Z",
    "description": "59 minutes agoAkisa WanderaBBC Africa, NairobiThe Kenyan authorities paid a network of trolls to threaten and intimidate young protesters during recen",
    "body": "59 minutes agoAkisa WanderaBBC Africa, NairobiThe Kenyan authorities paid a network of trolls to threaten and intimidate young protesters during recent anti-government demonstrations, Amnesty International has said.A new report by the human rights organisation said government agencies also employed surveillance and disinformation to target organisers of the mass protests, which swept Kenya across 2024 and 2025.The demonstrations were driven largely by \"Gen Z\" activists who used social media platforms to mobilise.In response to Amnesty's report, Kenya's interior minister said the government \"does not sanction harassment or violence against any citizen\". But Amnesty said it had uncovered a campaign to \"silence and suppress\" the protesters.Young women and LGBT+ activists were disproportionately targeted, with misogynistic and homophobic comment, as well as AI-generated pornographic images, the report said.The BBC has approached the government for further comment.One activist told Amnesty: \"I had people coming into my inbox and telling me: 'You will die and leave your kids. We will come and attack you'.\"I even had to change my child's school. Someone sent me my child's name, the age... the school bus number plate. They told me: 'If you continue doing what you're doing then we will take care of this child for you'.\"It has long been believed that the government employs a network of individuals, known as \"keyboard warriors\", to push its online messages.The report features a man who said he was part of a team paid between 25,000 and 50,000 Kenyan shillings (about $190-$390; £145-£300) per day to amplify government messaging and drown out trending protest hashtags on social media platform X.As part of its research, Amnesty spoke to 31 young human rights defenders who had participated in the protests. Nine of these activists said they had received violent threats via X, TikTok, Facebook and WhatsApp.As well as digital abuse, the authorities have also been accused of carrying out a brutal crackdown on the protests.More than 100 people died, rights groups say, when police clashed with protesters during two waves of demonstrations - one in 2024 and one in 2025.The authorities were also accused of arbitrary arrests, enforced disappearances and using lethal force against the protesters.The government accepted there had been some case of excessive force by police, but also defended the security forces in other instances. The demonstrations railed against issues such as proposed tax rises, increasing femicide and corruption.Amnesty chief Agnès Callamard said the organisation's report \"clearly demonstrates widespread and coordinated tactics on digital platforms to silence and suppress protests by young activists\".\"Our research also proves that these campaigns are driven by state-sponsored trolls, individuals and networks paid to promote pro-government messages and dominate Kenya's daily trends on X,\" she added.Kenya's Interior Minister Kipchumba Murkomen said: \"The government of Kenya does not sanction harassment, or violence against any citizen... any officer implicated in unlawful conduct bears individual responsibility and is subject to investigation and sanction.\"Amnesty also raised concerns about unlawful state surveillance, including allegations - denied by Kenya's largest telecom provider, Safaricom - that authorities used mobile data to monitor protest leaders.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gen Z protests: Kenya authorities paid trolls to threaten activists, Amnesty says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/06aa/live/24a2eda0-c548-11f0-b288-51552c83ad58.jpg"
      ],
      "datePublished": "2025-11-19T15:17:01.000Z",
      "dateModified": "2025-11-19T15:17:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Clay Higgins: The lone lawmaker to vote against releasing the Epstein files",
    "url": "https://www.bbc.com/news/articles/crl2g195n96o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ae79/live/cf874290-c4dd-11f0-a513-b5961c879548.jpg",
    "tag": "World",
    "date": "2025-11-19T00:48:25.000Z",
    "description": "Nearly every Republican in the US House of Representatives voted on a bill  to compel the release of documents tied to convicted sex offender Jeffrey ",
    "body": "Nearly every Republican in the US House of Representatives voted on a bill  to compel the release of documents tied to convicted sex offender Jeffrey Epstein.The lone \"nay\" came from the Republican lawmaker from Louisiana, Clay Higgins, who defied his party saying his vote was a principled \"NO\".\"What was wrong with the bill three months ago is still wrong today,\" Higgins wrote on X. \"It abandons 250 years of criminal justice procedure in America.\"The resounding vote in favour of the Epstein bill, 427-1, marks a rare moment of bipartisanship on Capitol Hill. Hours later, the US senate too approved the legislation, clearing the way for the final act - President Donald Trump's signature. For Higgins, safeguarding the personal information of Epstein's many victims was the primary issue with the legislation.\"As written, this bill reveals and injures thousands of innocent people – witnesses, people who provided alibis, family members, etc,\" he wrote on X. \"If enacted in its current form, this type of broad reveal of criminal investigative files, released to a rabid media, will absolutely result in innocent people being hurt.\"  Higgins said he would support the bill if it were to be amended by the Senate, which Republican majority leader John Thune had already suggested was unlikely. \"When a bill comes out of the House 427 to 1 and the president said he's going to sign it, I'm not sure that amending it is in the cards,\" Thune said before the Senate's unanimous approval for the bill on Tuesday.Prior to the House passing the legislation, only four Republicans had joined all Democrats in signing a petition to force a vote - Thomas Massie, Lauren Boebert, Nancy Mace and Marjorie Taylor Greene.But it achieved overwhelming Republican support after President Trump dropped his opposition to a vote.Higgins has represented Louisiana's third district since 2017 and is widely regarded as one of the most conservative members of Congress, according to his website.His holdout vote in the wake of 200-plus members of his party voting otherwise is not the first time he has taken an unorthodox stance.In 2024, House Republicans voted to censure Higgins for offensive remarks he made on social media after he called Haiti \"the nastiest country in the western hemisphere\" and referred to Haitians as \"eating pets\" and \"slapstick gangsters\". \"All these thugs better get their mind right and their ass out of our country before January 20th,\" Higgins wrote.Facebook removed two posts from Higgins in 2020, after he wrote he would \"drop any 10 of you where you stand\", referring to any armed protesters that might attend a Louisiana demonstration against police brutality.Facebook told Business Insider at the time the posts \"were removed for violating our policies against inciting violence\". Before Congress, Higgins was a member of Louisiana's St Landry's Parish Sheriff's Office. He resigned in 2016 amid backlash about a controversial anti-crime video where he was seen holding a rifle and making threats against gang members. The BBC has contacted Higgins's office for comment. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Clay Higgins: The lone lawmaker to vote against releasing the Epstein files",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ae79/live/cf874290-c4dd-11f0-a513-b5961c879548.jpg"
      ],
      "datePublished": "2025-11-19T00:48:25.000Z",
      "dateModified": "2025-11-19T00:48:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]