[
  {
    "title": "Nasa targets March 6 date to send humans back around the Moon ",
    "url": "https://www.bbc.com/news/articles/c86y1g6wde3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1a2d/live/537ff930-6139-11ee-b101-6f93d6dfbcc2.png",
    "tag": "World",
    "date": "2026-02-20T16:11:18.000Z",
    "description": "17 minutes agoBBCNasa is targeting March 6 (March 7 in the UK) to launch a crew around the Moon for the first time in more than 50 years, in what woul",
    "body": "17 minutes agoBBCNasa is targeting March 6 (March 7 in the UK) to launch a crew around the Moon for the first time in more than 50 years, in what would be humankind's furthest ever trip into space.The Artemis II mission will see four astronauts embark on a 10-day journey around the far side of the Moon and back to Earth, paving the way for a future lunar landing.Nasa set the launch date following a successful \"wet dress rehearsal\" - a critical pre-launch test where the rocket is filled with fuel and taken through the countdown sequence.It was the Artemis team's second attempt at a practice run at the Kennedy Space Center in Florida.This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nasa targets March 6 date to send humans back around the Moon ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1a2d/live/537ff930-6139-11ee-b101-6f93d6dfbcc2.png"
      ],
      "datePublished": "2026-02-20T16:11:18.000Z",
      "dateModified": "2026-02-20T16:11:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Venezuelan opposition politician released after amnesty law passed",
    "url": "https://www.bbc.com/news/articles/cy57en3590no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/58cf/live/96774be0-0e4c-11f1-9189-e7ebb4fb5ccd.jpg",
    "tag": "World",
    "date": "2026-02-20T13:37:44.000Z",
    "description": "3 hours agoJack BurgessReutersVenezuelan opposition politician Juan Pablo Guanipa has announced on social media that he has been freed after \"almost n",
    "body": "3 hours agoJack BurgessReutersVenezuelan opposition politician Juan Pablo Guanipa has announced on social media that he has been freed after \"almost nine months of unjust imprisonment\". His comments come shortly after the country's interim President, Delcy Rodríguez, signed an amnesty bill approved by its National Assembly that could lead to the release of hundreds of political prisoners. Rodríguez's interim government has faced pressure from the US to speed up the release of Venezuela's remaining political prisoners after delays to the law. However, Guanipa described the bill as a \"flawed document\" that excludes many Venezuelans who remain \"unjustly\" behind bars. Guanipa is the leader of Venezuela's centre-right Justice First party and was a former vice-president of the National Assembly.Venezuela's socialist government has always denied holding political prisoners but first announced days after Maduro's capture, on 8 January, that \"a significant number\" of prisoners would be freed as a goodwill gesture.Opposition and human rights groups have said the government under Maduro for years used detentions of political prisoners to stamp out dissent and silence critics.Interim President Rodriguez has described the amnesty bill as being intended for the offering and receiving of forgiveness.Meanwhile, exiled opposition figurehead Edmundo González wrote on social media on Friday that there would be \"no lasting reconciliation without memory or responsibility\" in Venezuela. He added that a \"legitimate\" amnesty must come with \"truth, recognition and reparation\".Activists within the South American country have denounced delays to the amnesty law and a lack of transparency over who is being freed.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Venezuelan opposition politician released after amnesty law passed",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/58cf/live/96774be0-0e4c-11f1-9189-e7ebb4fb5ccd.jpg"
      ],
      "datePublished": "2026-02-20T13:37:44.000Z",
      "dateModified": "2026-02-20T13:37:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Authorities in Italy accuse man of training dog to illegally dump his rubbish",
    "url": "https://www.bbc.com/news/articles/cy57erz57xyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/af9f/live/3b795c80-0e5e-11f1-9120-a910fc22c6ac.png",
    "tag": "World",
    "date": "2026-02-20T15:57:17.000Z",
    "description": "Dog trained to illegally dump rubbish, Italian authorities say31 minutes agoKerena CobbinaWatch: Video footage shows a small dog carrying a bag along ",
    "body": "Dog trained to illegally dump rubbish, Italian authorities say31 minutes agoKerena CobbinaWatch: Video footage shows a small dog carrying a bag along a roadA dog owner in Italy has been accused of training their canine to dump bags of rubbish on the side of a road.Video footage released by police shows a small dog leisurely walking down a road in Catania's San Giorgio district in Sicily carrying a bag of rubbish in its mouth before dropping it.Local authorities say the dog's actions - which were captured on video on two consecutive days - are evidence that \"leaves little room for doubt\" the canine had been trained to drop off the bags so that its owner could avoid being filmed discarding them.Fly tipping is illegal in Italy, but it remains a common problem. Local authorities have been trying to step up efforts to get a grip on the issue by using methods such as surveillance cameras to catch culprits.\"Ingenuity can never become an alibi for incivility,\" the municipality of Catania said in a post on its official Facebook page.\"Respect for urban etiquette and the environment is everyone's duty,\" it added.The post did not say whether any action had been taken.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Authorities in Italy accuse man of training dog to illegally dump his rubbish",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/af9f/live/3b795c80-0e5e-11f1-9120-a910fc22c6ac.png"
      ],
      "datePublished": "2026-02-20T15:57:17.000Z",
      "dateModified": "2026-02-20T15:57:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Asos co-founder dies after Thailand balcony fall",
    "url": "https://www.bbc.com/news/articles/ce8w0n061ryo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5b0a/live/49b53ef0-0e30-11f1-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-20T14:35:49.000Z",
    "description": "Asos co-founder dies after Thailand apartment block fall2 hours agoOsmond Chia,Business reporterandJennifer Meierhans,Business reporterBloomberg via G",
    "body": "Asos co-founder dies after Thailand apartment block fall2 hours agoOsmond Chia,Business reporterandJennifer Meierhans,Business reporterBloomberg via Getty ImagesQuentin Griffiths died in the Thai city of PattayaA co-founder of online fashion giant Asos died after falling from a high-rise apartment block in Thailand, police have said.Quentin Griffiths has been named by Thai police as the man found dead on the ground in the eastern seaside city of Pattaya on 9 February.A police investigator told the BBC Griffiths, a British passport holder, was by himself, his room was locked from the inside, and there was no trace of any break-ins at the time of the death. An autopsy did not reveal any evidence of foul play.Griffiths co-founded Asos in 2000 and remained a significant shareholder after leaving the firm five years later.City AM/ShutterstockQuentin Griffiths, pictured in 2008An Asos spokesperson said: \"We're saddened to hear about the passing of Quentin, one of our original co-founders.\"He played an important role in Asos's earliest days and we're forever grateful for his contribution.\"Our thoughts are with his family and friends.\"A Foreign Office spokesperson said: \"We are supporting the family of a British national who has died in Thailand and are in contact with the local authorities.\"Police in Pattaya told the BBC Griffiths was found dead outside a luxury hotel where he had been staying in as a long-term resident in a suite on the 17th floor.He was involved in two ongoing court cases that might have caused him stress, police also told the BBC.Griffiths was separated from his second wife, a Thai national, and had reportedly been engaged in a legal dispute with her over a business they ran together, the BBC understands.He co-founded Asos in London with Nick Robertson, Andrew Regan and Deborah Thorpe.Its name originally stood for As Seen On Screen as it sold fashion inspired by clothing worn by TV and film stars.It grew to become an online fashion marketplace stocking hundreds of brands as well as its own lines and at one time was valued at more than £6bn.Its largest shareholders include Danish billionaire Anders Holch Povlsen - who owns Danish clothing giant Bestseller and Mike Ashley, owner of Frasers Group.Additional reporting by Thanyarat Doksone in BangkokIf you are suffering distress or despair, details of help and support in the UK are available at BBC Action Line",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Asos co-founder dies after Thailand balcony fall",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5b0a/live/49b53ef0-0e30-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-20T14:35:49.000Z",
      "dateModified": "2026-02-20T14:35:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Japan: Mystery donor gives $3.6m of gold to fix Osaka water system",
    "url": "https://www.bbc.com/news/articles/c3ew5jlqz87o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8c5d/live/0efb2e40-0dff-11f1-b8b6-79c822a78f72.png",
    "tag": "World",
    "date": "2026-02-20T02:55:04.000Z",
    "description": "Mystery donor gives Japanese city $3.6m in gold bars to fix water system14 hours agoKoh EweOsaka City Waterworks BureauOsaka authorities received 21kg",
    "body": "Mystery donor gives Japanese city $3.6m in gold bars to fix water system14 hours agoKoh EweOsaka City Waterworks BureauOsaka authorities received 21kg of gold bullion from a mystery donorA Japanese city has received a hefty donation to help fix its ageing water system: 21kg (46lb) in gold bars.The gold bars, worth an estimated 560 million yen ($3.6m; £2.7m), were given last November by a donor who wished to remain anonymous, Osaka Mayor Hideyuki Yokoyama told a press conference on Thursday.Home to nearly three million people, Osaka is a commercial hub located in the Japan's Kansai region and the country's third-largest city.But like many Japanese cities, Osaka's water and sewage pipes are ageing - a growing cause for safety concern.Osaka recorded more than 90 cases of water pipe leaks under its roads in the 2024 fiscal year, according to the city's waterworks bureau.\"Tackling ageing water pipes requires a huge investment. So I have nothing but appreciation,\" Yokoyama told reporters on Thursday, in response to a question about the huge gold donation.Yokoyama said the amount was \"staggering\" and he was \"lost for words\".The same mystery donor had previously given 500,000 yen in cash for municipal waterworks, he added.The city's waterworks bureau said in a statement on Thursday that it was grateful for the gold donation and would put it to good use - including tackling the deterioration of water pipes.More than 20% of Japan's water pipes have passed their legal service life of 40 years, according to local media.Sinkholes have also become increasingly common in Japanese cities, many of which have ageing sewage pipeline infrastructure.Last year, a massive sinkhole in Saitama Prefecture swallowed the cab of a truck, killing its driver. The sinkhole was believed to have been caused by a ruptured sewage pipe.That incident prompted Japanese authorities to step up efforts to replace corroded pipes across the country. But budget issues have stalled the progress of such pipe renewal works.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Japan: Mystery donor gives $3.6m of gold to fix Osaka water system",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8c5d/live/0efb2e40-0dff-11f1-b8b6-79c822a78f72.png"
      ],
      "datePublished": "2026-02-20T02:55:04.000Z",
      "dateModified": "2026-02-20T02:55:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Jharkhand: Mother and infant burnt to death over witchcraft allegations",
    "url": "https://www.bbc.com/news/articles/c98q93gdy3do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/07ce/live/7fe59480-0e2f-11f1-8cd2-611404a18f3d.jpg",
    "tag": "World",
    "date": "2026-02-20T10:10:42.000Z",
    "description": "6 hours agoMohammad Sartaj AlamBBC Hindi, JharkhandMohammad Sartaj Alam/BBCThe spot where the woman and child were burned after a mob stormed their ho",
    "body": "6 hours agoMohammad Sartaj AlamBBC Hindi, JharkhandMohammad Sartaj Alam/BBCThe spot where the woman and child were burned after a mob stormed their houseFour people have been arrested in the eastern Indian state of Jharkhand for allegedly burning to death a woman and her 10-month-old son on suspicion of practising witchcraft earlier this week.The woman's husband, who was also attacked, suffered severe burns and is in hospital.Police say they are searching for more people who may be involved. The accused are in custody and haven't commented publicly yet.According to the National Crime Records Bureau, more than 2,500 people, mostly women, were killed in India on suspicion of witchcraft between 2000 and 2016.Mohammad Sartaj Alam/BBCThe murders occurred in the Kudsai hamlet of Jharkhand stateSuch cases are often reported from areas inhabited by disadvantaged tribal communities, where superstition is rife and a non-existent public health system leads to dependence on quacks for medical advice.The murders in Jharkhand occurred in the Kudsai hamlet, a remote tribal settlement of around 50 mud houses located 250km (155.3 miles) from the state capital, Ranchi.​The violence appears to have been triggered by recent incidents in the village, including rumours of sudden cattle deaths and the illness and death of a local man named Pustun Birua.His wife Jano Birua says she consulted an informal healthcare provider - common in villages where no doctors are available - when he began suffering from anxiety and fainting spells. He told her that her husband was not suffering from any physical illness.Asked why she did not take him to a hospital, she said: \"We are poor people, so it wasn't possible to take him that far.\"Meanwhile, rumours spread that Jyoti Sinku was practising witchcraft and was responsible for the man's illness.Pustun Birua died on Tuesday evening. That night, according to Jyoti's husband Kolhan Sinku who is in hospital, a mob of about a dozen people, including five women, stormed their home and set fire to his wife and child.Recalling the horror from his hospital bed, he said: ​\"I pleaded with folded hands to have the matter resolved in the village council but the attackers didn't listen to me.\"Based on the testimonies of Kolhan Sinku and another family member, the district police have registered a complaint of murder and criminal conspiracy.Police say four men have been arrested and a special police team has been set up to track down other members of the mob.They added that they would organise programmes in rural areas to raise awareness against superstitions.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Jharkhand: Mother and infant burnt to death over witchcraft allegations",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/07ce/live/7fe59480-0e2f-11f1-8cd2-611404a18f3d.jpg"
      ],
      "datePublished": "2026-02-20T10:10:42.000Z",
      "dateModified": "2026-02-20T10:10:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Epstein eyed record label investment to access women, files suggest",
    "url": "https://www.bbc.com/news/articles/czx41k51595o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f4ab/live/e620b7e0-0cd4-11f1-a2e4-19f6f2c0e79a.jpg",
    "tag": "World",
    "date": "2026-02-20T01:07:40.000Z",
    "description": "15 hours agoBen KingBusiness reporterAFP via Getty ImagesEMI Records was one of the major players of the music industryWarning: this article contains ",
    "body": "15 hours agoBen KingBusiness reporterAFP via Getty ImagesEMI Records was one of the major players of the music industryWarning: this article contains offensive and derogatory languageJeffrey Epstein considered investing in music company EMI after his associate David Stern appeared to suggest it potentially offered access to women, recently released emails suggest.Epstein replied that he was interested, adding: \"Do we need help - mandelson? [sic]\"Stern and Lord Mandelson did not reply to requests for comment.Many of his emails to Epstein flagged potential deals, and in February 2010 he forwarded a short news article about the financial woes of EMI at the time. EMI is a now-defunct conglomerate that included EMI Records, formerly one of the major players of the music industry. It was acquired by Universal Music in 2012.\"Troubled industry but related to P,\" Stern wrote to Epstein.\"P\", which Epstein apparently used to refer to women, is believed to be an abbreviation of the word \"pussy\", another term Epstein often used.For birthdays and New Year greetings, Stern wished Epstein \"lots of P\", according to the recently released files. He once offered to get Epstein fashion show tickets \"to review Chinese P\". He would send Epstein a \"P factor\" for the places he visited, giving the Spanish island Ibiza 9/10, and Sarah Ferguson's 50th birthday party 0.2/10.The emails have been newly released by the US Department of JusticeAt the time Epstein had considered asking Stern for his help in an EMI investment, Lord Mandelson was First Secretary of State and Business Secretary in the UK government.Stern said it was \"too early to get Mandelson involved before i know more\".Epstein appears to have emailed Lord Mandelson a few days later, saying: \"please email me bens contact info.. or havehim cal me re emi. [sic]\"In reply, Lord Mandelson appears to say: \"Gave to [redacted]. Email is [redacted]. Talk re EMI ??\".It's not clear exactly who \"ben\" is.Epstein sent another reply to Stern, suggesting that if the deal went ahead, he would put US businessman and former Sony Music company CEO Tommy Mottola in charge of it.He wrote, \"my friend is tommy mottola former head of sony I'd like him to be brought in to fix it\".Mottola did not reply to a request for comment. US Department of JusticeAn image from the Epstein files showing David Stern at the opening of a new office for his company Asia Gateway in Beijing in 2011Epstein's proposed deal did not go ahead – and EMI's main lender Citigroup ended up taking control of the company.However later on, in 2011, Epstein's circle were still discussing a bid for EMI.Kevin Law, a businessmen in the US state of Connecticut who was often in touch with Epstein, apparently wrote: \"Tell your buddy Andrew from the UK if he's interested in EMI as we discussed I can put him in the syndicate w KKR.\" It is not clear if Epstein's \"buddy\" referred to here is Andrew Mountbatten-Windsor.PA MediaDavid Stern sits to the left of the Queen at a Pitch@Palace event at St James's Palace in London, in November 2016Law has said he \"never bid on EMI with any group nor did I ever do a business deal with Epstein,\" and said he did not know the former prince.The giant private equity firm KKR declined to comment. At the time KKR had a controlling stake in a rival record company, BMG.Stern was apparently still keen on acquiring a record company in 2011. He wrote: \"EMI may now come up for sale. Could actually be of interest to Chinese if structured properly. Also, most certainly great asset to have for P!\"However Epstein did not buy it then either.In November 2011, Citigroup split EMI into two parts and, the following year, sold it to Universal and a consortium involving Sony and record executive David Geffen.The DOJ files show other discussions between Epstein and associates about buying model agencies and fashion-related businesses, which also did not go ahead.French prosecutors have previously suspected that Epstein used his contact in the fashion industry, Jean-Luc Brunel, to house and transport young girls.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Epstein eyed record label investment to access women, files suggest",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f4ab/live/e620b7e0-0cd4-11f1-a2e4-19f6f2c0e79a.jpg"
      ],
      "datePublished": "2026-02-20T01:07:40.000Z",
      "dateModified": "2026-02-20T01:07:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Austrian climber found guilty after girlfriend froze to death on mountain",
    "url": "https://www.bbc.com/news/articles/c0k1xkllknmo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1d26/live/cb2c34f0-0e5f-11f1-b048-c9424b2cf5fd.png",
    "tag": "World",
    "date": "2026-02-20T11:10:31.000Z",
    "description": "5 hours agoBethany BellBBC Vienna correspondentReutersThomas P, who cannot be identified under Austrian law, is appealing against the guilty verdictAn",
    "body": "5 hours agoBethany BellBBC Vienna correspondentReutersThomas P, who cannot be identified under Austrian law, is appealing against the guilty verdictAn Austrian climber has been found guilty of gross negligent manslaughter after his girlfriend froze to death on Austria's highest mountain last year.The man, named only as Thomas P in line with Austrian privacy laws, has been given a five-month suspended sentence and fined €9,600 (£8,400).His girlfriend, Kerstin G, died of hypothermia during a climbing trip on the Grossglockner mountain in January 2025.In a statement sent to the BBC, the court said it considered Thomas P's previous clean record and the loss of a person close to him \"to be mitigating factors\". It said it also took into account \"the public discussion on social media, which was incriminating for the defendant\".The judge, Norbert Hofer, himself an experienced climber who works with mountain and helicopter rescue teams in Tyrol, said Thomas P was an excellent Alpinist, but that his girlfriend was light-years behind him in terms of her climbing abilities.He said the couple should have turned back as Kerstin G did not have enough experience in winter conditions.Although the judge decided Thomas P had misjudged the situation, he said he had not left her behind \"wilfully\": \"I don't see you as a murderer, I don't see you as cold-hearted.\"The court also heard from Andrea B, a former girlfriend of Thomas P, who described how he had left her alone on a previous tour on the Grossglockner in 2023. She said she had been at the end of her tether, feeling dizzy and her headlight had gone out. She said she was crying and screaming when he suddenly disappeared, walking ahead and leaving her behind.Grossglockner mountain in AustriaThe judge also questioned Thomas P's account of how he had left Kerstin on the mountainside. Hofer suggested instead that, based on her position in the photos taken by the rescue team, she may have had a fall.The court heard how the mountain rescue team found her body hanging upside down from a rock face, according to Austrian reports.\"We were amazed that she remained in that position,\" one of the rescuers told the court. If the wind had been any stronger, \"she would have fallen over the south face\".The prosecution said there were strong winds of up to 74 km/h (45 mph), and it was very cold. It was -8C, with a windchill temperature of -20C, they said.They argued that as the more experienced climber, Thomas P was \"the responsible guide for the tour\". They said he failed to turn back or call for help in time to help his girlfriend.Thomas P should never have allowed himself to get into this situation, the prosecutor said.Thomas P pleaded not guilty. He told the court he was deeply sorry. He said he had loved his girlfriend, who was very sporty and that they had planned the trip together.His lawyer Kurt Jelinek said the couple had found themselves in a really difficult and stressful situation.He said Kerstin G was not inexperienced and knew what she was getting into.Her parents told the court she had been \"really active\" in mountaineering since 2020, and her mother said she would not have \"gone along blindly\".Forensic pathologist Claudia Wöss confirmed to the court that she had died of hypothermia, adding that she had found evidence of viral pneumonia and the painkiller ibuprofen in Kerstin G's body. She was unable to assess whether her physical capacity had been impaired by the illness, and if it had made a sudden decline in her condition more likely.www.foto-webcam.euThis still from webcam footage shows the couple still climbing at 21:00 on 18 JanuaryProsecutors say the couple got stuck on the mountain and that Thomas P failed to call the police and did not send any distress signals when a police helicopter flew overhead at around 22:30.Video footage from the helicopter showed the couple still climbing. The judge noted that no distress signals were sent.The defence argued that at that point Thomas P and girlfriend still felt fine and did not call for help as they were close to the summit.Webcam images show lights from their torches as they scaled the mountain.But shortly afterwards, the defence said the situation changed dramatically, when Kerstin G became exhausted close to the summit.The defence said that she told Thomas P to go to get help.At 00:35 on 19 January, he called the mountain police. The content of the conversation is disputed. Rescuers said it wasn't an emergency call but the lawyer says he denies telling police that everything was fine.He scaled the summit and descended on the other side, leaving Kerstin G behind. Prosecutors say he left her at 02:00.Webcam images show his torch-lit figure coming down from the summit.The trial sparked interest and debate, not just in Austria but in mountain climbing communities far beyond its borders, raising questions about when personal judgement and risk-taking become a matter of criminal liability.The case is subject to appeal.Get our flagship newsletter with all the headlines you need to start the day. Sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Austrian climber found guilty after girlfriend froze to death on mountain",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1d26/live/cb2c34f0-0e5f-11f1-b048-c9424b2cf5fd.png"
      ],
      "datePublished": "2026-02-20T11:10:31.000Z",
      "dateModified": "2026-02-20T11:10:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump directs US government to prepare release of files on aliens and UFOs",
    "url": "https://www.bbc.com/news/articles/c4g57gqqln1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f0ac/live/6302f260-0de7-11f1-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-20T08:07:16.000Z",
    "description": "8 hours agoGrace Eliza GoodwinWatch: Obama gave \"classified information\" with alien comments, says TrumpUS President Donald Trump says he will direct ",
    "body": "8 hours agoGrace Eliza GoodwinWatch: Obama gave \"classified information\" with alien comments, says TrumpUS President Donald Trump says he will direct US agencies, including the defence department, to \"begin the process of identifying and releasing\" government files on aliens and extraterrestrial life. Trump made the declaration in a post on Truth Social, after he accused Barack Obama earlier in the day of revealing classified information when the former president said \"aliens are real\" on a podcast last week. \"He's not supposed to be doing that,\" Trump told reporters aboard Air Force One, adding: \"He made a big mistake.\"Asked if he also thinks aliens are real, Trump answered: \"Well, I don't know if they're real or not.\"Former US President Obama told podcast host Brian Tyler Cohen that he thinks aliens are real in an interview released last Saturday. \"They're real, but I haven't seen them, and they're not being kept in Area 51,\" Obama said. \"There's no underground facility unless there's this enormous conspiracy and they hid it from the president of the United States.\"After the comment made headlines, Obama sought to clarify he thinks it is statistically likely life exists beyond Earth, given the vastness of the universe. In a follow-up post on Instagram, Obama, who served as US president between 2009-17, clarified: \"I saw no evidence during my presidency that extraterrestrials have made contact with us. Really!\" Obama's initial comments were made during a quickfire \"lightning\" round of questions on the podcast.There was no indication that Obama relied on classified information when he gave the interview. The BBC has contacted Obama for comment. The Democrat and Trump, a Republican, are longstanding mutual political antagonists.For his part, Trump said on Thursday on Air Force One that while a lot of people believe in the existence of aliens, he never talks about it, and \"doesn't have an opinion on it\". Then a few hours later, he posted on Truth Social that \"based on the tremendous interest shown\" he will seek the release of files \"related to alien and extraterrestrial life, unidentified aerial phenomena (UAP), and unidentified flying objects (UFOs), and any and all other information connected to these highly complex, but extremely interesting and important, matters\".The US has seen renewed public interest in UFOs and extraterrestrial life in recent years, sparked in 2017 by reports about a secret Pentagon programme to probe testimony from pilots and other US military members who had reported seeing strange objects in the sky.In 2022, Congress held the first hearings on UFOs in 50 years and the Pentagon promised more transparency on the matter - setting up a dedicated office to collect reports of all military UFO encounters.The following year, a US House of Representatives panel on the topic produced no major bombshells nor confirmation of alien life. In a 2024 report, the Pentagon said there was \"no evidence\" that the US government had encountered alien life, and that most UFO sightings were just ordinary objects. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump directs US government to prepare release of files on aliens and UFOs",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f0ac/live/6302f260-0de7-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-20T08:07:16.000Z",
      "dateModified": "2026-02-20T08:07:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says world has 10 days to see if Iran agrees deal or 'bad things happen'",
    "url": "https://www.bbc.com/news/articles/c86yjnw4x49o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/043b/live/ff016940-0daa-11f1-9fe5-57999fe11004.jpg",
    "tag": "World",
    "date": "2026-02-20T05:45:43.000Z",
    "description": "11 hours agoBernd Debusmann JrWhite House reporter Getty ImagesTrump told the Board of Peace, Trump said that talks with Iran have been 'very good' bu",
    "body": "11 hours agoBernd Debusmann JrWhite House reporter Getty ImagesTrump told the Board of Peace, Trump said that talks with Iran have been 'very good' but historically difficult. US President Donald Trump says the world will find out \"over the next, probably, 10 days\" whether the US will reach a deal with Iran or take military action.At the first meeting of his Board of Peace in Washington DC, Trump said of negotiations with the Islamic Republic about its nuclear programme: \"We have to make a meaningful deal otherwise bad things happen.\" In recent days, the US has surged military forces to the Middle East, while progress was reported at talks between American and Iranian negotiators in Switzerland. The Iranian government has told the UN Secretary-General that it will regard US bases in the region as legitimate targets if used in any military aggression against Iran. Tehran's UN mission said in a letter to UN Secretary-General António Guterres that Trump's rhetoric signalled a real risk of an attack - but it said Iran did not want a war.Democratic lawmakers, and some Republicans, have voiced opposition to any potential military action in Iran without congressional approval.In his remarks, Trump noted that Special Envoys Steve Witkoff and Jared Kushner, who is also Trump's son-in-law, had \"some very good meetings\" with Iran. \"It's proven to be, over the years, not easy to make a meaningful deal with Iran,\" he said. \"Otherwise bad things happen.\" One day earlier, White House press secretary Karoline Leavitt warned that Iran would be \"very wise\" to make a deal with the US, adding that Trump was still hoping for a diplomatic solution over Tehran's nuclear programme. When Trump first announced the Board of Peace, it was thought to be aimed at helping end the two-year war between Israel and Hamas in Gaza and oversee reconstruction. But in the last month its mission has appeared to go beyond one conflict, with many wondering if the Trump-chaired board, made up of about two dozen countries, is meant to sideline the United Nations.US missile and aircraft struck three Iranian nuclear facilities in June last year, and the White House was reportedly discussing new attack options this week. American forces have been ramping up their presence in the region in recent weeks, including the deployment of the USS Abraham Lincoln aircraft carrier.In previous military operations in the Middle East, the US used RAF Fairford, in Gloucestershire, and the UK overseas territory of Diego Garcia, in the Indian Ocean. Satellite images have also shown that Iran has reinforced military facilities, and the country's Supreme Leader, Ayatollah Ali Khamanei, has posted messages to social media threatening US forces. \"The US President constantly says that the US has sent a warship toward Iran. Of course, a warship is a dangerous piece of military hardware,\" one of Khamenei's posts read. \"However, more dangerous than that warship is the weapon that can send that warship to the bottom of the sea.\"Several members of US Congress have expressed opposition to any military action against Iran. California Democrat Ro Khanna and Kentucky Republican Thomas Massie have said they will try to force a vote on the matter next week, citing the 1973 War Powers Act. The act grants Congress the ability to check the president's power to commit the US to armed conflict.\"A war with Iran would be catastrophic,\" Khanna posted on social media. \"Iran is a complex society of 90 million people with significant air defences and military capabilities.\"He also said thousands of US troops in the region \"could be at risk of retaliation\".The chances of passage in both chambers of Congress are not strong.In January, Senate Republicans blocked a similar war powers resolution that would have required the Trump administration to obtain congressional approval before launching further military operations in Venezuela following the capture of Nicolas Maduro.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says world has 10 days to see if Iran agrees deal or 'bad things happen'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/043b/live/ff016940-0daa-11f1-9fe5-57999fe11004.jpg"
      ],
      "datePublished": "2026-02-20T05:45:43.000Z",
      "dateModified": "2026-02-20T05:45:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Cameroon soldiers handed rare prison sentences after killing of 21 civilians in Northwest region",
    "url": "https://www.bbc.com/news/articles/cev74dywd7eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/567f/live/e26fabc0-0e5e-11f1-9120-a910fc22c6ac.jpg",
    "tag": "World",
    "date": "2026-02-20T13:44:30.000Z",
    "description": "3 hours agoPaul NjieBBC Africa, YaoundéAFP via Getty ImagesThe conflict in the Anglophone reasons has lasted for almost a decadeThree Cameroonian sold",
    "body": "3 hours agoPaul NjieBBC Africa, YaoundéAFP via Getty ImagesThe conflict in the Anglophone reasons has lasted for almost a decadeThree Cameroonian soldiers have been sentenced to prison for their role in the killing of at least 21 civilians in the country's troubled Anglophone region.The jail terms for the crimes, which took place six years ago in the Northwest region, range from five to 10 years per person.A military court previously found the soldiers guilty of murder, arson and destruction - a rare occurrence in a country where military personnel are seldom convicted of crimes against civilians.Nevertheless, lawyers for the victims told the BBC they were disappointed with the length of the jail terms handed down on Thursday, calling them \"insignificant\".The convictions centre on the events of 14 February 2020, when soldiers, supported by a local militia of ethnic Fulanis, raided the village of Ngarbuh and killed civilians.The victims included 13 children, according to Human Rights Watch, who added that the assailants burnt down homes and beat up residents.What followed was a rare instance of Cameroon's government acknowledging the atrocities of its soldiers in the Anglophone regions, which have been wracked by a separatist conflict for nearly 10 years.The authorities initially denied responsibility for the attack on Ngarbuh but later backpedalled following international pressure and the findings of an investigation ordered by the country's President, Paul Biya.Alongside the three soldiers sentenced on Thursday evening, a militia member also received a jail term for murder, arson and destruction. One of the victims' lawyers, Sother Menkem, told the BBC: \"The sentence was so mild, I even qualify it as friendly because we are talking of a massacre.\"Menkem pointed out that under Cameroonian law, the minimum sentence for felonies such as murder and arson is 10 years.\"I expected at least 30 years' imprisonment or more because [the soldiers] instilled much fear on the inhabitants of that area,\" he said.The soldiers' lawyers argued that their clients were merely doing their job.A man who lost several relatives in the February 2020 attack told the BBC he needed time to process the court's decision.He has since moved out of the conflict-hit region for safety reasons.The military court rejected the victims' demand for compensation, a move decried by another of their lawyers, Richard Tamfu.Human Rights Watch and legal representatives of the victims have insisted that the soldiers were acting on the instructions from their superiors and therefore criticise the fact that no senior military officer was prosecuted at the trial.The case dragged on for six years after hearings were postponed multiple times.Since 2017, separatist fighters in the country's two English-speaking regions have been campaigning for the creation of a breakaway state. Human rights groups have accused both the rebels and state forces of committing widespread abuses.The UN says the conflict has killed at least 6,000 people and forced over half a million others to flee their homes.More about Cameroon from the BBC:Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Cameroon soldiers handed rare prison sentences after killing of 21 civilians in Northwest region",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/567f/live/e26fabc0-0e5e-11f1-9120-a910fc22c6ac.jpg"
      ],
      "datePublished": "2026-02-20T13:44:30.000Z",
      "dateModified": "2026-02-20T13:44:30.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Grey's Anatomy star Eric Dane dies at 53 after ALS diagnosis",
    "url": "https://www.bbc.com/news/articles/c78j01n775ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/15be/live/432eaa20-0e45-11f1-8705-e59653a64488.jpg",
    "tag": "World",
    "date": "2026-02-20T10:33:48.000Z",
    "description": "6 hours agoJessica MurphyGetty ImagesEric Dane, the actor best known for his roles on Grey's Anatomy and Euphoria, has died less than a year after rev",
    "body": "6 hours agoJessica MurphyGetty ImagesEric Dane, the actor best known for his roles on Grey's Anatomy and Euphoria, has died less than a year after revealing he had amyotrophic lateral sclerosis (ALS). He was 53. Dane starred as family patriarch Cal Jacobs on hit HBO teen drama Euphoria. Before that, he was perhaps best known as Dr Mark Sloan, or \"Dr McSteamy\", on medical drama Grey's Anatomy.The California-born actor shared his ALS diagnosis in April 2025 and spent his final months raising funds and awareness for the most common form of motor neurone disease (MND).His family said in a statement: \"With heavy hearts, we share that Eric Dane passed on Thursday afternoon following a courageous battle with ALS.\"Getty ImagesDane first appeared in the second series of Grey's Anatomy in 2006 before returning as a main cast memberDane was married to fellow actress and model Rebecca Gayheart, with whom he had two children.The statement said he spent his final days surrounded by friends and his devoted wife, and his two daughters, Billie and Georgia, \"who were the center of his world\". \"He will be deeply missed, and lovingly remembered always. Eric adored his fans and is forever grateful for the outpouring of love and support he's received.\"How Eric Dane gave his final months to 'moving the needle' on ALSThe mystery of why some people develop ALSThe actor was born in San Francisco in 1972 and made his television debut in the Wonder Years in 1993. He went on to star as Jason Dean in fantasy drama series Charmed, and Captain Tom Chandler in action drama show The Last Ship, while appearing in films such as Marley & Me, Valentine's Day and Burlesque.'A joy to work with'Dane's Grey's Anatomy co-stars led tributes to the late actor. Patrick Dempsey, who played Dr. Derek Shepherd, described him as being \"a joy to work with\".\"He was the funniest man – he was such a joy to work with and I want to just remember him in that spirit because any time he was on set, he brought so much fun to it. He had a great sense of humour,\" Dempsey told Virgin Radio.He added that Dane was \"wickedly intelligent\", and also did \"an incredible job at bringing awareness to this horrible disease\".Kim Raver - who plays doctor Teddy Altman in the series - said: \"During filming he'd get this twinkle in his eye and with a mischievous look, he would deliver with perfect comedic timing, a line of dialogue that would floor you.\" Kevin McKidd, who plays trauma surgeon Owen Hunt, posted \"rest in peace buddy\" on Instagram.Getty ImagesDane spent his final months advocating for ALS research and awarenessEuphoria creator Sam Levinson told Variety: \"I'm heartbroken by the loss of our dear friend.\"\"Working with him was an honor. Being his friend was a gift,\" he said.His Charmed co-star Alyssa Milano meanwhile wrote that her \"heart is with the people who were lucky enough to be his home\".\"When it came to his daughters and Rebecca, everything in him softened. He carried them with him even in rooms where they weren't present... A breathtakingly beautiful family.\"Ashton Kutcher, who starred alongside Dane in 2010's Valentine's Day, also paid tribute on social media: \"Miss you, buddy.  Let's keep fighting the fight to solve ALS.\"Nina Dobrev separately said he \"led with kindness and made everyone on our set feel seen\". The pair starred together in 2022's Redeeming Love.\"He was warm, generous, prepared, and so passionate about what he did,\" she wrote on Instagram. \"ALS is a cruel and unforgiving disease. May his memory inspire more research, awareness, and progress toward a cure.\"Eddy Chen/HBODane played the father of Oscar-nominee Jacob Elordi's Nate in Euphoria, which debuted in 2019Since sharing his diagnosis 10 months ago, Dane advocated for research and awareness surrounding the progressive condition.In November, he appeared on screen as a firefighter struggling to accept support following an ALS diagnosis in an episode of NBC medical drama Brilliant Minds.Earlier this month, he was named one of Time magazine's 100 most influential people in health for his advocacy work.\"I'm trying to save my life,\" Dane told the publication, \"and if my actions can move the needle forward for myself and countless others, I'm satisfied\".In December, he had joined the board of directors of Target ALS, an organisation dedicated to research for effective ALS treatments and a cure - who said he had helped one of its campaigns surpass a fundraising target of $500,000 (£371,000).He also appeared in a video for a separate fundraising campaign in September in which he said he was \"an actor... a father and now a person living with ALS\", and spoke about \"finally, finally push toward ending this disease\".In June, he told ABC's Good Morning America that the diagnosis had made him \"angry\" because he had lost his father, who died by suicide, as child: \"There's a very good chance I'm going to be taken from my girls while they're very young.\"What is ALS?According to the NHS, MND \"encompasses several different conditions whose common feature is the premature degeneration of motor nerves (known as neurons or sometimes neurones)\".It says nearly 90% of patients with MND have the mixed ALS form of the disease.Also known as Lou Gehrig's disease, is a rare degenerative disease that causes progressive paralysis of the muscles.There is no cure for ALS, and, according to the Muscular Dystrophy Association, people usually live for three to five years after diagnosis although some can live for decades.Correction 20 February 2026: An earlier version of this story incorrectly said Kim Raver played Eric Dane's on-screen wife in Grey's Anatomy. Their characters had a short-lived romance but were not married.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Grey's Anatomy star Eric Dane dies at 53 after ALS diagnosis",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/15be/live/432eaa20-0e45-11f1-8705-e59653a64488.jpg"
      ],
      "datePublished": "2026-02-20T10:33:48.000Z",
      "dateModified": "2026-02-20T10:33:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sangram Patil: UK doctor stranded in India after police case over Facebook post",
    "url": "https://www.bbc.com/news/articles/c5ydjd6ep73o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/36d6/live/c76ad1d0-f692-11f0-a096-99c1f7341c2b.jpg",
    "tag": "World",
    "date": "2026-02-20T06:52:25.000Z",
    "description": "10 hours agoAlpesh KarkareBBC MarathiSangram Patil/YouTubeSangram Patil is a consultant with the UK's National Health ServiceA British doctor has been",
    "body": "10 hours agoAlpesh KarkareBBC MarathiSangram Patil/YouTubeSangram Patil is a consultant with the UK's National Health ServiceA British doctor has been unable to leave India for more than a month after police opened a case against him over a social media post about a top politician of the governing Bharatiya Janata Party (BJP).Sangram Patil, a UK citizen of Indian origin who works with the NHS, was stopped from taking a flight back to London from Mumbai on 19 January after a lookout circular was issued against him - a notice that prevents a person under investigation from leaving the country.He is being investigated for allegedly posting \"objectionable content\" about a BJP leader. Patil, who has a substantial following on Facebook and YouTube, has called the action against him \"unlawful\".It's not clear when the doctor will be allowed to go back to the UK. He has approached a court, seeking the police case registered against him be dropped and travel restrictions imposed on him be removed. The matter is due to be next heard on 27 February.\"My children and my job are in the UK. International law and Indian law give me the right to move freely. Restrictions have been imposed on that. I am not able to go home,\" he told BBC Marathi last week.The BBC has reached out to the Mumbai police, which is investigating the case, for a comment. A spokesperson from the UK's Foreign, Commonwealth and Development Office did not offer specifics but said last week that they \"are supporting a British man in India and are in contact with the local authorities\".Police say they are investigating Patil over a complaint filed by Nikhil Bhamre, who handles BJP's social media in the western state of Maharashtra of which Mumbai is the capital.Bhamre's complaint, registered on 18 December, accuses Patil of publishing \"objectionable content\" against a top BJP leader on Facebook. The complaint did not name the BJP leader who was targeted, but it came four days after Patil had posted a comment about Prime Minister Narendra Modi on Facebook.The police complaint that BBC has seen a copy of contains a link to this post. According to the police complaint, Bhamre alleged that \"the post could create hostility between various groups that support and oppose the BJP's ideology\".Police registered a case against Patil under India's criminal code \"for making statements containing false information that could lead to a feeling of enmity and hatred between communities\". The offence is bailable and carries a maximum sentence of up to three years.Patil has rejected the allegations, saying it was \"unlawful to register such a complaint against me for that social media post\".\"My post is a simple question to government supporters and nothing else. It doesn't involve any community, any rumour or sensational news,\" Patil told BBC Marathi.He said he was first questioned for more than 10 hours when he arrived in Mumbai on 10 January with his wife, and again for eight hours on 16 January. He said he had provided \"written answers to all\" the police questions and asked for the lookout circular to be withdrawn so he could return to the UK on 19 January.He said officers told him the process to cancel the notice had been initiated, but he was stopped at the airport on the day of his flight.Being questioned for more than 20 hours over what he described as a single line on social media felt like \"targeted harassment\", he added.In an affidavit filed on 30 January, police defended the action against Patil saying the investigation was at a crucial stage and \"the possibility of an organised effort to malign constitutional authority cannot be ruled out\".\"It is a matter of serious concern, warranting investigation as to why a foreign citizen, despite being a qualified medical professional, visiting India on a Tourist e-Visa, has engaged in posting defamatory, scandalous, obscene and inflammatory material without any substance and basis against the prime minister of India while residing outside the country,\" the police told the court.They have also urged the court to dismiss Patil's \"misconceived and premature\" plea challenging the investigation against him. In a rejoinder filed in court last week, Patil denied the allegations. According to court filings reported by The Indian Express newspaper, he \"categorically denied\" writing any post naming or referring to the prime minister, adding that \"criminal prosecution cannot be founded on subjective political interpretation or perceived sentiment\".Get our flagship newsletter with all the headlines you need to start the day. Sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sangram Patil: UK doctor stranded in India after police case over Facebook post",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/36d6/live/c76ad1d0-f692-11f0-a096-99c1f7341c2b.jpg"
      ],
      "datePublished": "2026-02-20T06:52:25.000Z",
      "dateModified": "2026-02-20T06:52:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Lion DNA convicts poachers in world first",
    "url": "https://www.bbc.com/news/articles/c4grxvdyy00o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d3fa/live/8ffa8f30-0bfd-11f1-b726-1d6e709ef554.gif",
    "tag": "World",
    "date": "2026-02-20T00:23:10.000Z",
    "description": "Lion DNA helps convict poachers for first time16 hours agoAngus CrawfordBBC News InvestigationsGetty ImagesA male lion in Hwange National Park, Zimbab",
    "body": "Lion DNA helps convict poachers for first time16 hours agoAngus CrawfordBBC News InvestigationsGetty ImagesA male lion in Hwange National Park, ZimbabweLion DNA has been used to successfully prosecute poachers for the first time in the world, it has emerged.Wildlife crime experts have only just revealed how they were able to identify the individual animal from body parts found in a suspect's village, as they matched a profile on Zimbabwe's lion database.A blood sample had previously been taken from the male lion, which was being tracked by authorities in Hwange National Park - using a radio collar.Two poachers were convicted for the 2024 incident and sent to prison in what is thought to be the first prosecution of its kind.The details of the convictions and the role the DNA database played have been previously unknown.Non-governmental organisation (NGO) Traffic, which works to combat the illegal trade in wildlife, has shared the detail with us.In May 2024, authorities in Hwange National Park became suspicious after a radio collar worn by a male lion stopped working.Investigators and police traced its last known position and found a snare with lion fur attached to it.After collecting forensic evidence they questioned two men in a nearby village and discovered three sacks of meat, 16 lion claws and four teeth. These body parts would later be tested against the database, with the DNA from all matching the profile of that missing lion.TRACE, Simon DuresA lab in Zimbabwe created a DNA database of all lions in the countryBut possessing lion parts is not necessarily a crime in Zimbabwe.Having them can be explained away as old, traditional ornaments or as coming from an animal that died of natural causes.This has been an obstacle to prosecutions in the past.But thanks to a breakthrough in DNA profiling, that's now changed.The lab generated a DNA profile from the recovered body parts and compared this to the profile previously generated from a blood sample of the lion with the radio collar.The two profiles matched and scientists were able to identify the specific missing animal.TRACE, Simon DuresThe scientist was able to match the two DNA profilesOver the last eight years the Victoria Falls Wildlife Trust (VFWT) has received about £250,000 from the People's Postcode Lottery in the UK to build up the DNA database of lions in Zimbabwe.The scientist at the trust, who made the discovery, asked to remain anonymous for his own safety, but said:\"Before we had access to this technology, we were only able to do species identification, but sometimes that's not enough.\"We can essentially match those claws or those products to the lion of interest that we are looking for.\"Within 10 days of the killing, the DNA evidence was presented in court.Two men pleaded guilty and were given 24 month prison sentences.The hearing was told the value of the lion was about $20,000.Richard Scobey, Traffic's executive director, said \"countries now have the forensic capability to bring, solid science-based evidence to court\" and that it will have global impact.TRAFFIC, Viv WilliamsLion bones are sold for use in traditional Chinese medicine. Teeth and claws are bought as jewelleryThis is understood to be the first time that DNA from an individual lion has been identified and used to prosecute poachers.Professor Rob Ogden has been closely involved in setting up the project and is co- founder of the organisation Trace, which promotes the use of forensic science in wildlife law enforcement.He says the prosecution gives \"a message of hope\" and shows what can be done using a combination of training, research and development and forensic casework.Recent figures suggest an increase in the number of lions being killed for their body parts which are then sold both as cultural objects in Africa and for traditional Chinese medicine.It is thought the rise may be down to organised crime gangs also involved in the illegal trade in Rhino horn and ivory trafficking.In Mozambique between 2010 and 2023, 426 lions were killed as a result of contact with humans with a quarter linked to deliberate poaching. A measure of the scale of the trade is also the number of seizures by the authorities in recent years.That includes 17 lion skulls found in Lusaka in 2021, reportedly en-route from South Africa, and a 2023 seizure in Maputo of more than 300kg of lion body parts.Which is why this breakthrough on DNA identification is seen as sending an important message to would-be poachers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lion DNA convicts poachers in world first",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d3fa/live/8ffa8f30-0bfd-11f1-b726-1d6e709ef554.gif"
      ],
      "datePublished": "2026-02-20T00:23:10.000Z",
      "dateModified": "2026-02-20T00:23:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tunisia MP Ahmed Saidani jailed over posts mocking President Kais Saied",
    "url": "https://www.bbc.com/news/articles/c3v75lvgy36o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9d20/live/da9c8ba0-0e24-11f1-af6b-3b0e711cc83a.jpg",
    "tag": "World",
    "date": "2026-02-20T11:35:53.000Z",
    "description": "Tunisian MP jailed for eight months over posts mocking president5 hours agoWycliffe MuiaReutersPresident Kais Saied has been accused of curtailing pol",
    "body": "Tunisian MP jailed for eight months over posts mocking president5 hours agoWycliffe MuiaReutersPresident Kais Saied has been accused of curtailing political freedomsA Tunisian court has sentenced a lawmaker to eight months in prison over social media posts mocking President Kais Saied following recent deadly floods. Ahmed Saidani was arrested earlier this month after he posted on social media about Saied's visits to flood-hit areas, calling him the \"supreme commander of sanitation and rainwater drainage\".He was jailed on Thursday on charges of insulting others via communication networks, a judicial official said.Saidani's lawyer, Houssem Eddine Ben Attia, told AFP news agency that his client was being prosecuted under a telecommunications law against \"harming others via social media\", an offence punishable by up to two years in prison.Human rights groups have criticised what they describe as an escalation of Saied's crackdown on dissent since he suspended Tunisia's parliament in 2021 and began ruling by decree.Saidani, once a supporter of Saied's consolidation of power and the arrest of opposition figures, has recently turned into an outspoken critic of the president.In his Facebook post, the lawmaker mocked the president for \"taking up the hobby of taking photos with the poor and destitute\" while visiting flooded areas in the capital, Tunis and other parts of the country. AFP via Getty ImagesAt least five people died after unexpectedly heavy rainfall in Tunisia last month Saidani, who was elected as a lawmaker in 2022, has also accused the president of monopolising decision-making while avoiding responsibility, leaving others to take the blame.\"This is a violation of the law and an attack on institutions. How can parliament hold the executive authority to account if it carries out an unlawful arrest over critical views,\" fellow MP Bilel Mechri told Reuters news agency.At least five people died and several remain missing after Tunisia experienced its heaviest rainfall in over 70 years last month.President Saied was elected in 2019 promising a return to stable government following years of political instability after long-time leader Zine al-Abidine Ben Ali was ousted by the \"Arab Spring\" street protests in 2011.His critics accuse him of reimposing aspects of authoritarian rule and curtailing political freedoms. The 67-year old leader rejects claims of dictatorship, insisting he is upholding the law and working to \"cleanse\" the country.Tunisian lawmakers have parliamentary immunity, protecting them from arrest while performing their official duties, though they can be detained for committing a criminal offence.More about Tunisia from the BBC:Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tunisia MP Ahmed Saidani jailed over posts mocking President Kais Saied",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9d20/live/da9c8ba0-0e24-11f1-af6b-3b0e711cc83a.jpg"
      ],
      "datePublished": "2026-02-20T11:35:53.000Z",
      "dateModified": "2026-02-20T11:35:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]