[
  {
    "title": "Clashes between police and Gen Z protesters in Peru leave one dead",
    "url": "https://www.bbc.com/news/articles/czjp79j2emro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6fa7/live/8f453200-aa8e-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "World",
    "date": "2025-10-16T12:50:25.000Z",
    "description": "Clashes between anti-government protesters and riot police in the Peruvian capital, Lima, have left a 32-year-old man dead and more than 100 people in",
    "body": "Clashes between anti-government protesters and riot police in the Peruvian capital, Lima, have left a 32-year-old man dead and more than 100 people injured, including many police officers.The protests come less than a week after José Jerí was sworn in as the interim president following the impeachment of his predecessor in office, Dina Boluarte.Wednesday's demonstrations were organised by mainly young Peruvians who demand that the country's political class do more to combat high levels of crime and corruption. President Jerí said the protest had been infiltrated by criminals set on causing chaos and launched an investigation into the circumstances surrounding the protester's death.He wrote on X that he \"regretted the death\" of Eduardo Ruiz Sáenz, but did not give further details as to what caused it. Ruth Luque, a left-wing member of Congress, meanwhile said that \"preliminary information\" indicated the hip hop artist had been killed by a bullet wound to the chest. Luque posted a photo of herself on social media in which she can be seen speaking to a member of staff at the hospital to which many of those injured in the clashes were taken.Local media quoted witnesses who said they saw the musician being shot by a man they accused of being a plainclothes police officer.President Jerí said an investigation would be launched \"to determine objectively what happened and who is responsible\".Jerí of the conservative Somos Perú party was sworn into office on Friday last week after the then-President, Dina Boluarte, was impeached on grounds of \"permanent moral incapacity\".Jerí is the seventh president to lead Peru in the space of eight years.As head of parliament, he was next in line to fill the post left vacant following Boluarte's ouster, to serve out the remainder of her term until the presidential election scheduled for April of next year.But within days of him taking office, anger at what protesters call the \"political class\" has spread with thousands taking to the streets to demand \"a clean slate\".The protesters also demanded that the government do more to combat corruption and crime, specifically a wave of extortions which has seen bus and taxi drivers threatened by gangs.Young activists organised protests in several major cities and demanded that Jerí step aside in favour of an independent lawmaker. In a message uploaded to TikTok, one of them calling himself \"Lando\" accused Jerí's party of having propped up Boluarte, whose popularity rates were in the single figures before her removal. Somos Perú, which in the past had backed Boluarte, switched sides last week and joined the chorus of those demanding she be impeached. Analysts say that the armed attack by gunmen on a band on 8 October and the outcry it triggered meant that lawmakers who had previously supported Boluarte felt her position had become untenable. The ex-president remains in Peru and said earlier this week that she would stay in the country pending several investigations into alleged abuses of power, which she denies. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Clashes between police and Gen Z protesters in Peru leave one dead",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6fa7/live/8f453200-aa8e-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-16T12:50:25.000Z",
      "dateModified": "2025-10-16T12:50:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "BBC Verify: Aid group suspends Gaza operations after ceasefire",
    "url": "https://www.bbc.com/news/articles/cgjd783ywn3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/141c/live/1a9fc450-aac6-11f0-b2a1-6f537f66f9aa.png",
    "tag": "World",
    "date": "2025-10-16T19:58:28.000Z",
    "description": "8 hours agoKevin Nguyen,Phil Leake andMerlyn ThomasBBCThe controversial US and Israeli-backed Gaza Humanitarian Foundation (GHF) has confirmed it susp",
    "body": "8 hours agoKevin Nguyen,Phil Leake andMerlyn ThomasBBCThe controversial US and Israeli-backed Gaza Humanitarian Foundation (GHF) has confirmed it suspended operations in Gaza after the ceasefire deal between Israel and Hamas came into effect on 10 October.Despite being funded until November, the organisation said its final delivery was on Friday.The GHF has been heavily criticised after hundreds of Palestinians were killed while collecting food near its distribution sites. Witnesses say most were killed by Israeli forces.Israel has regularly denied that its troops fired on civilians at or near the sites and the GHF has maintained that aid distribution at its sites has been carried out \"without incident\".The group's northernmost aid distribution site, known as SDS4, was shut down because it was no longer in IDF-controlled territory, said a spokesman.Satellite imagery revealed it was dismantled shortly after the 10 October ceasefire came into effect. Images show tyre tracks, disturbed earth and detritus strewn across the former compound.\"Right now we're paused,\" the GHF spokesman said. \"We feel like there's still a need, a surge for as much aid as possible. Our goal is to resume aid distribution.\"Despite the group's apparent desire to continue there has been speculation the final terms of the ceasefire deal between Hamas and Israel would exclude them.Meanwhile, analysis of UN-supplied data shows little change in aid collected from crossings after the ceasefire deal came into effect last Friday.The average amount of aid \"collected\" - defined by the UN as when it leaves an Israeli-controlled crossing - each day has increased slightly compared with the previous week, but it remains in line with September figures.UN data shows about 20% of aid leaving a crossing has made it to its intended destination since 19 May. More than 7,000 aid trucks have been \"intercepted\" either \"peacefully by hungry people or forcefully by armed actors\", according to UN data.Aid sources told the BBC they hoped looting would subside in coming weeks as law and order is re-established and the populace is given assurances the ceasefire would hold.A spokesperson from the United Nations Office for the Coordination of Humanitarian Affairs (OCHA) said while it was critical for the ceasefire to allow for an increase in aid and other essential supplies, it was important to reach vulnerable Gazans, including in areas that were inaccessible until recently.OCHA has hundreds of community and household service points involved in distributing aid. It lost access to many, sometimes due to conflict and sometimes due to Israel denying it access.\"We need to re-establish our service points, we need looting to reduce, we need roads to be cleared of unexploded ordnance and we need safety assurances,\" the OCHA spokesperson said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "BBC Verify: Aid group suspends Gaza operations after ceasefire",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/141c/live/1a9fc450-aac6-11f0-b2a1-6f537f66f9aa.png"
      ],
      "datePublished": "2025-10-16T19:58:28.000Z",
      "dateModified": "2025-10-16T19:58:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "EU sets 2027 target for anti-drone system to defend against Russia",
    "url": "https://www.bbc.com/news/articles/c4gz2ppye5zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0695/live/45bd6050-aaa5-11f0-b533-114b7c628ce7.jpg",
    "tag": "World",
    "date": "2025-10-16T16:19:23.000Z",
    "description": "EU foreign policy chief Kaja Kallas has said a new anti-drone system should be \"fully operational by the end of 2027\", as part of a drive to toughen d",
    "body": "EU foreign policy chief Kaja Kallas has said a new anti-drone system should be \"fully operational by the end of 2027\", as part of a drive to toughen defences against Russia and be fully prepared for possible conflict by 2030.\"Drones are already redefining warfare. Having drone defences is no longer optional for anyone,\" Kallas said, referring to Russia's ongoing war in Ukraine and fears that Moscow may attack the EU.The European Commission's \"defence roadmap\" also proposes strengthening the EU's eastern borders and building air and space \"shields\".Several EU nations have faced Russian incursions into their airspace and US President Donald Trump has urged the bloc to do more to defend itself.The European defence plan comes amid growing European fears that Russia will continue its westward aggression after the war in Ukraine is over, as well as continued ambiguity over Trump's long-term commitment to European security.\"Danger will not disappear even when the war in Ukraine ends. It is clear we need to toughen our defences against Russia,\" Kallas told reporters in Brussels on Thursday.Although there seems little chance of the war ending soon, Trump says he is now having a \"lengthy\" conversation with Russian President Vladimir Putin on the phone, ahead of talks with Ukrainian President Volodymyr Zelensky on Friday. Trump has indicated that if Putin does not not move to end the war, the US could send Ukraine long-range Tomahawk missiles - a potential move already described as \"escalation\" by the Kremlin.Standing alongside Kallas, European Defence Commissioner Andrius Kubilius stressed that \"our roadmap shows all the major milestones to achieve defence readiness by 2030, so we can deter Russian aggression, prevent war and preserve peace\".Putin has repeatedly denied that Moscow has any aggressive plans towards the EU. In June, he said the \"myth that Russia is planning to attack Europe, Nato countries is an unbelievable lie... nonsense\".The EU's executive Commission said the 27-member union should be ready by 2030 to \"respond to any crisis, including high-intensity conflict\".It also urged the bloc to \"close critical capability gaps\" - including in air and missile defence, and artillery systems - \"through joint development and procurement\".Many EU countries are also members of Nato and its chief, Mark Rutte, said they were working together to protect member states on the eastern flank from aerial threat.The EU stressed its \"flagship\" projects would be developed in \"close co-ordination\" with Nato, and would not duplicate the Western defensive alliance's work.No estimates were given to the overall cost, but Kubilius said \"we're not talking here about hundreds of billions\".The \"defence roadmap\" still needs to be approved by member states at a leaders' summit next week. However, a number of EU states have already backed plans for a multi-layered \"drone wall\" to quickly detect, then track and destroy Russian drones.In recent weeks,  tensions have escalated between the EU and Russia, after Poland and Romania - both Nato members - said Russian drones had breached their airspace.And Estonia - another Nato member - in September requested urgent consultations  with other alliance members after saying that Russian warplanes had violated its airspace and stayed there for 12 minutes.Russia, which launched its full-scale invasion of Ukraine in February 2022, said its planes were on a \"scheduled flight... in strict compliance with international airspace regulations and did not violate the borders of other states\".A number of European politicians and military experts have said that Russia's aim is to test Nato's capabilities and and try to sow discord within the alliance. Several Nato members reacted to the reported Russian incursions by sending troops, artillery, and air defence systems to secure the alliance's eastern flank.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "EU sets 2027 target for anti-drone system to defend against Russia",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0695/live/45bd6050-aaa5-11f0-b533-114b7c628ce7.jpg"
      ],
      "datePublished": "2025-10-16T16:19:23.000Z",
      "dateModified": "2025-10-16T16:19:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Greece passes labour law allowing 13-hour workdays in some cases",
    "url": "https://www.bbc.com/news/articles/cgjd76pw79do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2a4d/live/d8574430-aa87-11f0-978a-a301e44bcdc7.jpg",
    "tag": "World",
    "date": "2025-10-16T13:12:04.000Z",
    "description": "15 hours agoNikos PapanikolaouGetty ImagesGreece's parliament has approved a contested labour bill that would allow 13-hour workdays, despite fierce o",
    "body": "15 hours agoNikos PapanikolaouGetty ImagesGreece's parliament has approved a contested labour bill that would allow 13-hour workdays, despite fierce opposition and nationwide strikes.The government said it will modernise Greek labour laws, but a spokesperson for the left-wing opposition Syriza party called the bill a \"legislative monstrosity\".Under the new law, annual overtime is also capped at 150 hours, and the standard 40-hour week remains in place.The government insists that the longer workday is optional, only affects the private sector, and can only be applied up to 37 days a year.Thursday's vote was backed by MPs from the ruling centre-right New Democracy party, with centre-left Pasok party - now the main opposition - voting against the bill, while the left-wing Syriza party abstained.Unions have staged two general strikes demanding the bill's withdrawal this month that brought public transport and services to a standstill. Labour Minister Niki Kerameus defended the bill, saying the reforms align Greek legislation with modern labour-market realities, and accused opposition leaders of misleading the public.The laws will give workers the option to take on additional hours with the same employer for 40% higher pay, while ensuring they cannot be dismissed for refusing overtime.This complies with European Union working-time rules, which limit the average week to 48 hours including overtime but allow flexibility over 12 months, the government said.According to officials, the law gives employees the option to work longer for one employer rather than hold multiple part-time jobs, and that participation will remain voluntary.But opposition parties have accused the government of eroding workers' rights and \"pushing the country back to a labour middle age\". They say Greek employees already work longer hours than most Europeans while earning less and still \"struggle to make ends meet.\"The public-sector union ADEDY said flexible working hours in practice mean \"the abolition of the eight-hour day, the destruction of family and social life and the legalisation of over-exploitation,\" the AFP news agency reports.Across the EU in 2024, the longest working weeks in 2024 were recorded in Greece (39.8 hours), followed by Bulgaria (39.0), Poland (38.9) and Romania (38.8). The shortest working week in the bloc is in the Netherlands (32.1), according to Eurostat.As of January 2025, Greece's national minimum wage stood at €968 (£839, $1127) a month, placing it in the lower tier among EU countries. Unemployment, which had peaked at 28% during the financial crisis, was 8.1% in August compared with an EU average of 5.9%, figures from Eurostat show.Greece is recovering since its decade-long debt crisis, which ended in 2018, but wages and living standards remain among the lowest in the EU.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Greece passes labour law allowing 13-hour workdays in some cases",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2a4d/live/d8574430-aa87-11f0-978a-a301e44bcdc7.jpg"
      ],
      "datePublished": "2025-10-16T13:12:04.000Z",
      "dateModified": "2025-10-16T13:12:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Japan bear attacks hit record high with seven people killed this year",
    "url": "https://www.bbc.com/news/articles/cj41vn9q81ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cb7c/live/19bd1300-aaa6-11f0-b533-114b7c628ce7.jpg",
    "tag": "World",
    "date": "2025-10-16T15:55:03.000Z",
    "description": "The number of people killed by bears in Japan this year has reached a record high, the country's environment ministry has said.Seven people have died ",
    "body": "The number of people killed by bears in Japan this year has reached a record high, the country's environment ministry has said.Seven people have died since April - the highest since 2006 when data was first recorded - with fatalities mostly in north-eastern regions and the northern prefecture of Hokkaido.  A 60-year-old man cleaning an outdoor hot spring bath has gone missing what is suspected to be the latest incident.Attacks by bears tend to surge in autumn before bears hibernate, with experts saying low yields of beech nuts because of climate change could be driving hungry animals into residential areas. Depopulation has also been cited as a factor. The environmental ministry figures show the seven fatalities this year surpassed the five recorded in the year to April 2024.About 100 other people have also been injured so far this year, up from 85 injuries and three fatalities, in the previous 12 months.Investigators found human blood and bear fur at the scene of the latest suspected bear attack in the city of Kitakami in Iwate prefecture on Thursday.It comes after it was confirmed that a man found dead last week in Iwate was killed by a bear.Another recent incident took place in Numata, Gunma, north of Tokyo, when a 1.4m (4.5ft) adult bear entered a  supermarket, lightly injuring two men, one in his 70s and another in his 60s.The store is close to mountainous areas, but has never had bears come close before.According to local media, the store's manager said about 30 to 40 customers were inside, and the bear became agitated as it struggled to find the exit.The same day a farmer in Iwate region was scratched and bitten by a bear, accompanied by a cub, outside his house.And earlier this month a Spanish tourist was attacked by a bear at a bus stop in the village of Shirakawa-go in central Japan.Two types of bear are found in Japan - Asian black bears, and bigger brown bears which are found on the island of Hokkaido.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Japan bear attacks hit record high with seven people killed this year",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cb7c/live/19bd1300-aaa6-11f0-b533-114b7c628ce7.jpg"
      ],
      "datePublished": "2025-10-16T15:55:03.000Z",
      "dateModified": "2025-10-16T15:55:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Oscar Wilde's British Library card reissued 130 years after being revoked over gay conviction",
    "url": "https://www.bbc.com/news/articles/cx2lymkm1jno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d563/live/581c4da0-aa79-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-10-16T10:30:15.000Z",
    "description": "18 hours agoPaul GlynnCulture reporterBritish Library BoardThe date of Oscar Wilde's death, 30 November 1900, has been used as the new card's expiry d",
    "body": "18 hours agoPaul GlynnCulture reporterBritish Library BoardThe date of Oscar Wilde's death, 30 November 1900, has been used as the new card's expiry dateThe British Library has honoured late Irish writer Oscar Wilde by reissuing a reader's card in his name, 130 years after his original was revoked following his conviction for \"gross indecency\".The celebrated novelist, poet and playwright was excluded from the library's reading room in 1895 over his charge for having had homosexual relationships, which was a criminal offence at the time.The new card, which will be collected by his grandson, author Merlin Holland, on Thursday, is intended to \"acknowledge the injustices and immense suffering\" Wilde faced, the library said.Mr Holland said the new card is a \"lovely gesture of forgiveness and I'm sure his spirit will be touched and delighted\".The British LibraryBritish Library papers from June 1895 noted: \"Mr O. Wilde excluded from the reading room\"The decision to revoke Wilde's pass for the library - then the British Museum reading room - was recorded without comment in the trustees' minutes for 15 June 1895.He had been in prison for three weeks at the time after being handed a two-year prison sentence with hard labour.The author was convicted after he lost a libel trial against Lord Queensberry, who had accused him of being homosexual after discovering that his son, Lord Alfred Douglas, aka Bosie, was Wilde's lover.The library regulations at the time said anyone convicted of a crime should have their card revoked.'Letter from prison meant so much'The British Library holds handwritten drafts of some of Wilde's most famous plays including The Importance of Being Ernest, An Ideal Husband, A Woman of No Importance and Lady Windermere's Fan.Its collection also includes De Profundis, the letter he wrote to Bosie from Reading Gaol.Mr Holland will collect the new card at a ceremony at the venue on what would have been his grandfather's 171st birthday.Speaking to BBC Radio 4's Today programme on Thursday, Mr Holland said he felt both \"proud\" of his grandfather and slightly burderened by the responsibility of handling his legacy.\"People will so often write in to me and say, 'I cannot tell you how much your grandfather's De Profundis meant to me',\" he explained.\"It has a note of positivity at the end... he's going to come out of prison and do something again.\"And people have written to me saying, 'In a moment of terrible depression about my own life I read De Profundis, and I just wanted you to know that your grandfather's letter from prison meant so much to me'.\"British LibraryTrustees' papers noted Wilde's exclusion from the library at the timeDame Carol Black, chair of the British Library, described Wilde as \"one of the most significant literary figures of the nineteenth century\".She said that by reissuing his library card, \"we hope to not only honour Wilde's memory but also acknowledge the injustices and immense suffering he faced as a result of his conviction\".She added that they were \"delighted\" to welcome his grandson - who is the author of a new book, After Oscar: The Legacy of a Scandal - to receive the library card on his behalf.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Oscar Wilde's British Library card reissued 130 years after being revoked over gay conviction",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d563/live/581c4da0-aa79-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-16T10:30:15.000Z",
      "dateModified": "2025-10-16T10:30:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "French PM Lecornu survives confidence votes but breathing space will not last long",
    "url": "https://www.bbc.com/news/articles/clykve1xnn6o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6fc7/live/33440470-aa95-11f0-86ac-8fbb271dad90.jpg",
    "tag": "World",
    "date": "2025-10-16T13:46:21.000Z",
    "description": "14 hours agoHugh SchofieldIn ParisAFP via Getty ImagesSébastien Lecornu has had a turbulent start to his job, having resigned last week as prime minis",
    "body": "14 hours agoHugh SchofieldIn ParisAFP via Getty ImagesSébastien Lecornu has had a turbulent start to his job, having resigned last week as prime minister before being reappointedFrance's new prime minister, Sébastien Lecornu, has bought himself breathing space after winning two no-confidence motions tabled by the opposition.In the tightest vote, a motion sponsored by the far left fell 18 votes short of the 289 needed to bring him down. It means that after just five days in office, Lecornu has survived a first major ordeal in parliament and can now focus on the task of passing the 2026 budget.Any relief for the prime minister is likely to be short-lived, with the far left and far right still gunning to bring him down. And the Socialists, who threw a lifeline in the no-confidence motions, have made clear they will not be so indulgent next time round.Also, any tactical victory enabling the government to endure for now is more than offset by the huge damage to France's reputation caused by weeks of confusion and capitulation.Appointed by President Emmanuel Macron four weeks ago, then re-appointed in chaotic scenes on Friday after he resigned on Monday, Lecornu only survives thanks to major concessions made to the left.To buy the support of the Socialist Party, which has 65 or so MPs, the prime minister promised to freeze Macron's most important economic reform of his second term – the raising of the retirement age to 64.But he also made another, possibly more important, gift to the opposition, which has big implications for the chances of obtaining a budget in time for the end-of-year deadline.By pledging not to resort to the constitutional device known as the 49:3 – which lets governments force through laws without a vote – Lecornu handed ultimate control over the budget to the parties in parliament.It is a huge shift in power, reflecting the decline of presidential authority since Macron's botched parliamentary dissolution of July 2024.  For many observers  it heralds a return, for good or ill, to the party politicking that was a hallmark of the pre-1958 Fourth Republic.By assuring MPs that they and not the government would have the last word on the future budget, Lecornu managed to convince the Socialists that he was serious about marking a real \"rupture\" from previous Macronite administrations.But he may also have surrendered any prospect of the kind of belt-tightening debt reduction that the money markets and the European Union are demanding.The draft budget tabled by Lecornu on Tuesday aims to reduce the deficit to 4.7% of economic output (GDP) by making savings of €30bn (£26bn), with a squeeze on spending in the health sector and local administration.But the Socialists have joined the rest of the left and the far-right in denouncing the text as a betrayal of the less well-off.   Party leader Olivier Faure said that he would have no compunction about supporting a new vote of censure, if offending parts of the budget are not removed.AFP via Getty ImagesMathilde Panot's radical-left France Unbowed sponsored one of the two failed no-confidence motionsFrance's National Assembly has been split three ways for the last 15 months, with a centre-right bloc of under 200 MPs facing a left-wing alliance of about the same size and a far-right bloc of about 140, plus some independents.  None of the three prime ministers since then has been able to find a reliable majority.Weeks of bickering in Paris have triggered warnings about the public's growing disillusionment with politics - the spectacle appearing to confirm the notion that the prime aim of most politicians is simply to stay in power.President Macron, who is blamed for the crisis by most French voters, has seen his popularity ratings slump to just 14%. He has been in office for eight years, and the far right and far left have called for his resignation before his second term ends in 18 months.According to his one-time adviser, the veteran essayist and confidant of presidents Alain Minc, Macron \"must now go down as the worst president of the Fifth Republic\".Minc said Macron had come to office promising to act as a bulwark against the far right but he had left National Rally at the gates of power.\"If you look around us,\" said Minc, \"the Germans are petrified about what a French collapse will do to the economy. The British are petrified about the strategic implications. The Italians are laughing at us, because we always laughed at them.\"\"In America, President Trump is saying that smooth-talker Macron has got what he deserves. Only in Russia are they smiling.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "French PM Lecornu survives confidence votes but breathing space will not last long",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6fc7/live/33440470-aa95-11f0-86ac-8fbb271dad90.jpg"
      ],
      "datePublished": "2025-10-16T13:46:21.000Z",
      "dateModified": "2025-10-16T13:46:21.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Netanyahu 'determined' to pressure Hamas to find remaining dead hostages",
    "url": "https://www.bbc.com/news/articles/c4gkm0243wzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/024c/live/0b0b5130-aabc-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "World",
    "date": "2025-10-16T18:16:48.000Z",
    "description": "10 hours agoSean SeddonEPABenjamin Netanyahu addressed a memorial ceremony at the Mount Herzl cemetery in JerusalemIsrael's prime minister has told a ",
    "body": "10 hours agoSean SeddonEPABenjamin Netanyahu addressed a memorial ceremony at the Mount Herzl cemetery in JerusalemIsrael's prime minister has told a memorial for victims of the Hamas-led attack on 7 October 2023 that he is \"determined\" to secure the return of the dead hostages still in Gaza, and that the country will continue to fight terrorism with \"full force\".Benjamin Netanyahu made the comments hours after Hamas returned the bodies of two more hostages but said it was not able to access the remaining 19.There has been fury in Israel that Hamas has not returned all the bodies in line with last week's Gaza ceasefire deal, though the US has downplayed the suggestion it amounts to a breach.Also on Thursday, Donald Trump signalled he was willing to see fighting resume if Hamas \"continues to kill people\".Writing on his Truth Social platform, the US president said \"we will have no choice but to go in and kill\", seemingly referencing reports of violence inside Gaza, where Hamas has been accused of violently targeting internal rivals in recent days. Trump has previously ruled out putting American soldiers on the ground in Gaza.Earlier on Thursday, the Israeli government confirmed that two bodies handed over by Hamas to the International Committee of the Red Cross on Wednesday night had been identified as Inbar Hayman and Sgt Maj Muhammad al-Atarash.Their return, which was overseen by masked Hamas gunmen in Gaza City, took the number of dead hostages returned since Monday to nine out of 28. All 20 living hostages were released on Monday, in exchange for 250 Palestinian prisoners in Israeli jails and 1,718 detainees from Gaza.Hamas's military wing said on Wednesday that it would continue to search for the remaining bodies, but that it would require major efforts and specialist equipment.Israel has responded to the delay by threatening to restrict the amount of aid flowing into Gaza.On Thursday, Netanyahu addressed an official memorial ceremony at the Mount Herzl national cemetery in Jerusalem, two days after the Hebrew calendar anniversary of the 7 October attack.The prime minister said he remained committed to securing the return of all the dead Israeli and foreign hostages, and reiterated his government's willingness to return to military action if Israel was attacked again.He said: \"Our fight against terrorism will continue with full force. We will not allow evil to raise its head. We will exact the full price from anyone who harms us.\"The Israeli military launched a campaign in Gaza in response to the 7 October attack, in which Hamas-led gunmen killed about 1,200 people in southern Israel and took 251 others hostage.At least 67,967 people have been killed by Israeli attacks in Gaza since then, according to the territory's health ministry, whose figures are seen by the UN as reliable.ReutersIsraeli Bedouin soldier Sgt Maj Muhammad al-Atarash was buried on Thursday, a day after his body was returned by HamasThe Hostages and Missing Families Forum in Israel said Netanyahu's government should \"immediately halt the implementation\" of the ceasefire deal until the 19 bodies were returned. After Hamas said it was unable to retrieve all the bodies, two senior advisers to US President Donald Trump said preparations to move to the next phase of the ceasefire deal were continuing. The advisers told reporters that the US government did not so far believe Hamas had broken the agreement by not retrieving more remains, and said the group had acted in good faith by sharing information with interlocutors.While the full text of the agreement between Israel and Hamas has not been made public, a leaked version which appeared in Israeli media appeared to allow for the possibility that not all of the bodies would be immediately accessible. One senior US adviser pointed to the level of destruction in Gaza as one reason the search might be slowed, and said rewards could be offered to civilians with information about the location of remains. Hamas has complained to mediators that more than 20 people have been killed by Israeli forces in Gaza since the ceasefire took effect on Friday.Israel's military, which still controls more than half the territory, has said that it opens fire to remove threats to its troops.Watch: Netanyahu responds to Trump comment that he’s not \"the easiest\" to work withMeanwhile in Gaza, work is under way to identify the bodies of Palestinians returned by Israel in recent days in exchange for the hostages' bodies. A further 30 were returned on Thursday, taking the total to 120.There had been some reports that the Rafah crossing with Egypt would reopen on Thursday, having been shut since the Gaza side was seized by Israeli forces in May 2024.The ceasefire deal specifies its reopening would be \"subject to the same mechanism implemented\" during a temporary ceasefire earlier this year, when wounded Palestinians were briefly allowed to pass through to receive medical treatment.On Thursday, an official from Israeli military body Cogat said: \"The date for the opening of the Rafah crossing for the movement of people only will be announced at a later stage, once the Israeli side, together with the Egyptian side, completes the necessary preparations.\"The official also stressed that \"aid will not pass through the Rafah crossing\". Instead, they said, it would continue to enter Gaza through the nearby Kerem Shalom crossing in southern Israel and other crossings following Israeli security inspections.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Netanyahu 'determined' to pressure Hamas to find remaining dead hostages",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/024c/live/0b0b5130-aabc-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-16T18:16:48.000Z",
      "dateModified": "2025-10-16T18:16:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Madagascar crowds cheer as military unit seizes power",
    "url": "https://www.bbc.com/news/videos/c797ndpd97lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c9bf/live/6c3b0880-a93e-11f0-928c-71dbb8619e94.jpg",
    "tag": "World",
    "date": "2025-10-14T21:42:41.000Z",
    "description": "An elite military unit has said it has seized power in Madagascar from President Andry Rajoelina following weeks of youth-led protests over water and ",
    "body": "An elite military unit has said it has seized power in Madagascar from President Andry Rajoelina following weeks of youth-led protests over water and power cuts across the country. Crowds were seen celebrating in the streets of the country's capital Antananarivo. Standing outside the presidential palace on Tuesday, CAPSAT chief Col Michael Randrianirina said the military would form a government and hold elections within two years. CAPSAT stands for Personnel Administration and Technical and Administrative Services Corps, and is the most powerful military unit in Madagascar. Rajoelina's whereabouts are unknown, but he has said he is sheltering in a \"safe place\" following an alleged attempt on his life by \"military personnel and politicians\". CAPSAT has denied any involvement in any such move.More on this story here",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Madagascar crowds cheer as military unit seizes power",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c9bf/live/6c3b0880-a93e-11f0-928c-71dbb8619e94.jpg"
      ],
      "datePublished": "2025-10-14T21:42:41.000Z",
      "dateModified": "2025-10-14T21:42:41.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Protesters and police clash outside Peruvian Congress",
    "url": "https://www.bbc.com/news/videos/c993r08kp89o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5941/live/f559c6a0-aa5c-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "World",
    "date": "2025-10-16T06:35:20.000Z",
    "description": "'Firenado' tears through Brazil sugarcane field‘Firenado’ forms as flames tear through sugarcane plantation in São Paulo18 Sep 2025Latin AmericaWatch:",
    "body": "'Firenado' tears through Brazil sugarcane field‘Firenado’ forms as flames tear through sugarcane plantation in São Paulo18 Sep 2025Latin AmericaWatch: Soda truck falls into sinkhole in Mexico CityInitial reports suggested the sinkhole was caused by a collapsed drainage system, according to Iztapalapa's mayor.15 Sep 2025Latin AmericaWhat you need to know about Bolsonaro's coup prison sentenceThe former president of Brazil has been sentenced to 27 years in prison after being found guilty for plotting a military coup. 12 Sep 2025Latin AmericaPunches and slaps: Watch as Mexican Senate debate ends in brawlA fight erupted in the senate involving two senior Mexican politicians.28 Aug 2025Latin AmericaHurricane Erick hits Mexico resort towns killing twoVideo shows communities in the affected areas dealing with flood waters and a messy clean-up.20 Jun 2025Latin AmericaWatch: Moment Chile earthquake rocks live TV showThe 6.4 magnitude earthquake interrupted the broadcast, shaking the equipment in the studio.7 Jun 2025Latin AmericaWatch: Cat caught smuggling drugs into Costa Rica prisonThe feline was found carrying 235.65g of marijuana and 67.76g of heroin, authorities say.19 May 2025Latin AmericaWatch: Wildlife dyed blue in São Paulo chemical spillCity officials say they are acting to rescue and save the lives of the affected animals. 16 May 2025Latin AmericaWatch: How Lady Gaga's record-breaking concert almost ended in disaster A large-scale bomb attack was thwarted by police before Gaga's first concert in Brazil since 2012. 4 May 2025Latin AmericaWatch: Olympic legend leaves parents in her dust at school sports dayThe third-fastest woman in history, Shelly-Ann Fraser-Pryce, took part in sports day at her son's school in Jamaica.18 Apr 2025Latin AmericaMan arrested trying to smuggle cocaine under toupeeSuspect tried to smuggle more than €10,000 of cocaine from Cartagena to Amsterdam, Colombian authorities said.25 Feb 2025Latin AmericaWatch moment man is swallowed by humpback whaleDell Simancas captures the moment his son, Adrián, is swallowed and spat out by a humpback whale.13 Feb 2025Latin AmericaWorkers rescued from window ledge as fire engulfs Rio clothing factoryAt least 20 people have been injured after a factory making costumes for Carnival celebrations in Brazil caught fire.12 Feb 2025Latin AmericaThousands of baby turtles released in BrazilThe project aims to boost numbers of threatened tracajás turtles in Amazonas state.9 Feb 2025Latin AmericaPlane crashes into bus on busy São Paulo streetTwo people were killed in the accident, the Brazilian city's fire department said.7 Feb 2025Latin AmericaWatch: Argentina canal turns bright red, alarming localsThe body of water runs through industrial areas on the outskirts of Buenos Aires.7 Feb 2025Latin AmericaSão Paulo storm brings floods, chaos and lightningHeavy rain across the Brazilian city caused transport chaos and subway overcrowding.26 Jan 2025Latin AmericaWatch: Firefighters rescue riders from Chilean Ferris wheelFirefighters in Viña del Mar rescued more than 35 revellers trapped aboard a malfunctioning Ferris wheel.17 Jan 2025Latin AmericaHomes and roads swamped by Brazil floodwatersA state of emergency has been declared in southern Brazil after heavy rain caused flooding in costal cities.17 Jan 2025Latin AmericaMoment kitesurfing Olympian rescues drowning womanBruno Lobo was practising filming with a new camera off the coast of Brazil, as he heard a woman screaming.\n13 Jan 2025Latin America",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Protesters and police clash outside Peruvian Congress",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5941/live/f559c6a0-aa5c-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-16T06:35:20.000Z",
      "dateModified": "2025-10-16T06:35:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Titan submersible imploded due to poor engineering, say US officials",
    "url": "https://www.bbc.com/news/articles/cdeg7y4171xo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3877/live/765b5270-aa74-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-10-16T09:43:48.000Z",
    "description": "19 hours agoDearbail JordanWatch: Wreckage of the Titan submersible on the ocean floor OceanGate's Titan submersible imploded on its journey to the wr",
    "body": "19 hours agoDearbail JordanWatch: Wreckage of the Titan submersible on the ocean floor OceanGate's Titan submersible imploded on its journey to the wreck of the Titantic because of poor engineering and multiple failures to test the vessel, according to an official report.Titan imploded in June 2023, killing all five passengers on board including OceanGate's chief executive.The US National Transportation Safety Board (NTSB) found the engineering process behind the vehicle was \"inadequate\", resulting in faults which meant it failed to meet strength and durability requirements.The NTSB said because the firm did not adequately test Titan it did not know its actual strength. It was also unaware it was damaged and should have been removed from service before its last voyage.Titan footage shows wreckage of destroyed hull on sea floorWhat the Titan failure has taught us about exploring the deep oceanImplosion: The Titanic Sub DisasterTitan disappeared in the North Atlantic as it attempted to dive to the wreck of Titanic which lies some 372 miles from St. John's in Newfoundland and Labrador in Canada.In August, the US Coast Guard released a damning report into the implosion which found that the incident was \"preventable\" and criticised OceanGate's \"critically flawed\" safety practices.Stockton Rush, OceanGate's chief executive and co-founder, operated the Titan on its final journey.The passengers, who paid up to $250,000 each to take part in the dive, were deep-sea explorer Paul-Henri Nargeolet, Shahzada Dawood and his 19-year-old son Suleman Dawood and Hamish Harding.Designed and built by OceanGate, the Titan was 6.7m (22ft) long with a passenger compartment made of carbon fibre, with titanium used in its domes and some other segments.The doomed submersible which imploded at a depth of 3,363m (11,033ft) - the Titanic wreck is located at 3,880m - was the second version of the craft. OceanGate had condemned the first version following testing.During its investigation, the NTSB discovered issues with the safety culture at OceanGate.While some employees said safety was a priority, others, including a former director of marine operations and a technician, highlighted an environment \"where safety issues, particularly design issues, were ignored\".One technician at the firm said he had concerns about OceanGate's business model, in particular accepting paying clients as \"mission specialists\" as opposed to passengers.Under US regulations, it is illegal to transport passengers in an experimental submersible.The technician told the NTSB that he informed Mr Rush: \"… you can't just change the title of a person when you're receiving compensation.\" In a later conversation on the same subject, the technician recounted that Mr Rush said: \"If the [US] Coast Guard became a problem … he would buy himself a congressman and make it go away\".OceanGate has permanently wound down its operations since the incident.In its report, the NTSB discovered that a contributing factor to the implosion was that US and international voluntary guidance and US small passenger vessel regulations \"were insufficient to ensure OceanGate adhered to established industry standards\".The NTSB has recommended that the US Coast Guard commissions a study into how so-called pressure vessels which carry people are assessed and, if changes are suggested, regulations be updated. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Titan submersible imploded due to poor engineering, say US officials",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3877/live/765b5270-aa74-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-16T09:43:48.000Z",
      "dateModified": "2025-10-16T09:43:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zelensky to make missile case in US after Trump-Putin phone call",
    "url": "https://www.bbc.com/news/articles/crmxz37nv3zo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ea26/live/4896a750-ab0e-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "World",
    "date": "2025-10-17T04:05:23.000Z",
    "description": "9 minutes agoSean SeddonReutersZelensky is on his third visit to Washington since JanuaryUkrainian President Volodymyr Zelensky will meet with US Pres",
    "body": "9 minutes agoSean SeddonReutersZelensky is on his third visit to Washington since JanuaryUkrainian President Volodymyr Zelensky will meet with US President Donald Trump in Washington on Friday, as Trump weighs whether to arm Ukraine with Tomahawk missiles capable of striking deep into Russia.Their meeting comes a day after Trump said \"great progress\" was made during a phone call with Russian President Vladimir Putin, with the pair agreeing to face-to-face talks in Hungary.Trump said the call, the first with Putin since mid-August, was \"very productive\", adding that teams from Washington and Moscow will meet next week.As Zelensky arrived in the US, his third visit since January, he said Moscow was \"rushing to resume dialogue as soon as it hears about Tomahawks\".Zelensky has called on the US to provide Ukraine with the advanced missiles, which have a range of 2,500 km (1,500 miles).Asked earlier this week if Trump was considering giving Ukraine Tomahawks, he said: \"We'll see... I may.\" But asked about the same prospect after his call with Putin, Trump said \"we can't deplete\" the US stockpile of Tomahawks, adding \"we need them too... so I don't know what we can do about that\".Writing on his Truth Social platform after his call with Putin concluded, Trump said he and the Russian president \"spent a great deal of time talking about Trade between Russia and the United States when the War with Ukraine is over\". He said \"high level advisors\" from both countries would meet at an unspecified location next week, with Secretary of State Marco Rubio leading the American delegation. Trump also said he would update Zelensky on his talks with Putin on Friday, adding: \"I believe great progress was made with today's telephone conversation.\"He later told reporters he expected to meet Putin in Hungary \"within two weeks\".Hours before the Trump-Putin call, Russia launched one of its largest attacks of the year on Ukraine, including 28 ballistic missiles, and 320 drones, according to Ukraine's ambassador to the US, Olga Stefanishyna.Stefanishyna said Russia launching overnight strikes on Ukraine before the call \"exposes Moscow's real attitude toward peace\".In a statement to the BBC's US partner CBS, she added: \"These assaults show that Moscow's strategy is one of terror and exhaustion. The only effective response is pressure - through tougher sanctions, reinforced air defense, and the supply of long-range capabilities.\"Hungarian Prime Minister Viktor Orban said on X the planned Budapest meeting was \"great news for the peace-loving people of the world\".Earlier, he also said: \"Peace requires patience, strength, and humility. Europe must shift its stance. Instead of arrogance and fanning the flames of endless war, we need negotiations with Russia. Only dialogue can bring peace to our continent.\"Trump has taken a much tougher line towards Putin over the Ukraine war since a face-to-face summit in Alaska in August failed to produce a decisive breakthrough in attempts to broker a peace deal.The pair met on US soil on 15 August for a summit which the US president hoped would help convince the Russian president to enter comprehensive peace talks to end the Ukraine war. Russia launched its full-scale invasion of Ukraine in February 2022.They spoke again days later when Trump interrupted a meeting with Zelensky and European leaders to call Putin.Since then, neither the White House or Kremlin have publicly confirmed any communications between the two.During his presidential election campaign, Trump claimed he would be able to end the war in Ukraine within days but has since admitted resolving the conflict has been more challenging than any he has been involved in since returning to power. Trump had been seen as more sympathetic to Russia than his predecessor Joe Biden, and strained relations with Zelensky came to a head on 28 February when he and Vice-President JD Vance berated the Ukrainian president in the Oval Office on live television. But public relations with Zelensky have vastly improved in recent months. In September, Trump signalled a major shift in his view of the conflict, saying he  believed Kyiv could \"win all of Ukraine back in its original form\", a far cry from his public calls for Kyiv to cede territory occupied by Russia. ReutersPutin and Trump last met in person at a US base in Alaska in August 2025In late July, Trump set Putin a deadline of less than a fortnight to agree to a ceasefire or face sweeping sanctions, including measures against countries which still trade with Russia.But he did not follow through the threat after Putin agreed to meet Trump in Alaska, which the US president hailed as a significant diplomatic success at the time, despite it not producing any tangible outcome.Earlier on Thursday, India's foreign ministry cast doubt on a claim made by Trump a day earlier saying Indian Prime Minister Narendra Modi had agreed to stop purchasing Russian oil.An Indian government spokesman said he was \"not aware of any conversation between the two leaders\" taking place the previous day, after Trump said Modi had assured him purchases would stop \"within a short period of time\".The US has pushed for countries - in particular India, China and Nato members - to stop buying Russian energy in an effort to increase economic pressure on the Kremlin. Zelensky has also repeatedly echoed those calls.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zelensky to make missile case in US after Trump-Putin phone call",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ea26/live/4896a750-ab0e-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-17T04:05:23.000Z",
      "dateModified": "2025-10-17T04:05:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Gaza: Freed Palestinian detainee comes home to find family alive",
    "url": "https://www.bbc.com/news/videos/c7516x2zy6ko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6400/live/49bc1600-a9c5-11f0-aa13-0b0479f6f42a.jpg",
    "tag": "World",
    "date": "2025-10-15T13:10:39.000Z",
    "description": "A freed Palestinian detainee was overwhelmed to find out his family were alive, after believing they had been killed.Shadi Abu Sido told the BBC an Is",
    "body": "A freed Palestinian detainee was overwhelmed to find out his family were alive, after believing they had been killed.Shadi Abu Sido told the BBC an Israeli prison officer had lied to him and told him his family had been killed, and his home bombed.But when he arrived in Gaza, he was overwhelmed to be greeted by his family.The photojournalist says he was detained whilst reporting at al-Shifa hospital in March last year.Mr Sido spent 20 months in an Israeli prison and was one of nearly 2,000 prisoners exchanged for Israeli hostages, under the first phase of the US-brokered ceasefire deal.Israel's prison service said they operated within the law and are not aware of any such incidents taking place.The BBC's Lucy Williamson reports.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Gaza: Freed Palestinian detainee comes home to find family alive",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6400/live/49bc1600-a9c5-11f0-aa13-0b0479f6f42a.jpg"
      ],
      "datePublished": "2025-10-15T13:10:39.000Z",
      "dateModified": "2025-10-15T13:10:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "House drifts away from land as typhoon hits Alaska",
    "url": "https://www.bbc.com/news/videos/c07mndrgerpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e36b/live/213e0e10-a978-11f0-b741-177e3e2c2fc7.jpg",
    "tag": "World",
    "date": "2025-10-15T04:34:34.000Z",
    "description": "Footage shows a house drifting out to sea after the remnants of Typhoon Halong hit Alaska over the weekend. After crossing the Pacific Ocean, the stor",
    "body": "Footage shows a house drifting out to sea after the remnants of Typhoon Halong hit Alaska over the weekend. After crossing the Pacific Ocean, the storm brought hurricane-force winds that left one person dead and another two missing. Authorities have rescued two dozen people from homes that drifted out to sea as around 1,300 were displaced. Brea Paul, who filmed the video on 12 October in Kipnuk, said she had seen about 20 other houses floating away overnight, some of which \"would blink their phone lights at us like they were asking for help but we couldn't even do anything\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "House drifts away from land as typhoon hits Alaska",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e36b/live/213e0e10-a978-11f0-b741-177e3e2c2fc7.jpg"
      ],
      "datePublished": "2025-10-15T04:34:34.000Z",
      "dateModified": "2025-10-15T04:34:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Venezuelan fishermen in fear after US strikes on boats in the Caribbean",
    "url": "https://www.bbc.com/news/articles/c77z48lg2l5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9e5a/live/d03aaa80-a9f6-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-10-17T00:20:45.000Z",
    "description": "4 hours agoGustavo Ocando AlexReporting from Maracaibo, Venezuela for BBC News MundoGustavo Ocando AlexWilder Fernández is a young fisherman in the w",
    "body": "4 hours agoGustavo Ocando AlexReporting from Maracaibo, Venezuela for BBC News MundoGustavo Ocando AlexWilder Fernández is a young fisherman in the west of Venezuela who is concerned by the US military presence in the CaribbeanWilder Fernández has caught four good-sized fish in the murky waters of a small bay north of Lake Maracaibo.The contents of his net will serve as dinner for his small team before they set out to go fishing again in the evening.But this daily task is a job he has recently become scared of doing.After 13 years as a fisherman, Mr Fernández confesses that he now fears his job could turn lethal.He is afraid he could die in these waters not at the hands of a night-time attacker - a threat fishermen like him encountered in the past - but rather, killed in a strike launched by a foreign power.\"It's crazy, man,\" he says of the deployment of US warships, fighter jets, a submarine and thousands of US troops in waters north of Venezuela's coast.The US force patrolling in the Caribbean is part of a military operation targeting suspected \"narco-terrorists\", which according to the White House have links to the Venezuelan government led by Nicolás Maduro.Since last month, the US has conducted at least six strikes on suspected drug-carrying boats in the Caribbean, with the latest being carried out on Thursday.At least 27 people have been killed, but Thursday's strike appeared to be the first to have survivors aboard the boat.The US has accused those killed of smuggling drugs but has so far not presented any evidence. Experts have suggested the strikes could be illegal under international law.Tensions between the US and Venezuela escalated further on Wednesday when US President Donald Trump said that he was considering strikes on Venezuelan soil.He also confirmed that he had authorised the CIA to carry out covert operations inside Venezuela.Gustavo Ocando AlexMany fishermen are wary of going out to sea given the new risks Mr Fernández is across the latest news. Even though the strikes are said by the US to have happened thousands of kilometres from where he fishes, his wife has been trying to convince him to leave Lake Maracaibo. Every day she begs him to leave his fishing job. \"She tells me to look for another job, but there's nowhere to go,\" he explains. He does not rule out that his boat could be hit \"by mistake\". \"Of course it worries me, you never know. I think about it every day, man,\" the father of three says.Read this story in Spanish at BBC MundoOne day after BBC Mundo spoke to Mr Fernández, Trump announced that \"six narco-terrorists\" had been killed in a US strike in international waters off the Venezuelan coast.Trump added that \"intelligence confirmed the vessel was trafficking narcotics, was associated with illicit narcoterrorist networks\".ReutersThe US government has shared images of the boats it has attacked, saying that they originated in VenezuelaThe Trump administration accuses Maduro of leading the Cartel of the Suns drug trafficking gang and is offering a $50m (£37m) reward for information leading to his capture. Maduro, whose legitimacy as Venezuela's president is internationally contested after disputed elections last year, has denied the cartel accusations. He has dismissed them as an attempt by the White House to oust him from office. In his second televised address railing against the US in as many days, Venezuela's president said on Thursday: \"We will never be an American colony.\" Maduro also alleged the CIA had long been active in Venezuela.Meanwhile, Venezuela's Defence Minister General Vladimir Padrino has warned Venezuelans to prepare \"for the worst\". Speaking after the incursion on 2 October of five F-35 fighter jets in Venezuelan airspace, Gen Padrino said that his nation was facing a \"serious threat\", which he warned could involve \"aerial bombings, naval blockades, undercover commandos landing on Venezuelan beaches or in the Venezuelan jungle, swarms of drones, sabotage, and targeted killings of leaders\".Venezuela also denounced the \"mounting threats\" from the US at the United Nations Security Council last week. In response, the US representative at the UN meeting, John Kelley, stressed that his country \"will not waver in our action to protect our nation from narcoterrorists\".Gustavo Ocando AlexThe US government claims the attacked Venezuelan ships were transporting drugs, but has not presented evidenceMeanwhile, the attacks in the Caribbean have undermined the security of the fishermen in Venezuela, laments Jennifer Nava, spokeswoman for the Council of Fishermen in El Bajo, in Venezuela's Zulia state. Ms Nava tells BBC Mundo that people employed in the fishing industry fear being hit in the crossfire between US forces and alleged drug traffickers.AFP vía Getty ImagesThere are more than 115,000 people employed in the fishing sector in VenezuelaMs Nava argues that the added risks fishermen are facing could drive some of them into the arms of drug and arms smugglers looking to recruit people to transport their illicit shipments.\"Some of these guys are approached by traffickers,\" she explains, adding that a downturn in the fishing industry could leave fishermen more vulnerable to those approaches. There is certainly a sense of nervousness among the fishermen of Lake Maracaibo. Most of the crew of two small fishing boats owned by Usbaldo Albornoz refused to work when news of the US strikes broke.Mr Albornoz, who has been in the fishing business for 32 years, describes the situation as \"worrying\".\"The guys didn't want to go out to sea to fish,\" he told BBC Mundo on the beach in San Francisco de Zulia, which sits at the northern shore of Lake Maracaibo where it meets the Gulf of Venezuela.Gustavo Ocando AlexUsbaldo Albornoz says his employees have refused to go out and fishThe fear of being hit by a US strike is the latest of a long list of risks he and his men face, including pirates, oil spills and a decline in earnings in recent years, Mr Albornoz explains. In a leaked memo recently sent to US lawmakers, the Trump administration said it had determined it was involved in a \"non-international armed conflict\" with drug-trafficking organisations.The White House described the attacks on the boats in the Caribbean as \"self-defence\" in response to criticism by legal experts who said they were illegal.Gustavo Ocando AlexJosé Luzardo is defiant in the face of the US deploymentBut beyond the fear many are experiencing, there is also a feeling of defiance.At the end of September, hundreds of fishermen on dozens of boats took to Lake Maracaibo in a show of support for the Maduro government and in protest at the US military deployment. José Luzardo was one of them. A spokesman for the fishermen of El Bajo, he has been fishing for almost 40 years and accuses the US of \"pointing its cannons towards our Venezuela\".He says he is not afraid and would give his life to defend his homeland.Gustavo Ocando AlexFear of US strikes is just one of the issues threatening the fishing industry\"The Trump administration has us cornered. If we have to lay down our lives to defend the government, then we'll do it, so that this whole shebang is over,\" he says.He insists that what the fishermen want is \"peace and work\", not war, but gets visibly angry when he refers to the \"military barrier\" he says the US has deployed in the Caribbean.Last month, the Venezuelan government mobilised members of the militia and called on those who had not signed up to the civilian force to do so.More than 16,000 fishermen followed his call, according to fisheries minister Juan Carlos Loyo.Luzardo, who has been fishing since he was 11 years old says he will \"be ready for battle, wherever needed\".\"If they [the US] want to kill us, then so be it, but we're not afraid.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Venezuelan fishermen in fear after US strikes on boats in the Caribbean",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9e5a/live/d03aaa80-a9f6-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-10-17T00:20:45.000Z",
      "dateModified": "2025-10-17T00:20:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]