[
  {
    "title": "Makoko demolitions: Shanties in Lagos Lagoon in Nigeria bulldozed and burnt",
    "url": "https://www.bbc.com/news/articles/ce3epxznyzzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/7060/live/4c1827a0-ffaa-11f0-b7e1-afb6d0884c18.jpg",
    "tag": "World",
    "date": "2026-02-03T00:13:23.000Z",
    "description": "16 hours agoChiamaka DikeBBC Africa, Makoko, LagosGift Ufuoma/BBCA mother of five, Anna Sobie's wooden home is one of many that has been demolished in",
    "body": "16 hours agoChiamaka DikeBBC Africa, Makoko, LagosGift Ufuoma/BBCA mother of five, Anna Sobie's wooden home is one of many that has been demolished in a shanty town in a lagoon in Lagos, with critics describing it as a \"land-grab\" by the authorities to gentrify the prime waterfront spot in Nigeria's biggest city.Lagos State government officials deny the allegation, saying they are demolishing parts of Makoko - the country's biggest informal waterfront settlement - because it is expanding near high voltage power lines, posing a major health and safety risk.Sobie and her children now sleep on the narrow broken platform where their house stood until a few weeks ago on Lagos Lagoon. This is the biggest of 10 lagoons in a mega-city that is facing an acute housing crisis - and where life is becoming increasingly expensive, pushing more people to the margins of society. As Sobie spoke to the BBC, canoes - steered with paddles or long bamboo poles - moved through the narrow waterways, carrying mattresses and sacks of clothes belonging to the displaced people.Residents say the demolitions began two days before Christmas, when excavation teams accompanied by armed police moved into sections of the waterfront settlement facing the Atlantic Ocean.In a joint statement last month, 10 non-governmental organisations said that \"armed thugs, security personnel and demolition teams with bulldozers descended repeatedly on the community\" to tear down homes, and burn them.\"Homes were set on fire with little or no notice, in some cases while residents were still [inside],\" the NGOs added.Gift Ufuoma/BBCAnna Sobie's family are living on the the ruins of their houseWhen the BBC visited Makoko, smoke, from the rubble of torched homes or from fires that people had lit, burning damp wood to dry their clothes, was hanging in the air.Excavators were at work along the shoreline - houses built on wooden stilts over the lagoon were still being pulled down, their planks collapsing into the water below.  Corrugated metal sheets were falling from roofs and drifting between boats. Makoko was founded in the 19th Century by fishing communities who have lived in the settlement ever since, along with other low-income families and migrants who come to Lagos in search of better opportunities. Ownership of the lagoon is fiercely contested. The state government claims ownership of it under federal law, saying Makoko has been built without planning permission or occupancy rights. Older residents dispute this, saying the settlement predates modern Lagos, and they have what they call a customary right to it.Estimates of Makoko's population vary, from 80,000 to 200,000, but much of the settlement now lies in fragments.The NGOs said that more than 10,000 people have been displaced after the destruction of more than 3,000 homes, as well as schools, clinics and churches. The state government has not given any figures of the buildings demolished.Sobie's home was among those that have been destroyed. \"I was inside when it started,\" she says. \"The noise was very loud. When we came out, we saw the excavator.\"She says there was little time to move her family's belongings. Her son Solomon's school in Makoko was demolished the same day. Sobie's family moved briefly into a building nearby. That, too, was later pulled down. \"We're sleeping in an open space under the rain, and they're currently setting properties ablaze,\" Sobie says, adding:  \"We don't have another place.\" Like many other children, Solomon no longer goes to school. He now helps his mother gather firewood from collapsed houses, pulling loose planks from the debris to sell.Even as the excavators work, canoe-borne business activities continue, with traders peddling their way through the remaining homes to sell fish and goods. But many other traders can no longer do business, as they lost their goods when their homes were demolished or torched.With the lagoon central to their lives, they have protested against the move to force them out of Makoko. Gift Ufuoma/BBCThe state government says it will give financial compensation to families whose homes have been destroyedMore than 1,000 angry residents marched last week to the state legislature, the House of Assembly, demanding an audience with Governor Babajide Sanwo-Olu, whose offices are nearby.But police responded by firing tear gas, with protesters saying that at least one person was injured in the ensuing chaos.Community leaders and residents say that tear gas was also fired during the demolitions a few weeks ago, causing the death of five people, including children. \"Children were weeping, some died, some were unconscious, and were taken to the hospital as a result of the tear gas,\" Sobie tells the BBC.The Lagos State government says it is unaware of their personnel using tear gas or of deaths linked to the demolitions. Speaking to the BBC, the state's commissioner for information, Gbenga Omotoso, says that any such claims would be investigated.\"We would determine the actual cause of death,\" he says. \"Our personnel will not knowingly kill anybody.\"The state government has defended the demolitions, saying they are targeting homes built beneath high voltage power lines.\"No responsible government anywhere in the world can allow people to live directly under high-tension cables or obstruct vital waterways,\" the governor's special adviser on urban development, Olajide Abiodun Babatunde, said in a statement. Governor Sanwo-Olu said that affected families would be provided with financial grants and other assistance, and it was wrong to accuse him of \"destroying\" Makoko. He raised concern that shanties were \"sprawling\" at an \"incredible speed\", getting closer to the Third Mainland Bridge, the longest and busiest of three bridges connecting the mainland to the islands - the commercial heart of the city and its wealthier neighbourhoods.For the governor this spells danger.\"So, what we have done is that we just pushed them back,\" he added.Gift Ufuoma/BBCSome residents suspect their homes have been demolished to pave the way for an upmarket development Lagos-based real estate developer Peacemaker Afolabi tells the BBC that demand for land in the city is huge.\"Everywhere in Lagos is prime land,\" he says. \"And waterfront is always prime.\" Some residents suspect that the demolitions are aimed at clearing the area for private developments, including luxury homes.This has been repeatedly denied by the state government, but suspicion remains.\"This is not the slow, decades-long gentrification often seen in Western cities. It's a rapid, almost violent reshaping that is already forcing millions of residents to the margins,\" he writes. \"In the next few years, Lagos may look more polished and globally appealing. But for many of its people, it will also become profoundly unliveable.\"In their joint statement, the NGOs said that demolitions in Makoko, and other settlements last year, were part of a \"sinister agenda to grab land\". \"These actions against thousands of peaceful, hardworking residents represent a deliberate pattern of state-enabled violence against the urban poor, carried out to clear valuable land for elite interests and private mega-developments,\" the NGOs said. \"The housing deficit has thus grown from approximately 2.95 million units in 2016 to 3.4 million in 2025, a 15 per cent increase,\" Nigeria's Punch newspaper quoted the report as saying.Rapid population growth, rising rents and limited access to formal housing have pushed many low-income residents into informal settlements, particularly along waterfronts and transport corridors.The authorities have demolished homes in Makoko in the past - most recently in 2017, when residents obtained a court order to prevent forced evictions without adequate notice, compensation and resettlement.Megan Chapman, co-director of the Justice and Empowerment Initiatives campaign group, says the government has failed to provide residents affected by the latest demolitions with alternative accommodation. \"They have to identify everyone who will be affected and make arrangements before homes are lost,\" she tells the BBC\"When people are removed like this, it affects livelihoods, family structures and how communities function over time.\"When the BBC was in Makoko, boys were sitting along the lagoon, repairing their broken fishing nets. Children moved between piles of debris, collecting firewood from collapsed structures. A tractor pulled away from what was once a house. Only a small number of buildings remained standing, including the homes of traditional leaders.Elizabeth Kakisiwe says she sleeps nearby.Each evening, she lays wooden boards on damp ground for her children and packs them away again in the morning.\"We were at the market when it started,\" she says. \"When I came back, my house was gone.\"She says there was no clear warning and no time to remove belongings. Clothes, cooking utensils and mattresses were lost. When rain fell days later, they were drenched.\"At night, we sit in the cold,\" she says. \"If the children feel sick, we give them paracetamol.\"Cooking has become difficult, she says, because rain has made the ground wet and rats move through the debris. \"Yesterday, we only drank garri,\" Kakisiwe says, referring to a popular cassava-based meal that is often made as a drink. \"There is nothing to cook.\"Expressing a similar view, Sobie says: \"The suffering is much. A lot of people have been dying. We just don't know what to say. It's only God that can help us.\"Additional reporting by Gift UfuomaMore BBC stories about housing in Lagos:Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Makoko demolitions: Shanties in Lagos Lagoon in Nigeria bulldozed and burnt",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/7060/live/4c1827a0-ffaa-11f0-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-03T00:13:23.000Z",
      "dateModified": "2026-02-03T00:13:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Two arrested over attempted sabotage of German naval vessels",
    "url": "https://www.bbc.com/news/articles/crkryz35246o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/63c4/live/8d54a9c0-010b-11f1-87ac-6bcb44a3becd.jpg",
    "tag": "World",
    "date": "2026-02-03T16:30:11.000Z",
    "description": "12 minutes agoIan AikmanGetty ImagesThe pair are suspected of attempting to sabotage naval vessels at the Port of Hamburg (file photo)Two suspects hav",
    "body": "12 minutes agoIan AikmanGetty ImagesThe pair are suspected of attempting to sabotage naval vessels at the Port of Hamburg (file photo)Two suspects have been arrested over the attempted sabotage of German naval vessels docked at the Port of Hamburg last year.The pair are suspected of deactivating electronic safety switches, removing fuel tank caps, puncturing water supply lines, and dumping more than 20kg (44.1lb) of abrasive gravel into a ship's engine.\"If gone undetected, the acts would have caused major damage to the ships and delayed their departure, endangering the operations of the German Navy,\" the EU's Eurojust crime agency said in a statement.The suspects are a 37-year-old Romanian man and a 54-year-old Greek man who worked at the port, according to local media reports.The suspects were arrested in Germany and in Greece on Tuesday following a coordinated effort between German, Greek and Romanian authorities.Officers also searched and seized evidence from the suspects' homes in Germany, Greece and Romania, Eurojust said.An investigation into the full circumstances around the incident is ongoing, the agency added.While officials in Germany have not explicitly linked the Hamburg incident to Russia, the arrests come amid heightened fears over Kremlin-backed sabotage across the continent. Germany and other Nato countries have seen a string of suspected sabotage incidents since Russia's full-scale invasion of Ukraine in 2022.Undersea communications cables in the Baltic have been damaged, and suspected drone activity has caused major disruption at airports and military bases.Though some European governments have directly accused Russia of involvement, the Kremlin has consistently denied orchestrating sabotage operations.Germany has sought to increase its resilience to potential sabotage after an arson attack, which was previously linked to left-wing activists, left tens of thousands without power earlier this year.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Two arrested over attempted sabotage of German naval vessels",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/63c4/live/8d54a9c0-010b-11f1-87ac-6bcb44a3becd.jpg"
      ],
      "datePublished": "2026-02-03T16:30:11.000Z",
      "dateModified": "2026-02-03T16:30:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Restored angel fresco resembling Italian PM Meloni sparks investigation",
    "url": "https://www.bbc.com/news/articles/cwygrkm7k0yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b4ac/live/bad84ca0-0113-11f1-9972-d3f265c101c6.png",
    "tag": "World",
    "date": "2026-02-03T14:10:40.000Z",
    "description": "3 hours agoMaia DaviesReuters/Getty ImagesThe apparent resemblance was first reported on the front page of a national Italian newspaper on SaturdayChu",
    "body": "3 hours agoMaia DaviesReuters/Getty ImagesThe apparent resemblance was first reported on the front page of a national Italian newspaper on SaturdayChurch and government officials in Italy have launched an investigation into claims that the face of Prime Minister Giorgia Meloni was painted on an angel during the restoration of a fresco in Rome.Italy's culture ministry has sent officers to inspect the artwork in a chapel of the Basilica of St Lawrence in Lucina, while the Diocese of Rome expressed its \"disappointment\" and said it would determine who had been responsible.The artist, Bruno Valentinetti, said he had simply restored the fresco he painted in 2000 and denied modelling the angel after the prime minister.Meloni responded in a post on Instagram saying she was \"definitely not like an angel\", accompanied by a laughing emoji.The apparent likeness was first reported on Saturday by Italian newspaper La Repubblica, which ran before-and-after pictures of the fresco and claimed the angel holding a map of Italy had previously looked like a \"generic cherub\".The parish priest said the paintings had simply been touched up following recent water damage - but said he did not \"understand the fuss\" in any case.\"Painters used to put all sorts of things in frescoes,\" Monsignor Daniele Micheletti said.Valentinetti, 83, denied the claims. \"The restored face is the one that was painted 25 years ago,\" he said, in remarks reported by news agency AGI.\"Who says it resembles Meloni?\"Opposition parties were quick to urge an investigation. Irene Manzi of the Democratic Party called the situation \"unacceptable\" while the Five Star Movement said art must not become \"a tool for propaganda\", whether or not it depicted Meloni.Culture Minister Alessandro Giuli ordered \"technical officials\" to inspect the painting \"to ascertain the nature of the intervention\" and determine next steps.The Diocese of Rome, meanwhile, said it knew about the restoration but that it had been told nothing would be added or changed.\"The modification of the cherub's face was the decorator's initiative, not communicated to the competent authorities,\" it said in a statement shared by news agency Ansa.It later said the Cardinal Baldo Reina - the Pope's Vicar for the Diocese of Rome - would immediately investigate \"to determine the possible responsibilities of those involved\".It said the cardinal \"distances himself from Monsignor Micheletti's statements and expresses his disappointment over what happened\" and stated its \"commitment to the protection of its artistic and spiritual heritage\" against misuse or exploitation.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Restored angel fresco resembling Italian PM Meloni sparks investigation",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b4ac/live/bad84ca0-0113-11f1-9972-d3f265c101c6.png"
      ],
      "datePublished": "2026-02-03T14:10:40.000Z",
      "dateModified": "2026-02-03T14:10:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "X offices raided in France as UK opens fresh investigation into Grok",
    "url": "https://www.bbc.com/news/articles/ce3ex92557jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/96f8/live/12bc3eb0-00ea-11f1-8974-f3140348ffed.jpg",
    "tag": "World",
    "date": "2026-02-03T13:46:18.000Z",
    "description": "3 hours agoLiv McMahonTechnology reporterGetty ImagesThe French offices of Elon Musk's X have been raided by the Paris prosecutor's cyber-crime unit, ",
    "body": "3 hours agoLiv McMahonTechnology reporterGetty ImagesThe French offices of Elon Musk's X have been raided by the Paris prosecutor's cyber-crime unit, as part of an investigation into suspected offences including unlawful data extraction and complicity in the possession of child pornography.The prosecutor's office also said both Musk and former X chief executive Linda Yaccarino had been summoned to appear at hearings in April.In a separate development, the UK's Information Commissioner's Office (ICO) announced a probe into Musk's AI tool, Grok, over its \"potential to produce harmful sexualised image and video content.\"X is yet to respond to either investigation - the BBC has approached it for comment.It has previously characterised the French investigation as an attack on free speech.The investigation began in January 2025 when French prosecutors started looking into content recommended by X's algorithm, before being widened in July that year to include Musk's controversial AI chatbot, Grok.In a post at the time, X said the action was \"politically-motivated\" and denied allegations it had manipulated its algorithm.Following today's raid, French prosecutors say they are now investigating whether X has broken the law across multiple areas.Among potential crimes it said it would investigate were complicity in possession or organised distribution of images of children of a pornographic nature, infringement of people's image rights with sexual deepfakes and fraudulent data extraction by an organised group.New UK investigationMeanwhile, UK authorities have given an update on their investigations into sexual deepfakes created by Grok and shared on X.The images - often made using real images of women without their consent - prompted a barrage of criticism in January from victims, online safety campaigners and politicians.The company eventually intervened to prevent the practice, after Ofcom and others launched investigations.In an update on Tuesday, Ofcom said it was continuing to investigate the platform and was treating it as \"a matter of urgency\".But it added it was currently unable to investigate the creation of illegal images by Grok in this case because it did not have sufficient powers relating to chatbots.However, shortly afterwards the ICO said it was launching its own probe, in conjunction with Ofcom, into the processing of personal data in relation to the Grok.\"The reports about Grok raise deeply troubling questions about how people's personal data has been used to generate intimate or sexualised images without their knowledge or consent, and whether the necessary safeguards were put in place to prevent this,\" said William Malcolm, the ICO's executive director for regulatory risk & innovation.A Commission spokesperson said it was in touch with France over its search of X's office in Paris.'Not a free country'Pavel Durov - founder of the messaging app Telegram - criticised the French authorities on Tuesday, accusing France of being \"the only country in the world that is criminally persecuting all social networks that give people some degree of freedom\". \"Don't be mistaken: this is not a free country,\" he added in a post on X.Durov was arrested and detained in France in August 2024 over alleged moderation lapses on his messaging app, which the Paris prosecutor's office said had failed to curb criminal activity.He was permitted to leave the country last March after the platform made some changes to the way it operates following the arrest.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "X offices raided in France as UK opens fresh investigation into Grok",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/96f8/live/12bc3eb0-00ea-11f1-8974-f3140348ffed.jpg"
      ],
      "datePublished": "2026-02-03T13:46:18.000Z",
      "dateModified": "2026-02-03T13:46:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China bans hidden car door handles over safety concerns",
    "url": "https://www.bbc.com/news/articles/cp37g5nxe3lo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/49e5/live/b9e22840-00d0-11f1-a266-e3d9153f08c1.jpg",
    "tag": "World",
    "date": "2026-02-03T02:06:29.000Z",
    "description": "15 hours agoPeter HoskinsAFP via Getty ImagesChina has banned hidden door handles on electric vehicles (EVs), making it the first country to stop the ",
    "body": "15 hours agoPeter HoskinsAFP via Getty ImagesChina has banned hidden door handles on electric vehicles (EVs), making it the first country to stop the use of the controversial designs that were made popular by multi-billionaire Elon Musk's Tesla.It comes as EVs are facing scrutiny from safety watchdogs around the world after a number of deadly incidents, including two fatal crashes in China involving Xiaomi EVs in which power failures were suspected to have prevented doors from being opened.Under the new regulations, cars will only be allowed to be sold if they have a mechanical release both on the inside and outside of their doors, according to state media. The new rules are due to take effect on 1 January 2027.The Ministry of Industry and Information Technology rules require the outside of every passenger door except the boot, to have a recessed space measuring no smaller than 6cm (2 in) by 2cm by 2.5cm to allow access to the handle. Inside the car there must be signs measuring at least 1cm by 0.7cm to show how to open the door.  Cars that have already been approved by authorities and are in the final stages of entering the Chinese market will have another two years to update their designs.Hidden handles are widely used in China's new energy vehicle (NEV) market, which includes EVs as well as hybrid cars and those powered by fuel cells.They feature in about 60% of the top 100 best-selling NEVs, according to data cited by government-controlled newspaper China Daily.Although the measures will only apply to models sold in the Chinese market, the country's huge presence in the global car industry means the move is likely to have an impact around the world.Tesla's door handles are already being investigated by US safety regulators and authorities in Europe are considering their own rules.In November, the US National Highway Traffic Safety Administration (NHTSA) opened a probe focused on Tesla's electric-powered door handles, responding to reports that they suddenly stopped working, leaving children trapped in the cars.The NHTSA said it had received nine complaints about the handles in Tesla's 2021 Model Y cars, the company's flagship model.In four of the cases, the car owners resorted to breaking the window to resolve the issue.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China bans hidden car door handles over safety concerns",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/49e5/live/b9e22840-00d0-11f1-a266-e3d9153f08c1.jpg"
      ],
      "datePublished": "2026-02-03T02:06:29.000Z",
      "dateModified": "2026-02-03T02:06:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Iran's president says it is ready to negotiate with the US",
    "url": "https://www.bbc.com/news/articles/c4gw10mkz0yo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ca2d/live/3fffa0e0-00c9-11f1-8fbb-d70779046d18.jpg",
    "tag": "World",
    "date": "2026-02-03T09:35:01.000Z",
    "description": "7 hours agoOttilie MitchellIran's Presidential website/WANA/ReutersIranian President Masoud Pezeshkian has said Iran will pursue negotiations with the",
    "body": "7 hours agoOttilie MitchellIran's Presidential website/WANA/ReutersIranian President Masoud Pezeshkian has said Iran will pursue negotiations with the US after requests from \"friendly governments in the region\" to respond to a US proposal for talks.In a statement on X, Pezeshkian said he had told Iran's Minister of Foreign Affairs Abbas Araghchi to pursue talks \"provided that a suitable environment exists - one free from threats and unreasonable expectations\".The Iranian president's words come after the country's supreme leader Ayatollah Ali Khamenei warned any attack on Iran would spark a regional conflict. US President Donald Trump has threatened to intervene in Iran over its nuclear ambitions and deadly crackdown on protesters, building up forces nearby.\"These negotiations shall be conducted within the framework of our national interests\", Pezeshkian added. The talks will be held in Istanbul on Friday, according to US media reports. Pezeshkian's announcement follows an interview with Araghchi in which he told CNN he was \"confident that we can achieve a deal\".Speaking to a press pool in the White House, Trump said on Monday \"if we can work something out\" that would be \"great\", but warned that \"bad things would happen\" if not.The US carried out targeted strikes on Iran's nuclear facilities last year in what it called Operation Midnight Hammer. The strikes followed a large-scale operation by Israel to target Iran's nuclear facilities and nuclear scientists. Trump added that there was a \"tremendous force\" headed to Iran, including the \"biggest and the best\" ships. The build up of US military and navy includes air craft carrier USS Abraham Lincoln, which has an air wing of around 70 aircraft. Iranian authorities previously said that 3,117 people were killed during the protests, but activist and monitoring groups say the toll is significantly higher. US-based Human Rights Activists News Agency (HRANA) says it has confirmed the deaths of 6,430 protesters, 152 children and 214 people associated with the government. It is still investigating some 11,280 cases. Norway-based Iran Human Rights (IHR) said the final toll could exceed 25,000.The widespread demonstrations were sparked by economic frustrations in the country but developed into demands for political change. Iranian officials have told Khamenei that public anger following the protests has reached a point where fear is no longer a deterrent, Reuters news agency reports.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iran's president says it is ready to negotiate with the US",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ca2d/live/3fffa0e0-00c9-11f1-8fbb-d70779046d18.jpg"
      ],
      "datePublished": "2026-02-03T09:35:01.000Z",
      "dateModified": "2026-02-03T09:35:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump seeks $1bn in damages from Harvard",
    "url": "https://www.bbc.com/news/articles/crkryely657o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/332e/live/5e7b4210-00db-11f1-b7e1-afb6d0884c18.jpg",
    "tag": "World",
    "date": "2026-02-03T07:08:03.000Z",
    "description": "10 hours agoYang TianGetty ImagesHarvard has been a central target in the White House's campaign to stamp out what it calls \"woke\" ideologies on Ameri",
    "body": "10 hours agoYang TianGetty ImagesHarvard has been a central target in the White House's campaign to stamp out what it calls \"woke\" ideologies on American campusesUS President Donald Trump announced he will be seeking $1bn (£730m) in damages from Harvard University in his administration's ongoing feud with the institution.The news comes after the New York Times reported that the Trump administration had to backtrack from its demand for a $200m payment in negotiations with the university.Trump cited the story in a Truth Social post late on Monday, blaming Harvard for \"feeding a lot of nonsense\" to the New York Times.Trump officials have accused Harvard of not doing enough to tackle antisemitism during pro-Palestinian protests. Harvard has rejected the accusation.Harvard has been a central target in the White House's campaign to stamp out what it calls \"woke\" and \"radical left\" ideologies on American campuses.In April last year, Trump revoked around $2bn in research grants to Harvard and froze federal funding.The university sued the Trump administration over the move, saying no government \"should dictate what private universities can teach, whom they can admit and hire, and which areas of study and inquiry they can pursue\".A US federal court later overturned the billions in funding cuts, ruling the government had violated university's free speech rights.The White House vowed to immediately challenge the \"egregious decision\", saying Harvard remains \"ineligible for grants in the future\".Before Monday's announcement, the government had been in discussions with Harvard over a potential deal to unfreeze federal funding. \"We are now seeking One Billion Dollars in damages, and want nothing further to do, into the future, with Harvard University,\" Trump wrote on Monday.He accused Harvard of \"serious and heinous illegalities\", but did not clarify how he believed it had broken the law.  Trump has previously threatened to revoke Harvard's tax-exempt status and take control of the university's patents stemming from federally funded research.Three other Ivy League universities, Columbia, Penn and Brown, struck deals with Trump to preserve funding that was at risk due to similar claims by the administration, rather than go to court.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump seeks $1bn in damages from Harvard",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/332e/live/5e7b4210-00db-11f1-b7e1-afb6d0884c18.jpg"
      ],
      "datePublished": "2026-02-03T07:08:03.000Z",
      "dateModified": "2026-02-03T07:08:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DGCA says no fault found in Boeing fuel control switch after Air India grounds plane",
    "url": "https://www.bbc.com/news/articles/c8e5zwndddyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b14a/live/d8714e10-00b9-11f1-bafa-09e23c2efc9d.jpg",
    "tag": "World",
    "date": "2026-02-03T13:02:11.000Z",
    "description": "No defect found in switch of jet grounded by Air India - regulator4 hours agoCherylann Mollan,MumbaiandSharanya Hrishikesh,DelhiGetty ImagesRepresenta",
    "body": "No defect found in switch of jet grounded by Air India - regulator4 hours agoCherylann Mollan,MumbaiandSharanya Hrishikesh,DelhiGetty ImagesRepresentative image of a Boeing 787-8 Dreamliner. The plane had flown from London to BengaluruIndia's aviation regulator said it found no defect in the fuel control switch of a Boeing 787-8 Dreamliner jet grounded by Air India based on a pilot's report.The issue was reported on Sunday after the plane, which took off from London, landed in Indian's Bengaluru city.The regulator said that while starting the engine during take-off, the crew noticed that twice the fuel control switch - which regulates the flow of fuel into the plane's engines - did not \"remain positively latched in the run position when light vertical pressure was applied\". It remained stable the third time and the crew closely monitored the aircraft during the flight, which \"was completed without incident\".Air India had said in a statement on Monday that it informed India's aviation regulator about the issue and that it was getting the pilot's concerns checked on a \"priority basis\". A Boeing spokesperson had told the BBC in response to a question that the company was supporting Air India's \"review of this matter\".The Directorate General of Civil Aviation (DGCA) said on Tuesday that when the switches were operated according to Boeing's recommended procedure, they were found to be \"satisfactory\", staying at run instead of moving to cut-off (which can stop fuel supply to the engines).It added, however, that incorrectly handling the switch caused it to \"move easily from run to cut-off\".These checks were performed in the presence of DGCA officials on the affected aircraft and another aircraft, the statement said. The DGCA has also asked Air India to circulate Boeing's recommended procedure to operate the switch to its crew members.  The grounding of the plane gained a lot of attention as it came amid an ongoing investigation into last June's plane crash involving an Air India aircraft of the same model which killed 260 people.The crash of the London-bound Air India Boeing 787-8 Dreamliner occurred less than a minute after the plane took off from Ahmedabad airport in western India. India's Aircraft Accident Investigation Bureau (AAIB) is investigating the crash and a final report is expected to be released in a few months.Air India crash plane had record of safety defects, campaigners claimWhy cockpit audio deepens the mystery of Air India crashIndia's aviation regulator had also ordered an investigation of cockpit fuel switches in Boeing 787 and Boeing 737 aircraft operating in the country after the crash. Air India had said then that its inspections did not find any issue with the locking mechanism of the switch, which it reiterated on Monday.  \"Air India had checked the fuel control switches on all Boeing 787 aircraft in its fleet after a directive from the DGCA [Directorate General of Civil Aviation], and had found no issues,\" the airline said in the statement.On Tuesday, Reuters news agency reported that Air India had begun re-checking the fuel switches on its Boeing Dreamliner aircraft following the incident flagged by the pilot.Aviation consultant and former air accident investigator Tim Atkinson told the BBC that he trusted Boeing's design of the fuel control switches.\"These switches are designed with one purpose in mind, and that is that they cannot be moved unintentionally. There is no doubt in my mind that the design is good. I would be astonished to find it had some kind of latent defect,\" he said.With additional reporting from Theo Leggett.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DGCA says no fault found in Boeing fuel control switch after Air India grounds plane",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b14a/live/d8714e10-00b9-11f1-bafa-09e23c2efc9d.jpg"
      ],
      "datePublished": "2026-02-03T13:02:11.000Z",
      "dateModified": "2026-02-03T13:02:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Seven million cancers a year are preventable, says global report",
    "url": "https://www.bbc.com/news/articles/c5yd3x7yreno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ad19/live/a2d11e60-0119-11f1-a88f-113f60a613fb.jpg",
    "tag": "World",
    "date": "2026-02-03T16:00:13.000Z",
    "description": "43 minutes agoJames GallagherHealth and science correspondentGetty ImagesSeven million people's cancer could be prevented each year, according to the ",
    "body": "43 minutes agoJames GallagherHealth and science correspondentGetty ImagesSeven million people's cancer could be prevented each year, according to the first global analysis.A report by World Health Organization (WHO) scientists estimates 37% of cancers are caused by infections, lifestyle choices and environmental pollutants that could be avoided.This includes cervical cancers caused by human papilloma virus (HPV) infections which vaccination can help prevent, as well as a host of tumours caused by tobacco smoke from cigarettes.The researchers said their report showed there is a \"powerful opportunity\" to transform the lives of millions of people.Some cancers are inevitable - either because of damage we unavoidably build up in our DNA as we age or because we inherit genes that put us at greater risk of the disease.But researcher Dr Isabelle Soerjomataram said \"people are surprised to hear\" that nearly four in 10 cancers can be prevented as it is \"a substantial number\".The International Agency for Research on Cancer, part of the WHO, analysed 30 preventable factors known to increase the risk of cancer.These include smoking and ultraviolet (UV) radiation which can directly damage our DNA; obesity and too little physical activity which alter inflammation and hormones in the body to raise cancer risk; and air pollution which can wake up dormant cancer cells.The agency's report also looked at nine cancer-causing infections including HPV, hepatitis viruses which lead to liver cancer and the stomach bug H. pylori.The team used data on cancer cases from 2022 and from the 30 risk factors a decade earlier – across 185 countries - to perform their statistical analysis.The big three contributors to more than 18 million cancer cases around the world were found to be:smoking tobacco which caused 3.3 million cancersinfections causing 2.3 million cancersalcohol use leading to 700,000 cancers Getty ImagesSmoking and alcohol were two of the main causes of preventable cancersHowever, the overall figures mask a nuanced picture of cancer risk around the world.There is a stark sex-divide with 45% of men's cancers being preventable compared with 30% in women, partly down to higher levels of smoking among men.In women living in Europe, the top three preventable causes of cancer are smoking, closely followed by infection and then obesity.While in sub-Saharan Africa, infections dominate and account for nearly 80% of preventable cancers in women.This means any measures to tackle these cancers would need to be tailored to each region or country.\"This landmark study is a comprehensive assessment of preventable cancer worldwide, incorporating for the first time infectious causes of cancer alongside behavioural, environmental, and occupational risks,\" said Soerjomataram, the deputy head of the IARC Cancer Surveillance Unit.\"Addressing these preventable causes represents one of the most powerful opportunities to reduce the global cancer burden.\"The report, published in the journal Nature Medicine, showed lung cancer (linked to smoking and air pollution) stomach cancer (linked to H. pylori infection) and cervical cancer (linked to HPV infection) made up nearly half of all preventable cases of cancer.Dr Andre Ilbawi, team lead for cancer control at WHO, said the study was \"good news\" as it showed something could be done and he pointed to the success of countries that have introduced policies to tackle smoking or vaccinate against HPV.\"The percentage of preventable cancers can change over time and our goal is to get it as close to zero as possible,\" he said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Seven million cancers a year are preventable, says global report",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ad19/live/a2d11e60-0119-11f1-a88f-113f60a613fb.jpg"
      ],
      "datePublished": "2026-02-03T16:00:13.000Z",
      "dateModified": "2026-02-03T16:00:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Thousands of Epstein documents taken down after victims identified",
    "url": "https://www.bbc.com/news/articles/cn0k65pnxjxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a5c4/live/211248f0-00f5-11f1-8067-e14d6844f3f6.jpg",
    "tag": "World",
    "date": "2026-02-03T15:26:48.000Z",
    "description": "1 hour agoJessica RawnsleyReutersThe US Department of Justice released around three million more documents linked to the Jeffrey Epstein investigation",
    "body": "1 hour agoJessica RawnsleyReutersThe US Department of Justice released around three million more documents linked to the Jeffrey Epstein investigation on FridayThe US Department of Justice (DOJ) has removed thousands of documents related to Jeffrey Epstein from its website after victims said their identities had been compromised.Lawyers for Epstein's victims said flawed redactions in the files released on Friday had \"turned upside down\" the lives of nearly 100 survivors. Email addresses and nude photos in which the names and faces of potential victims could be identified were included in the release.Survivors issued a statement calling the disclosure \"outrageous\" and said they should not be \"named, scrutinized and retraumatized\".The DOJ said it had taken down all the flagged files and that mistakes were due to \"technical or human error\".In a letter submitted to a federal judge on Monday, the DOJ said: \"All documents requested by victims or counsel to be removed by yesterday evening have been removed for further redaction.\"The department said it was continuing to examine new requests, as well as checking whether there are any other documents that may need further redaction.  A \"substantial number\" of documents independently identified have also been removed, it added.Under the terms of the release, which was mandated after both chambers of Congress approved a measure compelling the DOJ to publish the documents, the federal government was required to redact details which could identify victims.On Friday, two lawyers representing victims asked a federal judge in New York to order the DOJ to take down the website hosting the files, calling the release \"the single most egregious violation of victim privacy in one day in United States history\".Brittany Henderson and Brad Edwards said there was \"an unfolding emergency that requires immediate judicial intervention\" due to the DOJ \"failing to redact victims names and other personally identifying information in thousands of instances\".Several of Epstein's victims added comments to the letter, including one who described the release as \"life-threatening\" and another who said she had received death threats after her private banking details were published.Speaking to the BBC on Tuesday, Epstein survivor Annie Farmer said: \"It's hard to focus on the new information that has been brought to light because of how much damage the DOJ has done by exposing survivors in this way.\"Another of Epstein's victims, Lisa Phillips, said that many of the survivors were \"very unhappy with the outcome\" of the release. \"The DOJ has violated all three of our requirements,\" she told BBC's Newsday on Tuesday. \"Number one, many documents still haven't been disclosed. Number two, the date set for release has long passed. And number three, DOJ released the names of many of the survivors.\"She added: \"We feel like they're playing some games with us but we're not going to stop fighting.\"Gloria Allred, a women's rights lawyer who has represented many of Epstein's victims, previously told the BBC that numerous victims' names had been disclosed in the latest release, including some who had not been identified publicly previously.\"In some cases... they have a line through the names but you can still read the names,\" she said. \"In other cases, they've shown photos of victims - survivors who have never done a public interview, never given their name publicly.\"A spokesperson for the DOJ told the BBC's US news partner CBS that it \"takes victim protection very seriously and has redacted thousands of victim names in the millions of published pages to protect the innocent\".They added that the department was \"working around the clock to fix the issue\" and \"to date 0.1% of released pages\" had been found to have unredacted information that could identify victims.Millions of files relating to Epstein have been released by the DOJ since a law mandated their release last year, including three million pages, 180,000 images and 2,000 videos last Friday.That release came six weeks after the department missed a deadline signed into law by US President Donald Trump under bipartisan Congressional pressure that mandated all Epstein-related documents be shared with the public.Epstein died in a New York prison cell on 10 August 2019 as he awaited trial on sex trafficking charges.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Thousands of Epstein documents taken down after victims identified",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a5c4/live/211248f0-00f5-11f1-8067-e14d6844f3f6.jpg"
      ],
      "datePublished": "2026-02-03T15:26:48.000Z",
      "dateModified": "2026-02-03T15:26:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Chappell Roan says revealing Grammys outfit wasn't 'that outrageous'",
    "url": "https://www.bbc.com/news/articles/cx2w3ldex3no?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5870/live/ff11d9e0-00fa-11f1-8373-25a35d9e886f.jpg",
    "tag": "World",
    "date": "2026-02-03T13:49:48.000Z",
    "description": "3 hours agoEmma SaundersCulture reporterGetty ImagesChappell Roan described her look - shown before she removed her cape - as \"so awesome and weird\"Ch",
    "body": "3 hours agoEmma SaundersCulture reporterGetty ImagesChappell Roan described her look - shown before she removed her cape - as \"so awesome and weird\"Chappell Roan has laughed off the reaction to the revealing outfit she wore on the Grammy Awards red carpet on Sunday.The US pop star removed her red chiffon cape on the red carpet to reveal a matching draped dress hung from nipple rings, leaving virtually all of her top half exposed.The Mugler ensemble was one of the most talked-about outfits at this year's ceremony.\"Giggling because I don't even think this is THAT outrageous of an outfit,\" the star posted on Instagram. \"The look's actually so awesome and weird. I recommend just exercising your free will it's really fun and silly :D.\"ReutersShe added: \"Thank you for having me @grammys and those who voted for me!!\" Some fans praised Roan's style, describing her as \"a goddess\" and \"an icon\" in response to her own Insta post.Referencing Justin Bieber's performance on Sunday wearing just boxer shorts, one wrote: \"If Justin can perform in his underwear without anyone batting an eyelid, you can rock pierced pasties diva. Misogyny.\"Nipple pasties are prosthetic nipple covers, which provide both protection and coverage.Others found her outfit was not to their taste, however.Responding to Billboard's video of Roan on the red carpet, one post read: \"I love her but this is too much. Is she gonna get banned?\", while another responded: \"I don't know what people have against wearing clothes.\"Speaking to BBC Radio 5 Live, fashion writer and stylist Alex Fullerton said: \"What this label (Mugler) has done consistently since the 80s has worked a lot with transparency, bare breasts, so she's honouring the legacy of the designer.\"But at the end of the day... she's got them out!\"Roan was nominated for two Grammys on Sunday - record of the year and best pop solo performance, both for The Subway, but she came away empty-handed.Known for her individual style and hits including Pink Pony Club, Hot to Go and Good Luck, Babe!,  Chappell is actually the alter-ego of the more reticent Kayleigh Amstutz.\"I couldn't be Chappell all the time,\" she admitted. \"I'd be absolutely exhausted.\"Getty ImagesCharli XCX wore a sheer black dress at the Brits last yearHer latest outfit continues the trend of celebrities wearing sheer and revealing looks on red carpets and at award ceremonies.Charli XCX wore a see-through black dress at last year's Brit Awards, and addressed the controversy over her outfit during one of her speeches on the night. \"I heard that ITV were complaining about my nipples. I feel like we're in the era of 'free the nipple' though, right?\" she said.Kanye West's wife, Bianca Censori, arrived at last year's Grammys wearing a sheer body stocking that left little to the imagination.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Chappell Roan says revealing Grammys outfit wasn't 'that outrageous'",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5870/live/ff11d9e0-00fa-11f1-8373-25a35d9e886f.jpg"
      ],
      "datePublished": "2026-02-03T13:49:48.000Z",
      "dateModified": "2026-02-03T13:49:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says Republicans 'should take over the voting' and 'nationalise' US elections",
    "url": "https://www.bbc.com/news/articles/c0mke841zj0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e760/live/8eee1e30-00fa-11f1-8373-25a35d9e886f.jpg",
    "tag": "World",
    "date": "2026-02-03T14:46:02.000Z",
    "description": "2 hours agoAna FaguyWashingtonGetty ImagesUS President Donald Trump has urged Republicans to \"nationalise\" elections and repeated his false claims of ",
    "body": "2 hours agoAna FaguyWashingtonGetty ImagesUS President Donald Trump has urged Republicans to \"nationalise\" elections and repeated his false claims of 2020 election fraud in a new podcast interview. American elections are primarily run by state law, and voting has long been administered by local officials across the country. \"The Republicans should say: 'We want to take over. We should take over the voting in at least 15 places.' The Republicans ought to nationalise the voting,\" Trump said during an appearance on the podcast of his former deputy FBI director, Dan Bongino.His remarks come days after the FBI raided an elections office in Georgia to examine voting records from the 2020 election.In the interview, Trump did not name the \"15 places\" where he thought Republicans should \"nationalise\" voting.The president tied his desire to federalise voting mechanisms to his key agenda item of deporting undocumented immigrants from the US. \"If Republicans don't get them out, you will never win another election as a Republican,\" he said. While speaking to Bongino, Trump also referenced the FBI's raid in Georgia's Fulton County, saying that \"you're going to see some interesting things come out\".Trump narrowly lost the state to Joe Biden in 2020. He has repeatedly said his loss was due to fraud - an unsubstantiated claim.Trump faced two criminal indictments related to alleged election interference in Georgia; a federal case that ended after he returned to the White House last year, and a Georgia state racketeering case that fell apart. He denied any wrongdoing.In the new podcast interview, Trump said he won the 2020 election \"in a landslide\" and said, without evidence, that people \"vote illegally\".The FBI said last week it was conducting a \"court-authorised law enforcement activity\" at the Fulton County Election Hub. Fulton County officials said that the government's warrant \"sought a number of records related to 2020 elections\".Some local officials expressed anger at the raid.\"This is an assault on your vote,\" Fulton County Commissioner Mo Ivory said.Director of National Intelligence Tulsi Gabbard has confirmed that she was present for the raid, saying that Trump personally asked her to be on-site.Gabbard's first comments on the matter came in a letter that was sent to a group of senators on Monday, saying her presence was \"executed under [her] broad statutory authority to coordinate, integrate, and analyze intelligence related to election security, including counterintelligence (CI), foreign and other malign influence and cybersecurity\".In the letter, Gabbard also confirmed that there had been a call in the wake of the raid between FBI agents on the ground and Trump. The call, which was first reported by the New York Times, raised some eyebrows as it is unusual for a president and law enforcement handling a case like this to be in communication. Gabbard said she \"facilitated a brief phone call for the president to thank the agents personally for their work. He did not ask any questions, nor did he or l issue any directives\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says Republicans 'should take over the voting' and 'nationalise' US elections",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e760/live/8eee1e30-00fa-11f1-8373-25a35d9e886f.jpg"
      ],
      "datePublished": "2026-02-03T14:46:02.000Z",
      "dateModified": "2026-02-03T14:46:02.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Russian hits Ukraine energy sites in 'most powerful blow\" so far this year",
    "url": "https://www.bbc.com/news/articles/cpwng25114ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6fc5/live/3e3e3370-0119-11f1-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-03T13:17:53.000Z",
    "description": "'Record number of missiles' hit Ukraine leaving thousands with no heating in -20C3 hours agoSarah RainsfordEastern and Southern Europe correspondent i",
    "body": "'Record number of missiles' hit Ukraine leaving thousands with no heating in -20C3 hours agoSarah RainsfordEastern and Southern Europe correspondent in KyivAFP via Getty ImagesKyiv residents shelter at a train station during Russian air raidsRussia has used a record number of ballistic missiles to target Ukraine's energy sector, President Volodymyr Zelensky has said. The combined missile and drone strikes hit power plants and infrastructure in Kyiv and multiple locations causing \"the most powerful blow\" so far this year, according to private energy company DTEK.The strikes were launched as temperatures dropped to -20C  (-4F) and left more than 1,000 tower blocks in the capital without heating once again and damaged a power plant in the eastern city of Kharkiv beyond repair.Zelensky said Russia was \"choosing terror and escalation\" rather than diplomacy to end this war and called for \"maximum pressure\" on Moscow from Ukraine's allies.The attack comes after a so-called \"energy truce\" agreed by Donald Trump with Vladimir Putin expired at the weekend.Ukraine's president suggested that Russia had simply used the time to stock up on missiles and prepare for the next attack.It also came on the day Nato Secretary-General Mark Rutte was in Kyiv to meet President Zelensky and to address the national parliament.Donald Trump's initiative was meant to give diplomacy a chance. Negotiators from Russia and Ukraine are due to meet in Abu Dhabi for another round of talks co-ordinated by the US later this week.It is clear that Russia has other ideas.And in fact, there is always a gap between Russia's massive strikes which makes Ukrainians doubt there was ever any real pause at all.We heard the first explosions in Kyiv soon after midnight and the air raid lasted more than seven hours. There were several subsequent blasts.Residents spent the night sheltering in metro stations, with some pitching tents on the platforms to protect them from the freezing cold.President Zelensky has said more than 70 ballistic and cruise missiles were fired - significantly more than usual - together with 450 drones which are used to overwhelm Ukraine's air defences.Ukraine's Air Force said it had intercepted only 38 of the missiles, which means many reached their target.Officials here have complained repeatedly of a shortage of missiles to protect the skies. Ukraine relies on US-made Patriot missiles, in particular.\"Timely delivery of missiles for air defense systems and the protection of normal life are our priority,\" Zelenksy wrote on X this morning. \"Without pressure on Russia, there will be no end to this war.\"In response, Nato's secretary-general said he was urging member countries to \"dig deep in their stockpiles\" and provide the missiles Ukraine needs.\"I know that more is urgently needed,\" he said. \"We are working to ensure that more comes quickly.\"Rutte also said Nato was standing by Ukraine as it made tough decisions during peace talks and that the alliance would provide the \"hard power\" to back up any eventual deal.But the Nato chief agreed with Zelensky that Russia's overnight attack did not \"signal seriousness about peace\".ReutersPolice officer carries a part of a Russian drone at the site of a residential building in Kyiv on 3 February, 2026Volodymyr Zelensky has accused Moscow of using the coldest days of winter to \"terrorise people\".DTEK has confirmed that two of its own power plants were hit again overnight, including in Odesa, in what it says was the ninth massive attack on the sector since October.State-run facilities were hit in Kyiv, Dnipro and elsewhere, adding to serious damage caused by a series of previous targeted attacks.DTEK says some of the plants targeted were providing heating only, not electricity, which means they were exclusively for civilian use. The Geneva Convention makes clear that targeting civilian infrastructure is a potential war crime.Each time makes it harder to carry out repairs and leaves the system more fragile, and prone to blackouts. Teams of engineers have been working through the night for weeks to fix things - drafted in from all over the country and hailed as heroes.But there are not enough workers to keep up with demand.We have met residents who have had no heating in their homes for days, in some cases weeks. They sleep in hats and coats, and under piles of blankets, but it is still bitterly cold.Many use soup kitchens to get free hot meals because there are also power cuts here for hours on end.People believe these attacks are intended to turn them against the authorities in Kyiv, to make their lives so miserable they submit to Russia's demands - including to hand over land in the eastern Donbas region that Moscow currently does not control.Instead, there is a lot of anger here at Russia for attempting to freeze civilians in their homes as well as resistance to any form of compromise with Moscow.\"Russia won't get what it wants,\" Vera told the BBC this weekend, as she queued for a bowl of stew served by volunteers. \"We are stronger than them in any case.\"Volodymyr said he planned to sleep in a local school for a few days, which has a generator to keep it warm. \"In the daytime you move around a bit,\" he said. \"But at night it's really cold.\"He was furious with Russia. \"They are bombing civilians. They want us to freeze and die,\" he said.Several residential buildings were damaged in the latest attack and set on fire by falling debris as Ukraine shot down missiles and drones. Several people were injured.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Russian hits Ukraine energy sites in 'most powerful blow\" so far this year",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6fc5/live/3e3e3370-0119-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-03T13:17:53.000Z",
      "dateModified": "2026-02-03T13:17:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Austin Appelbee: Australia boy, 13, describes swim to save family",
    "url": "https://www.bbc.com/news/articles/cly3ezj3rg3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/51c5/live/ad8ed490-0101-11f1-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-03T13:19:08.000Z",
    "description": "'I don't think I am a hero': Boy, 13, describes 'superhuman' swim to save family3 hours agoFlora DruryAustin Appelbee, alongside his mother Joanne, te",
    "body": "'I don't think I am a hero': Boy, 13, describes 'superhuman' swim to save family3 hours agoFlora DruryAustin Appelbee, alongside his mother Joanne, tells the BBC he \"was really scared\"The 13-year-old Australian boy who swam for hours to get help for his family after they were swept out to sea has told the BBC \"I didn't think I was a hero - I just did what I did\".Austin Appelbee didn't know if his mother Joanne, brother Beau and sister Grace were still alive when he finally reached the shore, four hours after he left them in the water clinging to two paddleboards.Miles out to sea off Australia's west coast - the waves getting bigger, the light beginning to fade - his mother feared he too may not have made it.Only hours later, after Joanne finally spotted the rescue boat, did she know he was safe. By that time she and the children had drifted 14km (8.5 miles) offshore.What had started as a family day at the beach had ended in a 10 hour ordeal for Joanne and her family. Austin's swim to raise the alarm was later described as \"superhuman\" by rescuers.\"I had assumed Austin hadn't made it,\" Joanne, 47, told the BBC News channel.In the end though, \"it was an absolute perfect ending to have them all well and happy and sore but no injuries\".'A tough battle'The family had been due to head home to Perth last Friday and were having \"a bit of fun\" with two paddleboards and a kayak in the shallow water off the beach, Joanne explained, when the children \"went out a bit too far\". \"The wind picked up and it went from there,\" she recalled. \"We lost oars, and we drifted out further.... It kind of all went wrong very, very quickly.\"Finding themselves drifting further and further out from Quindalup beach, in Western Australia, Joanne realised she needed to do something - but she couldn't leave Beau, 12, and Grace, eight, alone.\"Early on, we sent this young man back in to try and get help because it didn't look like we were that far from the shoreline,\" she said.Austin took the kayak, but no one realised it had been badly damaged and was already taking on water. \"It started flipping, and then I lost an oar and I knew I was in trouble,\" he recalled. \"I started paddling with my arm.\"At one point, he managed to get the kayak to work - before it threw him for the last time.Clinging to the capsized kayak, Austin - who swears he \"saw something in the water\" - realised he needed to do something.\"It was getting dangerous now - I had been out for a couple of hours.\"Getty ImagesThe family were having a holiday in Geographe Bay, Western AustraliaHe had lost sight of his family, who had also lost sight of him. As Joanne and the children drifted further out to sea, the waves got bigger and bigger, making it harder to stay on the boards, while visibility had also got worse. They were all wearing life jackets - but they had no food or water.\"I had assumed Austin had made it a lot quicker than he had,\" she said. \"As the day progressed, no vessels and nothing coming to save us. \"If he hasn't made it, what have I done, have I made the wrong decision, and is anyone going to come and save my other two?\"Austin, meanwhile, had started to swim the last 4km (two nautical miles), abandoning his own lifejacket after a time because it was not helping him. Throughout the next two hours, it was prayer, Christian songs and \"happy thoughts\" which kept the \"really scared\" 13-year-old going.\"I was thinking about mum, Beau and Grace. I was also thinking about my friends and my girlfriend - I have a really good bunch of friends,\" he said. \"When I hit the floor I thought, how am I on land right now - is this a dream?\"Then he had another thought: his family \"could still be alive out there - I have to go save them\".It was about 18:00 local time (10:00 GMT) when he finally reached his mother's bag and rang for help.The call sparked a huge search, police said in a statement on Monday.Austin - who had passed out after making the call - was taken to hospital where he called his father, bawling his eyes out. He still didn't know if Joanne and his siblings were alive.Then, minutes later, he got a call to say they had been found. Everyone - doctors and police officers - were jumping up and down with joy.\"It was a moment I will never forget,\" said Austin.ABC News/Briana ShepherdJoanne and Austin with Beau, 12, and Grace, eightOut at sea, Joanne had been struggling to keep hold of her younger children. They were freezing cold, and it was now dark. She now feared the worst had happened to Austin.\"We couldn't see anything coming to save us,\" she said. \"It was very much getting to that point where we are on our own.\"Joanne couldn't even relax when she saw the boat approaching: the children had fallen into the water and she was desperately trying to reach them. \"It was an absolute nightmare,\" she said.Back on dry land, they were treated at hospital for minor injuries. The same ambulance worker who picked up Austin was able to confirm - finally - he too had survived.He's even been back at school - admittedly on crutches, as his legs were so sore.Now, less than five days later, Austin is still trying to process what happened. He certainly doesn't see himself as a hero, despite what people keep telling him. It was, he acknowledged, a \"tough battle\".His praise is reserved for the \"lovely ambulance crew\" and the \"really quick response\" from triple zero, the emergency services.Others, however, have been effusive with their praise for Austin.Naturaliste Volunteer Marine Rescue Group's commander Paul Bresland described the efforts of the teenager as \"superhuman\".Meanwhile, Insp James Bradley said his actions \"cannot be praised highly enough - his determination and courage ultimately saved the lives of his mother and siblings\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Austin Appelbee: Australia boy, 13, describes swim to save family",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/51c5/live/ad8ed490-0101-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-03T13:19:08.000Z",
      "dateModified": "2026-02-03T13:19:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Watch: Snake scares commuters at Sydney train station",
    "url": "https://www.bbc.com/news/videos/cvgdy0ze8eko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d363/live/c8c34770-000a-11f1-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-02T07:51:51.000Z",
    "description": "CCTV footage captured the moment a snake was found by commuters at a train platform in Sydney.People were seen running away as soon as they came acros",
    "body": "CCTV footage captured the moment a snake was found by commuters at a train platform in Sydney.People were seen running away as soon as they came across the snake.One passerby approached the snake, grabbing it with bare hands and getting it out of the way while others kept their distance.A spokesman for the Transport of New South Wales told Australian media the snake was a brown or black snake, both of which species are venomous.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Watch: Snake scares commuters at Sydney train station",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/d363/live/c8c34770-000a-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-02T07:51:51.000Z",
      "dateModified": "2026-02-02T07:51:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]