[
  {
    "title": "Bus driver released after Stockholm crash arrest",
    "url": "https://www.bbc.com/news/articles/c629m7jm777o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a217/live/b51ea9c0-c177-11f0-9e77-171133adaa3b.png",
    "tag": "World",
    "date": "2025-11-15T17:00:29.000Z",
    "description": "A bus driver arrested after three people were killed and another three injured in a crash in Stockholm on Friday has been released.Authorities are con",
    "body": "A bus driver arrested after three people were killed and another three injured in a crash in Stockholm on Friday has been released.Authorities are continuing to investigate the circumstances of the incident after a bus crashed into a bus stop queue on Valhallavägen street in the Swedish capital.The Swedish Prosecution Authority said on Saturday there was \"no reason\" to keep the driver, who had been questioned by police, in custody but that \"certain investigative measures remain\".The man had been arrested on suspicion of three counts of causing death and three of causing bodily harm. Police said there was no reason to think the incident was intentional. Officials are still trying to establish the identities of the victims. The bus was not in service at the time and no passengers were on board, local media report. The crash happened near the Royal Institute of Technology university at about 15:23 (14:23 GMT).Images from the scene show rescue crews appearing to help people trapped underneath the double-decker bus.A witness who owns a shop on the street told SVT the bus hit a pole in front of the bus shelter. They said several people ran into the shop crying.A woman told the local Expressen newspaper that the bus \"mowed down an entire bus stop queue\". She said people were screaming and trying to help the injured, while dead people lay on the ground.\"There must have been more people under the bus,\" she said.Prime Minister Ulf Kristersson said his thoughts were with the victims and their families.\"People who might have been on their way home to family, friends, or a quiet evening at home. We do not yet know the cause, but right now my thoughts are primarily with those affected and their loved ones,\" he posted on X.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bus driver released after Stockholm crash arrest",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a217/live/b51ea9c0-c177-11f0-9e77-171133adaa3b.png"
      ],
      "datePublished": "2025-11-15T17:00:29.000Z",
      "dateModified": "2025-11-15T17:00:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says he will sue BBC for at least $1bn over Panorama edit",
    "url": "https://www.bbc.com/news/articles/c891jp9j79do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0acf/live/f99f2110-c1cc-11f0-8669-5560f5c90fbe.jpg",
    "tag": "World",
    "date": "2025-11-15T19:43:03.000Z",
    "description": "US President Donald Trump has said he will take legal action against the BBC over how his speech was edited by Panorama, after the corporation apologi",
    "body": "US President Donald Trump has said he will take legal action against the BBC over how his speech was edited by Panorama, after the corporation apologised but refused to compensate him.Speaking to reporters on board Air Force One on Friday evening, Trump said: \"We'll sue them for anywhere between $1bn [£759m] and $5bn, probably sometime next week.\"On Thursday, the BBC said the edit of the 6 January 2021 speech had unintentionally given \"the mistaken impression that President Trump had made a direct call for violent action\" and said it would not be broadcast again.The corporation apologised to the president but said it would not pay financial compensation.The BBC released that statement after Trump's lawyers threatened to sue the BBC for $1bn in damages unless the corporation issued a retraction, apology and paid him compensation. \"I think I have to do it,\" Trump told reporters of his plan to take legal action. \"They cheated. They changed the words coming out of my mouth.\"The president said he had not raised the issue with Sir Keir Starmer but that the prime minister had asked to speak to him. Trump said he would call Starmer over the weekend.A search of public court record databases confirmed that no lawsuit had been filed in federal or state court in Florida as of Friday evening.A BBC spokesperson said on Saturday evening: \"We have had no further contact from President Trump's lawyers at this point. \"Our position remains the same.\"In a separate interview on Saturday recorded before his comments on Air Force One, Trump said he had an \"obligation\" to sue the BBC, adding: \"If you don't do it, you don't stop it from happening again with other people.\"He called the edit \"egregious\" and \"worse than the Kamala thing\", a reference to a dispute he had with US news outlet CBS over an interview on the 60 Minutes programme with his 2024 election opponent Kamala Harris.In July this year, US media company Paramount Global agreed to pay $16m (£13.5m) to settle a legal dispute over that interview.Sir Craig Oliver, former BBC editor and ex-director of politics and communications for former Prime Minister David Cameron, told BBC Today programme that this is a \"nightmare\" situation for the public broadcaster. \"The problem is that public money could be spent fighting this or settling this,\" Sir Craig said, adding that Trump doesn't \"understand the BBC, how it is funded or how it works\". Watch: Trump says he will sue the BBC. Gary O'Donoghue explains what's nextThe controversy stems from the way in which Trump's 6 January 2021 speech was edited by Panorama for a documentary which aired in October 2024. During his address, he told supporters: \"We're going to walk down to the Capitol, and we're going to cheer on our brave senators and congressmen and women.\"More than 50 minutes later in the speech, he said: \"And we fight. We fight like hell.\"In the Panorama programme the clip shows him as saying: \"We're going to walk down to the Capitol... and I'll be there with you. And we fight. We fight like hell.\"Controversy around how Trump's speech was edited has led to the resignations of BBC director general Tim Davie and head of news Deborah Turness.In its Corrections and Clarifications section, published on Thursday evening, the BBC said the Panorama programme had been reviewed after criticism of how Trump's speech had been edited.\"We accept that our edit unintentionally created the impression that we were showing a single continuous section of the speech, rather than excerpts from different points in the speech, and that this gave the mistaken impression that President Trump had made a direct call for violent action,\" the statement said.Lawyers for the BBC have written to Trump's legal team, a BBC spokesperson said this week.\"BBC chair Samir Shah has separately sent a personal letter to the White House making clear to President Trump that he and the corporation are sorry for the edit of the president's speech on 6 January 2021, which featured in the programme,\" they said.They added: \"While the BBC sincerely regrets the manner in which the video clip was edited, we strongly disagree there is a basis for a defamation claim.\"In its letter to Trump's legal team, the BBC set out five main arguments for why it did not think it had a case to answer.First it said the BBC did not have the rights to, and did not, distribute the Panorama episode on its US channels.When the documentary was available on BBC iPlayer, it was restricted to viewers in the UK.Secondly, it said the documentary did not cause Trump harm, as he was re-elected shortly after.Thirdly, it said the clip was not designed to mislead, but just to shorten a long speech, and that the edit was not done with malice.Fourthly, it said the clip was never meant to be considered in isolation. Rather, it was 12 seconds within an hour-long programme, which also contained lots of voices in support of Trump.Finally, an opinion on a matter of public concern and political speech is heavily protected under defamation laws in the US.The BBC's apology came hours after a second similarly edited clip, broadcast on Newsnight in 2022, was revealed by the Daily Telegraph.Watch: How the BBC works... in under two minutes",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says he will sue BBC for at least $1bn over Panorama edit",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0acf/live/f99f2110-c1cc-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-15T19:43:03.000Z",
      "dateModified": "2025-11-15T19:43:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Iran confirms it seized tanker in Strait of Hormuz",
    "url": "https://www.bbc.com/news/articles/cze6zxjw3g3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5e86/live/0e971ea0-c237-11f0-a786-17e554da8bc7.jpg",
    "tag": "World",
    "date": "2025-11-15T13:57:25.000Z",
    "description": "Iran's Islamic Revolutionary Guard Corps (IRGC) has confirmed it seized a tanker on Friday morning in the Strait of Hormuz.The Talara tanker, sailing ",
    "body": "Iran's Islamic Revolutionary Guard Corps (IRGC) has confirmed it seized a tanker on Friday morning in the Strait of Hormuz.The Talara tanker, sailing under the flag of the Marshall Islands, was travelling from the United Arab Emirates (UAE) to Singapore.The IRGC said it was found to be \"in violation of the law by carrying unauthorised cargo\", but did not provide details of the violation. Reports suggest it was carrying high-sulphur gasoil. Iran has periodically seized tankers and cargo ships travelling in and around the Persian Gulf, which is a key global shipping route for oil and liquefied natural gas. It has often cited maritime violations such as smuggling or legal issues. Maritime security company Ambrey said the Talara tanker had departed from Ajman in the United Arab Emirates and was heading south through the Strait of Hormuz when it was approached by three small boats, after which it made a \"sudden course deviation\".The US Navy's 5th fleet, which patrols the region, said on Friday it was \"actively monitoring the situation\".\"Commercial vessels are entitled to largely unimpeded rights of navigation and commerce on the high seas,\" it added. The company that manages the ship announced it had lost contact with the crew on Friday morning, while the tanker was 20 nautical miles off the coast of Sharjah's Khorfakkan port.The UK's Maritime Trade Operations Centre said it had received reports on the incident and advised vessels \"to transit with caution and report any suspicious activity\". Iran has for years threatened to close the Strait of Hormuz, through which about 20% of all traded oil passes, in retaliation for Western sanctions and other actions against it. Its threats ramped up during the 12-day conflict with Israel in June - during which Israel and United States carried out a bombing campaign on Iran's nuclear facilities, and Iran retaliated by striking Israel. In April 2024, the IRGC seized a commercial ship with links to Israel, following a deadly attack on Iran's consulate in Syria which was blamed on Israel.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iran confirms it seized tanker in Strait of Hormuz",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5e86/live/0e971ea0-c237-11f0-a786-17e554da8bc7.jpg"
      ],
      "datePublished": "2025-11-15T13:57:25.000Z",
      "dateModified": "2025-11-15T13:57:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump targets longtime MAGA ally Marjorie Taylor Greene",
    "url": "https://www.bbc.com/news/articles/c9wv4dx05q5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/91d8/live/51472cb0-c1d1-11f0-a9fe-75bc5051575c.jpg",
    "tag": "World",
    "date": "2025-11-15T15:46:15.000Z",
    "description": "President Donald Trump has withdrawn all support for Republican Congresswoman Marjorie Taylor Greene, a firebrand conservative who long supported Trum",
    "body": "President Donald Trump has withdrawn all support for Republican Congresswoman Marjorie Taylor Greene, a firebrand conservative who long supported Trump's agenda but recently criticised several of his policies.Trump said in a nearly 300-word social media post that the Georgia lawmaker had gone \"far left\", and called for her to be unseated in next year's midterm election by a Republican challenger. The falling out comes after Greene questioned whether Trump was still putting \"America First\" on his agenda. She criticised his focus on foreign policy and handling of the Jeffrey Epstein files.Greene said Trump was lashing out to try and deter other Republicans from voting to release the files.\"All I see \"Wacky\" Marjorie do is COMPLAIN, COMPLAIN, COMPLAIN!\" Trump posted, while en route to his home in Florida on Friday night.He claimed that she turned on him after he suggested that she shouldn't run for governor or senator. \"She has told many people that she is upset that I don't return her phone calls anymore,\" Trump said, adding, \"I can't take a ranting Lunatic's call every day.\"Trump also said that voters in her district \"are fed up with her and her antics and, if the right person runs, they will have my Complete and Unyielding Support\".Trump has long faced criticism from both parties over his handling of the US Department of Justice's files related to Epstein, the late financier and convicted paedophile. Trump was a friend of Epstein's for years, but the president has said they fell out in the early 2000s, two years before Epstein was first arrested. Trump has consistently denied any wrongdoing in relation to Epstein.Greene is one of four House Republicans - including Nancy Mace, Lauren Boebert, and Thomas Massie - who joined Democrats in signing a discharge petition calling for the release of the Epstein files.In response to Trump, Greene posted on X that Trump was trying to stop other Republicans from voting in favour of the Epstein petition.\"He's coming after me hard to make an example to scare all the other Republicans before next weeks vote to release the Epstein files,\" she posted, adding: \"It's astonishing really how hard he's fighting to stop the Epstein files from coming out that he actually goes to this level.\"Greene has in recent days been attacking Trump for not doing enough to bring down costs for voters, and for his involvement in foreign conflicts, and tariff policies.But she has also fiercely criticised his approach to handing the Epstein files. \"I truly just stand with the women, and I think they deserve to be the ones that we're fighting for,\" she told the BBC's US partner, CBS News, earlier on Friday.Their row continued into the weekend, as they traded barbs on social media. On Saturday, Trump posted several more times to call her a \"traitor\", a \"disgrace\", and \"just another Fake politician\".Greene also posted on X: \"I believe in the American people more than I believe in any leader or political party\", adding: \"The way forward is America First America Only.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump targets longtime MAGA ally Marjorie Taylor Greene",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/91d8/live/51472cb0-c1d1-11f0-a9fe-75bc5051575c.jpg"
      ],
      "datePublished": "2025-11-15T15:46:15.000Z",
      "dateModified": "2025-11-15T15:46:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump rolls back tariffs on dozens of food products",
    "url": "https://www.bbc.com/news/articles/cdjr4xw83eko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c945/live/5af4f750-c1aa-11f0-a67e-9bebb1aed6eb.jpg",
    "tag": "World",
    "date": "2025-11-15T02:11:46.000Z",
    "description": "18 hours agoDanielle Kaye,Business reporter and Nardine SaadUS President Donald Trump has signed an executive order allowing a range of food products,",
    "body": "18 hours agoDanielle Kaye,Business reporter and Nardine SaadUS President Donald Trump has signed an executive order allowing a range of food products, including coffee, bananas and beef, to escape his sweeping tariffs.The move comes as his administration faces mounting pressure over rising prices. While Trump previously downplayed concerns about the cost of living, he has focused on the issue since his Republican Party's poor performance in last week's elections.The dozens of products included on the White House's list of exemptions range from avocados and tomatoes to coconuts and mangoes.These goods, the Trump administration said on Friday, cannot be produced in sufficient quantities domestically.Trump has long said that his tariffs - currently a baseline 10% on imports from all countries, with additional levies on many trading partners - would not lead to increased prices for US consumers. He also said affordability was a \"new word\" and a \"con job\" by Democrats.He has argued the taxes are necessary to reduce the US trade deficit - the gap between the value of goods it buys from other countries and those it sells to them. Trump has said the US has been exploited by \"cheaters\" and \"pillaged\" by foreigners, adding that higher levies would encourage those in the US to buy American goods instead. But grocery costs and the soaring price of beef has become a political issue for Trump. Last week, he called for an investigation into the meat-packing industry, accusing companies of \"Illicit Collusion, Price Fixing, and Price Manipulation\".He has aimed to rally support for the taxes, offering $2,000 tariff rebate cheques to Americans - even as the US Supreme Court is currently weighing whether Trump had the legal authority to implement them.  But the latest exemptions signal a reversal by the Trump administration, as the White House seeks to lower prices by walking back levies on some food staples.Speaking to reporters on Friday, Trump said the decision will affect products that are not produced in the US, \"so there's no protection of our industries, or our food products\".He added that he doesn't think more policy rollbacks will be required in the future, saying \"I don't think it'll be necessary.\" \"We just did a little bit of a rollback on some foods, like coffee as an example, where the prices of coffee were a little bit high. Now they'll be on the low side in a very short period of time,\" Trump said.Economists have warned that companies would pass the cost of tariffs onto their customers in the form of higher prices.While inflation remained milder than many analysts had expected in September, most items tracked in the Department of Labor inflation report showed price increases, with groceries up 2.7% from last year.The Trump administration's new tariff exemptions for food products take effect retroactively at midnight on Thursday 13 November, the White House said.In another move to address concerns among consumers about grocery prices, the Trump administration said import taxes on coffee and bananas will be lowered as part of trade deals with four Latin American countries.This week, Trump and Treasury Secretary Scott Bessent both vowed to decrease coffee prices by 20% in the US this year.The White House released a list that includes more than 100 products no longer subject to the levies. Some of them include: CoffeeCocoaBlack teaGreen teaVanilla beansBeef products, including high-quality cuts, bone-in and boneless cuts, corned beef, some frozen items, as well as salted, brined, dried or smoked meatFruits, including acai, avocadoes, bananas, coconuts, guavas, limes, oranges, mangoes, plantains, pineapples, various peppers and tomatoesSpices, including allspice, bay leaves, cardamom, cinnamon, cloves, coriander seeds, cumin seeds, curry, dill fennel seeds, ginger, mace, nutmeg, oregano, paprika, saffron and turmericNuts, grains, roots and seeds, such as barley, Brazil nuts, capers, cashews, chestnuts, macadamia nuts, miso, palm hearts, pine nuts, poppy seeds, tapioca, taro and water chestnuts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump rolls back tariffs on dozens of food products",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c945/live/5af4f750-c1aa-11f0-a67e-9bebb1aed6eb.jpg"
      ],
      "datePublished": "2025-11-15T02:11:46.000Z",
      "dateModified": "2025-11-15T02:11:46.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Kashmir blast: Nine killed in accidental explosion at police station in Indian-administered Kashmir, officials say",
    "url": "https://www.bbc.com/news/articles/cnvel2gvqeqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3586/live/25eb4170-c1ed-11f0-a3c4-ebcbc0706d0f.jpg",
    "tag": "World",
    "date": "2025-11-15T10:04:06.000Z",
    "description": "10 hours agoDanai Nesta KupembaBBC NewsNine people have been killed and 32 injured after a stockpile of confiscated explosives accidentally blew up at",
    "body": "10 hours agoDanai Nesta KupembaBBC NewsNine people have been killed and 32 injured after a stockpile of confiscated explosives accidentally blew up at a police station in Indian-administered Kashmir, police said.It comes just days after a car blast killed several people in Delhi, in what the government has called a \"terror incident\". The explosion happened on Friday evening at Nowgam police station, and the explosives were seized from Faridabad in the northern state of Haryana earlier in the week. The region's director general of police, Nalin Prabhat, said the explosives were being sent for forensic examination - but due to a \"very unfortunate\" mishap during handling they detonated at around 23:20 local time (17:50 GMT).Police said in a statement that it was an accidental detonation, not a terrorist attack. \"Any other speculation into the cause of this incident is unnecessary,\" the police chief told journalists.The police station suffered severe damage in the explosion and adjacent buildings were also affected, he said.Multiple vehicles were \"engulfed in flames and reduced to charred husks, with debris scattered across the site\", according to a police statement. \"The intensity of the blast was such that some body parts were recovered from nearby houses, around 100-200 metres away from the police station,\" a source told Reuters news agency. Most of the victims were police officers, along with forensic personnel, two crime scene photographers, and a tailor who was with the team. Manoj Sinha, the region's Lieutenant Governor appointed by the Indian government, expressed his condolences and said he had ordered an investigation. \"I have ordered a probe to ascertain the cause of the accidental explosion. Deeply anguished by the loss of precious lives due to extremely tragic accidental blast at Nowgam police station in Srinagar. My condolences to the bereaved families. I pray for speedy recovery of the injured,\" he wrote on social media.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Kashmir blast: Nine killed in accidental explosion at police station in Indian-administered Kashmir, officials say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3586/live/25eb4170-c1ed-11f0-a3c4-ebcbc0706d0f.jpg"
      ],
      "datePublished": "2025-11-15T10:04:06.000Z",
      "dateModified": "2025-11-15T10:04:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "At 16, I was experimented on by the CIA and now I'm suing",
    "url": "https://www.bbc.com/news/articles/cvgdngkxedzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5d16/live/ad3f3f40-ba87-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-11-15T00:14:49.000Z",
    "description": "20 hours agoRobin Levinson-King and Eloise AlannaSubmitted photoThe first thing Lana Ponting remembers about the Allan Memorial Institute, a former ps",
    "body": "20 hours agoRobin Levinson-King and Eloise AlannaSubmitted photoThe first thing Lana Ponting remembers about the Allan Memorial Institute, a former psychiatric hospital in Montreal, Canada, is the smell - almost medicinal.\"I didn't like the look of the place. It didn't look like a hospital to me,\" she told the BBC from her home in Manitoba.That hospital – once the home of a Scottish shipping magnate – would be her home for a month in April 1958, after a judge ordered the then-16-year-old to undergo treatment for \"disobedient\" behaviour.It was there that Ms Ponting became one of thousands of people experimented on as part of the CIA's top-secret research into mind control. Now, she is one of two named plaintiffs in a class-action lawsuit for Canadian victims of the experiments. On Thursday, a judge denied the Royal Victoria Hospital's appeal, paving the way for the lawsuit to proceed.According to her medical files, which she obtained only recently, Ms Ponting had been running away from home and hanging out with friends her parents disapproved of after a difficult move with her family from Ottawa to Montreal.\"I was an ordinary teenager,\" she recalled. But the judge sent her to the Allan.Once there, she became an unwitting participant in covert CIA experiments known as MK-Ultra. The Cold War project tested the effects of psychedelic drugs like LSD, electroshock treatments and brainwashing techniques on human beings without their consent.Over 100 institutions – hospitals, prisons and schools – in the US and Canada were involved.At the Allan, McGill University researcher Dr Ewen Cameron drugged patients and made them listen to recordings, sometimes thousands of times, in a process he called \"exploring\".The Allan Memorial Institute in Montreal is where the CIA-backed experiments were conducted in CanadaDr Cameron would make Ms Ponting listen to the same tape recording hundreds of times.\"It ran over and over again, you're a good girl, you're a bad girl,\" Ms Ponting recalled.The technique was a form of \"psychic driving,\" says doctoral student Jordan Torbay, who has researched his experiments and their ethical implications.\"Essentially the minds of patients were manipulated using verbal cues,\" she says, adding he also looked at the effects of sleep drugs, forced sensory deprivation, and induced coma.Medical records show Ms Ponting was given LSD, as well as drugs like sodium amytal, a barbiturate, desoxyn, a stimulant, as well as nitrous oxide gas, a sedative known as laughing gas.\"By April 30th, the patient had explorations… she had become quite tense and extremely violent when given the Nitrous Oxide, throwing herself half out of bed and starting to scream,\" Dr Cameron wrote in one of her medical files, which Ms Ponting has obtained through a freedom of information request.The harsh truth about the MK-Ultra experiments first came to light in the 1970s. Since then, several victims have tried to sue the US and Canada. Lawsuits in the US have largely been unsuccessful, but in 1988, a Canadian judge ordered the US government to pay nine victims $67,000 each. In 1992 the Canadian government paid C$100,000 (about $80,000 at the time) to each of 77 victims – but did not admit liability.Ms Ponting was not among them, because she did not yet know that she was a victim, she saysWatch: The CIA's secret pursuit of 'mind control'Listen: The Woman Who Resisted Mind ControlFor decades, Ms Ponting said she felt something was wrong with her, but she did not learn of the details of her own involvement in the experiments until somewhat recently.She says she had little memory of what happened at the Allan, or in the years that followed.Ms Ponting eventually married and moved to Manitoba, where she had two children whom she is still close to. Now, she's a grandmother to four grandchildren. But she says she has suffered life-long repercussions from her time at the Allan.\"I felt it all my life, because I was wondering why I would think this way, or, you know what happened to me,\" she said.She says she's had to be on a cocktail of medications her whole life to deal with mental-health issues, which she attributes to her time at the Allan, as well as recurrent nightmares.\"Sometimes I wake up screaming in the night because of what happened,\" she said.The Royal Victoria Hospital and McGill University declined to comment as the case is before the courts. The government pointed the BBC to its previous settlement, in 1992, which it said was done for \"humanitarian\" reasons and did not accept legal liability.For Ms Pointing, the lawsuit is a chance to finally get some closure.\"Sometimes I sit in my living room and my mind goes back, and I can think of the things that happened to me, you know,\" she says. \"Every time I see a picture of Dr Cameron, it makes me so angry.\"Although Dr Cameron's work has since become synonymous with MK-Ultra experiments, Ms Torbay says her research shows he didn't know he was being funded by the CIA at the time. His work with the US intelligence agency ended in 1964, and he died shortly after, of a heart attack, in 1967.But regardless of whether he knew of where the money was coming from, Ms Torbay says he should have known the experiments he was conducting were not ethical.She says she hopes the lawsuit goes forward, and the victims get some sense of justice.\"It isn't really about giving the patients back what they lost, because that's not possible, but sort of almost making sure their suffering wasn't in vain, that we do learn from this,\" she says.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "At 16, I was experimented on by the CIA and now I'm suing",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5d16/live/ad3f3f40-ba87-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-11-15T00:14:49.000Z",
      "dateModified": "2025-11-15T00:14:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pope Leo welcomes cinema stars to the Vatican",
    "url": "https://www.bbc.com/news/articles/cdxr5drrpqxo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/30ea/live/86c877c0-c237-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "World",
    "date": "2025-11-15T16:06:45.000Z",
    "description": "4 hours agoSarah RainsfordSouthern and Eastern Europe correspondent, RomeReutersPope Leo has held an audience with Hollywood stars, urging actors and ",
    "body": "4 hours agoSarah RainsfordSouthern and Eastern Europe correspondent, RomeReutersPope Leo has held an audience with Hollywood stars, urging actors and directors including Cate Blanchett, Viggo Mortensen and Monica Bellucci to continue their work as \"pilgrims of the imagination\", helping to \"bring hope\".The celebrity meeting was a sprinkling of star dust for a still relatively new pope and a way for the Catholic Church to engage more with the world beyond.It was also a strong show of support from Leo XIV for the global film industry, as he spoke out against the \"troubling decline\" in cinema-going.Hailed by director Spike Lee as a \"great day\", the gathering was the first of its kind in the Vatican.Beneath the magnificent frescoes of the Clementine Hall, Pope Leo spoke in Italian to praise the power of cinema to entertain and to educate – and for its \"capacity to amaze\".But he urged filmmakers not to shy away from what he called \"the world's wounds\".\"Violence, poverty, exile, loneliness, addiction and forgotten wars are issues that need to be acknowledged and narrated,\" the Pope said. \"Good cinema does not exploit pain; it recognizes and explores it. This is what all the great directors have done.\"Six months since a conclave of cardinals elected the first North American to the Papacy, some Catholics feel that Leo has been slow to stamp his own mark on the role.His predecessor, Francis, was a charismatic Argentinian known for his off-the-cuff comments and dramatic gestures. Leo's style is far quieter, so this star-studded engagement is a new look.Watch: Among the stars to meet the Pope was Spike Lee who had a unique gift for Leo XIV.It's not clear how the cast list was drawn up, although none of the directors in the hall – who came from all over the world – made it onto the Pope's own top film list.This week, the Vatican revealed that his favourite four watches of all time included the 1960s nun-themed classic The Sound of Music, It's a Wonderful Life and Italian Roberto Benigni's multi award-winning Life is Beautiful.Among those who did join today's A-list audience were Mortensen, Chris Pine and filmmaker Gus Van Sant – of Milk and Good Will Hunting fame. The large Italian contingent included Gianni Amelio and Cinema Paradiso creator, Giuseppe Tornatore.At a time of immense pressure on film, not long after a major Hollywood strike and with funding strains here in Italy, the Pope spoke in defence of the industry.He was applauded loudly when he talked of the \"quiet dedication\" of all those behind the scenes with vital roles.ReutersThe audience for the international filmmakers was held beneath the magnificent frescoes of the Clementine Hall He also warned against the closure of cinemas which he characterised as the \"beating heart of communities\".\"More than a few people are saying that the art of cinema and the cinematic experience are in danger. I urge institutions not to give up, but to cooperate in affirming the social and cultural value of this activity,\" the Pope said.After a fifteen-minute speech and a blessing he then received each audience member in turn, led by Blanchett.\"He really urged us to go back into our day jobs and inspire people,\" the Australian-born star told reporters.One of many who came bearing gifts, the actress – who works with the UN refugee agency, UNHCR – placed a woven bracelet in the Pope's hand. \"It was a bracelet I wear in solidarity with people who are displaced,\" she explained later.Lee handed the Chicago-born Pope a New York Knicks shirt printed with the number 14 and the words Pope Leo.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pope Leo welcomes cinema stars to the Vatican",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/30ea/live/86c877c0-c237-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-15T16:06:45.000Z",
      "dateModified": "2025-11-15T16:06:45.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US justice department investigates Epstein's alleged ties to Clinton and banks after Trump request",
    "url": "https://www.bbc.com/news/articles/cj97x2lere0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/248a/live/1c6c58d0-c181-11f0-be56-f12785bd2327.jpg",
    "tag": "World",
    "date": "2025-11-15T02:31:40.000Z",
    "description": "The US justice department has confirmed it will investigate paedophile financier Jeffrey Epstein's alleged links to major banks and several prominent ",
    "body": "The US justice department has confirmed it will investigate paedophile financier Jeffrey Epstein's alleged links to major banks and several prominent Democrats, including former President Bill Clinton.US President Donald Trump said he would ask Attorney General Pam Bondi and the FBI to look into Epstein's \"involvement and relationship\" with Clinton and others.Bondi said the department \"will pursue this with urgency and integrity\".Trump's request came days after thousands of Epstein's emails were released by the US Congress - which include mentions of the US president. Democrats have accused Trump of trying to deflect from questions about his relationship with Epstein.The emails, released by the US House Oversight Committee, include many high-profile figures. A review by the Wall Street Journal found that Trump was mentioned in more than 1,600 of the 2,324 email threads. Robert Garcia, the leading Democrat on the committee, said Trump was attempting to \"deflect from serious new questions we have about his relationship with Jeffrey Epstein\".In addition to Clinton, Trump said he asked the Department of Justice (DoJ) to investigate banks JP Morgan and Chase, former Treasury Secretary Larry Summers and LinkedIn founder Reid Hoffman, who is also a prominent Democratic donor.\"Epstein was a Democrat, and he is the Democrat's problem, not the Republican's problem!\" he wrote on social media. \"They all know about him, don't waste your time with Trump. I have a Country to run!\"Clinton has strongly denied he had any knowledge of Epstein's crimes.A spokesperson for JPMorgan Chase said the firm regrets \"any association\" they had with Epstein, and added that the firm \"did not help him commit his heinous acts\".It is unclear whether Trump made a formal request or issued a directive to the justice department, or if Bondi was responding to his post on his Truth Social platform.Bondi said she appointed US Attorney Jay Clayton to lead an investigation into the ties with Epstein. Trump's request comes ahead of the House of Representatives' vote next week on whether the justice department should release all its files related to the investigation into Epstein, who died in prison in 2019.Democrat Adelita Grijalva's swearing in to the chamber on Wednesday triggered the move, after she immediately signed a discharge petition from calling for the release of the files.Her signature was the 218th - the final signing needed to trigger a floor vote. Four Republicans joined with Democrats to call for the vote.Interest in Epstein's relationships was renewed this week after US lawmakers released more than 20,000 pages of documents from his estate, including many mentioning Trump.Documents released by the House Oversight Committee on Wednesday appeared to show correspondence between Epstein and the former US Treasury Secretary, Larry Summers from October 2017.In one email, Summers gives Epstein his opinion of Trump early in his presidency, writing: \"DJT is world s luckiest guy in terms of opposition, economy etc. still think his world will collapse\".A representative for Summers told the Wall Street Journal in 2023 that the former treasury official and past president of Harvard University \"deeply regrets being in contact with Epstein after his conviction\".The documents also included email exchanges between Epstein and his long-time associate Ghislaine Maxwell, who is currently serving a 20-year prison sentence for sex trafficking.In one email, sent in 2011, Epstein writes to Maxwell: \"I want you to realize that that dog that hasn't barked is Trump.. [VICTIM] spent hours at my house with him.\"Trump was a friend of Epstein's for years, but the president has said they fell out in the early 2000s, two years before Epstein was first arrested. Trump has consistently denied any wrongdoing in relation to Epstein. While he was discussed in some of the messages released this week, he did not send or receive them.Traditionally, presidents do not direct the justice department to investigate individuals and companies and have often brought in special counsels - independent attorneys from outside the administration - to carry out investigations. It is also rare for an administration to seek an investigation of a predecessor. However, the Biden administration started investigations tied to allegations that Trump tried to interfere with the 2020 election, which were then referred to a special counsel. The cases were dropped when Trump returned to the White House. In a letter addressed to Congress, Epstein survivors and the family of Virginia Giuffre - a prominent accuser of his - called for US lawmakers to vote in favour of releasing the files. \"As you gather with your family this season, remember that your primary duty is to your constituents. Look into the eyes of your children, your sisters, your mothers, and your aunts,\" the letter reads.\"Imagine if they had been preyed upon. Imagine if you yourself were a survivor. What would you want for them? What would you want for yourself? When you vote, we will remember your decision at the ballot box.\"On Friday, Republican congresswoman Marjorie Taylor Greene said it would be \"huge miscalculation\" for Trump to oppose the release of material related to Epstein. Greene was among the four other House Republicans - Nancy Mace, Lauren Boebert, Thomas Massie - who joined Democrats in signing a discharge petition calling for the release of the files.\"I truly just stand with the women, and I think they deserve to be the ones that we're fighting for,\" she told the BBC's US partner, CBS News.On Friday night, Trump announced that he had withdrawn his support for Greene, calling his formerly close ally \"wacky\" and \"a ranting lunatic\", and offering to back her Republican challenger in next year's midterm elections.\"That's too bad she's lost a wonderful conservative reputation,\" he told reporters.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US justice department investigates Epstein's alleged ties to Clinton and banks after Trump request",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/248a/live/1c6c58d0-c181-11f0-be56-f12785bd2327.jpg"
      ],
      "datePublished": "2025-11-15T02:31:40.000Z",
      "dateModified": "2025-11-15T02:31:40.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Prashant Kishor: Why India's political start-ups rarely succeed",
    "url": "https://www.bbc.com/news/articles/cz7p5xn8qjpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5df4/live/111bf9f0-bfb4-11f0-8669-5560f5c90fbe.jpg",
    "tag": "World",
    "date": "2025-11-15T02:55:39.000Z",
    "description": "17 hours agoSoutik BiswasIndia correspondentHindustan Times via Getty ImagesKishor launched Jan Suraaj, a political party aiming to end Bihar's stagna",
    "body": "17 hours agoSoutik BiswasIndia correspondentHindustan Times via Getty ImagesKishor launched Jan Suraaj, a political party aiming to end Bihar's stagnationFor over a decade, Prashant Kishor was India's backstage magician -  the political  strategist trusted by everyone from Prime Minister Narendra Modi to powerful regional leaders such as Nitish Kumar and Mamata Banerjee. But when the 48-year-old finally stepped into the arena himself, the spell snapped.Kishor launched Jan Suraaj (People's Good Governance) with the swagger of a data-driven political start-up and the promise of breaking the cycle of stagnation in Bihar, India's poorest and third most populous state. He spent two years walking across the state, built a slick organisation and fielded candidates in almost all 243 seats. The media buzz was huge, but Jan Suraaj failed to win a single seat, scraping only a sliver of the vote, as Modi's BJP-led alliance swept to power.For all the attention Kishor commanded - often more than established leaders - the party could not convert visibility into votes. In India's febrile and deeply divided political marketplace, his debut, many believe, stands as a cautionary tale: breaking into the system is far harder than diagnosing its flaws from the outside.The modern history of Indian politics bears this out. Since the rise of the regional Telugu Desam Party (TDP) in 1983, very few new parties have crossed the threshold of relevance. Those that have - from West Bengal's Trinamool Congress to Odisha's Biju Janata Dal - were breakaway factions of major parties, anchored in existing social bases. Others, like Assam's Asom Gana Parishad (AGP) in 1985 or Delhi's Aam Aadmi Party  (AAP) decades later, rode on the back of mass mobilisation and political crises. Kishor's Jan Suraaj had neither. It was not born of a street movement, nor did it emerge into a moment of anti-incumbent fury. Despite its many problems, Bihar in 2025 appeared to be largely content with the status quo.\"There was no anti-incumbency wave - voters largely stuck to established political and social loyalties. Without a visible crisis or widespread dissatisfaction, Kishor's party never appeared a credible alternative, despite hard work and mobilisation,\" says Rahul Verma, a political scientist.Jan Suraaj's debut in Bihar also contrasted sharply with most new Indian parties. While parties like the AGP, TDP and AAP grew from \"socio-political movements that already had deep emotional and grassroots resonance\", and AAP was born from a mass anti-corruption movement, Jan Suraaj was conceived as \"more of an intellectual and strategic project\" - a strategy-driven initiative to fill what Kishor called a \"political vacuum\", says Saurabh Raj of the Delhi-based Indian School of Democracy.AFP via Getty Images)Bihar recorded a record 66.91% turnout in polls in November, the highest since 1951\"The subsequent padayatra [a long, grassroots walk across the state to meet people] tried to turn that intellectual idea into a people's campaign. But it still lacked the organic, movement-based energy that typically propels new parties to relevance. In that sense, Jan Suraaj feels more like a 'designed political start-up' than a party born of agitation or upheaval,\" adds Raj.Kishor bet that this meticulously designed political project could substitute for a loyal constituency.He talked of governance, jobs, forced migration for jobs and education - a compelling agenda in a state long trapped by caste and patronage politics. Reaching Bihar's 130 million mostly young people, Kishor brought hype, methods, charisma - and even memes.But many believe his party lacked the combustible emotional energy that propels insurgent political outfits. Kishor's refusal to contest a seat himself may have deepened doubts about whether he was running an experiment or offering an alternative.The Bihar verdict laid bare a structural truth of Indian politics: attention is not organisation, and media hype without ground strength can backfire.As Raj notes, Jan Suraaj \"failed to become a serious contender on any seat\", and even its modest vote share \"shows the gap between visibility and strength\". The party has recognition but no natural social base - no caste, religious, gender or urban constituencies like its rivals, he says.Verma puts it more bluntly: start-ups fail more often than they succeed - in business and in politics.\"We tend to remember only the successes, but most new parties fail,\" he adds.Building a party requires visibility, organisation, mobilisation and the right candidates - each a separate challenge, especially without a track record of voters trust, says Verma. Jan Suraaj fielded candidates in 238 seats, most of them first-timers.What does the failure of Kishor's high-profile Jan Suraaj tell us about Indian voters? Kishor drew crowds wherever he campaigned, was articulate and dominated media coverage - yet his party lost to a coalition led by 74-year-old veteran Nitish Kumar, whom he had bet would never return to power.Hindustan Times via Getty Images)Arvind Kejriwal's AAP rode to power on the back of an anti-corruption movement\"Indian voters today are more politically aware and issue-sensitive than ever before, but they also remain deeply pragmatic. They often appreciate the freshness of a new agenda but tend to 'vote safe' unless convinced of a party's viability,\" says Raj.He believes Jan Suraaj's focus on governance, jobs and migration was coherent and appealing, but without a charismatic electoral face, voters struggled to see it as a winning alternative.By contrast, AAP's early success in Delhi hinged on anti-corruption campaigner Arvind Kejriwal personally contesting against Sheila Dikshit, the then chief minister of Delhi, a symbolic act that converted volunteers into voters.\"Kishor's decision to stay away from contesting limited that emotional connect and credibility. For new parties, a compelling agenda matters, but a relatable, risk taking leader who embodies that agenda is often the tipping point,\" says Raj.Yet, this may not be the end for Kishor's party. In the past, he has promised to stay in Bihar and strengthen its grassroots presence and agenda if he lost the polls.Raj believes if Jan Suraaj can maintain a steady ground presence, cultivate local leadership and avoid the \"post-election dormancy\" that traps many new parties, it may gradually convert attention into influence.\"Bihar's political landscape is fluid, traditional caste loyalties are evolving and there is a growing appetite for credible alternatives. If Kishor chooses to lead from the front politically rather than strategically, and continues the grassroots engagement beyond the electoral cycle, Jan Suraaj could become a meaningful electoral force by 2030,\" he says.As one local voter put it to a reporter in a village in Bihar: \"People might respond to [Kishor] in the next election. This time, he's just getting his feet wet - he's not some superhero who can soar immediately.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Prashant Kishor: Why India's political start-ups rarely succeed",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5df4/live/111bf9f0-bfb4-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-15T02:55:39.000Z",
      "dateModified": "2025-11-15T02:55:39.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pakistan's army chief gets more powers and lifelong immunity",
    "url": "https://www.bbc.com/news/articles/c9d6w1glz3qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c1b3/live/af549250-c138-11f0-8717-7b6a6b2fefad.jpg",
    "tag": "World",
    "date": "2025-11-14T23:49:17.000Z",
    "description": "Pakistan's army has always been influential - now its chief has new powers20 hours agoCaroline DaviesPakistan correspondent, IslamabadEPAField Marshal",
    "body": "Pakistan's army has always been influential - now its chief has new powers20 hours agoCaroline DaviesPakistan correspondent, IslamabadEPAField Marshal Munir, who has been army chief since November 2022, will now also oversee the navy and air forcePakistan's parliament has voted to give army chief Field Marshal Asim Munir new powers and lifetime immunity from arrest and prosecution, a move that critics say paves the way towards autocracy.The 27th constitutional amendment, which was signed into law on Thursday, will also make significant changes to the way the country's top courts operate.Those defending the changes say they provide clarity and administrative structure to the armed forces, while helping to ease a backlog in the courts. Pakistan's military has long played a prominent role in the nuclear-armed country's politics - sometimes seizing power in coups, and, on other occasions, pulling levers behind the scenes.Throughout its history, Pakistan has oscillated from more civilian autonomy to overt control under military leaders like General Pervez Musharraf and General Zia-ul-Haq. Analysts refer to the balance between civilian and military as hybrid rule.Some see the amendment as a sign that the balance is shifting in the military's favour.\"For me, this amendment is the latest indication, perhaps the strongest yet, that Pakistan is now experiencing not a hybrid system, but a post-hybrid system,\" says Michael Kugelman, former director of the Wilson Center's South Asia Institute in Washington. \"We're essentially looking at a situation where the civil-military imbalance is about as imbalanced as it could possibly be.\"The latest amendment means that Munir, who has been army chief since November 2022, will now also oversee Pakistan's navy and air force.His field marshal title and uniform are for life and he will be given \"responsibilities and duties\" even after retirement determined by the president with the advice of the prime minister. The expectation is that this will give him a prominent role in public life for as long as he is alive.Supporters of the bill have argued it clarifies Pakistan's military command structure.Pakistan's government-operated news agency, the Associated Press of Pakistan, cited Prime Minister Shehbaz Sharif as saying that the changes were part of a broader reform agenda to ensure Pakistan's defence keeps pace with modern warfare requirements.But others see it as ceding power to the military.\"There is no balance between the military and the civilians,\" says Munizae Jahangir, journalist and co-chair of the Human Rights Commission of Pakistan.\"They have tilted again that power dynamic towards the military and empowered the military at a time when the military needed to be reined in.\"Getty ImagesPakistan's military has long played a prominent role in the nuclear-armed country's politicsNo 'independent space to operate'The second controversial area of change are the courts and judiciary.Under the amendment a new Federal Constitutional Court (FCC) will be created which will determine constitutional questions. The FCC's first chief justice and the judges that serve in it will be appointed by the president. \"It forever changes the shape and the nature of the right to a fair trial,\" says Ms Jahangir.\"The influence of the executive has increased not just in appointing judges but also constitutional benches. When the state is dictating the constitution of those benches then what hope do I have as a litigant of getting a fair trial?\"Arifa Noor, journalist and commentator, says: \"The judiciary is now quite subservient to the executive.\"The general consensus seems to be that the judiciary is now going to not really have any independent space to operate for the moment.\"Before this amendment was passed, the Supreme Court would hear and decide on constitutional cases. Some said this created a backlog of criminal and civil cases waiting to be heard as judges had to listen to constitutional arguments as well,  arguing that separating the two has helped smooth the court process.That has some traction with some lawyers, although Salahuddin Ahmed, a Karachi-based lawyer in the Supreme Court, sees that argument as disingenuous. He points out that the majority of cases pending in Pakistan are not in the Supreme Court.\"Statistically, if you were genuinely worried about making litigation quicker, you would focus on reforms for those cases.\"In the hours after the amendment was signed into law, two Supreme Court justices handed in their resignations.\"The constitution that I swore an oath to uphold and defend is no more,\" said Justice Athar Minallah in his resignation letter.Justice Mansoor Ali Shah said that the judiciary had been brought under the control of the government and that the 27th amendment had \"torn the Supreme Court to pieces\".Khawaja Asif, the defence minister, said of the resignations \"their conscience has awakened because their monopoly on the Supreme Court has been curbed and Parliament has tried to prove the supremacy of the Constitution\".Judges can also now be transferred to different courts without their consent. If they don't agree to the transfer, judges can appeal to the judicial commission and if their reasons for not moving are found invalid the judge would have to retire. Those in favour argue that this will ensure that courts in all areas of the country can be staffed, but some are worried it will be used as a threat.\"To pick a judge up from the province where he's been serving and take him to a different high court is something that will place them under further pressure to toe the government's line,\" says Mr Ahmed. He worries that the change will upset the balance in Pakistan.\"[Our judiciary] has collaborated with dictators in the past, but they've also sometimes nudged the executive. I think if you completely rob people of that hope, then that sends them into other, much uglier directions.\"Mr Kugelman agrees: \"Bottled-up grievances don't bode well for social stability.\"\"It does indicate a slide towards authoritarianism,\" says Ms Noor, adding that she sees the latest amendment as building on the 26th amendment, made last year, which gave lawmakers the power to pick Pakistan's top judge. There is already speculation of a 28th. \"It indicates that the balance of power is tilted in favour, heavily tilted in favour, of the establishment.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pakistan's army chief gets more powers and lifelong immunity",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c1b3/live/af549250-c138-11f0-8717-7b6a6b2fefad.jpg"
      ],
      "datePublished": "2025-11-14T23:49:17.000Z",
      "dateModified": "2025-11-14T23:49:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "COP30: Thousands march outside COP30 summit in call for action",
    "url": "https://www.bbc.com/news/articles/cy40z22qqwwo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5a94/live/1093fae0-c249-11f0-8669-5560f5c90fbe.jpg",
    "tag": "World",
    "date": "2025-11-15T17:09:03.000Z",
    "description": "3 hours agoGeorgina RannardClimate and science reporter, Belém, BrazilReutersMarching to the beat of pounding sound systems, thousands of climate prot",
    "body": "3 hours agoGeorgina RannardClimate and science reporter, Belém, BrazilReutersMarching to the beat of pounding sound systems, thousands of climate protesters have been bringing their message to the gates of the COP30 climate talks in Brazil.Chanting and singing \"free the Amazon\", demonstrators in host city Belém have been carrying three giant coffins reading Oil, Coal and Gas flanked by two grim reapers.Indigenous groups displayed signs reading \"the answer is us\" as an inflatable elephant and anaconda weaved through the crowd under the hot sun.It is the first time since 2021 that protesters have been allowed to demonstrate outside the UN climate talks. The last three took place in countries that do not permit public protest.Prostesters played samba music and sang\"We are holding a funeral for fossil fuels,\" Tuga Cíntia told the BBC. She is from the theatre group Hydra Dance from the Federal University of Pará.\"I'm here because enough is enough with COP meetings and theory. It's time for us to actually act,\" she said.Indigenous communities, Brazilian youth groups, and activists from across the world joined the march in their thousands.As the midday sun intensified, some sought shelter in a petrol station forecourt.\"Fossil fuels are still being burned. We know all too well what it's like to live on the frontline of climate change,\" Brianna Fruean, a climate activist from Samoa, a low-lying island extremely vulnerable to climate change, told the BBC.\"We are here after so many COPS, marching for justice, for the end of fossil fuels,\" Ilan, from the non-governmental organisation 350, who lives in Brazil, said.Brianna Fruean, a climate activist from SamoaSome carried signs reading \"demarcation now\", calling for indigenous groups to be given legal ownership of their territories. Hundreds of indigenous groups live in the Amazon and are regarded by experts as the best protectors of biodiversity and forests.Smaller sister protests have taken place around the world including in the UK.Security was tight at the COP30 venue as police with riot shields guarded the entrance.On Tuesday protesters carrying signs broke through security lines at the summit. The incident caused minor injuries to two security staff and some limited damage to the venue.Representation of indigenous voices has been a flashpoint in these talks, some of whom have set up stalls outside the fenced-off COP30 venue to sell products to passing delegates. The meeting was dubbed the \"indigenous people's COP\" but many groups feel their concerns over deforestation, land protection and resource extraction in their homes are not being heard.Negotiations continued at the COP30 talks on Saturday. Nearly 200 countries are meeting to try to make progress on tackling climate change.Little progress was made in the first week of the talks, although some delegations say they are pushing for an agreed strategy to deliver on past promises to move away from using planet-warming fossil fuels.President Luis Ignacio Lula da Silva of Brazil is hosting the talks and chose the city of Belém to put the world's focus on the Amazon.But shortly before the talks opened last week, his government granted permission to the Brazilian state oil company to explore for oil at the mouth of the Amazon.On Friday, analysis of attendee lists by the coalition Kick Big Polluters Out (KBPO) suggested a record number of delegates from fossil fuel companies are attending the meeting.A protester with sign reading \"the answer is us\"It suggests 1,600 lobbyists are in Belém, a 12% rise from the COP meeting last year.It is common for business leaders to come to the talks to strike deals. With the US strikingly absent from negotiations, progress has been slow. It is the first time the country has sent no delegation to the talks, after President Donald Trump branded climate change \"a con\".Earlier in the week a group of senior climate leaders wrote a letter calling on the summit to ensure the facts about climate change were \"upheld. Ten countries have signed an initiative called Declaration on Information Integrity on Climate Change at COP30, launched by the Global Initiative for Information Integrity on Climate Change.It aims to create international commitments to address climate disinformation and promote evidence-based information on climate issues.On the core issues of how to tackle the root cause of climate change and how to help countries adapt to ongoing global warming, Brazil has promised the talks will deliver action to implement years of deals and pledges. The talks continue into next week.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "COP30: Thousands march outside COP30 summit in call for action",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5a94/live/1093fae0-c249-11f0-8669-5560f5c90fbe.jpg"
      ],
      "datePublished": "2025-11-15T17:09:03.000Z",
      "dateModified": "2025-11-15T17:09:03.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China and Japan in escalating spat over Taiwan: What to know",
    "url": "https://www.bbc.com/news/articles/crklvx2n7rzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a30e/live/a4b4b470-c13c-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "World",
    "date": "2025-11-15T03:31:11.000Z",
    "description": "China urges citizens not to visit Japan over Taiwan row17 hours agoKoh EweKyodo via ReutersJapanese prime minister Sanae Takaichi (left) met with Chin",
    "body": "China urges citizens not to visit Japan over Taiwan row17 hours agoKoh EweKyodo via ReutersJapanese prime minister Sanae Takaichi (left) met with Chinese President Xi Jinping in South Korea on 31 OctoberChina has urged its citizens not to travel to Japan and summoned the country's ambassador in Beijing over Prime Minister Sanae Takaichi's comments on Taiwan.China and Japan have been locked in an escalating war of words this week, set off by Takaichi's suggestion that Japan could respond with its own self-defence force if China attacked Taiwan.Both countries' foreign ministries have lodged serious protests with each other. A Chinese diplomat also made a comment which some interpreted as a threat to behead Takaichi. The spat touches on the historical animosity between China and Japan, as well as longstanding \"strategic ambiguity\" on the sovereignty of self-governed Taiwan.Here's what else you need to know about it:What happened? A timelineThe current tensions were sparked at a parliamentary meeting in Japan last Friday, when an opposition lawmaker asked Takaichi what circumstances surrounding Taiwan would count as a survival-threatening situation for Japan.\"If there are battleships and the use of force, no matter how you think about it, it could constitute a survival-threatening situation,\" Takaichi responded.A \"survival-threatening situation\" is a legal term under Japan's 2015 security law, referring to when an armed attack on its allies poses an existential threat to Japan. In such a situation, Japan's self-defence forces can be activated to respond to the threat.Takaichi's remarks drew immediate ire from Beijing, with China's foreign ministry describing them as \"egregious\".Last Saturday, Xue Jian, China's consul general in the Japanese city of Osaka, reshared a news article about Takaichi's parliamentary remarks on X. But he also added his own comment that \"the dirty head that sticks itself in must be cut off\".While the intent of Xue's remarks \"may not be clear\", they were \"highly inappropriate\", Japan's chief cabinet secretary Minoru Kihara told reporters on Monday.Tokyo lodged protests with China over Xue's remarks, while Beijing lodged its own with Japan over Takaichi's.Xue's post has since been taken down - but the dust from the barbed exchanges hasn't settled yet.On Tuesday, Takaichi declined to retract her remarks, which she defended as \"consistent with the government's traditional position\". She did note, however, that she would be careful about commenting on specific scenarios from now on.Then on Thursday, China's foreign ministry posted in Japanese and English on its X account, warning Japan to \"stop playing with fire\" and added that it would be an \"act of aggression\" if Japan \"dares to meddles in the cross-Strait situation\".Chinese Vice Foreign Minister Sun Weidong also summoned the Japanese ambassador to China that same day to express their unhappiness.Sun called Takaichi's remarks \"extremely wrong and dangerous\" and demanded that Japan withdraw the comments, according to state media Xinhua. He also warned that \"otherwise all consequences must be borne by Japan\".Japan's ambassador explained that their position on Taiwan \"has not changed\" and refuted Beijing's remarks, Chief Cabinet Secretary Minoru Kihara told reporters on Friday. \"It is the consistent position of the Japanese government that we hope for a peaceful resolution of issues surrounding Taiwan through dialogue,\" he said during the daily news briefing.Kihara also added that Japan \"strongly urged China to take appropriate action\" over Xue's social media comment.Then on Friday night, the Chinese embassy in Japan published a statement urging citizens \"to avoid traveling to Japan in the near future\" over what it called \"blatantly provocative remarks regarding Taiwan\". A long history of animosityThere is longstanding animosity between the two countries, which can be traced back to a series of armed conflicts in the 1800s and Japan's brutal military campaign in China during World War Two.This was referenced in a statement released by China's Ministry of Foreign Affairs on Thursday when it said that \"should Japan fail to draw lessons from history and dare to take reckless risks, even resorting to military intervention in the Taiwan Strait situation, it will inevitably suffer heavy losses and pay a bitter price in the face of the iron wall of the Chinese People's Liberation Army\".Historical grievances have remained sore spots in bilateral relations ever since. But the recent ascension of Takaichi, a protégé of the late former prime minister Shinzo Abe, suggests more tensions may lie ahead.The conservative leader is pursuing closer ties with the US and has pledged to increase Japan's defence spending - raising some alarm in Beijing.Getty ImagesThe US and Japan have been deliberately ambiguous on how they would respond, should China invade TaiwanTakaichi is also famously hawkish on China and a longtime supporter of Taiwan. She had previously said that a blockade of the island could threaten Japan, and that Japan could mobilise its troops to stop a Chinese invasion.China is especially touchy about Taiwan, the self-governed island that Beijing claims as part of its territory. China has not ruled out the use of force to take Taiwan - a posture that has unsettled Taipei and its allies in the region.Earlier this month, Beijing accused Takaichi of violating the one-China principle, after she posted photos of herself meeting a senior Taiwanese official on the sidelines of the Apec summit in South Korea.Why Takaichi's recent comments caused such a stirThe Japanese prime minister's recent comments mark a departure from the equivocal position that the country has traditionally adopted on the status of Taiwan.This is in line with the policy of \"strategic ambiguity\" that the US has long maintained: remaining vague about what it would do to defend Taiwan in the event of a Chinese invasion.For decades, this ambiguity has kept China guessing - a form of deterrence - while leaving room for economic ties to flourish.The Japanese government's official stance is that it hopes the Taiwan issue can be resolved peacefully through dialogue - and Japanese officials have typically avoided mentioning Taiwan in public discussions about security.On the occasions where they have, they have been met with sharp rebuke from Beijing.In 2021, when then deputy prime minister Taro Aso said that Japan would need to defend Taiwan alongside the US in the event of an invasion, Beijing condemned his remarks and told Japan to \"correct its mistakes\".In this more recent flare-up, China's foreign ministry said that Takaichi's remarks were \"a gross interference in China's internal affairs\".\"Taiwan is China's Taiwan,\" ministry spokesperson Lin Jian told a press briefing on Monday, adding that China would not \"tolerate any foreign interference\" on the matter.\"What signal is the Japanese leader trying to send to 'Taiwan independence' separatist forces?\" he added. \"Is Japan up to challenge China's core interests and stop its reunification?\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China and Japan in escalating spat over Taiwan: What to know",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a30e/live/a4b4b470-c13c-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-15T03:31:11.000Z",
      "dateModified": "2025-11-15T03:31:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK court finds mining firm liable for Brazil's worst environmental disaster",
    "url": "https://www.bbc.com/news/articles/c8034v2e3l3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f45f/live/927b2210-c16b-11f0-a255-0f6bee817455.jpg",
    "tag": "World",
    "date": "2025-11-14T17:39:50.000Z",
    "description": "1 day agoIone WellsSouth America CorrespondentAFP via Getty ImagesTens of millions of cubic metres of toxic waste and mud were unleashed through commu",
    "body": "1 day agoIone WellsSouth America CorrespondentAFP via Getty ImagesTens of millions of cubic metres of toxic waste and mud were unleashed through communities surrounding the damMining company BHP has been found liable for a 2015 dam collapse in Brazil, known as the country's worst-ever environmental disaster, by London's High Court.The dam collapse killed 19 people, polluted the river and destroyed hundreds of homes.The civil lawsuit, representing more than 600,000 people including civilians, local governments and businesses, had been valued at up to £36bn ($48bn).BHP said it would appeal against the ruling and continue to fight the lawsuit and has said many claimants in the London lawsuit had already been paid compensation in Brazil.The dam in Mariana, southeastern Brazil, was owned by Samarco, a joint venture between the mining giants Vale and BHP.The claimants' lawyers argued successfully that the trial should be held in London because BHP headquarters \"were in the UK at the time of the dam collapse\".A separate claim against Samarco's second parent company, Brazilian mining company Vale, was filed in the Netherlands, with more than 70,000 plaintiffs.The dam was used to store waste from iron ore mining. When it burst, it unleashed tens of millions of cubic metres of toxic waste and mud. The sludge swept through communities, destroying hundreds of people's homes and poisoning the river.Judge Finola O'Farrell said in her High Court ruling that continuing to raise the height of the dam when it was not safe to do so was the \"direct and immediate cause\" of the dam's collapse, meaning BHP was liable under Brazilian law.BHP is expected to appeal the ruling. President of BHP's Minerals Americas, Brandon Craig, said in a statement that 240,000 claimants in the London lawsuit \"have already been paid compensation in Brazil\".\"We believe this will significantly reduce the size and value of claims in the UK group action,\" he added.The lawsuit has been littered with different clashes between the UK firm representing the claimants, Pogust Goodhead, and BHP. BHP always denied liability and said the London lawsuit duplicated legal proceedings and reparation and repair programmes in Brazil.BHP and Vale have set up an organisation called the Renova Foundation tasked with compensating victims. It has offered them either cash compensation, or a house in a new city that the foundation has built to replace the town of Novo Bento and has disbursed billions of dollars in repair and compensation actions to hundreds of thousands of people.In June, a presentation by BHP and Vale's Samarco venture said around 130,000 people in Brazil had reached settlements with them. In response, Pogust Goodhead alleged the companies had pressured claimants to \"settle their claims at far below their true value\" and that it would seek £1.3bn in unpaid fees lost as a result.It alleged that a $30.3bn compensation agreement which Brazil signed with BHP, Vale and Samarco in October 2024 prevented claimants from discussing the deal with the firm or paying its legal fees.The firm said it had incurred $1bn in borrowing costs to finance the English case.BHP said it rejected Pogust Goodhead's allegations in their entirety and dispute \"their factual and legal basis.\"It said the claims were \"without merit\" and BHP would \"vigorously contest them.\" A spokesperson also said that the firm continued to believe Brazil was the most appropriate, effective, and efficient place for compensation for the dam collapse.AFP via Getty ImagesSome of those affected by the disaster travelled to the High Court last yearBut there were also parallel claims that Pogust Goodhead – which promotes itself as a firm representing human rights and environmental law – had tried to profit off \"vulnerable\" Brazilians.During proceedings the firm was accused of \"misleading\" vulnerable Brazilians for its own gain by a Brazilian judge in the state of Minas Gerais.Pogust Goodhead rejected the accusation at the time as \"without merit\". In a claim brought by the Public Prosecutors and Public Defenders in Brazil against Pogust Goodhead, the judge criticised several \"allegedly abusive clauses\" in Pogust Goodhead's contracts with Brazilians who suffered damage.Among these, it alleges the law firm engaged in \"misleading advertising\" considering the \"hypervulnerability of those affected\".It also alleges \"undue charging of fees on compensation amounts obtained extrajudicially in Brazil\" which it said represents \"illicit enrichment that diverts essential resources from those affected\" and \"excessive\" penalties for claimants who terminated their contracts which it said \"discouraged\" them from joining national compensation programmes.The former Brazilian ambassador in London and Washington, Rubens Barbosa, told the BBC earlier this year that he believed this amounted to spreading misleading information in Brazil.Mr Barbosa said bringing the case to London \"hinders efforts to resolve the matter locally\" and the \"extremely vulnerable Brazilians were misled\" by contracts.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK court finds mining firm liable for Brazil's worst environmental disaster",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f45f/live/927b2210-c16b-11f0-a255-0f6bee817455.jpg"
      ],
      "datePublished": "2025-11-14T17:39:50.000Z",
      "dateModified": "2025-11-14T17:39:50.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "DR Congo and M23 rebels sign framework for peace in Qatar",
    "url": "https://www.bbc.com/news/articles/cwy7zlngwepo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cdb5/live/c40bd9f0-c23d-11f0-a786-17e554da8bc7.jpg",
    "tag": "World",
    "date": "2025-11-15T17:12:16.000Z",
    "description": "3 hours agoNatasha Booty and BBC World Service NewsroomRwandan-backed M23 rebels and the government of the Democratic Republic of Congo have signed a ",
    "body": "3 hours agoNatasha Booty and BBC World Service NewsroomRwandan-backed M23 rebels and the government of the Democratic Republic of Congo have signed a framework for peace in the east of the country. The ceremony was held in Qatar, which along with the US and the African Union, has been trying to mediate an end to decades of conflict in the resource-rich region.Earlier this year, the M23 captured the eastern region's main cities of Goma and Bukavu. Previous attempts to secure peace have failed.The US's Africa envoy Massad Boulos said the document covered eight protocols and that most still required work. He also acknowledged that prisoner exchanges and ceasefire monitoring had been slower than originally hoped. Kinshasa is demanding the withdrawal of Rwandan troops from its territory. Kigali says this can happen once the Congo-based FDLR rebel militia is disbanded. It is largely made up of ethnic Hutus linked to the 1994 Rwandan genocide.The new framework also addresses humanitarian access, the return of displaced people and protection of the judiciary, Boulous is quoted as saying by the AFP agency.It builds on a declaration of principles signed by the two sides in Doha in July, as well as a deal made in the same city last month on the monitoring of an eventual ceasefire.Before that, in June, talks between Rwanda and DR Congo brokered by Washington resulted in the signing of a peace deal that was hailed by US President Donald Trump as a \"a glorious triumph\" but was swiftly violated by the warring parties.The M23 is one of the biggest parties in this conflict, but was not directly involved in the US-brokered ceasefire deal. It has always favoured the talks mediated by Qatar, saying they will address \"the root causes\" of the conflict.Decades of conflict escalated in January when M23 rebels seized control of large parts of eastern DR Congo including the regional capital, Goma, the city of Bukavu and two airports.Since January, thousands of people have been killed and hundreds of thousands of civilians forced from their homes.After the loss of territory, the government in Kinshasa had turned to the US for help, reportedly offering access to critical minerals in exchange for security guarantees. Eastern DR Congo is rich in coltan and other resources vital to the global electronics industries.Rwanda denies supporting the M23, despite overwhelming evidence, and insists its military presence in the region is a defensive measure against threats posed by armed groups like the FDLR.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "DR Congo and M23 rebels sign framework for peace in Qatar",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/cdb5/live/c40bd9f0-c23d-11f0-a786-17e554da8bc7.jpg"
      ],
      "datePublished": "2025-11-15T17:12:16.000Z",
      "dateModified": "2025-11-15T17:12:16.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]