[
  {
    "title": "Lyse Doucet: Trump is shaking the world order more than any president since WW2",
    "url": "https://www.bbc.com/news/articles/cx2lej7d52po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4331/live/847340d0-f6b3-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-20T20:18:43.000Z",
    "description": "2 days agoLyse DoucetChief international correspondentWatch: BBC asks Trump if breakup of Nato is price he is willing to pay for GreenlandOn day one, ",
    "body": "2 days agoLyse DoucetChief international correspondentWatch: BBC asks Trump if breakup of Nato is price he is willing to pay for GreenlandOn day one, he put the world on notice. \"Nothing will stand in our way,\" President Donald Trump declared, to thunderous applause, as he ended his inauguration speech in a cold Washington winter on this day last year, at the start of his second term. Did the world fail to take enough notice?Tucked into his speech was a mention of the 19th Century doctrine of \"manifest destiny\" – the idea that the US was divinely ordained to expand its territory across the continent, spreading American ideals.At that moment, the Panama Canal was in his sights. \"We're taking it back,\" Trump announced.Now that same declaration, expressed with absolute resolve, is directed at Greenland. \"We have to have it,\" is the new mantra. It's a rude awakening in a moment fraught with grave risk.US history is littered with consequential and controversial American invasions, occupations, and covert operations to topple rulers and regimes. But, in the past century, no American president has threatened to seize the land of a longtime ally and rule it against their people's will.No US leader has so brutally broken political norms and threatened long-standing alliances, which have underpinned the world order since the end of World War Two.There's little doubt that old rules are being broken, with impunity.Trump is now being described as possibly the US's most \"transformative\" president - cheered by supporters at home and abroad, alarm among others in capitals the world over, and a watchful silence in Moscow and Beijing.\"It's a shift toward a world without rules, where international law is trampled underfoot, and where the only law which seems to matter is the strongest with imperial ambitions resurfacing,\" was French President Emmanuel Macron's stark warning on the stage at the Davos Economic Forum, without directly mentioning Trump by name.EPA/ShutterstockFrench President Emmanuel Macron spoke at the World Economic Forum on Tuesday but avoided any direct mention of TrumpThere is mounting concern over a possible painful trade war, even worry in some circles that the 76-year-old Nato military alliance could now be at risk if, in the worst case scenario, the US commander-in-chief tries to take Greenland by force.Trump's defenders are doubling down in support of his \"America First\" agenda, against the post-war multilateral order.When asked on BBC Newshour whether seizing Greenland would violate the UN charter, Republican congressman Randy Fine said: \"I think the United Nations has abjectly failed in being an entity that supports peace in the world and, frankly, whatever they think, probably doing the opposite's the right thing.\"Fine introduced a bill called \"Greenland Annexation and Statehood Act\" in Congress last week.How do America's anxious allies respond, when it seems nothing will stand in Trump's way?Many phrases have peppered this past year of diplomatic contortions over how best to deal with the US's unpredictable president and commander-in-chief.\"We need to take him seriously but not literally,\" comes from those who insist this can all be sorted out through dialogue.It's worked, but only to a point, on trying to forge a united response with Europe to Russia's blistering war in Ukraine. Trump often veers, from one week to the next, from espousing positions close to Russia's, then tilting towards Ukraine, then bolting back into Russia's orbit again.\"He's a real estate mogul,\" says those who see in Trump's maximalist positions his deal-making tactics from his New York property days. There's an echo of that in his repeated threats of military action against Iran – although it's clear military options are still on his now crowded table.AFP via Getty ImagesTrump (left) was seen chatting to Nato Secretary General Mark Rutte at a Nato summit at the Hague in JuneHe doesn't talk like a traditional politician,\" explains his top diplomat, the US Secretary of State Marco Rubio when he is repeatedly questioned about Trump's tactics. \"He says and then he does,\" is his highest praise for his president against what he derides as the dismal record of previous incumbents.Rubio has been one of the principal voices trying to backpedal Trump's threats on Greenland, underlining that he wants to buy this vast strategic ice sheet, not invade it. He pointed out that Trump has been exploring options to purchase the world's largest island, to counter threats from China and Russia, since his first term in office.But there is no denying Trump's bully tactics, his contempt for collective action, his belief that might is right.\"He is a man of transactions and brute power, mafia style power,\" says Zanny Minton Beddoes, editor-in-chief of the Economist magazine.\"He doesn't see the benefit of alliances, he doesn't see the idea of America as an idea, a set of values; he doesn't give two hoots about that.\"And he doesn't hide it.\"Nato is not feared by Russia or China at all. Not even a little bit,\" Trump told the New York Times in a wide-ranging interview earlier this month. \"We're tremendously feared.\"If security was the issue, the US already has forces on the ground in Greenland and under a 1951 agreement could send in more troops and open more bases.\"I need to own it,\" is how Trump flatly puts it.And he often makes it clear, \"I like to win.\" There's a growing body of proof that's what it is about.His policy back flips in the past year have been baffling.ReutersMerchandise opposing a US takeover of Greenland, a semi-autonomous territory of Denmark, have appeared in shops in CopenhagenIn the Saudi capital Riyadh in May, we watched how his major speech on his first foreign trip of his second term met a rapturous reception.Trump took aim at the American \"interventionists\" whom he excoriated for having \"wrecked far more nations than they built... in complex societies that they did not even understand themselves.\"In June when Israel attacked Iran, Trump reportedly warned Israel's Prime Minister Benjamin Netanyahu not to put his diplomacy at risk with his military threats against Tehran. By the end of the week, when he saw Israel's success in assassinating top nuclear scientists and security chiefs, Trump exclaimed: \"I think it's been excellent.\"\"Sane-washing\" was the phrase coined months ago by Edward Luce of the Financial Times to describe the world's polite portrayals of Trump, the succession of leaders landing at his door with glittering gifts and gilded praise to try to win him over to their side.\"Trump's apologists – a more numerous crowd than true believers - work round the clock to sane-wash his policies into something coherent,\" Luce wrote in his latest column.ReutersTrump met Saudi Crown Prince Mohammed Bin Salman in Riyadh in May 2025It was on full display last October when leaders the world over were summoned to join him at the Egyptian Red Sea resort of Sharm El-Sheikh to celebrate his ringing declaration that \"at long last we have peace in the Middle East\" for the first time in \"3,000 years.\"The first significant phase of his peace plan had brought about a desperately needed ceasefire in Gaza and the urgent release of Israeli hostages. It was Trump's muscular diplomacy that forced Netanyahu, as well as Hamas, to agree to it. It was a major breakthrough only Trump could achieve. But it wasn't – sadly - the dawn of peace. No-one there said the quiet part out loud.Last year Trump's approach was framed as manifest destiny. This year it's the early 19th Century Monroe Doctrine now updated, since the Venezuela invasion, as the \"Donroe Doctrine.\" President Trump now owns it, bolstered by his fervent backers on his team, with his belief that America can act at will in its backyard, and beyond, to protect American interests.ReutersIn October, Benjamin Netanyahu called Trump the \"greatest friend\" Israel had ever had in the White HouseSometimes he is called an isolationist, sometimes an interventionist. But there's always that slogan which returned him to power - Make America Great Again.And his letter to Norway's Prime Minister Jonas Gahr Støre highlighted his obsessive pique over not winning this year's Nobel Peace Prize. Trump informed Støre: \"I no longer feel an obligation to think purely of peace, although it will always be predominant, but can now think about what is good and proper for the United States of America.\"\"It's a good day to have a Nordic temperament,\" Norway's Foreign Minister Espen Barth Eide diplomatically remarked to me when I asked about this moment. Norway has been calm, with ice-hard firmness, in its defence of Greenland and Denmark and collective security in the Arctic.European responses still stretch across this slippery political ice.Macron has vowed to launch the EU's \"trade bazooka\" of counter-tariffs and restricting access to the EU's lucrative market.Italian Prime Minister Giorgia Meloni, one of the American president's closest European allies, has vaguely spoken of a \"problem of understanding and miscommunication.\"UK Prime Minister Sir Keir Starmer has strongly and publicly defended Greenland's territorial integrity but wants to protect the strong personal bond he's built over the past year by avoiding retaliatory tariffs.ReutersSir Keir Starmer has maintained a largely cordial relationship with Trump since he started his second term as presidentThe gloves are off for Trump as he posts the private messages he's receiving from leaders using the old tools of statecraft to try to keep him on side.\"Let us have a dinner in Paris together on Thursday before you go back to the US,\" suggested the French president who also queried, in the midst of praise for other foreign policy successes, \"I do not understand what you are doing on Greenland\".\"Can't wait to see you\", wrote Nato Secretary General Mark Rutte, who once called Trump \"daddy\" for his forceful handling of the Iran-Israel 12-day war last year.Nato boss commends 'daddy' Trump's handling of Israel-Iran conflictRutte, and others, have credited Trump's blunt threats for forcing Nato members to significantly increase their defence spending in recent years. Trump's warnings, going back to his first term, accelerated a trend called for by previous US presidents and started by Nato members themselves in the shadow of Russian threats.On the other side of the Atlantic, the country which has long lived in America's shadow has been trying to forge a different path forward, albeit with challenges of their own.\"We have to take the world as it is, not the way we want it to be,\" was the candid reflection of Canada's Prime Minister Mark Carney on his trip to China last week.It was the first visit by a Canadian leader to Beijing since 2017, after years of sharp tension, and it sent a clear signal of this fast changing world.Watch: Canada-China trade relationship \"more predictable\" than with US, says CarneyTrump's astonishing threat to annex his neighbour to the north surfaced again this week in a post on social media which showed the western hemisphere, including Canada and Greenland, covered in stars and stripes. Canadians know there's still a risk they could be next.Carney, the former central banker, rose to Canada's highest office last year buoyed by Canadians' belief he was the best prepared to take on Trump. He responded \"dollar for dollar\" from the start, imposing retaliatory tariffs – until it became too painful for the much smaller Canadian economy, which sends more than 70% of its trade south of its border.When Carney took to the stage at Davos on Tuesday, he also focused on this jarring juncture.\"American hegemony in particular, helped provide public goods, open sea lanes, a stable financial system, collective security and support for frameworks for resolving disputes,\" he said, adding bluntly: \"We are in the midst of a rupture, not a transition.\"On Wednesday Trump will speak from that same podium with the world watching.Asked by the New York Times this month what could stop him, Trump replied: \"My own morality. My own mind. It's the only thing that can stop me.\"That's what lies behind an armada of allies now seeking to persuade, flatter, force him – to change his mind.This time, it's not certain they will succeed.Get our flagship newsletter with all the headlines you need to start the day. Sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Lyse Doucet: Trump is shaking the world order more than any president since WW2",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/4331/live/847340d0-f6b3-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-20T20:18:43.000Z",
      "dateModified": "2026-01-20T20:18:43.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "German nurse jailed for murder may face inquiry into 100 more deaths",
    "url": "https://www.bbc.com/news/articles/ckgjjy55x2mo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/10c1/live/28fe61f0-f7b0-11f0-b385-5f48925de19a.jpg",
    "tag": "World",
    "date": "2026-01-22T18:12:14.000Z",
    "description": "2 hours agoBethany BellandRachel HaganAn ex-nurse convicted of murdering 10 patients in western Germany may be linked to more than 100 additional deat",
    "body": "2 hours agoBethany BellandRachel HaganAn ex-nurse convicted of murdering 10 patients in western Germany may be linked to more than 100 additional deaths, an official has said.The chief public prosecutor in Aachen, Katja Schlenkermann-Pitts, told the BBC  that there was \"a correspondingly high number of suspicious cases\" under review.She cautioned that the cases represented preliminary suspicions and that some could be dismissed following forensic examination.In November last year, a regional court in Aachen convicted the former palliative care nurse, who has not been publicly named, of 10 counts of murder and 27 counts of attempted murder, sentencing him to life imprisonment.The court found that during night shifts at a hospital in Würselen, the man had administered excessive doses of sedatives and painkillers to seriously ill patients without medical justification.Prosecutors said the drugs were sometimes given repeatedly and that the defendant was aware of the potentially fatal consequences. Judges concluded that the actions were driven by personal unease and a desire to impose order during night shifts.The defendant denied the charges during the trial in Aachen, stating that he had intended to help patients sleep and had not believed the medication posed a lethal risk given their underlying illnesses. But prosecutors told the court that he showed \"irritation\" and a lack of empathy to patients who required a higher level of care, and accused him of playing \"master of life and death\".The offences examined in the initial trial occurred between December 2023 and May 2024 at the Rhein-Maas hospital in Würselen, where the nurse had worked since 2020.The newly identified suspected cases relate largely to earlier periods.As part of the expanded inquiry, investigators have ordered around 60 exhumations. Twenty seven have already been carried out, with roughly 30 more pending.Schlenkermann-Pitts said autopsy results were still outstanding in many cases and would determine whether further charges could be brought.\"Of course, they may still be dropped,\" she cautioned.Prosecutors in Cologne are also examining deaths linked to hospitals where the nurse worked before his transfer to Würselen, 65km (40 miles) away.Two exhumations have taken place so far, including the remains of a 94 year old woman who died in 2018, and a 78 year old patient who died in 2015. Further exhumations have been ordered.Prosecutors in both Aachen and Cologne said preparations for potential new charges were under way, but officials said that any further proceedings were unlikely to begin before 2027.The case bears similarity to that of former nurse Niels Högel, who was handed a life sentence in 2019 after he was convicted of murdering 85 patients at two hospitals in northern Germany.Högel is believed to be the most prolific killer in Germany's modern history.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "German nurse jailed for murder may face inquiry into 100 more deaths",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/10c1/live/28fe61f0-f7b0-11f0-b385-5f48925de19a.jpg"
      ],
      "datePublished": "2026-01-22T18:12:14.000Z",
      "dateModified": "2026-01-22T18:12:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Australia: Three dead in New South Wales shooting",
    "url": "https://www.bbc.com/news/articles/c4g00mv29j5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3840/live/78cd7350-f775-11f0-b7ec-55c1cb544783.jpg",
    "tag": "World",
    "date": "2026-01-22T11:38:06.000Z",
    "description": "9 hours agoTessa WongandAlicia CurryThree people have died and another injured after a shooting in a small town in New South Wales, Australia, police ",
    "body": "9 hours agoTessa WongandAlicia CurryThree people have died and another injured after a shooting in a small town in New South Wales, Australia, police have said.Emergency services were called to a residential area in Lake Cargelligo at about 16:40 local time (05:40 GMT).The suspect is still on the run and is believed to have fled in a vehicle, NSW police confirmed.A man and woman were found shot dead in a vehicle, a second shooting soon afterwards killed a woman and left a man in a \"critical condition\" in hospital, police said.The Sydney Morning Herald reports that the incident was a suspected domestic violence attack.Andrew Holland, NSW police assistant commissioner, declined to comment on the relationship between the gunman and the victims.The public has been urged to remain indoors and multiple crime scenes have been established, he told reporters.\"Any death in a small country town is confronting, but again, a scene where you have people shot by firearms is obviously going to make people very, very tense and very concerned,\" said Holland.\"The scene faced by the emergency services officers at that time would have been horrendous.\"Lake Cargelligo is located in the centre of New South Wales and has a population of about 1,500 people.The incident comes after last month's mass shooting at Sydney's Bondi Beach which killed 15 people.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australia: Three dead in New South Wales shooting",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/3840/live/78cd7350-f775-11f0-b7ec-55c1cb544783.jpg"
      ],
      "datePublished": "2026-01-22T11:38:06.000Z",
      "dateModified": "2026-01-22T11:38:06.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Loved ones of victims reeling after high-speed rail crash in southern Spain",
    "url": "https://www.bbc.com/news/articles/c75xvg3ypexo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6da4/live/99b3f510-f6fa-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-21T14:54:08.000Z",
    "description": "1 day agoJames Waterhousein Córdoba, SpainBBC/Moose CampbellYamilei's brother-in-law Victor was among the victims of Sunday night's crashEduardo Morán",
    "body": "1 day agoJames Waterhousein Córdoba, SpainBBC/Moose CampbellYamilei's brother-in-law Victor was among the victims of Sunday night's crashEduardo Morán, a doctor at Córdoba's Reina Sofía Hospital, suspected it was serious.He and his wife, also a medic, had been asked to head to work after reports that two high speed trains had collided nearby.\"We were preparing different parts of the hospital,\" he recalls. \"Not just the emergency room, but the intensive care unit, all the surgery theatres and the regular floor. Everybody was there.\"As the patients arrived, their injuries ranged from scratches to missing limbs. Staff prioritised who to treat. Some were operated on, others monitored.Eduardo had never seen such an influx of casualties in his 20-year career, and yet the hospital was not overwhelmed.\"We were expecting more,\" he says. \"Unfortunately, there were a lot of people who didn't make it and died on the railway.\"Social MediaAmong the victims was María del Carmen Abril, returning from a surprise birthday partyIn dense woodland 36 miles from Córdoba lies the tangled wreckage of the two trains that collided on Sunday evening.A gap in the straight section of track is thought to be what investigators are focusing on.At least 43 people lost their lives here, and as sniffer dogs weave between the empty seats and shattered windows, there is still a hunger to unearth answers as to what caused Spain's worst rail crash in more than a decade.As officials called for patience, news broke of a second derailment in almost as many days.Unlike Sunday night's disaster, the train that crashed near Barcelona was not a high-speed model, and the accident involved a wall that collapsed onto the track in heavy rain.Nevertheless, it has led to the Spanish train drivers' union calling a strike over the \"unacceptable constant deterioration of the railway\".For the families and friends of those missing and killed in southern Spain, these events have only added to their unanswered questions.BBC/Moose CampbellJose Manuel Muñoz lost his friend Abril in Sunday's high-speed rail crashThroughout Saturday afternoon and into the night in Córdoba, Jose Manuel Muñoz and his friends were holding a surprise 50th birthday party for María del Carmen Abril, a teacher.The party was barely over when Abril, as she is known, made her way back north to Madrid. She thanked her hosts on their WhatsApp group, and they later frantically replied to see if she was OK.Abril was sitting on one of the carriages that came off the tracks into an oncoming train. Her death was confirmed the next day.Carlos Alvarez/Getty ImagesAn Iryo train was the first to derail at Adamuz, crashing into an oncoming train\"It's very difficult to explain the contrast of emotions,\" says Muñoz, sitting in the tranquil surroundings of Córdoba's Jardines de la Victoria, a park next to his workshop where he makes picture frames.\"We spent one day celebrating life with our friend, then there were two days of uncertainty, without knowing anything about what happened to her, then we get the confirmation that she's dead.\"He describes Abril as a \"lovely, generous, affectionate person who loved flowers and was always trying to solve other people's problems\".And yet Muñoz does not blame anyone for her death; instead, he puts it down to bad luck.Under the low winter sun and next to the city's bull ring is Córdoba's Civic Centre. Outside are two makeshift tents where the families of the missing give DNA samples in the hope their relatives can at least be identified.BBC/Marianne BaisnéeYamilei shows a picture of her brother-in-law, Victor Luis TeránBecause of a last-minute change in travel plans, Jamilet's brother-in law, Victor Luis Terán, took an earlier train and became caught up in the crash as he travelled south from Madrid to Huelva.It was not until Tuesday night that confirmation came that Victor, a Bolivian national, was among the 43 victims.Yamilei is looking for answers: \"That's all we want. Because we can't do it any more.\"The truth she seeks is likely to take weeks to arrive, and official calls for patience have only been hampered by a devastating three days on Spain's rail network.Additional reporting by Marianne Baisnée and Marta Jimenez",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Loved ones of victims reeling after high-speed rail crash in southern Spain",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6da4/live/99b3f510-f6fa-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-21T14:54:08.000Z",
      "dateModified": "2026-01-21T14:54:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Japan suspends world's largest nuclear plant hours after restart",
    "url": "https://www.bbc.com/news/articles/cx2yy8z91n4o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/90c0/live/b8085d90-f76c-11f0-b7ec-55c1cb544783.jpg",
    "tag": "World",
    "date": "2026-01-22T13:13:24.000Z",
    "description": "Japan has suspended operations at the world's largest nuclear power plant, hours after its restart, its operator has said.An alarm sounded \"during rea",
    "body": "Japan has suspended operations at the world's largest nuclear power plant, hours after its restart, its operator has said.An alarm sounded \"during reactor-start-up procedures\" at Kashiwazaki-Kariwa north-west of Tokyo but the reactor remained \"stable\", Tokyo Electric Power Company (Tepco) spokesperson Takashi Kobayashi said.Reactor number six restarted on Wednesday a day later than planned due to an alarm malfunction - the first at the plant to be turned on since the 2011 Fukushima disaster.Japan shut down all of its 54 reactors after a 9.0 magnitude earthquake triggered a meltdown at its Fukushima plant 15 years ago, causing one of the worst nuclear disasters in history.At the time, radiation leakage from the plant forced more than 150,000 people to evacuate their homes. Many have not returned despite assurances it is now safe.Following the suspension of reactor number six on Thursday, Kobayashi said it was \"stable and there is no radioactive impact outside\".The reactor was initially set to start on Tuesday, but was pushed back due to a technical issue. It is due to begin operating commercially next month.Kobayashi said Tepco was \"currently investigating the cause\" of the incident and did not say when operations would resume. The seventh reactor at Kashiwazaki-Kariwa is not expected to be turned back on until 2030, while the other five could be decommissioned.This would leave the plant with far less capacity than it once had when all seven reactors were operational.Reactor number six was given the green light to restart despite safety concerns from local residents.A small crowd of people gathered outside Tepco's headquarters to protest last week, while hundreds gathered outside the Niigata prefectural assembly in December.Japan was an early adopter of nuclear power - before 2011, nuclear accounted for nearly 30% of its electricity and the country planned to get that up to 50% by 2030.After it was forced to shut them all down in the wake of the Fukushima disaster, it has spent the past decade attempting to revive the plants as part of its goal to reach net zero emissions by 2050.Since 2015, Japan has restarted 15 out of its 33 operable reactors.An earlier version of this story said the Kashiwazaki-Kariwa nuclear plant was in Tokyo and has been corrected to say it is north-west of Tokyo.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Japan suspends world's largest nuclear plant hours after restart",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/90c0/live/b8085d90-f76c-11f0-b7ec-55c1cb544783.jpg"
      ],
      "datePublished": "2026-01-22T13:13:24.000Z",
      "dateModified": "2026-01-22T13:13:24.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "France seizes suspected Russian 'shadow fleet' tanker in the Mediterranean",
    "url": "https://www.bbc.com/news/articles/cdexxr2y907o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fd99/live/53aae470-f7c2-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "World",
    "date": "2026-01-22T18:32:32.000Z",
    "description": "France says it has seized an oil tanker in the Mediterranean suspected of being part of Russia's sanction-busting \"shadow fleet\".French President Emma",
    "body": "France says it has seized an oil tanker in the Mediterranean suspected of being part of Russia's sanction-busting \"shadow fleet\".French President Emmanuel Macron said the tanker, named the Grinch, was \"subject to international sanctions and suspected of flying a false flag\".The French navy, with the assistance of allies including the UK, boarded the vessel on Thursday morning between Spain and Morocco. French maritime authorities said that a search of the vessel had \"confirmed the doubts as to the regularity of the flag\".Russia's embassy in Paris said it had not been informed of the seizure.Moscow's so-called shadow fleet is a clandestine network of tankers used to evade Western sanctions on Russian oil exports by shipping the oil on aged tankers with obscure ownership or insurance.The Grinch was travelling from the Arctic port of Murmansk in northern Russia when it was intercepted, French authorities said. The vessel had been flying a Comoros flag, according to ship tracking websites marinetraffic and vesselfinder.Announcing the seizure on X, Macron said: \"We are determined to uphold international law and to ensure the effective enforcement of sanctions.\"The activities of the \"shadow fleet\" contribute to financing the war of aggression against Ukraine,\" he said, adding that the vessel had been \"diverted\".Defence Secretary John Healy said the UK navy had provided \"tracking and monitoring\" support, with HMS Dagger monitoring the tanker through the Straits of Gibraltar.He added: \"Alongside our allies, we are stepping up our response to shadow vessels to choke off the funds that fuel Putin's illegal invasion of Ukraine.\"The UK has imposed sanctions on 544 Russian shadow fleet vessels. Ukrainian President Volodymyr Zelensky welcomed the action, saying it was \"exactly the kind of resolve needed to ensure that Russian oil no longer finances Russia's war\".\"Vessels must be apprehended. And wouldn't it be fair to confiscate and sell the oil carried by these tankers?\" he said on X.Speaking at Davos earlier, Zelensky exhorted Europe to do more to ensure its own security, saying: \"Europe loves to discuss the future but avoids taking action\".Many Western countries imposed sanctions on Russian energy following Russia's full-scale invasion of Ukraine in 2022.Earlier in January, British armed forces supported a US operation to seize a Russian-flagged tanker in the Atlantic that US officials said had broken sanctions by carrying oil for Venezuela and Russia. Moscow denounced the move, saying no state had the right to use force against vessels properly registered in other states' jurisdictions.Last October, France seized another sanctioned tanker, the Boracay, off its west coast before releasing it a few days later.Shadow fleets are becoming increasingly common, with Venezuela, Iran and Russia all accused of using them to avoid sanctions on oil.Financial intelligence firm S&P Global estimates that one in five oil tankers worldwide are used to smuggle oil from sanctioned countries. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "France seizes suspected Russian 'shadow fleet' tanker in the Mediterranean",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fd99/live/53aae470-f7c2-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-22T18:32:32.000Z",
      "dateModified": "2026-01-22T18:32:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US optimistic on end to war as Zelensky says Ukraine to talk to US and Russia",
    "url": "https://www.bbc.com/news/articles/c4g44r22j5jo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5423/live/aaba3ee0-f78c-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-22T17:37:26.000Z",
    "description": "'It's all about the land': Zelensky says Ukraine to talk to US and Russia3 hours agoPaul KirbyEurope digital editorReutersUkraine's Volodymr Zelensky ",
    "body": "'It's all about the land': Zelensky says Ukraine to talk to US and Russia3 hours agoPaul KirbyEurope digital editorReutersUkraine's Volodymr Zelensky arrived in Davos on Thursday ahead of his talks with President Donald TrumpPresident Volodymyr Zelensky says trilateral talks on ending the war in Ukraine are to take place with Russia and the US in the United Arab Emirates, after he met  President Donald Trump in Davos.As the diplomatic pace appeared to intensify, Trump said his meeting with Zelensky was good, and US envoy Steve Witkoff headed to Moscow for talks with Russia's Vladimir Putin.Witkoff, who was travelling to Moscow with Trump's son-in-law Steve Kushner, said he was optimistic about a deal.\"I think we've got it down to one issue and we have discussed iterations of that issue, and that means it's solvable,\" he said before leaving the Swiss resort.Trump's envoy gave no details about the remaining sticking point, but Zelensky later clarified that the future status of eastern Ukraine remained the unsolved issue.He made clear that the planned talks in the Emirates would involve Russia as well as the US and Ukraine, adding that \"the Russians have to be ready for compromises, not only Ukraine\".\"It's all about the land. This is the issue which is not solved yet,\" Zelensky told reporters at the World Economic Forum in Davos, Switzerland - adding that trilateral talks might provide the two sides with \"variants\".The US proposal for the Ukraine's industrial heartland in Donbas is for a demilitarised and free economic zone in exchange for security guarantees for Kyiv.\"If both sides want to solve this, we're going to get it solved,\" Witkoff said, explaining that he would be heading to Abu Dhabi after Moscow, where working groups would be covering military issues as well as economic prosperity.Zelensky also told reporters that he had reached agreement with Trump on future US security guarantees for Ukraine in the event of a deal. He gave no details but said it would need to go before the US Congress and Ukrainian parliament before signing.Although he said the \"Coalition of the Willing\", led by the UK and France, had committed forces on the ground to monitor the deal, he was adamant a Trump backstop would be necessary too: \"No security guarantees work without the US.\"Earlier he used his Davos speech to criticise his European allies for a lack of \"political will\" to take action against Russia.\"There are endless internal arguments and things left unsaid that stop Europe from uniting and speaking honestly enough to find real solutions,\" he said, drawing a contrast with the US under Trump.\"President Trump loves who he is, and he says he loves Europe, but he will not listen to this kind of Europe,\" he said.The Ukrainian president had travelled through the night to get to Davos.He had initially called off his trip to deal with the aftermath of Russian strikes on Kyiv's power infrastructure, which have left large areas of the capital without heating, water or power during the harshest winter so far in almost four years of Russia's full-scale war. Thousands of apartment blocks remain without heating.Zelensky said last month that a 20-point US plan to end the war was 90% ready and that Ukraine's position on Donbas, in eastern Ukraine, was different to Russia's.As part of the US 20-point plan, Zelensky has offered to withdraw troops from the 25% of Donetsk region that Ukraine still controls by up to 40km (25 miles), to create an economic zone in Donbas, if Russia does the same. Kremlin spokesman Dmitry Peskov said on Thursday that discussions with the American envoys would continue \"on the Ukrainian issue and other related topics\" and refused to say whether he shared Witkoff's optimism on achieving a deal.Putin is known to covet control of the entire region, and Russian forces have advanced slowly in the east in the past year.Another big sticking point that Zelensky highlighted last month was future control of Ukraine's enormous Zaporizhzhia nuclear plant, seized by Russia in March 2022.Zelensky joked that he hoped the Emirates knew about the planned meeting, but in a measure of the seriousness of the talks he named some his most senior officials in the Ukrainian team taking part.The head of the country's national security and defence council, Rustem Umerov, was already talking to US officials in Davos, along with Kyrylo Budanov, the head of Zelensky's office, and negotiator David Arakhamia. They will be joined the chief of the general staff, Andrii Hnatov.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US optimistic on end to war as Zelensky says Ukraine to talk to US and Russia",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5423/live/aaba3ee0-f78c-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-22T17:37:26.000Z",
      "dateModified": "2026-01-22T17:37:26.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Israeli strike in Gaza kills three journalists, first responders say",
    "url": "https://www.bbc.com/news/articles/c98pnzp50nqo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f3f8/live/33576850-f6e7-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-21T20:44:23.000Z",
    "description": "24 hours agoDavid GrittenandDan Johnson,JerusalemThree Palestinian journalists have been killed in an Israeli strike in central Gaza, first responders",
    "body": "24 hours agoDavid GrittenandDan Johnson,JerusalemThree Palestinian journalists have been killed in an Israeli strike in central Gaza, first responders say.Gaza's Hamas-run Civil Defence agency said their car was hit in the al-Zahra area and named them as Mohammed Salah Qashta, Anas Ghneim and Abdul Raouf Shaat. They are understood to have been working for an Egyptian relief organisation.The Israeli military said it struck \"several suspects who operated a drone affiliated with Hamas... in a manner that posed a threat\" to its troops. It added that the incident was under examination.Another eight people, two of them children, were killed by Israeli artillery and gunfire across Gaza on Wednesday, the Hamas-run health ministry said.Medics said three people, including a 10-year-old boy, were killed by Israeli tank fire elsewhere in central Gaza, and that a 13-year-old boy and a woman were killed by Israeli gunfire in the southern Khan Younis area, according to Reuters news agency.The Israeli military said on Wednesday morning that its troops had killed a \"terrorist who crossed the Yellow Line and approached\" them, without mentioning a location. The Yellow Line demarcates territory in Gaza still under Israeli control under the ceasefire deal.At least 466 Palestinians have been killed in Gaza since a ceasefire between Israel and Hamas began on 10 October, according to the health ministry.The Israeli military has said three of its soldiers have been killed in attacks by Palestinian armed groups over the same period.The three photojournalists killed on Wednesday were reportedly working for the Egyptian Relief Committee in the Gaza Strip to film its camps for displaced people.A spokesperson for the humanitarian organisation said the car that was struck was marked with its logo and that it was \"targeted during a humanitarian mission, resulting in the martyrdom of three individuals\".Hamas called the strike a \"dangerous escalation of the flagrant violations of the ceasefire agreement\".The Palestinian Journalists Syndicate said it constituted a war crime and evidence of what it called \"a systematic Israeli policy aimed at silencing the Palestinian voice, obstructing the transmission of facts, and concealing crimes committed against civilians\", according to Palestinian news agency Wafa.Abdul Raouf Shaat was a regular contributor to French news agency AFP, which expressed \"immense sadness\" at his death and demanded a \"full and transparent investigation\".The Committee to Protect Journalists (CPJ) also said it was \"appalled\".\"Israel, which possesses advanced technology capable of identifying its targets, has an obligation under international law to protect journalists,\" regional director Sara Qudah said.The CPJ has documented the killing of at least 206 journalists and media workers by Israeli fire in Gaza since the start of the war - the deadliest conflict for journalists ever documented.Before Wednesday, two journalists had been killed in Israeli strikes during the ceasefire, and a third had been killed by members of a Palestinian armed group, according to the US-based organisation's data.International news outlets, including the BBC, rely on local journalists in Gaza, as Israel does not allow them to send foreign journalists into the territory independently. Some journalists are taken into Gaza by the Israeli military under controlled access.The war was triggered by the Hamas-led attack on southern Israel on 7 October 2023, in which about 1,200 people were killed and 251 others were taken hostage.Israel responded to the attack by launching a military campaign in Gaza, during which more than 71,550 people have been killed, according to the territory's health ministry.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Israeli strike in Gaza kills three journalists, first responders say",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f3f8/live/33576850-f6e7-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-21T20:44:23.000Z",
      "dateModified": "2026-01-21T20:44:23.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Son-in-law of Venezuelan opposition candidate freed from jail, wife says",
    "url": "https://www.bbc.com/news/articles/cq5yywx39e7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ec87/live/1cd4fb80-f780-11f0-a454-dd9f56c864fe.jpg",
    "tag": "World",
    "date": "2026-01-22T11:35:20.000Z",
    "description": "9 hours agoVanessa BuschschlüterLatin America editor, BBC News OnlineRafael Tudares, the son-in-law of Venezuelan opposition candidate Edmundo Gonzále",
    "body": "9 hours agoVanessa BuschschlüterLatin America editor, BBC News OnlineRafael Tudares, the son-in-law of Venezuelan opposition candidate Edmundo González, has been released from prison, his wife has said, more than a year after he was detained as part of a crackdown on Maduro government critics and their relatives.Mariana González said her husband had returned home after \"380 days of unjust and arbitrary detention\".Tudares is one of more than 150 detainees who have been released since the US military seized Venezuelan leader, Nicolás Maduro, in a nighttime raid and took him to New York to stand trial on drug-trafficking charges.An NGO lobbying for the release of Venezuelan political prisoners warns that 777 still remain behind bars.Tension within the country remains high with Maduro's former vice-president, Delcy Rodríguez, now in power having been sworn in as the acting president.Her interim government has received the backing of US President Donald Trump, who has praised Rodríguez for agreeing to \"turn over\" up to 50 million barrels of Venezuelan oil to the US.The release of political prisoners had been among the first things the Trump administration had pushed Venezuela's interim government to do.Just five days after the US raid, the head of Venezuela's National Assembly announced that \"an important number of people\" would be freed as \"a gesture of peace\".However, rights groups have denounced the slow pace of the releases and the fact that the number given by officials - 400 - falls far short of what they have been able to confirm. The NGO Foro Penal says it has so far only been able to verify the release of 151 political prisoners since 8 January, when the head of Venezuela's National Assembly announced that \"an important number of people\" would be freed as \"a gesture of peace\" following the US operation.Foro Penal has also said that many those released have not had the charges against them dropped, leaving them in legal limbo, and have been barred from speaking in public. Tudares's imprisonment was one of the emblematic cases of the repression which followed in the wake of Venezuela's 2024 presidential election.His father-in-law, González, became the main challenger of the incumbent Maduro after the well-known opposition leader María Corina Machado was barred from running.Fearing the Maduro government would resort to fraud to rig the result, González and Machado mobilised hundreds of people to act as observers at the polling stations and collect the tallies from the electronic voting machines. The electoral council, dominated by government loyalists, declared Maduro the winner but never provided the detailed voting tallies to back up its claim.The voting tallies collected by the observers deployed by the opposition and independently verified by the Carter Center, however, suggested that González had won by a landslide. Nevertheless, Maduro - who was firmly in control of the state institutions, including the armed forces and the police - was sworn in for another term in January 2025.In the run-up to his inauguration, many opposition leaders and activists were seized by the security forces in an attempt to stifle any dissent.Fearing arrest, González had sought refuge in the Dutch embassy as early as September 2024 and gone in to exile in Spain shortly afterwards.Three days before Maduro's inauguration, González's 46-year-old son-in-law - a lawyer who was not involved in politics - was seized by hooded men as he was taking his young children to see their ailing grandmother. For months, his family did not know where he was being held or on what grounds he had been seized.Last month, his wife said she had learned that he had been sentenced to 30 years in prison for \"terrorism and conspiracy\". She said her access was not allowed to choose a lawyer and had only been allowed to read the charges levelled against him on the day of his \"only hearing\".Mariana González told El Pais newspaper that she had been approached on at least three occasions by middlemen who told her that her husband would only be allowed to return to his family if her father renounced his cause. \"This has nothing to do with justice,\" she said at the time. \"Being the son-in-law of Edmundo González is not a crime,\" she added.Mariana González took to X to thank all of the people who had supported her in her fight for her husband's release. But she also reminded readers that there were still many families waiting for the release of their loved ones who, she said, had been \"forcibly disappeared, arbitrarily detained and unjustly locked up.Many of them have been holding vigils outside the main prisons in Venezuela in the hope that their relatives will be among those released in the wake of the US military raid.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Son-in-law of Venezuelan opposition candidate freed from jail, wife says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ec87/live/1cd4fb80-f780-11f0-a454-dd9f56c864fe.jpg"
      ],
      "datePublished": "2026-01-22T11:35:20.000Z",
      "dateModified": "2026-01-22T11:35:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Muwanga Kivumbi: Ugandan MP and Bobi Wine ally arrested over election violence",
    "url": "https://www.bbc.com/news/articles/cq844z9y4q9o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a251/live/20cfee80-f78e-11f0-8415-2b8404a6e040.jpg",
    "tag": "World",
    "date": "2026-01-22T13:14:04.000Z",
    "description": "Ugandan police have detained a lawmaker, and close ally of opposition leader Bobi Wine, for his alleged role in election-related violence last week.Mu",
    "body": "Ugandan police have detained a lawmaker, and close ally of opposition leader Bobi Wine, for his alleged role in election-related violence last week.Muwanga Kivumbi, a deputy leader of Wine's National Unity Platform (NUP), is accused of organising attacks on a police station and a vote-tallying centre after their electoral loss, which the party denies.The police have said that seven people were killed in the incident, but the politician has given a different account, saying that 10 people were killed at his home as they waited for parliamentary election results.The Uganda Police Force said in a post on X on Thursday that Kivumbi would be \"arraigned before court in due course\".\"His arrest is in connection with recent incidents of political violence,\" it added.Kivumbi's arrest follows tensions after last week's elections in which President Yoweri Museveni was re-elected for a seventh term.During his victory speech over the weekend, Museveni warned opposition figures including Kivumbi of coordinated plans to attack polling stations.He said seven people were shot dead by police after groups of alleged opposition supporters, armed with machetes, attempted to carry out violent attacks in Butambala district outside the capital, Kampala.Wine, Museveni's closest challenger and who is in hiding after fleeing a raid on his house after the elections, has denounced the results as \"fake\", citing electoral fraud.He has also alleged that there was \"silent massacre\" under way and a crackdown targeting political activists.On Tuesday, he posted on social media that more than 100 people had been killed in election violence, without stating evidence.This came after Uganda's army chief Gen Muhoozi Kainerugaba, who is also Museveni's son and his potential successor, said the security forces had killed 22 opposition supporters during poll-related violence.Since the election, Ugandan authorities have reportedly arrested dozens of youths on various charges linked to election-related incidents in Kampala.Museveni first came to power as a rebel leader in 1986. He will have served for 45 years when the next term ends in 2031.Uganda has not witnessed a peaceful transfer of presidential power since independence.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Muwanga Kivumbi: Ugandan MP and Bobi Wine ally arrested over election violence",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a251/live/20cfee80-f78e-11f0-8415-2b8404a6e040.jpg"
      ],
      "datePublished": "2026-01-22T13:14:04.000Z",
      "dateModified": "2026-01-22T13:14:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Leaked photos show hundreds killed in Iran's brutal crackdown",
    "url": "https://www.bbc.com/news/articles/c0r4957rq8ro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0ed9/live/86776c20-f62d-11f0-b385-5f48925de19a.png",
    "tag": "World",
    "date": "2026-01-21T05:56:20.000Z",
    "description": "Photos leaked to BBC show faces of hundreds killed in Iran's brutal protest crackdown2 days agoMerlyn Thomas,correspondent, BBC Verify,Shayan Sardariz",
    "body": "Photos leaked to BBC show faces of hundreds killed in Iran's brutal protest crackdown2 days agoMerlyn Thomas,correspondent, BBC Verify,Shayan Sardarizadeh,senior journalist, BBC VerifyandGhoncheh Habibiazad,senior journalistBBCWarning: this story contains graphic content which some readers might find distressingHundreds of photos revealing the faces of those killed during Iran's violent crackdown on anti-government protests have been leaked to BBC Verify.The pictures, which are too graphic to show without blurring, reveal the bloodied, swollen and bruised faces of at least 326 victims - including 18 women. The images, displayed in a south Tehran mortuary, are one of the only ways families have been able to identify their dead loved ones.Many of the victims were too disfigured to be identified, and 69 people had been labelled in Persian as John or Jane Doe, suggesting their identity was unknown when the photo was taken. Only 28 of the victims had labels with clearly visible names in the photos.Labels on more than 100 victims, who had their date of death recorded, showed that date as 9 January, one of the deadliest nights for protesters in Tehran so far.The city's streets were set on fire during clashes with security forces, with protesters chanting slogans against the supreme leader and the Islamic Republic. It followed a call for nationwide protests from Reza Pahlavi, the exiled son of the late shah. The leaked photos provide a small snapshot of the thousands believed to have been killed at the hands of the Iranian state.Getty ImagesProtesters on a street in Tehran on 9 January BBC Verify has been tracking the spread of protests across Iran since they erupted in late December, but the near total internet blackout imposed by the authorities has made it extremely difficult to document the scale of the government's violence against those who oppose it.Iran's Supreme Leader Ayatollah Ali Khamenei has publicly acknowledged several thousand people have been killed but blamed the US, Israel and those he described as \"seditionists\".Despite the blackout entering its third week, a small number of people have managed to get some information out.Hundreds of close-up images of victims taken from inside the Kahrizak Forensic Medical Centre were leaked to BBC Verify.We analysed 392 photos of victims and were able to identify 326 people - some had multiple pictures taken of them from different angles. Sources claimed the true number of dead at the mortuary ran into the thousands. One source, who we are not naming for their safety, told us they weren't prepared for the level of devastation they encountered inside the mortuary complex, and said they saw victims ranging from as young as 12 or 13 to 60 and 70-year-olds. \"It was just too much,\" they said.Amid the chaos inside the mortuary, family members and friends were huddled together around a screen, we were told. They were trying to identify their loved ones while hundreds of images of the dead flicked across the screen. Crowds of anti-government protesters in TehranThe slideshow lasted for hours, they said, adding that many of the victims' injuries were so severe they could not be identified. One man's face was so swollen his eyes were barely visible. Another man still had a breathing tube in his mouth, suggesting he died after receiving medical treatment.Some victims were so badly injured that their families asked to see the pictures again and to zoom in on their faces to make sure it was really them, we were told. At other times people recognised their loved ones instantly and were seen collapsing to the floor, screaming.Many photos showed unzipped body bags with papers laid close to their faces, identifying them by name, ID number or date of death. In some cases, we were told, the only identifier was a bank card laid on top of a body bag – the victims' last remaining possession.BBC Verify has separately corroborated videos from the same mortuary that demonstrate the violence perpetrated against protesters. One shows the body of what appears to be a child, while another shows a man with a clear gunshot wound in the middle of his head. Both videos are too distressing to show. Some Iranians have been posting the names of victims killed by security forces when they manage to connect to the internet through Starlink or even using networks from neighbouring countries, though these opportunities are incredibly rare.We checked the names of victims identified in the mortuary against social media posts reporting the names of the dead and found five matches, but are not revealing the names as we cannot contact the victims' families.BBC Verify has tracked the spread of anti-government protests across 71 towns and cities in Iran since they first erupted on 28 December through verified video, though the true number of areas where demonstrations have taken place is likely much higher.The few images that people have managed to upload through Starlink show burnt-out cars left in the streets, while verified videos recorded rounds of gunshots fired around Tehran during protests. The internet blackout has made it extremely difficult to document the full extent of the death toll from the protests. However, US-based Human Rights Activists News Agency (HRANA) has placed its current estimate at more than 4,000 deaths.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Leaked photos show hundreds killed in Iran's brutal crackdown",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/0ed9/live/86776c20-f62d-11f0-b385-5f48925de19a.png"
      ],
      "datePublished": "2026-01-21T05:56:20.000Z",
      "dateModified": "2026-01-21T05:56:20.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "ICE detains 5-year-old and father in Minnesota, lawyer says",
    "url": "https://www.bbc.com/news/articles/cwyrrqwxpz7o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e0a4/live/f1221070-f7b8-11f0-a422-4ba8a094a8fa.jpg",
    "tag": "World",
    "date": "2026-01-22T16:04:08.000Z",
    "description": "US Immigration and Customs Enforcement (ICE) officers detained a 5-year-old boy on Tuesday during an immigration enforcement operation, Minnesota scho",
    "body": "US Immigration and Customs Enforcement (ICE) officers detained a 5-year-old boy on Tuesday during an immigration enforcement operation, Minnesota school officials and the family's lawyer have said.Pre-schooler Liam Ramos was with his father - named by the Department of Homeland Security (DHS) as Adrian Alexander Conejo Arias - when Conejo Arias was approached by agents on his driveway. In a statement posted on X, the DHS said \"ICE did NOT target a child\", but was conducting an operation against his father, an \"illegal alien\" who \"abandoned\" his son when approached.Zena Stenvik, the Columbia Heights Public Schools superintendent, asked: \"Why detain a 5-year-old? \"You can't tell me that this child is going to be classified as a violent criminal.\"Photos provided to the BBC by the school district show a boy, identified as Liam Ramos, wearing a bunny-shaped winter hat, standing outside as an officer holds onto his backpack.The Columbia Heights Public Schools authority described these as bystander photos. The district did not identify the individuals who took the pictures, referring to them as \"known and confirmed community members\".Marc Prokosch, a lawyer representing the family, told journalists that Liam and his father were likely being held at a detention centre in Texas. School officials said that the father had an active asylum case with no deportation order.The son had just arrived home from pre-school at the time of the apprehension, Stenvik said during a press conference on Wednesday.Around the time of the incident, school officials were present at the Ramos house to provide support, according to the schools superintendent.Stenvik said that ICE had recently detained a total of four students in her school district, including a 10-year-old, and two 17-year-olds.The DHS did not immediately respond to the BBC's request for comment on the incident.In its post on X, the DHS described the arrest as a \"targeted operation\". It added: \"For the child's safety, one of our ICE officers remained with the child while the other officers apprehended Conejo Arias.\"Parents are asked if they want to be removed with their children, or ICE will place the children with a safe person the parent designates. This is consistent with past administration's immigration enforcement.\"According to Stenvik, another adult living in the home did ask to take the young boy inside but was refused. It was not clear why. Instead, the school officials allege, an agent asked the child to knock on the door of the home to see if anyone else was there.Columbia Heights Public Schools Board of Education Chair Mary Granlund said in a statement: \"Our children should not be afraid to come to school or wait at the bus stop.\"Their families should not be afraid to drop off or pick up their children from school.\"The DHS has previously said it is arresting the \"worst of the worst criminal illegal aliens\" in an effort to restore public safety in Minnesota.At a DHS press conference on Tuesday, Gregory Bovino of the US Border Patrol discussed the wider operation and said: \"Our operations are lawful, are targeted, and are focused on individuals who pose a serious threat to this community.\"The mission, dubbed Operation Metro Surge, has sparked outcry from residents in Minneapolis, St Paul, and other cities in the state.On 7 January, a federal officer fatally shot a woman named Renee Good in Minneapolis, sparking nationwide protest and condemnation from local and state officials.The Trump administration alleged the woman was using her vehicle as a weapon and the officer acted in self-defence.Vice President JD Vance was scheduled to visit the state on Thursday amid ongoing protests against ICE's operations.Vance told reporters he hoped to \"to calm the tensions\", CNN reported.\"The number one way where we could lower the mistakes that are happening, at least with our immigration enforcement, is to have local jurisdictions that are cooperating with us,\" Vance said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "ICE detains 5-year-old and father in Minnesota, lawyer says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e0a4/live/f1221070-f7b8-11f0-a422-4ba8a094a8fa.jpg"
      ],
      "datePublished": "2026-01-22T16:04:08.000Z",
      "dateModified": "2026-01-22T16:04:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ex-intelligence officer accused of betraying Austria in Russia spying trial",
    "url": "https://www.bbc.com/news/articles/cz0pnjv1zy5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a193/live/5ac52770-f6e1-11f0-a4dd-a5af35a571cb.jpg",
    "tag": "World",
    "date": "2026-01-22T14:03:15.000Z",
    "description": "6 hours agoBethany BellVienna correspondentReutersEgisto Ott is accused of collecting large amounts of data and handing information to Russian intelli",
    "body": "6 hours agoBethany BellVienna correspondentReutersEgisto Ott is accused of collecting large amounts of data and handing information to Russian intelligenceFormer intelligence official Egisto Ott has gone on trial in Vienna, accused of spying for Russia in what is being dubbed Austria's biggest spy trial in years.Egisto Ott, who told the court on Thursday that he was not guilty, is charged with having handed over information to Russian intelligence officers and to Jan Marsalek, the fugitive executive of collapsed German payments firm Wirecard.The prosecutor told the court that Ott, 63, was \"not romantic about Russia\" but had acted out of financial motives and frustration with his career. \"Simply put, this was betraying the country.\" he said. Ott's lawyer, Anna Mair, rejected the allegations.\"Don't you think that if he had really been spying for Russia, he would have covered his tracks?\" she asked.The prosecutor argued that people like Ott were \"very susceptible\" to working for the Russians, saying: \"They are frustrated in their careers and urgently need money.\"Ott had done \"excellent\" work for the Russian secret service\", the prosecution added. The former intelligence official had been broke since 2013 at the latest, the court heard: \"The Russian secret service pays very well.\"He is alleged to have \"abused his authority\" as an Austrian intelligence official by collecting large amounts of personal data, such as locations, vehicle registration numbers, or travel movements.Prosecutors say he did this between 2015 and 2020 without authorisation, often using national and international police databases.They also accuse him of supporting \"a secret intelligence service of the Russian Federation to the detriment of the Republic of Austria\" by collecting secret facts and a large amount of personal data from police databases between 2017 and 2021.The spy scandal has revived fears that Austria remains a hotbed of Russian espionage activity and observers will also be watching closely for details that could emerge about Jan Marsalek.Marsalek, who is also an Austrian citizen, is wanted by German police for alleged fraud and is currently believed to be in Moscow, having fled via Austria in 2020.The subject of an Interpol Red Notice, he is alleged to be an intelligence asset for the FSB, Russia's secretive security service.Prosecutors allege that Egisto Ott handed information to Marsalek and unknown representatives of the Russian intelligence service, and received payment in return.In 2022, they say, Marsalek commissioned him to obtain a laptop containing secret electronic security hardware used by EU states for secure electronic communication. The laptop, they say, was handed over to the Russian intelligence service.Egisto Ott is also suspected, reports say, of having passed phone data from senior Austrian interior ministry officials to Russia.Austria's Standard newspaper says Egisto Ott apparently obtained the work phones after they accidentally fell into the River Danube on an interior ministry boating trip. He is alleged to have copied their contents and passed them on to Jan Marsalek, and Moscow.Egisto Ott is charged with abuse of authority and corruption and espionage against Austria and faces up to five years in prison, if he is found guilty.When he was arrested in 2024, Austria's then Chancellor, Karl Nehammer, described the case as \"a threat to democracy and our country's national security\".Munich PoliceJan Marsalek, former executive at Wirecard, is believed to have escaped to MoscowIn a separate development, prosecutors in the Austrian town of Wiener Neustadt have told the BBC that a former MP, Thomas Schellenbacher, has been charged with helping Marsalek to escape following the collapse of the Wirecard company in 2020, when it emerged that €1.9bn (£1.7bn) was missing from its accounts.Schellenbacher is alleged to have helped Jan Marsalek fly to Belarus, from Bad Vöslau in Austria, in June 2020.Schellenbacher was an MP for the far-right Freedom Party (FPÖ), which has been accused by Austria's Green Party, now in opposition, of enabling Russian espionage, of acting as \"an extension of Russia's arm\" in Austria.The FPÖ and its leader Herbert Kickl have denied the allegations - and have not faced any legal action in connection with any of them.Marsalek, who was the Wirecard's Chief Operating Officer, has since been charged with fraud and embezzlement, suspected of having inflated company's balance sheet total and sales volume.He is also believed to have been the controller of a group of Bulgarians who were convicted in London in 2025, of spying for Russia.Messages from that trial reveal Marsalek has had plastic surgery to alter his appearance as well as details of his life as a fugitive.\"I'm off to bed. Had another cosmetic surgery, trying to look differently, and I am dead tired and my head hurts,\" he wrote to one of the Bulgarians, Roussev, on Telegram in February 2022.In another, dated 11 May 2021, Roussev congratulated Marsalek for learning Russian.\"Well I am trying to improve my skills on a few fronts. Languages is one of them,\" the Austrian responded.\"In my new role as an international fugitive I must outperform James Bond.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ex-intelligence officer accused of betraying Austria in Russia spying trial",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a193/live/5ac52770-f6e1-11f0-a4dd-a5af35a571cb.jpg"
      ],
      "datePublished": "2026-01-22T14:03:15.000Z",
      "dateModified": "2026-01-22T14:03:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "South Africa gang violence: Firoz Cachalia says police not able to defeat gangsters",
    "url": "https://www.bbc.com/news/articles/cx2ll9wr562o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/93b0/live/7416edf0-f766-11f0-9ea1-2582126020d7.jpg",
    "tag": "World",
    "date": "2026-01-22T08:23:36.000Z",
    "description": "South Africa's Police Minister Firoz Cachalia has said that the security forces are not yet able to defeat deadly criminal gangs, in a stark admission",
    "body": "South Africa's Police Minister Firoz Cachalia has said that the security forces are not yet able to defeat deadly criminal gangs, in a stark admission that underscores the scale of the country's crime crisis. Gang violence, alongside robberies, accounts for many murders in South Africa, which has one of the world's highest homicide rates.Cachalia said gang violence had become increasingly complex, especially in the Eastern Cape and Western Cape provinces, requiring new strategies beyond traditional policing.\"I do not believe that we are currently in a position to defeat these gangs,\" the minister told journalists on Wednesday. South Africa, the continent's most industrialised nation, has long struggled with entrenched organised crime. Many people in South Africa own licensed firearms for personal protection, but there are many more illegal guns in circulation.Police data shows that an average of 63 people were killed each day between April and September last year.Speaking after his visit to crime-infested Nelson Mandela Bay in Eastern Cape, Cachalia said criminal gangs were on a \"killing spree\" in the two provinces. \"We had a discussion about the problem of organised crime in the Eastern Cape, including extortion rackets, gang violence and related issues,\" said the minister.  \"I indicated that this is a grave problem throughout the country, that these cartels wield significant wealth and power, and that this is deeply concerning,\" he added. Despite the creation of an anti-gang unit in 2019, Cachalia said gangsters seemed to be winning the war.\"Establishing gang units from time to time is an ad hoc response to a growing problem. I really don't think that we should be approaching this matter in a point-scoring way.\"He said South African police were doing their best to fight the violence \"but the problem is a growing one. That is my view\". His visit comes months after Nelson Mandela Bay was hit by a wave of killings.A deadly spike in violence hit the area in the latter half of last year, leaving 118 people dead between August and December, a local prevention group said.The violence has continued into the new year, with around 40 people killed across the region in January, local media reported. There are about three million legally held firearms in South Africa, but there are at least the same number of unlicensed weapons in circulation in the country, which has a population of 63 million, according to statistics cited by Gideon Joubert from the South African Gunowners' Association.Last month, 11 people were killed in a mass shooting linked to illegal mining turf wars near Johannesburg. The shooting occurred just two weeks after another attack at the Saulsville Hostel in the capital Pretoria, where 11 people, including a three-year-old child, were killed.In another incident last May, gunmen killed eight customers at a tavern in the south-eastern city of Durban.President Cyril Ramaphosa has promised stronger law enforcement action and increased police deployment to tackle the gang violence in the country. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "South Africa gang violence: Firoz Cachalia says police not able to defeat gangsters",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/93b0/live/7416edf0-f766-11f0-9ea1-2582126020d7.jpg"
      ],
      "datePublished": "2026-01-22T08:23:36.000Z",
      "dateModified": "2026-01-22T08:23:36.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Greenland: US allies won't forget Trump Greenland crisis",
    "url": "https://www.bbc.com/news/articles/cj3vv1kv1rdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f93c/live/f467a8b0-f76f-11f0-b5f7-49f0357294ff.jpg",
    "tag": "World",
    "date": "2026-01-22T01:52:28.000Z",
    "description": "18 hours agoPaul AdamsDiplomatic correspondentGetty ImagesProtesters have taken to the streets outside the US consulate in Nuuk, Greenland this monthW",
    "body": "18 hours agoPaul AdamsDiplomatic correspondentGetty ImagesProtesters have taken to the streets outside the US consulate in Nuuk, Greenland this monthWhat on earth has the last fortnight been all about?In the wake of a successful military operation in Venezuela earlier this month, a buoyed-up Donald Trump started to ratchet up the rhetoric on Greenland.Day after day, the world was treated to claims of ownership, threats of military action and tariffs against traditional allies in Europe.Now, in an apparent puff of smoke, it may all have gone.Nato Secretary General Mark Rutte, arguably the Trump whisperer-in-chief, seems to have talked the president down from his dangerously high hobby horse.Watch: Trump takes aim at world leaders in Davos speechThe ground may have been laid last week during a visit to Washington by the foreign ministers of Denmark and Greenland. The visit concluded with agreement on a \"working group\" to discuss Greenland's future.But Rutte appears to have finessed an issue that had threatened to shatter the north Atlantic alliance.We don't yet know the details of the deal, but many will wonder why it needed a frenetic two-week crisis to get here.Denmark had long said that it was only too happy to see an increased American military presence on Greenland.If Nato has now pledged to up its presence on and around the island, then that will go some way towards reassuring Donald Trump that the alliance is finally paying proper attention to Greenland.The New York Times quotes anonymous officials as saying one idea under discussion is for Denmark to cede sovereignty over small areas of Greenland where the US would build military bases - similar to the arrangement by which the UK maintains sovereign bases on Cyprus.Watch: How was Trump's Davos speech received?Trump said the deal would involve access to Greenland's mineral resources.Neither Denmark nor Nato has confirmed these or any other reports.Nato said discussions would \"focus on ensuring Arctic security through the collective efforts, especially the seven Arctic Allies\" (the US, Canada, Denmark, Norway, Sweden, Finland and Iceland) and aimed to prevent Russia and China from gaining a foothold, economic or military, in Greenland.It won't be long before details of the deal emerge. But the fact that Donald Trump triggered a fortnight of high drama and a sense of existential crisis within Nato to get here will not easily be forgotten.Canada's Prime Minister Mark Carney called it a \"rupture\", saying the old order was \"not coming back.\"EU Commission President Ursula von der Leyen spoke of \"seismic change\" and urged greater European independence.It's hard to see a quick return to business as usual.Ros Atkins on... Trump's Davos speech claims",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Greenland: US allies won't forget Trump Greenland crisis",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f93c/live/f467a8b0-f76f-11f0-b5f7-49f0357294ff.jpg"
      ],
      "datePublished": "2026-01-22T01:52:28.000Z",
      "dateModified": "2026-01-22T01:52:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]