[
  {
    "title": "Peru's Congress ousts President Jerí after four months in office",
    "url": "https://www.bbc.com/news/articles/cz7gvdx457vo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f6d0/live/6d7dd8b0-0c5a-11f1-b5e2-dd58fc65f0f6.jpg",
    "tag": "World",
    "date": "2026-02-18T09:46:33.000Z",
    "description": "3 hours agoYang TianGetty ImagesPeru's Congress has ousted interim President José Jerí just four months after he took office for failing to disclose m",
    "body": "3 hours agoYang TianGetty ImagesPeru's Congress has ousted interim President José Jerí just four months after he took office for failing to disclose meetings with Chinese businessmen.The scandal unfolded last month after videos emerged of Jerí meeting several times outside his official schedule with businessman Zhihua Yang, who was under government scrutiny.Jerí had previously apologised for the meetings, but denied any wrongdoing and accused his rivals of a public smear campaign.His removal from office makes him the third consecutive president to be ousted, after he replaced former leader Dina Boluarte, who was impeached in October last year.Jerí was Peru's seventh president since 2016 amid a tumultuous political landscape that has seen a succession of leaders leave the post under contentious circumstances.While lawmakers had set a date to discuss impeaching Jerí, in the end they opted for a different parliamentary procedure called censure, which only required a simple majority to pass rather than the super majority needed for an impeachment.Later on Wednesday, Congress will name a new interim president who will serve only for a few months - until a new president is chosen by the people in a general election this April. Jerí had come under fire following a series of controversies dubbed \"Chifa-gate\" - after a local name for Chinese-Peruvian fusion food and the restaurants which serve it.Security camera footage of Jerí's meetings with Yang, who owns several businesses and was granted a state concession for an energy project, was first reported by local media.In one of the videos, Jerí could be seen wearing a hooded top during a late-night visit at one of Yang's restaurants.Also present at one of the meetings was another Chinese citizen who was under house arrest while being investigated for alleged links to an illegal timber network.Peruvian law requires presidents to document all their official activities, but Jerí did not record those meetings.Jerí faced further criticism after it emerged that state contracts had been awarded  to a number of women following late-night meetings they had with him in the presidential palace.Ruth Luque, one of the lawmakers who backed the censure measure, said she wanted a leader who would put public interest and security first.\"We ask to end this agony so we can truly create the transition citizens are hoping for,\" she said, according to Reuters news agency. \"Not a transition with hidden interests, influence-peddling, secret meetings and hooded figures. We don't want that sort of transition.\"Pressure had been mounting for Jerí to resign in the wake of the scandals as he faced a corruption investigation launched by the attorney general and his approval ratings plummeted.His removal marks another chapter of instability for Peru, which is due to hold a general election in April, after which power will be transferred to a new president.Less than a week after Jerí assumed power, protests organised by young Peruvians demanding the political class to do more to combat crime and corruption left one dead and more than 100 people injured.Correction 18 February: An earlier version of this article said José Jerí had been impeached as Peru's president. This was later updated to say he had been ousted by Congress to better reflect the parliamentary procedure used to remove him from office.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Peru's Congress ousts President Jerí after four months in office",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/f6d0/live/6d7dd8b0-0c5a-11f1-b5e2-dd58fc65f0f6.jpg"
      ],
      "datePublished": "2026-02-18T09:46:33.000Z",
      "dateModified": "2026-02-18T09:46:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Police assessing Stansted Airport flights over Epstein ties",
    "url": "https://www.bbc.com/news/articles/c98q4mz831mo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/56ca/live/32f8af20-0c33-11f1-aea9-35917f4e91eb.jpg",
    "tag": "World",
    "date": "2026-02-18T10:30:17.000Z",
    "description": "2 hours agoRachel Muller-HeyndykUS Department of Justice/PAEpstein took dozens more flights to the UK than were previously knownEssex Police has said ",
    "body": "2 hours agoRachel Muller-HeyndykUS Department of Justice/PAEpstein took dozens more flights to the UK than were previously knownEssex Police has said it is assessing information about private flights into and out of Stansted Airport following the publication of the Epstein files.The BBC understands that while the police is \"assessing\" the information, it would not necessarily lead to a full investigation.Former Prime Minister Gordon Brown wrote in the New Statesman last week that police \"urgently\" need to re-examine whether Jeffrey Epstein's victims were trafficked within and outside of the UK.An Essex Police spokesperson said: \"We are assessing the information that has emerged in relation to private flights into and out of Stansted Airport following the publication of the US DoJ Epstein files.\"In December, BBC News discovered that three British women who were allegedly trafficked appear in Epstein's records of flights in and out of the UK alongside other documents related to the convicted sex offender.US lawyers representing hundreds of Epstein victims told the BBC it was \"shocking\" that there has never been a \"full-scale\" investigation into his activities in the UK.The former PM wrote to the chief police constables and commissioner of the Met, Essex and Thames Valley Police.He added that Stansted, located around 40 miles away from central London, was one of the airports \"where women were transferred from one Epstein plane to another\".Stansted Airport said in a statement: \"All private aircraft at London Stansted operate through independent Fixed Base Operators, which handle all aspects of private and corporate aviation in line with regulatory requirements.\"The airport said that these terminals are \"entirely independent\" and that \"no private jet passengers enter the main airport terminal\". Immigration and customs checks for passengers arriving via private jets are carried out \"directly by Border Force\", it said, adding that it does not \"manage or have any visibility of passenger arrangements on privately operated aircraft\".BBC News has again contacted police forces in areas where Epstein-linked flights landed or took off from, including Police Scotland, Merseyside, Belfast, West Midlands, and Bedfordshire.Our investigations team is sifting through the latest Epstein documents released by the US Department of Justice to see what other flights and trains Epstein may have used to travel in the UK.The Essex Police statement comes as a new national group has been set up to support UK forces that are \"assessing allegations\" following the publication of the Epstein files, the National Police Chiefs' Council (NPCC) has said.The force previously said it has held discussions with specialists from the Crown Prosecution Service about the allegations that Andrew shared confidential reports with Epstein during his time as the UK's trade envoy.Elsewhere, Norfolk Constabulary said it was \"reviewing documents\" released in the US to \"ensure that all relevant information has been properly assessed\".A spokesperson said the force had \"not received any allegations and is not currently conducting any investigation\", but that it was \"reviewing documents\" released in the US to \"ensure that all relevant information has been properly assessed\".Last year, a BBC News investigation found one arrival and departure of an Epstein-linked flight at RAF Marham in west Norfolk.Separately, the tranche of documents released in December included a photograph taken the royal Sandringham estate in Norfolk of Andrew lying across the laps of women, with convicted sex trafficker Ghislaine Maxwell standing in the background.The former prince has always denied any wrongdoing.Earlier this month, the Metropolitan Police launched a criminal investigation into Peter Mandelson following claims he passed market-sensitive information to Epstein.The BBC understands Lord Mandelson's position is that he has not acted in any way criminally and that he was not motivated by financial gain.He was dismissed from his role as ambassador in September, after Downing Street said new information had emerged about the depth of this relationship with Epstein.Get our flagship newsletter with all the headlines you need to start the day. Sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Police assessing Stansted Airport flights over Epstein ties",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/56ca/live/32f8af20-0c33-11f1-aea9-35917f4e91eb.jpg"
      ],
      "datePublished": "2026-02-18T10:30:17.000Z",
      "dateModified": "2026-02-18T10:30:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Australia temporarily bans citizen from IS-linked group trying to return",
    "url": "https://www.bbc.com/news/articles/c4g2dgjrx75o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ba4f/live/c30e7860-0c92-11f1-ab92-c5c4ffbfd0e0.jpg",
    "tag": "World",
    "date": "2026-02-18T07:08:18.000Z",
    "description": "6 hours agoKelly NgGetty ImagesAustralia has barred a citizen linked to the Islamic State (IS) group from the country for up to two years.The person i",
    "body": "6 hours agoKelly NgGetty ImagesAustralia has barred a citizen linked to the Islamic State (IS) group from the country for up to two years.The person is among the group of 34 Australian women and children who tried to head home after being released from a Syrian camp earlier this week, only to be turned back by Syrian authorities for \"technical reasons\".The ban was issued \"on advice from security agencies\", Home Affairs Minister Tony Burke said on Wednesday, adding that the other 33 people do not meet \"required legal thresholds\" to be banned.Canberra has refused to repatriate the group, believed to be made up of the wives, widows and children of IS fighters. There are 23 children among them.Prime Minister Anthony Albanese stressed that these families will not receive government support to come back to the country.\"You make your bed, you lie in it,\" he told a press conference on Wednesday.\"These are people who chose to go overseas to align themselves with... a brutal, reactionary ideology that seeks to undermine and destroy our way of life.\"However legal experts have warned the government has an obligation to allow citizens the right of return, and, responding to reports the group had valid Australian passports, Albanese said his government would not \"breach Australian law\".This group in the al-Roj camp in northern Syria is among dozens of Australians who have been held in camps and prisons across the country since 2019, when IS was driven from its final foothold in Syria.Opposition politicians have raised security concerns about the possibility of these Australians' return. \"How can only one member of this group be deemed a risk and the rest somehow okay?\" Liberal Party Senator Jonno Duniam said on Tuesday, offering to help amend laws to bar more of the group.The al-Roj camp is home to more than 2,000 others from 40 different nationalities, mainly women and children. Among them is thought to be Shamima Begum, who was stripped of her British citizenship in 2019 on national security grounds.Speaking to ABC, the camp's director Hakmiyeh Ibrahim made an appeal to all countries that have citizens held in limbo there: \"Take your citizens, take these children and women\".The children especially are growing up surrounded by \"dangerous ideas and ideologies\" in the camp, she said. \"The more time passes, the more complicated the situation becomes.\"Several of these camps have made headlines as the women and children living in them are severely malnourished and lack access to basic resources.Several other foreign governments - including France, the Netherlands, and the UK - have also refused to repatriate most of their citizens still held in Syria.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australia temporarily bans citizen from IS-linked group trying to return",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ba4f/live/c30e7860-0c92-11f1-ab92-c5c4ffbfd0e0.jpg"
      ],
      "datePublished": "2026-02-18T07:08:18.000Z",
      "dateModified": "2026-02-18T07:08:18.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US civil rights leader Jesse Jackson dies aged 84",
    "url": "https://www.bbc.com/news/articles/cp81l0e1eg5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1088/live/9ca4e140-0c34-11f1-b5e2-dd58fc65f0f6.jpg",
    "tag": "World",
    "date": "2026-02-17T18:55:33.000Z",
    "description": "18 hours agoWatch: Jesse Jackson's life in civil rights, diplomacy, and politicsUS civil rights leader Jesse Jackson died aged 84 on Tuesday morning s",
    "body": "18 hours agoWatch: Jesse Jackson's life in civil rights, diplomacy, and politicsUS civil rights leader Jesse Jackson died aged 84 on Tuesday morning surrounded by relatives, according to a statement released by his family. \"It is with profound sadness that we announce the passing of Civil Rights leader and founder of the Rainbow PUSH Coalition, the Honorable Reverend Jesse Louis Jackson, Sr,\" the family said, adding that he died \"peacefully\".  The cause of his death has not been released, but Jackson had been diagnosed with progressive supranuclear palsy (PSP) and was in hospital late last year.Tributes poured in for the prominent activist, who twice ran to be the Democratic presidential nominee, including from the first black US president, Barack Obama.Jackson is survived by his wife Jacqueline and their children: Santita, Jesse Jr, Jonathan, Yusef, Jacqueline and Ashley.Jackson's family said in their statement that his \"unwavering commitment to justice, equality and human rights helped shape a global movement for freedom and dignity\". \"A tireless change agent, he elevated the voices of the voiceless from his presidential campaigns in the 1980s to mobilising millions to register to vote - leaving an indelible mark on history,\" they added.Alongside working with Martin Luther King Jr and running for president in 1984 and 1988, Jackson is remembered as the founder of a non-profit organisation focused on social justice and civil rights, the Rainbow PUSH coalition.Calling Jackson a \"true giant\", Obama said in a statement that Jackson's \"two historic runs for president\" had \"laid the foundation for my own campaign to the highest office of the land\". Obama added that his wife Michelle \"got her first glimpse of political organising at the Jacksons' kitchen table when she was a teenager\".\"For more than 60 years, Reverend Jackson helped lead some of the most significant movements for change in human history,\" the Obamas also said.\"From organising boycotts and sit-ins, to registering millions of voters, to advocating for freedom and democracy around the world, he was relentless in his belief that we are all children of God, deserving of dignity and respect.\"Jackson was admitted to hospital last November, and doctors said he had been diagnosed with a rare degenerative condition called PSP in April 2025, revising an earlier diagnosis of Parkinson's disease that Jackson had said was made in 2015.Both diseases affect the brain, nervous system and muscle control. Many people with PSP are initially diagnosed with Parkinson's because a number of the symptoms overlap,  according to the American Parkinson Disease Association and the group CurePSP.Born in 1941 in Greenville, South Carolina, Jackson became involved in politics at an early age. He rose to prominence in the 1960s as a leader in Martin Luther King Jr's Southern Christian Leadership Conference and was with King when he was assassinated in Memphis, Tennessee in 1968.Over the course of his career, Jackson built a movement to bring America's increasingly diverse population together, with a message that centred on poor and working-class Americans.After his presidential runs, Jackson later positioned himself as an elder statesman within the Democratic Party.His son Jesse Jackson Jr is a former US congressman.Getty ImagesJackson was remembered by politicians and friends as an agent of change and a transformative leaderShortly after his death was announced, politicians and other public figures took to social media to mourn the loss of Jackson. US President Donald Trump said he knew Jackson \"long before becoming president\". \"He was a good man, with lots of personality, grit, and 'street smarts,'\" Trump said. \"He was very gregarious - Someone who truly loved people!\"Former US President Bill Clinton and his wife Hillary, a former secretary of state, also shared tributes, saying they were friends with Jackson for \"almost 50 years\".\"Reverend Jackson championed human dignity and helped create opportunities for countless people to live better lives,\" they said. House of Representatives Minority Leader Hakeem Jeffries wrote on X that Jackson \"was a legendary voice for the voiceless\".The Democrat added: \"For decades, while labouring in the vineyards of the community, he inspired us to keep hope alive in the struggle for liberty and justice for all.\"New York City Mayor Zohran Mamdani said the civil rights leader \"never stopped demanding that America live up to its promise\".\"He marched, he ran, he organised and he preached justice without apology,\" Mamdani said. King's daughter Bernice said Jackson had \"devoted his life to lifting people in poverty, the marginalised, and those pushed to society's edges\". Civil rights leader Reverend Al Sharpton, who worked closely with Jackson during the civil rights movement, said Jackson was a \"consequential and transformative leader who changed this nation and the world\". \"He told us we were somebody and made us believe. I will always cherish him taking me under his wing, and I will forever try to do my part to keep hope alive,\" Sharpton said. Watch: BBC interviews Jesse Jackson in Birmingham in 2013",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US civil rights leader Jesse Jackson dies aged 84",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1088/live/9ca4e140-0c34-11f1-b5e2-dd58fc65f0f6.jpg"
      ],
      "datePublished": "2026-02-17T18:55:33.000Z",
      "dateModified": "2026-02-17T18:55:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nine arrested in France over death of far-right student",
    "url": "https://www.bbc.com/news/articles/cvgj1qrqd47o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8265/live/5290eb40-0c42-11f1-b8ba-135d136c986f.jpg",
    "tag": "World",
    "date": "2026-02-17T21:08:32.000Z",
    "description": "16 hours agoHugh SchofieldParisAFP via Getty ImagesNine people have been arrested in France following an investigation into the murder of a far-right ",
    "body": "16 hours agoHugh SchofieldParisAFP via Getty ImagesNine people have been arrested in France following an investigation into the murder of a far-right nationalist student by suspected militants from the far-left.Those detained include a parliamentary assistant for a deputy from the radical left France Unbowed (LFI) party.Quentin Deranque, a 23-year-old maths student, died in hospital on Saturday - two days after being beaten and kicked about the head by a gang of masked young men in Lyon.It happened after a small demonstration by far-right feminists - who Deranque was supposed to be helping protect - at the city's Institute of Political Studies (IEP), commonly known as Sciences-Po. The arrests confirm what has widely been reported: that those suspected of the murder are far-left militants linked to a banned group called La Jeune Garde (Young Guard). The most striking news is that among the nine in custody is Jacques-Elie Favrot, a young man who until now has been employed as parliamentary assistant at the National Assembly in Paris for a deputy from LFI.The murder is putting huge pressure on LFI, on its 70 MPs, and on its veteran leader Jean-Luc Mélenchon, who is a likely contender in next year's presidential election.On Sunday, Mélenchon said his party had \"nothing to do with this story. Those who accuse us are committing a libel.\"We express our consternation, but also our empathy and compassion for [Deranque's] family and friends. We have said dozens of times that we oppose all forms of violence,\" he said.On Monday, state prosecutor Thierry Dran told a news conference that Deranque was kicked and punched by \"at least six\" individuals, and that the post-mortem examination showed fatal damage to his skull and brain.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nine arrested in France over death of far-right student",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8265/live/5290eb40-0c42-11f1-b8ba-135d136c986f.jpg"
      ],
      "datePublished": "2026-02-17T21:08:32.000Z",
      "dateModified": "2026-02-17T21:08:32.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Shein is under investigation in the EU over childlike sex dolls",
    "url": "https://www.bbc.com/news/articles/cr7321n1n0eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6753/live/4ffad1b0-0c2f-11f1-a62a-a37536f5ddff.jpg",
    "tag": "World",
    "date": "2026-02-17T19:08:57.000Z",
    "description": "17 hours agoDearbail JordanBusiness reporterEPAThe European Union (EU) has launched a formal investigation into fast fashion giant Shein over possible",
    "body": "17 hours agoDearbail JordanBusiness reporterEPAThe European Union (EU) has launched a formal investigation into fast fashion giant Shein over possible breaches of digital law, including the sale of childlike sex dolls.The European Commission (EC), the EU's executive arm, said it will examine what systems the Chinese firm has in place to prevent the sale of illegal products \"including content which could constitute child sexual abuse material\".It will also investigate the \"addictive design\" of Shein's platform and the transparency of the system it uses to suggest products and content to shoppers.Shein said: \"Protecting minors and reducing the risk of harmful content and behaviours are central to how we develop and operate our platform.\"Last year, Shein was reported to French authorities for selling \"sex dolls with a childlike appearance\" on its website.The firm said it removed the products immediately, banned the sellers, and removed the sale of sex dolls \"regardless of appearance\" across its global site. It also said it worked with local and international authorities on investigations into both the buyers and sellers of the childlike sex dolls.The Commission said it will investigate the systems Shein uses to limit the sale of illegal products. It said that would include weapons but declined to specify particular items.It has sent a number of requests for information to Shein in the past and EC spokesperson Thomas Regnier told the BBC's World Business Report that Shein was \"very cooperative\". But the EC said that once there were indications that a platform may have systemic risks for its users, the EC could open proceedings to investigate further.Regnier said the EC was concerned about the \"addictive\" nature of Shein's website, and the \"gamification\" of the platform, including its \"rewards programme\" for consumers.He said that the Commission was not against reward programmes per se, but that online platform algorithms were \"often opaque\".\"You don't know how they're being designed [and] you're not in control of what you see,\" he said.The EC will also examine the transparency of so-called \"recommender systems\" which use a shopper's data to push certain products their way. It said that under the Digital Services Act (DSA), Shein must disclosed the main parameters it uses to recommend products and must provide users with \"at least one easily accessible option\" that is not based on using their data to profile their likely purchases. Opening a formal investigation into a company means that the EC can take \"enforcement steps\" such as fines of up to 6% of a company's global sales. In the most recent figures available, Shein reported $38bn in sales for 2024.A spokesperson for Shein said: \"Over the last few months, we have continued to invest significantly in measures to strengthen our compliance with the DSA. \"These include comprehensive systemic-risk assessments and mitigation frameworks, enhanced protections for younger users, and ongoing work to design our services in ways that promote a safe and trusted user experience,\" it said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Shein is under investigation in the EU over childlike sex dolls",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/6753/live/4ffad1b0-0c2f-11f1-a62a-a37536f5ddff.jpg"
      ],
      "datePublished": "2026-02-17T19:08:57.000Z",
      "dateModified": "2026-02-17T19:08:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Sara Duterte: Philippine vice-president to run for president in 2028",
    "url": "https://www.bbc.com/news/articles/cn5g207k7d5o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ce9e/live/17812490-0c81-11f1-8849-7daa23bd5c6c.jpg",
    "tag": "World",
    "date": "2026-02-18T04:09:51.000Z",
    "description": "9 hours agoJoel GuintoGetty ImagesSara Duterte has feuded spectacularly with President Bongbong MarcosPhilippine Vice-President Sara Duterte has decla",
    "body": "9 hours agoJoel GuintoGetty ImagesSara Duterte has feuded spectacularly with President Bongbong MarcosPhilippine Vice-President Sara Duterte has declared her candidacy for president in the 2028 elections.The 47-year-old's announcement comes as she is embroiled in a bitter power struggle with current President Ferdinand \"Bongbong\" Marcos Jr.While the presidential vote is two years away, contenders in the Philippines' largely personality-based elections are known to prepare for years in advance.Marcos is ineligible for re-election and his allies have yet to field a challenger to Duterte - who is also the daughter of his predecessor, former president Rodrigo Duterte.\"I offer my life, my strength, and my future in the service of our nation,\" the vice-president said.\"I am Sara Duterte. I will run for president of the Philippines.\"Marcos and Duterte ran under the same ticket in the 2022 election, which they won by a landslide. But the alliance soon unravelled as they pursued separate political interests.Two months later, a mid-term legislative vote, seen as a barometer of support for the incumbent government, delivered a victory for candidates endorsed by the Duterte family, against those handpicked by Marcos.Just over a week ago, members of the Catholic clergy filed an impeachment complaint against the vice-president over alleged corruption, which she denies.Who is Sara Duterte?Sara is Rodrigo Duterte's eldest daughter and is widely-considered as his political heir.The elder Duterte once described his daughter as the \"alpha\" in their family, the one whom everyone follows.Sara served as vice-mayor to her father when he led Davao city in the 2010s. It was in that southern metropolis that the Duterte's built their reputation for being tough on crime, which they have described as necessary to keep people safe and encourage businesses to grow.Sara was thrust into the national spotlight when, in defence of shanty town dwellers, she punched a Davao sheriff in full view of TV news cameras.She was Davao city mayor when her father was president from 2016 and 2022, and her alliance with Marcos in the 2022 elections was pivotal for both their election victories.The vice-president, like her father, projects a tough image. She rides large motorcycles and has given her children nicknames like Sharky, Stonefish and Stingray. She also shares matching tattoos with her two brothers.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Sara Duterte: Philippine vice-president to run for president in 2028",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ce9e/live/17812490-0c81-11f1-8849-7daa23bd5c6c.jpg"
      ],
      "datePublished": "2026-02-18T04:09:51.000Z",
      "dateModified": "2026-02-18T04:09:51.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "France releases seized Russian 'shadow fleet' tanker after fine paid",
    "url": "https://www.bbc.com/news/articles/c8xy4dl2xwgo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b57c/live/b62e6760-0bfa-11f1-b726-1d6e709ef554.jpg",
    "tag": "World",
    "date": "2026-02-17T14:20:33.000Z",
    "description": "22 hours agoJessica RawnsleyGetty ImagesThe oil tanker, named Grinch, under the watch of the French navy near MarseilleFrance says it has released an ",
    "body": "22 hours agoJessica RawnsleyGetty ImagesThe oil tanker, named Grinch, under the watch of the French navy near MarseilleFrance says it has released an oil tanker suspected of being part of Russia's sanctions-busting \"shadow fleet\" after its owner paid a fine.French Foreign Minister Jean-Noël Barrot said the vessel, Grinch, was \"leaving French waters\" on Tuesday having paid a penalty of \"several million euros\".The tanker was seized by French forces in the Mediterranean in January and then diverted to the port city of Marseille. It had set sail from Murmansk in northern Russia and was flying under a Comoros flag, officials said.Moscow's so-called shadow fleet is a clandestine network of tankers used to evade Western sanctions on Russian oil exports by using aged tankers with obscure ownership or insurance.Many Western countries imposed sanctions on Russian oil after it launched a full-scale invasion of Ukraine in 2022.\"Circumventing European sanctions comes at a price. Russia will no longer be able to finance its war with impunity through a ghost fleet off our coasts,\" Barrot said in a post on X.He added: \"The tanker Grinch will leave French waters after shelling out several million euros and three weeks of costly immobilisation at Fos-sur-Mer. Let's keep it up.\"\"As part of a guilty plea procedure the company that owns the vessel was sentenced by the Marseille judicial court to a financial penalty of confiscation,\" the public prosecutor's office and regional maritime authorities said in a statement.The exact amount the vessel's owner was fined was unclear.While estimates vary, data from the monitoring group TankerTrackers.com suggests the fleet currently consists of 1,468 vessels, roughly triple its size at the time of Russia's full-scale invasion of Ukraine four years ago.The vessels tend to be old and are often poorly maintained. Details of ownership and management are deliberately opaque - names, identification numbers and flags are frequently changed.Efforts have been stepped up to tackle shadow fleets in recent months and a number of sanctioned tankers have been seized.Moscow denounced the move, saying no state had the right to use force against vessels properly registered in other states' jurisdictions.More on this story",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "France releases seized Russian 'shadow fleet' tanker after fine paid",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b57c/live/b62e6760-0bfa-11f1-b726-1d6e709ef554.jpg"
      ],
      "datePublished": "2026-02-17T14:20:33.000Z",
      "dateModified": "2026-02-17T14:20:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "'Difficult' Russia-Ukraine peace talks end without breakthrough",
    "url": "https://www.bbc.com/news/articles/c0k1xj0d708o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ab0c/live/3c186c80-0cba-11f1-9972-d3f265c101c6.jpg",
    "tag": "World",
    "date": "2026-02-18T11:26:11.000Z",
    "description": "1 hour agoLaura GozziReutersRussian, American and Ukrainian representatives met in Geneva on Tuesday and WednesdayTalks between Russia, Ukraine and th",
    "body": "1 hour agoLaura GozziReutersRussian, American and Ukrainian representatives met in Geneva on Tuesday and WednesdayTalks between Russia, Ukraine and the US aimed at ending Moscow's war in Ukraine have concluded without a breakthrough. The trilateral meetings, held in Geneva, went on late on Tuesday but only lasted two hours on Wednesday. Although US envoy Steve Witkoff had expressed optimism over the talks, both the Russian and Ukrainian sides indicated they had been \"difficult.\"Moscow and Kyiv remain far apart on key issues of territory and the terms of a potential ceasefire in the four-year conflict.While conceding talks were challenging, Kremlin negotiator Vladimir Medinsky added that they had been \"businesslike\" and said another meeting would take place \"soon\".Ukrainian President Volodymyr Zelensky also described the negotiations as \"not easy\" due to the difference in the two sides' positions. Ukrainian negotiator Rustem Umerov cut a less downbeat tone, saying the discussions had been \"substantive and intensive\" and that while there had been progress, no details could be disclosed \"at this stage\".\"This is complex work that requires alignment among all parties and sufficient time,\" Umerov said.Shortly before the end of the talks was announced, Zelensky accused Russia of \"trying to drag out negotiations that could already have reached the final stage\".The Russian and Ukrainian delegations last met in US-brokered talks in Abu Dhabi in January, which led to the first prisoner exchange in several months. On Wednesday, Zelensky indicated that another swap might be forthcoming. US President Donald Trump, who spearheaded diplomatic efforts to end the war, has been signalling impatience with the deadlock between the two sides. On Monday, he said Ukraine had \"better come to the table, fast\" - a sentiment Zelensky has since rejected, saying it was \"not fair\" that his country should be the one asked to compromise.Four years on from the start of Russia's full-scale invasion of Ukraine, substantial distance still exists between Moscow's demands and what Kyiv might consider a \"just peace\".Russia has been pushing for full control of Ukraine's eastern Donbas, made up of the Donetsk and Luhansk regions. Kyiv has long rejected this demand, which would mean relinquishing Ukrainian sovereign territory, including several heavily fortified cities and a long defensive line in the region of Donetsk. Many Ukrainians believe giving that territory up would leave the country vulnerable to another Russian invasion. On Tuesday, Zelensky told US media outlet Axios that any plan to hand over the Donbas would be rejected by Ukrainians if it were put to a referendum. Another sticking point in the talks is the status of the Zaporizhzhia Nuclear Power Plant.The power plant – Europe's largest – sits on the front line and has been under Russian control since March 2022. Ukraine wants Moscow to return it and Zelensky has previously said Kyiv could share control of the plant with the Americans - an arrangement Moscow is unlikely to agree to.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "'Difficult' Russia-Ukraine peace talks end without breakthrough",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ab0c/live/3c186c80-0cba-11f1-9972-d3f265c101c6.jpg"
      ],
      "datePublished": "2026-02-18T11:26:11.000Z",
      "dateModified": "2026-02-18T11:26:11.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Robot dog: Galgotias University faces backlash for claiming Chinese product as own at India AI summit",
    "url": "https://www.bbc.com/news/articles/cge8nd5ve00o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2185/live/893b3a10-0cb5-11f1-86b4-33cb5141efc0.jpg",
    "tag": "World",
    "date": "2026-02-18T11:16:28.000Z",
    "description": "1 hour agoCherylann MollanMumbaiGetty ImagesOnline users identified the machine as the Go2 model made by Chinese firm Unitree RoboticsAn Indian univer",
    "body": "1 hour agoCherylann MollanMumbaiGetty ImagesOnline users identified the machine as the Go2 model made by Chinese firm Unitree RoboticsAn Indian university has courted controversy at the AI summit in Delhi after an official claimed that a Chinese-made robotic dog was its own invention.The incident came to light after a professor from Galgotias University told state-run broadcaster DD News that the robot named \"Orion\" was \"developed\" at their Centre of Excellence. A video of her remarks went viral. Online users later identified the machine as the Go2 model made by Chinese firm Unitree Robotics, which is commercially available starting at about 200,000 rupees ($2,200; £1,600).In a statement on Wednesday, the university denied claiming it had built the robot and described the backlash as a \"propaganda campaign\".\"We would like to clearly state that the robotic programming is part of our endeavour to make students learn AI programming and develop and deploy real world skills using globally available tools and resources, given developing AI talent is need of the hour,\" the university said.Neha Singh, the professor seen in the video, later told reporters her remarks had been misunderstood. \"It might be that I could not convey well what I wanted to say, or you could not understand well what I wanted to say,\" she said.Social media users, however, accused the university of dishonesty. Reports said that following the backlash, the university was asked to vacate its stall at the summit. Faculty members said they had received no official communication to do so.But hours later, news agency Press Trust of India reported that electricity supply to the stall was cut off following the controversy.A BBC reporter at the summit said the lights were turned off at the booth and no staff from the university were around.The incident is being seen as an embarrassment for the organisers of the summit as the video had also been shared on IT Minister Ashwini Vaishnaw's official X account. The post has since been deleted.India's IT Secretary S Krishnan said the controversy should not \"overshadow\" the work put in by other participants at the summit.\"What happened should not affect the way people present or exhibit their work at such events. The idea is not to use an opportunity like this to become something else or create unnecessary noise.\"It is essential that a proper code of conduct is followed. There are other countries and other participants involved as well,\" he told reporters.The India AI Impact Summit, inaugurated by Prime Minister Narendra Modi at Bharat Mandapam on Monday, is being pitched by the government as a flagship gathering to position India as a global AI hub. Delegates from more than 100 countries, including several heads of governments, are attending, alongside industry leaders such as Sundar Pichai of Google.The five-day summit features policy discussions, startup showcases and closed-door meetings on AI governance, infrastructure and innovation. However, its opening day was overshadowed by complaints of overcrowding, long queues and confusion at the venue, prompting organisers to extend exhibition hours and tighten entry management. They say arrangements have since improved.BBC correspondent Vikas Pandey, who is at the summit, said the venue was \"absolutely buzzing\" on the third day, with thousands of people from different parts of India visiting stalls and soaking up the excitement. Officials say they hope the event and the conversations around it will help adoption of AI across the country.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Robot dog: Galgotias University faces backlash for claiming Chinese product as own at India AI summit",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/2185/live/893b3a10-0cb5-11f1-86b4-33cb5141efc0.jpg"
      ],
      "datePublished": "2026-02-18T11:16:28.000Z",
      "dateModified": "2026-02-18T11:16:28.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Stephen Colbert says network blocked interview with Democrat James Talarico. CBS denies it",
    "url": "https://www.bbc.com/news/articles/cze0dk3yd5eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8611/live/5895d6b0-0c5e-11f1-ab36-eb9abcfc18cf.jpg",
    "tag": "World",
    "date": "2026-02-18T00:12:01.000Z",
    "description": "Stephen Colbert says CBS spiked interview with Democrat over FCC fears13 hours agoMax MatzaGetty ImagesUS late-night host Stephen Colbert has accused ",
    "body": "Stephen Colbert says CBS spiked interview with Democrat over FCC fears13 hours agoMax MatzaGetty ImagesUS late-night host Stephen Colbert has accused his network of refusing to broadcast an interview with a Democratic politician over fears of retaliation by the Federal Communications Commission (FCC).CBS, the network which hosts the programme, denies that it \"prohibited\" the interview from being aired, saying it gave only \"legal guidance\".On Monday night's show, Colbert said that CBS would not show his interview with Texas lawmaker James Talarico out of concerns about a response from the FCC, which has new guidance on equal airtime for political candidates.\"We were told in no uncertain terms by our network's lawyers, who called us directly, that we could not have him on the broadcast,\" he said.\"Then, then I was told in some uncertain terms that not only could I not have him on, I could not mention me not having him on. And because my network clearly doesn't want us to talk about this, let's talk about this.\"Colbert, host of The Late Show, went on to explain that new FCC guidance on the \"equal time\" rule - which requires certain TV and radio broadcasters to give equal time to rival political candidates - could have created legal trouble for the network, according to CBS lawyers.The FCC regulates radio, TV and satellite airwaves, giving it power over a range of matters, including mergers and decency complaints.CBS flatly denied Colbert's claims in a statement on Tuesday.\"The Late Show was not prohibited by CBS from broadcasting the interview with Rep James Talarico,\" the network said.It added in a statement: \"The show was provided legal guidance that the broadcast could trigger the FCC equal-time rule for two other candidates... and presented options for how the equal time for other candidates could be fulfilled. \"The Late Show decided to present the interview through its YouTube channel with on-air promotion on the broadcast rather than potentially providing the equal-time options.\"The full interview was later posted on YouTube, where FCC rules do not apply.News content has traditionally been exempted from the \"equal time\" rule.But the FCC has said the rule may soon apply to late-night programmes like Colbert's. It may also apply to political radio programmes, which tend to have more conservative hosts and listeners.After issuing the new guidance in January, Brendan Carr, the FCC chairman known for taking an expansive view of his power, said on X that \"for years, legacy TV networks assumed that their late-night & daytime talk shows qualify as 'bona fide news' programmes - even when motivated by purely partisan political purposes. \"Today, the FCC reminded them of their obligation to provide all candidates with equal opportunities.\" US President Donald Trump has at times said he is considering pulling the FCC licence for several US networks that he says have aired views critical of his presidency. Paramount Global, the parent company of CBS, agreed in July to pay $16m (£13.5m) to settle a legal dispute with Trump regarding an interview it broadcast on CBS with former Vice-President Kamala Harris.Business commentators have questioned whether the deal was made partly so as to not affect Paramount's planned merger with Skydance Media, which Trump had the power to halt.CBS News has a partnership agreement with the BBC, meaning news content including video footage can be shared. BBC News is editorially independent of CBS.Anna Gomez, the only Democrat on the FCC board, condemned the response by CBS, saying Colbert and the network had the First Amendment constitutional right to free speech.\"This is yet another troubling example of corporate capitulation in the face of this administration's broader campaign to censor and control speech,\" she said in a statement, adding that the FCC had \"no lawful authority to pressure broadcasters for political purposes\".She continued: \"It is no secret that Paramount, CBS's parent company, has regulatory matters before the government, but corporate interests cannot justify retreating from airing newsworthy content.\"She has previously accused the FCC's Republican leaders of using the equal-time rule to unfairly penalise critics in violation of the constitutional right to free speech. The Late Show is due to end its 33-year run in May. Colbert has been the host since 2015.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Stephen Colbert says network blocked interview with Democrat James Talarico. CBS denies it",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8611/live/5895d6b0-0c5e-11f1-ab36-eb9abcfc18cf.jpg"
      ],
      "datePublished": "2026-02-18T00:12:01.000Z",
      "dateModified": "2026-02-18T00:12:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Rhode Island hockey shooter killed ex-wife and son - police",
    "url": "https://www.bbc.com/news/articles/cy4wvk9vn40o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8d7a/live/d2727c90-0c63-11f1-84c0-b306eb7b8dc2.jpg",
    "tag": "World",
    "date": "2026-02-18T04:50:10.000Z",
    "description": "Suspect in Rhode Island ice hockey shooting killed ex-wife and son 8 hours agoChristal HayesWatch: High school hockey players recount Rhode Island ice",
    "body": "Suspect in Rhode Island ice hockey shooting killed ex-wife and son 8 hours agoChristal HayesWatch: High school hockey players recount Rhode Island ice rink shootingTwo victims shot dead at a high school ice hockey game in Rhode Island have been identified as the suspect's ex-wife and son, police said on Tuesday.Robert Dorgan - who police said also went by the names Roberta Esposito and Roberta Dorgan - was found dead inside the Dennis M Lynch Arena in Pawtucket on Monday, apparently from a self-inflicted gunshot wound after what authorities said was a targeted attack.Dorgan's ex-wife, Rhonda Dorgan, and adult son, Aidan Dorgan, died. Rhonda's mother and father along with a family friend were injured. All three were in a critical condition at hospital.Police have not given a motive, but said it appeared to be a family dispute.Video of the incident showed shots fired while players were on the rink, sparking panic as the teams scrambled to leave the arena, which is located a few miles from the state capital of Providence.Asked at a news conference on Tuesday if the shooting followed a confrontation, Pawtucket Police Chief Tina Goncalves said no.She said two guns recovered from the scene - a Glock 10mm pistol and a SIG Sauer P226 - were legally owned.Goncalves told reporters a bystander \"stepped in and interjected\" and \"that's probably what led to a swift end of this tragic event\".The Boston Globe via Getty ImagesCourt documents show that Rhonda Dorgan filed for divorce from Robert Dorgan, 56, in February 2020. In the petition she wrote \"gender reassignment surgery, narcissistic + personality disorder traits\" as grounds for their divorce. Those words appear to have been crossed out and replaced with \"irreconcilable differences\".That same month, the shooter filed a police report asking authorities to file charges against the father-in-law, alleging he had threatened to have Dorgan killed.His father-in-law was alleged to have used a derogatory term for transgender people. Police filed a criminal charge against the father-in-law, though it was later dismissed.The police chief said officers were combing through thousands of the suspect's social media posts, but added that Dorgan's gender identity was \"irrelevant to the investigation at this point\".\"What I can tell you is the identification was in the name of Robert and then we also know that the suspect went by the name Roberta,\" said Gonclaves on Tuesday. \"It appeared that the suspect was in female clothes yesterday, but again, that's nothing that had swayed the investigation, one way or another.\"A family statement posted for an online fundraiser said: \"Our family has been forever changed by the tragic events at Lynch Arena.\" It added: \"In addition to this unimaginable loss, their grandparents are currently in critical condition, fighting for their lives.\"General Dynamics Bath Iron Works, a naval contractor based in Bath, Maine, confirmed that Dorgan was one of its employees.The company said in a statement: \"We extend our deepest sympathies to the victims, their families, and all those affected by this tragedy.\"Authorities have spoken to dozens of witnesses to the attack. Many families were watching the game and ran in fear as gunfire broke out.Melissa Dunn, whose son played for one of the hockey teams, said she saw paramedics performing CPR in the stands of the arena after she ran back inside to find her son.\"You don't know what's going on at first,\" Dunn said. \"You just hear the loud noises. And we're used to the kids banging on the board with their skates, so we thought it was that at first.\"She said she screamed for her son to duck and avoid gunfire.\"We ran out of the rink… your first thought is 'where's my kid?'\" she said. \"I tried to get back in the rink, and I actually got back in there to find out where he was, and I saw them doing CPR in the stands and it was just really disturbing.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Rhode Island hockey shooter killed ex-wife and son - police",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8d7a/live/d2727c90-0c63-11f1-84c0-b306eb7b8dc2.jpg"
      ],
      "datePublished": "2026-02-18T04:50:10.000Z",
      "dateModified": "2026-02-18T04:50:10.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Ex-Zambian President Edgar Lungu's family dismiss allegations he was poisoned - lawyers",
    "url": "https://www.bbc.com/news/articles/ckg18yqwlplo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/eb73/live/6c8f2a30-0c1e-11f1-810d-f3e42df83b46.jpg",
    "tag": "World",
    "date": "2026-02-17T17:04:07.000Z",
    "description": "Family of Zambia's ex-President Lungu dismiss poisoning allegation - lawyers20 hours agoKhanyisile NgcoboJohannesburgPhotothek/Getty ImagesEdgar Lungu",
    "body": "Family of Zambia's ex-President Lungu dismiss poisoning allegation - lawyers20 hours agoKhanyisile NgcoboJohannesburgPhotothek/Getty ImagesEdgar Lungu's body remains in South Africa as a legal battle over his burial continuesThe family of ex-Zambian President Edgar Lungu, who died in South Africa last June and is yet to be buried, have dismissed allegations he was poisoned.South African police also want custody of his body as part of their investigations, according to the late politician's family.In a letter to the police, seen by the BBC, their lawyers say the family are co-operating with \"criminal proceedings\", but maintain the allegations are \"unfounded and unsupported by credible evidence\".It is the latest twist over the fate of Lungu's body, which remains in a morgue in South Africa and has been subject to an ongoing legal battle between his family and Zambia's government over where he should be buried.South Africa's police service has refused to comment on the letter sent by the Johannesburg law firm Mashele Attorneys, which is representing the Lungu family.Police spokesperson Brig Athlenda Mathe told the BBC: \"This is a very sensitive matter that cannot be discussed at this stage.\"Lungu died of an undisclosed illness aged 68 at a clinic in South Africa's capital, Pretoria. He had led Zambia from 2015 until 2021, when he lost elections by a huge margin to current President Hakainde Hichilema.The Zambian government wants Lungu's remains to be repatriated and given a state funeral, with full state honours - and a South African court ruled in its favour in August.But Lungu's family want a private burial in South Africa as they say the former president had not wanted Hichilema to attend his funeral. The relationship between the two politicians had long been fraught.In the letter to the South African police, dated 11 February 2026, Mashele Attorneys confirmed that on behalf of the Lungu family it had \"complied with the five subpoenas issued\" in relation to a criminal probe looking into allegations that the former Zambian president was poisoned.\"For the avoidance of doubt, it is our clients' instruction that the allegations underlying the criminal case are denied,\" the letter said.Neo Mashele, from Mashele Attorneys, told the BBC the investigation by police appeared to be based on a \"public utterance\" about a poisoning allegation made by one of Lungu's daughters that was \"absolutely not true\".In its letter, Mashele Attorneys also raised concern over another subpoena it said had been issued by police to the funeral home looking after Lungu's body.It said there were two High Court orders that directed that \"possession and custody of the body remain with Two Mountains Funeral Services pending the finalisation of the legal proceedings\".\"Those orders are binding and operative,\" the letter said.An official from the morgue where the remains are being stored told the BBC that Lungu's body was \"under tight security [and] surveillance 24/7\".Mrs Lungu has remained in South Africa since the death of her husband and is leading legal efforts to have him buried in South Africa.Additional reporting by Nomsa MasekoYou may also be interested in:Getty Images/BBCBBC Africa podcasts",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Ex-Zambian President Edgar Lungu's family dismiss allegations he was poisoned - lawyers",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/eb73/live/6c8f2a30-0c1e-11f1-810d-f3e42df83b46.jpg"
      ],
      "datePublished": "2026-02-17T17:04:07.000Z",
      "dateModified": "2026-02-17T17:04:07.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "First day of US-brokered Russia-Ukraine peace talks ends in Geneva",
    "url": "https://www.bbc.com/news/articles/cge812y2549o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c289/live/ed9669b0-0be5-11f1-8d90-772c0d7aea09.jpg",
    "tag": "World",
    "date": "2026-02-17T20:05:13.000Z",
    "description": "17 hours agoHafsa KhalilandLaura GozziState Emergency Service of Ukraine/Anadolu via Getty ImagesUkrainian firefighters search through the rubble afte",
    "body": "17 hours agoHafsa KhalilandLaura GozziState Emergency Service of Ukraine/Anadolu via Getty ImagesUkrainian firefighters search through the rubble after Russian attacks on residential areas of the north-eastern Ukrainian city of SumyRussian and Ukrainian delegations have ended the first day of US-brokered peace talks in Geneva, a week before the fourth anniversary of Moscow's full-scale invasion of Ukraine.Top Ukrainian negotiator Rustem Umerov said the negotiations would continue in the Swiss city on Wednesday morning.Hopes for a breakthrough during the latest - third - round of trilateral talks are low, as the Kremlin has not wavered from its maximalist demands for Ukrainian territory.Russian strikes on Ukraine continue on a nightly basis, further damaging the country's already battered power grid as subzero temperatures continue.Just hours before the delegations met in Geneva, Russia carried out a large combined aerial attack on Ukraine, hitting 12 regions with 400 drones and almost 30 missiles. At least three people were killed, Ukrainian officials said.Meanwhile, Russia said its air defences had repelled more than 150 drones, while an oil refinery caught on fire after a Ukrainian drone strike.Rustem Umerov/TelegramUkraine's top negotiator Rustem Umerov posted a photo of the teams from Ukraine (right), Russia (left) and the US (centre) at the start of the talks in GenevaIn a statement on social media on Tuesday evening, Umerov, Ukraine's top security official, said the talks focused on \"practical issues and the mechanics of possible solutions\".He said he would now inform Ukrainian President Volodymyr Zelensky about the results.In his video address shortly afterwards, Zelensky said Ukraine was ready to refrain from carrying out strikes as earlier proposed by the US to both Kyiv and Moscow.\"We don't need war,\" he said, stressing that Ukrainians were \"defending our state, our independence\".\"We are also ready to quickly move towards a worthy agreement to end the war. The question is only for the Russians: what do they want?\"Meanwhile, Russia's state RIA news agency quoted a source saying that Tuesday's negotiations, which lasted six hours, had been tense and took place in different bilateral and trilateral formats. The talks are being mediated by Steve Witkoff, Donald Trump's special envoy, and Jared Kushner, the US president's son-in-law.On the Russian side, President Vladimir Putin's aide Vladimir Medinsky is the top negotiator.Both Ukraine and Russia also had senior military figures in their teams.Ahead of the talks, Trump said Ukraine had \"better come to the table fast.\"He has previously signalled his impatience with the lack of swift progress in solving the four-year conflict. Russia occupies roughly 20% of Ukraine, including large parts of the eastern Donbas region. The Kremlin wants Ukraine to hand over the rest of the region, which Ukraine has ruled out. For Ukraine, robust security guarantees from the West - including the US - must come before any settlement with Russia can be agreed.In Kyiv, Ukrainian Foreign Minister Andrii Sybhiha condemned the overnight Russian strikes, saying they showed the \"extent to which Russia disregards peace efforts\".At least three energy workers were killed near the frontline city of Slovyansk in Monday's overnight attacks, Ukraine's deputy Energy Minister Artem Nekrasov said. A further nine people - including children - were injured across the country, President Zelensky said. More than 10 residential buildings were damaged, with railway infrastructure also damaged. \"Russia must be held to account for its aggression,\" he wrote on X, adding: \"For peace to be real and just, action must target the sole source of this aggression\".Kyiv said 12 regions were hit, damaging infrastructure and leaving thousands without power in the southern port city of Odesa. DTEK, the country's largest private energy firm, said power infrastructure in the city had suffered \"incredibly serious\" damage, adding it would take a long time to return to a working condition. Ukraine is facing an acute energy crisis after months of relentless Russian attacks on its infrastructure and as it struggles through a freezing winter. It launched its own volley of attacks on Russia overnight. Officials said a fire broke out at the Ilsky oil refinery in the southern Krasnodar region after a drone strike. A reservoir storing oil products also caught fire.The border region of Belgorod continued to come under attack, with Ukraine launching dozens of drones and causing significant damage of power infrastructure. These latest discussions follow last month's trilateral talks in Abu Dhabi, which were the first three-way between Russia, Ukraine and the US since Moscow launched its full-scale invasion of its neighbour in February 2022.They ended with no breakthrough - although the first prisoner of war exchanges in months took place shortly after.Additional reporting by Jaroslav Lukiv",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "First day of US-brokered Russia-Ukraine peace talks ends in Geneva",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c289/live/ed9669b0-0be5-11f1-8d90-772c0d7aea09.jpg"
      ],
      "datePublished": "2026-02-17T20:05:13.000Z",
      "dateModified": "2026-02-17T20:05:13.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Iran says 'guiding principles' agreed with US at nuclear talks",
    "url": "https://www.bbc.com/news/articles/cwyknjnd706o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1ec3/live/b50ab7a0-0be9-11f1-8d90-772c0d7aea09.png",
    "tag": "World",
    "date": "2026-02-17T21:38:33.000Z",
    "description": "15 hours agoPeter Bowes,North America correspondentandChris GrahamReutersThe talks are taking place in the Omani mission building in GenevaIran has sa",
    "body": "15 hours agoPeter Bowes,North America correspondentandChris GrahamReutersThe talks are taking place in the Omani mission building in GenevaIran has said it has reached an understanding with the US on the main \"guiding principles\" to resolve their dispute over Tehran's nuclear programme.Speaking after indirect talks in Geneva, Iranian Foreign Minister Abbas Araghchi added that work still needed to be done. The US said \"progress was made\".Badr Albusaidi, foreign minister of mediator Oman, said the negotiations \"concluded with good progress towards identifying common goals and relevant  technical issues\". The meeting followed repeated US military threats against Iran over its deadly crackdown on anti-government protests and its nuclear activities. President Donald Trump had earlier said he believed Iran wanted to make a deal.The US and its European allies suspect that Iran is moving towards the development of a nuclear weapon, something that Tehran has always denied.Before Tuesday's talks at the residence of Oman's ambassador in the Swiss city, Iran stated that it would focus on its nuclear programme and the potential lifting of economic sanctions imposed by the US. Washington has previously indicated it wanted to discuss other issues as well, such as Iran's missile development.It was not immediately known what range of issues were discussed in Geneva but a US official told the BBC: \"Progress was made, but there are still a lot of details to discuss. The Iranians said they would come back in the next two weeks with detailed proposals to address some of the open gaps in our positions.\"When asked about the talks in an interview with Fox News, US Vice-President JD Vance said: \"In some ways, it went well; they agreed to meet afterwards. But in other ways, it was very clear that the president has set some red lines that the Iranians are not yet willing to actually acknowledge and work through.\"Framing the talks as \"very important\", US President Donald Trump had earlier said he would be \"indirectly\" involved and suggested Tehran was motivated this time to negotiate. \"I don't think they want the consequences of not making a deal,\" Trump told reporters aboard Air Force One, adding that Iran learned the consequences of a tough posture in talks last summer when the US bombed Iranian nuclear sites. \"We could have had a deal instead of sending the B-2s in to knock out their nuclear potential. And we had to send the B-2s,\" he said, referring to the stealth bombers that carried out the bombings. \"I hope they're going to be more reasonable.\"Trump's threats come amid a US military build-up in the Middle East over the past few weeks. The US has also reportedly sent the USS Gerald R Ford, the world's largest warship, to the Middle East, which could arrive in the region within the next three weeks.Speaking on Tuesday, Iran's supreme leader Ayatollah Ali Khamenei responded to Trump's threats of military action by saying: \"More dangerous than an aircraft carrier is the weapon that can send it to the bottom of the sea.\"He says the US's army is the strongest army in the world. The 'strongest army in the world' may sometimes receive such a blow that it cannot get back up.\"Khamenei also accused the US of attempting to predetermine the outcome of negotiations and said that would be a \"wrong and foolish thing to do\".In addition to the Abraham Lincoln's arrival, BBC Verify has also tracked an increase of US destroyers, combat ships and fighter jets in the region.Iran's Foreign Minister Abbas Araghchi met with the UN nuclear watchdog chief on Monday, saying in a post on X he was in Geneva to \"achieve a fair and equitable deal\".\"What is not on the table: submission before threats,\" Araghchi said.ReutersThe US military released an image of the Lincoln carrier strike group in the Arabian Sea in FebruaryIran has responded to the US build-up with its own show of force. On Monday the Islamic Revolutionary Guard Corps (IRGC) launched a maritime drill in the Strait of Hormuz, located in the Gulf between Oman and Iran. The Strait is considered a vital international waterway and oil export route from Gulf Arab states. US Secretary of State Marco Rubio said that reaching a deal with Tehran would be \"very difficult\".\"I think that there's an opportunity here to diplomatically reach an agreement... but I don't want to overstate it either,\" Rubio said during a visit to Hungary. \"It's going to be hard.\"Additional reporting by Ghoncheh Habibiazad, BBC Persian",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Iran says 'guiding principles' agreed with US at nuclear talks",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1ec3/live/b50ab7a0-0be9-11f1-8d90-772c0d7aea09.png"
      ],
      "datePublished": "2026-02-17T21:38:33.000Z",
      "dateModified": "2026-02-17T21:38:33.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]