[
  {
    "title": "At least two dead in explosion at Pennsylvania nursing home",
    "url": "https://www.bbc.com/news/articles/ce3wry1529wo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/8773/live/345c7c80-e04f-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "World",
    "date": "2025-12-24T01:37:29.000Z",
    "description": "At least two people have died and several others were injured after an explosion and fire at a Pennsylvania nursing home caused a partial collapse of ",
    "body": "At least two people have died and several others were injured after an explosion and fire at a Pennsylvania nursing home caused a partial collapse of the building.Emergency crews were called to the Silver Lake Nursing Home in Bristol at about 14:00 local time (19:00GMT) on Tuesday after receiving reports of a gas odour. When crews arrived, the building exploded causing a massive fire, authorities said.Five people were still unaccounted for, but officials said they were unsure if those people were in the building.Responders pulled residents out of windows, stairwells, and elevators and carried them to safety, fire chief Kevin Dippolito told reporters. \"There was one police officer who literally threw two people over his shoulders and ran\" with them towards medical staff, he said. Several people were trapped in the basement of the collapsed building but were rescued, Dippolito said.\"We're still in rescue mode. We have not transitioned into a recovery mode,\" he said.Emergency crews were still working to rescue people who may be stuck in the building, the fire chief said.Governor Josh Shapiro said the exact number of injuries was not yet known, and the cause of the blast remained under investigation.Images and videos posted on social platforms by local media outlets show a partially collapsed building with massive flames billowing out of it.Shapiro praised the support from authorities around the region who rushed to offer assistance, and said that the residents living near the nursing home were \"outstanding\". \"We had residents coming out of their houses offering to help us,\" he said. \"This is the Pennsylvania way: neighbors helping neighbors in a moment of need.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "At least two dead in explosion at Pennsylvania nursing home",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/8773/live/345c7c80-e04f-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-24T01:37:29.000Z",
      "dateModified": "2025-12-24T01:37:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Libya's army chief killed in air crash in Turkey",
    "url": "https://www.bbc.com/news/articles/cyvgzyepdqno?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/22bb/live/8697f930-e044-11f0-a9a2-693a1a1aa5e1.jpg",
    "tag": "World",
    "date": "2025-12-24T09:27:31.000Z",
    "description": "The Libyan army chief has been killed in an air crash in Turkey, Libya's prime minister has said.Gen Mohammed Ali Ahmed al-Haddad was on board a Falco",
    "body": "The Libyan army chief has been killed in an air crash in Turkey, Libya's prime minister has said.Gen Mohammed Ali Ahmed al-Haddad was on board a Falcon 50 aircraft flying out of the Turkish capital, Ankara, on Tuesday evening. He was killed along with four other military officials and three crew members.Turkish Interior Minister Ali Yerlikaya said signal with the business jet was lost at 20:52 local time (17:52 GMT) - about 42 minutes after it took off from Ankara's airport. The Tripoli-bound jet had issued an emergency landing request before contact was lost. The aircraft's wreckage was later found south-west of Ankara, and its voice recorder and black box had been recovered.The emergency services are still trying to retrieve the bodies. An investigation is under way into what caused the crash.In a post on X, Yerlikaya wrote that police had spotted the debris near the village of Kesikkavak, in the Haymana district.In Libya, Abdul Hamid Dbeibeh, the prime minister of the country's internationally-recognised Government of National Unity (GNU), said he had received news of the deaths of Gen Haddad and other senior Libyan military officials on board the jet.The prime minister called it a \"great loss\" for the nation, saying Libya had \"lost men who served their country with sincerity and dedication\".Gen Haddad and his team had been in Turkey for talks aimed at further strengthening military and security co-operation between the two countries.Turkey has played an increasingly dominant role in Libya after intervening in 2019 to prevent an army from the east of the country driving out the internationally-recognised government in Tripoli, and has built close political, military and economic ties.Libya's rival Government of National Stability (GNS) in the east of the country is run by military strongman Khalifa Haftar. The north African has been battered by many armed groups who emerged after the overthrow of Muammar Gaddafi in 2011.A series of armed uprisings that led to the long-time dictator's killing created a security vacuum, with much of the country lawless and chaotic since.Additional reporting  by Farouk Chothia",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Libya's army chief killed in air crash in Turkey",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/22bb/live/8697f930-e044-11f0-a9a2-693a1a1aa5e1.jpg"
      ],
      "datePublished": "2025-12-24T09:27:31.000Z",
      "dateModified": "2025-12-24T09:27:31.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Australia to deport British man charged with displaying Nazi symbols",
    "url": "https://www.bbc.com/news/articles/cgke51rzpvro?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/10c7/live/ce7bd6b0-e060-11f0-b67b-690eb873de1b.jpg",
    "tag": "World",
    "date": "2025-12-24T00:25:04.000Z",
    "description": "12 hours agoLana LamSydneyAustralian Federal PolicePolice arrested and charged the British man, 43, earlier this monthA British national in Australia ",
    "body": "12 hours agoLana LamSydneyAustralian Federal PolicePolice arrested and charged the British man, 43, earlier this monthA British national in Australia has had his visa cancelled and faces deportation for allegedly displaying Nazi symbols.The 43-year-old man living in Queensland was arrested and charged earlier this month, after allegedly using a social media account to post the Nazi swastika, promote pro-Nazi ideology and call for violence towards the Jewish community.The man was taken into immigration detention this week in Brisbane and is due to face court in January. Police have been cracking down on the use of prohibited symbols amid a recent rise in antisemitism and right-wing extremism.Home Affairs Minister Tony Burke said: \"He came here to hate - he doesn't get to stay.\"\"If you come to Australia on a visa, you are here as a guest,\" Burke told the Australian Broadcasting Corporation (ABC) on Wednesday.Last month, Burke also revoked the visa of Matthew Gruter, a South African national who had been living in Australia since 2022, after he was seen attending a neo-Nazi rally in front of the New South Wales parliament. Like Gruter, the British man can appeal his visa being revoked. He can leave Australia voluntarily or wait to be deported to his home country. It is understood police are assessing whether to delay deporting the man so he can face court next month.The BBC has contacted the UK Foreign Office for comment.Earlier this year, Australia tightened its hate crime laws, introducing mandatory jail terms for displaying hate symbols or performing a Nazi salute.Police began investigating the British man in October over alleged posts on X. The social media platform blocked his account, prompting him to create a new one with a similar name where he continued posting offensive and harmful content, police said. Australian Federal PolicePolice seized weapons including axes and knives from the British man's homeAuthorities searched the man's home in Caboolture, on the outskirts of Brisbane, in late November and seized phones, weapons and several swords with swastika symbols. He was charged with three counts of displaying banned Nazi symbols and one count  of using the internet to cause offense.\"We want to ensure these symbols are not being used to fracture social cohesion,\" Australian Federal Police Assistant Commissioner Stephen Nutt said earlier this month.  \"If we identify instances where this is happening, we will act swiftly to disrupt the behaviour, prosecute those involved and protect the dignity, safety and cohesion of our diverse community.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Australia to deport British man charged with displaying Nazi symbols",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/10c7/live/ce7bd6b0-e060-11f0-b67b-690eb873de1b.jpg"
      ],
      "datePublished": "2025-12-24T00:25:04.000Z",
      "dateModified": "2025-12-24T00:25:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Venezuela accuses US of 'extortion' over seizure of oil tankers",
    "url": "https://www.bbc.com/news/articles/cd749gqgg11o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c219/live/46dd06e0-e0b8-11f0-a5d4-dbc340b0ceeb.jpg",
    "tag": "World",
    "date": "2025-12-24T09:46:14.000Z",
    "description": "Venezuela has accused the United States of the \"greatest extortion\" at an emergency session of the UN Security Council in New York.  Washington's seiz",
    "body": "Venezuela has accused the United States of the \"greatest extortion\" at an emergency session of the UN Security Council in New York.  Washington's seizure of two Venezuelan oil tankers was \"worse than piracy,\" the Venezuelan ambassador to the UN said. The emergency meeting of the Security Council was called to discuss the seizure of the tankers, which took place off the coast of Venezuela earlier this month. The US has also said it was pursuing a third Venezuelan oil tanker. President Trump has accused Venezuela's President Nicolas Maduro of leading a drugs cartel and said gangs had operated with impunity for too long.On 16 December, Trump ordered a naval blockade of all sanctioned oil tankers entering and leaving Venezuela. The US president has said the US will keep or sell the crude oil it has taken, as well as the vessels themselves.The US has been building up its military presence in the Pacific and Caribbean Seas in recent months, sending 15,000 troops and a range of aircraft carriers and warships to the area. It is the largest deployment to the region since the US invaded Panama in 1989, and the stated aim is to stop the flow of fentanyl and cocaine to the US.The US has carried out strikes on what it says are Venezuelan drug-smuggling boats, targeting more than 20 vessels and killing at least 100 people. Some experts say the strikes could violate laws governing armed conflict.Venezuela's envoy to the UN said the US was subjecting his country to the \"greatest extortion\" in its history. Speaking at the UN Security Council meeting on Tuesday, Samuel Moncada said \"we are in the presence of a power that acts outside of international law, demanding that Venezuelans vacate our country and hand it over.\"Regarding the US seizure of Venezuelan oil, he added: \"We are talking about pillaging, looting and recolonisation of Venezuela. \"The government of the United States does not have jurisdiction in the Caribbean.\"Referring to the Venezuelan oil industry, he said: \"What does that have to do with drugs?\"In response, the US Ambassador to the UN, Michael Waltz, told the Security Council the US does not recognise Mr Maduro as the legitimate leader of Venezuela.\"Maduro's ability to sell Venezuela's oil enables his fraudulent claims to power and his narco-terrorist activities,\" Mr Waltz said. On a visit to a trade fair in Caracas, President Maduro said \"the Security Council is giving overwhelming support to Venezuela.\"Russia and China accused the US of bullying and aggression.The US was \"illegally destroying\" civilian vessels in the Caribbean Sea, the Russian ambassador to the UN, Vassily Nebenzia, told the UN meeting. He warned that other countries could be next. The US actions against Venezuelan vessels, he said, were \"a template for future acts of force against Latin American states.\"Meanwhile, China's envoy to the UN, Sun Lei, called on the US to \"immediately halt relevant actions and avoid further escalation of tensions.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Venezuela accuses US of 'extortion' over seizure of oil tankers",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c219/live/46dd06e0-e0b8-11f0-a5d4-dbc340b0ceeb.jpg"
      ],
      "datePublished": "2025-12-24T09:46:14.000Z",
      "dateModified": "2025-12-24T09:46:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Border villagers abducted and taken to Russia, says Ukraine",
    "url": "https://www.bbc.com/news/articles/czxpz05yj5po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/e2f3/live/e4b4b220-e09d-11f0-89c4-35dd66915c88.jpg",
    "tag": "World",
    "date": "2025-12-24T09:07:52.000Z",
    "description": "3 hours agoVitaly ShevchenkoBBC Monitoring Russia editorFrancisco Richart/SOPA Images/LightRocketUkraine's police evacuation group White Angels evacua",
    "body": "3 hours agoVitaly ShevchenkoBBC Monitoring Russia editorFrancisco Richart/SOPA Images/LightRocketUkraine's police evacuation group White Angels evacuates civilians from the village of Krasnopillya in Sumy regionFifty-two residents of a Ukrainian village have been taken to Russia by invading forces in a cross-border raid on the village of Hrabovske, authorities in Kyiv say. Thirteen Ukrainian soldiers were also captured in the border village in the northeastern Sumy region.The attack occurred at night on Saturday, when about 100 Russian troops attacked the village, said Viktor Trehubov, a spokesman for Ukraine's military Joint Forces Task Force. The civilians were first rounded up in a church and then taken across the border to Russia, he told the BBC.It was unusual for invading forces to take civilians to Russia before establishing a firm presence in occupied territory, he added.Russia has so far not commented on the fate of civilians from Hrabovske, but reports from Ukraine indicate they may have been taken to Belgorod, a major regional centre about 50 miles (80 km) inside Russia.\"My friends' mother has been taken there. There is no way of contacting her even though they tried,\" said Volodymyr Bitsak, a member of the Sumy regional council. \"As far as I know, they've been taken to the city of Belgorod and are being held at an unknown location.\"Lt-Col Trehubov told the BBC on Tuesday evening that fighting was still ongoing in the southern part of Hrabovske, but Deep State, a Ukrainian website monitoring the battlefield situation, said later that the village had been captured by Russian forces.The defence ministry in Moscow said on Tuesday that Ukrainian forces had been \"hit\" at Hrabovske and several other villages in Sumy region.Meanwhile, in the eastern region of Donetsk, the Ukrainian military said it had withdrawn troops from the embattled town of Siversk \"to preserve the lives of our soldiers\".Russia's capture of the town brings its forces closer to the Donetsk \"fortress belt cities\" of Sloviansk and Kramatorsk, about 35km (21 miles) to the west.Ukrainian authorities have been working to move civilians away from parts of the Sumy region bordering Russia. But Viktor Babych, a deputy head of the Sumy regional administration, says 56% of residents in border areas are refusing to be leave, and 32,000 civilians including 604 children remain there.Most of the 52 civilians captured in the cross-border raid on Hrabovske were elderly people who had refused official evacuation orders.\"It was a smash and grab,\" said Lt-Col Trehubov. \"They quickly rounded everyone up and quickly removed them. This had never happened before. We had never had such raids before.\"However, Ukrainian President Volodymyr Zelensky said children had been captured too.\"I'm surprised there were children. I'm simply surprised that parents treated their children like that,\" Zelensky told reporters. \"I think they simply did not expect to be taken [to Russia] by Russian military.\"The vast majority of civilians had already been evacuated from the village, whose pre-war population is reported to be about 700 people.Ukraine's ombudsman Dmytro Lubinets says the civilians \"were held incommunicado and in improper conditions\" by Russian troops invading Hrabovske before being taken out of Ukraine.\"Such actions are a serious violation of international humanitarian law. They violate the laws and customs of war by unlawfully detaining and forcefully deporting civilians,\" he says.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Border villagers abducted and taken to Russia, says Ukraine",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/e2f3/live/e4b4b220-e09d-11f0-89c4-35dd66915c88.jpg"
      ],
      "datePublished": "2025-12-24T09:07:52.000Z",
      "dateModified": "2025-12-24T09:07:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Brazil's Supreme Court allows Bolsonaro to leave prison for surgery",
    "url": "https://www.bbc.com/news/articles/c8dy3mvye62o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/16ff/live/4839b580-e05c-11f0-a8dc-93c15fe68710.jpg",
    "tag": "World",
    "date": "2025-12-24T01:10:19.000Z",
    "description": "Brazil's former president Jair Bolsonaro has been permitted to leave prison to undergo surgery on Christmas Day following approval from Brazil's Supre",
    "body": "Brazil's former president Jair Bolsonaro has been permitted to leave prison to undergo surgery on Christmas Day following approval from Brazil's Supreme Court, court documents show.Bolsonaro is currently serving a 27-year prison sentence for plotting a coup after he lost the last election in 2022.Justice Alexandre de Moraes on Tuesday granted permission for Bolsonaro to temporarily leave prison and be transferred to a hospital on Wednesday for a hernia operation on 25 December.Bolsonaro, 70, has faced ongoing health complications since being stabbed in the abdomen during a 2018 presidential campaign.In April, the right-wing former president underwent intestinal surgery. By November, Justice Moraes, who also oversaw his trial, mandated that Bolsonaro be given full-time medical care. Flávio Bolsonaro, the former president's son, posted a video to X on Wednesday with the caption: \"Keep praying for the president.\"Bolsonaro was found guilty in September for plotting a coup d'etat after he lost the 2022 election to his left-wing rival, Luiz Inácio Lula da Silva.The former leader is serving his sentence in a federal police jail in Brasilia, the capital, after being deemed a flight risk and removed from home detention.Earlier this month, tens of thousands of people in Brazil's main cities gathered to protest against a bill trying to significantly reduce the time Bolsonaro spends in jail.Lawmakers passed the bill last week after it was approved by the lower house. Legal experts have estimated it could reduce Bolsonaro's sentence to less than three years.  In response, Brazil's president Lula promised to veto the bill.\"With all due respect to the Congress, when it reaches my desk, I will veto it,\" Lula told journalists last week, while acknowledging his veto could be overridden by the largely conservative Congress.US President Donald Trump, who had previously called the investigation into Bolsonaro a \"witch hunt\", welcomed the bill being passed. The US also lifted sanctions that had been placed on Justice Moraes in July.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Brazil's Supreme Court allows Bolsonaro to leave prison for surgery",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/16ff/live/4839b580-e05c-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-24T01:10:19.000Z",
      "dateModified": "2025-12-24T01:10:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Bondi shooting: Injured officer Jack Hibbert released from hospital",
    "url": "https://www.bbc.com/news/articles/cd0kxrr2jyko?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/379f/live/2724ffe0-dfbb-11f0-a8dc-93c15fe68710.jpg",
    "tag": "World",
    "date": "2025-12-23T06:06:34.000Z",
    "description": "'A miracle': Officer shot in head during Bondi attack home from hospital1 day agoYang TianSydneyPA MediaJack Hibbert had been working as a police offi",
    "body": "'A miracle': Officer shot in head during Bondi attack home from hospital1 day agoYang TianSydneyPA MediaJack Hibbert had been working as a police officer for just months before he was shotA young police officer who was shot in the head during the Bondi Beach attack has been released from hospital.Probationary Constable Jack Hibbert - who is just four months into the job - was patrolling a Hanukkah event when two gunmen opened fire, injuring over 40 people and killing 15.The 22-year-old, who was also hit in the shoulder, has lost vision in one of his eyes but is now recovering at home, his family confirmed in a statement.\"As a family, we couldn't ask for anything more - having our Jack home, especially for Christmas, truly feels like a miracle.\"They thanked the public for their \"overwhelming support\" and praised medical staff for their \"exceptional\" care and dedication.\"While he is home, he is still recovering and will need space, support, and continued positive thoughts during this time,\" the statement added.Even after he was shot during the attack, Constable Hibbert continued to help festival attendees until he physically could no longer do so, his family previously said.\"Many of his colleagues who were present on the night of the incident have visited in hospital and given testaments to Jack's bravery during the incident... They described how Jack acted, he moved toward people in need, not away from danger,\" they said.He was one of two police officers injured in the shooting, with the second officer Constable Scott Dyson, 25, still recovering from his injuries in hospital, according to the last police update.Last week, NSW Police Commissioner Mal Lanyon visited Constable Hibbert in hospital, praising him as a \"positive young man\".Lanyon added that the force would rally around Constable Hibbert and find \"appropriate duties for him\" after his recovery.Police have alleged the suspected gunmen were inspired by Islamic State ideology and targeted the Jewish festival in what has been declared a terror attack.Naveed Akram, 24, has been charged with 59 offences, including 15 counts of murder and one of terror. A second gunman - his father, Sajid Akram - was shot dead by police at the scene.On Monday, new court documents alleged the pair \"meticulously\" planned the attack for months, and two days prior to the shooting, visited Bondi for reconnaissance.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Bondi shooting: Injured officer Jack Hibbert released from hospital",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/379f/live/2724ffe0-dfbb-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-23T06:06:34.000Z",
      "dateModified": "2025-12-23T06:06:34.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Nigeria kidnappings: Gunmen abduct Muslim travellers in Plateau state",
    "url": "https://www.bbc.com/news/articles/czj0ll7ppewo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/41bf/live/762f22e0-dfe9-11f0-a8dc-93c15fe68710.jpg",
    "tag": "World",
    "date": "2025-12-23T14:10:19.000Z",
    "description": "A journalist based in Plateau state said the families of the latest victims had begun receiving ransom demands.The police have not said anything about",
    "body": "A journalist based in Plateau state said the families of the latest victims had begun receiving ransom demands.The police have not said anything about the identity of the possible perpetrators.Kidnapping for ransom by criminal gangs, known locally as bandits, has become common across parts of northern and central Nigeria.Although the handing over of cash in order to release those being held is illegal, it is thought that this is how many cases are resolved and seen as a way for these gangs to raise money. The incident in Plateau state is unrelated to the long-running Islamist insurgency in the country's north-east, where jihadist groups have been battling the state for more than a decade.The insecurity in Nigeria received renewed international attention in November after US President Donald Trump threatened to send troops to \"that now disgraced country, 'guns-a-blazing'\". He alleged that Christians were being targeted.Nigeria's federal government has acknowledged the security problems but has denied that Christians are being singled out.On Monday, Information Minister Mohammed Idris said that recent tensions with the US over insecurity and alleged persecution of Christians had been \"largely resolved\", resulting in stronger relations with Washington.He added that trained and equipped forest guards will be deployed to secure forests and other remote areas used as hideouts by criminal groups to supplement army operations.Additional reporting by Abayomi Adisa and BBC Monitoring",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Nigeria kidnappings: Gunmen abduct Muslim travellers in Plateau state",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/41bf/live/762f22e0-dfe9-11f0-a8dc-93c15fe68710.jpg"
      ],
      "datePublished": "2025-12-23T14:10:19.000Z",
      "dateModified": "2025-12-23T14:10:19.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US economy grows at fastest pace in two years ",
    "url": "https://www.bbc.com/news/articles/c62n9ynzrdpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9d97/live/e58720c0-e002-11f0-ab61-73a5e79bafa0.jpg",
    "tag": "World",
    "date": "2025-12-23T15:56:57.000Z",
    "description": "21 hours agoNatalie ShermanBusiness reporterBloomberg via Getty ImagesThe US economy picked up speed over the three months to September, as consumer s",
    "body": "21 hours agoNatalie ShermanBusiness reporterBloomberg via Getty ImagesThe US economy picked up speed over the three months to September, as consumer spending jumped and exports increased. The world's largest economy expanded at an annual rate of 4.3%, up from 3.8% in the previous quarter. That was better than expected, and marked the strongest growth in two years.The report, which had been delayed by the US government shutdown, sheds light on an economy that has been buffeted by dramatic changes to trade and immigration policies, as well as persistent inflation and cuts to government spending.But while that has led to sharp swings in some areas, such as imports and exports, the underlying economy has maintained solid momentum, outperforming many forecasts.\"This is an economy that has defied doom and gloom expectations basically since the beginning of 2022\", said Aditya Bhave, senior economist at Bank of America.Speaking to the BBC's Business Today programme, Mr Bhave described the economy as \"very very resilient\".\"I don't see why that wouldn't continue going forward,\" he added.The overall growth figure for the third quarter of the year was much stronger than expected, with most analysts expecting an annual pace of about 3.2%.It was lifted by consumer spending that rose at an annual rate of 3.5%, compared with 2.5% in the previous quarter, despite a slowing job market, as households spent more on health care services.Imports - which count against growth - continued to decline, reflecting the wave of taxes on shipments entering the US that President Donald Trump announced this spring. Meanwhile exports, which had dropped sharply,  bounced back, surging by 7.4%. Government spending also rebounded, driven by defence outlays. Those gains helped to overcome a slowdown in business investment, including in intellectual property, and a housing market struggling under the weight of still-high interest rates, which have heightened affordability issues and supply constraints. Michael Pearce, chief US economist at Oxford Economics, said the economy was well positioned as it headed into 2026, when it will start to feel the boost from tax cuts and the US central bank's recent moves to drop interest rates. \"Underlying measures are consistent with a solid expansion,\" he said. In a post on social media, Trump celebrated the figures, saying his tariffs were responsible. He has been on the defensive amid souring consumer confidence and polls indicating dissatisfaction with his handling of the economy.However, some analysts warned that rising prices faced by some households could  make it difficult to sustain the unusually strong pace of growth seen in the most recent quarter. Over the three months to September, the Fed's preferred inflation gauge, the personal consumption expenditures price index, ticked up 2.8%, compared with 2.1% in the previous quarter, according to the report. Analysts have warned that those price increases are weighing on lower and middle income households, even as higher income households continue to spend freely. Oliver Allen, senior US economist at Pantheon Macroeconomics, noted that some more recent surveys and credit card data suggest that households are reining in their spending. \"The weak labour market, stagnant real incomes, and exhaustion of pandemic-era excess savings all seem finally to be catching up with households,\" he said. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US economy grows at fastest pace in two years ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9d97/live/e58720c0-e002-11f0-ab61-73a5e79bafa0.jpg"
      ],
      "datePublished": "2025-12-23T15:56:57.000Z",
      "dateModified": "2025-12-23T15:56:57.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UK campaigners among five denied US visas",
    "url": "https://www.bbc.com/news/articles/cp39kngz008o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1545/live/d4822640-e0bf-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "World",
    "date": "2025-12-24T11:53:53.000Z",
    "description": "Two British campaigners are among five people denied US visas after the State Department accused them of seeking to \"coerce\" American social media pla",
    "body": "Two British campaigners are among five people denied US visas after the State Department accused them of seeking to \"coerce\" American social media platforms into suppressing viewpoints they oppose.Imran Ahmed, an ex-Labour adviser who now heads the Centre for Countering Digital Hate (CCDH), and Clare Melford, CEO of the Global Disinformation Index (GDI), were labelled \"radical activists\" by the Trump administration and banned from entering the US.A French ex-EU commissioner and two senior figures at a Germany-based anti-online hate group were also denied visas.French President Emmanuel Macron led European condemnation of the move, describing it as \"intimidation\".The US billed the measures as a response to people and organisations that have campaigned for restrictions on American tech firms, with Secretary of State Marco Rubio saying they belonged to a \"global censorship-industrial complex\".He said: \"President Trump has been clear that his America First foreign policy rejects violations of American sovereignty. Extraterritorial overreach by foreign censors targeting American speech is no exception.\"Ahmed has links to senior Labour figures. He was previously an aide to Labour minister Hilary Benn, and Sir Keir Starmer's chief of staff Morgan McSweeney has served as a director of the group he founded.The US government labelled Ahmed a \"collaborator\" for the CCDH's purported past work with the Biden administration. BBC News has contacted the CCDH for comment.Melford founded the GDI, a non-profit that monitors the spread of disinformation, in 2018.US Undersecretary of State Sarah B Rogers accused the GDI of using US taxpayer money \"to exhort censorship and blacklisting of American speech and press\". A GDI spokesperson told the BBC that \"the visa sanctions announced today are an authoritarian attack on free speech and an egregious act of government censorship\".\"The Trump Administration is, once again, using the full weight of the federal government to intimidate, censor, and silence voices they disagree with. Their actions today are immoral, unlawful, and un-American.\"Also targeted was Thierry Breton, the former top tech regulator at the European Commission, who suggested that a \"witch hunt\" was taking place.Breton was described by the State Department as the \"mastermind\" of the EU's Digital Services Act (DSA), which imposes content moderation on social media firms. However, it has angered some US conservatives who see it as seeking to censor right-wing opinions. Brussels denies this.Breton has clashed with Elon Musk, the world's richest man and owner of X, over obligations to follow EU rules.The European Commission recently fined X €120m (£105m) over its blue tick badges - the first fine under the DSA. It said the platform's blue tick system was \"deceptive\" because the firm was not \"meaningfully verifying users\".In response, Musk's site blocked the Commission from sharing adverts on its platform.Reacting to the visa ban, Breton posted on X: \"To our American friends: Censorship isn't where you think it is.\"European leaders have condemned the move, with Macron saying: \"These measures amount to intimidation and coercion aimed at undermining European digital sovereignty.\"The European Union's digital regulations were adopted following a democratic and sovereign process by the European Parliament and the Council.\"The European Commission said it had \"requested clarifications\" from the US, and would \"respond swiftly and decisively to defend our regulatory autonomy against unjustified measures\".Also subject to bans were Anna-Lena von Hodenberg and Josephine Ballon of HateAid, a German organisation that the State Department said helped enforce the DSA.In a statement to the BBC, the two CEOs called it an \"act of repression by a government that is increasingly disregarding the rule of law and trying to silence its critics by any means necessary\". They added: \"We will not be intimidated by a government that uses accusations of censorship to silence those who stand up for human rights and freedom of expression.\"Follow the twists and turns of Trump's second term with North America correspondent Anthony Zurcher's weekly US Politics Unspun newsletter. Readers in the UK can sign up here. Those outside the UK can sign up here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UK campaigners among five denied US visas",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1545/live/d4822640-e0bf-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-24T11:53:53.000Z",
      "dateModified": "2025-12-24T11:53:53.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "UN experts urge Iran to stop execution of woman activist",
    "url": "https://www.bbc.com/news/articles/cwyxz5jken3o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ab79/live/95f82d00-e03a-11f0-bf7e-8de9147ad4a8.jpg",
    "tag": "World",
    "date": "2025-12-23T22:11:01.000Z",
    "description": "UN experts and 400 prominent women have urged Iran not to execute Zahra Tabari, a 67-year-old electrical engineer and women's rights activist.Ms Tabar",
    "body": "UN experts and 400 prominent women have urged Iran not to execute Zahra Tabari, a 67-year-old electrical engineer and women's rights activist.Ms Tabari was arrested in April and accused of collaborating with a banned opposition group, the People's Mujahideen Organisation of Iran (PMOI), according to her family.In October, she was convicted of \"armed rebellion\" by a Revolutionary Court in Rasht after a trial via video link that lasted less than 10 minutes. Her family said the verdict was based on extremely limited and unreliable evidence: a piece of cloth bearing the words \"Woman, Resistance, Freedom\", and an unpublished audio message.Iranian authorities have not yet commented on the case.At least 51 other people are known to be facing the death penalty in Iran after being convicted of national security offences including armed rebellion, as well as \"enmity against God\", \"corruption on Earth\" and espionage, according to the UN experts.The UN Human Rights Council's special rapporteurs on human rights in Iran, violence against women and arbitrary executions, as well as the five members of the working group on discrimination against women and girls, warned in a joint statement that Ms Tabari's case showed \"a pattern of serious violations of international human rights law\".She was arrested during a raid on her home without a judicial warrant, and was interrogated for a month while held in solitary confinement and pressured to confess to taking up arms against the state and to membership in an opposition group, according to the experts.Ms Tabari was denied access to a lawyer of her choosing and was represented by a court-appointed lawyer, they said, adding that her death sentence was issued immediately after a brief hearing.\"The severe procedural violations in this case - including the unlawful deprivation of her liberty, the denial of effective legal representation, the extraordinarily brief trial, the lack of adequate time to prepare a defence, and the use of evidence that appears insufficient to support a charge of [armed rebellion] - render any resulting conviction unsafe,\" they said.They also noted that international law restricted the death penalty to the most serious crimes, meaning intentional killing.\"To execute Tabari under these circumstances would constitute arbitrary execution,\" the experts added. \"Criminalising women's activism for gender equality and treating such expression as evidence of armed rebellion constitutes a grave form of gender discrimination.\"More than 400 prominent women - including several Nobel laureates, the former presidents of Switzerland and Ecuador, and former prime ministers of Finland, Peru, Poland and Ukraine - also signed a public appeal for Ms Tabari's immediate release on Tuesday.\"Iran is today the world's number one executioner of women per capita. Zahra's case lays bare this terror: in Iran, daring to hold a sign declaring women's resistance to oppression is now punishable by death,\" it said.The appeal was organised by Justice for the Victims of the 1988 Massacre in Iran, a UK-based group that represents the families of the thousands of political prisoners who were executed in Iran three decades ago.Another Iranian woman, Kurdish rights activist and social worker Pakhshan Azizi, is also facing the death penalty on the same charge as Ms Tabari.UN experts have previously said Ms Azizi's sentencing appeared to be \"solely related to her legitimate work as a social worker, including her support for refugees in Iraq and Syria\".According to Iran Human Rights (IHR), at least 1,426 people - including 41 women - were executed in Iran in the first 11 months of 2025 - a 70% increase on the same period last year.Almost half of those put to death as of the end of November were convicted of drug-related offences, while 53 were convicted of national security offences, the Norway-based group said.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "UN experts urge Iran to stop execution of woman activist",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/ab79/live/95f82d00-e03a-11f0-bf7e-8de9147ad4a8.jpg"
      ],
      "datePublished": "2025-12-23T22:11:01.000Z",
      "dateModified": "2025-12-23T22:11:01.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Zelensky moves towards demilitarised zones in latest peace plan for Ukraine",
    "url": "https://www.bbc.com/news/articles/c9d9wg2pwl1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/40df/live/1a904fa0-e0ab-11f0-8516-3db1ae351283.jpg",
    "tag": "World",
    "date": "2025-12-24T11:43:47.000Z",
    "description": "44 minutes agoPaul KirbyEurope digital editorUkraine's President Volodymyr Zelensky has given details of an updated peace plan that offers Russia the ",
    "body": "44 minutes agoPaul KirbyEurope digital editorUkraine's President Volodymyr Zelensky has given details of an updated peace plan that offers Russia the potential withdrawal of Ukrainian troops from the east that Moscow has demanded.Giving details of the 20-point plan agreed by US and Ukrainian negotiators in Florida at the weekend, Zelensky said the Russians would respond on Wednesday once the Americans had spoken to them.Describing the plan as \"the main framework for ending the war\" Zelensky said it proposed security guarantees from the US, Nato and Europeans for a co-ordinated military response if Russia invaded Ukraine again.On the key question of Ukraine's eastern Donbas, Zelensky said a \"free economic zone\" was a potential option.He told journalists that as Ukraine was against withdrawal, US negotiators were looking to establish a demilitarised zone or a free economic zone. Any area that Ukrainian troops pulled out of would have to be policed by Ukraine, he stressed. \"There are two options,\" Zelensky said, \"either the war continues, or something will have to be decided regarding all potential economic zones.\"The 20-point plan is seen as an update of an original 28-point document, agreed by US envoy Steve Witkoff with the Russians several weeks ago, which was widely seen as heavily geared towards the Kremlin's demands.The Russians have insisted that Ukraine pulls out of almost a quarter of its own territory in the eastern Donetsk region in return for a peace deal. The rest is already under Russian occupation.Sensitive issues including questions over territory would have to be resolved \"at the leaders' level\", but the new draft would provide Ukraine with strong security guarantees and a military strength of 800,000, Zelensky explained.Much of the updated plan resembles what came out of recent talks in Berlin involving US negotiators Witkoff and Jared Kushner with Ukrainian and European leaders. The setting then moved to Miami last weekend where US President Donald Trump's team spoke separately to Russian envoy Kirill Dmitriev and then Ukrainian and European officials.There now appears to be far more detail on the territorial issue, although it is clear the Ukrainian side was unable to reach a consensus with the Americans.Zelensky explained that if Ukraine was prepared to pull its heavy forces back by five, 10 or 40km in the 25% of Donetsk it still held to create an economic zone, making it virtually demilitarised, then Russia would have to do the same \"accordingly by five, 10, or 40km\".Russian troops are currently about 40km (25 miles) east of Ukraine's \"fortress belt\" cities of Sloviansk and Kramatorsk, having captured the town of Siversk.Russian President Vladimir  Putin is unlikely to be impressed by the kind of compromise being proposed for Donetsk. He said this month that Russia would take control of the entire east of Ukraine by force if Ukrainian troops did not pull out.Zelensky made clear that such a free economic zone would have to be under Ukrainian administration and police - \"definitely not the so-called Russian police\". The current front line would then become the boundary of the economic zone with international forces on the ground along the contact line to ensure no Russian infiltration.Russia has so far rejected a European proposal to police any peace deal through a Coalition of the Willing as a \"brazen threat\".A referendum would need to be held on the whole peace plan, Zelensky said, and only a referendum could decide on the idea of a potential free economic zone in Donbas.He emphasised that an economic zone would also have to be set up around the Zaporizhzhia nuclear power plant currently occupied by Russia, and that Russian troops would have to pull out of four other Ukrainian regions - Dnipropetrovsk, Mykolaiv, Sumy, and Kharkiv.The current US proposal for the nuclear plant would be for Ukraine, the US and Russia to operate it jointly, but Kyiv disagreed with that, Zelensky said.The main points of the plan reaffirm Ukraine's sovereignty and propose a non-aggression pact between Russia and its neighbour with a monitoring mechanism.As well as strong security guarantees mirroring Nato's Article Five, which requires members to aid an ally under attack, Ukraine is to be allowed a maximum military strength of 800,000 in peacetime.Discussions are still going on over a US plan to receive compensation in return for security guarantees, so Zelensky says it is not currently part of the document.There is no reference barring Ukraine from joining Nato, which was in the original 28-point plan and something Russia has consistently demanded.And the latest framework proposes that Ukraine joins the European Union with a defined date of accession. It is currently a candidate, but a number of other candidate countries are seen as first in line, such as Albania.There are plans for a Ukraine investment fund of about $200bn (£150bn) involving both the US and Europe.Among the other points is a requirement for Ukraine to hold elections as soon as possible after the deal is signed. Russia and the US have both pushed for a vote, even though Ukraine is under martial law because of the full-scale invasion. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Zelensky moves towards demilitarised zones in latest peace plan for Ukraine",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/40df/live/1a904fa0-e0ab-11f0-8516-3db1ae351283.jpg"
      ],
      "datePublished": "2025-12-24T11:43:47.000Z",
      "dateModified": "2025-12-24T11:43:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Trump says US will keep or sell oil seized from Venezuela",
    "url": "https://www.bbc.com/news/articles/c87lnn09yj8o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c4de/live/c40b0770-e009-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "World",
    "date": "2025-12-23T09:51:47.000Z",
    "description": "Donald Trump has said the US will keep or sell the crude oil contained on tankers it has seized off the coast of Venezuela, as well as the vessels the",
    "body": "Donald Trump has said the US will keep or sell the crude oil contained on tankers it has seized off the coast of Venezuela, as well as the vessels themselves.The US president's comments came as Washington continues to pressure the South American country's leader Nicolás Maduro to stand down.Speaking to reporters in Florida on Monday, Trump said of the oil \"we're going to keep it\", adding: \"Maybe we will sell it, maybe we will keep it. Maybe we'll use it in the Strategic Reserves. We're keeping the ships also.\"The Trump administration has accused Venezuela of using oil revenues to fund drug-related crime, while Caracas has condemned the seizures as \"piracy\".The US military has seized two oil tankers this month, including one on Saturday.Trump issued his latest warning as the US Coast Guard continued to pursue a third oil tanker, which authorities described as part of a Venezuelan \"dark fleet\" used to evade US sanctions.\"It's moving along, and we'll end up getting it,\" Trump said. Separately on Monday, the US military said it carried out a strike on what it said was a suspected trafficking vessel in international waters in the eastern Pacific. US Southern Command said one person was killed.When asked whether the goal of the seizures was to force Maduro from power, Trump responded: \"Well, I think it probably would... That's up to him what he wants to do. I think it'd be smart for him to do that. But again, we're gonna find out.\"The US has been building up its military presence in the Pacific and Caribbean Seas and has carried out deadly strikes on alleged Venezuelan drug-smuggling boats, killing around 100 people.It has provided no public evidence that these vessels were carrying drugs and the military has come under increasing scrutiny from Congress over the strikes.Speaking on Monday, Trump repeated that the US intends to strike targets on land too.He said: \"We'll be starting the same programme on land. If they want to come by land, they're going to end up having a big problem. They're going to get blown to pieces, because we don't want our people poisoned.\"Speaking on state television, Maduro responded to Trump by saying: \"He would be better off in his own country dealing with economic and social issues and the world would be better off if he focused on his own country's affairs.\"Since returning to office in January, Trump has doubled the reward for information leading to Maduro's capture, accusing him of being \"one of the largest narco-traffickers in the world\".The Trump administration has designated Maduro's government as a foreign terrorist organisation (FTO), and last week ordered a \"blockade\" of sanctioned oil tankers entering or leaving Venezuela.As the Venezuelan government relies heavily on oil exports to finance public spending, the latest measures have sparked outrage among officials in Caracas.At Venezuela's request, the UN Security Council is set to hold an emergency session on Tuesday to discuss what the government has described as \"ongoing US aggression\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says US will keep or sell oil seized from Venezuela",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c4de/live/c40b0770-e009-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-23T09:51:47.000Z",
      "dateModified": "2025-12-23T09:51:47.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Email by 'A' from 'Balmoral' asked Ghislaine Maxwell for 'inappropriate friends', Epstein files show",
    "url": "https://www.bbc.com/news/articles/cm28g5exx09o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c65e/live/64d03910-e018-11f0-a378-fd9ff3d870e9.jpg",
    "tag": "World",
    "date": "2025-12-23T22:48:09.000Z",
    "description": "14 hours agoCachella SmithPA MediaAn email sent from an individual named \"A\", saying they are at Balmoral and asking Ghislaine Maxwell for \"inappropri",
    "body": "14 hours agoCachella SmithPA MediaAn email sent from an individual named \"A\", saying they are at Balmoral and asking Ghislaine Maxwell for \"inappropriate friends\", is among the latest tranche of Epstein files released on Tuesday.The message, sent to Maxwell on 16 August 2001, begins: \"I am up here at Balmoral Summer Camp for the Royal Family.\" Later in the email, the sender asks: \"How's LA? Have you found me some new inappropriate friends?\" before signing off \"see ya A xxx\".Balmoral Castle is a royal residence.The emails do not indicate any wrongdoing. The BBC has contacted Andrew Mountbatten-Windsor's team for a response. The former prince has previously denied all wrongdoing.He has also previously said he did not \"see, witness or suspect any behaviour of the sort that subsequently led to his [Epstein's] arrest and conviction\".The message was sent from email address \"abx17@dial.pipex.com\" entitled \"The Invisible Man\" and forms part of the more than 11,000 files published on Tuesday.In an email sent back to this address on the same day, Maxwell wrote: \"So sorry to dissapoint [sic] you, however the truth must be told. I have only been able to find appropriate friends.\"US Department of JusticeA different email address - aace@dial.pipex.com - is listed in Epstein's phone book under a contact labelled \"Duke of York\", a previously released image showed.A further exchange between Maxwell and \"The Invisible Man\" also published on Tuesday shows the alias attached to both of the email addresses.The messages, sent in February 2002, discuss a trip to Peru.Maxwell initially forwarded an email to \"The Invisible Man\" at abx17@dial.pipex.com with details of plans for a visit to the South American country asking \"What do you think [?]\".The forwarded email comes from an address labelled \"Juanesteban Ganoza\" and makes suggestions on possible activities including a small lunch and horse riding.It also said: \"About the girls... how old is he? I doubt it that he will find someone here, but we can try.\"A reply from \"The Invisible Man\" is sent to Maxwell via the other address \"aace@dial.pipex.com\" with comments including: \"As far as food is concerned I am very easy and will fit in with whatever he plans […] As for girls well I leave that entirely to you and Juan Estoban!\"The sender signs off \"Masses of love A xxx\".In a later exchange, in March 2002, Maxwell forwards an email to aace@dial.pipex.com, which begins: \"Thought you would like to see what I sent.\"The email then appears to copy in a note sent to someone else beginning: \"I just gave Andrew your telephone no [sic].\"Some sight seeing some 2 legged sight seeing (read intelligent pretty fun and from good families) and he will be very happy.\"US Department of JusticeIn October, Andrew Mountbatten-Windsor lost use of his prince and Duke of York titles following scrutiny over his links with Epstein.The US Department of Justice has been releasing documents, known as the Epstein files, relating to two criminal investigations into the convicted sex offender during his lifetime.Congress passed a law mandating the files be released in their entirety by 19 December.Not all the files have yet been released.Andrew has been referenced in previous documents. Simply appearing in the photos or documents is not itself evidence of wrongdoing.Also among the newly released documents is a formal request from the US Department of Justice (DOJ) dating to April 2020 asking for assistance from the British authorities \"to interview H.R.H Prince Andrew Albert Christian Edward\" relating to two criminal investigations. One of the two related to Epstein. On the Epstein investigation, the DOJ's note reads \"the investigation to date has revealed that Prince Andrew may have been a witness to and/or participant in certain events of relevance to the ongoing investigation\".The document also underlined that Andrew was not a \"target\" of the investigation and no evidence had been gathered that he had committed any crime under US law.Attached to the document is a list of areas the US authorities had sought to cover in an interview - it included names and identifying features of any females Prince Andrew met through Epstein and/or Maxwell as well as the history of his relationship with both.US President Donald Trump has also featured in documents within this latest release including a reference in a 2020 email from an assistant US attorney which suggested he had travelled on Epstein's private jet \"many more times than previously has been reported (or that we were aware)\".In 2024, Trump wrote: \"I was never on Epstein's Plane\". He has denied any wrongdoing in relation to Epstein.The DOJ has also said some files released on Tuesday \"contain untrue and sensationalist claims\" against Trump.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Email by 'A' from 'Balmoral' asked Ghislaine Maxwell for 'inappropriate friends', Epstein files show",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c65e/live/64d03910-e018-11f0-a378-fd9ff3d870e9.jpg"
      ],
      "datePublished": "2025-12-23T22:48:09.000Z",
      "dateModified": "2025-12-23T22:48:09.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Putin tells BBC western leaders deceived Russia",
    "url": "https://www.bbc.com/news/videos/cj01pdve7rpo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9c73/live/4018a740-dd13-11f0-aae2-2191c0e48a3b.jpg",
    "tag": "World",
    "date": "2025-12-19T18:15:04.000Z",
    "description": "BBC Russia editor Steve Rosenberg asked Vladimir Putin about his plans for the future of the country, during the president's annual end-of-year televi",
    "body": "BBC Russia editor Steve Rosenberg asked Vladimir Putin about his plans for the future of the country, during the president's annual end-of-year televised event.The Russian leader responded by saying he's calling for greater respect from other Western leaders.\"Western politicians created the current situation with their own hands\", Putin said, adding that \"they constantly talk about preparing for war with Russia\".The president also said that plans to attack Europe are \"nonsense\".",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Putin tells BBC western leaders deceived Russia",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/9c73/live/4018a740-dd13-11f0-aae2-2191c0e48a3b.jpg"
      ],
      "datePublished": "2025-12-19T18:15:04.000Z",
      "dateModified": "2025-12-19T18:15:04.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]