[
  {
    "title": "Trump says he will sue BBC for at least $1bn over Panorama edit",
    "url": "https://www.bbc.com/news/articles/c891jp9j79do?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/63da/live/35262f40-c1bd-11f0-8456-eff94716b162.jpg",
    "tag": "World",
    "date": "2025-11-15T00:55:15.000Z",
    "description": "Trump says he will take legal action against BBC over Panorama edit7 minutes agoHelen SullivanBBC NewsListen: \"I have to do it\" - Trump says he will s",
    "body": "Trump says he will take legal action against BBC over Panorama edit7 minutes agoHelen SullivanBBC NewsListen: \"I have to do it\" - Trump says he will sue the BBC over Panorama editUS President Donald Trump has said he will take legal action against the BBC next week over how his speech was edited by Panorama, after the corporation apologised but refused to compensate him.Speaking to reporters on board Air Force One on Friday evening, Trump said: \"We'll sue them for anywhere between a billion and $5bn probably sometime next week.\"On Friday, the BBC said the edit of the 6 January 2021 speech had unintentionally given \"the mistaken impression that President Trump had made a direct call for violent action\".The BBC apologised but said it would not pay financial compensation.Trump said he would discuss it with UK Prime Minister Sir Keir Starmer over the weekend. Earlier this week Trump's lawyers threatened to sue the BBC for $1bn in damages unless the corporation issued a retraction, apologised and compensated him. Trump's lawyers had given the BBC a deadline of 22:00 GMT (17:00 EST) on Friday 14 November to respond, which it did.The controversy led to the resignations of BBC director general Tim Davie and head of news Deborah Turness on Sunday.Searches of public court record databases earlier showed no legal action had been filed so far.Federal and state courts in Florida, where a case would likely be filed, are now closed for the weekend. Based on Pacer searches for federal cases related to the BBC, no case filed by the Trump administration has been filed.This is a breaking news story and will be updated shortly. ",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Trump says he will sue BBC for at least $1bn over Panorama edit",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/63da/live/35262f40-c1bd-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-15T00:55:15.000Z",
      "dateModified": "2025-11-15T00:55:15.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Canadian boycott of US travel shows no sign of slowing ",
    "url": "https://www.bbc.com/news/articles/ce9d7pj543eo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1319/live/9b839750-c0c8-11f0-a532-d129af550177.jpg",
    "tag": "World",
    "date": "2025-11-14T03:16:48.000Z",
    "description": "22 hours agoMadeline HalpertKristy GammonMs Gammon and her husband used to enjoy travelling to the US to go to Baltimore Orioles gamesKristy Gammon us",
    "body": "22 hours agoMadeline HalpertKristy GammonMs Gammon and her husband used to enjoy travelling to the US to go to Baltimore Orioles gamesKristy Gammon used to travel to the US from Canada at least once every other year, taking ski trips at Lake Placid in New York and travelling to Baltimore, Maryland, for her husband's favourite Orioles baseball games.But those trips are now over, she said. This year, the Nova Scotia resident has avoided even passing through the US on her way to Ontario, a shortcut for an otherwise 18-hour drive.Since President Donald Trump took office earlier this year, the 62-year-old said she and most of her Canadian friends have decided to stop visiting the US as a way of protesting policies they oppose and trade actions Trump has taken against Canada.\"There are so many things that we just feel aghast about in terms of how [the administration] is acting internationally, behaving toward their own citizens, how they're treating their allies and neighbours, i.e. Canada,\" Ms Gammon said.Ms Gammon and her friends are part of a trend that shows no signs of slowing. October marked the 10th straight month of decline in the number of Canadian travellers to the US. Air travel from Canada to the US dropped nearly 24%, while car travel fell more than 30% when compared to the same period last year, according to data released this week by Canada's statistics office.Overall, the US has seen a 3.2% drop in international spending in the country, driven primarily by fewer visitors from Canada, according to the US Travel Association, a nonprofit group representing the American travel industry.As relations between the two countries remain icy, mostly in response to new tariffs Trump has imposed, Canadians are apparently committed to giving their southern neighbours the cold shoulder.In the past, Canadians have made up about a quarter of all international visitors to the US, spending over $20bn (£15.1bn) a year, according to the US Travel Association.They began to curb their US travel after Trump imposed a series of tariffs on goods from the country earlier this year, saying he wanted to reduce the trade deficit - the gap between the value of goods the US buys from Canada and those it sells to them. Trump also said Canada should do more to reduce the flow of illegal drug fentanyl into the US.Canada is currently facing 35% tariffs on its goods - although most are exempt under an existing North American free trade agreement - as well as individual levies targeting particular industries like car and steel manufacturing.Trade talks between the two countries were derailed last month when Trump was angered by an anti-tariff advertisement in the US that featured Ronald Reagan and was sponsored by the province of Ontario.Meanwhile, he has angered Canadians with his many public comments about making their country the \"51st state\".Some popular tourist destinations in US have tried to buck the trend, attempting to entice Canadian travellers back to the US. In Kalispell, Montana, home to Glacier National Park, officials have been offering a \"Canadian Welcome Pass\" that includes deals and discounts at local businesses for those crossing the border.\"For the last several months, our countries have been going through some things. But there's one thing we know and it's this – we miss you,\" the website for the welcome pass says.Major events scheduled to take place in the US in the coming years could help drive visitors from other places and replace the missing Canadian tourists, including the FIFA 2026 World Cup and the 2028 Summer Olympics in Los Angeles, according to the US Travel Association.'Come hug it out!' - How a Canadian tourism ad went viralStill, with Canadians choosing to travel closer to home, the country's own tourism industry has gotten a boost. Canada's tourism sector made a record-breaking C$59bn from May to August of 2025, up 6% from the same period last year, mostly because of people choosing to travel domestically, according to Destination Canada, a national tourism organisation.Some of those choosing to stay home are Canadian snowbirds, retirees who travel south to states like Florida to find warmth in the winter months. A survey from the Travel Health Insurance Association of Canada found these baby boomers were staying home more than other age groups, with only 10% planning US trips for this year, down 66% compared to last year.Ms Gammon said some of her friends have even chosen to sell their winter homes in Florida because of the frosty relations and frustrations with the Trump administration.\"They've completely changed their snowbird plans,\" the semi-retired family physician said. \"You can feel there's a shift.\"Ms Gammon said she did not know if others would stick to boycotting the US for the remaining three years of the Trump administration. But, even though she misses her US trips, that is her plan for now.\"Who knows what could change between now and three years,\" Ms Gammon said. \"But it would have to be pretty significant changes for us personally to change our minds.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Canadian boycott of US travel shows no sign of slowing ",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1319/live/9b839750-c0c8-11f0-a532-d129af550177.jpg"
      ],
      "datePublished": "2025-11-14T03:16:48.000Z",
      "dateModified": "2025-11-14T03:16:48.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Tanzania's President Samia Suluhu Hassan promises probe into post-election unrest",
    "url": "https://www.bbc.com/news/articles/c4gpdxp5vl2o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1ed9/live/5c79fc60-c178-11f0-a644-172c36f3d3b5.jpg",
    "tag": "World",
    "date": "2025-11-14T17:32:00.000Z",
    "description": "8 hours agoHumphrey Mgonja,Dar es Salaam and Wycliffe MuiaTanzania's President Samia Suluhu Hassan has announced an official investigation the unrest ",
    "body": "8 hours agoHumphrey Mgonja,Dar es Salaam and Wycliffe MuiaTanzania's President Samia Suluhu Hassan has announced an official investigation the unrest that broke out during election week, following accusations that her government was responsible for violently crushing historic protests.She was declared the winner of last month's presidential poll with 98% of the vote - a result the opposition has denounced as a \"mockery of democracy.\" At least 240 people were charged with treason after the protests.As well as the commission of inquiry, President Samia has also asked prosecutors to \"show leniency\" towards those arrested in connection with the violence. Quoting the Bible, she said: \"Father, forgive them, for they know not what they do.\"Her remarks come just days after the UN High Commissioner for Human Rights, Volker Türk, urged Tanzanian authorities to conduct a full and transparent investigation into reports of killings and other serious human rights violations during and after the 29 October elections.Hundreds may have died in post-election unrest, according to the opposition. The authorities are yet to release an official death toll.The violence was shocking for a nation that had cultivated an image of calm, consensus and order for nearly six decades.During an address to parliament on Friday, President Samia urged prosecutors to consider reducing or dropping charges for individuals who may have been swept up in the unrest without fully understanding their actions.\"I am aware that many young people have been arrested and charged with treason. They did not fully understand what they were getting involved in,\" she said. \"As a mother and guardian of this nation, I am directing law-enforcement agencies, especially the DPP's office, to show leniency.\"Samia also called on political parties to meet and discuss how to conduct politics without causing harm to the country. She reaffirmed her commitment to initiating a new constitution-making process.The protests, organised by young people, drew clear parallels with global Gen Z-led mobilisations against entrenched leadership and unresponsive governments.Analysts say while the unrest was unprecedented for Tanzania, it was preceded by a tense political climate - marked by stalled reforms, years of simmering youth anger, power tussles within the ruling party and the sustained persecution of opposition leaders.In the months preceding election day, the CCM government worked to systematically eliminate any credible competition, according to analysts.The two main opposition leaders were blocked from standing in last month's poll - Tundu Lissu is in detention on treason charges, which he denies, while Luhaga Mpina's candidacy was rejected on technical grounds.During her first term in office, Samia's approach to leadership had been initially admired both at home and abroad as she allowed opposition parties to organise rallies and criticise the government without the fear of grave repercussions.She had pledged to re-open Tanzania to the world through her \"4R\" doctrine - reconciliation, resilience, rebuilding and reform.But months to the election, a wave of abductions, arrests and the brutal killings of opposition members gripped the country, shattering hopes for reforms and reconciliation.Additional reporting by Natasha Booty",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Tanzania's President Samia Suluhu Hassan promises probe into post-election unrest",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/1ed9/live/5c79fc60-c178-11f0-a644-172c36f3d3b5.jpg"
      ],
      "datePublished": "2025-11-14T17:32:00.000Z",
      "dateModified": "2025-11-14T17:32:00.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Watch: Bear runs onto airport tarmac, halting flights",
    "url": "https://www.bbc.com/news/videos/cx20zn57v3po?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fad3/live/04679c30-c132-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "World",
    "date": "2025-11-14T08:23:56.000Z",
    "description": "An airport in the Japanese city of Hanamaki temporarily suspended flights on Wednesday after a bear wandered onto its grounds.The animal was spotted o",
    "body": "An airport in the Japanese city of Hanamaki temporarily suspended flights on Wednesday after a bear wandered onto its grounds.The animal was spotted on the tarmac at 13:00 local time, halting flights for more than an hour.Human encounters with bears have reached record levels in Japan. Thirteen people have been killed by bears this year, while more than 100 have been wounded.The incidents have prompted authorities to deploy troops to hunt bears and help stop the attacks.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Watch: Bear runs onto airport tarmac, halting flights",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/fad3/live/04679c30-c132-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-14T08:23:56.000Z",
      "dateModified": "2025-11-14T08:23:56.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US justice department investigates Epstein's alleged ties to Clinton and banks after Trump request",
    "url": "https://www.bbc.com/news/articles/cj97x2lere0o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/248a/live/1c6c58d0-c181-11f0-be56-f12785bd2327.jpg",
    "tag": "World",
    "date": "2025-11-14T22:36:14.000Z",
    "description": "The US justice department has confirmed it will investigate paedophile financier Jeffrey Epstein's alleged links to major banks and several prominent ",
    "body": "The US justice department has confirmed it will investigate paedophile financier Jeffrey Epstein's alleged links to major banks and several prominent Democrats, including former President Bill Clinton.US President Donald Trump said he would ask Attorney General Pam Bondi and the FBI to look into Epstein's \"involvement and relationship\" with Clinton and others.Bondi said the department \"will pursue this with urgency and integrity\".Trump's request came days after thousands of Epstein's emails were released by the US Congress - which include mentions of the US president. Democrats have accused Trump of trying to deflect from questions about his relationship with Epstein.The emails, released by the US House Oversight Committee, include many high-profile figures. A review by the Wall Street Journal found that Trump was mentioned in more than 1,600 or the 2,324 email threads. Robert Garcia, the leading Democrat on the committee, said Trump was attempting to \"deflect from serious new questions we have about his relationship with Jeffrey Epstein\".In addition to Clinton, Trump said he asked the Department of Justice (DoJ) to investigate banks JP Morgan and Chase, former Treasury Secretary Larry Summers and LinkedIn founder Reid Hoffman, who is also a prominent Democratic donor.\"Epstein was a Democrat, and he is the Democrat's problem, not the Republican's problem!\" he wrote on social media. \"They all know about him, don't waste your time with Trump. I have a Country to run!\"Clinton has strongly denied he had any knowledge of Epstein's crimes.A spokesperson for JPMorgan Chase said the firm regrets \"any association\" they had with Epstein, and added that the firm \"did not help him commit his heinous acts\".It is unclear whether Trump made a formal request or issued a directive to the justice department, or if Bondi was responding to his post on his Truth Social platform.Bondi said she appointed US Attorney Jay Clayton to lead an investigation into the ties with Epstein. Trump's request comes ahead of the House of Representatives' vote next week on whether the justice department should release all its files related to the investigation into Epstein, who died in prison in 2019.Democrat Adelita Grijalva's swearing in to the chamber on Wednesday triggered the move, after she immediately signed a discharge petition from calling for the release of the files.Her signature was the 218th - the final signing needed to trigger a floor vote. Four Republicans joined with Democrats to call for the vote.Interest in Epstein's relationships was renewed this week after US lawmakers released more than 20,000 pages of documents from his estate, including many mentioning Trump.Documents released by the House Oversight Committee on Wednesday appeared to show correspondence between Epstein and the former US Treasury Secretary, Larry Summers from October 2017.In one email, Summers gives Epstein his opinion of Trump early in his presidency, writing: \"DJT is world s luckiest guy in terms of opposition, economy etc. still think his world will collapse\".A representative for Summers told the Wall Street Journal in 2023 that the former treasury official and past president of Harvard University \"deeply regrets being in contact with Epstein after his conviction\".The documents also included email exchanges between Epstein and his long-time associate Ghislaine Maxwell, who is currently serving a 20-year prison sentence for sex trafficking.In one email, sent in 2011, Epstein writes to Maxwell: \"I want you to realize that that dog that hasn't barked is Trump.. [VICTIM] spent hours at my house with him.\"Trump was a friend of Epstein's for years, but the president has said they fell out in the early 2000s, two years before Epstein was first arrested. Trump has consistently denied any wrongdoing in relation to Epstein. While he was discussed in some of the messages released this week, he did not send or receive them.Traditionally, presidents do not direct the justice department to investigate individuals and companies and have often brought in special counsels - independent attorneys from outside the administration - to carry out investigations. It is also rare for an administration to seek an investigation of a predecessor. However, the Biden administration started investigations tied to allegations that Trump tried to interfere with the 2020 election, which were then referred to a special counsel. The cases were dropped when Trump returned to the White House. On Friday, Republican congresswoman Marjorie Taylor Greene said it would be \"huge miscalculation\" for Trump to oppose the release of material related to Epstein. Greene was among the four other House Republicans - Nancy Mace, Lauren Boebert, Thomas Massie - who joined Democrats in signing a discharge petition calling for the release of the files.\"I truly just stand with the women, and I think they deserve to be the ones that we're fighting for,\" she told the BBC's US partner, CBS News.In a letter addressed to Congress, Epstein survivors and the family of Virginia Giuffre - a prominent accuser of his - called for US lawmakers to vote in favour of releasing the files. \"As you gather with your family this season, remember that your primary duty is to your constituents. Look into the eyes of your children, your sisters, your mothers, and your aunts,\" the letter reads.\"Imagine if they had been preyed upon. Imagine if you yourself were a survivor. What would you want for them? What would you want for yourself? When you vote, we will remember your decision at the ballot box.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US justice department investigates Epstein's alleged ties to Clinton and banks after Trump request",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/248a/live/1c6c58d0-c181-11f0-be56-f12785bd2327.jpg"
      ],
      "datePublished": "2025-11-14T22:36:14.000Z",
      "dateModified": "2025-11-14T22:36:14.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "At 16, I was experimented on by the CIA and now I'm suing",
    "url": "https://www.bbc.com/news/articles/cvgdngkxedzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5d16/live/ad3f3f40-ba87-11f0-b2a1-6f537f66f9aa.jpg",
    "tag": "World",
    "date": "2025-11-15T00:14:49.000Z",
    "description": "47 minutes agoRobin Levinson-King and Eloise AlannaSubmitted photoThe first thing Lana Ponting remembers about the Allan Memorial Institute, a former ",
    "body": "47 minutes agoRobin Levinson-King and Eloise AlannaSubmitted photoThe first thing Lana Ponting remembers about the Allan Memorial Institute, a former psychiatric hospital in Montreal, Canada, is the smell - almost medicinal. \"I didn't like the look of the place. It didn't look like a hospital to me,\" she told the BBC from her home in Manitoba.That hospital – once the home of a Scottish shipping magnate – would be her home for a month in April 1958, after a judge ordered the then-16-year-old to undergo treatment for \"disobedient\" behaviour.It was there that Ms Ponting became one of thousands of people experimented on as part of the CIA's top-secret research into mind control. Now, she is one of two named plaintiffs in a class-action lawsuit for Canadian victims of the experiments. On Thursday, a judge denied the Royal Victoria Hospital's appeal, paving the way for the lawsuit to proceed.According to her medical files, which she obtained only recently, Ms Ponting had been running away from home and hanging out with friends her parents disapproved of after a difficult move with her family from Ottawa to Montreal.\"I was an ordinary teenager,\" she recalled. But the judge sent her to the Allan. Once there, she became an unwitting participant in covert CIA experiments known as MK-Ultra. The Cold War project tested the effects of psychedelic drugs like LSD, electroshock treatments and brainwashing techniques on human beings without their consent. Over 100 institutions – hospitals, prisons and schools – in the US and Canada were involved.At the Allan, McGill University researcher Dr Ewen Cameron drugged patients and made them listen to recordings, sometimes thousands of times, in a process he called \"exploring\".The Allan Memorial Institute in Montreal is where the CIA-backed experiments were conducted in CanadaDr Cameron would make Ms Ponting listen to the same tape recording hundreds of times.\"It ran over and over again, you're a good girl, you're a bad girl,\" Ms Ponting recalled.The technique was a form of \"psychic driving,\" says doctoral student Jordan Torbay, who has researched his experiments and their ethical implications.\"Essentially the minds of patients were manipulated using verbal cues,\" she says, adding he also looked at the effects of sleep drugs, forced sensory deprivation, and induced coma.Medical records show Ms Ponting was given LSD, as well as drugs like sodium amytal, a barbiturate, desoxyn, a stimulant, as well as nitrous gas, a sedative known as \"laughing gas\".\"By April 30th, the patient had explorations… she had become quite tense and extremely violent when given the Nitrous Oxide, throwing herself half out of bed and starting to scream,\" Dr Cameron wrote in one of her medical files, which Ms Ponting has obtained through a freedom of information request.The harsh truth about the MK-Ultra experiments first came to light in the 1970s. Since then, several victims have tried to sue the US and Canada. Lawsuits in the US have largely been unsuccessful, but in 1988, a Canadian judge ordered the US government to pay nine victims $67,000 each. In 1992 the Canadian government paid C$100,000 (about $80,000 at the time) to each of 77 victims – but did not admit liability.Ms Ponting was not among them, because she did not yet know that she was a victim, she saysWatch: The CIA's secret pursuit of 'mind control'Listen: The Woman Who Resisted Mind ControlFor decades, Ms Ponting said she felt something was wrong with her, but she did not learn of the details of her own involvement in the experiments until somewhat recently.She says she had little memory of what happened at the Allan, or in the years that followed. Ms Ponting eventually married and moved to Manitoba, where she had two children whom she is still close to. Now, she's a grandmother to four grandchildren. But she says she has suffered life-long repercussions from her time at the Allan. \"I felt it all my life, because I was wondering why I would think this way, or, you know what happened to me,\" she said.She says she's had to be on a cocktail of medications her whole life to deal with mental-health issues, which she attributes to her time at the Allan, as well as recurrent nightmares. \"Sometimes I wake up screaming in the night because of what happened,\" she said.The Royal Victoria Hospital and McGill University declined to comment as the case is before the courts. The government pointed the BBC to its previous settlement, in 1992, which it said was done for \"humanitarian\" reasons and did not accept legal liability. For Ms Pointing, the lawsuit is a chance to finally get some closure.\"Sometimes I sit in my living room and my mind goes back, and I can think of the things that happened to me, you know,\" she says. \"Every time I see a picture of Dr Cameron, it makes me so angry.\"Although Dr Cameron's work has since become synonymous with MK-Ultra experiments, Ms Torbay says her research shows he didn't know he was being funded by the CIA at the time. His work with the US intelligence agency ended in 1964, and he died shortly after, of a heart attack, in 1967.But regardless of whether he knew of where the money was coming from, Ms Torbay says he should have known the experiments he was conducting were not ethical.She says she hopes the lawsuit goes forward, and the victims get some sense of justice. \"It isn't really about giving the patients back what they lost, because that's not possible, but sort of almost making sure their suffering wasn't in vain, that we do learn from this,\" she says.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "At 16, I was experimented on by the CIA and now I'm suing",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5d16/live/ad3f3f40-ba87-11f0-b2a1-6f537f66f9aa.jpg"
      ],
      "datePublished": "2025-11-15T00:14:49.000Z",
      "dateModified": "2025-11-15T00:14:49.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Several killed after bus crashes into bus stop in Stockholm",
    "url": "https://www.bbc.com/news/articles/c629m7jm777o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a217/live/b51ea9c0-c177-11f0-9e77-171133adaa3b.png",
    "tag": "World",
    "date": "2025-11-14T21:51:44.000Z",
    "description": "Three people have been killed and and another three injured after a bus crashed into a bus stop in central Stockholm, Swedish police say.Circumstances",
    "body": "Three people have been killed and and another three injured after a bus crashed into a bus stop in central Stockholm, Swedish police say.Circumstances surrounding Friday's crash at 15:23 (14:23 GMT) on the Valhallavägen street in the Swedish capital remain unclear.The bus driver has been arrested and faces charges of causing death and bodily harm, police said in a statement.However, they added there was \"currently no indication that the incident was intentional\".Officials are trying to establish the identities of the victims. It is not clear if there were passengers on board. The incident occurred near the Royal Institute of Technology university.Images from the scene show rescue crews appearing to help people trapped underneath the double-decker bus.A witness who owns a shop on the street told SVT the bus hit a pole in front of the bus shelter. They said several people ran into the shop crying.A woman told the local Expressen newspaper that the bus \"mowed down an entire bus stop queue\". She said people were screaming and trying to help the injured, while dead people lay on the ground.\"There must have been more people under the bus,\" she said.Prime Minister Ulf Kristersson said his thoughts were with the victims and their families.\"People who might have been on their way home to family, friends, or a quiet evening at home. We do not yet know the cause, but right now my thoughts are primarily with those affected and their loved ones,\" he posted on X.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Several killed after bus crashes into bus stop in Stockholm",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a217/live/b51ea9c0-c177-11f0-9e77-171133adaa3b.png"
      ],
      "datePublished": "2025-11-14T21:51:44.000Z",
      "dateModified": "2025-11-14T21:51:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Russian drone slams into block of flats in deadly wave of strikes across Kyiv",
    "url": "https://www.bbc.com/news/articles/cn4jn94gyllo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5536/live/5af93eb0-c14a-11f0-86a5-23e8532eb2d7.jpg",
    "tag": "World",
    "date": "2025-11-14T19:16:08.000Z",
    "description": "6 hours agoToby Luckhurst,In Kyiv and Ottilie Mitchell'Astonishingly lethal': James Landale reports from site of deadly Russian strikeA Russian drone ",
    "body": "6 hours agoToby Luckhurst,In Kyiv and Ottilie Mitchell'Astonishingly lethal': James Landale reports from site of deadly Russian strikeA Russian drone has slammed into a block of flats in eastern Kyiv, killing six people and wounding dozens of others, during a wave of strikes throughout the Ukrainian capital.As emergency workers sifted through the wreckage in the Lisovyi area, one Kyiv resident called Vita described how the drone had pierced the building, exploding on the other side.Meanwhile, Ukraine stepped up its attacks on Russia's oil infrastructure, with drone strikes on one of its biggest export terminals in Novorossiysk, on the Black Sea coast.Fire broke out at the Sheskharis oil refinery, and a ship and a block of flats were hit, officials said.Krasnodar governor Veniamin Kondratyev said three crew members and another man were hurt in the attack which damaged the main oil depot and a container terminal.Mayor Andrei Kravchenko declared a state of emergency and Reuters reported that oil exports were suspended.President Volodymyr Zelensky said Ukraine had fired long-range \"Long Neptune\" cruise missiles during its attacks on Russia overnight, without specifying what they targeted.ReutersKyiv fire service said the drone destroyed several floors of the entire block of flatsCondemning Russia's overnight attacks as vile and calculated, Zelensky said about 430 drones and 18 missiles had been launched and dozens of high-rise buildings damaged. \"This was a deliberately calculated attack aimed at causing maximum harm to people and civilian infrastructure,\" he said.A drone attack on a market at Chornomorsk in the south of the country killed two people.In Kyiv, residential buildings came under attack \"in practically every district\", the head of the city's military administration Tymur Tkachenko said on Telegram.He issued a warning to take shelter a minute after midnight local time on Thursday night, writing \"it's loud in Kyiv\".Watch: Kyiv air defences downing Russian drones and missiles during attackThe fire service in the Lisovyi neighbourhood said later the drone had hit the seventh floor of the residential building. When it exploded all the floors - from the eighth down to the fourth - collapsed, a spokesman told the BBC.Vita said she saw four bodies being pulled out of the apartment a few doors down from hers: \"I saw it with my own eyes.\"Two cranes hoisted emergency workers outside the block, as crews combed through the destroyed building, throwing broken sections of wall and shattered glass to the ground.Falling debris and fires damaged several high-rise apartment buildings, a hospital, school and administrative buildings, according to emergency services. Oleh Kiper/TelegramA drone killed at least two people at a market in Chornomorsk in southern UkraineMore than 40 people were rescued, they added, including 14 from a fire in a residential building. Another person was rescued after being pulled from beneath the rubble, they said.Kyiv's energy infrastructure was badly hit, leaving some buildings in the capital without heat, officials said. \"The attack was massive, with drones, with ballistic [missiles], with lots of air defence working,\" Ukrainian MP Lisa Yasko told the BBC. \"Very often there was the feeling that your bed was just shaking  together with the windows.\"Medical teams were deployed to all fires, officials said, while Mayor Vitali Klitschko said nine people were being treated in hospital with one man in an \"extremely serious condition\".ReutersWitnesses described how a Russian drone pierced the entire block of flats in Kyiv before explodingUkraine's air force warned drones and guided bombs had been targeting several other regions, including Sumy.The overnight strikes follow the deaths of six people in another Russian offensive less than a week ago that also damaged residential buildings and energy infrastructure. Russia says its attacks on energy targets - now a familiar part of the war - are aimed at the Ukrainian military, although Kyiv has long rejected that claim.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Russian drone slams into block of flats in deadly wave of strikes across Kyiv",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/5536/live/5af93eb0-c14a-11f0-86a5-23e8532eb2d7.jpg"
      ],
      "datePublished": "2025-11-14T19:16:08.000Z",
      "dateModified": "2025-11-14T19:16:08.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "US agrees deal to slash Swiss tariffs to 15% after golden charm offensive",
    "url": "https://www.bbc.com/news/articles/ce8zkrplpdyo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/16d3/live/881351f0-c0b0-11f0-8456-eff94716b162.jpg",
    "tag": "World",
    "date": "2025-11-14T17:59:25.000Z",
    "description": "7 hours agoImogen Foulkes,In Bern and Paul Kirby,Europe digital editorAPTrump was pictured on Monday apparently with the Swiss gifts on his desk in th",
    "body": "7 hours agoImogen Foulkes,In Bern and Paul Kirby,Europe digital editorAPTrump was pictured on Monday apparently with the Swiss gifts on his desk in the Oval OfficeSwitzerland and the US have agreed to cut President Donald Trump's steep 39% tariffs on Swiss imports to 15%, as part of a deal that involves a Swiss promise to invest $200bn (£150bn) in the US.\"It's a great relief for our economy,\" said Swiss Economics Minister Guy Parmelin, who said significant damage had been done since the additional tariffs had kicked in last August.Parmelin said a move by Swiss business leaders to meet Trump in the White House last week had proved \"decisive\" in reaching a deal. Industry chiefs visited the Oval Office, bearing gifts including a Rolex gold watch and a specially engraved gold bar from Swiss-based gold refining company MKS.Initial attempts by Swiss President Karin Keller Sutter to change Trump's mind had fallen on deaf ears. Trump said she \"was a nice woman, but she did not want to listen\".But after the 4 November encounter with Swiss business leaders, Trump revealed this week a deal was being worked on.US Trade Representative Jamieson Greer confirmed an agreement had been reached, saying \"President Trump's unmatched dealmaking continues to deliver for the American people\".The deal had involved very hard work, said chief trade negotiator Helene Budliger Artieda. Guy Parmelin said it would bring Switzerland into line with the 15% tariff rate negotiated with the US by its European Union neighbours.The economics minister said it involved the Swiss economy investing $200bn directly in the US by 2028. A third of that Swiss money will be invested in the US in 2026 under the deal.Switzerland has also agreed to axe tariffs on a quota of US meat exports including beef, bison and poultry.Greer said the deal \"tears down longstanding trade barriers\" and Swiss investment would bring thousands of new jobs.For Swiss industry, the deal could not come soon enough. Tech exports to the US are down 14.2% on the third quarter of last year, according to latest statistics - a dramatic fall since the tariff hike was imposed in August.The role of Swiss industrialists appears to have been key, and some particularly those trading in luxury goods, gold, or commodities, already had contacts in Trump's circle.In September, Trump appeared at the US Open tennis final in the Rolex VIP box hosted by the Swiss watch company's chief executive Jean Frédéric Dufour. MANDEL NGAN/AFPJean Frédéric Dufour and Trump stood together in the Rolex VIP box in New York in SeptemberThe president even asked if the Rolex CEO would have been there if Trump had not slapped such steep tariffs on Switzerland.Last week Dufour met Trump again, this time in the Oval Office, along with fellow business leaders including Johann Rupert from luxury goods maker Richemont and Marwan Shakarchi from MKS.Days after the meeting, Trump was pictured in the Oval Office with what looked very much like a Rolex \"Datejust\" desk clock, produced by the company as a collector's item, and worth tens of thousands of dollars.A White House official has confirmed to the BBC the two items were given to Trump.It is quite normal nowadays for visitors to the Oval Office to come bearing a gift.UK Prime Minister Sir Keir Starmer brought an invitation from King Charles for a lavish state visit. German Chancellor Friedrich Merz offered a framed copy of the birth certificate of Trump's German grandfather.BRENDAN SMIALOWSKI/AFPThe Rolex desk clock was pictured on Trump's desk on MondayThe US president receives thousands of gifts every year and they then become US property, deposited with the National Archives and filed annually by the state department. They are eventually transferred to a presidential library. Some gifts can be kept but presidents have to pay federal taxes if they do not come from a close relative.Swiss industry has been waiting for a deal with bated breath and a number of Swiss companies had warned they would have to furlough staff if nothing changed.Yves Bugmann, who heads the Swiss Watch Industry Federation, welcomed the deal after months of uncertainty. Asked what kind of investment the Swiss government might make in the US that would add up to $200bn, Helene Budliger Artieda said there was a detailed list that included pharmaceuticals, but she singled out plans for plane manufacturer Pilatus to build a big US plant and train-maker Stadler to expand its US operations in Utah.Gold refining is also part of the plan. \"Currently, Switzerland is the primary location for gold storage, and New York is the primary location for trading,\" said trade negotiator.The chief trade negotiator said it would take a few days or even weeks for the changes to come into effect.The agreement will only become binding when it receives approval from the Swiss parliament, and then it will be put to a referendum.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "US agrees deal to slash Swiss tariffs to 15% after golden charm offensive",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/16d3/live/881351f0-c0b0-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-14T17:59:25.000Z",
      "dateModified": "2025-11-14T17:59:25.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Pakistan's army chief gets more powers and lifelong immunity",
    "url": "https://www.bbc.com/news/articles/c9d6w1glz3qo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c1b3/live/af549250-c138-11f0-8717-7b6a6b2fefad.jpg",
    "tag": "World",
    "date": "2025-11-14T23:49:17.000Z",
    "description": "Pakistan's army has always been influential - now its chief has new powers1 hour agoCaroline DaviesPakistan correspondent, IslamabadEPAField Marshal M",
    "body": "Pakistan's army has always been influential - now its chief has new powers1 hour agoCaroline DaviesPakistan correspondent, IslamabadEPAField Marshal Munir, who has been army chief since November 2022, will now also oversee the navy and air forcePakistan's parliament has voted to give army chief Field Marshal Asim Munir new powers and lifetime immunity from arrest and prosecution, a move that critics say paves the way towards autocracy.The 27th constitutional amendment, which was signed into law on Thursday, will also make significant changes to the way the country's top courts operate.Those defending the changes say they provide clarity and administrative structure to the armed forces, while helping to ease a backlog in the courts. Pakistan's military has long played a prominent role in the nuclear-armed country's politics - sometimes seizing power in coups, and, on other occasions, pulling levers behind the scenes.Throughout its history, Pakistan has oscillated from more civilian autonomy to overt control under military leaders like General Pervez Musharraf and General Zia-ul-Haq. Analysts refer to the balance between civilian and military as hybrid rule.Some see the amendment as a sign that the balance is shifting in the military's favour.\"For me, this amendment is the latest indication, perhaps the strongest yet, that Pakistan is now experiencing not a hybrid system, but a post-hybrid system,\" says Michael Kugelman, director of the Wilson Center's South Asia Institute in Washington. \"We're essentially looking at a situation where the civil-military imbalance is about as imbalanced as it could possibly be.\"The latest amendment means that Munir, who has been army chief since November 2022, will now also oversee Pakistan's navy and air force.His field marshal title and uniform are for life and he will be given \"responsibilities and duties\" even after retirement determined by the president with the advice of the prime minister. The expectation is that this will give him a prominent role in public life for as long as he is alive.Supporters of the bill have argued it clarifies Pakistan's military command structure.Pakistan's government-operated news agency, the Associated Press of Pakistan, cited Prime Minister Shehbaz Sharif as saying that the changes were part of a broader reform agenda to ensure Pakistan's defence keeps pace with modern warfare requirements.But others see it as ceding power to the military.\"There is no balance between the military and the civilians,\" says Munizae Jahangir, journalist and co-chair of the Human Rights Commission of Pakistan.\"They have tilted again that power dynamic towards the military and empowered the military at a time when the military needed to be reined in.\"Getty ImagesPakistan's military has long played a prominent role in the nuclear-armed country's politicsNo 'independent space to operate'The second controversial area of change are the courts and judiciary.Under the amendment a new Federal Constitutional Court (FCC) will be created which will determine constitutional questions. The FCC's first chief justice and the judges that serve in it will be appointed by the president. \"It forever changes the shape and the nature of the right to a fair trial,\" says Ms Jahangir.\"The influence of the executive has increased not just in appointing judges but also constitutional benches. When the state is dictating the constitution of those benches then what hope do I have as a litigant of getting a fair trial?\"Arifa Noor, journalist and commentator, says: \"The judiciary is now quite subservient to the executive.\"The general consensus seems to be that the judiciary is now going to not really have any independent space to operate for the moment.\"Before this amendment was passed, the Supreme Court would hear and decide on constitutional cases. Some said this created a backlog of criminal and civil cases waiting to be heard as judges had to listen to constitutional arguments as well,  arguing that separating the two has helped smooth the court process.That has some traction with some lawyers, although Salahuddin Ahmed, a Karachi-based lawyer in the Supreme Court, sees that argument as disingenuous. He points out that the majority of cases pending in Pakistan are not in the Supreme Court.\"Statistically, if you were genuinely worried about making litigation quicker, you would focus on reforms for those cases.\"In the hours after the amendment was signed into law, two Supreme Court justices handed in their resignations.\"The constitution that I swore an oath to uphold and defend is no more,\" said Justice Athar Minallah in his resignation letter.Justice Mansoor Ali Shah said that the judiciary had been brought under the control of the government and that the 27th amendment had \"torn the Supreme Court to pieces\".Khawaja Asif, the defence minister, said of the resignations \"their conscience has awakened because their monopoly on the Supreme Court has been curbed and Parliament has tried to prove the supremacy of the Constitution\".Judges can also now be transferred to different courts without their consent. If they don't agree to the transfer, judges can appeal to the judicial commission and if their reasons for not moving are found invalid the judge would have to retire. Those in favour argue that this will ensure that courts in all areas of the country can be staffed, but some are worried it will be used as a threat.\"To pick a judge up from the province where he's been serving and take him to a different high court is something that will place them under further pressure to toe the government's line,\" says Mr Ahmed. He worries that the change will upset the balance in Pakistan.\"[Our judiciary] has collaborated with dictators in the past, but they've also sometimes nudged the executive. I think if you completely rob people of that hope, then that sends them into other, much uglier directions.\"Mr Kugelman agrees: \"Bottled-up grievances don't bode well for social stability.\"\"It does indicate a slide towards authoritarianism,\" says Ms Noor, adding that she sees the latest amendment as building on the 26th amendment, made last year, which gave lawmakers the power to pick Pakistan's top judge. There is already speculation of a 28th. \"It indicates that the balance of power is tilted in favour, heavily tilted in favour, of the establishment.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Pakistan's army chief gets more powers and lifelong immunity",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/c1b3/live/af549250-c138-11f0-8717-7b6a6b2fefad.jpg"
      ],
      "datePublished": "2025-11-14T23:49:17.000Z",
      "dateModified": "2025-11-14T23:49:17.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "China and Japan in escalating spat over Taiwan: What to know",
    "url": "https://www.bbc.com/news/articles/crklvx2n7rzo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a30e/live/a4b4b470-c13c-11f0-ae46-bd64331f0fd4.jpg",
    "tag": "World",
    "date": "2025-11-14T08:39:44.000Z",
    "description": "China summons Japan ambassador as war of words over Taiwan drags on16 hours agoKoh EweKyodo via ReutersJapanese prime minister Sanae Takaichi (left) m",
    "body": "China summons Japan ambassador as war of words over Taiwan drags on16 hours agoKoh EweKyodo via ReutersJapanese prime minister Sanae Takaichi (left) met with Chinese President Xi Jinping in South Korea on 31 OctoberChina has summoned the Japanese ambassador in Beijing over Prime Minister Sanae Takaichi's comments on Taiwan.China and Japan have been locked in an escalating war of words this week, set off by Takaichi's suggestion that Japan could respond with its own self-defence force if China attacked Taiwan.Both countries' foreign ministries have lodged serious protests with each other. A Chinese diplomat also made a comment which some interpreted as a threat to behead Takaichi. The spat touches on the historical animosity between China and Japan, as well as longstanding \"strategic ambiguity\" on the sovereignty of self-governed Taiwan.Here's what else you need to know about it:What happened? A timelineThe current tensions were sparked at a parliamentary meeting in Japan last Friday, when an opposition lawmaker asked Takaichi what circumstances surrounding Taiwan would count as a survival-threatening situation for Japan.\"If there are battleships and the use of force, no matter how you think about it, it could constitute a survival-threatening situation,\" Takaichi responded.A \"survival-threatening situation\" is a legal term under Japan's 2015 security law, referring to when an armed attack on its allies poses an existential threat to Japan. In such a situation, Japan's self-defence forces can be activated to respond to the threat.Takaichi's remarks drew immediate ire from Beijing, with China's foreign ministry describing them as \"egregious\".On Saturday, Xue Jian, China's consul general in the Japanese city of Osaka, reshared a news article about Takaichi's parliamentary remarks on X. But he also added his own comment that \"the dirty head that sticks itself in must be cut off\".While the intent of Xue's remarks \"may not be clear\", they were \"highly inappropriate\", Japan's chief cabinet secretary Minoru Kihara told reporters on Monday.Tokyo lodged protests with China over Xue's remarks, while Beijing lodged its own with Japan over Takaichi's.Xue's post has since been taken down - but the dust from the barbed exchanges hasn't settled yet.On Tuesday, Takaichi declined to retract her remarks, which she defended as \"consistent with the government's traditional position\". She did note, however, that she would be careful about commenting on specific scenarios from now on.Then on Thursday, China's foreign ministry posted in Japanese and English on its X account, warning Japan to \"stop playing with fire\" and added that it would be an \"act of aggression\" if Japan \"dares to meddles in the cross-Strait situation\".Chinese Vice Foreign Minister Sun Weidong also summoned the Japanese ambassador to China that same day to express their unhappiness.Sun called Takaichi's remarks \"extremely wrong and dangerous\" and demanded that Japan withdraw the comments, according to state media Xinhua. He also warned that \"otherwise all consequences must be borne by Japan\".Japan's ambassador explained that their position on Taiwan \"has not changed\" and refuted Beijing's remarks, Chief Cabinet Secretary Minoru Kihara told reporters on Friday. \"It is the consistent position of the Japanese government that we hope for a peaceful resolution of issues surrounding Taiwan through dialogue,\" he said during the daily news briefing.Kihara also added that Japan \"strongly urged China to take appropriate action\" over Xue's social media comment.A long history of animosityThere is longstanding animosity between the two countries, which can be traced back to a series of armed conflicts in the 1800s and Japan's brutal military campaign in China during World War Two.This was referenced in a statement released by China's Ministry of Foreign Affairs on Thursday when it said that \"should Japan fail to draw lessons from history and dare to take reckless risks, even resorting to military intervention in the Taiwan Strait situation, it will inevitably suffer heavy losses and pay a bitter price in the face of the iron wall of the Chinese People's Liberation Army\".Historical grievances have remained sore spots in bilateral relations ever since. But the recent ascension of Takaichi, a protégé of the late former prime minister Shinzo Abe, suggests more tensions may lie ahead.The conservative leader is pursuing closer ties with the US and has pledged to increase Japan's defence spending - raising some alarm in Beijing.Getty ImagesThe US and Japan have been deliberately ambiguous on how they would respond, should China invade TaiwanTakaichi is also famously hawkish on China and a longtime supporter of Taiwan. She had previously said that a blockade of the island could threaten Japan, and that Japan could mobilise its troops to stop a Chinese invasion.China is especially touchy about Taiwan, the self-governed island that Beijing claims as part of its territory. China has not ruled out the use of force to take Taiwan - a posture that has unsettled Taipei and its allies in the region.Earlier this month, Beijing accused Takaichi of violating the one-China principle, after she posted photos of herself meeting a senior Taiwanese official on the sidelines of the Apec summit in South Korea.Why Takaichi's recent comments caused such a stirThe Japanese prime minister's recent comments mark a departure from the equivocal position that the country has traditionally adopted on the status of Taiwan.This is in line with the policy of \"strategic ambiguity\" that the US has long maintained: remaining vague about what it would do to defend Taiwan in the event of a Chinese invasion.For decades, this ambiguity has kept China guessing - a form of deterrence - while leaving room for economic ties to flourish.The Japanese government's official stance is that it hopes the Taiwan issue can be resolved peacefully through dialogue - and Japanese officials have typically avoided mentioning Taiwan in public discussions about security.On the occasions where they have, they have been met with sharp rebuke from Beijing.In 2021, when then deputy prime minister Taro Aso said that Japan would need to defend Taiwan alongside the US in the event of an invasion, Beijing condemned his remarks and told Japan to \"correct its mistakes\".In this more recent flare-up, China's foreign ministry said that Takaichi's remarks were \"a gross interference in China's internal affairs\".\"Taiwan is China's Taiwan,\" ministry spokesperson Lin Jian told a press briefing on Monday, adding that China would not \"tolerate any foreign interference\" on the matter.\"What signal is the Japanese leader trying to send to 'Taiwan independence' separatist forces?\" he added. \"Is Japan up to challenge China's core interests and stop its reunification?\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "China and Japan in escalating spat over Taiwan: What to know",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/a30e/live/a4b4b470-c13c-11f0-ae46-bd64331f0fd4.jpg"
      ],
      "datePublished": "2025-11-14T08:39:44.000Z",
      "dateModified": "2025-11-14T08:39:44.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Alaa Abdel Fattah: Freed British-Egyptian activist not allowed to fly to UK, family says",
    "url": "https://www.bbc.com/news/articles/c397mldgrnjo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b777/live/ed5a0070-c148-11f0-8456-eff94716b162.jpg",
    "tag": "World",
    "date": "2025-11-14T11:31:12.000Z",
    "description": "14 hours agoDavid GrittenReutersAlaa Abdel Fattah celebrated with his mother, Leila Souief (left), and his sister, Sanaa Seif (right), following his r",
    "body": "14 hours agoDavid GrittenReutersAlaa Abdel Fattah celebrated with his mother, Leila Souief (left), and his sister, Sanaa Seif (right), following his release from prison in SeptemberBritish-Egyptian pro-democracy activist Alaa Abdel Fattah was stopped from flying to the UK by Egyptian passport control earlier this week, his family says.Mr Abdel Fattah, 43, was Egypt's best known political prisoner until seven weeks ago, when he was released from jail after being granted a pardon by President Abdul Fattah al-Sisi.He attempted to fly to London on Tuesday with his sister Sanaa, but was told by officials at Cairo International Airport that he was not allowed to travel. \"They blocked him from boarding the flight and I had to go alone,\" Sanaa told the BBC's Today programme on Friday. There was no immediate comment from the Egyptian government.\"They didn't explain much. Our lawyers in Egypt are trying to understand the legal grounds,\" Sanaa said. She added that her brother had his British passport as well as a recently renewed Egyptian passport.\"I assumed after the renewal of the Egyptian passport that he would be allowed.\"Alaa Abdel Fattah's 13-year-old son, Khaled, lives with his mother in Brighton, where he attends a special needs school because he is on the autism spectrum.Khaled spent a month visiting his father in Cairo following his release from prison, but he has now returned to the UK.\"We're really glad to have [Alaa] back in our lives partially free, but he needs to have freedom of movement to live with his son, reunited with him properly,\" Ms Seif said.She added: \"Khaled needs his father. My nephew… is very, very comfortable in his school and his set-up in Brighton. We can't change. We can't keep creating instability.\"Ms Seif said the UK Foreign, Commonwealth & Development Office had been communicating with her family over the issue, but she called on Prime Minister Sir Keir Starmer's office to also give it their attention.The FCDO said in a statement: \"President Sisi's decision to pardon and release Alaa Abdel Fattah was extremely welcome news and a significant step forward.\"\"We continue to press for his urgent return to the UK at the highest levels with the Egyptian government so he can be reunited with his family. The case remains a priority issue for the UK government.\"On Thursday night, Alaa Abdel Fattah and his mother were given the 2025 Magnitsky Award for \"Courage Under Fire\". Sanaa had to collect the award on their behalf.Mr Abdel Fattah rose to prominence during the 2011 uprising in Egypt that forced long-time President Hosni Mubarak to resign.He spent most of his time in prison after 2014, the year after Sisi led the military's overthrow of Egypt's first democratically elected president, Muslim Brotherhood leader Mohammed Morsi, following anti-government protests.While in power, Sisi has overseen what human rights groups say is an unprecedented crackdown on dissent that has led to the detention of thousands of people.In 2015, a court sentenced Mr Abdel Fattah to five years in prison for participating in an unauthorised protest.In September 2019, only six months after he had been released on probation, he was arrested again and held in pre-trial detention for more than two years.He was convicted in December 2021 of \"spreading false news\" for sharing a post about a prisoner dying of torture and handed another five-year sentence following a trial that human rights groups said was grossly unfair.His 68-year-old mother, Leila, launched a 287-day hunger strike last September 2024 to protest against his imprisonment. She lost more than 40% of her original body weight and was twice admitted to hospital in London.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Alaa Abdel Fattah: Freed British-Egyptian activist not allowed to fly to UK, family says",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/b777/live/ed5a0070-c148-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-14T11:31:12.000Z",
      "dateModified": "2025-11-14T11:31:12.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Second brother of French anti-drugs campaigner shot dead in Marseille",
    "url": "https://www.bbc.com/news/articles/c7v846p9nd1o?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/893c/live/2cb3c6e0-c14c-11f0-8bc9-0d0d258ea657.png",
    "tag": "World",
    "date": "2025-11-14T12:45:52.000Z",
    "description": "A young French campaigner, who set up an association to help victims of drugs violence and took their cause to President Emmanuel Macron, has lost a s",
    "body": "A young French campaigner, who set up an association to help victims of drugs violence and took their cause to President Emmanuel Macron, has lost a second brother to suspected criminal gangs in Marseille.Amine Kessaci's 20-year-old brother Mehdi was parking his car in the centre of the city, when a motorcycle drew up and the pillion passenger opened fire with a 9mm pistol.Their elder brother, Brahim, was murdered in 2020. He was shot and his charred body found in a burned-out car, a common method in gang killings known locally as a \"barbecue\".Marseille is renowned for worsening drugs wars, with rival gangs from high-immigration neighbourhoods in the north of the city battling over turf. While Amine's murdered elder brother, Brahim, was known to have become involved with drugs gangs, investigators say that was not true of Mehdi, who had ambitions to become a policeman. They fear the murder was a warning aimed at Amine.\"That hypothesis is absolutely not being ruled out,\" said Marseille chief prosecutor Nicolas Bessone on French radio.\"And if it turns out to be the case, it will mean we have crossed another threshold.  It brings back certain terrible periods in our country's history, when you went out and killed people simply because they were from a family with whom you had problems.\"After his elder brother's murder, Amine set up an association called Conscience, which aims to help young people in Marseille's poor estates to escape the clutches of powerful drugs gangs.He was a high-school student at the time, and then last year ran unsuccessfully for the Green Party in European and legislative elections. He recently wrote a book called Marseille Wipe your Tears – Life and Death in a Land of Drugs and now, aged 22, he lives under police protection after receiving death threats.\"It's just so sad for my friend and for his mother,\" said Christine Juste, a Green Party city councillor in Marseille.\"No mother should go through that — losing two children. And I'm so angry that in France's second city,  people can be murdered so easily in plain daylight.\"Vendettas spawn successions of revenge murders, with killers sometimes as young as 15. So far there have been 14 drugs-related murders this year.Amine Kessaci's association, Conscience, has branches in several other towns and cities. Its main activities involve providing help and advice to families who have lost sons in drugs violence, and creating links between ex-delinquents and employers.When he was 17, Amine was selected to meet Emmanuel Macron when the president came to Marseille in 2021 to discuss projects to improve life in the city.  A local newspaper dubbed him in its headline: \"The kid from the estates who has Macron's ear.\"Explaining his decision to run for election the young campaigner wrote in his book: \"Politics never held out its hand to me, so I decided to grab it by the throat. Brahim – it was you who threw me into politics the day you burned in a car.\"",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Second brother of French anti-drugs campaigner shot dead in Marseille",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/893c/live/2cb3c6e0-c14c-11f0-8bc9-0d0d258ea657.png"
      ],
      "datePublished": "2025-11-14T12:45:52.000Z",
      "dateModified": "2025-11-14T12:45:52.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "Black Ops 7: Call of Duty battles to stay on top",
    "url": "https://www.bbc.com/news/articles/cy9pwgqvr7go?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/eabc/live/b392cee0-c151-11f0-ae46-bd64331f0fd4.png",
    "tag": "World",
    "date": "2025-11-14T15:47:29.000Z",
    "description": "Call of Duty is back, and it's got a battle on its hands9 hours agoTom Richardson,BBC Newsbeat and Mel Ramsay,BBC NewsActivisionActress Kiernan Shipka",
    "body": "Call of Duty is back, and it's got a battle on its hands9 hours agoTom Richardson,BBC Newsbeat and Mel Ramsay,BBC NewsActivisionActress Kiernan Shipka takes a central role in Black Ops 7's campaignThere are some things you can always rely on, and a new Call of Duty game coming out each year is one of them.As one of the best-known names in video games, it's a series that needs little introduction.According to publisher Activision, it's sold an estimated 500 million copies, a movie adaptation is on the way, and despite having launched in 2003 it still reliably appears at - or near - the top of the annual bestseller charts.But this year the world's top military shooter might have a fight on its hands.Battlefield 6, which has been a huge hit for rival gaming giant Electronic Arts, has been drawing attention away from its veteran competitor.And long-time Call of Duty fans have been increasingly vocal over worries about the series losing touch with its roots.The clash of the multiplayer titans comes at an interesting time for the makers of Call of Duty, who've had to issue responses to fan concerns about the series losing its way.It has long offered players the chance to purchase \"operator skins\" that change their character's appearance. They're a frequent source of brand crossovers, and previous designs have been based on stars including footballer Neymar Jr, streamer NickMercs and rapper Nicki Minaj.But when Activision revealed skins based on 90s cartoon characters Beavis and Butthead earlier this year, there was a backlash.Fans accused the company of trying to mimic Fortnite, the ever-popular multiplayer game famous for its sometimes unlikely crossovers, which have included pop star Sabrina Carpenter and an AI-voiced Darth Vader in 2025.Activision said the feedback from fans \"hit home\" and that it took the complaints about the series losing its identity seriously.It's also being released after parent company Microsoft increased prices of its Game Pass subscription service by 20%, angering many players.ActivisionBlack Ops games thrust players into a world of espionage and conspiracyWhen BBC News sits down with lead producer Natalie Pohorski and senior comms director Stephanie Snowdon, they're keen to talk up Black Ops 7's single-player story campaign.The equivalent mode in Battlefield 6 was considered underwhelming by reviewers, and Call of Duty teams are renowned for their skill in crafting explosive set pieces in their narrative modes.Black Ops-themed installments of the series usually tell Hollywood blockbuster-style stories of secret agents uncovering vast conspiracies.Black Ops 7 is a direct sequel to 2012's Black Ops 2, set in 2035 and tells a story involving a global terrorist threat and a murky big tech company.Natalie says that the \"Black Ops identity\" allows the developers to explore themes that others can't.\"There's a lot of really interesting and timeless ideas... there's endless ways to explore them,\" she says.\"And then we ask a lot of questions that could apply to any era - questions of trust, can you believe what you're seeing?\" ActivisionMilo Ventimiglia takes over the role of hero David MasonBeing one of the biggest names in gaming also allows Activision to attract some big-name talent to Call of Duty projects.For Black Ops 7, that includes Kiernan Shipka, best known for her role in Netflix's Chilling Adventures of Sabrina, and This Is Us star Milo Ventimiglia.Kiernan tells BBC News she's aware of Call of Duty's huge profile, and the expectations of its fans.She says being involved was \"honestly more exciting than anything.\" \"I love a fandom,\" she says.\"And I think that when something over time garners such passion from fans, that means you're stepping into something really cool.\"The reaction is going to be what the reaction is going to be.\"If I let that stuff in, that's not a good thing.\" As someone who played Call of Duty when he was younger, Milo says he's also aware of the standards fans have.\"I mean, I hope I don't muck it up for anybody,\" he says. Asked whether he thinks players are getting \"fatigued\" with the annual series, he says Black Ops 7 won't disappoint.\"I think this one just blows the others out of the water completely in the storytelling and where we go,\" he says. But Call of Duty's campaigns, no matter how well-crafted or explosive they are, aren't the main reason players turn up for the series each year.The game owes its long-running success to the popularity of its multiplayer modes, and the performance of Black Ops 7 will be judged on whether they succeed.When they're asked if Battlefield's impressive player numbers affect their approach to development, Natalie and Stephanie insist they're only focused on making Black Ops 7 \"the best game it can be\".As for what it offers that Battlefield can't, Stephanie says, without directly comparing the two, that Call of Duty has \"variety and volume\" of experiences to offer.\"But more broadly, she says, \"I see games as a way for people to connect, to have fun. \"They are certainly responsible for some awesome relationships in my life.\"I hope that people continue to forge those connections and bonds and  relationships and there's just more of us playing games together in however many years from now.\"Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here.",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "Black Ops 7: Call of Duty battles to stay on top",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/eabc/live/b392cee0-c151-11f0-ae46-bd64331f0fd4.png"
      ],
      "datePublished": "2025-11-14T15:47:29.000Z",
      "dateModified": "2025-11-14T15:47:29.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  },
  {
    "title": "The 'bogan' Australian giving War & Peace an irreverent remake",
    "url": "https://www.bbc.com/news/articles/cx2lkjd2kmdo?at_medium=RSS&at_campaign=rss",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/397b/live/29b928b0-c145-11f0-8456-eff94716b162.jpg",
    "tag": "World",
    "date": "2025-11-14T22:00:42.000Z",
    "description": "3 hours agoLana LamSydneyAnder LouisAnder Louis has written a 'bogan' version of Leo Tolstoy's epic novel War & Peace\"Just then, Prince Andrei rocked ",
    "body": "3 hours agoLana LamSydneyAnder LouisAnder Louis has written a 'bogan' version of Leo Tolstoy's epic novel War & Peace\"Just then, Prince Andrei rocked up to Anna's joint. He was the pregnant sheila's hubby. Like his missus, he was pretty good looking himself.\"Those lines are straight from a new translation of Leo Tolstoy's epic novel War & Peace, set in the world of Russian high society in the early 19th century.Except this is a \"bogan\" version translated by Ander Louis, the pen name of a Melbourne IT worker who moonlights as a writer.He's poured a metaphorical can of Australian beer over the novel by converting Tolstoy's prose into a lingo that wouldn't sound out of place in the popular Aussie sitcom Kath & Kim.\"It's how you'd tell it down the pub,\" Louis, whose real name is Andrew Tesoriero, told the BBC.The 39-year-old started the project in 2018 as a joke, turning Russian princesses into \"sheilas\" and princes into \"drongos\", but is now on the cusp of signing a book deal.\"The number one reason I started doing it was to make me laugh, and I thought if it's making me laugh, maybe other people will too so let's put it out into the world.\"Bogan, a term which first emerged in Australia in the 1980s, initially meant an \"unsophisticated and uncultured person\" with negative connotations, but not for Louis.Getty ImagesLouis's version of Tolstoy's Russian classic describes nobles as 'sheilas' and 'drongos'\"I've never really thought of it as an insult, more a term of endearment,\" he says.And his version of the Russian literary masterpiece - which starts with the phrase \"bloody hell\" - is about being flippant and irreverent.\"It's just a good exclamation of surprise,\" Louis jokes.Elsewhere, a noble is a fair dinkum, while the death of an important character is announced by \"he's cactus\".\"It changes the tone quite significantly,\" Louis laughs.Accidental Tolstoy expertFor years, Louis avoided picking up War & Peace, set during the Napoleonic wars of the early 1800s, given its heft.The novel is divided into 15 books as well as an epilogue, which itself is split into two parts. With more than 1,200 pages to plough through, it's often regarded as the Everest of literature with prose as insurmountable as the famed peak.But in 2016, Louis joined an online community where participants pledge to finish the book in a year by reading at least one chapter – there are 361 – every day.He loved it so much, he did it twice.\"I became a bit of an accidental expert,\" he tells the BBC from Lilydale, on the outskirts of Melbourne.During this time, the part-time indie author was writing a novel with dark psychological themes so to lighten the mood, he started making War & Peace irreverent and funny.And for more than six years, Louis' project remained a little-known hobby he did in his spare time, self-publishing the first two translated books of War & Peace and selling a handful of copies.That all changed earlier this year when a New York-based tech writer stumbled across the bogan version, posting excerpts from Louis' book in which he describes Napoleon as an \"alright bloke\", the high-ranking Prince Vasili as \"a pretty big deal\" and Princess Bolkónskaya as \"smoking hot\".\"Out of nowhere, it just went berserk. Overnight, I sold 50 copies,\" Louis says.The father-of-two thinks the US interest in his bogan translation might be due to a \"Bluey effect\" given the popular Australian children's cartoon has been the most streamed show in the US for almost two years.\"Aussie-isms are in vogue over there at the moment\".How bogan became its own languageAt first glance Tolstoy's book, filled with the lives of rich, powerful Russians, seems worlds apart from modern-day Australia.But Louis argues bogan is the ultimate equaliser as the informal slang works across the social spectrum, whether it's in Australia or the world of Russian aristocrats.\"There's a whole lot of different types of bogan,\" Louis says.Mark Gwynn, a senior researcher at the Australian National University, who helps compile the Australian National Dictionary, agrees. \"Bogans can be wealthy, poor, or in the middle so it's more about the way they behave, dress, socialise and talk,\" he says.He says in more recent times, the term has also been used affectionately of someone considered a bogan or even in reference to oneself such as the term \"inner bogan\".And speaking \"bogan\" refers to casual speech with lots of local sayings, he says.\"Most Australians would know if you said 'speaks bogan' or 'bogan Australian' that the language would be highly informal with many slang and colloquial words and phrases, including uniquely Australian ones.\"But there's no direct translation for the term in proper English – it's uniquely Australian.\"Bogans can live in [both] rural and urban areas so they don't equate to hillbillies, bumpkins, yokels, rustics,\" Gwynn says.Nor are bogans the same as rednecks, as they can hold varied political views, while the British term \"chav\" – also typically used in a derogatory way to describe people from a poor background - doesn't apply either.Those shape-shifting bogan qualities along with Louis' varied resume - kitchen hand, energy analyst, Uber driver, punk rocker, Tokyo resident – makes him \"strangely qualified\" to create a bogan translation.Paul Dano as Pierre Bezukhov, Lily James as Natasha Rostov and James Norton as Prince Andrei in the BBC adaptation of War & Peace.\"When I'm drawing on voices, it's just quite genuinely from things I've seen and done… through all those different walks of life.\"Characters in his bogan version say \"g'day\", friends are \"mates\" and those with questionable ethics are deemed \"shonky\".Beautiful ladies are \"chicky babes\", with one so beguiling she's \"hot as a tin roof in Alice\" – a nod to the extreme heat of Alice Springs' desert landscape.One prince is an \"absolute true-blue legend\" whose vibrant eyes \"blazed like a bushfire\" while another is a \"bit of a yobbo\" who thinks others are \"carrying on like a pack of galahs\".While his version is peppered with plenty of profanity – which the BBC can't publish – part of the appeal is to make the book more accessible.\"The best feedback I've found is people saying how much easier it is to understand what's going on,\" he says.Louis likens himself to Pierre, the main protagonist in War & Peace, who represents the \"everyman\" as the illegitimate son of a rich aristocrat who inherits a huge fortune, catapulting him into Russian high society.He says he feels like he's the \"bumbling buffoon\" in the \"walled garden that is traditional publishing\" and that he's committed a kind of \"literary heist\".\"I've leaned over the fence… and just pinched the crown jewel - their most revered book - and taken it down the pub.\"And what would Tolstoy – who, though born a noble, later in life renounced his privileged upbringing and wealth – think of the bogan version?\"I actually think he would get a kick out it,\" Louis says. More weekend picks",
    "schema": {
      "@context": "https://schema.org",
      "@type": "NewsArticle",
      "headline": "The 'bogan' Australian giving War & Peace an irreverent remake",
      "image": [
        "https://ichef.bbci.co.uk/news/1024/branded_news/397b/live/29b928b0-c145-11f0-8456-eff94716b162.jpg"
      ],
      "datePublished": "2025-11-14T22:00:42.000Z",
      "dateModified": "2025-11-14T22:00:42.000Z",
      "author": [
        {
          "@type": "Person",
          "name": "Midnight Ink Staff"
        }
      ]
    }
  }
]